{
    "remaining_requests": 822,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Beasts-Little-Land-Novel/dp/B096YGKXC7",
    "body": {
        "name": "Beasts of a Little Land: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Beasts-Little-Land-Novel/dp/B096YGKXC7",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61OfsgeC1aL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Juhea Kim",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Juhea+Kim&search-alias=audible"
        },
        "brand": "Juhea Kim&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1115,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"A spectacular debut filled with great characters and heart.” (Lisa See, author of Snow Flower and the Secret Fan)A Recommended Read from: USA Today * The Washington Post * Entertainment Weekly * The Today Show * Real Simple * Good Morning America * Harper's Bazaar * Buzzfeed * Fortune * Vulture * Goodreads * Lit Hub * Book Riot * PopSugar * E! Online * Ms. Magazine * Chicago Review of Books * Bustle * The Oregonian * The MillionsAn epic story of love, war, and redemption set against the backdrop of the Korean independence movement, following the intertwined fates of a young girl sold to a courtesan school and the penniless son of a hunterIn 1917, deep in the snowy mountains of occupied Korea, an impoverished local hunter on the brink of starvation saves a young Japanese officer from an attacking tiger. In an instant, their fates are connected — and from this encounter unfolds a saga that spans half a century.In the aftermath, a young girl named Jade is sold by her family to Miss Silver’s courtesan school, an act of desperation that will cement her place in the lowest social status. When she befriends an orphan boy named JungHo, who scrapes together a living begging on the streets of Seoul, they form a deep friendship. As they come of age, JungHo is swept up in the revolutionary fight for independence, and Jade becomes a sought-after performer with a new romantic prospect of noble birth. Soon Jade must decide whether she will risk everything for the one who would do the same for her.From the perfumed chambers of a courtesan school in Pyongyang to the glamorous cafes of a modernizing Seoul and the boreal forests of Manchuria, where battles rage, Juhea Kim’s unforgettable characters forge their own destinies as they wager their nation’s. Immersive and elegant, Beasts of a Little Land unveils a world where friends become enemies, enemies become saviors, heroes are persecuted, and beasts take many shapes. Read more",
        "breadCrumbs": [
            {
                "name": "Audible Books & Originals",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_1?ie=UTF8&node=18145289011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18574426011"
            },
            {
                "name": "World Literature",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18574521011"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18574541011"
            },
            {
                "name": "Asian American",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=18574543011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 30 minutes"
            },
            {
                "name": "Author",
                "value": "Juhea Kim"
            },
            {
                "name": "Narrator",
                "value": "Sue Jean Kim, Raymond Lee"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "December 07, 2021"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B096YGKXC7"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#47,985 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #89 in Asian American Literature (Audible Books & Originals) #97 in Political Fiction (Audible Books & Originals) #347 in Asian American Literature & Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John Crouch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERFJ4NHTCHAPYFGCBHC7JU25YAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI3PXBIAECPMC?ASIN=B096YGKXC7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Good read",
                "reviewText": "Well written. Beautiful story. Loved it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cathryn Conroy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW6562N3JURITICBRTMOQFVZVDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R292DZNTCSDT8J?ASIN=B096YGKXC7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2022",
                "reviewTitle": "4.0 out of 5 stars A Profound and Haunting Novel About Korean History. But Beware! It's Slow-Going in the Beginning",
                "reviewText": "There are two types of readers: Those who finish a book—no matter what—just because they started it and those who give a book a few pages—10, 20, 50—and then give up if it's not that good. If you fall into the latter category, be cautious reading this novel by Juhea Kim. It's very slow-going until about one-third of the way through. That's about 135 pages for something that can feel like a slog at times. But then, almost like magic, the story picks up. While I wouldn't describe this book as \"riveting,\" it is still very good.This is a love story, mostly about the heartbreak of unrequited love. This is a story about the cruelty and vagaries of the most basic kind of human survival. This is a story about family bonds and tests of loyalty. This is a story about patriotism and honor. But most of all, this is the story of the Korean independence movement after decades of suffering under Japanese rule. Throughout the book, author Juhea Kim cleverly weaves into the story abundant symbols of the tiger—for courage, ferocity, strength, and ambition.Taking place from 1917 to 1965, the four main characters around which the story revolves are:• Jade Anh and Miss Lotus, who are little girls when they first meet in Pyongyang at a school for training courtesans. Lotus was born into it, while Jade's mother sold her into it and then told her to never return to her family because she would forever be a disgrace to them.• Nam JungHo, an orphan who migrates to Seoul with two pennies in his pocket and two mementos given to him by his dying father: a silver ring and a silver cigarette case. He survives by joining a gang.• Kim HanChol, a desperately poor rickshaw driver who is trying to better himself against almost insurmountable odds.This is a profound and haunting novel that is exquisitely written and cleverly uses the seemingly unimportant lives of the characters to tell the bigger story of history and politics. Just know that when you start this novel, it will probably take a while to really get into it.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kerry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVCAAAQUTGJUOAK6X6I6JR2I4WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REG4JXWDP3OXT?ASIN=B096YGKXC7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "5.0 out of 5 stars good story and history about Korea - great characters",
                "reviewText": "good story and history about Korea - great characters",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "roam mills",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENQZW5V3LMJJ5LJUVMYTSDUVAYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IYR568K324X7?ASIN=B096YGKXC7",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 4, 2022",
                "reviewTitle": "3.0 out of 5 stars Good Story Marred By Poor Editing",
                "reviewText": "Are there no editors anymore? This is a good story with well-drawn characters to lead the reader through years of personal and political upheaval. The main problem, which for this reader greatly disturbs the storyline, is the lack of decisions on either the writer's or the editor's part The story begins in 1917 and 1918. From the beginning there are trite phrases and modern speech that jar and break the continuity of the story. Surely there must be a way to express joy on a wedding night without saying \"Like I wouldn't even be mad (if I died tonight). The word \"like\" used this way is modern slang. There are many examples of this kind and it's too bad because the writer's story deserved closer editorial attention.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vicky",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG2PVHLPAVTJWAMEVQ22BB4PJPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTWMA4EABHP0J?ASIN=B096YGKXC7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 18, 2023",
                "reviewTitle": "4.0 out of 5 stars The Heart and Soul of Survivors During the Occupation of Korea in the 19th c",
                "reviewText": "The best and worse of the human condition when trying to survive is brought out in this beautifully written story set in Korea during the Japanese occupation and World War II. All the women, Jade, Lotus, and Dani in particular, are strongly written although some of the men supporting the story are not as multifaceted. The characters emote so many reactions within the reader to the different situations they find themselves in such as love, hate, anger, and compassion. Much is said about the meaning of life and death and provokes much thought. The first and final chapters wrap this novel so visually in the Korean landscape and is very magical. Highly recommend this novel to anyone who loves complex characters that face a reckoning in life and their choices will determine their life’s journey. The actual historical significance gives it context.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deborah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZCWYHNM7CYXNL3X7ZJCMFKKY3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TB2H2ALGRCYN?ASIN=B096YGKXC7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 2, 2022",
                "reviewTitle": "5.0 out of 5 stars The Story’s Still Reverberating",
                "reviewText": "I finished this book a few hours ago. Since I’m still fully immersed in the story and people, I wanted to jump in to add my own five stars. What a full, fascinating story! Ms. Kim has given life to nearly a dozen different characters, and despite my unfamiliarity with Korean and Japanese, I had no trouble keeping people straight. Her inclusion of both positive and negative traits within one character is wonderful. It gave me a lot to sit with, particularly given all the political turmoil going on in the world today. Ms. Kim really shines in subtly showing the ongoing influence from how we are raised, and including the points of view of different characters is fascinating. By the time the story comes to a close there’s no doubt that the tiger isn’t the only beast.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thierry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJDOR45TYYFYBLY5FH63XFCIEBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NEX29Q3CIKAJ?ASIN=B096YGKXC7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2022",
                "reviewTitle": "5.0 out of 5 stars A history lesson about Korea over a recent 35 year period",
                "reviewText": "What a beautiful novel. On one level, it's a history lesson about Korea from the first part of the 20th century, but done in such a way that it makes history come alive. On another level, it's several loves stories done over a long period of time, and great insights into the Korean people. On another level, it's written so well, that it's a joy from beginning to end.I purchased a hardback of the book and intend to read it again in the future. Would recommend Beasts to anyone seeking un understanding of an important portion of Korean history from the vantage points of different people from different levels of society, and different viewpoints concerning what it means to be Korean. 5 stars, all the way.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVV424BCZ2JZFR4ESXJHCBAXAVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KH876IHX59F1?ASIN=B096YGKXC7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 30, 2022",
                "reviewTitle": "4.0 out of 5 stars Good, But Not Gripping",
                "reviewText": "The book is interesting, but it does not flow as smoothly as I had hoped. I did, however, gain insight into the difficulties between the Japanese and Korean cultures and how the characters had to deal with these issues to survive and prosper.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 24, 2024",
                "reviewTitle": "Beau livre",
                "reviewText": "Arrive en bon état",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elisa Day",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 28, 2024",
                "reviewTitle": "Heartfelt journey",
                "reviewText": "Beautifully written, with wonderfully developed and memorable characters. The background of political turmoil in 20th century Korea and how it reflects on the lives of ordinary and extraordinary people. It is a deeply moving story, that shines through the complicated political context and complexities of societal and economical changes that follow our characters. Epic book with a soul.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AmazonShopper",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 6, 2023",
                "reviewTitle": "beautiful story",
                "reviewText": "I read this whilst on holiday in Japan and south Korea. Interesting read for a holiday that encompasses both countries and showed how much times have changed",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marloes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on June 19, 2023",
                "reviewTitle": "Love it",
                "reviewText": "I wanted to have this edition specifically and it didn’t disappoint. Beautiful paperback and beautiful book as well. Totally recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LauraLaura",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on June 5, 2023",
                "reviewTitle": "Travolgente",
                "reviewText": "La storia è ambientata in Corea, negli anni pre e post occupazione giapponese. Un intreccio sulle cortigiane coreane, militari giapponesi, la guerra, l'amore e l'amicizia. \"Beasts of a Little Land\" è un romanzo storico, in cui le vicende politiche e la lotta per l'indipendenza della Corea sono il cuore pulsante della trama. Juhea Kim esplora l'ideologia di una nazione occupante da un punto di vista oggettivo e a ciò aggiunge una trama appassionante che porta alla luce la condizione delle donne coreane in questo periodo storico.Il romanzo segue le vite di una ragazza di nome Jade, venduta all'età di dieci anni come apprendista a una cortigiana, e JungHo, un ragazzo povero che fa amicizia con lei. La storia, che inizia nel 1917 e termina nel 1965, si svolge sullo sfondo di un tumultuoso secolo di occupazione, fame e sconvolgimenti politici mentre i coreani bramano l'indipendenza. Lungo la strada incontriamo una vasta gamma di personaggi, tra cui ufficiali militari giapponesi, cortigiane famose, rivoluzionari comunisti e tigri.La storia di Jade è una storia di forza e sopravvivenza. La vita di JungHo è altrettanto difficile mentre si trasforma da piccolo criminale in rivoluzionario.Dalle stanze profumate di una scuola di Pyongyang ai caffè glamour di una Seul in via di modernizzazione e alle foreste della Manciuria, dove infuria la guerra, gli incredibili personaggi di Juhea Kim forgiano il proprio destino mentre scommettono su quello della propria nazione. Coinvolgente ed elegante, \"Beasts of a Little Land\" svela un mondo in cui gli amici diventano nemici, i nemici diventano salvatori, gli eroi vengono perseguitati e le bestie assumono molte forme diverse.In conclusione, un romanzo travolgente in cui un incontro casuale tra un cacciatore coreano e un membro delle forze militari giapponesi darà il via a una catena di eventi lunga cinquant'anni.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61NfYcqezDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61VLyQrRqRL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}