{
    "remaining_requests": 872,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Woman-Castello-Kelsey-James/dp/1496742915",
    "body": {
        "name": "The Woman in the Castello: A Gripping Historical Novel Perfect for Book Clubs",
        "price": "$10.29",
        "originalPrice": "",
        "rawPrice": 10.29,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Woman-Castello-Kelsey-James/dp/1496742915",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/814vKv3bc3L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kelsey James",
            "link": "https://www.amazon.com/Kelsey-James/e/B0BV5NYQQY/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 212,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for The Woman in the Castello\"James makes a dazzling debut with this gothic tale of intrigue and danger...With its sheen of ’60s Euro glamour, this is irresistible and satisfying. James is certainly one to watch.\" —Publishers Weekly, STARRED REVIEW “A young actress desperate for stardom agrees to film a horror movie in her aunt’s crumbling Italian castle. Then the aunt disappears. What secrets lurk in her past—and in the mysterious lake behind the castle? The Woman in the Castello is a thoroughly original blend of mystery, family drama, and sultry romance, all unfolding in the fast-paced world of a Swinging Sixties movie set. A riveting debut from author Kelsey James!” —Elizabeth Blackwell, bestselling author of Red Mistress“The 1960s in Rome, a crumbling Italian castle on the edge of a volcanic lake, a glamorous aunt she’s never met, and a starring role in a horror movie that begins to feel a bit too real…Kelsey James’s debut novel is a delicious Gothic filled with atmosphere, twists, romance, and dark secrets. Readers will devour it.”—Megan Chance, bestselling author of A Splendid Ruin“Like Jess Walters's Beautiful Ruins, the glamour and heady indulgence of the era take center stage in this captivating, multilayered story that will keep you guessing to the end. Silvia and Gabriella are flawed, fascinating characters who will linger in your mind long after the book is closed.” —Susan Wiggs, # 1 New York Times bestselling author “Mystery, romance, and an enchanting cast of characters with a plucky heroine at its heart. Against the richly drawn backdrop of post-war Italy, in a castle brimming with secrets, Kelsey James explores the enduring and sometimes destructive power of love, family, and ambition.” —Amanda Skenandore, author of The Nurse’s Secret“Cinematic and spooky, there is something for everyone in this gripping historical novel that expertly blends a love story with family drama and a twist of suspense. Readers will be swept up in the glamorous—and sometimes grungy—1960s movie scene, and the magnificent setting is sure to inspire many a trip to Italy. A delight for the senses and a truly entertaining story!” – Nicole Baart, bestselling author of Everything We Didn’t Say\"You’ll get lost in the pages of this lush, entertaining story as you follow aspiring actress Silvia Whitford through the dark towers and crumbling staircases of a remote Italian castle, where she uncovers twists and turns around every corner, including shocking family secrets you’ll never see coming.”—Ellen Marie Wiseman, New York Times bestselling author of The Lost Girls of Willowbrook“An impromptu movie set in a medieval castle in 1960s Italy provides a fascinating backdrop for this fresh gothic tale filled with mystery, family secrets, and unexpected romance.” —Lorena Hughes, author of The Spanish Daughter “From the moment a stunning 1960s Italy kisses your hand and draws you into the opening pages of this novel, you’ll be riveted to The Woman in the Castello. Mysterious, stimulating, intoxicating … a dark, rich caffe corretto of a novel.” —K.D. Alden, author of A Mother’s Promise “Cinematic and spooky… There is something for everyone in this gripping historical novel that expertly blends a love story with family drama and a twist of suspense. Readers will be swept up in the glamorous—and sometimes grungy—1960s movie scene, and the magnificent setting is sure to inspire many a trip to Italy. A delight for the senses and a truly entertaining story!” —Nicole Baart, bestselling author of Everything We Didn’t Say “A tantalizing mixture of romance, mystery, and the Gothic enfolded in a well-crafted plot that pays homage to the long lineage of ghostly tales, romantic and suspense.” —V.S. Alexander, author of The War Girls “The Woman in the Castello comes with all the trappings of the Gothic: a beautiful but dilapidated and forebodingly remote estate, collapsing boundaries between reality and fantasy and dream, and secrets that will not stay secret. Kelsey James crafts in Silvia, a young actress starring in her first film, an exciting new take on the Gothic heroine… James has given us a beautiful work of historical fiction and Gothic horror, and an impassioned love letter to Italian horror cinema” —Jenn Jordan, Syosset Public Library (Syosset, NY) “From page one you are in Italy, and even better, Rome in the 1960s… with the excitement of making a film and the tension of keeping secrets… as old mysteries unfold and new ones build, Kelsey James takes you through a perfect blend.” —Kira Wizner, Merritt Bookstore (Millbrook, NY) “A little mystery, a little ghost story, and a whole lot of family. Reading this fun novel feels like watching an art house movie filled with color and theatrics. Grab some popcorn and let yourself be transported.\" —Mary Webber O’Malley, Skylark Bookshop (La Grange Highlands, IL) “A young unwed mother determined to support her daughter and her dying mother…a movie production beset by problems and Hollywood drama…a crumbling lakeside castle haunted by the past, by family secrets – and by, perhaps, a ghost? Toss in a mid-’60s Italian setting and a steamy romance, and you have the perfect addition to your beach bag this summer.” —Laurie Walters, Brighton District Library (Brighton, MI) “1960’s Italy: a horror film being filmed in a crumbling, possibly haunted, castle owned by the estranged aunt of the leading starlet. What could be better? As the lines between reality and the movie plot begin to blur in this tautly written novel, family secrets begin to emerge that if revealed, might lead to unforeseen, and possibly deadly, consequences for everyone.” —Jennifer Winberry, Hunterdon County Library (Flemington, NJ) About the Author Kelsey James is a historical fiction author and content marketer whose work has appeared in Conde Nast Traveler, Insider, ABC News, and The Huffington Post, among other outlets. A graduate of Dartmouth College with a degree in Creative Writing and Classical Studies, she currently lives with her family outside New York City and can be found online at KelseyJamesAuthor.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 50 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“You'll get lost in the pages of this lush, entertaining story.” —Ellen Marie Wiseman, New York Times bestselling author of The Lost Girls of WillowbrookPerfect for readers of Silvia Moreno-Garcia and Kate Morton, this sophisticated, atmospheric debut spins a bewitching web of ruthless ambition, family secrets, and the consequences of forbidden love, as an ambitious American actress snags the starring role in a mysterious horror movie shooting on location in a crumbling medieval castle outside Rome…Rome, 1965: Aspiring actress Silvia Whitford arrives at Rome’s famed Cinecittà Studios from Los Angeles, ready for her big break and a taste of la dolce vita. Instead, she learns that the movie in which she was cast has been canceled. Desperate for money, Silvia has only one choice: seek out the Italian aunt she has never met.Gabriella Conti lives in a crumbling castello on the edge of a volcanic lake. Silvia’s mother refuses to explain the rift that drove the sisters apart, but Silvia is fascinated by Gabriella, a once-famous actress who still radiates charisma. And the eerie castle inspires Silvia’s second chance when it becomes the location for a new horror movie, aptly named The Revenge of the Lake Witch—and she lands a starring role.Silvia immerses herself in the part of an ingenue tormented by the ghost of her beautiful, seductive ancestor. But when Gabriella abruptly vanishes, the movie’s make-believe terrors seep into reality. No one else on set seems to share Silvia’s suspicions. Yet as she delves into Gabriella’s disappearance, she triggers a chain of events that illuminate dark secrets in the past—and a growing menace in the present…\"Like Jess Walters's Beautiful Ruins, the glamour and heady indulgence of the era take center stage in this captivating, multilayered story that will keep you guessing to the end.\" –Susan Wiggs, # 1 New York Times bestselling author\"Mystery, romance, and an enchanting cast of characters with a plucky heroine at its heart. Against the richly drawn backdrop of post-war Italy, in a castle brimming with secrets, Kelsey James explores the enduring and sometimes destructive power of love, family, and ambition.\" –Amanda Skenandore, author of The Nurse's Secret",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Arts & Photography",
                "link": "https://www.amazon.com/Arts-Photography-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1"
            },
            {
                "name": "History & Criticism",
                "link": "https://www.amazon.com/Art-History-Arts-Photography-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1064"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Kensington (July 25, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 288 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1496742915"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1496742919"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.65 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#109,174 in Books (See Top 100 in Books) #1,629 in Psychological Fiction (Books) #2,488 in Family Life Fiction (Books) #4,060 in Psychological Thrillers (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 212 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bc0071ae-47ce-40bc-8ad3-ed0199e02860.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6fc4ef04-33dc-4714-8f26-6368662a21a3.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95859847-ee06-484d-ae70-f943d4aa441c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dragon'sDen (el Jefe)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3HD2KHSGYVJC5V2VCN4EMAI73Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35P6MQBP25BN?ASIN=1496742915",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Probably one of the best books on Amazon",
                "reviewText": "Surprisingly, very well-written.The story is not very complex or intriguing, but what is done right is the character development and experience.This book succeeds in building a rich character and conflict, which keeps it interesting, with increased stakes and layers.I can definitely say this is one of the better books I've read off Amazon.And this is not even my genre.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jinna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG2OYV6TLHXCJAORDPVIIK6SM7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R45MK60OUWO3T?ASIN=1496742915",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "4.0 out of 5 stars RM Book Club",
                "reviewText": "Not a five. It has some good plot twists. I was reading it for a book club. I probably would not have read it otherwise.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris Vaughn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVAZZGTGHGTW77CBKFBNW3GCUGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q8U4LZSACDOC?ASIN=1496742915",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "3.0 out of 5 stars Enjoyable read",
                "reviewText": "This book was kind of like a made for TV story, but it did take twists and turns that I was not expecting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3KGYMHXXK63BV3FGF726QO6WIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35ARI6A1I0N8T?ASIN=1496742915",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic Plot",
                "reviewText": "It felt like the book pulled me in further each step of the way. My mind was trying to guess what the next step was often and the book delivered surprising twists. I would highly recommend this enjoyable read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deana M. Brower",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQKWDRK3D5MW6CEZMI2VEZHXX2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PWOKE08OGTHQ?ASIN=1496742915",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2023",
                "reviewTitle": "4.0 out of 5 stars Excellent Debut",
                "reviewText": "This was an excellent debut novel. The setting of 1960’s Italy was intriguing. This historical thriller was right in my wheelhouse. The author did a great job of making this a slow burn while keeping me interested and wanting to keep reading. The twists of the mystery along with the romance and family dynamics were intertwined perfectly. I enjoyed the characters as well as the plot.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "notafan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6P54R2YC6BL6KV7NGYMGQX2WMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R305M3W6ORR4GK?ASIN=1496742915",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Haunting and Atmospheric",
                "reviewText": "I have to say, I thoroughly enjoyed this novel by Kelsey James. I say that as The Woman in the Castello is not my typical genre that I read but picked it up mainly because of the evocative cover. Every time it popped up in my feed on social media or Amazon, it captured my eye - and I'm glad it did.I'm not one for rehashing a book's synopsis in a review, so will dive right in a give my thoughts on why I loved this novel. First and foremost, Kelsey brings the setting of a small Italian village and the castle in which the story takes place, to full life. She creates an atmosphere of Italy in the 1960s that entices and permeates throughout the story.The characters are very well realized, especially our heroine, Sylvia. I loved that she wasn't as strong and secure in herself as she thought she was. She might try to present as worldly and self-assured but we, the readers who are in her thoughts, know it's an act and she's truly vulnerable and insecure and untrusting. Not your typical heroine and I liked that and could relate.The story, itself, is interesting and kept me engaged and curious and I even played detective a bit trying to solve the central mystery. No spoilers here, of course but let's just say I did not see the ending coming!Well-done all around but what will stay with me is that haunting evocative atmosphere that has me wanting to book a trip to Italy! Not sure I'll be staying at a haunted castle anytime soon, though!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Annette Denehy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3BACHQ6QQW4765UTKHA6L5QHXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J0DC04NZW254?ASIN=1496742915",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Thrilling, page turner. Excellent effort from first time author.",
                "reviewText": "I’m giving this 5 stars because I cannot believe how good it was since it was the author’s first book. I had some expectation that I would like it, but I didn’t think I would love it because it is not the sort of book that I normally read. I used to be an avid reader, but then life got busy, husband, house, work, kids, so I don’t get to read books as much as I used to. Now that I’m somewhat of an empty nester (one child leaving for school, one just returned), I was able to spend quality time with this book. It was quite the page turner, I was eager to see what was going to happen next. Having a family connection to Italy, I just loved the setting and the descriptions of Italy and the native Italians. I throughly enjoyed this book and I look forward to the next one from this author.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alix",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEN4PEIQ2S5CAE4QBY75LSSJADCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QMC70QH9FSN9?ASIN=1496742915",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2023",
                "reviewTitle": "3.0 out of 5 stars Entertaining at times but I struggled with the writing",
                "reviewText": "I loved the Italian setting of The Woman in the Castello. It’s set in a crumbling castle on the edge of a volcanic lake that’s rumored to be haunted. I liked the horror and giallo references and I personally could have done with more giallo elements in this story. The first half of the book was quite slow but things do ramp up in the second half. It was fairly obvious who the villain was but I was definitely surprised by some of the details of the mystery.But there were some things that didn’t work for. For one, our protagonist drove me nuts. She was constantly whining and throwing out accusations at everyone. I also struggled with the prose of this book. The writing is rather stiff and the author was constantly telling us what was happening rather than showing. The characters are also incredibly flat and one-dimensional. There is a romance element which I think worked fine but it wasn’t anything that exciting. Overall, this gothic story was entertaining at points but as a whole it was a bit of a let-down for me.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}