{
    "remaining_requests": 868,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Office-Historical-Corrections-Novella-Stories/dp/0593189450",
    "body": {
        "name": "The Office of Historical Corrections: A Novella and Stories",
        "price": "$12.49 $2.79",
        "originalPrice": "$17.00",
        "rawPrice": 12.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Office-Historical-Corrections-Novella-Stories/dp/0593189450",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/718BvJwW4eL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Danielle Evans",
            "link": "https://www.amazon.com/Danielle-Evans/e/B003B8L0AW/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by SFBayGoodwill.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1491,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for The Office of Historical Corrections:“No other fiction I’ve read this year wears its profundity so lightly.” —The New Yorker“Evans’s stories and their sensitivity to issues around race and power feel particularly resonant in 2020.” —The New York Times “The title novella manages to combine George Orwell’s bureaucratic chill from 1984 with Toni Morrison’s elegant judgments from Beloved.” —The Washington Post “Perceptively touch[es] on current controversies like cancel culture and the disputes over historical monuments. But these are, first and foremost, character-driven stories, and the arguments play out most forcefully in the minds of the young black women searching for some livable balance between guilt and forgiveness. . . . Ms. Evans is also funny in a droll, puncturing way, as inclined to mine trauma for mordant humor as for sentimentality.” —The Wall Street Journal“Evans’s propulsive narratives read as though they’re getting away with something, building what feel like novelistic plots onto the short story’s modest real estate. No surprise, then, that this collection concludes with its title novella, about a Black professor who quits her job to work for the city government, correcting factual mistakes in the public record. The story marries Melvillian mundanity with melodramatic suspense. I could have kept reading for pages.” —The New York Times Book Review“[Evans is] a master of the form, and her new collection is a sharply observed and perfectly aligned universe. With wry observation and an ear for the inner and outer monologue, Evans vividly creates microclimates that examine the ponderous nature of grief, the infinitesimal line between micro- and macroaggressions, and the fog of relationships. An essential read.” —Elle “Evans is a writer with a gift for the sudden knife in the ribs. . . . I hurtled through these stories and ended each one gasping back tears.” —The Huffington Post “These stories offer the lose yourself depth of a novel in intense, digestible portions. Evans is blessed with perfect pitch when it comes to dialogue—both in terms of what is spoken and what goes unsaid.” —Tayari Jones in The Guardian (London) “[A] collection for the moment. Evans skillfully interprets cancel culture, fake news, and political cults in order to craft a unique critique of the country’s underlying racism. The success of the collection stems from balancing the gloom of racism with Evans wry commentary. The snarky narrative voice cuts deeply. These stories are now even more necessary.” —Chicago Review of Books “Danielle Evans’ dynamite new collection proves a study in the form. Slices of life, each piece in Corrections captures its own mood, hums to distinct rhythms, and locates unique spaces for empathy and pain and catharsis. They’re also delectably readable, propulsive accounts of loss and fear and redemption that twist with O. Henry–level glee. . . . The titular novella [is] a masterpiece of tension and mystery.” —Entertainment Weekly “These scorching stories . . . take a headlong plunge into the murky waters of identity, race, and love.” —O, The Oprah Magazine “A new collection so smart and self-assured it’s certain to thrust her into the top tier of American short story writers. . . . The hands-down masterpiece of the collection is the title novella. . . . a deftly plotted mystery that . . . thrillingly leaves the big reveal to the very end . . . Reading these stories is like that amusement park ride—afterward, you feel a sense of lightness and exhilaration.” —USA Today “Danielle Evans’ unrelenting wit and compassion are on dazzling display.” —Star Tribune “Every story in The Office of Historical Collections is on point. . . . but the ancestral thriller novella that spawned its title is completely transformative.” —Vulture “Evans calmly and expertly navigates the limits and possibilities of short stories. . . . [The novella] combines uncommon storytelling with rare wisdom. . . . worth the wait.” —Los Angeles Times “ The Office of Historical Corrections,’ a novella, is presented here along with other stories that chronicle how history—racial and cultural—continue to reverberate through daily life. Danielle Evans continues to write provocative fiction about people of color, raising questions about who gets to dictate our national narrative.” —Chicago Tribune “One of the year’s most timely releases. Examining second chances and no-win situations, Evans’ new book brings plenty of pondering to your nightstand this fall.” —Bustle “Danielle Evans’s newest book further solidifies her well-earned reputation as one of the most incisive, resonant writers working today. . . . Evans will really blow your mind, leaving you to put the pieces back together.” —Refinery 29 “The title story, a novella . . . is the most astonishing thing I’ve read this fall.” —BuzzFeed, “21 Best New Books this Fall” “In seven sly, haunting stories, Evans reflects our madcap world back at us, delivering a dazzling dissection of our twisted attitudes about race, culture, history, and truth. . . . Incisive, nuanced, and deliciously complex, each of these stories proves that Evans is a bravura talent.” —Esquire “Evans is back with another collection of short stories that prove she is one of the most powerful voices in the genre. . . . Prepare for this provocative novella to stay with you long after you reach the final page.” —E! News “Danielle Evans’s characters are so messy, compelling, and deeply human that you won’t be able to turn away.” —Harper’s Bazaar “A piercing look at race and culture, revealing how we all must reckon with our personal and shared histories.” —Real Simple “Evans tackles her characters’ fragility, fear, and bravery with breathtaking nuance and storytelling smarts.” —Apartment Therapy “Evans doesn’t hold back in her timely, engrossing, and powerful new collection of short stories about race, history, grief, and culture. It’s one of the best short story collections of the year.” —HelloGiggles “The stories are bite-sized, but you might devour this in one gulp.” —Good Housekeeping “The Office of Historical Corrections is a collection of stories and a novella, all dealing with complex issues of race and Black womanhood. But the standout is the titular novella, which imagines a government department that is mandated to correct historical inaccuracies.” —Alma “Danielle Evans demonstrates, once again, that she is the finest short story writer working today. These stories are sly and prescient, a nuanced reflection of the world we are living in, one where the rules are changing, and truth is mutable and resentments about nearly everything have breached the surface of what is socially acceptable. These stories are wickedly smart and haunting in what they say about the human condition. . . . Her language is nimble, her sentences immensely pleasurable to read, and in every single story there is a breathtaking surprise, an unexpected turn, a moment that will leave you speechless, and wanting more.” —Roxane Gay, The New York Times–bestselling author of Difficult Women and Bad Feminist “Danielle Evans is a stone-cold genius, in possession of both a merciless eye and a merciful heart. And she keeps getting better.” —Rebecca Makkai, National Book Award finalist for The Great Believers “A dazzling collection. Contemporary life in Danielle Evans’s stories has a kind of incandescent and dangerous energy: even in moments of somberness or isolation, her characters crackle with heat, light, and self-awareness.” —Kelly Link, author of Get In Trouble “To say that Danielle Evans is one of the best writers of her generation ignores the simple fact that she is one of America’s best writers, period. And to limit her to her own generation overlooks the keen eye Evans has placed on the continuum of American history and all its attendant complications of race, gender, class, popular culture, and representation. Evans wields these issues like a sly, acerbic blade, and she uses it to cut to the quick.” —Wiley Cash, The New York Times–bestselling author of The Last Ballad “Danielle Evans writes stories that make the world stop. Her work is so good that when you sit down with it, everything else ceases to exist. The stories in The Office of Historical Corrections move and breathe. The book is a beating heart. Magnificent.” —Kristen Arnett, The New York Times–bestselling author of Mostly Dead Things “[P]romises more of Evans’ wisdom and finely honed ability to tell distinct, compelling tales that also say something about larger issues.” —BookPage “Evans solidifies her reputation as one of the most thought-provoking contemporary storytellers. . . [she] crafts her stories with a surgeon’s precision. Each detail meticulously builds on the last, leading to satisfying, unforeseeable plot twists. The language is colorful and drenched with emotion. Readers won’t be able to look away from the page as Evans captivates them in a world all her own.” —Booklist, (starred review) “The eponymous novella that closes the book is a stunner. . . . storytelling [is] gripping on every level. Necessary narratives, brilliantly crafted.” —Kirkus Reviews (starred review) “Danielle Evans brings her usual wit and keen eye to her latest. . . . While every story offers a discrete narrative, recurring themes of pain, loss, fear, and failed relationships give the collection a sense of unity. The title novella is the crowning jewel. . . . this is a timely, entertaining collection from a talented writer who isn’t afraid to take chances.” —Publishers Weekly About the Author Danielle Evans is the author of the story collection Before You Suffocate Your Own Fool Self, winner of the 2021 Joyce Carol Oates Prize, the PEN America PEN/Robert W. Bingham prize, the Hurston/Wright Legacy Award, and the Paterson Prize, and a National Book Foundation 5 under 35 honoree. Her stories have appeared in many magazines and anthologies, including The Best American Short Stories. She teaches in The Writing Seminars at Johns Hopkins University. Excerpt. © Reprinted by permission. All rights reserved. Happily Ever After When Lyssa was seven, her mother took her to see the movie where the mermaid wants legs, and when it ended Lyssa shook her head and squinted at the prince and said, Why would she leave her family for that? which for years contributed to the prevailing belief that she was sentimental or softhearted, when in fact she just knew a bad trade when she saw one. The whole ocean for one man. Not that she knew much about the ocean; Lyssa had been born in a landlocked state, and at thirty it seemed the closest she might get to the sea was her job working the gift shop in the lobby of the Titanic. It was not a metaphor: it was an actual replica of the Titanic, with a mini museum on the lower level, though most of their business came from weddings and children's birthday parties hosted on the upper decks. The ship-shaped building was a creation of the late nineties, the pet project of an enterprising educational capitalist who wanted to build an attraction both rigorous in its attention to historical detail and visually stunning. To preserve history, he said to the public; to capitalize off of renewed interest in the disaster, he said to his investors. He had planned to build to scale, but that plan hadn't survived initial cost estimates. They'd only ever had a quarter of the passenger rooms the actual Titanic had, and most of those rooms were now unfurnished and used as storage closets, their custom bed frames sold secondhand during the last recession. At the end of the summer season, a second-tier pop star rented the whole structure for a music video shoot, shutting down normal operations for three full days. Lyssa had been planning on having the time off, but when the video's director came to finalize the plans for the space, he'd stopped in front of the shop glass, stared for a minute, then walked in and said, \"You-you're perfect.\" She agreed to remain on-site for the filming and canceled the doctor's appointment she'd already rescheduled twice, giving herself in her head the lecture she imagined the doctor would have if he answered his own phone. Her coworker Mackenzie sulked around the ship for the rest of the afternoon, flinging herself into the director's line of vision without success. Mackenzie sometimes worked the gift shop counter with her, but only sometimes. Whenever there was a princess party, Mackenzie wore the costume dress and chaperoned as the princess-on-deck. Lyssa never worked parties; the one time anyone had bothered to give her an explanation for this (she hadn't asked), it was a supervisor who mumbled something about historical accuracy, meaning no Black princesses. \"We'd hate for the six-year-olds having tea parties on the Titanic to get the wrong idea about history,\" Lyssa said, so straight-faced that the supervisor failed to call her out for attitude. \"I guess they must want diversity,\" Mackenzie said after the director left, using air quotes for diversity even though it was the literal word she meant. The next day, and, as Mackenzie went, genuinely conciliatory: \"Maybe he wants to fuck you? He was cute, in a New York way. I bet he thinks you're exotic.\" Exotic, not so much: the theme of the music video was sea monsters; everyone in it, including the pop star and Lyssa, would be painted with green body paint and spritzed with shimmer and filmed through a Vaseline lens that would add to the illusion that they were underwater. The pop star didn't want a ship; she wanted a shipwreck. Lyssa was just supposed to wear her regular uniform and work the counter and be herself in costume makeup. Most of the real action took place on the upper decks. In two days of shooting, Lyssa only saw the pop star from a distance, through the glass, but a longtime backup dancer gossiped about her during a coffee break. The pop star dedicated this video to an ex who told a tabloid she'd let herself go and looked like a monster in recent photos. The video was about letting herself go, appearing on screen green and fat and nearly naked. The pop star was thinner than Lyssa had ever been in her life. Lyssa understood why she'd been picked and not Mackenzie; they needed someone in the store who could look like she knew what she was doing behind the counter. She was backdrop. But the director did, apparently, also want to fuck her, though it seemed as much an afterthought as anything, the kind of whim that came to the kind of man who always wanted to fuck somebody. When they weren't filming, the pop star and her assistant and her dancers traveled together like a swarm of fireflies, and the director and the tech crew and the hair and makeup artists were left to less glamorously fend for themselves. After they'd shut down for the second day, Lyssa's last day of filming, the director appeared as she was locking up the store and asked if she wanted a drink. \"OK,\" she said. \"I haven't been here long enough to find a good bar, but I've got a great bottle of Scotch back at the hotel,\" he said. Lyssa saw the opening. She had been here all her life. She could tell him where a good bar was. She did not. In the hotel bathroom she scrubbed off the stubborn lingering bits of the green makeup and tried to look as respectable as a woman about to fuck a stranger could. When she came out, he had poured them drinks and didn't seem to notice she was fully human colored again. She took a sip and put the drink down and he reached for her hand, turned her palm over, and began to trace something in it. \"Are you trying to tell my fortune?\" she asked. \"I wasn't,\" he said. \"But I have a lucky guess that you're about to make a man very happy.\" It was so gross it was almost endearing. The first time, they used the condom in the hotel's romance kit, which consisted of a single condom and a package of after-dinner mints in a tin adorned with a rose sticker. The second time he pulled out, and the third time he didn't. \"Was that OK? I mean I know I'm safe,\" he said, a sentence that in her experience, men who were in any capacity actually safe never had to say out loud. \"But are you on something?\" \"You don't have to worry about that,\" she said. \"I don't have ovaries.\" \"Hmm?\" \"My mom died of cancer. So they took mine out. To be safe. See the scar?\" She turned onto her back and pointed to the faint line across her abdomen. \"I'm sorry,\" he said, placing a palm on her stomach. \"It's fine,\" she said. \"You don't have to pretend it's OK\" he said. \"We don't have to be friends,\" she said. She did, in fact, have ovaries, but she also had a period you could set a watch by and an app that told her which weeks not to worry about carelessness. The scar on her belly was from an appendectomy sheÕd had as a teenager, and was the wrong direction for what it would have been if sheÕd had the other surgery. She was not supposed to still have the ovaries. A year and a half ago, her mother had gone to the hospital with what the intake doctor called textbook appendicitis symptoms and died of cancer eleven months later. Because hospice was for people who intended to die, and Lyssa's mother didn't, she had refused to go. She died in the regular hospital, admitted through the ER, which meant even though she'd been remanded to the comfort care team, the doctor on rounds was officially required to come in once a day and report to Lyssa that her mother was still dying. He was kind about it, if not particularly attentive. Her mother was too drugged up to take the message herself, and the doctor was young and seemed embarrassed to be there, which was fair, Lyssa supposed-she too had stopped acting like this moment was anything but private. In the very beginning, when they'd still thought something could be done, Lyssa had gone to every new doctor's appointment dressed like it would be a photo shoot. She had bought clothes she couldn't afford, taken off early from work to press her hair, never met a new doctor without a full face of makeup. There was always something they wouldn't tell everybody, and she wanted to be told, which meant she had to look like a real person to them, like a person whose mother deserved to live, like someone who loved somebody. Whatever information they weren't going to give her, whatever medicine they didn't bother trying on Black women, she would have to ask to get, would have to ask for directly so that it went in the file if they refused, but ask for without seeming stupid or aggressive or cold. She would have to be poised and polite through her frustration, which, thankfully, retail had prepared her for. Tell me what you would tell a white woman, her face said. A white woman with money, her clothes said. Please, her tone said. But eventually all the doctors told her the same thing, and Lyssa accepted there was nothing left to ask for. In the hospital at the end, she wore the same clothes for days and didn't bother combing her hair. A night janitor asked Lyssa if she was the patient's granddaughter; at first she was offended on her mother's behalf-illness hadn't aged her that much-but when she saw herself in the mirror, she realized it was not how old her mother looked, but how young she looked in her unmade state, how creaturely and unable to fend for herself. In the hospital bed, her mother looked alive and vital, only sleeping. They often go as soon as you do, a nurse said three days after they'd taken her mother off food, and Lyssa realized only much later that she had taken the wrong message, that the nurse hadn't meant Lyssa had to stay put or she might miss it. The same nurse pointed out on day five when her mother's urine bag had gone from yellow to brown, told her everything else would follow the kidneys and shut down soon. Death would mean new logistics-administrators and insurance people. Lyssa showered in the hospital room bathroom, using the stinging antibacterial soap in the dispenser. She plugged in her blow-dryer and styled her hair. She put on a change of clothes , a muted-berry lipstick, and a sweep of mascara. When the doctor in charge of rounds came back, he looked at her as if seeing her for the first time. He asked her if anyone had talked to her about her own preventative options. No one had. He wrote on a prescription pad the name and number of the doctor he wanted her to call. Lyssa thought she would talk to her mother about it, and then she remembered. She had to keep remembering, even after she'd seen the body and signed the paperwork and arranged a funeral. Somehow she'd expected the dying to be the worst part, that after it was over she could go home and tell some healthy living version of her mother about the terrible thing that had just happened to her. Lyssa felt cheated: out of a mother, out of a textbook diagnosis where they could have lifted the bad thing out of her mother and sent her home to recover. She was not ready to be cheated out of anything else. It took her months to call the doctor on the referral slip. She went to the appointment as her regular self, washed and neat, but otherwise unadorned. \"I don't have any children,\" she told the doctor. \"Were you planning on them?\" he asked. \"I wasn't not planning on them.\" The doctor sighed. He leaned forward and made a facial expression somewhere between a smile and a grimace, a face that looked like he'd practiced it in the mirror after being lectured about his bedside manner. \"Look, if you were going to try to have a baby tomorrow, I'd say perhaps that was your risk to take. But if you're not planning on starting a family anytime soon, well, you're not getting any younger, and I'd do this sooner rather than later. Take care of your real future, not your imaginary one.\" Lyssa tried to imagine her real future. She had lived with her mother until her mother wasn't living. She had inherited the house, or whatever of the house she could get out from underneath the second mortgage, which locked her here for now if nothing else did. She could not imagine choosing the way her mother died, given a choice. But her mother had chosen it, had chosen, with her little bit of time left, every painful intervention, every last-chance effort, every surgical and injected and intravenous possibility of survival over comfort. When her mother asked and Lyssa said this is not what I would do if it were me, sometimes she meant you are brave, and sometimes she meant you are reckless and foolish, and sometimes she meant I can't imagine what would be worth trying this hard to live for. The first time she thought about dying, Lyssa was fourteen. She told her mother about the feeling and her mother said, \"You'd have to shoot me first.\" While her mother was dying, Lyssa was dating a bartender named Travis. She had been dating Travis before her mother got sick, though not for very long before. They met on Halloween, he liked to say, though it didnÕt really count as meeting in her mind-he had waved at her while she looked at him over the shoulder of a man in a pirate costume who was groping her and nibbling at her neck. Lyssa was trying to decide whether the pirateÕs gold tooth was part of the costume or part of his mouth when she looked up and saw Travis watching. Her costume had involved fishnets and a dress that wouldnÕt have made it out of her closet any other night, but she couldnÕt remember now what cheap last-minute addition had made it a costume-cat ears or vampire teeth or some kind of ominous hat. It was almost the end of slutty Halloween; last year, even the local college kids had been bundled into cartoon character onesies or dressed as clever puns, covered up like nuns, the real kind. But this was two Halloweens ago, and Lyssa hadnÕt known where things were headed, and wouldnÕt have known what else to wear even if she had. Mackenzie had insisted she come out, and then she and her friends had promptly disappeared into the barÕs drunken throng, leaving Lyssa to her own devices. When Travis saw her with the pirate draped around her neck, her dress half off her shoulder and whatever costume accessory sheÕd been wearing long gone, he raised an eyebrow, more a question than a judgment, and when he waved, it felt like Lyssa was snapped back into herself and had the answer. She extricated herself. The pirate pled with her as far as the bar door, but when he realized that following her out would mean heÕd have to wait in a line to get back in, he let her go. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 49 mins",
            "$3.99 delivery February 23 - 27.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 14 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "WINNER OF THE 2021 JOYCE CAROL OATES PRIZE NAMED A BEST BOOK OF 2020 BY O MAGAZINE, THE NEW YORKER, THE WASHINGTON POST, REAL SIMPLE, THE GUARDIAN, AND MORE FINALIST FOR: THE STORY PRIZE, THE L.A. TIMES BOOK PRIZE, THE ASPEN WORDS LITERARY PRIZE, THE CHAUTAUQUA PRIZE “Sublime short stories of race, grief, and belonging . . . an extraordinary new collection . . .” —The New Yorker “Evans’s new stories present rich plots reflecting on race relations, grief, and love . . .” —The New York Times Book Review, Editor’s Choice “Danielle Evans demonstrates, once again, that she is the finest short story writer working today.” —Roxane Gay, The New York Times–bestselling author of Difficult Women and Bad Feminist The award-winning author of Before You Suffocate Your Own Fool Self brings her signature voice and insight to the subjects of race, grief, apology, and American history. Danielle Evans is widely acclaimed for her blisteringly smart voice and X-ray insights into complex human relationships. With The Office of Historical Corrections, Evans zooms in on particular moments and relationships in her characters’ lives in a way that allows them to speak to larger issues of race, culture, and history. She introduces us to Black and multiracial characters who are experiencing the universal confusions of lust and love, and getting walloped by grief—all while exploring how history haunts us, personally and collectively. Ultimately, she provokes us to think about the truths of American history—about who gets to tell them, and the cost of setting the record straight. In “Boys Go to Jupiter,” a white college student tries to reinvent herself after a photo of her in a Confederate-flag bikini goes viral. In “Richard of York Gave Battle in Vain,” a photojournalist is forced to confront her own losses while attending an old friend’s unexpectedly dramatic wedding. And in the eye-opening title novella, a black scholar from Washington, DC, is drawn into a complex historical mystery that spans generations and puts her job, her love life, and her oldest friendship at risk. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9822"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Riverhead Books (November 9, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 288 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593189450"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593189450"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.17 x 0.73 x 7.9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#274,978 in Books (See Top 100 in Books) #3,642 in Black & African American Women's Fiction (Books) #6,231 in Short Stories (Books) #15,879 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,491 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Myranda Herrera",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBYG6RG6I7VO3RM4EVEQQ3MS5AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FT5JGB9745MW?ASIN=0593189450",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars 5⭐️",
                "reviewText": "Wow. Im not usually a fan of short stories, or collections, but I can positively say every story in this collection is amazing. I don’t think I’ll ever forget some of these stories.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Piot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKN7VGN3RNBBGHEE2O3IHAWXH2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26BP2TUV4P2CB?ASIN=0593189450",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Interesting stories",
                "reviewText": "This book is well written, but sometimes I found it hard to follow the storyline. I suppose the author is not a fan of commas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kareena",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBDAGEQ74VHWACULZSHY2IGEMYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35T41S9NQI27R?ASIN=0593189450",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 10, 2021",
                "reviewTitle": "5.0 out of 5 stars Great book of short stories",
                "reviewText": "Each of the stories make commentaries on a variety of topics, centering around race in modern society. I was pleasantly surprised by the complexity and depth these stories went into in such few pages (compared to a full length novel). They cover some heavy topics but do so in such a profound way, leaving you thinking about the stories long after reading them.After reading each part I kept telling myself “this one is my favorite” and then I’d read the next one and say the same thing. Each story has its own unique style and commentary on society - I honestly couldn’t decide on just one that I liked the best.I think these stories are great discussion starters and would be great for a book club! I highly recommend this one, and would love to discuss it with people who have read some of the stories.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bailey CodyBailey Cody",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2MGR6JDCO3DG33SSJI54I37QGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RVOIPMX9EMVN?ASIN=0593189450",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2021",
                "reviewTitle": "5.0 out of 5 stars An engrossing collections of short stories & a knock-out novella.",
                "reviewText": "I have never picked up a book of short stories to read for pleasure, but I’m so thankful I read this one. I was so engrossed in every single story, and I loved that the endings of each story wasn’t wrapped up into a pretty bow.I was a little sad when the short stories were over and the novella started, but OMG. The novella was even better than the short stories. The relationships highlighted in the novella are so real and lifelike; just go get this book now. So happy the Literary League chose this for their January pick!Side note: I'm obsessed with the cover of this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81J49CcLTxL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan A Radtke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEADVCQOCXYBKSLH5XDGK5HFBSHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VZM7RY3E1F06?ASIN=0593189450",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 30, 2021",
                "reviewTitle": "3.0 out of 5 stars Odd book",
                "reviewText": "I read this for my book club. The last story was the most interesting one I thought. I am not a big short story fan. The other stories left me wanting to know what happens.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kem White",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI5O426YG4JFLYS4NWFQSB432FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ARTCZ3BZ3TE?ASIN=0593189450",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2021",
                "reviewTitle": "4.0 out of 5 stars An Excellent Collection of Stories",
                "reviewText": "I probably wouldn't have noticed this book ordinarily. But I received it as a Father's Day gift, started reading it, and discovered that the book is outstanding. It's a collection of 6 short stories and a novella. By coincidence the stories in the book are ordered from my least favorite to most favorite. Black women are the principal protagonists in each. \"Alcatraz\" and \"Anything Could Disappear\" are my favorites among the short stories. \"Alcatraz\" focuses on a family reunion of sorts as two estranged sisters get re-acquainted on Alcatraz Island. \"Anything Could Disappear\" tells the touching story of how a young woman becomes the guardian of a 2 year old on the New Jersey Turnpike. The other stories are all uniformly excellent as they explore everyday relationships and race relations.But it's the novella that's the best. Cassie and Genie are childhood friends and adults with a prickly relationship. They're both PhD historians who end up working for the Institute for Public History. It sounds humorous but it's not. \"The Office of Historical Corrections\" is one of the best things I've read this year. This collection is highly recommended.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ESC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPQAL6B77XOBGNDD3DZHDSF5OLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X7IY8KK7K1E7?ASIN=0593189450",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Book in great condition",
                "reviewText": "Book was in fine shape and well packaged.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PrincessJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOSKTRAZCAB5GFKE3EYUHRPXYOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R298YGDBQ7OZ68?ASIN=0593189450",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2021",
                "reviewTitle": "5.0 out of 5 stars A must read",
                "reviewText": "Each short story as well as the novella leaves you wanting to know what unfolds next for each character, and wishing that each might have their own full length book. A compelling examination of relationships, despair, and the inextricable factor of race and racism being both active and passive, as it is in the real world.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shalaka Patil",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 14, 2023",
                "reviewTitle": "Fabulous!",
                "reviewText": "Thoroughly enjoyed how the stories move and all the little sub stories in the plot. Do not miss this one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "George.es",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on May 25, 2021",
                "reviewTitle": "Un libro y una autora wxcepcional",
                "reviewText": "Un talento prodigioso y original! Los relatos cortos más innovadores y sorprendentes que he leído desde hace mucho tiempoAmazing!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "emeraldgirl*",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 1, 2021",
                "reviewTitle": "Brilliant",
                "reviewText": "I love short stories and this collection includes a novella. Funny and close to the bone.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}