{
    "remaining_requests": 725,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Daughters-Warsaw-emotional-heartbreaking-historical-ebook/dp/B0C5Z86W65",
    "body": {
        "name": "Daughters of Warsaw: an emotional and heartbreaking WW2 historical fiction novel inspired by a real life hero for 2024",
        "price": "$0.99",
        "originalPrice": "",
        "rawPrice": 0.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Daughters-Warsaw-emotional-heartbreaking-historical-ebook/dp/B0C5Z86W65",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81zyZsufT8L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Maria Frances",
            "link": "https://www.amazon.com/Maria-Frances/e/B0CG26TJZV/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 58,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An emotional and inspiring World War Two time-slip novel of danger and courage. This is a story inspired by true events and stories of Irena Sendler and the women of the Polish Żegota.It's the worst time in humanity and yet there is still light in the darkness…1942, WarsawYoung Zofia finds herself leading a double life when she is enlisted to help the fearless Irena Sendler save hundreds of Jewish children from the Warsaw Ghetto.Every night, Zofia risks her life to shepherd the children to safety. But when the worst happens, she is forced to make her riskiest journey yet to keep Irena’s mission alive.Now, SeattleAfter yet another miscarriage, heartbroken Lizzie returns to the comfort of her childhood home, where she stumbles upon a hidden photograph of her great-grandmother among a mysterious group of people.On a quest to discover more, Lizzie uncovers a buried past darker and more dangerous than she could ever have imagined…A sweeping and heartbreaking story of two remarkable women, generations apart, each finding courage when all hope is gone. Perfect for fans of The Midwife of Auschwitz and The Woman Outside the Walls.––––––––––––––––––––––––––––––––––––––––––Readers adore Daughters of Warsaw:'A very moving story with a beautiful ending!' ⭐⭐⭐⭐⭐'A heartbreaking story told through the lives of the two women who find courage when they believe all hope is gone.' ⭐⭐⭐⭐⭐'If you are looking for a historical fiction about courageous women, put this one on the list, you won’t be disappointed.' ⭐⭐⭐⭐⭐'Beautiful writing and a pull-you-in story line that introduces us to Irena Sendler who worked as a nurse in the Polish Underground…A five-star read!' ⭐⭐⭐⭐⭐'Full of bravery, courage, determination and family bonds this book pulled at my heartstrings.' ⭐⭐⭐⭐⭐'This story made me thankful for the life and time I live in. It's an absolute must-read.' ⭐⭐⭐⭐⭐",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C5Z86W65"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Avon (January 18, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 18, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1721 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 343 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,003 in Kindle Store (See Top 100 in Kindle Store) #7 in Religious Historical Fiction (Books) #24 in Historical World War II Fiction #57 in Women's Historical Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 58 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "L Gentry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7E5TZGPOIT7W3UYYOGHCN7WNBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38G3FLC91PFU4?ASIN=B0C5Z86W65",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars True Heroes, Amazing Women",
                "reviewText": "This is one of those books that breaks your heart while it warms your soul. Set in Warsaw in September 1943, it's the story of the social workers and nurses who smuggled food and medicine into the Jewish ghetto while smuggling children out. This is told in a dual timeline with Zofia during the war and her great-granddaughter, Lizzie, in present-day Seattle. Often in dual timelines, I prefer one over the other but in this book I found each to be equally compelling.The majority of this story takes place over 5 desperate months in Warsaw, just before the historic Uprising.By 1943, the conditions inside the walled ghetto were horrific, rife with disease, overcrowding, and starvation. The life of the fictitious Zofia is brilliantly woven with the very real one of a true hero, Irena Sendler, a Polish Catholic social worker. The bravery of these women against the brutal Nazi regime was astounding as they repeatedly when into the ghetto disguised as nurses. The consequence for hiding or even feeding a single Jew was execution, often in public but it didn't stop these women.Lizzie, a teacher who has suffered multiple miscarriages, uncovers old photos of her great-grandmother Zofia and they spark a new passion to learn more about her. Many readers will identify with Lizzie as she struggles to heal on a journey to understand who she is if not a mother. It's through Lizzie that even more secrets from Warsaw are revealed.Zofia felt that \"if she helped only one poor soul it was a thousand times better than doing nothing.\" We need more Zofias in the world. It's estimated that Irena Sendler and her 10 compatriots rescued 2,500 children from the Warsaw ghetto but for every child saved, one hundred were sent to their deaths in Treblinka. It's way past time that the world learns about these courageous women who were true heroes. Let's acknowledge and celebrate who they were. Reading and sharing this book is a great start. I loved it.I received a complimentary advanced reading copy of this book from Avon Books UK through NetGalley. All opinions and the review are my own.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trudy D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH76SEDLXAUQKO2JWY7JUT5AJW7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39ROYQ5H7JMXK?ASIN=B0C5Z86W65",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful, detailed, gripping WW2 story",
                "reviewText": "I can't remember the last time I cried so much while reading a book. There was so much devastation within the pages. I am amazed that the people of Warsaw were able to rise from the ashes.I found myself obsessed. The author's words grabbed me. I wanted to know more and more. I wanted to read about the heroism and dedication. The more I learned the more crushed I became. The more I read the more I needed to discover truths. I found those truths. I was horrified. Daughter of Warsaw guided me in ways I had not been before.The determination of resistance workers left me in awe. Daughters of Warsaw helped me create a picture in my mind of the dedication of those trying to save the Jewish children in the ghetto. The Jewish people lived in such squaller.One of the reasons I read World War Two historical fiction is to attempt to understand why and how it happened. I find myself at a loss. The horrors, the atrocities. I am left speechless over the strength they must have had to go on as they did.Maria Frances has taken the dry words of history textbooks and humanized them. She has taken what many have tried to brush under the rug and brought it into the light. She has put faces to names. She has built the ghettos in my mind in away that they will remain forever.We all need the horrors brought to life so we don't need to repeat them. Our imaginations should be enough to make sure it never happens again. Too make sure we must read more, learn more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenia.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQRLPQ4Z6BDPR23273RIPNT2LYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXJBXQLK8QCUG?ASIN=B0C5Z86W65",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "4.0 out of 5 stars Remarkable Story.",
                "reviewText": "A beautiful, heartening story.Daughters Of Warsaw Is a story that broke my heart into millions but, at the same time, was inspirational for me. It’s not a book that you will be able to put down once you start reading it. Some parts of the book are hard to read, but you will find yourself to keep turning the pages. I loved that it was another dual-timeline book that connected the characters. Like Lizzie, I was curious about what she was going to discover. I think that finding that hidden photograph of her great-grandmother helped her heal from her loss. I don’t think she expected to find out what she had when she came across her picture. I loved the transition between Lizzie and Sofia and felt I was being transformed into both timelines.Through the years, I have read a few books about resistance. Those are my favorite books. Sofia was doing what she knew was right, but hiding from her parents and sister couldn’t be easy. If I were in her position, I wouldn’t been able to hide it, or I would have left because I would be afraid to put my family at risk. Daughters Of Warsaw was such a beautifully written story, and it was clear how much research was put into it. I haven’t read any book by Maria Frances before, and I’m glad I got to check her book out. I would highly recommend this to any historical fiction fans. After reading this book, I’m eager to see what’s next for Maria Frances",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Silver's Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFMVXMCKTP7B2ZL2JMLOLHASKDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AFR15EYYE1I1?ASIN=B0C5Z86W65",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful writing and a pull-you-in story line.",
                "reviewText": "We meet Zofia in 1942 Warsaw as she works during the day at the Social Welfare Department and helps rescue children from the Warsaw Ghetto after work.She risks her life and the life of her family as she works for The Resistance, but she says it is worth it if only one life can be saved.We then meet Lizzie, the great granddaughter of Zofia present day who is heartbroken after yet another miscarriage. She goes to her childhood home and finds photos of her grandmother hidden in a trunk in the attic.The photos peak her curiosity about her ancestry, and she begins a mission to find out what her great grandmother did during the war. She finds out secrets and about the dangerous life led by her grandmother.DAUGHTERS OF WARSAW is a marvelous read with strong female characters and cements how people were willing to help others even if their lives were in danger during this dark times in history,Beautiful writing and a pull-you-in story line that introduces us to Irena Sendler who worked as a nurse in the Polish Underground and saved Jewish children. 5/5Thank you to the publisher for a copy of this book. All opinions are my own.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura Regan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 21, 2024",
                "reviewTitle": "Brilliant boom",
                "reviewText": "I loved this book from start to finish, almost read it in one sitting, loved all the characters, I had read a bit about Irena Sandler before, so many brave people during the war !!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}