{
    "remaining_requests": 802,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Diamond-London-Andrea-Penrose-ebook/dp/B0C3WVZPKK",
    "body": {
        "name": "The Diamond of London: A Fascinating Historical Novel of the Regency Based on True History",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Diamond-London-Andrea-Penrose-ebook/dp/B0C3WVZPKK",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81yuaI3v69L._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Andrea Penrose",
            "link": "https://www.amazon.com/Andrea-Penrose/e/B00E5SKHB0/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 81,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"What a life Lady Hester had!...Simply sparkles!” —Kate Quinn, New York Times Bestselling Author of The Diamond Eye Fans of Shana Abé, Theresa Ann Fowler, and Fiona Davis will be captivated by the unforgettable spirit at the heart of USA Today bestselling author Andrea Penrose’s dazzling new historical novel based on the real life of Lady Hester Stanhope (1776-1839), a British aristocrat, antiquarian, and adventurer who defied all conventional strictures of what a woman could and couldn’t do during the Regency era.“Andrea Penrose’s impeccable research and attention to detail brings this unique and fascinating historical figure to sparkling life.” —Christine Wells, author of The Royal Windsor Secret“A truly dazzling read!” —Eliza Knight, USA Today and international bestselling author of Starring Adele AstaireBorn into an illustrious family of swashbuckling war heroes and brilliant political leaders, Lady Hester Stanhope was a Regency-era adventuress who lived on her own terms and refused to conform. Even with her privileged life, Lady Hester Stanhope knows that claiming the adventurous life she truly wants will not be easy, thanks to her eccentric father’s stifling grip. With the help of her renowned statesman uncle William Pitt the Younger, she takes on the glittering, treacherous heights of London Society. Her formidable intelligence, outspoken opinions, and headstrong determination gain the favor of the beau monde’s leading taste-maker Beau Brummell—and she quickly learns to bend the rules of the ton to her own advantage. And as her uncle’s hostess, she astutely uses her skills to preside over—and give advice to—the most influential figures of her day, rising to a position unequaled in society . . . But when it comes to holy matrimony, Hester will settle for no less than a passionate match of equals—a search marked by challenges and heartbreak. Her affair with a charismatic naval officer tempts her with forbidden pleasures—even as it threatens her reputation. Her love for a sophisticated, brilliant diplomat offers the marriage of her dreams . . . and unsuspected betrayal. And as England is plunged into war, Hester’s world changes forever, causing her to find courage and strength amid loss, chart a completely unexpected future—and make a glorious legacy forever hers . . . Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C3WVZPKK"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Kensington Books (January 23, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 23, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3498 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 398 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#32,727 in Kindle Store (See Top 100 in Kindle Store) #23 in Historical Biographical Fiction #42 in Biographical Fiction (Kindle Store) #78 in Biographical Historical Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 81 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/732027e9-0120-4fa9-894d-c511ab9f4ced.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce3e16f6-1a08-4023-9076-deffecd9a88b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56a124d0-d0dc-462f-bb74-848d16273eaf.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "eyes.2c",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJ57WGZAGKTJABEQ3N6G7EGGK4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SP3DIZPY0DQ4?ASIN=B0C3WVZPKK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Extraordinary!",
                "reviewText": "I began this title whilst in the middle of another genre. Caught up in that read, I put this away for a time, wondering if I’d make it back. I’m glad I did!The more I read about Lady Hester Stanhope, the more intrigued I became.The volatile, intelligent Lady Hester, a superb rider, an extraordinary “amazon” of a woman, of “fierce intellect and ambition”. A woman who stepped into the world of men, navigating her way through a closely strewn minefield of political, social and familial relationships that changed frequently, except for the latter. “Witty and often cynically pragmatic” we are told in Penrose’s excellent Author’s Note.Her time as her beloved uncle, William Pitt’s hostess at Walker Castle and later, when Pitt formed government, as Pitt’s ‘Private Secretary’ gave her the chance to blossom, as she served as his sounding board and confidant for various political actions.She was a close acquaintance of Brummell. She and her cousin the wildly unpredictable Lord Camelford sparked off each other, a tempestuous relationship. Her relations with Lord Granville Leveson Gower, later Ambassador to Russia left her damaged. With Lieutenant-General John Moore however, she was able to be herself. She was shattered by the tidings of his death during the retreat of the British at Corunna.Still she walked on with life, wounded but determined. Remembering John’s words, “It was the journey that mattered” and “Fortune favors the bold.”This fictionalised biography of Hetty’s life until she left Portsmouth with her brother James, whilst he recuperated before returning for duty at Gibraltar, really touched me. A woman fighting her times. Hetty journeyed on to the Middle East, to the Levant, an explorer, archaeologist and adventurer. Never to return to England. Her story had me transfixed in the end. Her pain, her courage, all extraordinary.A Kensington ARC via NetGalley.Many thanks to the author and publisher.Please note: Quotes taken from an advanced reading copy maybe subject to change(Opinions expressed in this review are completely my own.)",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "teachlz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGU3S2K7SE62MAEDMAV64EWYU3DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B10Z2HURPBJ1?ASIN=B0C3WVZPKK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "4.0 out of 5 stars The Life of Lady Hester",
                "reviewText": "Andrea Penrose, Author or “The Diamond of London” has written an intriguing novel. The Genres for this novel are Historical Fiction, Regency Era Romance, and Fictional Biography. The Author writes about Lady Hester Stanhope, and her desire for adventure, being a non-conformist of the times, and independent in her political views. Lady Hester ’s family line was filled with politicians, and war heroes. Lady Hester’s father was eccentric and quirky, and neglected his children. Her Uncle, William Pitt, the younger helps provide stability and encouragement for his niece.These were times when men held positions of importance, and expectations of ladies were limited and solid. Yet, Lady Hester didn’t appreciate that women weren’t treated equally. With the background setting of war, Lady Hester became a hostess in her Uncle’s home. She was controversial for the times, being outspoken, opinionated, and adventurous. For example, she could ride horses better than most men. Lady Hester liked challenges.When it came to love, and adventures of the heart, Lady Hester was unconventional for the times, but was emotionally fragile, and hurt.At times, this is a slow paced novel, and I would have liked to read more of Lady Hester’s adventures in England, and abroad. There are many characters, and it does get confusing. I did learn about Lady Hester and would like to learn more about her and the time that she lived.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Connie Fischer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKBUS7DE3NZ4YXJA3QKCGNDZGAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4LH7ZBSI9AJC?ASIN=B0C3WVZPKK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Depiction of Historical Lady Hester Stanhope",
                "reviewText": "1800Lady Hester Stanhope is one of 6 children and takes on the responsibility of keeping her radical father under control. He is totally wrapped up in his scientific experiments and spends a lot of money on them. She lost her mother when she was just 3. Her father remarried and she now has 3 younger brothers. However, her stepmother is bored being ignored by her husband and chooses to live in London leaving her sons in the terrible care of their father.Hester’s uncle, William Pitt, is the Prime Minister which opens doors for her to connect with society. A friend, George (Beau) Brummell, the fashion trendsetter schools her in being more assertive. It’s when she meets a cousin that she wants to experience things that are usually closed to a lady. Although he a wealthy man, he has a checked past and temper that does not bode well for her friendship with him.Soon, Hester starts working with her uncle and becomes a huge help to him in his works and also with socializing with many of the politicians he deals with. Her keen interest in politics and engaging way makes her a huge plus.The men she fell in love with all differed, but sadly, she never had a solid love in her life. She ever tired of learning and was a very intelligent woman.This was an intriguing story about a woman with whom I was not familiar. I was very impressed with the author’s extensive research into this woman’s life and the people she knew. Very well written and informative. Enjoy.I voluntarily reviewed an Advanced Reader Copy of this book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Slate",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH57SJGQSYCZZ2MXKVHOR5PQX2MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPPHAJK31IGL3?ASIN=B0C3WVZPKK",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "3.0 out of 5 stars Intriguing but needs tighter editing",
                "reviewText": "Thank you NetGalley for this ARC. 3.5 starsI was intrigued by the premise of this historical fiction novel. I had heard of Lady Hester but only in passing. What a character! Coming from a tragic childhood but stemming from a family of strong unique personalities, Hester is determined to live life on her terms… which as a titled woman in Regency London isn’t easy. We ride the waves of her romantic entanglements and watch as she figures out what’s truly important.The story held my interest and is very well-researched. I love books about little-known strong female characters from history. I think the book could benefit from a tighter editing - lots of the same descriptors used repeatedly and the war talk/strategy seemed to detract a bit from the overall arc of the story.An enjoyable book recommended for historical fiction fans.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}