{
    "remaining_requests": 994,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/New-York-Novel-Edward-Rutherfurd-audiobook/dp/B002WEBBEQ",
    "body": {
        "name": "New York: The Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/New-York-Novel-Edward-Rutherfurd-audiobook/dp/B002WEBBEQ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51OlDWJtSFL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Edward Rutherfurd",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Edward+Rutherfurd"
        },
        "brand": "Edward Rutherfurd",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 10633,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The best-selling master of historical fiction weaves a grand, sweeping drama of New York from the city's founding to the present day. Rutherfurd celebrates America's greatest city in a rich, engrossing saga that showcases his extraordinary ability to combine impeccable historical research and storytelling flair. As in his earlier, best-selling novels, he illuminates cultural, social, and political upheavals through the lives of a remarkably diverse set of families. As he recounts the intertwining fates of characters rich and poor, black and white, native born and immigrant, Rutherfurd brings to life the momentous events that shaped New York and America: the Revolutionary War, the emergence of the city as a great trading and financial center, the excesses of the Gilded Age, the explosion of immigration in the late 19th and early 20th centuries, the trials of World War II, the near-demise of New York in the 1970s and its roaring rebirth in the '90s, and the attacks on the World Trade Center. Sprinkled throughout are captivating cameo appearances by historical figures ranging from George Washington to Abraham Lincoln to Babe Ruth. New York is the book that millions of Rutherfurd's American fans have been waiting for. A brilliant mix of romance, war, family drama, and personal triumphs, it gloriously captures the search for freedom and prosperity at the heart of our nation's history. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Family Saga",
                "link": "https://www.amazon.com/Family-Saga-Genre-Fiction-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10163"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "37 hours and 17 minutes"
            },
            {
                "name": "Author",
                "value": "Edward Rutherfurd"
            },
            {
                "name": "Narrator",
                "value": "Mark Bramhall"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 10, 2009"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B002WEBBEQ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,767 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #138 in Fiction Sagas #519 in Literary Fiction (Audible Books & Originals) #605 in Historical Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Norbert Haupt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJRHEGEMHIPENP5KKJYU3LGH62Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R275L5UJDBL02I?ASIN=B002WEBBEQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2010",
                "reviewTitle": "5.0 out of 5 stars Not a Book, an Experience",
                "reviewText": "\"New York: The Novel\" is not just a book - it's an experience. It draws you in and makes you a part of it.Seldom, very seldom, when I am done with a book I am compelled to go back through it, conduct my own background research, or thumb through the book for specific passages. Rutherfurd's New York is such a book. I am almost overwhelmed with the number of thoughts bouncing through my head as I think about it now that I am done. New York is a massive, epic novel, 860 pages long with fairly small print; not a book you can read quickly on a plane ride or in an evening.A few years ago I read the novel Forever by Pete Hamill. Wrapped into a story of eminently readable mystery and fantasy, it is basically a history of New York City. I loved that book, and when I was done I wanted to travel to New York and wander around the city in awe. Rutherfurd's novel also tells the history of New York, seen through the eyes of one family and a number of other families that weave in and out of their lives, starting in the year 1664 and going all the way to 2009. Both books have the same end-objective, and both accomplish the feat in similar ways, and both overwhelmed me with richness in imagery and depth of context. Both books left me wanting more.The story starts in 1664. A Dutch settler named Dirk van Dyck lived in New Amsterdam on the very southern tip of Manhattan Island. He was engaged in the trading of furs and many other commodities, taking frequent boat trips up the Hudson River. While he had a wife and children in New Amsterdam, he also had a relationship with an Indian woman upriver and they had a child together, a girl named Pale Feather. The girl's mother died, and her father, Dirk, only showed up for day or weeks at a time, with huge gaps in between. Van Dyck took Pale Feather with him on a trip to New Amsterdam to show her where the \"white people\" lived when she was about 10 or 12 years old. While being a bigamist in the literal sense, Dirk was a decent man. He took care of his family and he loved above all his Indian daughter. The two had a touching and gentle relationship, and eventually Pale Feather gave her father a gift of a wampum belt:Quote from the book:Wampum. Tiny slices of seashell drilled through the center and strung in strands. White from the periwinkle; purple or black from the hard-shell clam. Woven together the strands became belts, headbands, all kinds of adornments.And currency. Among the Indians, strings of wampum paid for goods, marriage proposals, tribute. And since it represented wealth, the wise men of the tribe always made sure that wampum was distributed among the various families.But it was more than adornment and currency. Wampum often had meaning. White signified peace and life; black meant war and death. But in wearing wampum it was also easy to make elaborate patterns and little geometric pictograms which could be read. Huge, ceremonial belts many feet long might signify important events or treaties. Holy men wore wampum bearing symbols deep in significance.It had not taken the Dutch long to learn that they could buy fur with wampum - which they called sewan...And more quoting from the book:...What van Dyck now held in his hands was a belt. It was less than three inches wide, but six feet long, so it would go more than twice round his waist. On a background of white shells were some little geometric figures picked out in purple. The girl pointed them out proudly.\"Do you know what it says?\" she asked.\"I don't,\" he confessed.\"It says\" - she ran her finger along it - \"Father of Pale Feather.\" She smiled. \"Will you wear it?\"\"Always,\" he promised.End quote.Dirk met up with a renegade Bostonian named Tom Master, who was an outcast from his puritan family in Massachusetts and bent on making his mark in New Amsterdam. He became a successful trader in his own right, eventually married one of Dirk's legitimate daughters and started a family. They named their first son Dirk, in honor of his grandfather, and thus a dynasty was born.The book then follows the Master family through the generations. As I got to know the various Masters, I kept sinking deep into their lives, their period in history, and their undertakings. Eventually the Masters became a wealthy family of \"old money\" in New York, part of high society, side by side with the Astors, Vanderbilts and J.P. Morgan. During the course of history we also meet such figures as Ben Franklin, King George, George Washington, Thomas Jefferson, Abraham Lincoln, and - due to lack of space here - fast forwarding to Mayor Ed Koch and Rudy Giuliani.As I got to know a new Master, I always missed the older one, and eventually they faded into the past, just like in real life. I personally only knew my grandparents. I could not even tell you the names of my great-grandparents and on back.When I was done with the book, I wanted to go back and find them all again, and reminisce, wonder what the ancestors would have thought of their offspring down the corridors of the centuries. I wanted a timeline, with each Master's date of birth and death, the names of their wives and children. To keep track of them, I actually went back \"thumbing through\" the book, if you can do that with a Kindle, and put together my own timeline with names:* Dirk van Dyck - 1664* Tom Master - 1664* Dirk Master - 1680* John Master - 1723, 1758* James Master - 1770* Weston Master - 1776* Frank Master - 1825, 1853* William Master - 1860, 1880* Charlie Master - 1901, 1917, 1953* Gorham Master - 1950, 2009* Gorham Master, Jr. - 2009The dates I am showing are not dates of birth or death, but rough timelines of when their were at the height of their influence.Dirk van Dyck had a slave named Quash, who had a son named Hudson. Hudson had a son and then a grandson named Hudson. That Hudson had a son and then another grandson named Hudson again. The various Hudsons were all good men, serving in the Master households over the decades and centuries. I learned about slavery in the American colonies directly from the points of view of the slaves themselves, their lives, their loves, their work, their dreams and their ambitions. It struck me with ferocious intensity to realize how utterly dependent early America and particularly New York City was on slavery. If it weren't for slavery, our nation might never have formed in the early two centuries. A large portion of the wealth in New York came from the slave trade in the first place, then from the trade of the goods produced by the slaves on the plantations of the South. The entire economy of the nation was built on the platform of the institution of slavery.I have read books like Uncle Tom's Cabin, and perhaps I need to read it again, because I had forgotten how cruel and brutal slavery was (and probably still is where it exists still today). It's not just the injustice of being caught, chained and shackled, and then sold to a plantation to do hard labor 7 days a week, 14 hours a day, for a lifetime. When slaves had children, their children, of course, were slaves. Often husbands and wives were sold separately, or their growing children were sold away from them, whenever the owner needed some cash.Intermixed with the Master family, we also get to know the Caruso family, immigrants from Italy in the early 1900s, the O'Donnell family, who came from Ireland in the early 1800s as well as various English aristocrats.Rutherfurd is the history teacher you always wanted and an excellent writer. His style reminds me of Hemingway. His sentences are short and succinct, his vocabulary simple, his prose very easy to read, almost simplistic at times. That is part of the book's special charm. History comes to life not just in front of you, but in your heart, in your soul, and you feel like you are part of history.I believe he chose the wrong title by naming it \"New York: The Novel\". This was perhaps necessary to sell the book, to associate the title with the story. But when I was done reading, I sat there in reverie, and I thought that the book should be called \"The Wampum Belt.\" I am not going to give away any of the story, but I can tell you that the belt the little Indian girl made for her father in 1664 ties all the Masters together. If Dirk van Dyck had only known what he started, and had Gorham Master in 2009 known what the wampum belt actually was and meant, both would have been in awe.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lady Anne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4VGD6X2IPQDM72HUQ2HIKMVDZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14DRM90JGA9QE?ASIN=B002WEBBEQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 8, 2018",
                "reviewTitle": "4.0 out of 5 stars MULTI-GENERATIONAL/MULTI FAMILY FACT BASED HISTORICAL FICTION",
                "reviewText": "I believe that this is the author’s best novel since Sarum. I love multi-generational/multi-family novels like this; it is so rare to read books that have this length or depth and I miss these types of novels. I was hooked after I read the sample although I read a few reviews that complained that the book was primarily based in WASPS and the other ethnic groups usually disappeared a few pages after they were introduced but they either didn’t pay attention or couldn’t keep up with the changes when the book jumped several years.(SPOILERS) For example, the descendants of Quash did not disappear; his son Hudson was still with the Mater family after he was rescued by Clara and her husband he had a son he named Hudson; Young Hudson pretended to be John Master’s slave to avoid being arrested in 1712 for a crime he did not commit. He stayed with the as a freeman and was paid a fair wage. He married Ruth a slave and they had a daughter Hannah followed by a son Solomon; John Mater told Solomon that he could buy Ruth and the children outright or he’d set them all free when the children turned 25. As Solomon became a man he began getting into trouble; in 1777 Hudson reminded John of his promise but asked him to “keep him as a slave because he’s been keeping some bad company.” Solomon had also threatened to join the Loyalists when he got his freedom and when he was told that he needed to wait he threatened to run away and join the British Army who had promised the slave freedom of they would fight. When he told John and that he “was afraid he’d get into all sorts of trouble he was free” John suggested that they send him to serve on the new privateer he owned that was ready to sail and as soon as the war was over he’d be free. Hudson thought this was the solution and agreed. In 1779 Solomon’s ship was heading home aboard a French ship they had captured, they were at the mouth of the Chesapeake when they spotted a Patriot pirate ship flying the Stars and Stripes. After being captured, Solomon told the captain that he was the slave of Patriot Captain James Master who was serving General George Washington and been forced upon the ship to keep him from “joinin” Captain Master and that if he would make inquiries of him he’d confirm the story. The pirate said he didn’t know Master and he thought he had ran away “to join those d**n British to get your freedom.” “Far as I’m concerned you’re a lyin’, thievin’ treacherous slave that needs a whippin’.” “I reckon I ain’t got to whip you. No, I believe I’m going to lie instead. I’m goin’ to say that you’ve never been whipped because you are the most humble, obedient, hard-workin’, God fearin’ *n* that ever walked the face of the earth. Because, you lyin’ Loyalist, SOB runaway I’m going to sell you.” John searched for years but they never heard what had happened to Solomon and several years later Hannah and Ruth died from a fever they had contracted. We don’t read any more about Hudson’s descendants until the 1863 section when his great-great grandson arrives in New York. (END SPOILERS)The main storyline is about the Master family, their descendants and others that had personal dealings with family; readers will need to pay attention when new characters are introduced to see how they are connected to the original family. Therefore, some reviewers are critical of the characters. However, the only way that any author could give the depth that these readers want, he would have to write multiple novels of roughly the same length using the same style that he incorporated here (More on this later). Readers didn’t make the same complaint in 1987 when he published Sarum and I feel that in our effort to be politically correct we’ve gone too far and now criticize anything that anyone could possible object to. There’s a right way, which I support, however it’s getting to the point where you cannot write or say anything even if it is the correct expression for the time; the spoiler above is an example.This novel, like Rutherfurd’s previous works required extensive research from the maps from the 19th and 20th centuries to the historical events that are included in the novel. In the preface he states there was very little necessity to event thing in regards to historical events; he may have simplified a complex historical event or detail, but he did not mean to misrepresent any historical record. He then explains those issues that readers may have because of the way he interoperated events, details or people. The novel accurately covers many historical characters and I learned something that I did not know about Lincoln’s voice. (SPOILER) When Frank Master goes to listen to a speech he made in New York in 1860 his voice his described as “a sound so high, so harsh and so unpleasing that it grated upon the ear and made the hearer wish he’d stop.” During the speech he explained why his opponents were wrong in their approval of the Dred Scott decision. “His rhetorical genius lay in being pain staking. Slowly, deliberately, giving the date, naming the Founding Fathers concerned and explaining the circumstances of the case, Lincoln picked apart each vote. “He made no other claim. He just showed, beyond all reasonable doubt, that the Congress had the right to decide the issue. He held his audience’s attention completely. They were enraptured. As he warmed to his theme a strange transformation seemed to take place in the speaker. Most remarkable of all, Fran suddenly realized that he no longer noticed Lincoln’s voice. The man before him possessed a remarkable authority.” He points out issues with the Emancipation Proclamation that is not covered until college, if then and how Lincoln really felt about the slaves (“If I could save the Union without freeing a single slave, I’d do it.”) and what he wanted done with the slaves once they were free. (Location 8005 – 8018, Kindle Voyage Gen. 7). As well as he covers Lincolns appeal to many, his opinions and intentions he did not cover everything. One of the main issues was money; many landowners of the South were very wealthy. Their large plantations with crops of cotton, tobacco, sugar cane, rice, etc., were maintained by cheap slave labor. In most cases these landowners spent little money to feed, house and clothe their chattel and this was more than made up by the what they grew and sold. There was another valuable commodity that the south sold; slaves. It was now illegal to bring in new slaves from Africa, but the south needed more slaves. There were plantation owners and others that bred the slaves they owned to sell them. While it took time and a little money for a slave to reach an age where they could be trained in a trade that was needed on a plantation or to be old and strong enough to be considered a “valuable” field hand, the income t was generated could exceed by double, triple or more than they could get for your crops. Lincoln had no intention of losing the revenues generated from the South. If the Southern states were allowed succeed, there were additional problems that could possibly occur. It could set a precedent for any state or territory that had not decided if they could choose to allow slavery, aligning themselves with the Confederate States while the others would become part of the Union. Those that had money could have others who shared your views acquire vast quantiles of land in these undecided areas. The views of these landowners would determine what flag would represent them. If there were more small landowners that larger ones they could have acted as the boys of Tammany Hall in New York did and guaranteed that the status quo would be maintained. This would further divide the Union, resulting in more loss of revenues, land, citizens and other resources. It could be possible for Pro or Anti areas to be surrounded by areas that had chosen differently. It would no longer be a division between the North and South, instead it would be Pro or Anti or Slave or Free. Hypothetically, this could lead to endless conflicts one local, national or continational levels as the country becomes more divided. The Congress of the Union would not have any right to make any decision regarding the states or territories in the Confederate States. However, history has shown us several occasions where Lincoln showed that he had no problem ignoring habeas corpus when it suited his purposes so perhaps this would not have stopped him from doing what he wanted to protect the Union and it is feasible that if the conflict had continued for several years anyone that came after him would have had the same views and believe in doing whatever was necessary to preserve the Union.(Small Spoiler & Opinion): I wish that he had included a few paragraphs on the opposites views of the characters about impeaching Lincoln before he was assassinated and what they thought of how Reconstruction should be dealt with. There is only a brief mention of the boys at Tammany Hall approving of the Democratic Andrew Johnson. Arguments for the impeachment could be: Overstepping executive powers (despite Republican control of the House and Senate), overpassing the USC Amendments and Laws, and his blockade of southern ports because a blockade is only allowed when a war is declared and Lincoln said it was not a war but a rebellion. It’s ironic that US teaches students through high school that he was one of our greatest presidents, while Andrew Johnson a Democrat who tried to follow some of Lincoln’s views for Reconstruction was impeached, but not convicted for violation of the Tenure of Office Act. The wording if the act was murky and it was unclear if his removal of the Secretary of War, Stanton was a violation of the law. The law applied to current office holders, but it limited the protection to one month after a new President took office. This act was declared unconstitutional and repealed in 1887. The main reason the Republican held Congress was incensed that he refused to allow punitive damages against the south as Lincoln had also wanted.Overall, I feel that the book has more pros than cons and that anyone who enjoys this type of historical fiction will find this enjoyable, however, it could have been better. I feel that the author should have made this at least a duology, the 17th century was excellent as was most of the 18th. However, there needed to be more her. Abigail was a main part of the story, we are told she married and was with child, but then the story ends; there’s not further mention of her or any of her children even though they would have been cousins to the Masters’, the central family in the book. Then after the Civil War, there’s very little mention of the Reconstruction Era (I feel like the end of the war was a good place to end the first book and pick up the story beginning with the Reconstruction). The 19th and 20th centuries, especially after the middle of the 20th century was really rushed. While, the author covers Tammany Hall, except for a brief mention of one of the characters way of making a living there is no other mention of the multiple Mafia families that controlled virtually everything in NY during the 20th century. There’s also nothing about the Spanish American War, the Influenza epidemic that killed millions, WW1, and just a brief mention about WW2. It’s also in this area that I noticed the few mistakes in the novel, extra words, missing words and referring to one character by the wrong name. It feels like the author was just rushing to complete the novel, perhaps because of a deadline. It’s almost certain that the publishers insisted on changes that may have made the book shorter than the author intended. The errors, especially those with the character’s name should have been caught by a proofreader, the name wouldn’t have been changed due to an editing so this was a mistake that was mistake that was missed from the first and never caught when any changes were made. While this was a lengthy novel, I feel that it would have been much better if he had written two novels with the same length or slightly shorter so it wouldn’t have felt so rushed. This would have allowed the author to add more characters to create an ethnic mosaic that would show the cultural diversity and provide more complete and accurate account of the subject. As popular as this author is and as well as his books sell the publishers would have probably allowed this as they did with the Irish Saga.4/5 STARS",
                "reviewVotes": "40 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gogs",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 22, 2024",
                "reviewTitle": "Good read",
                "reviewText": "Intelligently written",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rui Osvaldo Gatto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 20, 2021",
                "reviewTitle": "Bravo!",
                "reviewText": "Leitor ávido por natureza, fui agradavelmente surpreendido pela leveza deste livro. Ver surgir ao longo do texto os nomes dos marcos de hoje dessa poderosa cidade surpreende e explica. Quem ama New York não pode se dar ao luxo de deixa de ler esta obra, sob pena de não compreendê-la melhor sabendo como foi forjada ao longo do tempo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 29, 2019",
                "reviewTitle": "bueno",
                "reviewText": "Entretenida novela",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesse Mira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 25, 2019",
                "reviewTitle": "La historia apasionante de la ciudad más viva del mundo.",
                "reviewText": "Es un libro más que recomendable sobre la historia de NY y, por ende, de EE UU, ameno y lleno de historias interesantes para quien quiera disfrutar de verdad de una visita a NY.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Dockrill",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 26, 2014",
                "reviewTitle": "Rutherfurd God I love You!",
                "reviewText": "I have not read all of this books yet I have read Paris and London and now New York. I do not know how he does it.. His books are breath taking. To begin with I was not much of a reader before I found this man. I found Paris and said \"hey I like history and Paris as we all know is rich with her history\" so I gave it a shot. Holy meatballs was it good!! All his books have the same formula so for those who do not like knowing somewhat what is coming than it may not work for you but I love when you have modern families and you follow them through their lives and see their ancestory and while doing so watch history unfold before you.I do not want to give much away but all of the crucial and important historical figures of America I can think of are present and all of the historical events that have changed are world are present aswell. This is a must read for history fans.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}