{
    "remaining_requests": 968,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Locket-completely-gripping-emotional-historical-ebook/dp/B0C9RW62RP",
    "body": {
        "name": "The Locket: A completely gripping and emotional WWII historical novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Locket-completely-gripping-emotional-historical-ebook/dp/B0C9RW62RP",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Lg4q9RRTL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Natalie Meg Evans",
            "link": "https://www.amazon.com/Natalie-Meg-Evans/e/B00JMCIHP2/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 353,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "England, 1942. “It has to stay secret,” he whispers, placing the locket around her neck. “If they find it, they’ll send me away.” As she holds the locket, glinting in the moonlight, she can’t hold back the tears. “I just wish we didn’t have to hide…” When farmer’s daughter Irene meets Theodore at a village dance, sparks fly instantly. The war has brought him all the way from Louisiana to build a US airbase just across her father’s fields, but as they sway together, there is nothing else in the world. Only his gentle touch and his deep brown eyes. But being together comes at a price. As Theodore is Black, the might of the US Air Force is against them, and all the members of the little village community disapprove of their relationship. And they will all go to terrible lengths to tear the two young lovers apart… Decades later, heartbroken Ruby is back at her family’s crumbling farmhouse for the first time in years, after the loss of her beloved grandmother Irene. The roof has fallen in, family photographs are damaged – and her grandmother’s jewellery is nowhere to be found. When Ruby uncovers her grandmother’s waterlogged diaries, she discovers that Irene treasured one piece of lost jewellery above all. A locket from a man called Theodore. And the missing locket holds the key to unravelling a heartbreaking secret that changed her grandmother’s life… Is someone in the village hiding the locket to keep the truth about Irene and Theodore buried? And can Ruby find a way to honour her grandmother’s memory ­– or in digging up the pain of the war, will she tear her family apart? An absolutely breathtaking World War Two story about the power of love in the face of adversity, and how the tragic consequences of war can echo through generations. Fans of Fiona Valpy, The Nightingale and All the Light We Cannot See will be addicted to this incredible read. Read what everyone’s saying about The Locket: ‘By far the best book I’ve read this year. There have been a few 2 am bedtimes because I couldn’t bear to put it down without another chapter… or 2… A fantastic book.’ Goodreads reviewer, ⭐⭐⭐⭐⭐ ‘Broke my heart… Historical fiction lovers will devour this heart-breaking novel.’ Goodreads reviewer, ⭐⭐⭐⭐⭐ ‘Let Natalie Meg Evans sweep you away… I love it!… The tears fell… This is one you’ll want on your night table!… One of the best books I’ve read all summer.’ Goodreads reviewer, ⭐⭐⭐⭐⭐ ‘It immediately swept me away… My heart hurt… Such a beautiful historical tale of loss and love in the face of adversity.’ @books_by_the_bottle ‘I couldn’t stop reading until I found out the ending… Heartbreaking… A story full of mystery, suspense, history, secrets and forbidden love.’ @shortbookthyme, ⭐⭐⭐⭐⭐ ‘I was hooked… Heartbreaking… Definitely a must read.’ @chellsandbooks, ⭐⭐⭐⭐⭐ ‘Emotional and poignant… So evocative. Truly fantastic!’ Goodreads reviewer ‘I couldn’t put it down… Heart-wrenching… Clear your calendar and make sure you have time to read it!’ Goodreads reviewer, ⭐⭐⭐⭐⭐ ‘A sweeping saga… It broke my heart… Historical fiction lovers will devour this heartbreaking novel.’ Goodreads reviewer, ⭐⭐⭐⭐⭐",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C9RW62RP"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bookouture (September 25, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 25, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2285 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 402 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1837905258"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#38,093 in Kindle Store (See Top 100 in Kindle Store) #226 in Historical World War II Fiction #317 in Historical Literary Fiction #421 in Women's Historical Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 353 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Susan Ajaz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOT53NEEG4AYOR6T4G2UWJ4S4KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RGNEAQS1T6EU?ASIN=B0C9RW62RP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "5.0 out of 5 stars From the year 2023 all the way back to the 1940's this story is finally told.",
                "reviewText": "If you think generations ago don't matter, think again. Two people find themselves on forbidden ground. Irene falls in love with a man named Theo and he risks his very life to be with her. He's a man she can never have and the only one she will ever love. Their story comes alive in the diary of a past history that comes alive for a woman trying to open never revealed secrets of a past she might never have known.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBXZIV7IKSQRR3OFPXFAQFSWIBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R367WQC0LK93BX?ASIN=B0C9RW62RP",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "4.0 out of 5 stars Compelling",
                "reviewText": "Natalie Meg Evans pens an engaging dual timeline story that focuses mostly on the English Homefront and the effects of racial discrimination and cruelty that marks a family for multiple generations. As she seeks to recover her grandmother's locket, Ruby unearth's secrets that have torn her family apart.Told from the alternating viewpoints of Irene(1940's) and her granddaughter in the present day, readers will slowly see strong themes emerging, connected between the two stories. While at times Irene displayed great strength of character, other times, she seemed beaten down. But that only made her story seem all the more realistic. Ruby was my favorite. I loved her tenacity as she continued to seek answers, discovering truths that have the power to heal.Content warning-probably not suitable for young readers. Acts of violence and rape.I received a complimentary copy of this book from the author/publsiher and was not required to write a review. All opinions expressed are my own.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karena Bemis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJ7DQIN2UX7CJJUPTYLTMDMEUXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BMNCFL4M08YM?ASIN=B0C9RW62RP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2023",
                "reviewTitle": "5.0 out of 5 stars awesome read",
                "reviewText": "I loved the twists and turns. Also the treatment of Phillipa as an 80 year old loved aunt based on what she had been through as a child. We can’t pick our lives,but can always redeem them.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Happy shopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6V2ZJ4MN5IURKIGFHLVQJDI3WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZVSP7FIIRRVT?ASIN=B0C9RW62RP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2023",
                "reviewTitle": "5.0 out of 5 stars My thoughts",
                "reviewText": "Ann engaging story that demonstrates how misunderstandings and lack of knowing all the facts along with jealousy and pride can fracture families. But true love endures through the worst challenges.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greenville book worm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3HNAQK2URNEBAZQCRZGSPBU5FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD6XI2WK29N9O?ASIN=B0C9RW62RP",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2023",
                "reviewTitle": "3.0 out of 5 stars Modern Day Meets WW2 Historical Fiction",
                "reviewText": "Historical fiction that alternates between the time of WW2 and present day. Can an age-old family mystery be solved, without destroying the lives of the people involved?…The only thing I didn’t enjoy about this book was the many different characters to have to keep track of. In a Kindle format, it’s more difficult to “flip back” and re-read if you get confused!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCKGVYJMGPXO763NYGO2KM7ZL2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16D6GGHW4P3VI?ASIN=B0C9RW62RP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderful story",
                "reviewText": "This book is a different WWII story. A passionate love story in England with an English girl and a American black educated man and the people who surrounded them. I think it's an amazing book and one I could read again.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DianeLikesToRead",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYFEKQKYEUKETULOVACE7TRJIXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RKFBFE2M5DHT?ASIN=B0C9RW62RP",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "4.0 out of 5 stars Loved it!",
                "reviewText": "The Locket is a gripping saga that will keep you up reading. This book was sad, happy, and so well written. Irene is a farm girl from England who falls in love with Theodore, a Black American soldier. The cards are stacked against them and this story is a series of what ifs and what could have been.I like the dual timeline with Irene in 1943 and Ruby, Irene’s granddaughter in the present. I won't give away the ending but it tied up the story nicely. Many thanks to the author, Bookouture and NetGalley for a complimentary copy of the book. The opinions expressed in this review are entirely my own.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deanne Patterson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNJTA332IXU4EBKXODY6TTXJ7YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMXEQKHUE0E9X?ASIN=B0C9RW62RP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Historical fiction at it's finest",
                "reviewText": "My heart about broke reading such an emotional story.A time slip taking place in England 1942 and modern times. Each features a romantic couple, the one in 1942 is Irene, a 17-year-old farmer’s daughter, Irene, and Theo a service man stationed far from Louisiana, now proudly serving in the US Air Force and there to build a US airbase just across her father’s fields.The modern times story features Irene’s granddaughter Ruby and her romantic partner. I will admit my favorite part of the story was the historical time period.Irene falls fast when she meets Theo at a town dance, but Theo warns her they must keep their romance a secret, see Theo is black and a romance such as this is just not accepted in this time period.The descriptions of the prejudice people and the treatment of Theo including beatings just for a romance with a white woman disgusted me. What business is it of anyone who someone dates or socializes with, nobody’s affair but the two it involves. And this includes the church minister involved in bigotry.There was just no combatting prejudice and bigotry at this time and Theo was beaten, sent away and jailed. Before this though, when their romance was fresh and new, they were engaged, and he gave her a beautiful engagement ring hidden in a locket. My heart breaks for the injustice and ruined lives here.Many years later Irene’s granddaughter, Ruby comes to the farm where Irene lived and finds her grandmother’s diary.She is determined to find out her grandmother’s secrets, she had no idea about her grandmother’s past or where the locket is located. Will digging up the past cause pain to her family, especially and older generation member or will they hold the key to unlocking the past?Brilliantly written, I had such a hard time putting this down. The perseverance the past generation showed in the face of adversity is amazing and must be commended! Five stars but I wish I could give it more!I was given a complimentary copy of this book. All opinions expressed are my own.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anthi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 3, 2024",
                "reviewTitle": "Very good",
                "reviewText": "This is a very good timeslip novel, set in England, partly in the present day and partly in WW2. Well written with good characterisation. Extremely readable. I recommend this most strongly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shirl the Girl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 1, 2024",
                "reviewTitle": "A great read",
                "reviewText": "I loved this book. The characters were all very real. You really felt their happiness and pain. I would highly recommend this book to anyone who likes WW2 stories.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 25, 2023",
                "reviewTitle": "Great story, in two time periods",
                "reviewText": "I often have a sense of trepidation when a writer I admire does something new. I want more of the things I love. Will a new approach be as good as the stories that I trust and enjoy? I have read all of Natalie Meg Evans historical novels, each brilliantly setaround the time of the Second World War. I love the twisting plots, the historical authenticity and insights. And here is her new book set in two periods - in rural Suffolk, at the time of the arrival of American GIs, and today, in the same place, post COVID, post lockdown, still bruised. Two strong women, and cultural norms that have shifted for the better, yet with the legacy of damaged pasts still unhealed..It's a rich mix. I loved Natalies’s observations of the present as much as I have loved her observations of the past - she expertly uses small details to conjure a whole world. I enjoy the lightness with which she wears her knowledge. The recipe for wartime marzipan (mashed beans. Almond flavouring, with just a sprinkling of the real nuts) which tells us, without a lecture, of the hard work and privations of wartime; the blacked-out dancehall sweat, so that we can almost smell the life force and energy of young people, living as hard as they can, yet many destined to die, the minutiae that affect our broadband connections, and therefore our ability to work effectively at an international level.The dual time narratives work well, illuminating cultural changes, whist showing how our present is affected by our past, and holding up the possibility of recovery and (partial) redemption. It is gripping, from a great storyteller, and ultimately hopeful. I read the whole book on the day it came out, and was left with a sense of gratitude, that in some ways at least, our world is better than it was. Enjoy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs T.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 31, 2024",
                "reviewTitle": "A brilliant story",
                "reviewText": "Couldn't put it down,loved how it came right up to date. So enlightening about the segregation that existed,and the consequences",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "helencareybooks",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 27, 2023",
                "reviewTitle": "A really interesting, engaging novel",
                "reviewText": "This is a really interesting, engaging novel with two interconnecting timelines, one set in the second world war, and the other, contemporary. It is essentially a quest novel, with hard secrets being unearthed along the way as Ruby delves into her grandmother's traumatic wartime past. The two love stories are engaging and well drawn, and make a poignant heart to the novel. Natalie Meg Evans handles the racial issues at the centre of the book with sensitivity. I found it a thought provoking and compelling read. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}