{
    "remaining_requests": 923,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Claimed-Rakish-Duke-Historical-Regency-ebook/dp/B0CPQ9LV57",
    "body": {
        "name": "Claimed by the Rakish Duke: A Steamy Historical Regency Romance Novel (A Lady's Pact Book 4)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Claimed-Rakish-Duke-Historical-Regency-ebook/dp/B0CPQ9LV57",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81nrqb+dBqL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Maybel Bardot",
            "link": "https://www.amazon.com/Maybel-Bardot/e/B0BP8YYN7X/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 330,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“All you have to do is kiss the Duke of Talbot.”Lady Daphne finds herself in an impossible situation when she is dared to do the unthinkable: tempt the most desirable man of the ton.Finding a bride is not an easy fit for a rogue like Duke Andrew. Until the perfect candidate falls right into his arms. And she’s bold enough to give him a taste of her lips…Yet stealing a kiss from the worst of rakes comes at a great cost for Daphne: a marriage of convenience.And as their passion takes over, Daphne soon realizes that Andrew may claim her body but she can never have his heart…*If you like a realistic yet steamy depiction of the Regency and Victorian era, then Claimed by the Rakish Duke is the novel for you.An enchanting regency romance of 60,000 words (around 300 pages), written by Maybel Bardot and published by Cobalt Fairy.No cheating, no cliffhangers, and a strong happily ever after.Get \"Claimed by the Rakish Duke\" today to discover Maybel's fantastic story! Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CPQ9LV57"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Cobalt Fairy LLC (December 6, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ December 6, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2545 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 335 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,128 in Kindle Store (See Top 100 in Kindle Store) #92 in Historical British & Irish Literature #104 in Historical Regency Fiction #186 in Victorian Historical Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 330 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/c94b210a-0d3a-4aa6-9c2d-eb2be8e23664.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/96063eae-cbfe-4b68-bcd1-d9d4428b4fb6.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Star-ARC reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIGFBCNE66LOB3K3JDUBIXJXSAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P81O3ZBOMVMY?ASIN=B0CPQ9LV57",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars A marriage of convenience…to a rake?",
                "reviewText": "Another great book in the Lady’s Pact Collection by Maybel Bardot. In this Lady’s Pact, four close friends vow to help each other out by switching duties with each other. In this one Daphne Parsons agrees to help Caroline out by attending a dinner party. Daphne has stayed out of the social circle since her disastrous scandal 3 years ago were her fiancé Lord Wright, Gerard Wallace, had been discovered with another woman. Her friends felt this dinner party would be just the thing to get her circulating once again. While there Daphne comes to the aid of a lady, Cecilia, who has tea spilled down her dress and she in turn introduces Daphne to her brother, Andrew Curtis, the Duke of Talbot, and her cousin, James Townshend, the Viscount of Frampton. Andrew is a known rake and is thought to be the author Sir Donald Pemberton. Daphne also rescues Lady Elizabeth Rake from a group of bullies but ends up taking a dare to do so. And what is the dare? None other than to kiss the Duke of Talbot. What happens from that point makes a delightfully splendid story with a little heartbreak, a little making up and a lot of trouble in the making but more loving for the taking. This is a marriage of convenience to a rake no less that soon becomes more when forced into the light from an ex fiancé. Can you guess who the real Sir Donald Pemberton is? A mystery to solve.I received a free Advanced Readers’ Copy of this book but was given no monetary compensation. I read for the enjoyment and voluntarily review so that others may know what to expect and authors may be helped by critique and encouragement.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BBumbolow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJJOHIAI3G4UULSDJT7LDGRX4VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z8ENEI8MWBH2?ASIN=B0CPQ9LV57",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars A Cute Romantic Story",
                "reviewText": "Daphne attends a garden party in the place of her friend and meets Andrew for the first time. Even though neither of them planned for this they both did feel some spark or attraction between them. Daphne on a dare, taken to protect Elizabeth from being bullied, kissed Andrew and boy did that set off fireworks. Andrew was also being pressured to marry and also with the memory of knowing that his father would have wanted him to find a wife. Yet he had a tumultuous past where his mother was not kind and had numerous affairs that he felt led to the eventual death of his father. Upon finding out that Daphne’s brother was struggling financially and realizing that he could do a lot worse in a woman he proposed to Daphne; who promptly turned him down. Daphne had never planned to marry and was thrown Into a panic by Andrew’s proposal and refused to believe him that it would benefit him and her as she did not think her family was struggling financially, until she received a letter from her brother telling her to come home as he had something important to discuss with her. She then knew that she had to accept Andrew’s proposal as otherwise she might end up with an old man who she would have nothing in common with; but was sad because she always wanted to marry for love and not convenience. It was a moving and touching story that was enlivened by a jealous and deranged past suitor. The ending of course was most satisfying as the emotions and connections between Andrew and Daphne had fully broken down any remaining doubts about how thy felt about each other and love was in full bloom between the two of them.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nelle Renn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVKHDD7S4DTJFHS7N5QAMNMMTCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E23KCGMEFLG8?ASIN=B0CPQ9LV57",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Dare to love",
                "reviewText": "The heroine stands up for a lady being bullied and thus she is dared to kiss a duke. The hero is a rake, but knows he must marry. Then the kiss happens. He feels she is the one. She turns him down until she is told of her family’s financial situation so a marriage of convenience takes place. But it isn’t a peaceful one as a rejected suitor causes trouble. They are also drawn to each other. It was a good read with some suspense to add drama.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gail Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWKS7F5EA5XPXS5VEKEHX7AZEMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV0DZDMDAQLT0?ASIN=B0CPQ9LV57",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Unexpected Love with a Rake",
                "reviewText": "What's not to like when you find love with a Rake ? Strong, opinionated Lady Daphne has felt the lash of the ton when she is on the losing end of a perceived scandal. Daphne who cannot stop herself from stepping up to those who would inflict harsh treatment on someone else. In steps, Andrew, Duke of Talbot, and the sparks fly. It’s a wild ride with these two in the front seat. An ill-conceived marriage of convenience, once again proves to be quite troublesome. Secrets unravel, love is found and then revealed to help them forge a path together. Add an unhinged, jealous ex-finance to the ‘secret’ list who helps fast forward the path home. Always a romp, always great to read about two souls finding each other, and themselves as they forge a path together. I love that all these Regency Rakes and ladies have so much time to spend on each other, and always find their way home. I look forward to this author's stories. Descriptive, well written fulfill my need for Regency romance. I received an advance review copy for free, and I am leaving this review voluntarily.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JustJeri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHBLAHCHQSSHGMWMM23QNR7XAKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK5HXOR973P6T?ASIN=B0CPQ9LV57",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Andrew and Daphne",
                "reviewText": "This is another story in the Lady’s Pact collection, but you do not have to have read any of the previous books to enjoy this one. Daphne has agreed to attend a dinner party, as she has not been out in society for some time due to a scandal. She fulfills a dare, which causes an unexpected connection with Andrew. Due to Daphne’s poor family financial situation, and that Andrew is being pressured to marry, they agree to marry. And so it begins…… The story is well written with an engaging plot, and interesting characters, encouraging me to care about the characters and their paths. Ms Bardot is great at adding intrigue, secrets and betrayals, making you wonder how will they find their true happiness. And then the added drama from a past suitor brings more excitement to the story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marilyn Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ6NIHSI6VNXAYI4CFO5DRZDL5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDN095T8E05WZ?ASIN=B0CPQ9LV57",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Hav8ng a marriage of convenience",
                "reviewText": "This was a story of a young woman that’s at an event and gets a dare to kiss a member of the ton. She does but it backfires on her! He’s a Duke and knows that he needs a bride but hasn’t found one that he really wants until at a dinner party a beautiful young woman kisses him! Now he’s intrigued but it doesn’t happen the way he likes! I voluntarily gave an Advance Reader Copy of this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXFEMW5RPSWLG5ELU3CBSZHBTWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KOK6BO6IN8ND?ASIN=B0CPQ9LV57",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "4.0 out of 5 stars For those who dare",
                "reviewText": "What happens when a dare takes place? Usually, someone does something foolish... Thus Daphne kissing Andrew is the foolish dare. Yet, a spark ignites only to be ingored by both who have different agendas for love and marriage. A beautifully written story of two people who find love on a dare. Drama and suspense included ensuring the reader of a wonderful experience.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vr",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 11, 2023",
                "reviewTitle": "The wallflower and the rake",
                "reviewText": "Daphne is a wallflower. Duke Andrew is a rake. Together, they have instant chemistry. It's so sweet to see Andrew go from a rake to a devoted husband. Also, Daphne is such a sweet, compassionate lady. I was hoping for their happiness. Lots of interesting plot twists. I read it in evening.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D Henderson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 15, 2023",
                "reviewTitle": "A Good Story",
                "reviewText": "I enjoyed this story. Duke Andrew was a rake but he knew he needed to marry soon. Lady Daphne was at a ball when she saw a you g lady being bullied by a group of young ladies. She intervened but in order to stop the bullying the group dared Daphne to kiss the Duke. She did kiss him and this led to their marriage of convenience. Unfortunately, Daphne's ex-fiance was not happy. This story had a good mix of happenings. There was the bullying, gossip, a marriage of convenience, an abduction, attempted murder and lots of steam. A good, well-written read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G.R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 9, 2023",
                "reviewTitle": "never boring",
                "reviewText": "Never boring goes for Maybel's books as well as for Daphne and Andrew's relationship. When two strong characters have set their mind to something, they will never stop trying to convince the other to see things their way which provides an entertaining read full of sparks, sizzle and laugh out loud moments for the reader.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marion L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 14, 2023",
                "reviewTitle": "Daphne‘s Story",
                "reviewText": "After her three best friends found love and happiness, it’s finally time for Daphne‘s story. The main characters were well developed and likable. The plot was promising at the beginning but became more and more long-winded as the story progressed and the part that was supposed to be suspenseful was boring and poorly executed. There are better books by the author.Daphne is shy and doesn’t like social events. Andrew is a rake who doesn’t believe in love. They meet at a dinner party she is attending instead of her friend Caroline. They are immediately attracted to each other. After she is dared to kiss him by other ladies, he offers her a marriage of convenience based on desire, which she accepts to save her brother from ruin. But in order to convince the others, they have to pretend to be deeply in love and both have no expectations that it might come true…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PamPig",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 10, 2023",
                "reviewTitle": "Time to reflect",
                "reviewText": "To Daphne it was a time for her to help her brother in his dire straits of their dwindling fortunes so she marries the Duke who is frightened to love claimed to be a rake they have a hard road to overcome Daphne rejects her former bethrothed after finding out he betrayed her with another woman but he still wants Daphne and event spiral out of control to attempted murder and kidnap will things ever fall into place for Andrew and Daphne???",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}