{
    "remaining_requests": 1011,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Armor-Light-Novel-Kingsbridge-Book-ebook/dp/B0BSKR92NY",
    "body": {
        "name": "The Armor of Light: A Novel (Kingsbridge Book 5)",
        "price": "$15.99",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Armor-Light-Novel-Kingsbridge-Book-ebook/dp/B0BSKR92NY",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/A1OaXk7UZXL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ken Follett",
            "link": "https://www.amazon.com/Ken-Follett/e/B000APHCPQ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 21312,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An epic continuation of the series that began with The Pillars of the Earth, The Armor of Light heralds a new dawn for Kingsbridge, England, where progress clashes with tradition, class struggles push into every part of society, and war in Europe engulfs the entire continent and beyondThe Spinning Jenny was invented in 1770, and with that, a new era of manufacturing and industry changed lives everywhere within a generation. A world filled with unrest wrestles for control over this new world order: A mother’s husband is killed in a work accident due to negligence; a young woman fights to fund her school for impoverished children; a well-intentioned young man unexpectedly inherits a failing business; one man ruthlessly protects his wealth no matter the cost, all the while war cries are heard from France, as Napoleon sets forth a violent master plan to become emperor of the world. As institutions are challenged and toppled in unprecedented fashion, ripples of change ricochet through our characters’ lives as they are left to reckon with the future and a world they must rebuild from the ashes of war.Over thirty years ago, Ken Follett published his most popular novel, The Pillars of the Earth. Now, with this electrifying addition to the Kingsbridge series we are plunged into the battlefield between compassion and greed, love and hate, progress and tradition. It is through each character that we are given a new perspective to the seismic shifts that shook the world in nineteenth-century Europe. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BSKR92NY"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Viking (September 26, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 26, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 8624 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 750 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1035027992"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,610 in Kindle Store (See Top 100 in Kindle Store) #2 in Historical European Fiction #105 in Historical Fiction (Books) #944 in Literature & Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 21,312 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Evening and the Morning The Pillars of the Earth World Without End A Column of Fire The Armor of Light Discover the entire Kingsbridge Series Prequel Book 1 Book 2 Book 3 Book 4",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb6911c9-d4cc-4beb-a2ce-81c6a6143cc8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9eeadbc9-b263-40ec-9cae-7bb92f3fffdd.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8ad30f9f-28b8-4278-988d-fb5261587a58.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07353271-105c-499a-81e1-eb587e44822d.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3c4fa09b-539d-4373-ab81-fa4a5d739d90.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/734fce97-b620-4925-ad91-f3bc864f4893.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03b1ad01-d00f-4128-89bc-d67fff7097b0.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Patrick E. Lavin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUKGAZOZKKLT42BXFHPFM7Y2LCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LO357EI28H7T?ASIN=B0BSKR92NY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars This book should not be missed.",
                "reviewText": "As always, Mr. Follett has not let his fans down. He entertains as well as teaches - his characters are believable and the plot depicts the time of the novel. It's an excellent fifth book of the Knightsbridge series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael E. Farrell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFAR5UXOBV2RY5CXV7KEHITX5CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RL4VPR3VD9ZI?ASIN=B0BSKR92NY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "4.0 out of 5 stars Nice wrap up to Follet’s Kingsbridge series.",
                "reviewText": "The Armor of Light is the 5th and presumably the last book in Ken Follet’s Kingsbridge series.The story takes place between 1792 and 1825 during a period that saw the beginnings of the industrialization of the textile industry in England, including Kingsbridge which had been a spinning and weaving center for centuries, and the Napoleonic wars. The first disrupted the lifestyle and employment of the residents of England, including Kingsbridge, and the deterioration of the economy caused by the long running war with France. Industrialization of the trades resulted in the loss of employment for the working class while the war caused high inflation making everything more expensive for the people, while the owners of the businesses got richer.As usual there is a large cast of characters many of whom could qualify as the main character, but the story generally follows the life of Sal Clitheroe, a cottage industry spinner and wife of a general laborer. When her husband dies as the result of a preventable accident caused by the stupidity of the Squire’s son, her life is turned on its side. Eventually she must leave her hometown of Bedford for Kingsbridge with Kit, her 7-year-old son in tow, where she gains employment in the mill of a weaver installing a spinning machine that can handle up to 8 spindles.The story develops as more Kingsbridge weavers begin installing more machines that result in more workers losing their jobs. This then leads to more antagonization between the mill owners and the workers.The main antagonists include Joseph Hornbeam, owner of the largest mills in Kingsbridge, and Will Riddick, the son of the Squire. Both are mortal enemies of the workers, with Hornbeam interested only in enriching himself and gaining power, while Riddick just drinks and gambles away any money he gets.Because the story covers over 30 years, it goes through several phases: the initial struggles of the workers and the mill owners; attempts by the workers to organize while Parliament, led by the Prime Minister, passes a series of laws protecting the rights of the owners with harsh punishments against those violating these laws; the personal lives of the main characters, including marriages, births, deaths and adultery; and ending with participation of the Kingsbridge regiment in the battle of Waterloo; and the aftermath of the end of the war on the characters in Kingsbridge.I found this book to be more in keeping with the general themes of the first 2 books in the series. Most of the action takes place in Kingsbridge and its surroundings; the division of the characters by their societal class seems realistic; the setting of the main stories is historically correct; and the story, although long, flows smoothly and quickly. I would recommend this book even if you have not read the preceding books in this series.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "STEPHEN SWENERTON",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYCJ6K3QUW4K745ACCSJ5PCOF3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NPYC1FWLZP6E?ASIN=B0BSKR92NY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Latest book in a series",
                "reviewText": "Ken Follet is such a great story teller. He conveys great information using very real characters. His books are the easiest to read of any author I have read. I have read every one of his books and he has not lost any altitude with this one.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cricket",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNOWI4M65XE7QRVR5ZSA6B2IK7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KIXC0W1H8PFA?ASIN=B0BSKR92NY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Well appreciated gift",
                "reviewText": "I have read several of Follett's books. I haven't read this one yet. I am waiting for my Significant Other to finish it. He's enjoying it. When I get my chance I'll update my review if it isn't absolutely stellar in Follett style.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Litag8r",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLWT75S7GGQF6CD7R7WFCGAD27Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU11A72AJU6IL?ASIN=B0BSKR92NY",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2023",
                "reviewTitle": "3.0 out of 5 stars OK, But More About Who that What",
                "reviewText": "I realize that criticizing a critically acclaimed and mega-rich author about a best seller is like pissing in a hurricane. Yet here I am. I read the entire book, and was entertained, but knowing what I know now, I would not have spent the time. The author can whip up a two-dimensional character that draws you to (or away from) the character with apparent ease. This book is filled to be brim with them (and only them). This book, 5th in the series, was more about who and why than what--an early 1800s soap opera. For a book to be memorable, you need the characters to actually do something. Preferably something heroic or requiring them to grow and develop into a better person. In this author's books, I also expect to gain some insight into history and understand a new to me (old) trade. This is the \"what.\" I felt like in this book we followed some folks around learning who they love (and don't), then one day most of them wind up in the same place--mostly by complete chance. The good guys narrowly prevail. Then it is over and everyone goes back to whatever they were doing before. Could I have written a better book? No. Did I feel like I got ripped off. No. Would I read this book again. No. Will I read book 6. Unlikely. It is as if the author was 1/4 the way through writing the book and his agent said--lets cut this off and get the revenue going, then you can sell four book instead of one. I see this all the time but in $5.99 books or Kindle Unlimited. Would I do the same thing? Probably so. Life is short and writing is very hard work. It was an OK book but I'm sorry to say that I expected more and feel disappointed. Sorry Ken. I am in awe of several of your older books. Years later I still feel a connection to those characters who I confuse with real people. I should probably just keep my mouth shut.",
                "reviewVotes": "89 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Tattersall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVW6ELJITJHGJBF7EQHTNUNFCJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30RU0FV31P2LM?ASIN=B0BSKR92NY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Back to Kingsbridge",
                "reviewText": "Pillars of the Earth would be one of my most favourite books of all time. Just me. The follow up books have been excellent reads also but definitely 1 step down from Pillars of the earth in my view which still makes them great books. So I had high hopes for \"Armour of light\" given its been a while for the Author to continue the series.The time period the book is based on makes it fascinatingly interesting and you can tell by the writing style, it is in blocks of research fictionalised to paint an old worldly story about the in-equality and injustices of the time and worker oppression that takes the end of a war to get some resemblance justice back. The key characters are well placed throughout the dialogue and maintain an excellent story continuation even if the different scenarios were some what start - stop through the industrialisation of what was a largely manual fabric making industry. The portrayal of the one sided Laws, their passing and how they were applied gave great insights and underpinned tough times and keeping the masses oppressed. The Napoleon wars and impact on the book made for great historical reading and fitted well with the story.I enjoyed the book as it gives ample opportunity for the reader to take so much from it to appreciate in your own interpretations. I would place it second best in the series and highly recommend it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "amy bechtel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHBUGOP2O7JDBL3NWL6BG5U35TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XNJLC6SGIVKF?ASIN=B0BSKR92NY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Quality writing.",
                "reviewText": "This book is about early textile manufacturing. Ken Follet has done it again with this book. History buffs will love this story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 24, 2024",
                "reviewTitle": "Brilliant!",
                "reviewText": "Every time I read a book in this series, I am terribly sad when I'm finished, because I will no longer spend time with these characters every day. I learned so much from this book about that era and the characters the author builds the stories around are so very real. I can see and hear them in my mind still, 2 days after finishing.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TakakiTakaki",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 8, 2024",
                "reviewTitle": "Livro excelente, no estilo Ken Follett, a venda foi sofrível",
                "reviewText": "O livro segue o padrão do autor. Merece 5 estrelas. A impressão e capa dura excelentes!! Pena que a edição brasileira não vem nesse padrão. Já a venda da amazon me custou muitas horas ao lado do telefone no serviço de atendimento ao consumidor, no reclame aqui e no consumidor ponto gov. Comprei na pré venda em março de 2023 e depois de muita luta (muita mesmo) consegui receber o livro dois dias antes do natal. Sou cliente amazon antes da empresa chegar ao Brasil e nunca tinha passado por esse perrengue… Triste.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71619q3JF-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 12, 2024",
                "reviewTitle": "Encore une réussite",
                "reviewText": "Ce dernier roman est une digne suite de la saga commencée avec le très célèbre « Les piliers de la terre ».C’est comme toujours passionnant et les personnages dont la psychologie est bien étudiée sont inévitablement très attachants.Je suis une fan inconditionnelle de Ken Follett. J’admire son style enlevé, les descriptions détaillées des personnages et des paysages, la parfaite imbrication de l’histoire de ses personnages dans l’Histoire (avec majuscule) parfaitement documentée de l’époque qu’il relate, son sens du suspens et des nombreux retournements de situation, bref, tout ce qui fait qu’une fois la lecture commencée il est difficile de l’abandonner.Ma seule préoccupation est que je pense avoir lu tous ses ouvrages et je vais être en manque. Après lui, j’ai beaucoup de mal à trouver un auteur qui me satisfasse.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 21, 2024",
                "reviewTitle": "as good as ever",
                "reviewText": "Follett is my favour author and in my eyes can’t go wrong. He is an amazing story teller and knows the history of Britain so well that I have learnt a lot from this 5 book saga. When I finish one I can’t wait for the next one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 6, 2024",
                "reviewTitle": "Brilliant as ever !!",
                "reviewText": "A real page turner from the master story teller !!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}