{
    "remaining_requests": 784,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Shadow-Past-Lesbian-Historical-Story-ebook/dp/B098FK8X2L",
    "body": {
        "name": "In the Shadow of the Past: A Lesbian Historical Novel (Shadow Series Book 1)",
        "price": "$7.99",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Shadow-Past-Lesbian-Historical-Story-ebook/dp/B098FK8X2L",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91J6+2naIOL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "J.E. Leak",
            "link": "https://www.amazon.com/J-E-Leak/e/B098BMQXVP/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 231,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "She fell for the wrong woman ... now it's going to cost her.In the shadowy world of 1940s New York City, a sultry spy falls for the one woman she shouldn't. When reporter Jenny Ryan’s father is murdered, her burning need for justice drives her to take on a ruthless tycoon. But her plan goes awry when she falls for the criminal’s alluring mistress, OSS agent Kathryn Hammond.Kathryn is more than just a popular nightclub singer with a glamorous façade. She’s an undercover spy, trapped stateside in a dead-end assignment while the war rages on in Europe. Frustrated and resentful, her feelings get her into real trouble when Jenny steals her heart. As their forbidden desire blooms, they find themselves caught in a web of danger and intrigue.Will their passion endanger their lives and unravel everything they’ve worked for, or will their love be the very thing that saves them?In the Shadow of the Past is the first book in the sapphic historical fiction Shadow series. If you enjoy slow burns, secrets, and spies, you won't want to miss this noir-inspired tale of love and redemption.Buy In the Shadow of the Past today for a page-turning night of intrigue!",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B098FK8X2L"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Certifiably Creative LLC (June 30, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 30, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5263 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 378 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#104,396 in Kindle Store (See Top 100 in Kindle Store) #72 in LGBTQ+ Literary Fiction (Kindle Store) #121 in LGBTQ+ Literary Fiction (Books) #437 in Lesbian Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 231 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tempe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK7VOQ24RZKSX4EAAOIZQHPCYFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ5T8ZBFCCG21?ASIN=B098FK8X2L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Historical Romance and Wartime Drama",
                "reviewText": "Jenny’s father was murdered. She received an anonymous phone call with a tip that a ruthless, notorious tycoon was behind it. She ends up with a mutual attraction to a beautiful nightclub singer who is the tycoon’s girlfriend. If she can find out from the woman she’s crushing on, then maybe she can get the answers she needs. It sounds easier than it is.The writer does a marvelous job with building not only the characters, but builds a marvelous plot that has constant twists and turns, the best being the slow, slow burning romance between two women who know the danger of being exposed to the wrong people.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cassandra Yorke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJ6WG5ZRWWZRQ7D3BO52TDGAVVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3W4GWQU8I3PG5?ASIN=B098FK8X2L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 26, 2022",
                "reviewTitle": "5.0 out of 5 stars A Page-Turning WWII Lesbian Romance",
                "reviewText": "Ken Follett's \"Jackdaws\" is the only other World War II spy thriller I've read, and I loved it. J.E. Leak's \"In the Shadow of the Past\" kept the pages turning with the same smooth urgency - maybe even more. Leak's chapters don't really end, and I mean that in the best way; the action flows so seamlessly from one chapter to the next that you won't notice the end of one chapter or the beginning of another unless you happen to catch the chapter heading.\"Shadow of the Past\" follows two young American girls in the big city in the middle of World War II. One is a sunny, plucky reporter; the other a sexy nightclub singer with a silken voice, a secret life, and a dark past. It's love at first sight, though neither would admit it; they're both more complicated than an Enigma cipher. And though they've both got enough pride to float the entire American war effort, they still can't avoid their chemistry and attraction to each other. It never fully occurs to either of them that they're in love.The action never stops, and these two active protagonists keep stumbling and making messes when they overthink everything and go out of their way to protect each other. Misunderstandings abound, and their infuriating pride keeps making things worse. All this happens while Kathryn's sense of duty to her secret life brings the cold cruelty of the war into the warm relationship struggling to create itself between the girls. The war rages in Europe, and Kathryn is eager to return to it, to suffer and die in it, steadfastly refusing to see the simple warm truth that Jenny represents - that happiness is right there, offering itself to her.The thing I loved most about J.E. Leak's debut is that, in a way, her world tolerates these two lovely young women being together - even encourages it. Leak never says that wartime America isn't homophobic, but it's the big city, and these girls are so charming and popular that the world itself seems to see the truth that you see as the reader - that they belong together. The world doesn't try to keep them apart or force men into their lives to make them submit. The only obstacle keeping them from each other is their own character flaws. I *love* this. Jenny's sunny optimism seeps out into the narrative style itself and this tone - the ambient possibility in the air around the protagonists - is what makes the difference between a sad, painful romance and a cheerful one. And for me, that overall sense of hope pairs well with Leak's seamless action to tell a story where the pages fly by on their own, even when things seem the darkest.I think, at its core, what I love the most about this story is that the protagonists never lose sight of themselves. They never change for anyone else, never give in to the idea that they need to get with men. No matter what happens in the plot, they never surrender their spirit. And as long as a woman never loses who she is, there's always hope.That's why I came away from this novel happy that I invested myself in it.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.N. Enigma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6J5WGSPQP32PUIJFJSTOC7HN2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RI4Y5776SEUQ?ASIN=B098FK8X2L",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 3, 2023",
                "reviewTitle": "4.0 out of 5 stars An OSS agent seduces a reporter (F/F) but fails to get closure.",
                "reviewText": "In the Shadow of the Past is more of a detective noir than a spy thriller. The synopsis led me to assume it was the latter. My mistake. Firstly, the “spy” is investigating a target on American soil, and domestic affairs are usually handled by the police or the FBI. Secondly, there is very little action and a lot of ponderous conversation. Navel-gazing is more common in the mystery genre. Thirdly, the author uses several plot devices that evoke classic black-and-white film noir, including the mention of Alfred Hitchcock on more than one occasion.This story is set in 1943 in New York City and introduces two protagonists — Jenny Ryan and Kathryn Hammond. Both are stubborn antiheroes that will lie to accomplish their goals, which means they’re constantly lying to each other. Jenny suspects Marcus Forrester of murder and wants to write an expose for the Daily Chronicle revealing his criminal activity. Kathryn is an undercover OSS agent, Forrester’s mistress, and doesn’t need Jenny blowing her cover. As their assignments draw them closer to answers, they draw closer to one another.It is no secret to anyone who knows me that noir is my favorite genre because I like historical fiction and characters that are their own worst enemy. Jenny and Kathryn smoke, drink and ruminate on their many shortcomings, and this results in bitterness and loneliness. Like most noir characters, they’re haunted by the past and stuck in the present. Moving forward requires the ability to confront emotional wounds. However, every time Kathryn makes an attempt she drowns in the anxiety that surfaces. She cannot afford to panic under Forrester’s watchful gaze.As I expect with noir, the author has done an excellent job establishing the atmosphere and time period. Characters use old slang like, “doll” and “swell,” throughout the story. There are many references to World War II. Although the protagonist's unwavering patriotism makes my stomach turn given current events, it is an accurate representation of US history. Sexism and misogyny are as rampant as expected, but I’m glad to see both characters rise above it. And Kathryn’s workplace, The Grotto, is well-staged and easy to imagine. I should buy myself a pearl necklace.On another note, I hesitate to write a lengthy review for this book because I know so little. Neither the plot nor the many subplots got closure. This is my constructive criticism because it’s high on my list of pet peeves for a book. I needed some closure, any closure. Sigh So, take this as a friendly warning. If you need closure at the end of a book, you might find yourself frustrated with the ending. The author knows what she’s done. Hell, the last scene might as well be, “An Ode to the Lack of Closure.” I’m not religious but I pray she is a plotter and not a pantser.Should you read this? Yes, but bear in mind that I have no idea where this journey will take you. The writing is sharp and well-edited. Plot points flow together to create a satisfying structure. So, I’m inclined to believe the author can fulfill my many, many demands. To be continued…",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kay B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWDG5PIAU4W5BI7TANBCNSBSQJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VP2A1LPJVJTM?ASIN=B098FK8X2L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Best I've read",
                "reviewText": "Honestly I wish they'd name it a series or movie. Couldn't put it down. Thoroughly felt as though I knew the characters. Amazing read! Couldn't put any of the books down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L .GOODWIN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 13, 2024",
                "reviewTitle": "So good!",
                "reviewText": "I don't know why I haven't read this series yet!. More fool me because I've been missing out.On to boo 2!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 19, 2022",
                "reviewTitle": "Excellent Roman, écouté avant d etre lu",
                "reviewText": "L'epoque, le cadre, l'histoire, les personnages... tous les ingrédients etaient la pour que ce roman me plaise. Et j'ai Adoré! L'ecrivaine a suà mettre en lumiere la personnalité unique des protagonistes Jenny la reporter solaire et fonceuse & Kathelyn l'espionne à talent de séductrice.Ce premier roman plante le décor durant la 2 eme guerre aux états unis, un puissant business man soupconné d'actes anti patriotiques est dans le collimateur des services secrets ce qui amène Jenny et Kathlyn à se rencontrer et faire evoluer leurs relations dasn différents domaines.Il y a de l'action, du mystère, de la séduction, des personnages attachants et l'excellente abby craden cobiné à une EJ LEAK exceptionnelle, il etait quasi impossible de ne pas se jetter sur le 2eme roman (in the shadow of love\".j'ai adoré ce bouquin, j'espère en lire d'autres de cette qualité narrative. en Bref, je recommande vivement !",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "queer_aussie_reviews ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 13, 2022",
                "reviewTitle": "One of my favourite's this year",
                "reviewText": "You know those books that everyone says are great, but your like...ahh, I'm not sure I would be into it, but you add it to your TBR list just in case? Well, In The Shadow of the Past was that book for me. I will be honest and say the release of the audio book narrated by Abby Craden was my tipping point. Well don't I look like an idiot. Yes, Abby Craden does her usual amazing job of bringing these characters to life, but the writing is superb. And the plot so captivating that I'm straight onto the second book.In The Shadow of the Past is set in New York in the 1940's. Jenny is a reporter chasing a lead on her father's death and Kat, a spy is playing the role of mistress to the man Jenny suspects is behind the murder. The meeting if these two women is not accidental, but the attraction is. As their friendship grows, these two women are thrust into the world of espionage and intrigue.In The Shadow of the Past is layered with adventure, angst and romance. J.E. Leak has done the job of taking the reader back to the 1940's exceptionally well. Her take on daily life and the characters that inhabited this city make this story even enthralling. Her characters are strong-willed, independent women, who are both searching for their own place in the world, no matter where others believe they should be.From what I can tell, this book is the first by J.E Leak, and if this is just one example of her ability as a story teller, I can not wait to see what comes next!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kat DavisKat Davis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 5, 2021",
                "reviewTitle": "Gripping",
                "reviewText": "J. E. Leak has done an outstanding job with this novel. It grabs the reader from the very first paragraph of the Prologue:'July 1940: France A gun can be your best friend. She never thought of a gun that way before — never thought about one at all, really — but war has a way of making the most abhorrent things possible and the unthinkable an answer to prayer.'We know from the blurb this story is told from an American perspective. So why is (most likely) an American woman in the middle of France thinking about a gun less than a month after the French signed an armistice with the Germans and more than a year before the US officially entered the war? Neutrality only takes you so far - especially when you have German soldiers after you.My first reading session lasted until nearly 3am because I could not put this book down. The collection of eclectic, fully rounded characters, natural dialogue, subtly applied hints, a few twists and turns, seduction, and excellent expression, make it one of my favourite reads of 2021.We are easily drawn into Jenny and Kathryn’s world and quite soon care about these characters and what happens to them. Jenny, a newspaper reporter desperate to identify the culprit behind her father’s untimely death so she does not have to carry the blame herself; and Kathryn, an OSS operative stuck Stateside performing the role of gangster’s moll and nightclub singer after falling apart psychologically on her last mission. Both women are nursing deep hurt and trauma. Both can be emotionally unstable. While Jenny is effervescent with a tendency to jump to conclusions, Kat is stoic and seductively calm - on the surface. When they fall into each other’s orbits, there is no denying the danger and the attraction.It is clear Leak has done an inordinate amount of research for this novel. Every little detail is right for the time period, even the amount of material in a shirt collar. Although I thought the slang might have been a touch overdone in some dialogue exchanges in the first third of the book. It does, however, do its job of setting the time frame and providing character personality. I could be overly sensitive because I’m not American and slang that I’m not used to has a tendency to sound cheesy in any circumstance.I mentioned Leak has excellent expression. In effect, she paints with words which allows the text to flow like a movie in the reader’s head. For instance, she describes on p. 48 a 'single strand of pearls clinging greedily to her neck'. Or on p. 95 '...his mouth drank from hers...'. I can see these things.As far as romance goes, this is a very slow burn seduction. After 361 pages, the two main characters have not even properly kissed. However, we feel they are destined to be together, even if they are fighting against it. It is the simple, intimate things that crop up through the novel, an unguarded look, a hand resting in comfort, an embrace - and the fact Jenny is not too shy in sharing her lustful musings with the reader. If you are after hot sex, you won’t find it in this book, but if you are a fan of longing and frustration, this will hit the mark. Sometimes, in a lesfic book, the mood is spoiled by a sex scene because the author feels they should include it. I’m glad Leak held back, even dousing it with cold water at one point. I look forward to seeing where things go in Book 2.Overall this is an exciting and intriguing read that sweeps you up and doesn’t let you go. It leaves you wanting more - immediately. Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Fe6vNpBzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Notlosttheplot",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 4, 2022",
                "reviewTitle": "Lush",
                "reviewText": "Smoky clubs and a singer with more than just smoky vocals. You will love this art deco world of private clubs and polished mobsters carrying on their business as though WWII is just a bit of background noise. But is this criminal operation just about profit or is it more complex? Ultimately Kathryn and Jenny have to work out who they can trust.Trauma forms the background to the protagonists relationship and both Kathryn and Jenny struggle with grief and guilt. Characters with PTSD and panic attacks.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}