{
    "remaining_requests": 946,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Remarkably-Bright-Creatures-A-Novel/dp/B09DTGQHKJ",
    "body": {
        "name": "Remarkably Bright Creatures: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Remarkably-Bright-Creatures-A-Novel/dp/B09DTGQHKJ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51kK9pBWtBL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Shelby Van Pelt",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Shelby+Van+Pelt&search-alias=audible"
        },
        "brand": "Shelby Van Pelt&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 55290,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A New York Times Bestseller!A Read With Jenna Today Show Book Club Pick!“Remarkably Bright Creatures is a beautiful examination of how loneliness can be transformed, cracked open, with the slightest touch from another living thing.” -- Kevin Wilson, author of Nothing to See HereFor fans of A Man Called Ove, a charming, witty and compulsively listenable exploration of friendship, reckoning, and hope that traces a widow's unlikely connection with a giant Pacific octopusAfter Tova Sullivan’s husband died, she began working the night shift at the Sowell Bay Aquarium, mopping floors and tidying up. Keeping busy has always helped her cope, which she’s been doing since her eighteen-year-old son, Erik, mysteriously vanished on a boat in Puget Sound over thirty years ago.Tova becomes acquainted with curmudgeonly Marcellus, a giant Pacific octopus living at the aquarium. Marcellus knows more than anyone can imagine but wouldn’t dream of lifting one of his eight arms for his human captors—until he forms a remarkable friendship with Tova.Ever the detective, Marcellus deduces what happened the night Tova’s son disappeared. And now Marcellus must use every trick his old invertebrate body can muster to unearth the truth for her before it’s too late.Shelby Van Pelt’s debut novel is a gentle reminder that sometimes taking a hard look at the past can help uncover a future that once felt impossible. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10457"
            },
            {
                "name": "Cozy",
                "link": "https://www.amazon.com/Cozy-Mysteries/b/ref=dp_bc_aui_C_4?ie=UTF8&node=7538396011"
            },
            {
                "name": "Animals",
                "link": "https://www.amazon.com/Cozy-Animal-Mysteries/b/ref=dp_bc_aui_C_5?ie=UTF8&node=9536058011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "11 hours and 16 minutes"
            },
            {
                "name": "Author",
                "value": "Shelby Van Pelt"
            },
            {
                "name": "Narrator",
                "value": "Marin Ireland, Michael Urie"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 03, 2022"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09DTGQHKJ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Animal Fiction (Books) #1 in Literary Fiction (Books) #1 in Animal Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "T. Sparks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYX4N2Z3XFXKUMG5GMUZRXHMWBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18BXTYMPS0158?ASIN=B09DTGQHKJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars A remarkable story",
                "reviewText": "What a wonderful surprise this was! I thought Remarkably Bright Creatures was a story about a woman and an octopus, but it turned out to be so much more than that. This is Shelby Van Pelt’s first book, and I don’t think a debut has affected me like this since I read Hollow Kingdom, another story that unfolds through the eyes of an animal. The story has a bit of magical realism to it, in the sense that parts of it are told from the octopus’s point of view, but otherwise it’s simply a delightful tale about family and connections that had me ugly crying by the end of the book.In the first chapter we meet Marcellus, a giant Pacific octopus on display in the Sowell Bay Aquarium near Puget Sound. Marcellus has been in captivity for 1,299 days, and based on his life expectancy of about four years, he believes he only has a handful of days left to live. His dreary days in a small glass enclosure are broken up by secret nighttime excursions, as Marcellus is extremely smart and has found a way out of his tank.Tova Sullivan is a seventy-year-old woman who has been working nights at the aquarium as a cleaning lady for the past two years. Tova knows how to remove the hundreds of fingerprints on the tank walls and can polish the floors to a brilliant shine. She’s also quite fond of the sea creatures she encounters each night, especially Marcellus, and the two have formed an unusual bond since Tova saved Marcellus one night after he escaped and became entangled in a bunch of electrical cords.Next, we meet Cameron Cassmore, a thirty-year-old man who is drifting through life with no real purpose. Cameron lives in California, and one day his aunt gives him a box of his estranged mother’s things. Inside the box he finds a photo and an old class ring, clues that could lead to the identity of his father, a man he never knew. Cameron hops on a plane to Washington state, convinced the man he thinks is his father—a rich real estate tycoon—will be so distraught over abandoning his son, he’ll shower Cam with money. At least that’s the plan.Finally, Ethan Mack is the owner of Sowell Bay’s Shop-Way, the local grocery store. Ethan has known Tova for years and secretly has a crush on her, but Tova is much too distant to notice his interest. When Cameron shows up at the Shop-Way looking for a job, Ethan directs him to his friend who manages the aquarium, which is how Cameron and Tova meet.Tying all these characters together is Marcellus, a remarkably bright octopus with a penchant for stealing and hoarding the treasures he finds after hours on the aquarium floor, and who just might be able to bring two people together who need each other—but don’t yet realize it.Van Pelt’s chapters alternate among all these characters and introduce a slew of side characters as well, each one vitally important to the story. At first, we don’t realize how each character is connected to the next, but slowly the author reveals her secrets until the stunned reader begins to understand the depth of these connections. Each character is given a detailed backstory that becomes very important to the plot. Tova’s story in particular was heart wrenching, as she has experienced quite a bit of loss in her life and finds herself mostly alone in her twilight years. Luckily she belongs to a group of women who call themselves the Knit-Wits, and the four of them meet weekly to eat, drink, gossip and support each other. Tova came to America from Sweden as a little girl, so the story is filled with details about growing up with her Swedish mother and father. Even the Dala horses her mother collected play a part in the story, and I found these little details added so much richness.At first I couldn’t figure out how Cameron fit it, but once he arrives in Sowell Bay and meets Ethan and Tova, his story takes on new meaning. Cameron meets a woman named Avery who also plays a vital part in filling in some of the missing pieces about Cameron’s father, and I loved the way the author gave even the most insignificant side characters meaning and purpose.Van Pelt infuses her story with so many emotional moments and themes. We see how the Knit-Wits are going through the aging process, as their numbers have dwindled over the last few years. Tova is facing being alone in her old age, with no children or husband to take care of her, and so she makes the rash decision to sell her beloved house and move into a retirement community. I don’t want to give too many details about Tova’s past and her losses, because I think it’s better to discover those revelations for yourself. Let’s just say that I felt Tova’s pain and wanted nothing more than for her to be happy.And Van Pelt includes so many funny moments in her story that kept the tone light, despite some of the more heavy themes. There’s an ongoing bit about Cameron’s lost luggage that was hysterically funny, and Tova inherits a stray cat at one point, which was a delightful side plot. I also loved the story about the t-shirt that Tova uses to clean Ethan’s kitchen—you’ll just have to read the book so you can experience the hilarity too!And of course, I can’t forget the star of the story, Marcellus the octopus. As the days tick by—each of his chapters starts with a marker (“Day 1,299 of my captivity”, etc)---the tension builds as Marcellus gets closer to his impending death (at least that’s what he thinks). Marcellus understands human nature more than most humans, and I loved the way he wisely intuits each character’s needs. Ultimately, this is a story about creatures—both human and animal—saving each other. The way Marcellus’s story plays out was absolutely perfect—heartbreaking and heartwarming at the same time.This is a very special book, and I’m so glad I was able to finally read it. Highly recommended!",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jerri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6NZ6XJBICL5WAZTXW7AGCSMVUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R387NWPUT0WPML?ASIN=B09DTGQHKJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars One of My Favorites Now",
                "reviewText": "Oh my...What can I say about this lovely story adequately enough that has not already been said? This book has been on my radar for almost 2 years. I finally broke down and bought it for myself for Christmas. What an amazing gift! Easily in my top 5 for a favorite book. I did not want it to end.SPOILER ALERT - Although I hoped there would be a satisfying, happy \"human\" conclusion, I dreaded the sadness I also feared was looming. My husband was so panicked over my crying, he assumed I was in pain (I was, but not physically).This was a perfectly crafted book. The characters are well thought out and developed. I felt as if I was reading about people I could know personally. Their relationships and emotions are so empathetic and understandable. The dialogue and conversations are realistic and meaningful. The plot is both touching and humorous, with a smidge of mystery thrown in.But it is in the shortest portions of the book where this novel really shines. The most important character, Marcellus, a highly intelligent giant Pacific octopus, keeps a mental journal of his hopes and observations of his humans during his waning life in captivity at the aquarium. As best he can, he is able to guide Tova and Cameron to find the love and companionship they both so deserve and crave.Marcellus sees us with such sensitivity and compassion. “Why can humans not use their millions of words to simply tell one another what they desire?”“Secrets are everywhere. Some humans are crammed full of them. How do they not explode? It seems to be a hallmark of the human species: abysmal communication skills.”“Humans… For the most part you are dull and blundering. But occasionally you can be remarkably bright creatures.” Yes Marcellus, yes we can.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "deanie1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHL6XLS42JZAPFRV3UR2BNPHJWRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26KCITW878NPA?ASIN=B09DTGQHKJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars An unusual, but mostly pleasant read",
                "reviewText": "This is a lovely story about a bunch of sad and lonely people, and one lonely, but heroic and wonderful octopus. The star of the show is the octopus, but the story is more about the people. The main character, Tova, I found incredibly irritating til the very end, but by then she had already irritated me so much it didn't make much difference. The writing is at its best when told from the octopus' point of view and it really makes the book. I loved the different points of view. There is a loose end as the mystery is never quite solved, but it really doesn't matter much by then.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI7L3YEUWZKFYS2VL7CVAVQIFMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26DCU4MPYOVJG?ASIN=B09DTGQHKJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars endearing. warm, sweet, attached aquarium pets",
                "reviewText": "I would never have thought of using aquarium types of creatures to create somewhat smart and loyal pets? I really think I loved this book. Tova was so well done Being retirement age means a lot of new decisions must be made. Tova struggled with how to move on to a retirement home versus independent living and housing at my age I can sympathize with her indecision. Cameron was a godsend in my opinion . Tova was a godsend for him too. Together they make the happy ending. I really can’t say enough how this book affected me.. So much sadness and heartbreak and yet Tova and Cameron were so meant to be together.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPA24RIZXD5HAQWXL5Z3X2RQQ3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD5MYA9C1CF7?ASIN=B09DTGQHKJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Captivating!",
                "reviewText": "This book is a page turner! It moves the reader to try and figure out what in the world might happen next! The octopus speaks to the reader directly in about every other chapter. The reader’s emotions can swing back and forth from sheer fear of what might be next in the story (this octopus periodically escapes by unlatching his tank, returning after it does some … well, just read the book!) to ultimately feeling a deep sense of sadness for this complex, surprising, and intelligent tentacled creature. But rest assured, I would not like to be in the water with one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JanB.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 16, 2024",
                "reviewTitle": "Never lose your imagination!",
                "reviewText": "Really enjoyed this story. The characters brought laughter, nosiness, regrets, tears of sadness. But overall, the main character, Tova, while navigating through a lifetime of relentless grief, was true to herself and held strong with her privacy and direction. Shelby's imagination brought about the \"relationship\" with Marcellus (quite comical and informative -- as if it was for real!!) but later, introducing a troubled young man allowed Tova's quiet restraint and eventually, her empathy brings rewards beyond heartwarming.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 30, 2023",
                "reviewTitle": "El libro más hermoso",
                "reviewText": "Hace mucho que no leía un libro tan especial, me ha encantado. Tiene un lugar especial en mi corazón ❤️🐙",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynne Greeley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 8, 2024",
                "reviewTitle": "An Octopus Narrator?",
                "reviewText": "I started with skepticism,. An octopus as narrator? That’s a Disney movie, but not a novel. After several chapters, I was hooked. The combination of touching characters, a sea scape that’s uniquely the Pacific Northwest, and plot line that’s suspenseful kept reading long past my midnight sleep time. A feel good book that we all need in such violent times. Commendations to Shelby Van Pelt . 20, I",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diddly Bo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 29, 2024",
                "reviewTitle": "Nice unusual read",
                "reviewText": "I really got into this book from the start. It's pretty cool how they've got an octopus as a main character, which is something you don't see every day. It adds something special to the story. Reading it was easy and smooth. All the characters, even the octopus, are well done and make you feel like you're part of their world. The book has its emotional moments and some parts really make you think. It's about getting along with all kinds of life, which is a nice touch. Overall, it's a good read, especially if you're into stories that are a bit different but still have a lot of heart. Worth checking out.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suzanne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 18, 2023",
                "reviewTitle": "Couldn’t stop reading",
                "reviewText": "Loved this story. Loved the characters. It is a unique story and a great read. It will make you laugh and also make you cry. Give it a try.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}