{
    "remaining_requests": 39248,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Travel-Laptop-Backpack-Charging-Laptops/dp/B07V4R4Z77",
    "body": {
        "name": "SHRRADOO Extra Large 52L Travel Laptop Backpack with USB Charging Port, College Backpack Airline Approved Business Work Bag Fit 17 Inch Laptops for Men Women,Black",
        "price": "$27.99",
        "originalPrice": "$59.99",
        "rawPrice": 27.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Travel-Laptop-Backpack-Charging-Laptops/dp/B07V4R4Z77",
        "soldBy": {
            "sellerID": "ARUQ351AG5FCY",
            "name": "TUBU",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ARUQ351AG5FCY&asin=B07V4R4Z77&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BYZMDN97"
        ],
        "asinVariationValues": [
            {
                "asin": "B07V4R4Z77",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$27.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ySId6+wFL._SS36_.jpg"
            },
            {
                "asin": "B07V7VGYFV",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$31.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51dAKg2b5GL._SS36_.jpg"
            },
            {
                "asin": "B09J2S4195",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "$32.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41V4YCzbohL._SS36_.jpg"
            },
            {
                "asin": "B07V6XQ4WM",
                "variationName": "Color",
                "variationValue": "Purple",
                "price": "$33.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41MRFm3H3SL._SS36_.jpg"
            },
            {
                "asin": "B09QJ4QBCV",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "$33.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41HqFI20P9L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "200",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ySId6 wFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51PXIIx1d2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uYZVhBVUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zUkT16zkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51WII4j65TL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bGtlzwMCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Huxv7gucL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: SHRRADOO",
            "link": "https://www.amazon.com/SHRRADOO/b/ref=bl_dp_s_web_21412036011?ie=UTF8&node=21412036011&field-lbr_brands_browse-bin=SHRRADOO"
        },
        "brand": "SHRRADOO",
        "merchantInfo": "TUBU",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 34174,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 14. Order within 9 hrs 56 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LARGE CAPACITY AND ORGANIZED: men travel backpack owns 20 independent pockets for large storage and organization for small items. 3 spacious main multi compartments with many hidden pockets can accommodate lots of stuffs like college supplies, travel accessories, clothes, stationery, notebook, cord organizer, side deep Zipper pocket for Easy access essentials, side Elastic net pockets conveniently hold travel gear umbrellas or water bottles.",
            "EXTRA LARGE and DURABLE MATERIAL: Size of extra large travel laptop backpack: 19.5x15x11 (inches), Capacity: 50L, separate padded laptop compartment hold for 13 inch MacBook, 14, 15, 15. 6 and up to 17inch Laptop backpack/computers for women men . The scan smart laptop backpack made from high quality material with nylon lining for better WATER RESISTANT and heavy duty backpack Large laptop backpack for the City",
            "MULTIPURPOSE: unfolds the extra large backpack freely 90-180 degree, exclusive designed for airplane traveling. The big backpack is perfect for indoor/outdoor activities. Served as durable large backpack business work bag, large laptop bag or spacious college backpack, you can use it at anywhere for International travel, camping, hiking and overnight trip",
            "PRACTICAL AND CONVENIENT: external USB port with set-in charging cable offers convenient charging your cellphone. A hole for headphone outside gives easy access to Earphone usage. Also, the backpack with a sturdy rugged handle with steel cable on the top for carrying, side compression straps keep the exclusive backpack at whatever size you requires. As a men's/women's backpack, you will enjoy It's fashionable, comfortable and convenient everywhere",
            "COMFORTABLES: Tech backpack with back U shaped three dimensional ventilation design, comfortable wide breathable mesh shoulder straps with plentiful sponge pad help relieve the stress from your shoulder. Both sides of the shoulder strap with lanyard design, can hang sunglasses and other small pendants. Premium Book bags for men Also computer backpack for women.This item is not intended for use by people 12 years old and under"
        ],
        "description": "LARGE CAPACITY AND ORGANIZED: men travel backpack owns 20 independent pockets for large storage and organization for small items. 3 spacious main multi compartments with many hidden pockets can accommodate lots of stuffs like college supplies, travel accessories, clothes, stationery, notebook, cord organizer, side deep Zipper pocket for Easy access essentials, side Elastic net pockets conveniently hold travel gear umbrellas or water bottles. Ideal Bookbag backpack for high school Boys Kids perfectly",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Laptop Accessories",
                "link": "https://www.amazon.com/Laptop-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3011391011"
            },
            {
                "name": "Bags, Cases & Sleeves",
                "link": "https://www.amazon.com/Carrying-Cases-Bags-Notebook-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=172470"
            },
            {
                "name": "Backpacks",
                "link": "https://www.amazon.com/Laptop-Backpacks/b/ref=dp_bc_aui_C_5?ie=UTF8&node=335604011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "15 x 11 x 19.5 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.8 Pounds"
            },
            {
                "name": "Department",
                "value": "mens"
            },
            {
                "name": "Manufacturer",
                "value": "SHRRADOO"
            },
            {
                "name": "ASIN",
                "value": "B07V4R4Z77"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "SHRRADOO"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 34,174 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3 in Laptop Backpacks"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Age Range Description",
                "value": "Adult"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Capacity Total",
                "value": "52 Liters"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Maria Morales",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVVETPREDVRIQKQRSPKN3AGNAOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R188550TO8NI2B?ASIN=B07V4R4Z77",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Love it 🥰",
                "reviewText": "I recently invested in the SHRRADOO Extra Large 52L Travel Laptop Backpack, and it has proven to be an indispensable companion for my travels. Boasting an impressive 52L capacity, this backpack is a true powerhouse when it comes to carrying essentials for longer trips. What immediately caught my attention was its ability to effortlessly accommodate my 17-inch laptop in a dedicated and well-padded compartment, providing optimal protection during transit. One standout feature is the built-in USB charging port, which has become a game-changer for me. It allows me to charge my devices on the go, ensuring I stay connected and powered throughout my journeys. The convenience of this feature cannot be overstated, especially during long flights or hectic days of business meetings.The sleek black design adds a touch of sophistication, making it equally suitable for business and leisure travel. The backpack is not only aesthetically pleasing but also showcases exceptional build quality. The materials used are durable, and the stitching is impeccable, instilling confidence in its longevity.Comfort is paramount during extended wear, and the SHRRADOO backpack excels in this aspect. The adjustable shoulder straps and back padding provide a comfortable fit, even when the backpack is fully loaded. Additionally, the multiple compartments and pockets offer excellent organization, making it easy to access items without rummaging through the entire bag.The SHRRADOO Extra Large 52L Travel Laptop Backpack has proven to be a reliable and stylish choice for my travel needs. It seamlessly combines practicality, durability, and aesthetics, making it a standout option for anyone in search of a high-quality travel companion",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BeckyL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAQGAF7DWVD3QC7QVLYR34PC3AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13MSEIOSR3LY4?ASIN=B07V4R4Z77",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome backpack",
                "reviewText": "Got on sale as I needed a backpack to take my necessities to work. Very pleasantly surprised when it arrived. Very sturdily made. Lots of pockets to sort your gear. No waist belt or chest strap. However, it carries well without either. I have a messed up shoulder due to an accident and I loaded it up to test it. Carried like a dream. Easy to put on even loaded and with a bad right shoulder. Well designed. Worth full price for sure and even better with the discount. If I ever wear it out, you can be sure I will order it's replacement from the same manufacturer. I am carless and have carried adventure packs down trails on extended trips. So, I know backpacks. The lock for the laptop section won't defeat a serious thief. It will defeat the average Joe with sticky fingers. So, it's a nice feature. Since most thefts are by Joe or Jane coworker or fellow student. I think a nice addition would be a leash to lock it to a chair leg. Say if you are at a coffee shop and surfing and stick your laptop inside while you use the facilities. Then it would make it difficult for person mentioned above to walk off with the entire backpack. I will be adding one. It would be nice for it to be integrated into the design though",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marc L Bernard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDOWQO5BYEEYI2URETGTXOXH3MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R91W28AJINE9E?ASIN=B07V4R4Z77",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Relatively light weight, tons of room",
                "reviewText": "Comes with multiple compartments for everything, built in combination lock for main compartment, heavy duty zippers, built in USB port on exterior, connecting cord for power bank on interior, super strong handle on top, mesh pockets on exterior, shoulder straps are padded….Just well built and designed, plus air travel acceptable! When traveling, you need one of these!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ru",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6TYYXG6TSGI2MYOLCO34ICHCRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWXXH3JR4CSJQ?ASIN=B07V4R4Z77",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars So. Much. Room.",
                "reviewText": "This bag has INSANE space. I packed a ps5, portable monitor, 65% keyboard, wireless mouse, change of clothes, cables, chargers, 2 battery banks, keys, misc electronics, a Steam Deck and MULTIPLE controllers (Gamecube, 2 PS5, Switch) into this thing and it all fit pretty comfortably. Insane. I have back problems but even with all these things packed in with how it distributes the weight with the different sized pockets and the great shoulder straps, I had very little issues carrying this thing. Would be much better with a chest strap to help even more, but otherwise this thing is amazing.No issues with the security lock and I love having that option there for the bigger electronics pocket. I really love having the USB pass-through that lets me keep my battery bank in the inside pocket to charge my phone from the bag itself without having to dig through it. When I store it I hang it from the handle on the top and I was worried about that tearing, but it's been hanging for 3 months with some light cables and books in it and all that's happened is the handle warped a bit. No fraying on the fabric or signs of damage.I just love this bag so much and I hope it lasts me a long time. Fingers crossed!!",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "amchat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMJSNCWEGOLLS66THDLDVWRQPPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8JHYQ0CJS3JP?ASIN=B07V4R4Z77",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Large capacity, sturdy and strong",
                "reviewText": "Ordered this backpack in purple a month ago along with several others, but this is the one I kept. I love the color; it's true to the pictures. I'm using it for college, so I needed capacity, organization, and durability. So far, it has met these criteria. I don't know about the waterproofing yet and haven't gone through an airport with yet. The laptop section does open flat and it has some decent padding compared to others, but not on the bottom so don't drop it. It holds my 17 inch laptop easily along with the books, notebooks, & supplies I need for class. I gave 4 stars because there is a metal casing on the small front pocket where the carabiner attaches that has come loose but it did not open a hole into the pocket itself,. The pocket is still sealed, it's just cosmetic. There are several small loops on front, I'm guessing for attaching things to the outside. These are red for some even though the backpack is purple and black. Not sure why the company chose red for these, but they are shown that way in the pictures - just my preference they would match the backpack. All in all, function is great.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerry Kambeitz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 6, 2024",
                "reviewTitle": "Quality Backpack",
                "reviewText": "Just the right size for a carry on.Well designed and constructed.Zippers look great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Celio Ribeiro de Oliveira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on April 18, 2023",
                "reviewTitle": "Espetacular",
                "reviewText": "A mochila é bem robusta, bem impermeável, ótima capacidade em volume e com um acabamento impecável.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samuel F.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 6, 2022",
                "reviewTitle": "Gran tamaño y resistente",
                "reviewText": "Una mochila con gran capacidad y compartimentos para todo, obviamente una laptop.Un compartimiento central donde cabe gran cantidad de objetos, en mi caso ropa para viaje.Si buscas una mochila de gran capacidad, la recomiendo mucho.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "richard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 24, 2022",
                "reviewTitle": "Tres bon sac a dos",
                "reviewText": "Pour voyager",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aditya P Sinha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 15, 2023",
                "reviewTitle": "Product review",
                "reviewText": "Good big size sturdy good looking bagpack",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}