{
    "remaining_requests": 39107,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/KUIYN-Undetectable-Accessories-Overnight-Delivery/dp/B0CJNJQNNT",
    "body": {
        "name": "Mouse Jiggers, Mouse Mover, with Metal USB C, Mouse Jiggler, Mouse Jiggers Undetectable, Mouse Mover Device Undetectable, PC Accessories, Overnight Delivery Items",
        "price": "$9.99$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/KUIYN-Undetectable-Accessories-Overnight-Delivery/dp/B0CJNJQNNT",
        "soldBy": {
            "sellerID": "A16RUM84AX0IG1",
            "name": "FenShare",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A16RUM84AX0IG1&asin=B0CJNJQNNT&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "50",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31dlzkr9dAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41NDCwioWaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hnCspILsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Hoed0b-PL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Wv0HFvVZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vS7RV1vbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iQARRVBWL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3b255488-607b-4bb3-89dd-5b7e8b1bb88f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/373f6d7b-061c-44e0-925d-f3be241aea56/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: KUIYN",
            "link": "https://www.amazon.com/KUIYN/b/ref=bl_dp_s_web_20723509011?ie=UTF8&node=20723509011&field-lbr_brands_browse-bin=KUIYN"
        },
        "brand": "KUIYN",
        "merchantInfo": "FenShare",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 44,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 14. Order within 36 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 14. Order within 8 hrs 21 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Ensure Your Computer Stays Awake】 This Mouse Jiggle with a USB C adapter can simulate real random mouse movements. When you need to step away for a coffee break, or attend to household chores, simply connect it to your USB port. It keeps your system active, preventing it from entering sleep mode or locking, ensuring that your Zoom, Microsoft Teams, Skype, Webex, Lync, and other software stay 'online.' It is an essential companion for students, professionals, and gamers.",
            "【Two Jiggler Modes Switch,100% Undetectable】Easily switch between 'Wide Jiggle' or 'Subtle Jiggle' modes with just one button click. In 'Subtle Jiggle' mode, it moves in a Small Range at a time. When initially connected, it's recognized as a standard 'USB Composite Device,' making it completely undetectable to IT departments. Absolutely secure!",
            "【 Just Plug and Play, Wide Compatibility】No Software to install! No settings to mess with. This mouse Jiggler is ready to use with a wide range of applications, including online meetings, online gaming, e-reading, remote connections, and more. It is compatible with most operating systems available on the market, including Windows XP/7/8/10/11, Mac OS, Android, and more. Professionally tested multiple times, so you don't have to worry about causing computer crashes.",
            "【Invisible Yet Sturdy, Durable, and Portable】The USB Mouse Jiggler features an aluminum casing, combining stylish design with durability, so you don't have to worry about casing damage. It's a plug-and-play device with a switch, safeguarding your computer interface. Additionally, its ultra-compact size, akin to a Bluetooth receiver, ensures it remains inconspicuous and highly portable. Carry it with ease, and no one will take notice.",
            "【What you Got】：1XC-MM01 KUIYN Mouse Mover, 1x USB C Adapter and 1x Instruction Manual. If You Have Any Questions or Concerns, Please Feel Free to Contact Us through Amazon at Any Time and Our Friendly Customer Support Team Will Promptly and Completely Answer All of Your Inquiries."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Mice",
                "link": "https://www.amazon.com/PC-Gaming-Mice/b/ref=dp_bc_aui_C_4?ie=UTF8&node=402052011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "2.44 x 2.32 x 0.67 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.44 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CJNJQNNT"
            },
            {
                "name": "Item model number",
                "value": "C-MM01"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 44 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,588 in Video Games (See Top 100 in Video Games) #399 in PC Gaming Mice"
            },
            {
                "name": "Date First Available",
                "value": "October 8, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "shenzhen fenxiang Technology Co., LTD"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer"
            },
            {
                "name": "Connector Type",
                "value": "USB Type C"
            },
            {
                "name": "Brand",
                "value": "KUIYN"
            },
            {
                "name": "Finish Type",
                "value": "Metallic"
            },
            {
                "name": "Number of Ports",
                "value": "2"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "KUIYN Mouse Mover, with Durable Metal USB A/C Adapter Switchable 2-Jigger Range for Seamless Adaptability, Perfect Tools to Ensure your Computer Stays awake and Responsive. Upgrade your Work-from-home Setup with our Essential PC accessories, Crafted with High-grade Aluminum Alloy Material, the Metal Mouse Jiggler Guarantees Durability and a Touch of Sophistication. Designed with Convenience in mind, the Compact Mouse Jiggers is easily Portable, Featuring a Universal USB A/C Interface and a switchable 2-Jigger Range for Seamless Adaptability. Ideal for on-the-go Professionals.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56c4431f-9049-4206-aeab-bc19a968905a.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Usage steps：",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/21a57b48-1668-4340-bf48-a3174e56fb08.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Just Plug and Play, Universal Wide Compatibility No software installation is required – these plug-and-play devices are drive-free, ensuring a hassle-free experience. Stay ahead in security, as our Mouse Jiggers remain undetectable to IT departments, providing peace of mind while you focus on your priorities. Enjoy a secure, hassle-free work Atmosphere wherever you go.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d14aaac-6b20-4d4c-973c-54bcfe4a125c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56c4431f-9049-4206-aeab-bc19a968905a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/21a57b48-1668-4340-bf48-a3174e56fb08.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d14aaac-6b20-4d4c-973c-54bcfe4a125c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/825c5b4b-5053-480e-a509-77668938a139.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alice Ceballos",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECVUQ2HIJB47HBFZ2PM5GQ5IPVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2N7Z73Q18R4OF?ASIN=B0CJNJQNNT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Keeps The Screen Awake",
                "reviewText": "This jiggler is a lifesaver and is very easy to set up and use. The company I work for has a feature that if my computer goes to sleep, all of my logins are removed. This can be frustrating to have to open everything again. Even if I have to step away, this device keeps my computer turned on, open, and operating.I don't need to bother about logging back in or my screen freezing. This functions comparable to a personal assistant, keeping my computer awake and running. The is a little, straightforward gadget that is inexpensive, extremely functional, and essential for anyone who works using a computer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cody B.Cody B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYYCYHUKISDYZOZBBD5X5ICODAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMMF7NKEBX0XU?ASIN=B0CJNJQNNT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars A Prankster's Delight The Mouse Jigger",
                "reviewText": "I recently purchased the Mouse Jigger/Mouse Mover with Metal USB C, and it's been a surprisingly useful tool. This clever little device has been a game changer in keeping my computer active, especially during long periods of inactivity.Using this Mouse Jigger is incredibly simple. Just plug it into your computer's USB port, and it immediately starts to mimic mouse movement, keeping your computer awake. There's no need for any software or complicated setups, which is a big relief.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71R8dlWqVUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81tTKrnZYUL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNGBFJLIYTMEF53SM4VY7CIGFQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R153710JBZTNXD?ASIN=B0CJNJQNNT",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "2.0 out of 5 stars Clever, but it won't stop when I want to use the mouse",
                "reviewText": "This is a very clever device. I previously used a much larger, bulky thing on which you place a mouse. It physically moved around, thus making the mouse's sensor think it was moving on a surface. It also was noisy and took up valuable desk space. This product, on the other hand, simply plugs into a spare USB port, either A or C, since it includes an adaptor for whatever you have on your computer. There are no drivers to download, it appears to work on both my Mac and Windows computers, and is quiet. Just plug it in, push the button, and it starts to work immediately. You can see the cursor moving on its own around the screen.The problem with this product is that it keeps moving the cursor when I need to actually use the mouse, move it where I want it to go, and click on things. I had assumed that this thing would automatically sense when I use the mouse and cease moving the cursor itself, but it doesn't. It keep moving the cursor on its own, which makes using the mouse pretty close to impossible. The only \"solution\" I've found is to turn the unit off when I need to use the mouse myself and then turn it back on when I'm finished, which is a pretty inefficient way to work. If this device could sense when I want to use the mouse and stop itself from working, I'd give it five stars. If that's possible, I didn't see it described in the tiny sheet of instructions, which, by the way, you will probably need a magnifying glass to read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sunrise Circle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETGSOE6YE5FT4H4FQHYEMUEJ4NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQTFR82H6GFQ4?ASIN=B0CJNJQNNT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy to use and set up, amazing price!",
                "reviewText": "I work from home, sadly my employer controlled Windows settings throws the system into sleep mode automatically after 5 minutes of no activity. So my team will think I’m not at work, yet I’m drawing on my whiteboard.This mouse jiggler literally saved my job!So easy! I just plugged it in the side of my laptop in the 1 USB port I had vacant, pressed the on button and now I’m look like I’m online at all times. There are different settings for the mouse mover.It works perfectly easier than expected.I plan to buy another as a back up.Amazing price!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Albuquerque hiker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBTMPTOJ5L23RDOA4MH5DBT75VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SV7A7PVL0S9E?ASIN=B0CJNJQNNT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Very tiny and easy to engage, but cannot effectively use the mouse without disengaging it",
                "reviewText": "This tiny USB-A \"mouse jiggler\" device is easy to use, just plug it in to a USB-A port on your computer (or a hub) or use the included USB-A to USB-C adapter (which I haven't tried yet since I have plenty of USB-A ports on a hub) and push the single button on it when you want to turn it on. Once it is on the green LED on it lights up and the cursor will move around randomly without any motion on the mouse, pushing the button again toggles between very large motions and smaller motions of the cursor. The large motions might cover several inches on a monitor in a second or two while the the smaller motions maybe only an inch or two. The mouse will still work while this device is on... However in my experience with this device on in either mode it is very difficult to actually use the mouse due to the random motions, which continue even if you are actively moving the mouse and underlay whatever motions you make with the mouse. In the large motion mode the mouse is virtually impossible to use and in the small motion mode the mouse is just very difficult to actually use. There is no mode that only 'jiggles' the cursor by a pixel or two, if there were such a mode that only moved a couple of pixels per second the mouse might still be useful with this turned on, but as it is you need to disengage this with a long press on the single button before you can effectively use your mouse again. I often end up doing a short press and thus switching between small and large motion mode a couple of times before I remember that you cannot 'toggle' it to off mode by short button presses and it takes a long press to turn it off, which is mildly annoying but I'll eventually get used to that.This mouse jiggler does keep a computer 'awake' and unlocked, but it would be much more useful if it had three modes: large, small, and 1 pixel. It would be even more useful if it could somehow detect real mouse motion and 'go to sleep' while the mouse is being used, waking up again if there have been no mouse motions in a while.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Devin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGNYWYCJPDXZPF4PPXYB4NCBOXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25GZDGPUP0R2A?ASIN=B0CJNJQNNT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars 😅💻 KUIYN Mouse Jiggler: The Ultimate Office Ninja! 😂😎",
                "reviewText": "I recently bought the KUIYN Mouse Jiggler, and let me tell you, it's like having a tiny, electronic office ninja on your side! 😂 No more worrying about your computer going to sleep when you step away for a coffee break or to attend to those pesky household chores.With two jiggler modes and 100% undetectability, this little guy is like a stealthy mouse-moving magician. 😅 And the best part? It's compatible with almost every operating system out there, so you don't have to worry about any pesky compatibility issues.The aluminum casing is sleek, stylish, and durable, so you can rest assured that it'll stay safe and sound on your desk. Plus, it's so small and portable, you can take it with you on all your office adventures! 😎In conclusion, the KUIYN Mouse Jiggler is a must-have for anyone looking to keep their computer awake, avoid IT detection, and have a little fun in the process. 😂💻 #OfficeNinja #MouseJiggler #StealthModeHashtags: #AmazonFinds #KUIYNMouseJiggler #OfficeNinja #StealthMode #KeepYourComputerAwake #MustHave",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}