{
    "remaining_requests": 39110,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Time-Comfort-Massage-Texture-Under/dp/B0BSTZYZYH",
    "body": {
        "name": "Big Time Comfort Foot Rest for Under Desk at Work & Home with Massage Texture - Ergonomic Memory Foam Foot Stool for Office Chair & Gaming, Washable Soft Velvet Footrest Cover - Pain Relief Leg Pillow",
        "price": "$28.99",
        "originalPrice": "",
        "rawPrice": 28.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Time-Comfort-Massage-Texture-Under/dp/B0BSTZYZYH",
        "soldBy": {
            "sellerID": "A1IH74MN99P6A8",
            "name": "BigTimeComfort",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1IH74MN99P6A8&asin=B0BSTZYZYH&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41G0DuewcJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51vo8LNu6eL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TARISKubL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51B5dAlnCyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XKO8 Z3OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41jEIBrPSAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1M0bXNxYnL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b839bcfd-9d5d-4684-a8d0-008a7f2580d7/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: BigTimeComfort",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=BigTimeComfort"
        },
        "brand": "BigTimeComfort",
        "merchantInfo": "BigTimeComfort",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 41,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 6 hrs 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "OEKO-TEX STANDARD 100 requires textiles-based products to be tested against a list of 1,000+ chemicals, to limit those which may be harmful to human health. Certification focus: #ProductSafety and #ChemicalsUsed."
        },
        "features": [
            "【The Perfect Solution】Are you looking to improve your desk sitting posture or relieve discomfort in your feet, ankles, legs, hips, or lower back? Whether you're looking to optimize the comfort of your gaming sessions or simply enhance your everyday comfort, the Big Time Comfort under desk footrest with massage texture is the perfect solution! This ergonomic accessory is an excellent choice for reducing tension, keeping your legs and hips properly aligned, while helping relieve joint pressure!",
            "【Superior Quality Materials】Our under desk foot rest boasts superior craftsmanship constructed with high quality materials. Its features include a well crafted combination of high density memory foam for unparalleled comfort, a non-slip bottom for stability, precision stitching for longevity, and a soft velvet cover. This well made under desk foot stool is crafted to endure the test of time always keeping its shape without collapsing or deforming!",
            "【Incredibly Versatile】The Big Time Comfort memory foam foot rest for under desk is exceptionally versatile, offering a customizable experience with the added features of transforming into a rocker when flipped upside down or placed under your knees for added support. Whether you're at your desk or unwinding on the couch, elevate your comfort adjusting your feet to the optimal height!",
            "【Ergonomic and Travel Friendly】Distinguishing itself from comparable products in the market, this travel-friendly footrest stands out as a lightweight and compact design, complemented by a convenient one-sided handle. It stands out as the perfect travel accessory, whether you're in a car, airplane, train, or any other mode of transportation!",
            "【Unique Shape and Massage Texture】Crafted with a uniquely concave shape, this ottoman footrest is designed for maximum comfort and optimal elevation, ensuring ergonomic foot placement. Enhanced with massage nodules to actively stimulate circulation and promote blood flow, it delivers a soothing, calming effect during those long hours at the desk, offering relief to tired and swollen feet. Elevate your comfort experience with a touch of ergonomic excellence!"
        ],
        "description": "Big Time Comfort is a well-experienced, trusted brand that focuses on delivering innovative, reasonably priced office & desk accessories which are meant to bring comfort and functionality to your everyday life, without interfering with your safety. We rely exclusively on high-end materials and carefully screened manufacturers, in order to live up to every customer’s rigorous quality expectations. Encountering an issue with your purchase? Tell us everything about it and our customer care department will quickly address any concerns! Versatile and Portable Under Desk Footrest – Excellent Body Alignment Anytime, Anywhere The BigTimeComfort foot rest for under desk at work was designed having in mind the perfect balance between durability and comfort, providing you with a proper leg rest that alleviates pressure and accumulated tension, while keeping your body properly aligned. Made with premium quality memory foam, with a skin-friendly velvet exterior that pampers your legs, plus an elevated design that can also be used as a rocker, this foot rest under desk will become your number #1 ally whether you’re working from home, traveling, at the office or while in airplanes! Not entirely convinced? Here are some of the amazing features of this foot rest ottoman: Dimensions: 17.1 * 10.4 * 4.5 inches; Color: black; Lightweight and portable; Easy to carry handle; Ideal for office, gaming, traveling, car rides; Perfect height for reduced pressure on legs, back; Non-slip bottom; Massage points for comforting feel; Unique concave shape for better effect; Flip it upside down and use it as a rocker; Original gift choice for friends, loved ones. You’ll fall in love instantly with this relaxing airplane footrest!",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Furniture & Lighting",
                "link": "https://www.amazon.com/Office-Furniture-Lighting/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1069102"
            },
            {
                "name": "Furniture Accessories",
                "link": "https://www.amazon.com/Office-Furniture-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1069190"
            },
            {
                "name": "Footrests",
                "link": "https://www.amazon.com/Office-Footrests/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1069198"
            }
        ],
        "productInformation": [
            {
                "name": "Manufacturer",
                "value": "‎BigTimeComfort"
            },
            {
                "name": "Brand",
                "value": "BigTimeComfort"
            },
            {
                "name": "Item Weight",
                "value": "‎1.41 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "17.1\"L x 10.4\"W x 4.5\"H"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Material Type",
                "value": "‎High Density Memory Foam"
            },
            {
                "name": "ASIN",
                "value": "B0BSTZYZYH"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 41 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#74,733 in Office Products (See Top 100 in Office Products) #169 in Office Footrests"
            },
            {
                "name": "Date First Available",
                "value": "June 20, 2023"
            },
            {
                "name": "Material",
                "value": "High Density Memory Foam"
            },
            {
                "name": "Style",
                "value": "Ergonomic"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kristen B Kristen B ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHA6BHR4DYXZFV6ISDJBEC2PNUIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LKJWZUZ1BGGR?ASIN=B0BSTZYZYH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars A five star comfort experience",
                "reviewText": "I ordered the Big Time Comfort foot rest because I wanted something to help improve my comfort at my desk while working and boy I am happy I bought it! This foot rest has truly revolutionized my workspace, offering a level of comfort and functionality that goes above and beyond. I had no idea how much this footrest would improve my work setup until I started using it!The massage texture on one side is a brilliant touch which provides a soothing effect for my feet, making this footrest more than just a practical addition, it's a daily relaxation treat. The foam is firm enough so you can really feel the nodules but not so firm that it is uncomfortable in any way. The balance is perfect!The soft velvet cover is a game-changer in terms of comfort, it was much softer than I was expecting to be! It feels incredibly plush and luxurious. I find myself looking forward to slipping my shoes off and setting my feet on it.The convenient handle is a thoughtful feature that I didn't know I needed until now. It makes carrying the footrest from one room to another an absolute breeze. Whether I'm transitioning between home and office or simply want to change up my workspace, the handle adds an element of practicality.The ergonomic shape and perfect height of this footrest have transformed the way I sit at my desk. It cradles my feet perfectly, promoting a more comfortable and natural sitting posture. I've noticed a significant reduction in discomfort and fatigue, particularly during long work sessions.Last but certainly not least, the premium high-quality memory foam sets this footrest apart. It doesn't just offer immediate comfort; it maintains its shape over time, ensuring reliable support day after day. It's evident that this footrest is crafted with durability in mind.In conclusion, the Big Time Comfort foot rest is a must-have for anyone seeking a perfect blend of comfort and functionality. It's an investment in well-being, and I couldn't be happier with the difference it has made in my daily work routine. Five stars all the way!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71M7FdWaAZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71iV-a-3pmL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laurie N.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE4XI6HGDZKOEBLBJLVAI4BPXJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1C6ROP8J4UCTT?ASIN=B0BSTZYZYH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Comfort and quality!",
                "reviewText": "I ordered this multifunction foot, neck and back support pillow and it is fabulous! It’s a perfect size for home and travel. A combination of firmness, support and softness all in one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mbmb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFLAHYB3JCLMKR2UU45GTDVUPGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REOG3QP5DHD18?ASIN=B0BSTZYZYH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Multipurpose Foot Rest",
                "reviewText": "This is a very useful footrest. It is lightweight and easy to move around the house. I bought this footrest to use in the office. Very comfortable for the feet and my hips while sitting. When not using in the office I take into the TV room and we use it as a foot rest on the coffee table.This makes a perfect gift and I have purchased two for family members. I ended up purchasing another one to use in the TV room so I didn't have to carry it from the office anymore! I highly recommend this footrest.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71DJ+Xy4c7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Real_Name_HiddenReal_Name_Hidden",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEO3VENUGTZCZRHL7OQ3TFMGY3MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLQRDAD9V4PWB?ASIN=B0BSTZYZYH",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "3.0 out of 5 stars Confusing \"Footrest\"",
                "reviewText": "I honestly am not sure if this is what you would call a normal footrest. To me, it looks more like one of those memory foam lumbar support pillow.It does provide moderate level of support, but it is not adjustable whatsoever. I'm also not sold on the fabric material, I think it will get dirty relatively fast due to the usage.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71JdBc5HIrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71c7glsDuAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81AtCCSp9qL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "KGKG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKGQDN3N3YXOR7SLUYRRJWJHV5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HEC1DE5V8DZT?ASIN=B0BSTZYZYH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "4.0 out of 5 stars Under Desk Bliss",
                "reviewText": "The combination of its massage texture and memory foam design creates a luxurious and relaxing environment for my tired feet. During those long hours at my desk or intense gaming sessions, the massage texture works wonders, providing an additional layer of comfort and soothing relief. However, some users, including myself, wish it were slightly larger and taller, considering the dimensions might be limiting for those seeking a more expansive surface area for their feet. Nevertheless, the ergonomic memory foam is a game-changer, molding to the shape of my feet and offering personalized support.The soft velvet footrest cover is not just a visual delight but also a practical addition. It's washable and brings a touch of luxury to my workspace. The plush texture of the cover elevates the overall comfort and aesthetic appeal of the footrest. Cleaning is a breeze, ensuring a hygienic and fresh environment whenever I need it. Versatility is a key feature of this footrest as it effortlessly fits under my desk, saving valuable space and making it a perfect solution for various settings. The non-slip bottom ensures that the footrest stays securely in place, preventing any unwanted movement during use.If you're in search of ergonomic support and relief from leg fatigue, this footrest is a must-have. Despite considering the size preference, you can still elevate your comfort level with this versatile and stylish addition to your workspace and bid farewell to leg discomfort.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81DbM59jV5L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81rxTR6HjOL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHQHF2PR5UNH4MCQIJ2AE2ZL46A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10X2XQEM8TXAZ?ASIN=B0BSTZYZYH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Just the right foot rest.",
                "reviewText": "When I bought this foot rest, I envisioned using it only at my work desk. It works great for that purpose, and supports my legs while I’m sitting for long periods on zoom.But then I read the review on here of the customer who uses it on their couch and I absolutely agree. The size is perfect whether I rest both feet on it or use it in between my knees while on my side… which is why I’m about to order a second one. 🤣",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joseph",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZTYNW56CCWZBQNGVG6RWCWKAUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSX98KXDOVULN?ASIN=B0BSTZYZYH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars A great product",
                "reviewText": "I use this when I need support and it helps me flourish!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dowi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIC32VP765DCO2CUPJZ5RWGSK2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M77BUOFMSPD2?ASIN=B0BSTZYZYH",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "1.0 out of 5 stars Leg rest",
                "reviewText": "Too low uncomfortable on the feet",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}