{
    "remaining_requests": 18918,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BleedStopTM-Clotting-Patients-Equipment-Nosebleeds/dp/B0979BZ543",
    "body": {
        "name": "BleedStop™ First Aid Powder for Blood Clotting, Trauma Kit, Blood Thinner Patients, Camping Safety, and Survival Equipment for Moderate to Severe Bleeding Wounds or Nosebleeds - 4 (15g) Pouches",
        "price": "$14.99",
        "originalPrice": "$16.00",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BleedStopTM-Clotting-Patients-Equipment-Nosebleeds/dp/B0979BZ543",
        "soldBy": {
            "sellerID": "ALMPRD02KGPC8",
            "name": "BleedStop™",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ALMPRD02KGPC8&asin=B0979BZ543&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLHK5BKW"
        ],
        "asinVariationValues": [
            {
                "asin": "B0979FHTPD",
                "variationName": "Size",
                "variationValue": "0.13 Ounce (Pack of 1)",
                "price": "$14.25",
                "variationImageURL": ""
            },
            {
                "asin": "B0979D7YRB",
                "variationName": "Size",
                "variationValue": "2 Count (Pack of 2)",
                "price": "$20.00",
                "variationImageURL": ""
            },
            {
                "asin": "B0979BZ543",
                "variationName": "Size",
                "variationValue": "4 Count (Pack of 1)",
                "price": "$14.99",
                "variationImageURL": ""
            },
            {
                "asin": "B09ZBK5RBP",
                "variationName": "Size",
                "variationValue": "BleedStop - 4 Pack 15g",
                "price": "$28.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51GNJmgO5-L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51SHvXDhtiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41upKHQFbdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TcEebr0EL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lTCBXD3JL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ziKdXaxwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514SwCOH7pL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: BleedStop",
            "link": "https://www.amazon.com/BleedStop/b/ref=bl_dp_s_web_38674116011?ie=UTF8&node=38674116011&field-lbr_brands_browse-bin=BleedStop"
        },
        "brand": "BleedStop",
        "merchantInfo": "BleedStop™",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 6379,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 10 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "BLEEDSTOP IS THE ONLY BRAND NAME BLOOD COAGULANT IN ALL WALGREENS, CVS AND WALMART STORES. BleedStop is also available in all RiteAid stores. No other product works as well as BleedStop.",
            "STOPS BLEEDING UPON CONTACT: BleedStop powder is quick, safe and easy to use on moderate to severe wounds, lacerations, cuts, scrapes and nosebleeds (for nosebleeds see BleedStop Nosebleed Strip product available on ), making it one of the most essential supplies for every day first-aid, such as kitchen cuts and protecting your children. Also a necessity for rigorous outdoor activities such as camping, hiking and cycling, among others where moderate to severe bleeding wounds can occur.",
            "WORKS FOR PEOPLE ON BLOOD THINNERS TOO: Are you taking blood thinners regularly Be assured that BleedStop first-aid powder will work to control bleeding for you too.",
            "SAFE and NON STINGING: While BleedStop is used by doctors and in emergency rooms across the country, it can be safely applied on everyone, including kids, whenever needed as it's a non-stinging formula.",
            "HOW TO USE: Simply pour a layer thick enough to cover the entire surface of the wound/laceration before applying firm pressure over the bleeding site using sterile gauze or bandage. BleedStop powder is safe on to leave it on the wound, so it's not necessary to wash it off before bandaging. Please seek emergency medical treatment if bleeding doesn't stop after a prolonged period of time.",
            "Number of items: 1"
        ],
        "description": "BleedStop first aid powder for blood clotting on contact one of the most effective emergency essentials for bleeding accidents outdoors and indoorsWounds, lacerations and nosebleeds are part and parcel of life. While conventional supplies such as bandaids or bandages may protect the open wound from further inflammation, they may not be the most effective when it comes to getting the blood to clot. That's where BleedStop comes in. What is BleedStop A first aid must have that clots blood in just seconds Made from a plant based material in a powder form that, through a proprietary process, concentrates platelets and other clotting factors in the blood to almost instantly create a natural clot that would otherwise take many minutes or hours to form. What are BleedStop effective on Minor to severe bleeding wounds Cuts Scrapes Nosebleeds Why choose BleedStop powder Used by doctors and in emergency rooms across the country Suitable for individuals on blood thinners too Safe and non stinging formula Safe to leave it on wound before bandaging",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b?ie=UTF8&node=3760901"
            },
            {
                "name": "Health Care",
                "link": "https://www.amazon.com/Health-Care-Products-Personal/b?ie=UTF8&node=3760941"
            },
            {
                "name": "First Aid",
                "link": "https://www.amazon.com/First-Aid-Supplies/b?ie=UTF8&node=3762591"
            },
            {
                "name": "First Aid Kits",
                "link": "https://www.amazon.com/First-Aid-Kits/b?ie=UTF8&node=3762881"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 4.61 x 3.54 x 1.54 inches; 0.53 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ June 15, 2021"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ BleedStop"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0979BZ543"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,791 in Health & Household (See Top 100 in Health & Household) #3 in First Aid Kits (Health & Household)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 6,379 ratings"
            },
            {
                "name": "Brand",
                "value": "BleedStop"
            },
            {
                "name": "Special Feature",
                "value": "Camping"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Camping"
            },
            {
                "name": "Color",
                "value": "Bleedstop"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Pepperoni_Pinata",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSS2SXKT42MFVIF3E2CRS6LDF5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G4P9ESXQHBYF?ASIN=B0979BZ543",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2022",
                "reviewTitle": "5.0 out of 5 stars Stopped the bleeding! Effectively.",
                "reviewText": "Honestly would've gone to the ER without a doubt.... without the effective use of Bleedstop. I bled from 7 am on a Saturday all the way to 11 am on a Sunday because I cut my leg with a razor and skinned off the top layer of my skin. It was a very large gash extending from my knee down to almost my ankle... no idea a single swipe of a razor blade could do that.My first approach was to immediately clean the wound and disinfect it on spot. It hurt a lot because blood kept running, so I wrapped a tight towel around it best I could, taped it up (with regular tape), and ran to the nearest CVS store to get Gauze, Wrap, and Medical Tape. I refused to go to an ER at the time because the wound was so shallow of a cut that I don't know what the medical professionals would've done differently. But I am sure they would've done something.Even with consistent pressure applied, I bled through the bandages within a few hours. Made me panic and I knew I needed something else to stop the bleeding. I changed them consistently everytime they bled through.Later in the afternoon, I researched and got BleedStop. Applied the first packet of Bleedstop in the afternoon and followed directions, which stopped the bleeding for a bit. (Thank God)However, when I slept overnight, I bled through the bandages. The warnings on the packet did say to go to the ER if the bleeding didn't stop. I wasn't in a position to have more emergency bills on my hands...given the fact I just went that same week for an infected mosquito bite. And my insurance doesn't kick in until 4 days later (bad timing, right?). So! I took the risk and applied a second packet the next day after cleaning the wound off. (Please do not do this, I knowingly took the risk and it was incredibly stressful awaiting the verdict, hoping I had done the right thing.)It hurt a ton. I held the powder there for 15 minutes firmly, applying the entire packet, before bandaging everything up again. The bleeding miraculously stopped after the second packet!The following day, I examined the wound, and it looked like areas where the powder had aggregated created an effective barrier. So I cleaned up the edges and didn't bother picking off the scabs because I was afraid in doing so would cause me to bleed again. Applied a thin layer of Neosporin after cleaning up the wound best I could without disturbing the scabs, and applied bandages. I had to combine two pads because of how long the gash was and made sure the sticky side didn't touch any part of the wound.I bled just a tiny bit over the next few days, but nothing as significant as what I bled during the weekend.As the days progressed on, I was able to clean more of the powder off without disturbing the overall wound, and eventually all of the powder off. The wound started off looking incredibly dark red, but no signs of noticeable infection occurred so I kept up the regime of removing the bandages, cleaning with soap, cleaning with sterile gauze, applying Neosporin + Aquaphor, then reapplying the bandages. Week and a half into this now, and the skin is looking a ton better and healing up with a scar.This was a painful lesson to be had, but I am so grateful for BleedStop! I bought extra just in case...but hope to never use it again. It's always good to have this on hand in case the unexpected happens, though.",
                "reviewVotes": "231 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rainbows4u2",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTVDCYC2WUKBNMSGKQ3Z64HN46Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39DF3MX9879OW?ASIN=B0979BZ543",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great!",
                "reviewText": "After accidentally cutting foot, used it immediately. Works fast at stopping blood loss. Easy to apply.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AA-DC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXLYHF7GZYPHKGLHM6K2Z57RNZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QLN108IBSV0L?ASIN=B0979BZ543",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Haven't had to use it but happy to have it",
                "reviewText": "I have not had to use this product yet (thankfully!!) But I feel much more prepared having it. I've seen how it works and this technology is amazing.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKRBXQZXSBNIM33JVFGPUERSEVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R44AW6IVXDTP8?ASIN=B0979BZ543",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "4.0 out of 5 stars Quick emergency first aid.",
                "reviewText": "I was lacking this for my nurse bag, now it's complete.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PetPoppa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKZN65IXKNNYWW6S6AL7S3O7CEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E7TANT6YG9GM?ASIN=B0979BZ543",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Bleed stop test proving favorable",
                "reviewText": "With the sheer number of binding and puncturing test (BPT) candidates from our rat penitentiary becoming more limited, we knew we had to find a solution. A sustainable solution that would allow these critical studies to continue. Our very own Dr. Vilhelm Hisen came through by using the blood clotting factor found in this inexpensive and highly dependable product. As our orders increase and Amazon trucks arrive our BPT program is now sustainable. Thank you Dr. Hisen, Amazon, and the Administration. Our work here has only just begun!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3JKHFAN6VEMK7G7UCHINVOBYWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMOAC2QXRR8XL?ASIN=B0979BZ543",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for emergencies",
                "reviewText": "Ordered for a co-worker on blood thinners who had cut himself. Works great.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJGBKLYBZIETL6JHWIMV62CJFOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ILF334MFBF6W?ASIN=B0979BZ543",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Bleed stop",
                "reviewText": "Absolutely helps congeal the blood. Will use again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LittleBit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDRSY5X6GV5D4B2E7P7GQELGIJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MMK2JCPYSWXZ?ASIN=B0979BZ543",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Better To Be Prepared",
                "reviewText": "I didn't know a product like this even existed until I shaved off part of my thumb using a mandolin while preparing food for Christmas. I could not stop the bleeding, which continued for over 30 hours. I called an Urgent Care facility, but they were booked so my only other option was to go to an Emergency Room if the bleeding didn't stop, and it was Christmas Eve. Fortunately, the bleeding finally did stop but I since learned about this product and bought a box for myself and my sister (who is on blood thinners). We both keep it in a kitchen cabinet where cuts are more likely to happen. I don't ever want to go through that again. I believe if I had gone to the hospital, this is the same or similar product to what they probably would've used. It's better to be prepared!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}