{
    "remaining_requests": 18883,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/All-Health-Advanced-Healing-Regular/dp/B07D1CT9DX",
    "body": {
        "name": "All Health Advanced Fast Healing Hydrocolloid Gel Bandages, Regular 20 ct | 2X Faster Healing for First Aid Blisters or Wound Care, 20 Count",
        "price": "$7.99$7.99 ($0.40$0.40 / Count) $7.59$7.59 ($0.38$0.38 / Count)",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/All-Health-Advanced-Healing-Regular/dp/B07D1CT9DX",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B5F9H1KY"
        ],
        "asinVariationValues": [
            {
                "asin": "B07D1C7RFJ",
                "variationName": "Size",
                "variationValue": "4 Count (Pack of 1)",
                "price": "$6.44",
                "variationImageURL": ""
            },
            {
                "asin": "B07D3WD9F7",
                "variationName": "Size",
                "variationValue": "6 Piece Assortment",
                "price": "$4.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07D14GFPR",
                "variationName": "Size",
                "variationValue": "12 Count (Pack of 1)",
                "price": "$18.32",
                "variationImageURL": ""
            },
            {
                "asin": "B07D1CT9DX",
                "variationName": "Size",
                "variationValue": "20 Count (Pack of 1)",
                "price": "$7.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/511zGU MGJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51YO1YJKItL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51t6-NABhbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZW0OFPJsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rrFleAEML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51eFrzQ-FJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41P9RLVnQkL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the All Health Store",
            "link": "https://www.amazon.com/stores/All-Health/page/BAEEAC57-1E6C-4A89-8EEF-58F49BBB5ABC?ref_=ast_bln"
        },
        "brand": "All-Health",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 23048,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "FREE Shipping",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 4 hrs 41 mins",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 16. Order within 14 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Compact by Design (Certified by Amazon) products remove excess air and water, which reduces the carbon footprint of shipping and packaging."
        },
        "features": [
            "Smart-heal Technology promotes up to 2x faster healing by providing a moist wound environment to facilitate the healing process",
            "100% waterproof seal",
            "Helps reduce scarring",
            "Drug-free pain relief",
            "Lasts up to 7x longer than traditional bandages",
            "Actual size of the hydrocolloid bandages (0.83 x 1.65 in )"
        ],
        "description": "All Health All Health Advanced Fast Healing Hydrocolloid Gel Bandages, Regular 20 ct | 2X Faster Healing for First Aid Blisters or Wound Care, 20 Count",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Health Care",
                "link": "https://www.amazon.com/Health-Care-Products-Personal/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3760941"
            },
            {
                "name": "First Aid",
                "link": "https://www.amazon.com/First-Aid-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3762591"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 0.88 x 2.75 x 4.5 inches; 0.63 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 188386"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ August 6, 2018"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ ASO Corp"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07D1CT9DX"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,144 in Health & Household (See Top 100 in Health & Household) #32 in First Aid Supplies #184 in Climate Pledge Friendly: Health and Household"
            },
            {
                "name": "#184 in Climate Pledge Friendly",
                "value": "Health and Household"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 23,048 ratings"
            },
            {
                "name": "Brand",
                "value": "All Health"
            },
            {
                "name": "Material",
                "value": "Gel"
            },
            {
                "name": "Size",
                "value": "20 Count (Pack of 1)"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "0.88 x 2.75 x 4.5 inches"
            },
            {
                "name": "Style",
                "value": "Adhesive"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Antibacterial Sheer Adhesive Pad Bandages, 3 in x 4 in, 30 ct Antibacterial Heavy Fabric Strong Strip Adhesive Bandages XL 1.75 in x 4 in 30ct Advanced Fast Healing Hydrocolloid Gel Bandages, Regular 20 ct Advanced Fast Healing Hydrocolloid Gel Bandages, Large Wound Dressing, 4 ct Extreme Hydrocolloid Gel Blister Cushion Bandages, 1.65 in x 2.67 in, 10 ct Non-Stick Pads, 100 Pads, 3 in x 4 in Use for Minor cuts, scrapes, & burns Minor cuts, scrapes, & burns Minor cuts, scrapes abrasions, lacerations, blisters, & scalds Minor cuts, scrapes abrasions, lacerations, blisters, & scalds Blisters Low to moderately draining wounds Feature Antibacterial agent helps prevent infection Antibacterial agent helps prevent infection Advanced fast-healing for up to 2X faster healing Advanced fast-healing for up to 2X faster healing Multi-day protection & pain relief for blisters Non-stick material absorbs & protects wounds Material Soft, translucent sheer material Durable, heavy duty bandage material 100% waterproof gel bandage 100% waterproof gel bandage 100% waterproof gel bandage Absorbent material with non-stick out layer Antibacterial ✓ ✓ 2X Faster Healing ✓ ✓ Made in USA ✓ ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90ade17c-9c0b-4d77-b7de-0dd228bd3907.__CR0,0,4042,2500_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/66c2e47b-cfb9-4f08-8036-da82b3bbe29b.__CR0,0,4042,2500_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/509bcda9-c372-45a1-a8c5-b5c18ccca66e.__CR0,0,4042,2500_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6783ae08-4327-46c7-a3a2-72654f4ff936.__CR0,0,4042,2500_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee981b7c-0630-4bca-9b9a-aeaf30f5c8c7.__CR0,0,625,1250_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8bfef680-d0be-4592-a6dd-fdeb55c235e7.__CR0,0,625,1250_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4956371-5748-4a18-bd2d-be8824a17061.__CR0,0,625,1250_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6970499d-dfdc-47dc-8766-325067c84dea.__CR0,0,625,1250_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b4a5de29-bdcd-499d-85b4-0e76e94af9e6.__CR0,0,625,1250_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b43340e-04ca-431c-bf80-7ee2e32d96f5.__CR0,0,625,1250_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Susie H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2TID3BUVV4NMG6KNW2KFE3AECQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GRCM21CEUFYX?ASIN=B07D1CT9DX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Cut them to size",
                "reviewText": "These are wonderful. The first time I tried a colloidal bandage was when Band Aid came out with them several years ago. It did what it was supposed to do, but it creeped me out having this milky white area on the bandage where the actual wound is. I learned later that this is what it is supposed to do, but I wonder if other people felt the same. We aren't instruction readers, we Americans. Anyway, I can't find the Band-Aid ones any more, but these are even better. You can buy them in this size and cut them to whatever size you need. They are also much cheaper than the old Band-Aid brand that only came in one size and it was pretty small. You can get a better seal with these because even when you cut them down to the size you need, you can get a good perimeter around the wound that seals completely.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anon m",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGKQ27LCNFVKQR4445ZKTZ4AMCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LJHTJEYRBFNQ?ASIN=B07D1CT9DX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2021",
                "reviewTitle": "5.0 out of 5 stars Amazing advanced healing and protection",
                "reviewText": "I have developed type 2 diabetes due to a number of factors outside of my control. As a result, I am unable to clean in the house normally, and things get stacked up. I have cut my legs really badly a couple of times on some of these things that have stacked up, literally removed all of the layers of skin creating a terrible open wound. I did not find these bandages right away, so I don't know how effective they would be on the initial wounds, however, once the granulation tissue is growing (this is the tissue that grows before the replacement skin/scar tissue grows in), I have found them extremely effective! I'm not a doctor and I don't play one on TV, but there is a lot of knowledge out there if you look in the right places. When in doubt - CONSULT MEDICAL PROFESSIONALS!!!! They can help you identify the best products for your current need!I would also like to say that there is a big question you should always remember to ask when choosing a product:Is this product appropriate for what you want to use it for? For example, acne or large pressure sores (bedsores) - this product is no appropriate for! Definitely not.Acne requires exfoliation and cleansing on a regular basis (twice a day minimally - and other products like tea tree oil soap or other acne products are more appropriate for that. Covering acne up with bandages in most situations is just going to make it worse.Bedsores are pressure sores. They require rigorous attention, frequent dressing changes and for the pressure that caused the bedsore to be relieved for healing!!!Because of the type 2 diabetes, the skin on my legs and feet especially, is compromised. I am not healing as fast as I should. So, with daily dressing changes, cleansing carefully with gentle wound cleansing products and dressing with sterile bandaging and a prescription antibiotic ointment to help keep the wound from getting infected, it slowly got to a point where the granulation tissue had grown. That's when I found these hydrocolloid bandages.I immediately ordered some to try. These bandages are meant to stay on for up to 7 days. they are fully waterproof (though I have learned that really hot water or conditions tends to compromise them so be careful about that! lol) Wearing work gloves with one on my finger caused it to get gooey and stretchy and then it hardened up where it got gooey and stretchy, but as long as it stays on, it still protected and seemed to do its job.One of the other things that I found is that it is important to ensure that the size of the bandage is plenty large - it needs to fully cover the wound with, I would say a minimum of a half inch of additional bandage around the wound area. This is because of the \"hydro\" part. The bandage works with your bodies immune system and so it absorbs fluids. As the product details inform, a white bubble may appear over the wound - this is fluid collecting. This collection does seem to make the bandage under the area where the fluid collected less adhesive (no surprise really). So the extra bandage around the edge of the wound will help to ensure it remains waterproof and that it continues to adhere well.The wound on my leg has accelerated healing and after only three weeks (and three of these 4\" bandages) it is almost completely healed up now. I'm applying one more, and I expect that next week at this time, when I remove that 4th bandage, the granulation tissue will be gone and normal scar tissue will have finished forming. Until then, gotta keep the bandage on!This bandage is also supposed to be antibacterial and help with pain. Once I applied the bandages, I hardly knew I had a bad wound on my leg, so they must be doing something right lol.I would like for the packaging to describe more how they are antibacterial and how they help with pain because I like to understand how every product or medication that I use is working. but, aside from that small lack of info, I am super happy to have found these hydrocolloid bandages!I also used on for a slice across my finger - I had a little trouble keeping this one on at first because it's over a knuckle but it eventually adhered well (the extra around the edge was important here)And, when I told my doctors about them, they knew what they are and reacted very positively to my choice to use them for these wounds, so that made me feel pretty good as well.I definitely recommend these bandages! However, I also recommend that if you don't understand the proper use (and that's ok!) seek medical advice for the best bandages for your needs! :-)",
                "reviewVotes": "57 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gina Fumi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKEOC42AVKZLKGGOLGLZI6UHHBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JVZO8IS7QHCS?ASIN=B07D1CT9DX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Life Saver",
                "reviewText": "I had a bad accident with a mandoline slicer on Thanksgiving. Although I was using the guard it slipped and I sliced a large chunk of skin off my thumb near my knuckle past the white meat! Since it was the holiday I didn’t want to spend it in the hospital or urgent care. I probably should have gotten stitches it was bad! It bled for over four hours but I kept wrapping it in gauze. Well eventually it stopped bleeding but the gauze got stuck on the wound and to peel it off hurt more than the injury itself. I did some research and heard about these bandages on You Tube. I had a small piece of gauze still stuck to the wound and I was afraid it would cause an infection. Cleaned wound put bandage on for three days,by the third day the gauze came off while putting the next a new bandage on. No pain!! I’m very impressed and keeping the wound moist as opposed to airing it out is the key to healing perfectly!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AreAitch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFH7SDY4DCKKMM7EMT56ZDTO7Y2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EQMNOKIDPFYQ?ASIN=B07D1CT9DX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "4.0 out of 5 stars Difficult to unwrap",
                "reviewText": "I can remove the first piece of paper (barely) to get to the bandage. However, when I pull on the blue strip, the entire backing comes off and appears to take the admesive part with it. Worked the first time, but not again until the 5th time. Seems to work well if you can figure out the packaging",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allison",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVV6QH6HPOOXSBLYDKPCB64NKIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NMS404GAZSP5?ASIN=B07D1CT9DX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing product",
                "reviewText": "I bought these four zit patches when I need something a little bit bigger than the regular hero circle patch. They work wonders in removing extra nasty stuff from the skin. They do hurt a tad when removing but definitely worth the price and how many you get the size is perfect.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yomo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENBTKOVNRVPOB6D46YCL7GPY7RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DK0TTT02MRMU?ASIN=B07D1CT9DX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Great adhesion, cushion makes a HUGE difference",
                "reviewText": "I've repurchased this item multiple times. For larger wounds, this is the perfect size. The cushion element of this product is amazing and seriously a game changer. It provides extra protection from clothing rubbing on the affected area. The adhesion is great and can be worn in the shower with no problems. Make sure that you skin is clean, dry, and free from any oils/lotions before applying. You could wear these for multiple days. Removing was a little tricky because they really don't want to come off. I use a medical adhesive remover pad to remove and it works perfectly. Would highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shanda Dornburg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDYLORAEUTZOCWFFCYX77XKSOKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZL3VIKTJU6J6?ASIN=B07D1CT9DX",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "3.0 out of 5 stars Very small bandage.",
                "reviewText": "I bought these bandages to use after I had surgery post carpal and cubital tunnel surgery. They were too small to cover the surgical area. They are quite small I am not sure what kind of small wound would merit such a small \"special\" and for its size \"costly\" bandage.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna F",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3OBEE5UHV6TRFP53C3AWJGADBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JUVI385XFYIZ?ASIN=B07D1CT9DX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars I love these bandages!",
                "reviewText": "My friend gave me this brand bandage when I cut myself at her home! I love that they are durable in water and adhere great! I immediately bought a box of each size !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scan Thriller Fan and Cat person",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 21, 2023",
                "reviewTitle": "These really really work",
                "reviewText": "This is the second time I’ve needed really large bandages which could be left on a wound for more than a day (or 1/2 an hour in the case of most bandages). I would recommend them to anyone who needs to cover and protect a nasty wound.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lauren Anthony",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 14, 2022",
                "reviewTitle": "these are a game changer",
                "reviewText": "my boyfriend suffers from really bad psoriasis and health issues and he gets really bad acne and these not only can you cover up something you're embarrassed to go out in public having on your face and you literally cannot even tell, it's exactly skin tone and they're semi translucent so they can probably adhere and blend it with pretty much almost any skin tone. new favorite product for sure. they also heal you like three times as fast they're seriously miracle patches. think not twice! get them. i have pre diabetes and its hard if i scrape my leg or something to heal and these helped heal an ulcer on my leg in like two days it was crazy. very good product. will continue to buy always for the rest of my life. ;) just a hint though literally don't take them off until they come off themselves or its a waste of your time. you gotta actually follow the instructions. only bad side to them is they do inflate sort of looking like a white bubble under the bandaid because i guess they're like suctioning out the infection etc after a day so before they fall off. so for like half a day they look kinda weird but they literally will heal so fast its not even worth the concern",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VanEstCis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 16, 2021",
                "reviewTitle": "Cumple",
                "reviewText": "Ayuda a sanar heridas, muy bueno",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne ✨",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 18, 2021",
                "reviewTitle": "Not just for blisters !",
                "reviewText": "I use them for face pimples and they really seem to work !!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on March 2, 2023",
                "reviewTitle": "A bit old as sticking to the paper but othewise seems ok",
                "reviewText": "A bit old as sticking to the paper but othewise seems ok",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.99",
                "sellerName": "Instaclear&All-Health",
                "sellerRating": "4.5"
            }
        ]
    }
}