{
    "remaining_requests": 18726,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Commuter-packaged-compact-emergency-camping/dp/B000SL0R9K",
    "body": {
        "name": "Lifeline -4184AAA AAA 85 Piece Commuter First Aid Kit packaged in compact hard shell foam carry case, ideal for emergency use in cars, camping, hiking, or offices alike , Red",
        "price": "$19.99",
        "originalPrice": "",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Commuter-packaged-compact-emergency-camping/dp/B000SL0R9K",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07H8ZTFWV"
        ],
        "asinVariationValues": [
            {
                "asin": "B000SL2GNU",
                "variationName": "Size",
                "variationValue": "53pc",
                "price": "$27.80",
                "variationImageURL": ""
            },
            {
                "asin": "B000SL0R9K",
                "variationName": "Size",
                "variationValue": "85pc",
                "price": "$19.99",
                "variationImageURL": ""
            },
            {
                "asin": "B000SL4A84",
                "variationName": "Size",
                "variationValue": "121pc",
                "price": "$29.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51tSjaDYexL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51PORT7zrCL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the LIFELINE Store",
            "link": "https://www.amazon.com/stores/Lifeline/page/A0BF489D-4A60-41D6-AC7A-13B1AC158540?ref_=ast_bln"
        },
        "brand": "Lifeline",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1647,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 4 hrs 38 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "AAA QUALITY: With the backing of the most trusted name in the automotive industry, you know you are getting only the highest quality safety products with this AAA branded 1st aid kit!",
            "ESSENTIAL SAFETY COMPONENTS: With 85 essential preparedness items; from an emergency whistle to simple bandages, this quality first aid kit will keep you ready to treat minor cuts and scrapes that occur while on the road or at home.",
            "PORTABLE: Our one of a kind hard shell foam carry case keeps your first aid supplies organized and is lightweight and compact enough to store easily in your auto glovebox, or your backpack for outdoor adventures like hiking, backpacking, skiing.",
            "ISO CERTIFIED: Lifeline First Aid, the exclusive licensee of the AAA brand for automotive first aid and safety product is ISO certified, so you know when you purchase our first aid kits you are getting only the highest quality, FDA compliant, safety product.",
            "IDEAL MEDKIT: With over twenty years of experience building automotive safety and first aid product, you can rest assured that our kits are the ideal mix safety product."
        ],
        "description": "For more than twenty years, Lifeline First Aid has provided unique roadside emergency kits, first aid kits and outdoor survival kit, and while we have grown in size over that time our goal have remained unchanged; to provide quality products, unique items and exceptional customer service. As the exclusive licensee of the AAA brand for automotive safety and first aid items, only the finest first aid safety and roadside emergency prep product make it into our car emergency kits, road kits, and first aid kits. And while our first aid kits under the AAA name are built to be a first aid kit for your car, that is hardly the only place they can be useful for. Our high quality hard shell foam carry and storage cases make our kits ideal for storage in backpacks for outdoor adventures, sports event, or even storage in the drawer at home for treating those bumps and scrapes sneak up on us.Our 85pc AAA Commuter Hard Shell Foam First Aid Kit is the perfect balance of number quality emergency components and size. The Kit includes;AAA HARD-SHELL FOAM CASE, CARABINER, FIRST AID GUIDE, SCISSORS, TWEEZERS, 14 ALCOHOL PREP PAD, 3 STING RELIEF PAD, 6 ANTISEPTIC TOWELETTE, 20 3/8” X 1-1/2” BANDAGE, 10 3/4” X 3” BANDAGE, 2 KNUCKLE BANDAGE,3 KNEE/ELBOW BANDAGE, 4 2” X 2” STERILE GAUZE PAD,2 3” X 3” STERILE GAUZE PAD, 4” X 4” STERILE GAUZE PAD, 5” X 9” COMBINE DRESSING, 2” CONFORMING GAUZE ROLL, TRIANGLE BANDAGE, 1/2” ADHESIVE TAPE ROLL, 10 BUTTERFLY BANDAGE, EMERGENCY WHISTLE",
        "breadCrumbs": [
            {
                "name": "Sports & Outdoors",
                "link": "https://www.amazon.com/sports-outdoors/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3375251"
            },
            {
                "name": "Outdoor Recreation",
                "link": "https://www.amazon.com/outdoor-recreation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=706814011"
            },
            {
                "name": "Camping & Hiking",
                "link": "https://www.amazon.com/camping-hiking/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3400371"
            },
            {
                "name": "Safety & Survival",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3401081"
            },
            {
                "name": "First Aid Kits",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3401101"
            }
        ],
        "productInformation": [
            {
                "name": "Manufacturer",
                "value": "‎Lifeline"
            },
            {
                "name": "Brand",
                "value": "LIFELINE"
            },
            {
                "name": "Model",
                "value": "‎AAA Commuter First Aid Kit"
            },
            {
                "name": "Item Weight",
                "value": "‎11.2 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎6 x 2.8 x 8 inches"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎4184AAA"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Manufacturer Part Number",
                "value": "‎4184AAA"
            },
            {
                "name": "Special Features",
                "value": "‎Compact"
            },
            {
                "name": "ASIN",
                "value": "B000SL0R9K"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,647 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#91,286 in Sports & Outdoors (See Top 100 in Sports & Outdoors) #114 in Camping First Aid Kits"
            },
            {
                "name": "Date First Available",
                "value": "November 26, 2006"
            },
            {
                "name": "Special Feature",
                "value": "Compact"
            },
            {
                "name": "Number of Pieces",
                "value": "85"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Emergency Preparedness"
            },
            {
                "name": "Color",
                "value": "Red"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Dependable Quality For more than 100 years, AAA has provided quality services and resources to help their members experience safer and more enjoyable travel. By continuing to uphold principles such as rock-solid reliability and lasting value, AAA has established its reputation as the most trusted name in travel. LifeLine First Aid's shared commitment to quality and value prompted AAA to partner with them to offer its brand for retail sale for the very first time in company history. Together, they bring you a series of First Aid Kits equipped with practical, reliable first aid treatment components. AAA Commuter First Aid Kit Equipment that Keeps you Safe and Comfortable AAA means quality, and with the 85 Piece AAA Commuter First Aid Kit, that is what you get. You never know where the road may lead or what may happen, so don't be caught unprepared. LifeLine First Aid--a leader in the field of first-aid and disaster readiness products--has teamed up with AAA to bring you a line of high quality First Aid Kits. Featuring high quality first-aid components, this first aid kit can help protect you or a loved one in the event of a personal injury. If an accident or personal injury were to occur during your trip, would you be ready to deal with it? Being unprepared for a situation requiring first-aid can turn an inconvenience into something much more serious. The kits convenient size and carry case makes it ideal for storing in the car, and then taking it with you when you go on hikes, camping, sporting events etc. The Kit contains a variety of medical supplies that can address a wide range of minor injuries to help keep you prepared. 85 Pieces of First Aid Hard Shell Foam Carry Case Easy to Store",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/001888e5-33f8-488f-a3ff-d0f478a84725._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/99911112-3293-458c-b321-8130d8e8c225._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "What's in the Kit? The 85 Piece AAA Branded Commuter First Aid Kit comes packaged in a high quality, easy to store, hard shell foam carry case that helps keep the fist aid supplies organized. Each kit contains the following first aid supplies;First aid instructions, scissors, tweezers, 2 vinyl gloves (1 pair), 1 whistle, 3 sting relief pads,6 antiseptic towelettes,14 alcohol prep pads, 1 triangular bandage, 1 5 x 9 inch combine dressing, 20 3/8 x 1 1/2 inch bandages, 10 standard adhesive bandages, 10 butterfly bandages, 1 knuckle bandage, 2 knee/elbow bandage, 1 4 x 4 inch sterile gauze pad, 2 3 x 3 inch sterile gauze pads, 4 2 x 2 inch sterile gauze pads, 1 2 inch gauze roll, 1 adhesive tape, 1 carabineer.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/6cd72a3c-8777-4683-ab96-4a786d71cfa0._SR300,300_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/001888e5-33f8-488f-a3ff-d0f478a84725._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/99911112-3293-458c-b321-8130d8e8c225._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/6cd72a3c-8777-4683-ab96-4a786d71cfa0._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGE6SXBRZ6CKORNNWBKHVFARJJYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3W48XCDOCAMU?ASIN=B000SL0R9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Compact First Aid Kit for Auto",
                "reviewText": "This kit contains all the essential items needed to render first aid for most minor injuries. Small enough to store in your car or carry on a hike with the included carabiner clip. The protective hard shell case is a plus.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2FGWNZFQK4VY3NIQL32NSNJC6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R281BM9Z439KKQ?ASIN=B000SL0R9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2014",
                "reviewTitle": "5.0 out of 5 stars It's a pretty good set and I like how compact it looks",
                "reviewText": "The little bag is sort of a hard shell case. It has all the goods you have come to expect in a road or home first aid kit. I like that carabiner too, not that I know where to hang the kit. I guess you can hang it on your backpack or belt if you're hiking or mountain biking. Definitely not for hanging onto a rope when rock climbing though. hahaEverything is well packed and the transparent pockets seem to fit everything perfectly, which makes me think that the manufacturer really thought this through. Inside the first aid kit are hella bandages of many sizes, gauze pads of many sizes, alcohol prep pads, antiseptic pads, anaesthetic pads, tape, gloves, a pair of scissors, tweezers... I guess the standard stuff. I like how the bandages differentiate from \"sterile guaranteed\" to \"non-sterile\". The prep pads, antiseptic pads (benzalkonium chloride), and anaesthetic \"sting\" pads (benzocaine) look so similar in size and shape, and are all enclosed inside the same pocket flap, so it's a good idea not to panic when treating someone/yourself and read the labels carefully, which are in clear and huge fonts anyway. As well, I recommend you read the little guide included in one of the pockets, as there are some information on providing aid in cases of poisoning, open wounds, bleeding, choking, shock, burns, fractures, dislocations, heat strokes, and even fainting.One thing I did not expect the kit would have is a red whistle, which even comes with a yellow lanyard so you can hang it on your neck. I can really see this as vital for \"commuters\" or when hiking or mountain biking as perhaps a \"last attempt\" for getting help from passersby.Overall, I really like my first aid kit. I bought this to prepare my emergency 72-hour kit. At first I wanted to just buy the stuff separately, but now I see that the entire kit is well worth the money. It's cheap on Amazon too! I highly recommend it, and the \"AAA\" branding is a nice, comforting touch too.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DinoxorDinoxor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXYH247T3TSN7TOI3ABUCWNQSDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5S7EOERCQZZS?ASIN=B000SL0R9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2015",
                "reviewTitle": "5.0 out of 5 stars Great first aid kit for a bike commuter",
                "reviewText": "Excellent kit. Has all the basic necessity needed for a bike commuter.The outer shell:It's a bit bulky but it fits snugly inside my Topeak trunk bag. Conversely, the shell feels robust enough to have it attached outside my bag without having to worry about it cracking under pressure if I were to fall or run into something.Unlike the plastic box, the bright red color really catches your eye and the zipper allows the case to deform and hold whatever you shove inside securely.The only flaw I see is the clear vinyl pockets that may rip. Mesh would have been a better option for a see through and expandable pocket.Content:Attached is a picture of everything that is included in the kit.This kit is sufficient for everyday minor injuries.The tweezer feels a bit cheap and you may want to replace it.Everything else seems neatly organized and packaged properly.Extra stuff:It's nice that the case is able to hold extra item so I went ahead and placed the following inside:PenSmall \"Field notes\" notepad3 advil pills3 plastic ziploc bags3 packets of Pedialyte (electrolyte packets for dehydration)small, hand sanitizersafety pins4 medium gauze padsa roll of waterproof adhesive tape (bikers tends to get sweaty)metal tweezersConclusion:I am very content with this kit and will purchase another one for my car.Please review the first aid instruction included beforehand and familiarize yourself on how to use each item effectively. (I didn't know alcohol prep and antiseptic towelettes are different and are used differently)You'll never know when you'll need this and I wish I had purchase this sooner since accidents do happens when you least expect it.(Unrelated, but an older lady fell off her bike on a bike trail and literally ripped her skin open to where the skin was flapping and her bones was peeking underneath. Had I had this first aid kit, I would have been able to clean the wound, apply butterfly bandage, apply pressure with clean gauze, wrap the wound, and elevate her arm with the triangular bandage.)Hopefully this review helps and I will update it periodically.",
                "reviewVotes": "89 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71ZLXwE-P4L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gianna Chrgoy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 29, 2018",
                "reviewTitle": "Buena calidad",
                "reviewText": "Igual que la foto con todos los aditamentos, buena calidad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marie-Josée Roy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 20, 2017",
                "reviewTitle": "Satisfait",
                "reviewText": "Tel que décrit",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bruce Moncur",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 5, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "Every car should have one",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}