{
    "remaining_requests": 18652,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Home-Car-First-Aid-Kit-Camping-Essentials-Empty-Labelled-Waterproof-Businesses-Emergency/dp/B0CPDNQ6T5",
    "body": {
        "name": "Home-Car-First-Aid-Kit-Camping-Essentials-Empty Bag, Labelled, Double Layer, Large Empty Waterproof Zipper Medical Storage Bag, Idea for Vehicles, Businesses, Travel, Boat, Hiking, Emergency Survival",
        "price": "$22.88$22.88 ($22.88$22.88 / Count) $21.74$21.74 ($21.74$21.74 / Count)",
        "originalPrice": "",
        "rawPrice": 22.88,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Home-Car-First-Aid-Kit-Camping-Essentials-Empty-Labelled-Waterproof-Businesses-Emergency/dp/B0CPDNQ6T5",
        "soldBy": {
            "sellerID": "ABMJKDF1S74IW",
            "name": "Pumier Medical",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ABMJKDF1S74IW&asin=B0CPDNQ6T5&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ag2jIWwoL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51DbR06dr L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JN4Ve9biL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ehOFitz4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51J-GElxgeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sC RYDr5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cKomph52L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Pumier Store",
            "link": "https://www.amazon.com/stores/Pumier/page/61CACEC5-39E0-4CC8-BBA3-078B65EF4B4C?ref_=ast_bln"
        },
        "brand": "Pumier",
        "merchantInfo": "Pumier Medical",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 20,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 14 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "💎【DURABLE, STEADY & SHOCKPROOF】- Pumier first aid empty bag is made with wear-resistant 600D Oxford cloth, and there are 10mm thick air cushions filled around the bag, which are anti-drop, seismic, and three-dimensional.",
            "🏷️【SCIENTIFIC STORAGE】- Double layered design with 13 types detailed classification labels, it can help you quickly and conveniently get what you need.",
            "🌟【SURPRISE STORAGE SPACE】- Storage Capacity > 300pcs",
            "🚗【PERFECT FOR CAR OR CAMPING】- 11\" x 8\" x 3\" compact size, 0.77lb lightweight. It’s easy to carry that fits anywhere in your car, RV, atv, yacht, boat, jeep, bike or motorcycle. Ideal for home, workplace, outdoor, travel, businesses, office, boat, camping, hiking and other emergency situations.",
            "❤️【APPLICATIONS】- Home, Garage, College dorm(Dorm room), Office (Businesses), Car (Vehicle) Truck, Boat(Kayak), Bike, Sports teams, Golf , Hunting, Family outing, Travel (Road trip), Fishing, Hiking & Survival, Camping, Backpacking, and on the go use.",
            "❗ This is an empty bag with first aid print, need to buy first aid kits together use."
        ],
        "description": "Home-Car-First-Aid-Kit-Camping-Essentials-Empty Bag, Labelled, Double Layer, Large Empty Waterproof Zipper Medical Storage Bag, Idea for Vehicles, Businesses, Travel, Boat, Hiking, Emergency Survival",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Health Care",
                "link": "https://www.amazon.com/Health-Care-Products-Personal/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3760941"
            },
            {
                "name": "First Aid",
                "link": "https://www.amazon.com/First-Aid-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3762591"
            },
            {
                "name": "First Aid Kits",
                "link": "https://www.amazon.com/First-Aid-Kits/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3762881"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "11.97 x 9.37 x 2.68 inches"
            },
            {
                "name": "Item Weight",
                "value": "11.7 ounces"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Pumier"
            },
            {
                "name": "ASIN",
                "value": "B0CPDNQ6T5"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 20 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#384,017 in Health & Household (See Top 100 in Health & Household) #1,340 in First Aid Kits (Health & Household)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ElishaElisha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2MX5PSW72FS4BORWG4AVYXVURQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R158TLQSAZP2EP?ASIN=B0CPDNQ6T5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Very high quality first aid bag",
                "reviewText": "Husband says:I’ve been a firefighter/paramedic for 15 years. I wanted a first aid molle bag to keep in my truck. The back of my seats have molle attachments and I wanted something I could grab quickly if needed. This bag does EXACTLY what I’d want it to.What I love it:Great quality and perfect size. I was able to get all the things I wanted in the bag and it’s organized.Zippers: 8/10. They open smoothly and are water resistant zippers - the zipper teeth are covered when closed which protects the zipper and helps reduce water ingress. This is a good feature that I was surprised to see. Why 8/10? Zippers aren’t brand name and I can’t one handed rip the pouch open if needed. Many GREAT bags have this ability. I’d have been shocked if this did, since that’s a top of the line bag feature. To be clear, many of the bags my agency uses would be very similar quality to this - it’s very good.. just not the best of the best.Quality of materials: 10/10It is extremely well put together. QC on my bag was great or I just got EXTREMELY lucky. Again, this bag is passable for one of my agencies bags.Internal organization: 9/10The tags and what it calls for is great. I can see the value in most of the things listed. I added a couple things and took away a couple others just based on my area, needs, and the types of first aid I expect to encounter.I have a separate mount for a CAT tourniquet, but I’ll likely add another CAT here just in case. The only thing I think they could have added was a designated place for trauma shears. Not a big deal but it seems like an oversight.Overall rating for me is 9/10. This is an incredible bag for $23!I added the following because these are thing I find valuable for myself and my family:*super glue*electrical tape. I find personally (for myself and my family) that electrical tape is one of the best ways to apply pressure a persistent bleed.*16g IVs. They’re amazing tools for removing splinters and the IV catheter is useful for a lot of irrigation tasks.*a couple life saving meds that I can’t go into detail on hereIf I could ask for three improvement from the manufacturer, these would be it:1. Get rid of the home, car, travel, camping label on the front. It’s a cosmetic gripe but how things look is important to me. People don’t need to be told where to use their first aid kit.2. Add an external mounting location for a tourniquet. In my opinion, when it’s actually needed, TQs are needed as fast as possible and should be in plain view.3. A separate molle panel that the bag velcros to would make this bag much more mobile for my use. I realize this would increase the cost but it would make it much more functional for a quick grab situation.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/718+-G6hNKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/718MpDbKc2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81cz4CTA9vL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "T P in AustinT P in Austin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBAS2PWPFT7OFDKRM7OCK6ROLZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R112WTKA21FI37?ASIN=B0CPDNQ6T5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "4.0 out of 5 stars It is empty, it is tough, it opens backwards from what I expected.",
                "reviewText": "Vine review for an empty first aid kit bag. This one feels tough/durable. It seems to open the reverse from a typical book. (\"First Aid Kit\" is on the back cover) I tried to put the photos in order. The blue labeled pouches are on the outside wall and the red labeled pouches are the two sided extra \"page\" in the center.There is some discussion in reviews about those labels. I think they are adequate and we can adapt. But I do have a problem with the blue \"Saline\" area. Is it properly placed or properly sized? Added a photo showing very short pocket and attempts to fit saline bottles to even get close to fitting. The bottom pocket is just too short. Perhaps they have some small diameter, tall test tube sized saline where this was designed and made? That elastic line height I highlighted by drawing crude red lines, There seems to be room for 5 of them, with one of those a smaller diameter., Additionally, it seems the bottles/tubes could have been coddled better on the inner page and let the swabs and emergency blanket be on the outside wall to better absorb... future shocks! The mollie straps, D rings and handle all add to the package.But for overall functionality, toughness and price, I rated this a 3.7 star. And I do plan to get organized with it, though I may modify that saline area!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81KSHs2hJ3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Otga4RAXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91Fvm4oFlHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91gdD0gfO4L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91xUQdmiEyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ACRE Investments LLC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXELTYRGOUQWJONIQJ52MKSHJZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CPOEU3FR8VI3?ASIN=B0CPDNQ6T5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars EXCELLENT 1st-Aid Empty Bag for Building Your Supply Kit",
                "reviewText": "Let me state up front that I am an expert in first-aid kits for I sold them for over 30 years. Dummy me too, I originally thought it came with all the supplies included but I was in a rush and did not read all the details. It clearly states in the headline that this is for an EMPTY Bag right upfront. Not their fault. My goof.BOTTOMLINE: I loved this 600 denier cordura-like heavy-duty first-aid kit bag. IT IS VERY WELL MADE! I could find no faults, only positives. A good quality first-aid kit is essential for emergencies & survival and this is a great start to building your own custom kit.Yes, it does open backwards to what we traditionally expect (maybe it is for the Hebrew market...joke), but it is very nicely laid out. Their are 3 leaf compartments that have a +/- 1/4\" inner padded layer in-between the inner and outer layers. The padding is a nice addition to protect your inner kit supplies. Kudos to the designer. It is the first time I have seen that done in a kit. At the top of the bag is a nice carrying handle, too.Back in my first-aid kit & survival supply days, I would have sold this bag for about $35-$40 if USA made, so this is a deal at under $24! This completed kit you fill is ideal for camping, kids sporting teams, small groups & families, RV's, boats and travel trailers. I estimate the cost to fill it with fresh supplies would be about $50 to $75 depending on the quality of supplies you fill it with. I once sold a full kit like this for $150, so you'll save about 50% by doing it yourself!The whole kit is water resistant and the zippers are waterproof and worked flawlessly. The extra string extensions on the zipper tab make for opening the bag faster when time counts to get to your supplies out fast. There are 3 back \"D\" rings on the back of the bag for hanging and there are also MOLLE ballistic nylon web straps for securing the bag to a backpack or the like.Internally, the bag has 4 sections with 13 classification first-aid zone compartments. Each compartment shows what contents are inside. There are two zippered compartments and the rest are pouches with elastic strips at top to hold your supplies in more securely. The the inner compartments are made of see-thru mesh. It is so nice to see everything easily at a glance.HEY GUYS, OVERALL I give this bag two-thumbs up and 5-STARS. It is hard to beat this quality of a first-aid bag and all the organization compartments it has. HIGHLY RECOMMENDED.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}