{
    "remaining_requests": 18778,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/First-Aid-Home-Travel-Comprehensive/dp/B0C4WCRGD2",
    "body": {
        "name": "Asani First Aid Kit - 200-Piece Emergency Trauma Set, Compact with Molle Attachment, Ideal for Home, Travel, Car, Hiking, Camping, RV, Comprehensive Medical Needs at Home and Outdoors",
        "price": "$44.99$44.99 ($44.99$44.99 / Count) $42.74$42.74 ($42.74$42.74 / Count)",
        "originalPrice": "",
        "rawPrice": 44.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/First-Aid-Home-Travel-Comprehensive/dp/B0C4WCRGD2",
        "soldBy": {
            "sellerID": "A1WMFB7P808BWJ",
            "name": "MLC Distribution, Inc.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1WMFB7P808BWJ&asin=B0C4WCRGD2&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51zX1Pu8SVL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51951ybb0YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xfUX5PunL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-pD3obSXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lny0xUw2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518IPThLuoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UJSwLylNL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Asani Store",
            "link": "https://www.amazon.com/stores/Asani/page/94897849-BD41-453A-8A32-40FC482713A9?ref_=ast_bln"
        },
        "brand": "Asani",
        "merchantInfo": "MLC Distribution, Inc.",
        "customerReview": "5.0 out of 5 stars",
        "customerReviewCount": 172,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 15 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "EMERGENCY READY: Equip yourself with the Asani Trauma Kit – a comprehensive set with 200 vital components such as bandages, wipes, gauze pads, tourniquet, ice pack, splint, emergency blanket, flashlight, and beyond. Be prepared for any situation life throws your way.",
            "EFFICIENT ORGANIZATION: Streamline your response to emergencies with our Asani Trauma Kit. The color-coded, labeled compartments ensure swift access to supplies, eliminating the confusion often found in standard kits. Spend less time searching and more time effectively.",
            "VERSATILE LIFE-SAVER: Perfect for home, travel, car, camping, hiking, sports, or boating, this first aid pouch is a space-saving hero. The Molle-compatible Velcro panel ensures easy attachment to your backpack for on-the-go adventures.",
            "SMART DESIGN: Our travel first aid kit's Molle-compatible feature and sturdy 600D Ripstop polyester, coupled with reflective stitching, make it perfect for any adventure, fitting seamlessly with tactical gear like military-style backpacks.",
            "ON-THE-GO PREPAREDNESS: Rely on Asani for top-notch quality and versatility with our adventure-ready first aid kit. Stay primed for the unexpected, whether you're exploring the outdoors, camping under the stars, or confronting emergencies head-on."
        ],
        "description": "Prepare for any situation life throws your way with the Asani Trauma Kit, a comprehensive set boasting 200 vital components including bandages, wipes, gauze pads, tourniquet, ice pack, splint, emergency blanket, flashlight, and more. This trauma kit ensures efficient organization with color-coded, labeled compartments, eliminating the confusion often found in standard kits and allowing you to spend less time searching and more time responding effectively to emergencies. Its versatility makes it a space-saving hero, perfect for home, travel, car, camping, hiking, sports, or boating. The Molle-compatible Velcro panel enables easy attachment to your backpack for on-the-go adventures. Designed with intelligence, the travel first aid kit features Molle compatibility, sturdy 600D Ripstop polyester, and reflective stitching, seamlessly fitting with tactical gear like military-style backpacks. Rely on Asani for top-notch quality and versatility with this adventure-ready first aid kit, ensuring you stay primed for the unexpected, whether exploring the outdoors, camping under the stars, or confronting emergencies head-on.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b?ie=UTF8&node=3760901"
            },
            {
                "name": "Health Care",
                "link": "https://www.amazon.com/Health-Care-Products-Personal/b?ie=UTF8&node=3760941"
            },
            {
                "name": "First Aid",
                "link": "https://www.amazon.com/First-Aid-Supplies/b?ie=UTF8&node=3762591"
            },
            {
                "name": "First Aid Kits",
                "link": "https://www.amazon.com/First-Aid-Kits/b?ie=UTF8&node=3762881"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 13.07 x 9.02 x 5.83 inches; 2.89 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ CT160"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ May 10, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Risen Int'l Industrial Co.,Ltd"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0C4WCRGD2"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#151,216 in Health & Household (See Top 100 in Health & Household) #513 in First Aid Kits (Health & Household)"
            },
            {
                "name": "Customer Reviews",
                "value": "5.0 5.0 out of 5 stars 172 ratings"
            },
            {
                "name": "Brand",
                "value": "Asani"
            },
            {
                "name": "Special Feature",
                "value": "Camping"
            },
            {
                "name": "Number of Pieces",
                "value": "200"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Emergencies,Emergency,Travel"
            },
            {
                "name": "Color",
                "value": "Red"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lisa G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTWPI34LQAAD6B7RS3HILX4NQ5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22XCIO5WX7VWY?ASIN=B0C4WCRGD2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Everything you need",
                "reviewText": "The size is perfect for travel and home and has most everything you need. It is well organized and labelled so you can easily find what you need. Great little kit to keep in a car for our outdoor adventures.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEN2ZHDLXMWABTPG3BKR4H7BPYZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ3GV927WG62Y?ASIN=B0C4WCRGD2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Best in Class",
                "reviewText": "I chose this over many other options available because it was designed more as a true trauma kit rather than as a \"boo-boo\" bag. Good organization of the kit with easy-to-read labels is perfect when you are stressed in a real emergency and need to act fast. Right size, right components, right layout, right price. Bought two, one for each car.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristen G.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNWDOADFVXPUQH4UNEIVMX4CGYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6KADYCLQ3SQX?ASIN=B0C4WCRGD2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for the Camper or traveler!!",
                "reviewText": "I love the size, organization, and items in this kit. Great to keep in the camper. And I like that I can hook it on things. Also would be good to keep in a vehicle.Great all around first aid kit!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Celeste DimichinaCeleste Dimichina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM7ZO3ZT2EPHAA4WG5SMT6WS5TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R391W8CLTCF0TY?ASIN=B0C4WCRGD2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2023",
                "reviewTitle": "5.0 out of 5 stars A Must-Have for Every Home, Road Tripper and Adventurer!",
                "reviewText": "I recently purchased the \"First Aid Kit for Home and Travel - 200 Piece Set - Compact Trauma Emergency Kit,\" and I must say, it has exceeded my expectations in every way. This comprehensive kit is a true lifesaver, whether you're at home, on the road, or exploring the great outdoors.The first thing that caught my attention was the thoughtful organization. The labeled compartments make it incredibly easy to find exactly what you need in a high-stress situation. No more digging through a jumble of supplies to find that one bandage you desperately need! This level of organization is especially appreciated when time is of the essence. Not to mention, when you need to replenish supplies, you can see what you have, what you need, and you'll know exactly where it goes!With 200 pieces, this kit truly covers all the bases. From basic band-aids to more specialized items like tweezers, instant cold packs, a tourniquet, an (ear piercingly loud) whistle, a flashlight and a CPR kit, I feel confident that I'm prepared for any emergency. I was especially pleased to find a good variety of sizes in bandages and dressings – something that other kits often skimp on.One of the standout features is the MOLLE-compatible attachment. This is a game-changer for outdoor enthusiasts like me. I can easily attach the kit to my hiking backpack or camping gear, ensuring that I have access to first aid supplies no matter where my adventures take me. It's a small touch that makes a big difference in terms of convenience and accessibility.The compact size of the kit is another plus point. It doesn't take up much space, making it perfect for storing in a glove compartment, backpack, or even a kitchen drawer. Despite its small size, the kit is incredibly comprehensive, and I appreciate the careful selection of items that truly matter in any crisis.I've also taken note of the quality of the supplies. The bandages adhere well, the scissors are sharp, and the overall construction of the kit feels sturdy. It's clear that this kit was designed with both function and durability in mind. And I'd be remiss if I didn't mention the high-powered flashlight! No kit I've ever bought, included a flashlight! It's small and compact. but what it lacks in size, it makes up for with the lumens! It's bright, and the focus of the light beam is adjustable! (I included a pic with the flashlight shining on the first aid kit so you can see just how bright it is). It runs on 3 AAA batteries, which are not included. (Amazon sells them, so add a pack of batteries to your order!)Overall, the \"First Aid Kit for Home and Travel - 200 Piece Set - Compact Trauma Emergency Kit,\" is a must-have for anyone concerned about safety – whether at home, on the road or during their outdoor adventures. It's evident that the creators of this kit have thought about every possible emergency scenario and packed it with care. I've already recommended it to friends and family, and I'm grateful to have such a comprehensive kit for all my journeys.Don't hesitate to invest in your safety with this excellent first aid kit!(It would make a great gift for a first time driver, a college student or for a new family!)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711aEUy42EL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71L2+A8FYfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81OL3zgKdVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81juHko8CAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81tc24VpgDL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ray",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7I3WB7TPKH3LXGYT4E2VTKGZ6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VM9BKQKU0YU9?ASIN=B0C4WCRGD2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Must have",
                "reviewText": "This is a great first aid kit which including everything you need for home and/or travel. I am very satisfied with this kit since everything are well packed and labeled which can be easily accessible/replenish in the future. I would highly recommend it for road trip or camping since it's light and compact enough.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janet Basile",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFRXRVKYVJTB3HOC6ISOVZMQZEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PZCZ3WQASBPV?ASIN=B0C4WCRGD2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Seriously Impressive",
                "reviewText": "Seriously Impressive! This trauma kit has blown me away. It's like they thought of everything! Compact, easy to carry, and the labeling is spot on for quick grabs. From bandaids to CPR gear, it's got your back. Sturdy and with clear instructions, it's a no-brainer for any adventure or just chilling at home.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richie L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2SA2MYLH6MPTQKSFFBVZNTPOBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SLJL8SYD7Z6?ASIN=B0C4WCRGD2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Product at a Great Price!",
                "reviewText": "I purchased this 200 Piece First Aid kit as a gift for someone but decided to keep it for myself after seeing all of the stuff that came in this kit, it has everything in it including a flashlight, I love the idea that its small and compact and everything is labeled so no guess work when your in a situation where you need something and cant find it in an emergency.We started camping with the grandkids and I hope I never have to use this Emergency Trauma Kit, but its nice to know that in the event one of them gets hurt ill be prepared to help them. This kit is well made and easy to carry and store. I highly recommend this kit (You Never Know)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SillyBee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ3FIJIFHTMNNGPSAWVKXGB7LWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EEND073G1XSK?ASIN=B0C4WCRGD2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Impressive!",
                "reviewText": "This is very impressive all-in-one first aid kit. Both my boys participate in several sports (including martial arts) and I feel so much better knowing that this kit has everything we would need in case of emergency or injuries. It even has a first aid guide with instructions on what to do in certain emergency situations, such as how to perform CPR, treat a burn, etc. the bag itself is excellent quality and made out of premium material. One of my favorite parts about this first aid kit is that it can be strapped onto almost anything, but is also compact enough to just toss into a duffle bag or backpack. The bag also has lots compartments inside and everything is well organized so there is not looking or fumbling around when you need something. It’s the perfect first-aid kit!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}