{
    "remaining_requests": 23372,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ginger-Lily-Farms-Botanicals-Fragrance-free/dp/B078SFSH3Q",
    "body": {
        "name": "Ginger Lily Farms Botanicals Soothing Butter Lotion for Dry, Sensitive Skin, 100% Vegan & Cruelty-Free, Fragrance Free, 1 Gallon (128 fl oz) Refill",
        "price": "$19.18$19.18 ($0.15$0.15 / Fl Oz) $18.22$18.22 ($0.14$0.14 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 19.18,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ginger-Lily-Farms-Botanicals-Fragrance-free/dp/B078SFSH3Q",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08ND72QJ9"
        ],
        "asinVariationValues": [
            {
                "asin": "B078SFSH3Q",
                "variationName": "Size",
                "variationValue": "128 Fl Oz (Pack of 1)",
                "price": "$19.18",
                "variationImageURL": ""
            },
            {
                "asin": "B08L6JBMCY",
                "variationName": "Size",
                "variationValue": "128 Fl Oz (Pack of 4)",
                "price": "$75.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41LIpDZeDwL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/314wcZMsWwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/317N VLAlZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51D kvxqVzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LM5Z3wQ L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ENMlb4bFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51E GcbQTyL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab80ad03-ec2a-4d2d-b16c-2393efe62e51/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ginger Lily Farms Store",
            "link": "https://www.amazon.com/stores/GingerLilyFarms/page/47F9C379-3F6C-4F7F-8D7E-BC712D59DFDA?ref_=ast_bln"
        },
        "brand": "GingerLilyFarms",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 3173,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 1 hr 12 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Soothing Butter Lotion: Nourishes and hydrates skin with a lightweight, non-greasy formula that absorbs quickly leaving the perfect level of moisture on skin with silky, smooth radiance.",
            "Fragrance Free Body Lotion: Our unscented formula is ideal for dry, sensitive skin and those with odor sensitivities or fragrance allergies.",
            "Naturally Derived Ingredients: Enriched with a decadent blend of shea butter, vitamin E and aloe vera to deeply hydrate and soothe dry, sensitive skin. Toxin-free formula is paraben, sulfate, phosphate and gluten-free.",
            "Cruelty-Free Body Care: Ginger Lily Farms Botanicals is PETA-certified, 100% vegan and never tested on animals so you can feel good while using it.",
            "Economical & Eco-Friendly: Gallon refill size helps reduce plastic consumption and is perfect for locker rooms, health clubs, spas or at home. 1 Gallon (128 fl. oz.)"
        ],
        "description": "Ginger Lily Farms Botanicals Fragrance Free Soothing Butter Lotion nourishes and moisturizes skin leaving a silky-smooth radiance. Lightweight, non-greasy formula penetrates deeply into the skin’s surface to improve texture and reduce roughness and cracking. Our unscented butter lotion is formulated with vitamin E, shea butter and aloe vera for all day hydration. Naturally derived botanicals help prevent, protect and hydrate dry skin and replenish moisture for softer more radiant skin. Contains no harsh chemicals like parabens, sulfates, phosphates or gluten. Cruelty-free, PETA-certified and 100% vegan. Recommended for use right out of shower. Refill size is perfect for fitness centers, hotels, spas and home use. Directions: Apply Ginger Lily Farms Botanicals Soothing Butter Lotion generously and massage into skin. Repeat if desired.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b?ie=UTF8&node=11060521"
            },
            {
                "name": "Moisturizers",
                "link": "https://www.amazon.com/Body-Moisturizers/b?ie=UTF8&node=11060661"
            },
            {
                "name": "Lotions",
                "link": "https://www.amazon.com/Body-Lotions/b?ie=UTF8&node=14024031"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 6 x 6 x 11.4 inches; 8 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 802246"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 672047124645"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ TNG Worldwide"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B078SFSH3Q"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,941 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #186 in Body Lotions"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 3,173 ratings"
            },
            {
                "name": "Brand",
                "value": "Ginger Lily Farms"
            },
            {
                "name": "Scent",
                "value": "Fragrance-Free"
            },
            {
                "name": "Item Form",
                "value": "Lotion"
            },
            {
                "name": "Active Ingredients",
                "value": "vitamin_e"
            },
            {
                "name": "Unit Count",
                "value": "128 Fl Oz"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Ginger Lily Farms Botanicals Fragrance-Free Soothing Butter Lotion Nourishes and moisturizes skin Ginger Lily Farms Botanicals Fragrance-Free Soothing Butter Lotion is formulated with vitamin E, shea butter and aloe vera. This soothing body butter lotion nourishes and moisturizes skin leaving the skin with silky-smooth radiance. Paraben, sulfate, phosphate, gluten, cruelty-free, and 100% vegan. Butter Lotion (128 ounces) is perfect for commercial use in locker rooms and even for home use for refills. Rich and Decadent Formula Lightweight, Yet Moisturizing Vitamin E, Shea Butter and Aloe Vera Fragrance-Free Perfect for Dry Elbows, Mani’s and Pedi’s 100% Vegan Cruelty-Free 128 Ounces",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d746ab9-37d3-481c-bee7-e0f7753b5e3f.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Moisturizing Butter Lotion Lotion has a rich and decadent formula and is lightweight enough to leave the perfect level of moisture on skin. 100% Vegan Lotion Butter Lotion is 100% vegan and free of parabens, sulfate, phosphate, gluten and is cruelty-free. Nourishing Ingredients Fragrance-free Soothing Butter Lotion is formulated with Vitamin E, Shea Butter and Aloe Vera which leaves the skin with a silky-smooth radiance.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/576dfeae-6838-4664-ae84-24fde28f13cf.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cd1c61e9-02f6-41cb-9bcf-0ea80b68e6aa.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6a2212b-504f-48ff-82dd-9eda08c7bbf7.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8ea1af4f-19c1-4e74-b29d-a1edfdb7f23e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d746ab9-37d3-481c-bee7-e0f7753b5e3f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/576dfeae-6838-4664-ae84-24fde28f13cf.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cd1c61e9-02f6-41cb-9bcf-0ea80b68e6aa.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6a2212b-504f-48ff-82dd-9eda08c7bbf7.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ecfe0c97-01b7-4aee-8541-57786b1ea45b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Melissa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM5OEQVR7YLQLOGXBA5SYIE7QDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39UV2GQXOFMQW?ASIN=B078SFSH3Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Great value, neutral lotion",
                "reviewText": "I noticed a few other reviews said this lotion absorbs too quickly to be used for massage, but I found a solution. By itself, this lotion is basic, and very neutral. It's unscented, feels thick enough to offer relief on dry skin, but quickly absorbs and doesn't feel greasy at all. Sometimes, that's exactly what I need. I work in for a pharmaceutical manufacturer and cannot have heavy or scented products. We aren't even supposed to wear makeup or hair products. This lotion is perfect for work because it absorbs nicely and I can still get gloves on easily.I love that this is such a great value. For the price, I can't beat the amount of lotion. It's like a lifetime supply! (Not really, but still a lot) Because I had so much to work with, I wasn't afraid to waste some and experiment with adding scents and oils. I found that adding this with a tiny bit of jojoba oil, vitamin e oil, and my favorite scent oil, to a small pump bottle, the consistency doesn't change too much, but the absorbency changes drastically. I don't need much scent because it carries through the unscented lotion nicely, like a blank canvas. The oils make it slicker and better for massage or after a shower. I'm sure I could add even more oil to get a richer result. Sometimes you actually want a greasy feeling lotion to lock in the moisture. Even with the added cost of the oils and scent, my finished product is still substantially cheaper than the lotion I was using with a similar scent, and feels so much nicer. (It's like 1/10 of the cost!)So yes, this lotion does absorb too quickly for massage, but I still recommend it. If you plan to put this in a different bottle (like a pump bottle or squeeze) I recommend cutting a small hole in the foil, close to the rim, and poking a tiny hole on the opposite side as an air vent. Then you can squeeze it from the jug right into a new container without making a mess. My foil popped off halfway through the jug, but at least the first half was easy to use.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIPWVET5XLX632VBPO3YAAV4TRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAXYQ46N0KCWN?ASIN=B078SFSH3Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2023",
                "reviewTitle": "5.0 out of 5 stars I keep repurchasing!",
                "reviewText": "I love this stuff. I use lotion all over after my shower every day. I wanted something that produces fewer empty bottles and that I wouldn’t have to restock so often. This stuff goes on nicely, isn’t sticky or greasy after applied, but does leave me feeling moisturized. No dry feeling, skin feels supple without that unpleasant coating some lotions have, truly no fragrance, and it’s the most cost-effective option. The difference I feel when using this does measure up to my previous various favorites from over the years as I weeded out the ones that didn’t do anything. As an avid lotion user, I’m very happy with this one. I also occasionally have flare ups of eczema and whatnot, which this does not irritate at all- it’s quite nice to apply over it, in fact. I do recommend also buying their pump, because it’s way easier to just stick the pump in than try to move some to another bottle. The only problem I have with this at all is that the last bit of it does become hard to get out as you near the end of the pump’s tube. I give it a whack to move the lotion to the very bottom, then just buy a new one a little early, use it for a bit to make some room, then use the last of my nearly-empty one to top off the new one.Overall good quality everyday lotion at a great price and in convenient quantities with less packaging. Have bought a few times and will buy again.",
                "reviewVotes": "40 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alissa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGMFJN3WKXRWZGSZKOLS23RSSYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHILHCP4GBS4B?ASIN=B078SFSH3Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Feels great! Soaks in fast. No offensive smell.",
                "reviewText": "I waited a long time to try this even though I use other fragrance free Ginger Lily products because I normally hate Shea butter. But this winter me and my family have been going through so much lotion I decided to give it a go.Soaks in quickly and leaves a silky smooth finish.Consistency is thicker than Pipette baby lotion and I think about the same as CeraVe.Smells pleasant. It's fragrance free but doesn't have that preservative smell that is in the other naturalish products I've been using.I'm very happy.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRR6OUOUJAQWO4SJZBPJZKL4ZSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MFOL1KIM8WXD?ASIN=B078SFSH3Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Great value for mixing your own lotion",
                "reviewText": "I don’t know that I would use this on its own but it is great for mixing with your own scent. I take this and mix it with coconut oil both to add extra moisture, but also for a natural scent and it is perfect.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susannah B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEX3TSV4L5YSGHR2E4KSRXLNC4FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H3D4SED4OXGQ?ASIN=B078SFSH3Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 10, 2023",
                "reviewTitle": "5.0 out of 5 stars This is the very best choice for sensitive skin -- works for everyone!",
                "reviewText": "Out of all of Ginger Lily Farms products (of which I am a huge fan) this is the very best! It was the first product I ordered when I worked at a birth center and we needed an excellent nourishing lotion that could be used on every client. It is extremely moisturizing. The price is excellent. It does have a very slight scent, which I would describe as clean and fresh. I never had a single complain about this lotion from hundreds of women.We recently moved to an extremely dry part of the country, so I now order this lotion by the gallon for my own household. We have tried some of the scented lotions from this company, and although most of our family members enjoyed the scented versions, we do have a couple people with ultra sensitive skin (including eczema and psoriasis) for whom the unscented version is the best and most economical lotion we have found. So now it is the only lotion I order.Be sure to order a pump which is also sold by this company to help dispense the lotion. The pumps are reuseable so are a one-time investment. Overall, you will find that this lotion is an extrememly gentle and money-saving option. I am so thankful I found it!",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI6WNR54B7YPM3RDJACY32AKEPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P10UUIS893Z8?ASIN=B078SFSH3Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Sensitive skin friendly, not oily/sticky!",
                "reviewText": "I’ve been looking for a good unscented lotion that doesn’t either smell atrocious, leave my skin oily/sticky, or irritate my skin (I’m super sensitive). This is the one!! The smell isn’t wonderful, but it is very faint and disappears after a minute or two. You could always add a couple drops of your favorite essential oil, too. Leaves my skin super soft, and without any residue tackiness. Perfect dupe for the Whole Foods 365 brand unscented lotion that’s impossible to find anymore. Super affordable, too!! It’s annoying to see that people are giving it not-great reviews solely because it rubs in pretty quickly (making it not the best lotion for massage) when I don’t see anywhere that it’s advertised as a massage lotion…",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mimi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 8, 2022",
                "reviewTitle": "love it",
                "reviewText": "love it. no scent and good for scent customization. hydrating not too heavy texture.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shervain Barrett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 7, 2024",
                "reviewTitle": "Good lotion, but too thick for my pumps",
                "reviewText": "Great lotion. However, it's so thick that it's doesn't work with my lotion pump bottles. It keeps clogging them. The entire point of buying this was so that I'd have some reusability. However, it's a pain getting the lotion out of the bottle it comes in as well as getting any other lotion pump bottles to work with it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shane",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 11, 2022",
                "reviewTitle": "Not really great for professional massage...",
                "reviewText": "This came up when I was looking for new massage lotion. My old brand was discontinued so, thought I would try something new. It feels good at first but, before I'm even done my opening techniques it absorbs into the clients skin and I feel like I have sticky gecko hands. On the other hand my hands are very soft now. Maybe if there was a bit of coconut oil or something to give more glide this would work better as something beyond hand cream.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brittany",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 6, 2023",
                "reviewTitle": "NOT good for massage",
                "reviewText": "Unless you want to apply every 10 seconds this is not good for massage purposes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 21, 2022",
                "reviewTitle": "Hard to get out......",
                "reviewText": "I bought this because I am trying to use less plastic. Wanted to refill the containers I already have but I can't get the stuff out! I should have realized; its always a problem when you get to the bottom of the regular size ones! However, all is not lost, I plan to buy a pump for the gallon jug and will do the refills using that!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$26.99",
                "sellerName": "TNG Worldwide",
                "sellerRating": "5"
            }
        ]
    }
}