{
    "remaining_requests": 23219,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Melaleuca-Renew-Intensive-Therapy-Lotion/dp/B001RMJHVI",
    "body": {
        "name": "Melaleuca Renew Intensive Skin Therapy Lotion 20 Ounce with Pump",
        "price": "$35.99",
        "originalPrice": "$42.34",
        "rawPrice": 35.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Melaleuca-Renew-Intensive-Therapy-Lotion/dp/B001RMJHVI",
        "soldBy": {
            "sellerID": "A34J1A8OTNTHV9",
            "name": "SmithEmporium",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A34J1A8OTNTHV9&asin=B001RMJHVI&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CH41ZM7W"
        ],
        "asinVariationValues": [
            {
                "asin": "B07P2F8GL8",
                "variationName": "Size",
                "variationValue": "8 Fl Oz (Pack of 1)",
                "price": "$22.00",
                "variationImageURL": ""
            },
            {
                "asin": "B001RMJHVI",
                "variationName": "Size",
                "variationValue": "20 Fl Oz (Pack of 1)",
                "price": "$35.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "9",
        "stockDetail": "Only 8 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/412-4dACDbL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Lmc1IzEhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51D kvxqVzL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Melaleuca",
            "link": "https://www.amazon.com/Melaleuca/b/ref=bl_dp_s_web_3537609011?ie=UTF8&node=3537609011&field-lbr_brands_browse-bin=Melaleuca"
        },
        "brand": "Melaleuca",
        "merchantInfo": "LR60",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 4120,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22.",
            "Or fastest delivery February 16 - 20.",
            "FREE delivery Monday, February 19. Order within 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Contains skin-soothing ingredients",
            "Moisturize dry skin associated with eczema improvements in redness, itching, flaking, and scaling",
            "Relieves severely dry skin.",
            "Study showed that Renew users had a higher level of moisture in eczema-prone skin than Eucerin users",
            "Eliminates the embarrassment and discomfort of dry skin"
        ],
        "description": "Dry skin can irritate you, embarrass you, and control you. Break free and discover the soothing relief of Renew Intensive Skin Therapy lotion. With Renew, your skin has everything it needs to become softer, smoother, and better hydrated-and stay that way. Renew is clinically proven to leave even severely dry skin silkier and healthier in just 24 hours. And in clinical studies, Renew outperformed the leading dermatologist-recommended lotion for skin softness, smoothness, and hydration. Going beyond temporary moisturization, Renew delivers long-lasting relief from dry, rough, or irritated skin and uncomfortable chronic dry skin conditions, including dry skin associated with eczema. Renew heals, protects, and prevents even the driest skin by helping your skin attract and retain more moisture. Experience Renew for yourself - then share the soothing sensation with your parents, your neighbors, and your friends so they can see for themselves why so many people swear by Renew Intensive Skin Therapy lotion.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060521"
            },
            {
                "name": "Moisturizers",
                "link": "https://www.amazon.com/Body-Moisturizers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11060661"
            },
            {
                "name": "Lotions",
                "link": "https://www.amazon.com/Body-Lotions/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14024031"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 4 x 2 x 9 inches; 1.25 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ RENEW-20"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 705911356832 887363478338 639385425568 065373771933 065373004253 885337555399 705911356931 738517842638 653733766172 887741304006 616175813514 738517842577"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Melaleuca"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B001RMJHVI"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,076 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #175 in Body Lotions"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 4,120 ratings"
            },
            {
                "name": "Brand",
                "value": "Melaleuca"
            },
            {
                "name": "Scent",
                "value": "NON SCENT"
            },
            {
                "name": "Item Form",
                "value": "Lotion"
            },
            {
                "name": "Active Ingredients",
                "value": "Glycolic Acid"
            },
            {
                "name": "Unit Count",
                "value": "20 Fl Oz"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Us Inspired by Nature. No one knows nature like Melaleuca. For more than 35 years, we’ve become known for our innovative natural formulas. It’s a Melaleuca hallmark: natural ingredients fine-tuned for the best results. Our search for better, safer, more natural solutions never ends. We seek renewable plant sources. We search for naturally derived alternatives. Then we refine them with cutting-edge science. Who We Are Our mission is to enhance the lives we touch by helping people reach their goals. Small goals. Big goals. And everything in between. It’s this ability to help people reach their goals that makes Melaleuca a different kind of company.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/65a18286-eef1-4112-ad81-73418641dfae.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/65a18286-eef1-4112-ad81-73418641dfae.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LaurenLauren",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7D2AS23JX7W6BAFK2H3SCIUPFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R179BY13IDPIP4?ASIN=B001RMJHVI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for dry skin",
                "reviewText": "I am a hair stylist. After handling chemicals and having my hands in a shampoo bowl all day every day, my hands tend to dry out to the point that some lotions can actually irritate and burn me. I heard about this moisturizer from my mom and she actually gave me a travel size bottle. I loved it so much I used it all within a couple weeks and needed a bigger bottle. Though it is a wee bit on the pricier side, the way it hydrates my skin will have me purchasing it over and over again once I run out. I have never had a lotion make my skin feel the way this one does. It is not greasy whatsoever but makes my hands feel silky soft. Like baby skin soft. The only thing I could do without is the fragrance. It smells similar to baby powder or the Airspun loose setting powder. It’s strong at first but dissipates after a while. Fragrance aside, this lotion is a must have.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71G7Cjb7sHL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Falcon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5CPFFSQ4RK3XGSFXYK4RHQSTOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LY4AN78DWL5L?ASIN=B001RMJHVI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Stops the iching.",
                "reviewText": "So far this product is working well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Niki H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4F4RJUYIYVPDDPBUSNJVP6CZOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LI50FVSF81AF?ASIN=B001RMJHVI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "I m not a melaleuca anymore so im thrilled i can get this on amazon.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claudia S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDET5I2OW7TIGARKDX4ZARP4DAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37LUQAWLZO0NV?ASIN=B001RMJHVI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars It works",
                "reviewText": "I use serums and moisturizers on my face all the time, and even essential oils sometimes. My face in the winter just doesn't seem to get enough moisture. So someone recommended this to me and I decided to try it. I use my serum and moisturizer then I put a light coat of this on top and my face never feels dry. At night before I go to bed I apply a thin layer. I also use it on my hands and anywhere else that is dry. It has a hint of a scent, it smells fresh.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "beth turchi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTZ7ROJYDBP7RZA3IOYAOKLVO7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CH35QHLT5D4R?ASIN=B001RMJHVI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Rich and luxurious lotion.",
                "reviewText": "Love how it makes my skin feel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Letty Zaldivar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBICKAXCI5YFQPLHEWUMACF7A4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R226SLSGJN6IV6?ASIN=B001RMJHVI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Best cream",
                "reviewText": "I really love this cream. with constant use on my face I have really noticed a change on my face . My skin appearance and texture has improved tremendously. Wouldn't go a day without it . Highly recommended it 👌",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Happy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG65BD5EVGIFAAFJEDYG5VMAO6FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R341VS7E8V7LR3?ASIN=B001RMJHVI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2019",
                "reviewTitle": "4.0 out of 5 stars If you're looking for a Scent Free Moisturizer this moisturizer is NOT for you!",
                "reviewText": "My 2.5 year old, 7 month old and I all have eczema. It is brutal. The kiddos have it so badly they get horrific patches of dry red skin that looks like an alligator to the look and touch. They also claw themselves until they bleed and are constantly itchy. Eczema is not contagious but is hereditary and extremely uncomfortable and can be tied to allergies and asthma which I have all three, not sure if my kiddos have all of three yet since they are so young but unfortunately it appears they are heading in that direction. Eczema affects my children's sleep thus mine. Their skin is so bad that strangers feel the need to inquire about their skin or ask me what is wrong.I have taken my children to an immunology/dermatologist specialist at Children's hospital and I'm truly doing everything I can. I did NOT want to use steroids but I have to use a steroid cream when my 2.5 year old has a major flair up. The doctor has suggested showers then deep moisturizing as soon as she's out. Then to apply intense moisturizers, vasonline, comfortable soft pj's that are non skin iritants. I also have to use a steroid cream and Benedryl to assist with the itching. I have tried more creams than I care to list. The dermatologist also prescribed an anti-itch chewable tablet but my daughter refuses to take it so moisturizing and steroid creams are all I can do, thus incredibly important.I tried the Renew moisturizer after two of my friends swore by it and one was referred by her doctor to try it. Personally my dermatologist and the kid's dermatologist have never mentioned Renew but I will give almost anything a try. Here's my feed back. While two bottles are near $40 and some people may find that spendy, they are extremely large bottles at 20 ounces each and anyone buying eczema creams are used to this. Creams are usually higher in cost than lotions. As far as moisturizing it is nice but I wouldn't say it is the best thing that I have ever tried. It's not as thick as Eucerin or some of the other creams on the market so I feel I need to use more of it or add vasoline with it but it has a nice silky feel.The NEGATIVE and dealbreaker for me is that for a skin product that is supposed to heal skin sensitivities and issues it has FRAGRANCE added to it. This is UNHEARD of. Why would you add fragrance to something that is supposed to help those of us who have adverse reactions to frangrance? This makes no sense to me and it is an AWFUL smell. I know I'm sensitive but it has a really bad smell to it and I don't like my kids smelling like it, this sounds terrible but it kind of reminds me of the smell of a grandma (I'm not trying to be cruel, just honest). I'm going to use it because I purchased it and it does do an o.k job moisturizing but next time I order cream I'm going back to my other options which avoid fragrance. Some creams do have all natural oils which sometimes have a light scent but nothing that has the verbiage FRAGRANCE added. I also feel that you have to use it after a shower or it does not moisturize well and must be reapplied over and over throughout the day. If you don't have any adverse reactions or allergies than the fragrance most likely won't bother you but for someone like myself who is really sensitive I figured it is worth mentioning. I have tried a ton of other creams that people have said have awful smells and they haven't bothered me. This smell is definitely bothersome.Pros:-Moisturizes and feels silky on your skin which is nice-Just like it advertises \"nongreasy formula\", it does NOT feel greasy-If applied after a bath or shower it seems to lock in nicely & last for the majority of the day-The bottles are very large so I think the moisturizer has a great price point, it is also nice not to have to order the moisturizer every two weeks. Some moisturizer bottles are so small I continuously have to re-order them every other week which I find it to be very inconvenient.-I have been using it almost a week on my daughter's skin and it does seem to be keeping her skin moisturized nicely-The other thing worth mentioning is that some creams really hurt if your child has an open cut from scratching, so far my daughter has not complained which is awesome because usually when she's clawing is when she needs the moisturizer the most!Cons:Fragrance is added to the moisturizer (I'm very sensitive)The frangerance that is added smells awfulIf you don't use it right after showering or bathing the moisturizer doesn't lock in, however I find this is pretty normal for most moisturizers.Ingredients: For those of you like myself that need this info!Deionized Water, Glycerin USP, Petrolatum USP, Distearyldimonium Chloride, Isopropyl Palmitate, Cetyl Alcohol, Dimethicone, Allantoin, T36-C5, Melaleuca Oil, Benzyl Alcohol, Fragrance.Company is listed s a product of USA, out of Idaho Falls, ID but distributed out of Australia and New Zealand.",
                "reviewVotes": "106 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "elvato",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2OPJGCHQEVOUXD4UVZTWPSEBWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T79C2GCNC9UM?ASIN=B001RMJHVI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Love this cream !",
                "reviewText": "Works well on my skin. My skin is smooth and hydrated. My friends say my complexion is nice.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pamela Martínez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 20, 2023",
                "reviewTitle": "esta mas higienica la presentacion, pero el bote grande rinde mucho mas",
                "reviewText": "ojala vendieran un tamaño mas grande",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yakici",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 8, 2020",
                "reviewTitle": "Preis Leistung stimmt nicht",
                "reviewText": "Es ist so ein komischer Film auf der Haut. Preis Leistung stimmt bei diesem Produkt NICHT. Die Haut juckt für wie ee und je. Ausserdem ist zu viel Parfüm in der Lotion. Kauf etwas aus Deutschland....",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MR CHRISTOPHER FIELDEN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 3, 2017",
                "reviewTitle": "Soothes dry skin and helps stop flaking and peeling",
                "reviewText": "I've always found Melaleuca products to be good. I sometimes suffer with dry skin and have reactions to anything with chemicals in it. I've used this cream for years and find it soothing and great for my skin. What a ponce... Meh. I'm too old to care. I don't use it for aesthetic reasons. It soothes dry skin and helps stop flaking / peeling. Good stuff.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon カスタマー",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on February 5, 2021",
                "reviewTitle": "何を重視するかによる",
                "reviewText": "オススメされて購入しました。すすめてくれた人はラベンダーの香りがするのを使用していましてが自分はこちらを購入。ラベンダーは自然な香りで素敵だったのでこちらも期待していましたが、かなり…人工的な甘い香りがします。少々ならかまわないのですがこれはかなりキツいです。人によっては頭痛がするかもしれません。自分は使っていくうちに慣れてきたのですが、鼻が効く人、無香料が欲しい人にはオススメしません。クリームとしての保湿性は素晴らしいです！保湿性を重要視している人にはオススメします！",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kato Remy Gbessia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 3, 2021",
                "reviewTitle": "Very very good",
                "reviewText": "Great product and very good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$35.95",
                "sellerName": "Tilututu",
                "sellerRating": "0"
            },
            {
                "price": "$35.99",
                "sellerName": "SmithEmporium",
                "sellerRating": "0"
            },
            {
                "price": "$37.99",
                "sellerName": "GLSGoods",
                "sellerRating": "5"
            }
        ]
    }
}