{
    "remaining_requests": 23271,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cutemol-SUMMERS649640-Emollient-Cream-8-Ounce/dp/B000NSH2L4",
    "body": {
        "name": "Cutemol Emollient Moisturizing Cream - Serious Moisturizer Lotion Balm for Recovering Dry, Damaged Skin - Hydration for Cracked Hands and Feet, Eczema, Psoriasis, and Raw Skin (8 oz)",
        "price": "$26.99$26.99 ($3.37$3.37 / Ounce) $25.49$25.49 ($3.19$3.19 / Ounce)",
        "originalPrice": "",
        "rawPrice": 26.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cutemol-SUMMERS649640-Emollient-Cream-8-Ounce/dp/B000NSH2L4",
        "soldBy": {
            "sellerID": "A2CTLMV7ZKWNB8",
            "name": "Summers Laboratories, Inc.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2CTLMV7ZKWNB8&asin=B000NSH2L4&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BNCH7N3N"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BKQZ7VPV",
                "variationName": "Style",
                "variationValue": "",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41UOV6jgh5L._SS36_.jpg"
            },
            {
                "asin": "B0CN1ZRTGS",
                "variationName": "Style",
                "variationValue": "",
                "price": "$28.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31XmUf-PI5L._SS36_.jpg"
            },
            {
                "asin": "B00121TEQW",
                "variationName": "Style",
                "variationValue": "",
                "price": "$15.24",
                "variationImageURL": "https://m.media-amazon.com/images/I/51aTGdcW8AL._SS36_.jpg"
            },
            {
                "asin": "B000NSH2L4",
                "variationName": "Style",
                "variationValue": "",
                "price": "$29.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31QirQSQDmL._SS36_.jpg"
            },
            {
                "asin": "B09MJTK1TT",
                "variationName": "Style",
                "variationValue": "",
                "price": "$18.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41XHhnJN3rL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31QirQSQDmL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41fIveYjJXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gPFh4dAdL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aa7a9a4c-ae4e-4fa8-8e42-7104f302c5ae/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0efcb14d-390a-4165-82d7-c0af37eb821b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fbff8f0-5eed-4eaf-a71d-cd6b3f2277ad/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Cutemol Store",
            "link": "https://www.amazon.com/stores/Cutemol/page/BE292C5D-1199-49C4-B788-B1C5020C23B0?ref_=ast_bln"
        },
        "brand": "Cutemol",
        "merchantInfo": "Summers Laboratories, Inc.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 3322,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 54 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "RESTORE AND REPAIR: Soothing, healing, and powerful hydrating action. Cutemol Emollient Skin Cream gives intense moisturizing and seals in the hydration for the most severe cases of damaged, brittle, dry, and cracked skin. Renew your skin to the soft, supple, healthy look and feel you love.",
            "FIGHT AGAINST DAMAGE: Our moisturizer lotion not only delivers powerful hydration but seals the moisture in to create an ideal environment to promote healing. Cutemol helps with even the most severe cases of dry skin from eczema and psoriasis.",
            "STRONGER AND MORE EFFECTIVE: Stop skin damage in its track and help relieve pain and reduce itching with soothing action. Our ultra-hydrating moisturizer uses natural ingredients like beeswax, lanolin, and allantoin to stop flaking and help your skin repair as fast as possible.",
            "USE IT EVERYWHERE: Use a powerful emollient hydrating lotion anywhere you need it. Cutemol Emollient Skin Cream is great for foot problems, hands, cuticles, palms, knees, elbows, arms, legs, and anywhere you need serious moisturizing.",
            "CUTEMOL: We set out to create a better class of emollient moisturizer that not only moisturizes dry skin but protects the skin to allow for better faster healing. Our moisturizing lotion gives the benefits of a long-lasting ointment but absorbs elegantly into the skin like a cosmetic cream."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060521"
            },
            {
                "name": "Moisturizers",
                "link": "https://www.amazon.com/Body-Moisturizers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11060661"
            },
            {
                "name": "Creams",
                "link": "https://www.amazon.com/Body-Creams/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11060681"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3.63 x 3.63 x 2.75 inches; 8 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 10214047"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 795871251087 885351276799 885515131889 811964124554 794731006027 793379287096 885818242497 883116491975 885258535425"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Summers Laboratories"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B000NSH2L4"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,621 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #90 in Body Creams"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 3,322 ratings"
            },
            {
                "name": "Brand",
                "value": "Cutemol"
            },
            {
                "name": "Scent",
                "value": "Unscented"
            },
            {
                "name": "Item Form",
                "value": "Cream"
            },
            {
                "name": "Active Ingredients",
                "value": "Mineral Oil, Microcrystaline Wax, Beeswax"
            },
            {
                "name": "Unit Count",
                "value": "8.0 Ounce"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/993ba3ce-130a-4113-9500-e9a20d3be33e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/09a8ab80-f216-47b6-88c5-09d1921a62ef.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0c483b37-a3d2-406c-85af-b83fefa2b84e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/58a0bc7c-3889-430a-8d51-4f6adc540e6d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6fedcec8-9773-4def-a72b-ca05b5aa4db8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "kittykatty",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSRY22BWU2S2IBVJ4L7PHAE464A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HQY6U7XX61LY?ASIN=B000NSH2L4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2014",
                "reviewTitle": "5.0 out of 5 stars The Only Product to Make a REAL Difference for my Dry and Peeling Nails",
                "reviewText": "I have tried dozens of hand lotions, cuticle creams and oils. All trying to find one product that I thought worked better for my ragged cuticles and peeling splitting nails than regular lotion. I've tried everything at the drug store, I've tried Nail Tek, I have even splurged on OPI and to be honest while they aren't bad products they didn't really do a much better job than the lotion. They certainly didn't do much to improve my nail beds or soothe my cuticles in the long run.Cutemol is quite comparatively expensive to most of these products at first glance but I finally decided I wanted to try it because it seemed to me that Summers Laboratories knows what they're doing and approaches nail and skin care from a very scientific point of view. If anything could actually help, I thought, it had to be this.It does have a major shortcoming. I wondered if I should subtract a star but ultimately I decided I still loved it in spite of it's issue. You see the consistency of this cream is almost reminiscent of marshmallow fluff. It is similarly pretty sticky. Not quite marshmallow sticky but if you rub this all over your hand then you will not want to touch anything for a little bit. After about 20 minutes is absorbs almost completely in and leaves nothing but a very soft vaguely waxy feeling which is only annoying near touch screens and then after that fully absorbs.This is the kind of lotion that is probably best applied before bed and then covered by a glove or fingertip protector so you can go about your business and let it absorb all night. That might sound a bit overkill but you will be amazed at the difference if you do that. My whole hand's texture has changed. My hands even look younger! The skin has a youthful texture and the skin has plumped up giving an almost \"hand model\" appearance. I can't stop looking at my hands and nails.It has immediate results on your nail beds as well. It will hydrate your cuticles but it will also absorb into your nail bed and lend it increased flexibility after application. You won't experience even better results than that for 4-8 weeks when your nails have grown out more and you can tell the difference in the newly grown out nail. My nails used to split and crack as soon as they left the edge of my finger but after regular application of cutemol they are much more resilient and resistant to splitting.I did purchase this with Summers Laboratories Dermanail product as well so I am sure that product has helped as well and I recommend if you are getting this for nail issues to get that product as well. Both take weeks to work and are comparatively expensive but it is a great deal because you actually get RESULTS. I have tried everything, rejuvacote, nail envy, every sally hansen thing under the sun, and while some of them are nice products and cheaper than Summers Labs products they do not provide the drastically improved results that these products have given me.Cutemol and Dermanail are also much larger volumes than you are used to getting with nail products. This is 8 ounces compared with the normal .5 ounces that most cuticle conditioners come in. So actually it IS cheaper. And Cutemol goes a looong way with just a little bit. Dermanail too is much larger than the nail treatments you're used to getting. It is 1 oz and you only need one drop per nail per treatment.I encourage you to just stop searching and buy this stuff. It is on another level.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "hmmmm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXTBW4XDCLSUSWIQCXZP5TMWJJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNC9GYS24Q5ID?ASIN=B000NSH2L4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Skin Barrier Cream: Great for post-cast dryness!",
                "reviewText": "Bear with me bc this is long. I have had a cast on my leg for two months that goes from just under the knee down to the toes. This is my second round with this (ankle injury/surgery) and I know from the first round that the skin dryness that comes with a cast is insane and most lotions don’t even touch it. My PT from the first round of surgery and casting used an emollient on my skin and explained that is the best thing to use for such a high level of dry skin. I bought this product SPECIFICALLY because it says it’s an emollient. I have to say it definitely works and the moisture lasts. It doesn’t just evaporate in minutes and look like nothing was ever put on. My skin still looks hydrated hours later. I even used it on my dry cuticles on my hands just to see and I am very impressed. The bottle isn’t as large as I would have hoped but a little cream goes a long way so I think it’ll last. I have one kid with psoriasis and another kid who just has naturally dry skin. I think this cream would also be great for them so I am going to buy a few more bottles and just keep it on hand. This might be my new lotion staple. Definitely worth the cost. There is a slight heaviness to it initially but it’s worth it to get rid of the extreme dryness. There is no scent and it does not irritate my very sensitive skin at all, so that is yet another positive.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David W. Parker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPQSDBEVY6QSSMXFC33WOYCCPBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RK8ZYMA2RU2G?ASIN=B000NSH2L4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Moisturizing lotion/cream",
                "reviewText": "The product is really good from the report my wife gives me. 2e have it on automatic reorder every 3 months to ensure we can get as sometimes it has been hard to locate even on the Internet. She says it really does a great job moisturizing her hands and feet which both stay dry year round. And I can notice myself when she doesn't use it as he hands are dry and scaly. The cream is very thick which is a good this because it takes less to do the same job as other competitors do. Overall my wife and I definitely recommend this product to anyone needing to moisturize their skin.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAE5UADXD3KSM3NTJNCSLPAB64Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LDG5TBQZ8O9?ASIN=B000NSH2L4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Unscented, Effective Hand Cream",
                "reviewText": "My dermatologist recommended Cutemol Hand Cream for my overwashed hands and splitting fingernails. She said to apply moisturizer every time I washed my hands.There are two versions of Cutemol Moisturizer. Both versions are thick and sticky. Only a small dab is needed. They could be used overnight with gloves.This version is the Cutemol Emollient Moisturizer for Sensitive Skin. It is unscented and has no lanolin or parabens. The original version is Cutemol Emollient Skin Cream. It has an added fragrance, and in my opinion an odd scent. I have only been using the products a short time but I can already see an improvement. Both versions seem equally effective. I prefer unscented hand creams, so I'll buy the Sensitive Skin formula from now on.There are cheaper moisturizers available, but I'll use this product in winter when my hands are dry and in the summer when I swim a lot. Due to the stickiness, I'll use it a bedtime and use other products during the day.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sharon lee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL3Z2T3PDH5IAH5WLD4AOJ7B26A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YA46TK32DVHK?ASIN=B000NSH2L4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Adequate for dry feet!",
                "reviewText": "Recommended by my Dermatologist for dry feet. Takes a bit of time to “soak in”. Easy to apply - a bit on the greasy side. Works well for me - with 2 x daily application.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandy Schiffman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNKI4TUEAZ7C2GIAIUFNBKE6SHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D2Q2N2YDAWMO?ASIN=B000NSH2L4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Without Cutemol I could not have nails or good looking hands that I am proud to have seen!",
                "reviewText": "I have used this product for many years! It is the only thing I have found that works for my nails! I use it every time I wash my hands at home and keep it on my bathroom sink counter. I also keep it in my cosmetic case in my purse that I use if I wash my hands when out on errands, lunch, etc. It lasts a long time because nails are not very big and you don't need very much product because it is so creamy and moisturising! I had just put it on subscription--it arrived today when I have enough to last for at least another month! When I finish it I will adjust my subscription. It comes out to also be a bargain!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Brennan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGH2NQDHWY642KSGIQCNNJRL3V4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SHUPF09NN99Z?ASIN=B000NSH2L4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Did the job",
                "reviewText": "My hands were getting very rough and this worked very good to stop them from cracking.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denise",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGROZFSXBAGFPLMG45C7W5KLQKHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVK3HQ7FZTXRS?ASIN=B000NSH2L4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Best",
                "reviewText": "This is the best moisturizer I have ever used, thanks to my Dermatologist and God knows I have used alot for my skin issues. In a couple of weeks, I will be placing another order as I changed my shipment date as this is used daily, awesome!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martha S. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 19, 2020",
                "reviewTitle": "La mejor",
                "reviewText": "Es la mejor crema humectante de manos, pies y cuticulas que he encontrado.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vicky Cleaver",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 7, 2024",
                "reviewTitle": "Skin Cream",
                "reviewText": "This product is a great skin softener.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "green",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 16, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "Good to have for hands.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Theodor Razvan Ghiteanu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 1, 2014",
                "reviewTitle": "Five Stars",
                "reviewText": "good price",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wayne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 16, 2017",
                "reviewTitle": "Four Stars",
                "reviewText": "Works great, just have to keep using it for these dry old hands",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$29.99",
                "sellerName": "Summers Laboratories, Inc.",
                "sellerRating": "5"
            },
            {
                "price": "$34.56",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}