{
    "remaining_requests": 23182,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Olay-Firming-Hydrating-Lotion-Collagen/dp/B09NPYBW6X",
    "body": {
        "name": "Olay Firming & Hydrating Body Lotion with Collagen, 17 fl oz Pump, (Pack of 4)",
        "price": "$37.89$37.89 ($0.56$0.56 / Fl Oz) $33.90$33.90 ($0.50$0.50 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 37.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Olay-Firming-Hydrating-Lotion-Collagen/dp/B09NPYBW6X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CPMF5K4B"
        ],
        "asinVariationValues": [
            {
                "asin": "B09NPYBW6X",
                "variationName": "Scent",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51OwutFlsFL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Scent",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41siyL6S9IL._SS36_.jpg"
            },
            {
                "asin": "B09NPYBW6X",
                "variationName": "Size",
                "variationValue": "17 Ounce Pump",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "6 Ounce Tube",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Savings",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51OwutFlsFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51WC3y-97VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aH58pzcJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DkF4jEuPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vpc68IV4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-vwYd5MgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LDrRZFfrL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Olay Store",
            "link": "https://www.amazon.com/stores/Olay/page/AD2BF519-62C5-4C66-9EDE-763EC687B6C0?ref_=ast_bln"
        },
        "brand": "Olay",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 2377,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 2 hrs 37 mins",
            "FREE pickup Monday, February 19",
            "Or fastest pickup Friday, February 16. Order within 2 hrs 37 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "PENETRATES SKIN UP TO 10 LAYERS DEEP: This fast-absorbing formula, made for all skin types, was crafted by Olay skin experts to moisturize and hydrate to increase skin cell turnover",
            "FAST-ABSORBING FORMULA: Formulated to be moisturizing yet lightweight, this cream won’t give your skin a coated feeling",
            "EXPERTLY CRAFTED WITH COLLAGEN: Crafted by Olay experts to hydrate your skin with plumping moisture that tightens and diminishes fine lines for a visible skin transformation",
            "VISIBLY IMPROVES SKIN: Vitamin B3 hydrates your skin allowing it to retain its own moisture—think of it as the ultimate skin-improvement ingredient that leaves you with softer, smoother-feeling skin",
            "USE TOGETHER: Use with Olay Skin Care-Inspired Body Wash to boost effects of Vitamin B3 Complex and moisturizing ingredients"
        ],
        "description": "Fortify your skin’s foundation with Olay Firming & Hydrating Body Lotion. This moisturizing lotion has a nutrient-rich formula crafted with collagen and our Vitamin B3 Complex and was created specifically to tighten and plump skin while diminishing fine lines. Why add Vitamin B3 Complex into your routine? It’s the ultimate skin-improvement ingredient. Vitamin B3 allows your skin to hold on to water so it can become its own moisturizer. It also leaves you with skin that acts younger, feels softer, and looks smoother. You can expect a visible skin transformation without the greasy residue that other types of body cream can leave behind. This body cream also absorbs quickly, penetrating skin up to 10 layers deep, leaving your skin with long-lasting smoothness and increased skin cell turnover. Make sure you take a minute to appreciate its lovely packaging—it’s definitely worthy of your counter space. Use daily all over your body during your morning or evening routine. Use with Olay Skin Care-Inspired Body Wash to boost effects of Vitamin B3 Complex and moisturizing ingredients.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060521"
            },
            {
                "name": "Moisturizers",
                "link": "https://www.amazon.com/Body-Moisturizers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11060661"
            },
            {
                "name": "Lotions",
                "link": "https://www.amazon.com/Body-Lotions/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14024031"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 9.37 x 5.91 x 5.75 inches; 4.25 Pounds"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Procter & Gamble"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B09NPYBW6X"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,215 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #138 in Body Lotions"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 2,377 ratings"
            },
            {
                "name": "Brand",
                "value": "Olay"
            },
            {
                "name": "Scent",
                "value": "Collagen"
            },
            {
                "name": "Item Form",
                "value": "Lotion"
            },
            {
                "name": "Active Ingredients",
                "value": "vitamin b3"
            },
            {
                "name": "Unit Count",
                "value": "68 Fl Oz"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "OLAY - Body Lotion Olay Revitalizing & Hydrating Body Lotion PENETRATES SKIN UP TO 10 LAYERS DEEP: This fast-absorbing formula, made for all skin types, was crafted by Olay skin experts to moisturize and hydrate to increase skin cell turnoverFAST-ABSORBING FORMULA: Formulated to be moisturizing yet lightweight, this cream won’t give your skin that coated, waxy feelingEXPERTLY CRAFTED WITH VITAMIN C: Crafted by Olay skin experts to instantly hydrate and rejuvenate skinVISIBLY IMPROVES SKIN: Vitamin B3 hydrates your skin allowing it to retain its own moisture—think of it as the ultimate skin-improvement ingredient that leaves you with softer, smoother-feeling skinUSE TOGETHER: Use with Olay Skin Care-Inspired Body Wash to boost effects of Vitamin B3 Complex and moisturizing ingredients Olay Hydrating & Firming Body Lotion PENETRATES SKIN UP TO 10 LAYERS DEEP: This fast-absorbing formula, made for all skin types, was crafted by Olay skin experts to moisturize and hydrate to increase skin cell turnoverFAST-ABSORBING FORMULA: Formulated to be moisturizing yet lightweight, this cream won’t give your skin that coated, waxy feelingEXPERTLY CRAFTED WITH HYALURONIC ACID: Crafted by Olay skin experts with skin-quenching ingredients made for all skin typesVISIBLY IMPROVES SKIN: Vitamin B3 hydrates your skin allowing it to retain its own moisture—think of it as the ultimate skin-improvement ingredient that leaves you with softer, smoother-feeling skinUSE TOGETHER: Use with Olay Skin Care-Inspired Body Wash to boost effects of Vitamin B3 Complex and moisturizing ingredients Olay Nourishing & Hydrating Body Lotion PENETRATES SKIN UP TO 10 LAYERS DEEP: This fast-absorbing formula, made for all skin types, was crafted by Olay skin experts to moisturize and hydrate to increase skin cell turnoverFAST-ABSORBING FORMULA: Formulated to be moisturizing yet lightweight, this cream won’t give your skin a coated feelingEXPERTLY CRAFTED WITH COLLAGEN: Crafted by Olay experts to hydrate your skin with plumping moisture that tightens and diminishes fine lines for a visible skin transformationVISIBLY IMPROVES SKIN: Vitamin B3 hydrates your skin allowing it to retain its own moisture—think of it as the ultimate skin-improvement ingredient that leaves you with softer, smoother-feeling skinUSE TOGETHER: Use with Olay Skin Care-Inspired Body Wash to boost effects of Vitamin B3 Complex and moisturizing ingredients",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/839d0386-e827-4a31-beca-90a8fb7deb1e.__CR0,0,3000,3000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/8b775d41-f9c0-4927-9a03-861aa2be20a5.__CR0,0,3000,3000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/3ee6a2b8-c930-42a9-998a-96ff4d206704.__CR0,0,3000,3000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "OLAY - Face wash Olay Niacinamide + Peptide 24 Face Wash CLARIFYING FACE WASH: Sulfate-Free daily facial cleanser for healthy-looking skinSULFATE-FREE LATHERING CLEANSER: Lightly scented, translucent cleanser that lathers to remove dirt, oil, and impurities without drying out skinNIACINAMIDE FORMULA: This cleanser, formulated with Niacinamide (Vitamin B3), Peptides, and Glycerin, provides a cleanse that refines the appearance of pores giving you healthy looking skin.CLEAN UP DAILY: Morning and night, when you need a cleanse, wet face with water, gently massage cleanser into a lather over face and neck, then rinse with clean waterFRESH REVEAL: You will instantly experience clean skin, perfectly prepared for the rest of your skincare routine. Within 1 week, you’ll reveal healthy-looking skin. Olay Deep Gel Cleanser with Tea Tree DEEP CLEANSER: Expertly formulated gel cleanser delivers a deep cleansing experience without over-drying, and without sulfatesREFRESHING GEL: This translucent gel transforms into a refreshing lather when massaged into skinINVIGORATING TEA TREE: This face wash includes Vitamin B3 and Tea Tree Essential Oil. Reminiscent of a spa-like experience in your own bathroom, the crisp, earthy scent is similar to peppermint or eucalyptusYOUR GO-TO CLEANSE: Day and night, when your skin needs a refresh, massage one pump of this cleanser into your skin and rinse with warm waterFRESH SKIN: This cleanser rinses away dirt, oil, and impurities without over-drying skin or clogging poresCLEAN INGREDIENTS: Dermatologist tested, pH balanced, and made without sulfates, parabens, synthetic dyes, or artificial fragrance Olay Niacinamide + Peptide 24 Face Wash SMOOTHING FACE WASH: Sulfate-Free daily facial cleanser that hydrates to nourish skin’s surfaceSULFATE-FREE AND CREAMY: Lightly scented cream cleanser hydrates while cleansing to remove dirt, oil, and impurities without drying skin outRETINOL FORMULA: This face wash, formulated with Retinol, Niacinamide (Vitamin B3), and Peptides, hydrates while cleansing for soft, smooth skin.CLEAN UP DAILY: Morning and night, wet face with water, and gently massage cream cleanser over face and neck, then rinse with clean water. For better makeup removal, use this creamy cleanser on a dry face and rinse with water.FRESH REVEAL: You will instantly experience clean skin, perfectly prepared for the rest of your skincare routine. Within 1 week, you’ll reveal soft, smooth skin.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/c2861b11-0d30-4d07-b51b-6a36409dbea9.__CR0,0,1500,1500_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/1b9affb1-e481-4d27-9f86-8a9ee298fbc9.__CR0,0,466,466_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/8bb412ad-6054-4867-b9aa-8cf1d99547a9.__CR0,0,466,466_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Olay Complete Lotion All Day Daily Facial Moisturizing Lotion Lightweight formula with sun protection provides 48 hours of hydration for normal skinDaily facial moisturizing lotion helps prevent premature skin damage with Broad Spectrum SPF 15 UVA/UVB SunscreenConditions skin surface with antioxidants vitamins E, B3 and C to maintain healthy-looking skinFormulated with patented SolaSheer Technology, Olay Complete is America’s #1 UV MoisturizerOil-free, non-greasy and non-comedogenic (won’t clog pores or cause acne) formula for normal skin types. Olay Ultra Moisture Shea Butter Body Wash INDULGE DAILY: Visibly transform your skin in just 2 weeks with our Ultra Moisture Body Wash with Shea Butter, leaving skin feeling smooth & looking healthyCLINICALLY PROVEN: In a clinical study, experts noticed dry skin improvement in 95% of womenOLAY EXPERTISE: Backed by 60 years of skin science“B” IS FOR BEAUTIFUL: Now Olay's proprietary skin care formula, made with Vitamin B3 Complex, helps to transform your skin Olay Cleansing & Replenishing Hand Wash CLEANSES & REPLENISHES: Olay Cleansing & Replenishing Hand Wash with Vitamin B3, Collagen, and the scent of hibiscus cleanses and moisturizes for visibly healthy handsMADE WITH FRESH SCENTS: Scented with soothing notes of hibiscus for a spa-like experienceFORMULATED BY OLAY SKIN EXPERTS: Infused with #1 Dermatologist-recommended moisturizing ingredient, plus Vitamin B3 and Collagen, known for its hydrating properties and skin-strengthening abilities24-HOUR MOISTURE: Washes away germs and locks in long-lasting moisture for healthier-looking skinTRY THE COLLECTION: Pairs well with Olay Moisturizing Hand Serum, Olay Moisturizing Hand Mask, and Olay Cleansing & Firming Body Wash",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/64b6da12-1b47-46ba-964a-65eb9d241137.__CR0,0,466,466_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/54d6c288-8776-4eb7-bed0-e62f5ff40982.__CR0,0,466,466_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/a9cfee71-5391-4821-9ec2-ccd82567c5d4.__CR0,0,466,466_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Olay - Face Moisturizer Olay Regenerist Hyaluronic Acid + Peptide 24 Gel Face Moisturizer HYALURONIC HERO This face gel moisturizer provides supercharged hydration that lasts all day with Hyaluronic Acid, Niacinamide, and PeptidesEXPERTLY FORMULATED fragrance-free face moisturize gel provides all day hydration without a sticky, tacky feelFREE OF parabens, mineral oils, phthalates, dyes, and includes no added fragrancesHYDRATED GLOW DAY & NIGHT Smooth evenly over cleansed face and neck both morning and nightBENEFITS INCREASE OVER TIME from instant hydration that lasts 24 hours to supple and radiant skin that glowsINCLUDES A TRIAL SIZE: Try 1 week of Olay Regenerist Whip Fragrance Free Face Moisturizer Olay Regenerist Vitamin C + Peptide 24 Brightening Face Moisturizer VITAMIN C FACE CREAM Face moisturizer that delivers 2X Brighter Skin* in just 28 days. (*vs a basic moisturizer)LIGHT & REFRESHING Citrus-scented, silky, lightweight cream that melts into skin, does not clog pores, and leaves no greasy residueVISIBLY BRIGHTEN AND HYDRATE with our formula, crafted with Vitamin C, Niacinamide/Vitamin B3 and Lactic AcidRADIANCE DAY & NIGHT Smooth evenly over cleansed face and neck both morning and nightFREE OF parabens, mineral oils, phthalates, and dyesREFRESHING HYDRATION In 1 week, you will have skin that looks less tired. 1 month in, your skin will look brighter, more even and smootherINCLUDES A TRIAL SIZE: Try 1 week of Olay Regenerist Whip Fragrance Free Face Moisturizer Olay Regenerist Niacinamide + Peptide 24 Hydrating Face Moisturizer STRONG & HYDRATED: Hydrates to repair skin for 2x stronger skin barrier* *improvement in baseline vs. untreated skinSILKY SMOOTH CREAM: This creamy, hydrating moisturizer has a light fragrance and absorbs quickly with no greasy residue so it can be worn seamlessly under makeup99% PURE NIACINAMIDE: This clinically proven technology hydrates, with 99% pure Niacinamide and peptides, to improve skin’s moisture barrier to support skin’s natural renewal processGO-TO DAILY MOISTURIZER: Smooth evenly over cleansed face and neck, morning and night. Be sure to use with SPF in the daytimeSTRENGTHENS SKIN: With every use you’ll experience 24-hours of hydration, and in 1 month you’ll see hydrated and visibly improved skin with a 2x stronger skin barrier* *improvement in baseline vs. untreated skin",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/338559ec-23c4-403d-b77c-653c5aeda321.__CR0,0,466,466_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/dcaa94c2-0bba-4c7a-b406-51c4411d8f8e.__CR0,0,466,466_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/392d9a59-40ef-461b-8ec8-623b0f0bd7a8.__CR0,0,466,466_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/99095c27-c49d-44c5-878d-23e14374e36a.__CR0,486,3840,1188_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/839d0386-e827-4a31-beca-90a8fb7deb1e.__CR0,0,3000,3000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/8b775d41-f9c0-4927-9a03-861aa2be20a5.__CR0,0,3000,3000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/3ee6a2b8-c930-42a9-998a-96ff4d206704.__CR0,0,3000,3000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/c2861b11-0d30-4d07-b51b-6a36409dbea9.__CR0,0,1500,1500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/1b9affb1-e481-4d27-9f86-8a9ee298fbc9.__CR0,0,466,466_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/8bb412ad-6054-4867-b9aa-8cf1d99547a9.__CR0,0,466,466_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/64b6da12-1b47-46ba-964a-65eb9d241137.__CR0,0,466,466_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/54d6c288-8776-4eb7-bed0-e62f5ff40982.__CR0,0,466,466_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/a9cfee71-5391-4821-9ec2-ccd82567c5d4.__CR0,0,466,466_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/338559ec-23c4-403d-b77c-653c5aeda321.__CR0,0,466,466_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/dcaa94c2-0bba-4c7a-b406-51c4411d8f8e.__CR0,0,466,466_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/392d9a59-40ef-461b-8ec8-623b0f0bd7a8.__CR0,0,466,466_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Rosie Salvatore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCZJKJBRYA5U6HSCS64LW5OWY7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30T6DZQHG3H5Y?ASIN=B09NPYBW6X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Luxurious Pampering for Mother's Day",
                "reviewText": "The Olay Firming Body Lotion with Collagen bulk pack is the perfect Mother's Day gift for indulging your mom in luxurious pampering. This revitalizing lotion offers a transformative skincare experience, leaving the skin feeling nourished, firm, and supple.With its unique blend of collagen and hydrating ingredients, this body lotion provides intense moisture that helps improve skin elasticity and reduce the appearance of dryness and sagging. It absorbs quickly, leaving behind a velvety-smooth texture and a subtle, refreshing fragrance that lingers throughout the day.The bulk pack allows for long-lasting use, ensuring your mother can enjoy the benefits of this incredible lotion for an extended period of time. Its high-quality formula and dermatologically-tested components guarantee optimum results, making it suitable for all skin types.As an esteemed brand, Olay has been trusted for decades, and this firming body lotion with collagen is no exception. It delivers visible results and imparts a youthful glow, making your mom feel pampered and confident in her own skin.In summary, the Olay Firming Body Lotion with Collagen bulk pack is a perfect gift to celebrate Mother's Day. Its luxurious formula, long-lasting supply, and effective results will make your mom feel indulged and cherished. Treat her to this pampering experience, and watch her skin radiate with the love and care you've bestowed upon her. My mom loved the fact that she doesn’t have to buy any for a while now!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TBK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2VSYNIKIL4NFPNJLFKLVJC4ZVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4539F08P0ZX2?ASIN=B09NPYBW6X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Has helped with thin fragile skin",
                "reviewText": "Smells nice and has helped my dry / thin skin not tear as easily. Has restored some elasticity. Leaves skin nice and soft without feeling greasy or oily.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katy26",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUH4IQJHHBBWMNJ62ABURZH66XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14O7HJH1D07FL?ASIN=B09NPYBW6X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars LOVE this body lotion!!!",
                "reviewText": "I have tried so many lotions in my life but this stuff is the best I have tried so far! I have dry skin that I typically just live with in the summer months but once winter hits, I have to use body lotion every day. This lotion is light, not at all greasy, and leaves my skin feeling so hydrated and soft all day long. I have been raving about this lotion to everyone I know and just purchased some for a friend of mine. A-M-A-Z-I-N-G product!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol Ann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUKEQ4PCDASUHBH6GI2K3FMBATQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ID730KBTOHA2?ASIN=B09NPYBW6X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome lotion for aging skin",
                "reviewText": "I love this lotion. It smells wonderful and helps the crepey skin on my arms and legs look and feel smooth and moisturized all day.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Terri Roberts",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXWSBMORCJDYY2GA7JDOSQIOX7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OHM2LCMCHOO1?ASIN=B09NPYBW6X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Smells great",
                "reviewText": "I bought this lotion after reading about it on my weight loss group. It smells great and isn’t too greasy. Does it firm up your skin??? It seems to but you have to use on a consistent basis both morning and night. If you don’t use it or take a break from it, the “firmness” of your skin goes away. Overall, I like it",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James Morris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZWPCMQBGRCKEJB2EKKVAXVX42Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQWXGUOQV2XT0?ASIN=B09NPYBW6X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Long lasting",
                "reviewText": "Product last until washed off. Consistently does a great job in preventing dry skin.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen Knott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEYNMJGDGPBCPC7SIOQL7SKCWHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UGPQPAG7O58S?ASIN=B09NPYBW6X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent product for the Money",
                "reviewText": "When I was a child; my mother used Oil of Olay face cream. As a large family - always budgeting, Oil of Olay was a ‘small’ luxury she allowed herself. The excellence and economy of this product is amazing and affordable. My mother would be proud. 👍",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eliseus Afamefuna Ezeuchenne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMHQMWCX5GHYR6EODY6ZD3DIQOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QVAOCFQRQPW1?ASIN=B09NPYBW6X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Good quality product",
                "reviewText": "My friends like and love the great gift of the product. They love it and would want to say thanks for its good quality.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Norma Calbert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 16, 2023",
                "reviewTitle": "I really love the txtr of this product and really fel like I am doing something positive for my skin",
                "reviewText": "Especially like how my skin feels after applying this product.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}