{
    "remaining_requests": 23359,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Defense-Moisturizer-Advanced-Ceramide-Pro-Vitamin/dp/B0046OFO3Y",
    "body": {
        "name": "Curel Itch Defense Calming Body Lotion, Moisturizer for Dry, Itchy Skin, Body and Hand Lotion, with Advanced Ceramide Complex, Pro-Vitamin B5, Shea Butter, 20 Ounce, white",
        "price": "$10.42$10.42 ($0.52$0.52 / Fl Oz) $9.32$9.32 ($0.47$0.47 / Fl Oz)",
        "originalPrice": "$11.64",
        "rawPrice": 10.42,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Defense-Moisturizer-Advanced-Ceramide-Pro-Vitamin/dp/B0046OFO3Y",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CL5CRH8F"
        ],
        "asinVariationValues": [
            {
                "asin": "B07Q6354D1",
                "variationName": "Size",
                "variationValue": "12 Ounce Dry Skin Therapy Itch Defense",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B003BJJT7W",
                "variationName": "Size",
                "variationValue": "13 Fl Oz (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "20 Ounce Itch Defense Bundle",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0046OFO3Y",
                "variationName": "Size",
                "variationValue": "20 Fl Oz (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0046OFO3Y",
                "variationName": "Configuration",
                "variationValue": "Body Lotion",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Configuration",
                "variationValue": "Set",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CSYJY91G",
                "variationName": "Configuration",
                "variationValue": "Body Lotion + Body Lotion, Unscented",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CTHM3X9T",
                "variationName": "Configuration",
                "variationValue": "Body Lotion + Cream",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CSY5ZLZ8",
                "variationName": "Configuration",
                "variationValue": "Body Lotion + Lotion, 12 Ounces",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CSYZ6NQ3",
                "variationName": "Configuration",
                "variationValue": "Body Lotion + Lotion, 20 Ounces",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "Save 15%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31f7Ww0IJbL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51- ck3cROL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VYcJDeDyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51io6HXHUNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510W5HND27L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41j9ymgwGLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iqRywtb9L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Curel Store",
            "link": "https://www.amazon.com/stores/Cur%C3%A9lSkincare/page/B92B008A-01F9-408D-B503-9DCDF55570AE?ref_=ast_bln"
        },
        "brand": "CurélSkincare",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 9619,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 1 hr 10 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "RELIEF FROM ITCHY SKIN - Curél Itch Defense is clinically proven to relieve dry, itchy skin, and help to control flare-ups.",
            "SKIN MOISTURIZER - Restores the skin's' moisture barrier to prevent irritation from returning",
            "SAFE FOR MOST SKIN TYPES - Suitable for use on babies 6 months and up",
            "ECZEMA RELIEF TREATMENT - Soothes eczema-prone skin; Granted the National Eczema Association Seal of Acceptance",
            "SKIN REPAIR - With Advanced Ceramide Complex, the lotion rebalances ceramide levels, pH levels, moisture levels and cellular turnover"
        ],
        "description": "Relieve dry, itchy skin with hydration. While traditional body lotions hydrate only on the skin's surface, Curél Itch Defense Body Lotion for Dry, Itchy Skin works at the source of dryness & helps repair skin's moisture barrier. Dermatologist recommended, Curél Itch Defense lotion rebalances the three components of healthy-feeling skin- ceramide levels, pH levels, and moisture levels. Dry, itchy skin is instantly relieved with intensive, soothing hydration. Kao USA Curél Itch Defense lotion was granted the National Eczema Association Seal of Acceptance. Products eligible for the Seal of Acceptance can be used for people with eczema or severe skin conditions and have satisfied the NEA Seal of Acceptance Criteria. Satisfaction Guaranteed. Limitations may apply.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060521"
            },
            {
                "name": "Moisturizers",
                "link": "https://www.amazon.com/Body-Moisturizers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11060661"
            },
            {
                "name": "Lotions",
                "link": "https://www.amazon.com/Body-Lotions/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14024031"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.9 x 1.9 x 4.8 inches; 0.16 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 14076"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 885190466177 698798584057 885904361965 887777078193 885983661031 793379257686 885905070644 019045140763 885903957107 884905823526 885629784452 885782594189 885310387511 811815342502 885781268142"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Kao USA Inc."
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0046OFO3Y"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,177 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #71 in Body Lotions"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 9,619 ratings"
            },
            {
                "name": "Brand",
                "value": "Curel"
            },
            {
                "name": "Scent",
                "value": "Unscented"
            },
            {
                "name": "Item Form",
                "value": "Lotion"
            },
            {
                "name": "Active Ingredients",
                "value": "ceramide"
            },
            {
                "name": "Unit Count",
                "value": "20 Fl Oz"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Curél Itch Defense Lotion Hydrates to relieve dry, itchy skin by going right to the source of dryness helping to repair the moisture barrier. Curél Itch Defense Lotion helps rebalance three components of healthy-feeling skin- ceramide levels, pH levels and moisture levels. Soothing hydration provides relief for dry, itchy skin. Suitable for eczema-prone skin and granted the National Eczema Association Seal of Acceptance.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/66bafe04-7bfb-4758-aa7c-bc695bebff83.__CR0,0,500,500_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Curél Advanced Ceramide Complex Healthy skin with ceramides. Ceramides are naturally present in healthy skin and act as the glue to hold skin cells together, serve as a protective barrier and help to maintain skin's moisture. Unhealthy skin with depleted ceramide levels. When ceramides are lost due to factors such as aging, sun exposure, and other factors, skin can become damaged, dry and irritated. Curél moisturizers contain a proprietary Ceramide Complex. Curél moisturizers with exclusive Ceramide Complex, help restore skin's ceramide levels and penetrate to the source of dryness to repair dry skin's moisture barrier leaving skin hydrated and healthy-looking.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/719d7857-32bc-4721-ae4a-e1897c785c0b.__CR0,5,513,513_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a12eda8e-b0b9-40d8-a18c-77115a2468c9.__CR0,5,513,513_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/dfc0dd2b-f5a0-4572-87c1-0c529aa11f87.__CR0,5,513,513_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Curél Itch Defense Lotion Curél Hydra Therapy Wet Skin Moisturizer Curél Hydra Therapy Itch Defense Wet Skin Moisturizer Curél Ultra Healing Lotion Curél Daily Healing Lotion Curél Dry Skin Therapy Hydra Silk Moisturizer Skin Type For Dry, Itchy Skin For Dry or Extra-Dry Skin For Dry & Itchy Skin For Extra-Dry, Tight Skin For Dry Skin For Dry or Extra-Dry Skin Fragrance Fragrance Free No Added Fragrance No Added Fragrance No Added Fragrance Non-irritating Fragrance No Added Fragrance Benefit The safe and effective formula hydrates to instantly relieves dry, itchy skin and is suitable for eczema prone skin. Gentle enough for babies 6 months and up. The water-activated formula uses the water on freshly showered skin to deliver hydration and ceramides like never before. The water-activated formula uses the water on freshly showered skin to deliver hydration and ceramides like never before. Hydrates to relieve dry, itchy skin. The intensive formula contains extra-strength, naturally hydrating agents to help even the driest skin. Clinically proven to repair and renew extra-dry skin. The non-greasy formula absorbs quickly and is clinincally proven to provide 24 hours of continuous moisturizing. Gentle enough to use on face. The non-greasy formula absorbs in seconds leaving your skin feeling silky-smooth and provides 24 hour moisturization for healthy feeling skin all day. Key Ingredients With Advanced Ceramide Complex, Pro-vitamin B5 & Shea Butter With Advanced Ceramide Complex, Shea Butter, Pro-vitamin B5 & Eucalyptus Leaf Extract With Advance Ceramide Complex, Oatmeal Extract & Vitamin E With Advanced Ceramide Complex, Shea Butter & Oatmeal Extract With Advanced Ceramide Complex & Shea Butter With Advance Ceramide Complex and Aloe Water.",
                "media_link": []
            },
            {
                "media_text": "Curél is on a mission to end dry skin. At Curél Skincare, we believe when people finally find relief from the distraction of their dry skin, they are able to more fully engage in life and do some truly amazing things. That's why Curél Skincare is on a mission to end dry skin, for good. This mission is what compelled Curél scientists to gain unparalleled knowledge of what happens in the skin when it becomes dry. They found that ceramides, the moisture-retaining molecules within the skin, are vital to healthy skin. When ceramides are lost, skin becomes dry and damaged. This is what drove us to develop our Advanced Ceramide Complex and include it in all Curél moisturizers. Our moisturizers work at the source of dryness, helping replenish skin's ceramide levels, for restored and hydrated skin. We can't wait to see what incredible things can be accomplished with dry skin worries behind you! Curél, the end of dry skin, the beginning of so much more.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/893901fb-3883-4631-bba5-cbdde1ac17f0.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d9f91ac9-213e-47b7-8b0f-10d5cf852f50._CR0,0,1685,521_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/66bafe04-7bfb-4758-aa7c-bc695bebff83.__CR0,0,500,500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/719d7857-32bc-4721-ae4a-e1897c785c0b.__CR0,5,513,513_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a12eda8e-b0b9-40d8-a18c-77115a2468c9.__CR0,5,513,513_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dfc0dd2b-f5a0-4572-87c1-0c529aa11f87.__CR0,5,513,513_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1c560f83-0282-41c2-a9d9-8bb5f40c72b0._SR150,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1667b86f-28e3-4a9f-9337-611172aa4e8d._CR0,0,500,1000_PT0_SX150__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5b4cc536-af99-4e3c-8364-dd930af7b8bf._CR0,0,500,1000_PT0_SX150__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/436cc88f-2e30-441b-954a-74bcc32e74f3._CR0,0,500,1000_PT0_SX150__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/74e1c0ee-34fd-4a20-b113-dd7abcfdb260._CR0,0,500,1000_PT0_SX150__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/59d76664-d0cd-466c-94f9-e5915f322d99.__CR750,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/893901fb-3883-4631-bba5-cbdde1ac17f0.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lotus54",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYKFTNNEBG6POISSRXFP6OFWP3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ6OSCDLWCE4I?ASIN=B0046OFO3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2015",
                "reviewTitle": "5.0 out of 5 stars Excellent Value & I'm Pleasantly Surprised",
                "reviewText": "My Eczema recently came back after 30 years of being in remission much to my surprise and horror. But because it's been so long I had no clue what's currently out there for eczema products. I found the NEA website (National Eczema Association) and it's been very helpful. I was on their Facebook page one day and saw a couple of people recommended this Curel 'Itch Defense' formula. I have to be honest, Curel is one of the last companies I would ever think to turn to for this type of product; I know they're a fairly popular brand, but I just didn't think of them as making \"serious\" products for skin conditions. But I went to Curel's website and checked it out.Sure enough, it's a fragrance-free formula designed for eczema and with ingredients I was told to look for and none of the ingredients I was told to avoid. Two things sold me on trying it: 1. It had the NEA Seal of Acceptance. That's a big deal, that means they went through vigorous tests and reformulating in order to meet the criteria of the NEA's standards, including avoiding all ingredients on the NEA's known list of irritants. 2. The price! I had spent hours comparing labels on some very expensive eczema-friendly moisturizers and here was one that seemed to fit the bill AND came in a huge 20 ounce bottle for a very fair price.The lotion is thicker than I expected, somewhere between a lotion and a cream in thickness. It's white but slightly translucent which reflects the highly emollient ingredients like petrolatum and dimethicone. Both are said to be excellent for eczema but many eczema moisturizers will have one or the other, this has both. It goes on thick but spreads VERY nicely. It's definitely on the heavy side, you can really feel that \"barrier\" on the skin. That's exactly what eczema patients need, a moisture barrier on their skin - not a lotion that disappears/evaporates, but the downside to that is that I personally find it an annoying feeling, a slight tackiness on the skin that lingers for a long time, but I'll live.I did get immediate (albeit not total) relief of my INSANE itching. It didn't disappear entirely, but I got relief of the worst of it and some areas have stopped itching, so it's still a huge improvement. I've started using it in two ways: Putting it all over my body morning and night and after showers, and also \"spot treating\" areas, spreading a small amount like an ointment on an area that starts itching out of the blue - it soothes the itch enough for me to leave it alone and I repeat that as needed. I've decided this: I do still need to find a specific treatment cream or ointment to put on the worst areas during flare-ups, but this Curel formula is excellent for after showers to seal in moisture and for general use all over my body on a daily basis during dry winter months. I have to admit I've misjudged Curel; it turns out this is an excellent quality formula that I probably would not have tried if it weren't for the NEA Seal on the bottle.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Glen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUUWMBCON52G7ZM5HI6UGR3AZ3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CCAA6HFO07E6?ASIN=B0046OFO3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Good product.",
                "reviewText": "Helps me with my itch well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FriendlyShopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3JTMJJ54DBJ6RU6PEG723CADFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29P818R00P4P2?ASIN=B0046OFO3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2023",
                "reviewTitle": "5.0 out of 5 stars World's greatest moisturizer, especially if you deal with KP or eczema!",
                "reviewText": "I've used Curel Itch Defense for many years, at least 8 at this point. It's heavily moisturizing without feeling heavy at all and completed scent free. I struggle with keratosis pilaris and have used a wide variety of body lotions to help control it, and what I've noticed is that every time I stray from this, no matter how heavy or highly recommended the product is for KP, I end up with a reoccurrence of the issue within a week. Curel has been a consistent performer along with exfoliating using a hard towel or salux cloth in the shower daily.All three of my littles have or have had childhood eczema and I didn't hesitate to use Curel for them during breakouts. It doesn't sting their sensitive skin and helps control and abate the flares so I don't have to heavily use their prescribed corticosteroid cream.This product is so effective and inoffensive in how it feels, wears and smells that my husband also uses and loves it. He's not a guy who is too into cosmetic applications, and suffers from dry skin so it's a major win that he will use this to help prevent irritation and itching, especially on the hands and feet.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joanna Gonzalez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEFXXRB2TWT53HWAYOYOPW2OMRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5GY3TA2Z0PR4?ASIN=B0046OFO3Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 15, 2023",
                "reviewTitle": "4.0 out of 5 stars Relief for my baby",
                "reviewText": "This is a great product to use for my sons Excema. It helps with his itching at night.I do have to reapply but he gets the relief he needs when I apply it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2QPWFB53L4TRSCNJUEN6QBQRGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N6TMETTPQRSU?ASIN=B0046OFO3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars good for sensitive skin",
                "reviewText": "I use unscented and sensitive products due to menopause issues my body has body itches even when I shower all the time so I look for items that help with my body itches this lotion is great for that.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole HustadNicole Hustad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRMIHUY4QHF2IEJ55MUNBET7WNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TPHLXYYY1JWY?ASIN=B0046OFO3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Hydrating!",
                "reviewText": "My favorite lotion during the winter! It doesn't stay sticky after it dries and leaves skin feeling soft! I used this while i was doing Acutane and it was the only thing that kept my skin from feeling extremely dry all the time. Doesn't really have any scent.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61IyCRalpqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ron",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM6A4XE4KXYSHMVEJHK5ZGKWJEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L47AYM4BTBYV?ASIN=B0046OFO3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars It works great without an overwhelming smell",
                "reviewText": "It quickly moisturizes without an oily feeling and is so odor-free that I can use it on my face...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Drum Guru",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCW5JNGFOPSCHN5MK4VTVIUO6MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z16ZWYQXJ8LE?ASIN=B0046OFO3Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars High quality body cream.",
                "reviewText": "I bought this for the winter months in New England where my skin gets drier than normal. I turned 70 years old and my skin seems to dry out a lot sooner especially after a hot shower. That’s when I put the stuff on and it really works for me. It’s a good value too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "max wornovitzky",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 29, 2023",
                "reviewTitle": "Excelente producto",
                "reviewText": "Para varias partes de mi cuerpo es una excelente crema",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "light",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 25, 2023",
                "reviewTitle": "Very good supplement!",
                "reviewText": "It does help with the itch, soft skin, good price too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josafath Mancera Llanes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 19, 2019",
                "reviewTitle": "La mejor crema para piel extra seca y con dermatitis",
                "reviewText": "Fue la salvación para la piel de mi bebé de 8 meses. Después de batallar varias semanas con una dermatitis seborreica en su cuero cabelludo y dermatitis atopica en cuerpo y cara (que llegaba a empapar de sangre su almohada de tanto rascarse por las noches, un día después del baño le apliqué solo esta crema y al día siguiente su cabeza y piel eran otra, apliqué 2 veces al día como por un mes. Ahora con 1 año 8 meses de edad es la que seguimos usando ya solamente una vez al día después del baño y su piel está divina, como piel de bebé y nunca más tuvo el problema en la cabeza. Entiendo que esta crema es rica en ceramidas, que es lo que les hace falta a algunos bebés con tendencia a piel atópica.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 21, 2020",
                "reviewTitle": "Crema fantastica!",
                "reviewText": "Ottima crema per chi soffre la pelle molto molto secca. Ho la pelle molto sensibile e super secca, nessuna crema fino questa mi aveva aiutato con il prurito fin'ora.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "suavespin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 5, 2019",
                "reviewTitle": "Buen'simo",
                "reviewText": "LLevaré una semana o algo más y es impresionante como me está cambiando la piel. Me lo recomendó un médico. Tuve un grave accidente y me quemé muchísimo. La piel estaba tensa y poco a poco parece otra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}