{
    "remaining_requests": 23246,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Vitamin-Intensive-Therapy-Lotion-Lavender-Neroli/dp/B00CPZHVHI",
    "body": {
        "name": "DERMA-E Vitamin E Lavender and Neroli Therapeutic Shea Body Lotion – All Natural Moisturizer for Dry Skin – Gently Scented Cruelty Free Moisturizing Cream, 8 oz",
        "price": "$6.70$6.70 ($0.84$0.84 / Ounce) $6.32$6.32 ($0.79$0.79 / Ounce)",
        "originalPrice": "$12.95",
        "rawPrice": 6.7,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Vitamin-Intensive-Therapy-Lotion-Lavender-Neroli/dp/B00CPZHVHI",
        "soldBy": {
            "sellerID": "A122S640ZF2951",
            "name": "DERMA E",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A122S640ZF2951&asin=B00CPZHVHI&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "21",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41VhHkOUClL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Z6BQFKx1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61W2L6qUaRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FQGzcjO5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kVZCMbEBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31-igFM3W5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AWCHgD8EL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the DERMA-E Store",
            "link": "https://www.amazon.com/stores/DERMA-E/page/A8CB9483-E1A9-4A0E-9963-0ED0CE4869DE?ref_=ast_bln"
        },
        "brand": "DERMA-E",
        "merchantInfo": "DERMA E",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 192,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SKIN SMOOTHING VITAMIN E LOTION: Deeply hydrating and nourishing dry skin, this Shea Butter and Vitamin E body lotion is enriched with natural ingredients to boost skin softness and elasticity and condition rough and flaky patches.",
            "LAVENDER & NEROLI: This lightweight, cruelty free Lavender and Neroli skin moisturizing cream is scented with natural fragrance oils, and the non-greasy shea body lotion absorbs fast.",
            "ALL NATURAL FORMULA: Aloe Vera Extract soothes and comforts irritated skin; Shea Butter deeply moisturizes; Vitamin E helps protect; Provitamin B5 (Panthenol) deeply hydrates; and vitamin rich Olive Fruit Oil nourishes.",
            "DAILY SKIN CARE: For best results, apply the skin smoothing body moisturizing lotion to the entire body as needed. Concentrate the Vitamin E lotion on areas of dryness, such as elbows and knees.",
            "DERMA E: Clean beauty products that harness nature’s most effective ingredients. 100% vegan and cruelty-free, our eco-ethical skin care products contain no parabens, sulfates, mineral oil, petrolatum, lanolin, gluten, soy or GMOs, and are supplied in recyclable packaging."
        ],
        "description": "DERMA E Vitamin E Lavender & Neroli Skin Smoothing Shea Body Lotion provides a silky smooth blend of vitamin rich moisture to hydrate, nourish and calm the skin. Lightweight and easily absorbed, the non-greasy formula intensively moisturizes and revitalizes areas of dry skin.Full spectrum Vitamin E and therapeutic Shea Butter boost hydration and help restore skin's natural moisture barrier, locking in moisture to condition rough and flaky skin from head to toe, leaving the whole body soft and smooth to the touch.The body lotion is finished with natural fragrance oils to provide a delicate scent, and the Vitamin E lotion absorbs instantly, and can be applied as needed to the entire body, concentrating on areas of dryness. KEY BENEFITS- Lightweight Vitamin E & Shea Butter Body Lotion has a non greasy formula.- The soothing body cream smooths and softens dry, irritated skin.- This intensely moisturizing formula nourishes and protects.- The Lavender & Neroli body cream is scented with natural fragrance oils.CLEAN, ALL NATURAL INGREDIENTSThe body cream is packed full of skin-loving nutrients: Aloe Vera Extract helps to soothe and comfort irritated skin; Shea Butter naturally soothes while deeply moisturizing; Vitamin E is a powerful multi-benefit antioxidant that helps protect skin from damage caused by free radicals and shields skin from the elements while soothing and nourishing; Provitamin B5 (Panthenol) works to deeply hydrate and nourish; and Olive Fruit Oil is rich in nourishing vitamins and antioxidants.DERMA E Vitamin E Lavender & Neroli Shea Body Lotion is 100% vegan and cruelty-free, and does not contain parabens, sulfates, mineral oil, lanolin, gluten or GMOs.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060521"
            },
            {
                "name": "Moisturizers",
                "link": "https://www.amazon.com/Body-Moisturizers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11060661"
            },
            {
                "name": "Lotions",
                "link": "https://www.amazon.com/Body-Lotions/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14024031"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.8 x 3.13 x 8 inches; 8 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 340287"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 787461076781 129500827877 811482777201 707004080815 030985070712 781624760708 811856327728"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ derma e"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00CPZHVHI"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#47,551 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #789 in Body Lotions"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 192 ratings"
            },
            {
                "name": "Brand",
                "value": "DERMA-E"
            },
            {
                "name": "Scent",
                "value": "Lavender and Neroli"
            },
            {
                "name": "Item Form",
                "value": "Lotion"
            },
            {
                "name": "Active Ingredients",
                "value": "hyaluronic_acid, vitamin_e"
            },
            {
                "name": "Unit Count",
                "value": "8.0 Ounce"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Key Ingredients: Vitamin E Shea Butter Provitamin B5 Organic Olive Fruit Oil Organic Aloe Vera Extract Natural Fragrance Oils DERMA E Vitamin E Lavender-Neroli Therapeutic Shea Body Lotion Benefits Dramatically soften, smooth and condition dry, rough, flaky skin with this full-spectrum Vitamin E lotion. Vitamin E helps to improve the moisture and texture of skin Shea Butter helps to add a boost of hydration to help restore skin’s natural moisture barrier Natural Fragrance Oils can bring an enjoyable experience Lavender & Neroli: Relaxing",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a8a747cb-f896-4583-9462-0c1aba650593._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7ed6d0e7-0476-4b39-aaf2-2c022133aa47._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "Full-spectrum Vitamin E Lavender-Neroli Therapeutic Shea Body Lotion With a healthy dose of full-spectrum, naturally-sourced Vitamin E, this silky-smooth healing lotion instantly delivers superior antioxidant, moisturizing and nourishing benefits. Full-spectrum Vitamin E is able to restore and maintain skin’s natural barrier function, helping it regain its natural ability to lock in moisture and defend itself against elemental stress. With the full mix of tocopherols and tocotrienols (alpha-, beta-, gamma- and delta-) sourced from Cranberry Seed and sustainably harvested Red Palm Oil, this moisturizing lotion provides more complete Vitamin E moisture, nourishment and antioxidant defense against environmental aggressors. Lightweight for daily use, this non-greasy formula absorbs instantly to intensively moisturize and revitalize for healthier, nourished skin.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/60f1cbaa-d25f-4fcc-8ac8-8221a9794656._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "No Harmful Preservatives Quality Ingredients: Part of our core ethos is being completely transparent about the ingredients we use. We are proud to state all of the ingredients included in our products on all of our packaging and individual product pages. We are also happy to provide a comprehensive list of all the ingredients we formulate with below: Purified Water, Carthamus Tinctorius (Safflower) Seed Oil, Glycerin (Vegetable Derived), Glyceryl Stearate Citrate (Vegetable Derived), Cetyl Alcohol (Plant Derived), Stearic Acid (Vegetable Derived), Tocopheryl Acetate (Vitamin E), Butyrospermum Parkii (Shea) Butter, Sodium Hyaluronate (Hyaluronic Acid), Vaccinium Macrocarpon (Cranberry) Seed Oil, Panthenol (Provitamin B5), Elaeis Guineensis (Red Palm) Oil, Organic Olea Europaea (Olive) Fruit Oil, Organic Simmondsia Chinensis (Jojoba) Seed Oil, Organic Camellia Sinensis (Green Tea) Leaf Extract, Organic Aloe Barbadensis (Aloe Vera) Gel Extract, Allantoin, Glyceryl Stearate (Vegetable Derived), Glyceryl Stearate SE, Cetearyl Glucoside (Plant Derived), Potassium Sorbate, Phenoxyethanol, Ethylhexylglycerin, Natural Fragrance Oils.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/46029381-84fe-4eb6-b228-071157735920._SR300,300_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/a8a747cb-f896-4583-9462-0c1aba650593._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7ed6d0e7-0476-4b39-aaf2-2c022133aa47._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/60f1cbaa-d25f-4fcc-8ac8-8221a9794656._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/46029381-84fe-4eb6-b228-071157735920._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Laurie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6XLFUB2V4T7APWJUAKRXXAJ2PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OJXY5X86WAQK?ASIN=B00CPZHVHI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2023",
                "reviewTitle": "5.0 out of 5 stars This is great lotion",
                "reviewText": "I needed lotion with vitamin E for post-op scar massage to my foot. It’s just enough moisture for 5 minutes of scar massage and dries non-greasy.And the lavender formulation smells great! It’s a keeper and I’ll be buying it it’s also doing a great job healing all the hand hygiene related cracks and fissures in my cuticles and fingers that come with being an RN.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Renee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV5AQ4BU5TV54DLUFMP33PS2SCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R222SB82WQSSAF?ASIN=B00CPZHVHI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Body lotion",
                "reviewText": "If it feels very cool and very relieving to my dry skin after bath and I definitely recommend it I will continue to use it to see if it lightens any sunspots but it definitely makes my skin feel soft and silky and very moisturized and I will say it does not stay sticky it sinks in and feels lovely. I will repurchase",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Courtnie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEECQG6L4GGTL3Q3WO5KORTOL4RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RC6J73E8L3LSO?ASIN=B00CPZHVHI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2022",
                "reviewTitle": "5.0 out of 5 stars LOVE!!",
                "reviewText": "love the subtle smell. no funny ingredients and moisturizes incredibly well!! the high glycerin content makes my skin feel so supple. i keep a bottle in the car, in my bag and on my nightstand.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gobi55",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLQE6NUP6ZPH6OFE25JBUL7DRPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3REO1XNOKGFNG?ASIN=B00CPZHVHI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 3, 2018",
                "reviewTitle": "4.0 out of 5 stars Worth trying.",
                "reviewText": "The consistency is more on the thick than thin side. Skin does remain a little tacky. Although I'm not a fan of lavender the scent combined with neroli is fine. A little spicy and the lavender can't be detected. On the fence as to whether I'd purchase again. This is free of parabens and other nasties which is a huge positive.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S.D. Moose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAWLQKX6SFBBRMT3BDTG5NFAKCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ULGFMB4BF2Q6?ASIN=B00CPZHVHI",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "3.0 out of 5 stars Just okay",
                "reviewText": "I was excited to try this lotion. I usually like lavender scents and it's vegan which is a must for me. It's decent and I do love that it has active ingredients to not only soften and moisturize, bit to also help treat bumpiness and rough patches. I felt soft after but it's texture makes it harder to spread on your skin. I felt like I had to use more than a slightly thinner lotion to cover the same area. It's a good price for the ingredients you're getting but because it takes more lotion, it just doesn't last very long before you need another tube. Also, if you have older or thinner skin that thickness may tug a bit when rubbing it in. Scent was faint and okay but not as lavender forward as I wanted. It also had a kinda weird background smell from the base ingredients too, but it all fades pretty quickly. For a lotion with active ingredients I will stick with Flamingo body butter and for pretty scented lotion I'll stick with Eos or Hempz",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JA Sweeney",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEY45V3IKNPMOTPSQW5ETXBCGMBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R226U20X6RAFY5?ASIN=B00CPZHVHI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent value",
                "reviewText": "This is a luxurious thick lotion. Excellent hydration no funky ingredients.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKO4DKUKCLVPXTQ2MXZHWXAXDTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGSKONYGEEX7X?ASIN=B00CPZHVHI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2020",
                "reviewTitle": "5.0 out of 5 stars Love this handcream",
                "reviewText": "I have very dry hands and this is great handcream. Vitamin E is very good for skin and I love the neroli and lavender scent. Ifirst bought in the 2 oz size then had to have the bigger size and bought 2 at the same time so I wouldn't go without. It keeps my hands hydrated. My hands can get chapped and crack so using this daily is a good preventative. Highly recommend. Led me to other products with neroli. I'm a long time lavender essential oil user so it's a great combination for me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert Gervasi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGADGEMRZUWAZLGHHFXBR3Y33YNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HJG19T361ESR?ASIN=B00CPZHVHI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2022",
                "reviewTitle": "5.0 out of 5 stars Great product!",
                "reviewText": "Very subtle lavender scent, moisturizes well, and overall, will definitely buy from again!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dan01",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 5, 2018",
                "reviewTitle": "Five Stars",
                "reviewText": "great product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.47",
                "sellerName": "4 Leaf Cloverz",
                "sellerRating": "5"
            },
            {
                "price": "$8.99",
                "sellerName": "Solvano",
                "sellerRating": "5"
            },
            {
                "price": "$11.27",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}