{
    "remaining_requests": 23435,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Jergens-Ultra-Healing-Moisturizer-Ounces/dp/B0034F9K36",
    "body": {
        "name": "Jergens Ultra Healing Dry Skin Moisturizer, Body and Hand Lotion for Dry Skin, for Quick Absorption into Extra Dry Skin, with HYDRALUCENCE blend, Vitamins C, E, and B5, 32 Ounce",
        "price": "$9.95$9.95 ($0.31$0.31 / Fl Oz) $8.90$8.90 ($0.28$0.28 / Fl Oz)",
        "originalPrice": "$12.24",
        "rawPrice": 9.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Jergens-Ultra-Healing-Moisturizer-Ounces/dp/B0034F9K36",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "Savings",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/319i3EFVPvL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41dBenxB7gL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pwda6JIrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jEavRku5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mhM1Y- ML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MlRCzyBiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RpnnhoRaL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c52c0a62-3248-47f7-b820-91c2f13f369b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68ff7bfe-4dec-40c5-b332-0377e1057813/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b67df9f6-6d44-4c4f-a0bc-60379972d73c/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dee871fe-3c3c-4237-95bc-d10099530cc0/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f4bd721b-4ca2-4a78-81d9-25aef3f6da84/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8842bc07-bf15-4424-8385-037fdd8b43c1/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Jergens Store",
            "link": "https://www.amazon.com/stores/Jergens/page/DF83451C-322E-440F-A788-20CF9CDB1F9C?ref_=ast_bln"
        },
        "brand": "Jergens",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 24168,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 1 hr 22 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 1 hr 22 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "HELPS RELIEVE DRY SKIN: Jergens Ultra Healing Moisturizer helps to improve skin's appearance and texture",
            "EXTRA DRY SKIN LOTION: Absorbs into extra dry skin, including typically rough spots like heels, elbows, and knees",
            "HELPS TO REPAIR DRY SKIN: Penetrates five layers of skin and reduce dryness at the source",
            "VISIBLY HEALTHIER SKIN: With continual use of Jergens Ultra Healing Dry Skin Moisturizer, skin is nourished and looks visibly healthier over time",
            "FORMULATED WITH QUALITY INGREDIENTS: A unique formulation, with Hydralucence blend of ingredients combined with Vitamins C, E, and B, to leave skin luminous"
        ],
        "description": "Repair dryness at the source with Jergens Ultra Healing Moisturizer for Extra Dry Skin. The nourishing formula penetrates through five layers of skin to heal extra dry skin, improve tone and texture, and leave it smooth and visibly healthier. The formula absorbs to soften areas that tend to need the most moisture like heels, elbows, and knees. This body moisturizer, with a unique HYDRALUCENCE blend of ingredients plus Vitamins C, E, and B5, leaves your skin luminous and moisturized for up to 48 hours. Jergens hand and body lotion for women and men is carefully formulated for optimal dry skin relief. Jergens hand lotion with pump hydrates and moisturizes dry and cracked hands for extra dry skin relief. Body cream for women and men soothes skin for long lasting hydration. Hand cream for dry cracked hands rejuvenates cracked skin for optimal moisture. Satisfaction Guaranteed. Limitations may apply.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060521"
            },
            {
                "name": "Moisturizers",
                "link": "https://www.amazon.com/Body-Moisturizers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11060661"
            },
            {
                "name": "Lotions",
                "link": "https://www.amazon.com/Body-Lotions/b/ref=dp_bc_aui_C_5?ie=UTF8&node=14024031"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.46 x 1.54 x 3.23 inches; 3.84 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 11000"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 885632597995 885986972547 811781609203 885102224826 887775221621 787734582612 787461604045 885666954788 794628169071 885986402778 799457631973 524883414117 885781256828 883410630070 885190455065 019100110007 885782582803 882209831247"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Kao USA Inc."
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0034F9K36"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#752 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #16 in Body Lotions"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 24,168 ratings"
            },
            {
                "name": "Brand",
                "value": "Jergens"
            },
            {
                "name": "Scent",
                "value": "Unscented"
            },
            {
                "name": "Item Form",
                "value": "Lotion"
            },
            {
                "name": "Active Ingredients",
                "value": "vitamin c,vitamin e"
            },
            {
                "name": "Unit Count",
                "value": "32 Fl Oz"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Jergens moisturizing lotion provides effective, dermatologist-recommended long-lasting dry skin relief. Formulated with revitalizing, moisture-rich ingredients for dewy radiance, our Ultra Healing and Original Scent lotions heal and soothe extra dry skin. Whether you prefer glow-boosting lotion with a cherry-almond scent or replenishing body balm for smooth skin, you can't go wrong adding one of these moisturizing formulas to your daily skin care routine! Soothing ingredients like plant proteins, natural vitamins, and our unique hydralucence blend work together to create luminous, healthy skin.— Radiance-enhancing ingredients that absorb quickly — Dermatologist-tested to nourish and heal dry skin — Soften and smooth for visibly beautiful, healthy skin",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c77b78ea-cfe2-4f02-8673-6cfe5722ddd2.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/e6a699b7-5578-478c-80ac-93444ad1313b.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c77b78ea-cfe2-4f02-8673-6cfe5722ddd2.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bare",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AET46XABEPW22CWXKPD2UIC72UVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZTTHYHLR40P6?ASIN=B0034F9K36",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 19, 2013",
                "reviewTitle": "5.0 out of 5 stars Fixed My Skin Issues Like Nothing Else Could",
                "reviewText": "2-Year Update: Still fantastic. This lotion hardly has a scent (a pleasant one if you really sniff for it), rubs in well so as to not leave skin feeling oily, and has completely resolved my skin dryness issues. I can hardly remember what it was like to have my skin just crack and bleed from being so dry, even after having tried other lotions and healers. Several years in, this is still the best lotion I've found.Original review:I've never been one to use skin lotion, and I'm also rarely happy to put on sunscreen for similar reasons -- I don't like the way my skin feels oily after using it and that it makes everything you touch feel slick, sticky or slippery.However, after living my whole life in the south, I spent a few years farther north, enduring colder, longer and harsher winters than I've ever been through before. In fact, going from a warm, humid (wet) climate to a cold, dry, windy climate really did some damage on my skin, particularly a few different areas on my hands. I tried using some lotion my girlfriend had on it, and it seemed to help, but the redness, dryness and itchiness would only be alleviated for a day or two at most before it would come roaring back.I consulted a doctor who suggested that it might be a fungus (apparently, it can be hard to distinguish between skin irritation and fungus), so I went through a tube of Lotrimin AF trying to treat this. I've also used Neosporin and maybe some other products trying to get my skin to heal. Nothing was working.Even after I moved back down to a warmer climate, my skin irritation lingered. Finally, I read some reviews of this lotion on Amazon. Others had noted similar stories to mine, that they had tried other products, even doctor prescribed medications, on skin issues and nothing had helped until they tried this Jergens Ultra Healing Lotion. I was hopeful that it would work for me, and I'm happy to report that it has.This stuff works wonders, and it doesn't leave me feeling oily afterward. After using this for a few days, my irritation was almost completely gone. For a few weeks, it was still in this state of coming and going, but NOTHING like what it had been before I started using it. My skin had gotten to the point that every few days, my skin would crack and bleed, and bending my fingers or washing my hands would be extremely painful once all these cracks and cuts showed up. Since using this lotion, my skin hasn't come anywhere near this point of irritation. I also ordered some smaller bottles of this so that I could keep some in my car, some at my office, etc., and I could just apply a little any time I started to feel dryness coming on. Now that it has been a few months, I'm hardly even using the lotion anymore and my hands are completely back to normal. Seriously, before, my hands did not look normal -- the redness, the cracking, the cuts, it was awful, and it was far worse on one hand than the other. Now, my hands look exactly the same: completely normal.Every few days, I can feel it starting to come back, but I just apply a little at night and wake up feeling smooth and normal again. This lotion does have a faint scent, but nothing irritating. As I have said, it seems to run in rather quickly and does not leave me feeling like I can't go typing, grabbing the mouse or my phone without leaving that object oily.My girlfriend has abandoned her old lotion. I actually forgot I put this item on subscription and a second, huge bottle came that we didn't really need. However, she simply took that one for herself and put it at her bedside to replace whatever lotion she had been using. She is completely on board with how fabulous this lotion is, and so am I.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JoAnn Worley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMRXMHTNLD233W5T5YS4GD5SCUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROU2PI71NKK0W?ASIN=B0034F9K36",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Best lotion.",
                "reviewText": "Actually rubs into your skin. Does not make your skin greasy looking. Smells good..works great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHB2BOXS5C5SANN24J5SS7NHGNQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FZM8HUWA2E8T?ASIN=B0034F9K36",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Classic!",
                "reviewText": "Thick moisturizer, ideal on your body (can make oily skin on the face clogged). Light and comfortable smell, not at all overpowering or perfumy. The big bottle lasts me for months. I leave it in the bathroom and apply it as soon as I step out of the shower. It’s gentle on the skin, and moisturizes especially well during the winter.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Shopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHVHTDUEPMS67LUNDPEXANVAQNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE3A6FB8LWWT5?ASIN=B0034F9K36",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Outstand Body Moistrizer",
                "reviewText": "Jerkens has come a long, long way! I remember my mom using it for one thing or another, I'm happy to say I love it too! This is for the price and size the very best in body moisturizing! My husband loves it too as do many other 5-star reviewers, what's not to love, it is the best and you can't beat the price here at Amazon! I have tried others but this gives my body the moisture it needs, has no scent, or fragrance and it's hydrating! I highly recommend this wonderful hydrating product to anyone searching for a new go-to body lotion!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheryl RedmanCheryl Redman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVUF4LCG6PTUZDPAN43VKM4NN4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDM84FC3I4KCE?ASIN=B0034F9K36",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2022",
                "reviewTitle": "4.0 out of 5 stars Great product. Needs better packaging",
                "reviewText": "The media could not be loaded. Product is good, spreads easily and is great for moisturizing. However, needs better packaging from the seller. I ordered 2 bottles and they came on time. 1 was ok while 1 was defective, as it was squeezed out in the box and the cap was somehow defective and simply spinning and not popping up to be able to pump the lotion out. I bought them so my daughter and I could each have one, but now I will just have to give her both so she can use the pump from the finished one when it's done, to use on the defective one. And I will have to get something else which is such an inconvenience now.It actually costs me to return stuff to amazon because we dont have a direct UPS drop off point so its a waste of time and money to return the product for a replacement.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81-CcdW40uL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a83a9717-4a7e-49bf-8f4e-d07bbcc41242/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Simone Ball",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4KTU6XHKPLBWF6RPEAIS5AFXEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HSFMLU9ND7GO?ASIN=B0034F9K36",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Very moisturizing",
                "reviewText": "Great smell, long lasting, good consistency",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEB3FVMPRLSDWIKQWBBITIDUAB4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10F1576ZNV1JZ?ASIN=B0034F9K36",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Feels smooth and nice on my skin.",
                "reviewText": "I love this brand, these products, this bottle of lotion works for my needs perfectly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doris Taylor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7W3K27NROTPSWOMKXTBTVT4V7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19OB9JCA145OV?ASIN=B0034F9K36",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Great lotion",
                "reviewText": "I love this lotion but it needs to be packed better. It was just put in a box. The pump broke on mine, leaving lotion all over in the box. I had another pump and there was enough lotion left so I kept but please at least wrap in bubble wrap.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 22, 2023",
                "reviewTitle": "Me encata",
                "reviewText": "Rápida absorción, no queda grasosa, piel suave durante todo el día, simplemente magnifica",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nelly S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 4, 2023",
                "reviewTitle": "Livraison rapide, produit excellent!",
                "reviewText": "Le produit est excellent!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 25, 2023",
                "reviewTitle": "Great",
                "reviewText": "Ideal for dry sore skin, especially hands",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "melouka harizi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 10, 2023",
                "reviewTitle": "Un grand merci pour le soin apporté à ma commande.",
                "reviewText": "Merci beaucoup. J'ai bien reçu ma commande et j'en suis très satisfaite.A bientôt.Bien Cordialement.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Franky",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 26, 2022",
                "reviewTitle": "Jergens Ultra Healing, für mich ein gutes Produkt.",
                "reviewText": "Das Produkt ist für mich super. Als Bodylotion sehr zu empfehlen. Die Haut fühlt sich gut an, klebt nicht und zieht schnell ein.Sehr gute Empfehlung bei trockener Haut.Leider ist der Preis nicht mehr akzeptabel- zu teuer geworden.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}