{
    "remaining_requests": 23340,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Aveeno-Moisturizing-Sensitive-Unscented-Therapeutic/dp/B000LRGG1Y",
    "body": {
        "name": "Aveeno Skin Relief 24-Hour Moisturizing Lotion for Sensitive Skin with Natural Shea Butter & Triple Oat Complex, Unscented Therapeutic Lotion for Extra Dry, Itchy Skin, 8 fl. oz",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Aveeno-Moisturizing-Sensitive-Unscented-Therapeutic/dp/B000LRGG1Y",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "27",
        "stockDetail": "",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31AXZn-sGqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61XdOQ15ujL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51IU qz5SwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dz7WiiDVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31zgePXY0YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nfKDAzc5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lCJQSm 4L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/65ad164e-a154-460d-9898-02a3a1a1b9f8/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d66d8f22-33c4-4437-b44f-fe87b4d925a0/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Aveeno Store",
            "link": "https://www.amazon.com/stores/Aveeno/page/B955336C-1387-441C-ABC5-EA605B4D5548?ref_=ast_bln"
        },
        "brand": "Aveeno",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 3147,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "8-fluid ounces of Aveeno Skin Relief Fragrance-Free Moisturizing Body Lotion with a soothing triple oat and shea butter formula helps heal very dry skin and provides clinically proven relief for itchy, dry skin with 48-hour moisture",
            "Skin relief body lotion has a dimethicone skin protectant with a soothing triple oat and hydrating shea butter formula, which includes oat flour, oat extract and oat oil, that provides soothing relief for itchy, dry skin and locks in long-lasting moisture",
            "The non-greasy, non-comedogenic formula of this skin relief moisturizing lotion has been allergy tested and is specially formulated for sensitive skin and is free of fragrances, parabens and dyes",
            "Gentle enough for use on sensitive skin, this unscented daily lotion is rich, yet fast-absorbing and helps heal itchy, very dry skin with 48-hour moisture",
            "From the dermatologist-recommended skincare brand for over 70 years, Aveeno uses the goodness of nature and the power of science to keep your skin looking healthy and feeling balanced"
        ],
        "description": "Product Description Aveeno Skin Relief Fragrance-Free Moisturizing Body Lotion is a rich, yet fast-absorbing lotion that helps heal and relieve very dry skin. Gentle enough for sensitive skin, the nourishing daily body lotion provides clinically proven soothing relief for itchy, dry skin with 48-hour moisture. This dimethicone skin protectant features a soothing Triple Oat and hydrating natural shea butter formula which includes oat flour, oat extract and oat oil that provides soothing relief for itchy, dry skin and locks in long-lasting moisture. Our fast-absorbing lotion is suitable for sensitive skin and has been allergy tested and is free of fragrances, parabens and dyes. Aveeno uses the goodness of nature and the power of science to keep your skin looking healthy and feeling balanced. Experience all-day moisture and help heal very dry skin with this non-greasy, non-comedogenic body moisturizer, from the dermatologist-recommended skincare brand for over 70 years. Amazon.com Aveeno Active Naturals Skin Relief Moisturizing Lotion is rich, yet fast-absorbing. This triple-oat formula moisturizing lotion with shea butter extract is clinically shown to combat all five symptoms of winter skin: dryness, discomfort, flaking, roughness. and itchiness. And since it has no added fragrances, it's ideal even for sensitive skin. AVEENO Skin Relief Moisturizing Lotion with Soothing OatmealActive Naturals Skin Relief Moisturizing Lotion with Soothing OatmealAt a Glance:Relieves itchy, extra dry skinMoisturizes for 24 hoursCools on contactNoncomedogenicGood for sensitive skinFragrance freeThe triple-oat formula moisturizing lotion with shea butter relieves itchy, extra dry skin. Dermatologist RecommendedThis patented triple-oat formula with shea butter extract relieves and soothes itchy, extra dry skin, and is clinically shown to combat all five symptoms of winter skin: dryness, discomfort, flaking, roughness, and itchiness. This breakthrough lotion starts working immediately to nourish and restore lipids and essential moisture to skin. Rich, yet fast-absorbing, it contains no added fragrance and is good even for sensitive skin. It is a skin protectant and non-comedogenic. Natural Colloidal OatmealThe natural colloidal oatmeal found in AVEENO helps to leave a protective barrier, which prevents water loss to help maintain moisture all day long. The AVEENO oatmeal formulas are also known to soothe and moisturize itchy, extra dry skin. Oats have a long history of being valued for skin care dating back to the ancient Greeks and Romans who used oat baths to heal skin ailments. AVEENO scientists developed innovative formulations, using finely milled (colloidal) oatmeal, that retain the naturally active benefits of the oats. The Science Behind OatsThe scientists at AVEENO discovered a technological advancement that facilitated the fine milling of oatmeal, known as colloidal oatmeal. The innovation of fine milling allowed the colloidal oatmeal to retain its naturally active benefits, which can help to moisturize and relieve dry skin. The Benefits of OatsRelieves dry skinThe natural colloidal oatmeal lotion formulas of AVEENO moisturize and help protect skin.Soothes itchy, irritated skinColloidal oatmeal provides temporary skin protection and, when used in a bath treatment, can relieve minor itching and irritation due to rashes, eczema, poison ivy/oak/sumac, and insect bites.Soothes extra dry, irritated skinColloidal oatmeal combined with menthol, shea butter, and other skin protectants has been clinically proven to relieve itchy, extra dry, and cracked skin.Moisturizes skinOat proteins leave a protective barrier on the skin, which prevents water loss to help maintain moisture.AVEENORecommended by dermatologists for over 60 years, AVEENO combines the best of nature and science to reveal the natural beauty of your skin. AVEENO uses select natural ingredients because of their advanced benefits--they call these ACTIVE NATURALS, natural ingredients uniquely formulated to deliver visible results. What's in the BoxAVEENO Active Naturals Skin Relief Moisturizing Lotion with Soothing Oatmeal, 18-Ounce Pump. Body WashEczema CreamDaily Moisturizing Body WashFragrance Free Skin Relief Body WashEczema Therapy Moisturizing CreamLotionDaily Moisturizing LotionDaily Moisturizing Lotion with SPF 15Skin Relief Moisturizing Lotion Brand Story By Aveeno See more",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1/000-0000000-8675309?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2/000-0000000-8675309?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b/ref=dp_bc_aui_C_3/000-0000000-8675309?ie=UTF8&node=11060521"
            },
            {
                "name": "Moisturizers",
                "link": "https://www.amazon.com/Body-Moisturizers/b/ref=dp_bc_aui_C_4/000-0000000-8675309?ie=UTF8&node=11060661"
            },
            {
                "name": "Lotions",
                "link": "https://www.amazon.com/Body-Lotions/b/ref=dp_bc_aui_C_5/000-0000000-8675309?ie=UTF8&node=14024031"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8.25 x 3 x 3 inches; 8.78 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 1080"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 381370015802"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Aveeno"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B000LRGG1Y"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,842 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #193 in Body Lotions"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 3,147 ratings"
            },
            {
                "name": "Brand",
                "value": "Aveeno"
            },
            {
                "name": "Scent",
                "value": "Fragrance Free"
            },
            {
                "name": "Item Form",
                "value": "Lotion"
            },
            {
                "name": "Active Ingredients",
                "value": "Dimethicone"
            },
            {
                "name": "Unit Count",
                "value": "8 Fl Oz"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Skin Relief 24hr Moisturizing Lotion, Fragrance Free At a Glance: 24 hour moisturizing body lotion Fragrance free Moisturizes and relieves sensitive, or itchy, extra-dry skin Fragrance and steroid free Aveeno Skin Relief 24hr Moisturizing Lotion, Fragrance Free Moisturizes and relieves sensitive or itchy, extra-dry skin. This rich, yet fast-absorbing body lotion starts to work immediately to restore essential moisture so your skin looks and feels healthier. Formulated with Active Naturals Triple Oat Complex, it’s clinically shown to relieve itchy, extra-dry skin and moisturize for a full 24 hours. It’s also fragrance free, steroid free and gentle enough for sensitive skin.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/795c8627-b719-48fe-bd13-074e795f85db._SR285,285_.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/9095ef6c-ae98-48de-9119-fefef5a58de3._SR230,100_.png"
                ]
            },
            {
                "media_text": "Active Naturals Colloidal Oatmeal Locks in moisture and helps prevent dry skin. The Aveeno brand is most trusted for its use of natural ingredients. Oat is the natural ingredient most recommended by dermatologists. As a skin protectant active ingredient, oatmeal can help restore skin's normal pH and aid in the maintenance of skin's moisture barrier helps prevent and protect dry skin. Oat: Oatmeal baths have long been recommended for people with a variety of sensitive skin conditions. That’s because the special properties of oat give it an enhanced ability to absorb moisture and relieve dry, itchy, irritated skin. In 1945, the founders of the Active Naturals Brand developed a special milling process to create colloidal oatmeal. This finely ground oat locks in moisture and retains the soothing effects of the whole oat grain, relieving dry or irritated skin. Colloidal Oatmeal: Active Naturals Colloidal Oatmeal can serve as a skin protectant. It has the ability to attract moisture to the skin and to form a protective barrier.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/40fca1d7-ad68-4d42-8fd9-c1edbd259649._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "About Aveeno Brand From humble beginnings in 1945, the story of the Aveeno Brand has been one of discovery. By unlocking nature’s powers through scientific advances, they have discovered ways to nurture and transform skin and hair to an enhanced state of natural health and beauty.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/836aa43b-963b-43d8-9beb-442dd4d7cda9._SR300,300_.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/795c8627-b719-48fe-bd13-074e795f85db._SR285,285_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9095ef6c-ae98-48de-9119-fefef5a58de3._SR230,100_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/40fca1d7-ad68-4d42-8fd9-c1edbd259649._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/836aa43b-963b-43d8-9beb-442dd4d7cda9._SR300,300_.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LL in AK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTCCN3CLHRPEZO7E2JFMZPFBFRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUG49821T1DVU?ASIN=B000LRGG1Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars seems to work well,",
                "reviewText": "smooth and scentless, goes on well, absorbs well into the skin, not greasy, no scent, seems to work well, I am pleased to far",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katarina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGF7CROK52KWKIT7EIQ24ZVYBQSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JEDIW87H0WZA?ASIN=B000LRGG1Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Love Aveeno",
                "reviewText": "I have been using Aveeno for years and enjoy the sheerness of the lotion. It does the job and it's very affordable, especially compared to other products that claim to moisturize but don't do as good of a job and often cost much more. The scent is mild and the lotion absorbs quickly and isn't sticky. I will continue to use Aveeno products, as they are mild and reliable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S.R.L. ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWKP5DUT57IH4JZMNJ2CD6R25XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15R0Y0GKD1EZS?ASIN=B000LRGG1Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy to use",
                "reviewText": "This is easy to use. I have sensitive skin and this doesn't give me rashes as others do. I love it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lou",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMNDEMQKFS5TNRWNW2FX5JKETUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QBDVETT31B2Q?ASIN=B000LRGG1Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2021",
                "reviewTitle": "4.0 out of 5 stars Just one thing wrong...",
                "reviewText": "The product is fine. I just felt like there wasn't enough in it... but maybe it's that way with everything now a days right? You open a bag of chips and it's half full... this felt a bit like that. Otherwise, I recommend it.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sea Turtle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2WY7PLQZLBASVDG4NEFJUSVOTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HWT0VSYW3HRZ?ASIN=B000LRGG1Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Good quality",
                "reviewText": "I love this lotion. It does a great job moisturizing and absorbs easily.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maggie N.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXS45FKRXZBFWDZCWQVOJXSBZBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YXFRJFEMFTMJ?ASIN=B000LRGG1Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Great lotion!",
                "reviewText": "I have been using Aveeno, lotion for the last forty years probably. I love it, and I love that it’s unscented. It’s really great for the skin",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQPQUHACWJMVDXXRVDPRALXEY2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QQ4CSDYKGTU8?ASIN=B000LRGG1Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Best lotion for sensitive skin",
                "reviewText": "I love this lotion, it leaves my skin so soft.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carole stubbings",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFNMRDKH6ESCPLVMDXVRSX3QNCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9YHTBOT1FTGZ?ASIN=B000LRGG1Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Good moisturizer",
                "reviewText": "I use this every day it’s great for people like me with sensitive skin",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Liam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 13, 2020",
                "reviewTitle": "Helped with dry skin on face and hands",
                "reviewText": "I was using CeraVe for dry skin that appeared randomly on my face, neck, hands and sometimes arms. CeraVe did help, but often I would have to re-apply it all the time. With this Aveeno cream, it cleared up the dry skin on my face instantly and I didn't have to use it again for weeks, which is great becuase with the CeraVe I was having to carry it around me all day to classes at Uni when my skin would dry up again. Personally I don't like the greasy feel it can have when you apply it, so only 4 stars for me, though other than that, it does the job very well, which is the main thing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jesus diaz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 28, 2019",
                "reviewTitle": "Cumple su propósito",
                "reviewText": "Es una crema que ayuda a la piel extra seca, se absorbe rápido en la piel, lo malo es que deja sensación grasosa por un rato pero es en realidad su función de humectar. No tiene nada de olor",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ana maria mantecon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 24, 2020",
                "reviewTitle": "Excelente",
                "reviewText": "Es un excelente producto para combatir la resequedad",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adekemi Alliu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 27, 2019",
                "reviewTitle": "Hidratación total",
                "reviewText": "Padezco de piel seca y esta crema me ayuda a mandtnerla hidratada y ligera",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shopper",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 21, 2015",
                "reviewTitle": "Aveeno a good moisturiser",
                "reviewText": "Aveeno products are good but didn't find much much difference between the original green label and this...excellent moisturiser though.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}