{
    "remaining_requests": 87,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mystery-Guest-Maid-Novel-Molly-ebook/dp/B0C5LRCM2F",
    "body": {
        "name": "The Mystery Guest: A Maid Novel (Molly the Maid Book 2)",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mystery-Guest-Maid-Novel-Molly-ebook/dp/B0C5LRCM2F",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71t2OC8iTZL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Nita Prose",
            "link": "https://www.amazon.com/Nita-Prose/e/B096BLV2JQ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 5557,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C5LRCM2F"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Ballantine Books (November 28, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 28, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5781 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 277 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0593356187"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,568 in Kindle Store (See Top 100 in Kindle Store) #12 in Cozy Mystery #14 in Mystery, Thriller & Suspense Literary Fiction #31 in Cozy Mysteries (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 5,557 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7b0fe416-5426-4098-864d-d39a252c0353.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7c51d178-cc67-4e7d-aa3b-937e6d2660be.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1713036f-8990-44a3-beaa-d459f55afaac.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/38788582-76cc-4904-a859-49706f0b4132.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Book Club Member",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVDZINSDI7FQ2X7TNGH57D3X5YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R452629QY4TXJ?ASIN=B0C5LRCM2F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars A Deeper Dive into the Marvelous Mind of Molly the Maid",
                "reviewText": "\"The Mystery Guest,\" by Nita Prose is the second book in the series about Molly the Maid, a very intelligent person who might be on the autism scale, because her communication skills and social skills were somewhat impaired, leading many to underestimate or misunderstand her. She is guided in life by the moral code instilled in her by her beloved grandmother, now deceased, but whose sayings dominate Molly's everyday thoughts and actions. As Book 2 started, Molly has been promoted to Head Maid at the prestigious five-star Regency Grand Hotel, from which she was almost fired in Book 1 as she was unrightfully accused of murder. She now proudly reports directly to Mr. Snow, the general manager, and is grateful for her faithful friend, Mr. Preston, the doorman. During the action of this book, her live-in boyfriend, Juan Manuel, was MIA, because he was visiting his family in Mexico. Cheryl, the very annoying and unethical former head maid, was back to be a thorn in Molly's side as Molly tried to clear her newest maid-in-training, Lily, from suspicion in the highly sensational poisoning of a famous author who was making an appearance at the hotel for a huge announcement. Just as J.D. Grimthorpe, the highly acclaimed mystery writer began his announcement, he keeled over dead after drinking the tea that Lily had poured. His note cards disappeared from the podium, keeping his big proclamation a mystery. Detective Stark returned, with her anti-Molly attitude from Book 1 in full force. Stark reluctantly followed some of Molly's \"clues,\" which Stark usually deemed to be irrelevant - until they weren't! A very entertaining part of this book was a prolonged flashback that alternated chapters with the present time, in which Molly's grandmother was a maid for the family of the very same J.D. Grimthorpe. Three shocking developments at the end were the reveal of the murderer and the motive, Stark's sudden change of assessment of Molly's detective skills (think Adrian Monk), and a revelation about Molly's grandmother. I am so eager for Book 3!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KWyly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCCBRDLMOA4SFL5NVOEMUWOVV2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30863C799J4Q0?ASIN=B0C5LRCM2F",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "4.0 out of 5 stars A fun mystery!",
                "reviewText": "Molly Gray is now Head Maid at the Grand Regency Hotel. She is perfect for this position because she not only is a rule follower but she takes pride in her work. She has taken timid Lily, maid-in-training, under her wing teaching her the rules of cleaning and proper behavior for a maid at the hotel.The Grand Regency has been chosen to host a special event featuring demanding best selling author J. D. Grimthorpe.Lily has prepared the two Tea Carts for Grimthorpe as he requested. The room is crowded and full of fans and fan clubs to hear the big announcement that the author has promised. But, as he takes the stage and sips his first cup of tea, seasoned with honey instead of sugar, the author drops dead. And once again Molly and The Grand Regency are plunged into the mystery and investigation of a murder committed in the hotel!This second book in the series features Molly and an interesting cast of new and returning characters. All seem to have secrets including my favorite character ( besides Molly) Mr. Preston , the doorman.The story is narrated by Molly as was book one. She is very open about her uniqueness in the way she functions and how she sees life. She is probably somewhere on the autism spectrum. Her story unfolds in flashbacks which helps the reader better understand Molly and her ways.The man she shares life with is in Mexico visiting his mother and most of his appearances in the novel are by phone. It is interesting to see how Detective Stark’s character grows and develops throughout the book. Though Cheryl was up to her old tricks, I did not see her “growth” coming. Overall, I liked the book but not as much as I enjoyed book one, The Maid. Read these books in order which should help explain Molly’s personality and her way of thinking. It’s a good mystery. I am starting 2024 off with this four star read!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mnmloveli",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCTV7IKYZWBT7ILD5IGDKAVHTAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UC0UL49ROIDC?ASIN=B0C5LRCM2F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars ANOTHER AWESOME READ !",
                "reviewText": "‘23 - 5 STARSDESCRIPTION : When an acclaimed author dies at the Regency Grand Hotel, it's up to a fastidious maid to uncover the truth, no matter how dirty. Molly Gray is not like anyone else. With her flair for cleaning and proper etiquette, she has risen through the ranks of the glorious five-star Regency Grand Hotel to become the esteemed Head Maid. But just as her life reaches a pinnacle state of perfection, her world is turned upside down when J.D. Grimthorpe, the world-renowned mystery author, drops dead—very dead—on the hotel’s tea room floor. When Detective Stark, Molly's old foe, investigates the author’s unexpected demise, it becomes clear that this death was murder most foul. Suspects abound, and everyone wants to know: who killed J.D. Grimthorpe? Was it Lily, the new Maid-in-Training? Or was it Serena, the author’s secretary? Could Mr. Preston, the hotel’s beloved doorman, be hiding something? And is Molly really as innocent as she seems? As the case threatens the hotel’s pristine reputation, Molly knows she alone holds the key to unlocking the killer's identity. But that key is buried deep in her past—because long ago, she knew J.D. Grimthorpe. Molly begins to comb her memory for clues, revisiting her childhood and the mysterious Grimthorpe mansion where she and her dearly departed Gran once worked side by side. If there's one thing Molly knows for sure, it's that dirty secrets don't stay buried forever.REVIEW :Debut book by this author was The Maid (‘22 - Read ‘23 - 5 Stars).Feels great to be back in Molly’s world again; can’t wait to see what happens. I loved the mystery of how a couple of the new characters were related from the past. I enjoyed seeing Molly get the recognition she deserves. If you enjoyed The Maid, you will enjoy this one just as much or more. I definitely recommend reading The Maid first to give you more of a connection with Molly. I can’t wait for the next “Molly” book to see where life takes her.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KBarber",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 11, 2024",
                "reviewTitle": "Interesting and fun reading book",
                "reviewText": "Fun read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "irenereads",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 11, 2024",
                "reviewTitle": "An entertaining cozy mystery!",
                "reviewText": "\"The Mystery Guest\" by Nita Prose is the second book in the Molly-the-Maid series and like the first book \"The Maid\", I really enjoyed reading it.The book is more a character-driven cozy mystery than an action-packed crime novel, but this is okay since the main focus is on Molly and her involvement in a murder at the Regency Grand Hotel, where she works as Head Maid. The victim is J. D. Grimthorpe, a renowned bestselling mystery writer, who is residing at the hotel to make an important announcement in front of the press and an exclusive circle of fans. But before he can do so, he drops dead after drinking from his cup tea. As it turns out later, he was poisoned.Molly knows Grimthorpe from when she was a child and accompanied her grandmother, a maid at the author's mansion, to work during her holidays. There Molly made certain discoveries that are very useful now to find the murderer and solve the case. Molly becomes a kind of sidekick to Detective Stark, who learns to appreciate Molly's special way of looking at things and her sharp observation skills.As I have mentioned before, you don't really get lots of action and violence, the focus is on Molly, who has undergone some changes in personality since book one (she is much more self-confident now!) and on J. D. Grimthorpe, who was not the person everyone thought he was. But smart Molly figures out his secret and contributes to solving this case.I like the character of Molly, she's an honest, hard-working, diligent and sensitive young woman, who has finally found her place in life. The ending suggests that there might be a book 3 in the making and that Molly might even go for a different job.Well, I'm definitely looking forward to reading another book featuring Molly!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Razvan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 28, 2024",
                "reviewTitle": "Amazing",
                "reviewText": "What a beautiful read!I would highly recommend reading this book!As well as the first book, ‘The Maid’, the second was is as captivating, emotional, powerful & wise.I absolutely loved it and I think Nita is my new favourite author so far.I love Molly (the Maid) and how Nina portrays her.I was looking forward for the release date of The mystery guest and the author did not disappoint.I really hope there will be more series like this or new books from Nita.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KJS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 24, 2023",
                "reviewTitle": "Maybe Once Was Enough",
                "reviewText": "I greatly enjoyed The Maid, but I'm sorry to say The Mystery Guest failed to enchant me as did its predecessor. Molly's tendency to be very literal now just seemed annoying, not charming, the plot was a rat's nest of complicated motives and behaviours with some adult sexual harrassment tossed in.. There will doubtless be many who welcome Molly's return but for me, she was a once-only delight.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dagmar McColl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 13, 2023",
                "reviewTitle": "What a great book!",
                "reviewText": "I loved the first novel and I absolutely love this one as well. A heart warming, whimsical and refreshing story about a sweet girl who works as a maid and totally loves what she does. Molly is probably on the spectrum and has struggled in so many ways throughout her life. All along she had the support of a wonderful doting grandmother who raised her with exemplary morals. Molly may be naive in some ways but all in all, she’s a remarkable human being. I love this character!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}