{
    "remaining_requests": 67,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ordinary-Grace-William-Kent-Krueger/dp/1451645856",
    "body": {
        "name": "Ordinary Grace",
        "price": "$9.99$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ordinary-Grace-William-Kent-Krueger/dp/1451645856",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Lck4MddFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/516J2iU-leL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "William Kent Krueger",
            "link": "https://www.amazon.com/William-Kent-Krueger/e/B001H6KG50/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 41967,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Pitch-perfect, wonderfully evocative. . . . In Frank Drum’s journey away from the shores of childhood—a journey from which he can never return—we recognize the heartbreaking price of adulthood and its ‘wisdoms.’ I loved this book.” -- Dennis Lehane, New York Times bestselling author of Live by Night and The Given Day“Krueger’s elegy for innocence is a deeply memorable tale.” ― Washington Post“A respected mystery writer turns his attention to the biggest mystery of all: God. An award-winning author for his long-running Cork O’ Connor series, Krueger aims higher and hits harder with a standalone novel that shares much with his other work.... 'the awful grace of God,' as it manifests itself within the novel, would try the faith of the most devout believer. Yet, ultimately, the world of this novel is one of redemptive grace and mercy, as well as unidentified corpses and unexplainable tragedy. A novel that transforms narrator and reader alike.” ― Kirkus Reviews (starred)“...elegiac, evocative.... a resonant tale of fury, guilt, and redemption.” ― Publishers Weekly“Once in a blue moon a book drops down on your desk that demands to be read. You pick it up and read the first page, and then the second, and you are hooked. Such a book is Ordinary Grace. . . . This is a book that makes the reader feel better just by having been exposed to the delights of the story. It will stay with you for quite some time and you will always remember it with a smile.” ― Huffington Post“One cannot read Ordinary Grace without feeling as if it is destined to be hailed as a classic work of literature. Ordinary Grace is one of those very rare books in which one regrets reaching its end, knowing that the experience of having read it for the first time will never be repeated. Krueger, who is incapable of writing badly, arguably has given us his masterpiece.” ― BookReporter.com“My best read so far this year.” ― ReviewingtheEvidence.com“A thoughtful literary mystery that is wholly compelling and will appeal to fans of Dennis Lehane and Tom Franklin. . . Don’t take the title too literally, for Krueger has produced something that is anything but ordinary.” ― BookPage“Not often does a story feel at once fresh and familiar. But Ordinary Grace, a new novel from William Kent Krueger, is both, and it is affecting.” ― Denver Post“Ordinary Grace is engaging from the first page, a quiet novel that unfurls its sad story slowly, but eloquently, leaving its mark on your heart.” ― The Missourian“There’s such a quiet beauty in his prose and such depth to his characters that I was completely captivated.” ― Minneapolis Star-Tribune“A superb literary novel.” ― New York Journal of Books“...the tone is much like To Kill a Mockingbird, with its combination of dread and nostalgia.” ― Detroit News“Everything about this book, from language to ideas to Aeschylus’s epigram is beautiful and you’ll think about it long after you’re finished reading.” ― The Globe and Mail (Toronto)“I realized within pages this would be one of the best books I’ve read in recent years. The gathering threat and its consummation are satisfying and meaningful. This is an intelligent and compelling story told with great heart.... A perfect book club read, truly a book to love and read more than once. Absolutely recommended.” ― Historical Novel Society“Besides being a terrific story that examines a powerful range of human experiences and emotions, it was the authentic voice of the teenage narrator, Frank Drum, that kept me reading late into the night. Though the tone is quiet, Krueger artfully layered the story with suspenseful examinations of family life, death, fury, spiritual fiber and redemption.” -- Beth Hoffman, New York Times bestselling author of Saving CeeCee Honeycutt“Sometimes a work of fiction just comes to you, sits in your soul, touches your life experiences and then is hard to remember as fiction. Ordinary Grace by William Kent Kruger is such a novel.\" ― Capital Journal About the Author William Kent Krueger is the New York Times bestselling author of The River We Remember, This Tender Land, Ordinary Grace (winner of the Edgar Award for best novel), and the original audio novella The Levee, as well as nineteen acclaimed books in the Cork O’Connor mystery series, including Lightning Strike and Fox Creek. He lives in the Twin Cities with his family. Learn more at WilliamKentKrueger.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 6 hrs 16 mins",
            "FREE delivery February 29 - March 6 on orders shipped by Amazon over $35",
            "Or fastest delivery February 28 - March 1",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 13 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER WINNER OF THE 2014 EDGAR AWARD FOR BEST NOVEL WINNER OF THE 2014 DILYS AWARD A SCHOOL LIBRARY JOURNAL BEST BOOK OF 2013 From New York Times bestselling author William Kent Krueger, a brilliant new novel about a young man, a small town, and murder in the summer of 1961.“That was it. That was all of it. A grace so ordinary there was no reason at all to remember it. Yet I have never across the forty years since it was spoken forgotten a single word.” New Bremen, Minnesota, 1961. The Twins were playing their debut season, ice-cold root beers were selling out at the soda counter of Halderson’s Drugstore, and Hot Stuff comic books were a mainstay on every barbershop magazine rack. It was a time of innocence and hope for a country with a new, young president. But for thirteen-year-old Frank Drum it was a grim summer in which death visited frequently and assumed many forms. Accident. Nature. Suicide. Murder. Frank begins the season preoccupied with the concerns of any teenage boy, but when tragedy unexpectedly strikes his family—which includes his Methodist minister father; his passionate, artistic mother; Juilliard-bound older sister; and wise-beyond-his-years kid brother—he finds himself thrust into an adult world full of secrets, lies, adultery, and betrayal, suddenly called upon to demonstrate a maturity and gumption beyond his years. Told from Frank’s perspective forty years after that fateful summer, Ordinary Grace is a brilliantly moving account of a boy standing at the door of his young manhood, trying to understand a world that seems to be falling apart around him. It is an unforgettable novel about discovering the terrible price of wisdom and the enduring grace of God. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Atria Books; Reprint edition (March 4, 2014)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1451645856"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1451645859"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 1.1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,408 in Books (See Top 100 in Books) #27 in Historical Mystery #125 in Coming of Age Fiction (Books) #347 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 41,967 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "2manybooks2littletime2manybooks2littletime",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUG34N77YMYF2CV4XM4LCFLKOGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWG8G8QW6A8O6?ASIN=1451645856",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Captivating and Masterful",
                "reviewText": "𝐎𝐫𝐝𝐢𝐧𝐚𝐫𝐲 𝐆𝐫𝐚𝐜𝐞 is our January pick for my IRL book club. I cannot wait for our discussion. Krueger’s novels never fail to incite great conversations.1. 𝐌𝐚𝐬𝐭𝐞𝐫𝐟𝐮𝐥 - Krueger is hands-down one of the masters of the written word. Every sentence holds such heartfelt meaning. It’s difficult to read as quickly as I usually do because I feel the need to absorb every detail.2. 𝐄𝐧𝐭𝐡𝐫𝐚𝐥𝐥𝐢𝐧𝐠 - Our narrator, Frank, tells us an all-consuming story of one summer of his early teenage years. It is a melancholic period of time in which a great deal of loss is experienced.3. 𝐈𝐧𝐧𝐨𝐜𝐞𝐧𝐜𝐞 - As the summer unfolds, it is difficult for Frank and his brother, Jake, to hold onto their innocence of youth. They observe several occurrences that many adults could not come to terms with. We see their loss through their words and actions, but also the growth from these difficult events.4. 𝐌𝐲𝐬𝐭𝐞𝐫𝐲 - Once the most numbing death occurs for Frank and Jake, we dive into a mystery that I thought I had figured out. Needless to say, it did not turn out as I had predicted; however, once it became a little more clear, I did come to the correct conclusion before it was revealed.5. 𝐖𝐢𝐬𝐝𝐨𝐦 - We always want to know every little secret and piece of gossip, but this story proves that sometimes it is better to not know. Once the truth is out, people can be hurt and more grief will come to be.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71z47F9LumL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maggie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXXG63PL56WIH7QGFL3E35TCBSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R21YZZXZBAVK?ASIN=1451645856",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Gripping Story",
                "reviewText": "Excellent character development. The story captures the reader from the very beginning and doesn't let go. Very enjoyable read. Recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steven Christensen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBLKOEBM3DMXFIDX44MNTZEONOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQETTI8Z3RF3T?ASIN=1451645856",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars A Quiet Peace",
                "reviewText": "The year is 1961 in New Bremen, Minnesota, when several deaths disrupt the peace in this quiet farming community by the Minnesota River. The story is told through the eyes of thirteen year old Frankie, son of the local minister, who tries to make sense of the terrible deaths and the events surrounding the one in particular that strikes close to home.The book is beautifully written describing the interactions among the characters and the concept of trying to make sense of death....is it real or simply a stop along the way in everyone's life. There are several suspects in the murder of one person in particular with reasonable cause but the mystery remains just that until the end of this fine novel. There is also a recurring question of what role God plays in our lives if at all or do we just travel through life unguided by our actions. The interaction between Frankie and his younger brother Jake is simply wonderful as they contemplate the world around them trying to make sense of a time swirling into chaos. This is a tremendous book on many levels and is highly recommended.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MEGAN",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEANP4Y3BKMVO6ZZTEXX2TEQATQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HEONIQ0ZN24I?ASIN=1451645856",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars hope filled chronical through grief and grace",
                "reviewText": "Ordinary Grace is a beautifully written chronicle through grief and loss and grace. Frank Drum reflects on a summer from 40 years ago, a summer filled with exploration, death, and revelation, a summer when Frank was only 13 years old. Frank relives the summer of 1961, one death at a time, as he learns that life isn't always what it looks like, and God's grace is both mysterious and miraculous. Finding the amazing, ordinary, awful grace of God in the midst of loss is a gift, and this story depicts both God's grace for His people and His people's grace toward others. The difficult revelations and circumstances dealt with that summer had the potential to create a very heavy and dark read; however, William Kent Krueger imbued his text with the hope that I long for and look for in the books I read. I would highly recommend this book to any and all readers.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Williams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFQRVEY56GEQGVZN5LKTVQDF6KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSIVQ1CU1LKPA?ASIN=1451645856",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Did anyone else think Mockingbird?",
                "reviewText": "This is a lovely story. It has the warmth and narrative that reminds me of To Kill a Mockingbird. In fact, I hear Gregory Peck’s voice as I read Rev Nathan Drums words. Instead of a small towns respected lawyer he is a respected minister. Read this book. You won’t be disappointed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan Goewey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDNR47VWYTNW54LETVR6QGZSLUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4T48YR4HX971?ASIN=1451645856",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2016",
                "reviewTitle": "4.0 out of 5 stars Comforting lessons revealed via interesting characters, relationships, and story-telling in small town USA, 1961",
                "reviewText": "I read this as assigned reading for a book group of fellow moms who have special needs children. I found it engrossing and, at times, difficult to read due to the emotions it brought forth (especially regarding certain characters with \"special needs\" who, in the early 1960s, were disparaged as \"retarded\"). The book is reminscent of To Kill A Mockingbird (the father is a hero, there are several Boo Radleys), the narrator looks back 40 years later with perspective, but places you in the action of the past. It reminded me also of the movie Stand by Me in that it is a coming of age story of 2 young brothers, both of whom I came to love quickly.The author insightfully describes flawed characters and families and the dynamics and weakness/strengths of families and the thin line between characters pulling together in love and becoming stronger and/or completely falling apart in their unhappiness due to circumstances beyond their control and the dangers of taking others down with them.It is a sad, but redemptive tale. [I would give the book 5 stars (meaning \"I loved it\" rather than \"I liked it\" 4 star) except for the fact that it was so emotionally wrenching for me personally to read as it deals with so much death/loss in just 1 year and, similarly I am still grieving the loss of my own brother, father, and mother in law in a similar time frame. Still I feel I gained comfort and insight from it.]It offers many parables that boil down to death is a part of life, tho some of those deaths are much, much harder to accept than others, we do and it is human nature to seek escapes and even laugh shortly after tragedy, to lesson our pain. There are many brilliant passages that belong on sympathy cards and in funeral services. Without giving any spoilers, I'd like to quote wise words from one greiving character trying to comfort others at the funeral of one of the story's \"Mockingbirds\" felled that I found, in the context of the stories surrounding it, particularly moving:\"When we feel abandoned, alone, and lost, what's left to us? What do I have, what do you have, what do any of us have left except the overpowering temptation to rail against God and to blame him for the dark night into which he's led us, to blame him for our misery, to blame him and cryout against him for not caring? What's left to us when that which we love most has been taken?\"I will tell you what's left, three profound blessings...faith, hope, and love. These gifts, which are the foundation of eternity, God has given to us and he's given us complete control over them. Even in the darkest night it's still within our power to hold to faith. We can still embrace hope. And although we may ourselves feel unloved, we can still stand steadfast in our love for others and for God. All this is in our control. God gave us these gifts and he does not thake them back. It is we who choose to discard them.\"In your dark night, I urge you to hold to your faith, to embrace hope, and to bear your love before you like a burning candle, for I promise that it will light your way. And whether you believe in miracles or not...you will experience one. It may not be the miracle you've prayed for. God probably won't undo what's been done. The miracle is this: that you will rise in the morning and be able to see again the startling beauty of the day.\"Jesus suffered the dark night and death and on the third day he rose again through the grace of his loving father. For each of us, the sun sets and the sun also rises and through the grace of our Lord we can endure our own dark night and rise to the dawning of a new day and rejoice...in the beauty of this morning which he has given us.\"Rereading those words out of context, I guess they could come out of any pulpit on any given Sunday, but within the novel the words were quite moving to me, much like Atticus' closing arguments. In short, Ordinary Grace offers wise lessons revealed through interesting characters and relationships. The engrossing story could take place in any small town USA back in 1961. It is refreshing to be placed in the \"simpler\" times many are nostalgic for (forgetting the awful prejudices of many toward Native Americans, the disabled, and homosexuals), if for no other reason than it is devoid of cell phones and computers and so many modern day distractions. The author paints a believable portrait full of bologna sandwiches, \"jello salads\" as well as forgotten chores like ironing. His peaceful descriptions include gardens, the natural beauty of a flowing river but also the excitement and tension of railroad tracks and trellises and believable characters capable of drama, secrets, prejudices and injustices--as well as compassion, love, forgiveness and the necessary acceptance of \"the awful grace of God.\"",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D Bishop",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 25, 2023",
                "reviewTitle": "Review of “Ordinary Grace”",
                "reviewText": "Beautiful story with each character giving and receiving grace.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 10, 2023",
                "reviewTitle": "A great read for this cold weather",
                "reviewText": "A well written book that I read in one sitting",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laurie JJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 18, 2023",
                "reviewTitle": "Boyhood lost",
                "reviewText": "We all have moments of childhood that we cherish, never realising that they should be savoured. Then sometimes events occur that rip the childhood away and the wonder in our eyes slowly dies as parts of the world we never considered are brought into sharp relief. This is a wonderful telling of those types of events that rush boys far too quickly into manhood.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 3, 2017",
                "reviewTitle": "Super",
                "reviewText": "Absolutely loved the book and so did my book club. Great characters and characters development. A combination of Bildungsroman and murder mystery.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonella",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 20, 2014",
                "reviewTitle": "Written with Grace",
                "reviewText": "Such an enjoyable book. Brings you in a suburban lifestyle with all its family problems. The characters are well described, and the author keeps you guessing till the end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.79",
                "sellerName": "The BAP Goods",
                "sellerRating": "5"
            }
        ]
    }
}