{
    "remaining_requests": 54,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Before-We-Were-Yours-Lisa-Wingate-audiobook/dp/B06Y1MGNL9",
    "body": {
        "name": "Before We Were Yours: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Before-We-Were-Yours-Lisa-Wingate-audiobook/dp/B06Y1MGNL9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51qUEEH95YL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lisa Wingate",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Lisa+Wingate"
        },
        "brand": "Lisa Wingate",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 144776,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Family Saga",
                "link": "https://www.amazon.com/Family-Saga-Genre-Fiction-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10163"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "14 hours and 29 minutes"
            },
            {
                "name": "Author",
                "value": "Lisa Wingate"
            },
            {
                "name": "Narrator",
                "value": "Emily Rankin, Catherine Taber"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "June 06, 2017"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B06Y1MGNL9"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#772 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #12 in Fiction Sagas #32 in Family Saga Fiction #50 in Literary Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWZFNY3ZI2MEPUG5NMXJJZNL4EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P4H0K1ZMW5AY?ASIN=B06Y1MGNL9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2017",
                "reviewTitle": "5.0 out of 5 stars This story will stay with you forever....",
                "reviewText": "No one should miss this novel. I along with many others had NO idea about the nightmare.I loved the 'then and now' pattern of the book - I was kept breathless as to how it would tie in. I normally do my reading last thing in the day, tucked comfortably in bed, hoping I don't read late enough that I sleep too late in the morning. But that went out the window with this one - plus I found myself picking my Kindle up throughout the entire day, thus putting off a LOT of things I SHOULD have been doing.I loved how Wingate writes. I am a huge highlighter of fine novels, this was no exception. There are too many to include in this review but here are some passages by some of the characters to whet the appetite:\"Static makes his thick gray hair stick straight out. I want to smooth it down for him, but I don't. It would be a breach of protocol.\"\"I'm not prepared to cross the line from daughter to caretaker.\"\"We're just like other families. Every available avenue is paved with guilt, lined with pain, and pockmarked with shame.\"\"On occasion, it is as if the latches in my mind have gone rusty and worn. The doors fall open and closed at will. A peek inside here. An empty space there. A dark place I'm afraid to peer into. I never know what I will find. There's no predicting when a barrier will swing wide, or why. 'Triggers'. That's what the psychologists call them on TV shows. Triggers...as if the strike ignites gunpowder and sends a projectile spinning down a rifle barrel. It's an appropriate metaphor. Her face triggers something. A door opens far into the past. I stumble through it unwittingly at first, wondering what might be locked inside this room.\"\"My mind skitters featherlight across treetops and along valley floors. I travel all the way to a low-slung Mississippi riverbank.\"\"She's stubborn as a cypress stump and twice as thick sometimes.\"\"The skin on her cheek stretches so tight, it's crossed with lacy veins like a dragonfly's wings.\"\"They were so young when they had me, I don't think they even thought to teach me the words Mama and Daddy. It's always been like we were friends the same age. But every once in a while, I need them to be a daddy or a mama.\"\"Nothing takes you from thirty years old to thirteen faster than your mother's voice rebounding up the stairs like a tennis ball after a forehand slice.\"\"These past few months have rubbed us raw from the inside out, left each of us silently bleeding beneath our skins.\"\"His eyes are dark as midnight on water. They reflect everything he looks at - a heron bird fishing nearby, branches drooping from a half-broke tree, the morning sky with its foam-white clouds...me.\"\"He reaches out and tweaks Lark's nose, and her lashes flutter like butterfly wings.\"\"He smells of river water and sky. Morning fog in the summer and frost and woodsmoke in the winter.\"\"Spanish moss drips from the trees, as delicately spun as the lace on a bridal veil.\"\"I reach for that sense of comfort, but this visit is pungent with opposing tastes. Bitter and sweet. Familiar and strange. The tastes of life.\"\"The other side of his mouth curves upward into a smile, and a strange sensation travels all the way to my toes. It's like lightning crackling far off over the water - something unpredictable and dangerous.\"\"Riggs just smiles and watches us, his eyes white around the edges and winter-bear crazy. You see a bear moving in the winter, you better look out. He's hungry and he aims to find something to fill that hunger. He won't care much what it is.\"\"I grab my hair and pull until it hurts. I want to pull all of it out. Every single piece. I want a pain I understand instead of the one I don't. I want a pain that has a beginning and an end, not one that goes on forever and cuts all the way to the bone.\"\"The day, and this place, and everything that's happened here goes through my mind. I see it like a motion-picture show, the kind we watch for five cents when the carnivals come through the river towns and shine their projectors on the side of a building or a barn. But the show in my mind is wavy, and blurry, and running too fast.\"\"The day is so sweet, it's like the drops of syrup from a honeysuckle vine. I stick out my tongue and taste and taste.\"\"Overhead, katydids and crickets give the sky a heartbeat, and a million stars shine like far-off campfires. The half-moon hangs heavy, rocking on its back. It's twin rides the ripples in the rain barrel as I pass.\"\"But I can see May withdrawing into herself, the story vanishing like chalk art on a rainy day.\"\"She doesn't understand that all our lives we've been up at first light. There's no other way to live on a shantyboat. When the river comes awake, you do too. The birds speak, the boats whistle, the waves wash up one after another if you're tied anyplace near a main channel. The lines have to be watched, and the fish are biting, and the stove needs kindling. There's things to do.\"\"I drift off to sleep and dream that Fern and me are down on M. Sevier's fishing dock. We're sitting on one of those big suitcases they store in the pantry room, near Zuma's mops and brooms, and we've got it packed full of toys to share with Camellia, Lark and Gabion. We're waiting for Briny and Queenie to pick us up.\" (And there you have the book cover....)\"You don't live all your life on the river without knowing how the moon travels. The river and its critters choose their moods according to the moon.\"\"The portrait artist added the vibrant colors. There is no hue for painting laughter, yet the captured moment radiates joy.\"\"He pulls me in and hugs us both hard. He smells of ashes, and fish, and coal oil, and the big river. Familiar things.\"\"\"They taught me to find the music. Life is not unlike cinema. Each scene has its own music, and the music is created for the scene, woven to it in ways we do not understand. No matter how much we may love the melody of a bygone day or imagine the song of a future one, we must dance within the music of today, or we will always be out of step, stumbling around in something that doesn't suit the moment. I let go of the river's song and found the music of that big house.\"\"A woman's past need not predict her future. She can dance to new music if she chooses. Her OWN music. To hear the tune, she must only stop talking. To herself, I mean. We're always trying to persuade ourselves of things.\"The descriptions of the river, the boat, the sounds, the feelings - you feel as though you have been there even if you never have. I could literally 'taste' places and things thanks to the author's exquisite writing.I cannot decide if the \"Note From The Author\" should be before the story, or after (where it is) - I guess it really doesn't matter - as long as you read it carefully. The information will blow you away.",
                "reviewVotes": "83 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wammy83",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLMC5NKOQU5ECI6CEV7KZG5COPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A7BFVJH2V5AT?ASIN=B06Y1MGNL9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars beautiful story",
                "reviewText": "What a beautiful mystery solved. Horrible situations for these children stolen from their families. I loved how May was able to connect with her sisters. Sad they never found their brother. But I love that her and Judy were able to live their final days together.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA6QHG2DDB7ZNL4OSLLNJ53VWRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16DP1H06C336Y?ASIN=B06Y1MGNL9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars Before We Were Yours",
                "reviewText": "I loved the turn of events and the timeline of the story . I got a little twisted following along as the names changed. Such a sad and sickening situation with the Children’s Society. The characters in the story were enjoyable getting to know and their tales of heartbreak so sad. A four star just because it could be a bit hard to follow at times",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tom Gianfermi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHA7BFIIFNTIKUPTSO4HFXJHP2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVR02XM6BTMYA?ASIN=B06Y1MGNL9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Very good book with heartbreak and hope.",
                "reviewText": "The author's style of alternating between present day and decades earlier tell of two stories in one book. Eventually these stories are folded together. A fictional heartbreaking account of what actually occurred back in the time before the depression and after regarding adoptions. The pace is good and keeps you engaged throughout the book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KimboG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK25FL72AIAKK27RSCOFWGP22QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWUNE72DV4DF4?ASIN=B06Y1MGNL9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars So good",
                "reviewText": "River gypsies weave a heart wrenching tale of the enduring love and unbreakable bond of family. Sweet and sad story of tragedy giving way to good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cynthia G. Allen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZZSXDNNDS34NOXNHTY7KFI3SQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30O4SL7H346GI?ASIN=B06Y1MGNL9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful book!",
                "reviewText": "Wow, this quite a story. I was engaged from the first chapter. A lot of historical fiction, and I learned a lot. The characters are absolutely fascinating and I felt a part of them. The story of sisters growing up on a riverboat and ending up in a life that couldn’t be any more opposite is a ride you will want to take. Take my word!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John McAlexander III",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXEDG7OXWOI56SWWH2SSZIDCTPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WCEUD8EOVYGX?ASIN=B06Y1MGNL9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "4.0 out of 5 stars OK NOVEL . . . . .",
                "reviewText": "Generally speaking, this novel is just OK. If you've previously read anything written by Lisa Wingate, I must let you be the judge on whether you would read another novel she has written. For Me, this novel lacks the depth and scope necessary to really be an INSPIRING novel. I agree...the story-line is truly an interesting one. For myself, there could have been more \"emotion\" within the book .",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "love2read",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHL24GLUYTN4PBZCXSDE7XOLX7TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9VVF0UO7XGE?ASIN=B06Y1MGNL9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars A magnificent story",
                "reviewText": "The way the story is told could not be better. I was not able to put this book down!Outstanding. I Highly recommend this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Benzy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 13, 2024",
                "reviewTitle": "Enjoyed this book",
                "reviewText": "Good book, story was good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "teodoro rodriguez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 3, 2017",
                "reviewTitle": "Before we were yours",
                "reviewText": "Una lectura increible y muy interesante, que te hace pensar en el por que de los acontesimientos ocurridos. Muy recomendable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "louise",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 18, 2023",
                "reviewTitle": "heart wrenching tale of family , hope and humanity.",
                "reviewText": "I was engaged from the get go. I loved the writing style and the pace of the story. I found the past and present easy to read and loved when it culminated at the end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesal J",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 27, 2018",
                "reviewTitle": "Heartbreakingly beautiful",
                "reviewText": "After such a long time, I have come across a book I couldn’t put down! And it is so beautifully written and heartbreaking, to imagine the horror of the situation and the children’s plight. This is a book that’ll shake you, but also make you fall in love with it, with each of the carefully drawn characters. One of my best reads in what I feel has been ages!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 19, 2017",
                "reviewTitle": "Great read!",
                "reviewText": "I really enjoyed reading this book. It is a well told story with relevant historical facts. Would definitively recommend this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}