{
    "remaining_requests": 93,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Complete-Sherlock-Holmes-Arthur-Conan-ebook/dp/B08KHHH69Z",
    "body": {
        "name": "The Complete Sherlock Holmes",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Complete-Sherlock-Holmes-Arthur-Conan-ebook/dp/B08KHHH69Z",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91Xwychai3L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Arthur Conan Doyle",
            "link": "https://www.amazon.com/Arthur-Conan-Doyle/e/B000AQ43GQ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 19663,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B08KHHH69Z"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Sherlock Holmes (September 27, 2020)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 27, 2020"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2382 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 457 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,554 Free in Kindle Store (See Top 100 in Kindle Store) #2 in Classic Short Stories #9 in Mystery Anthologies (Kindle Store) #23 in Single Authors Short Stories"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 19,663 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "D. Strong",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEMFAY6DVANELYY5IZLXMZYOEUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PN0V63ON2FXA?ASIN=B08KHHH69Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Always enjoy Sherlock Holmes",
                "reviewText": "Arthur Conan Doyle is a great writer. His stories about Sherlock Holmes has always been fascinating. Having all these stories in one volume made for many sittings of good reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina Wendle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTXIMPDDLUQS6CO4P3DBQTB2FVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G7EPQ2WBAU96?ASIN=B08KHHH69Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Sherlock Holmes",
                "reviewText": "Love this and it will make a great addition to my collection.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. A. Solinas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVIMKECEZDXXK5QIGX7KWJPN6DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWIPKGNW2TIR1?ASIN=B08KHHH69Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2017",
                "reviewTitle": "5.0 out of 5 stars My dear Holmes",
                "reviewText": "Everybody knows him -- the pipe-smoking detective on Baker Street (with or without the movie-added deerstalker), who is able to deduce all sorts of things just by glancing at a person.But never have Sherlock Holmes' mysteries been as gripping or intricate as in the original tales by Sir Arthur Conan Doyle, who created the character in the first place. \"The Complete Sherlock Holmes\" brings together the dozens of Sherlock Holmes short stories and full-length novels, full of bizarre puzzles that only Holmes has the psychological adeptness and logical deduction to unravel (with the ever-valiant help of Watson, that is).Having done his duty in the army, John Watson returns to England and starts searching for a place to live in London. A friend steers him to 221B Baker Street, home of the eccentric detective Sherlock Holmes, who is searching for a roommate who won't mind his strange habits -- and fortunately, he immediately dazzles Watson with his deductive abilities and the breadth of his knowledge. When a poisoned corpse is found, Watson gets to see Holmes' astonishing detective skills in action.Among the many stories that follow: a blackmail letter, a blue jewel hidden in a Christmas turkey, the \"speckled band,\" an ancient riddle that only Holmes can solve, a young woman given a surreally weird job, a spectral dog haunting the moors, shattered Napoleonic busts, a string of stick figures, a boy kidnapped from his school, the disappearance of a race horse, a \"vampire\" woman in Sussex, a rare tropical illness, a stolen treasure in India, and of course Holmes' bloodcurdling encounter with the malevolent Professor Moriarty and his equally cruel compatriots.Sherlock Holmes mysteries come in two types:1. The case is completely baffling, and Holmes is needed to unravel the knot of obscure clues.2. The case seems straightforward, but Holmes is needed to connect seemingly unrelated clues to the crime in order to find the REAL perpetrator.There are plenty of both kinds in \"The Complete Sherlock Holmes,\" with dozens of cases that require Holmes' unique detecting skills -- it can be something as simple as locating a letter, or something as complex as foiling a years-long pact of revenge over the course of an entire book. Doyle's stately, dignified prose is heightened by moments of excitement or horror (\" It swelled up louder and louder, a hoarse yell of pain and fear and anger all mingled in the one dreadful shriek\"), and he wove in a lot of human psychology into Holmes' cases.Holmes himself... is Holmes. Doyle didn't like his detective much, but Sherlock's knife-edged intellect and fascination with puzzles and esoterica are strangely hypnotic -- even if you wouldn't like to be roomies with the guy, it would be amazing just to sit and watch him work. Watson is the perfect counterpoint for Holmes: he's not a genius but is definitely intelligent, warm-hearted and capable, and we see his own deductive abilities develop as Holmes tutors him.Sherlock Holmes is perhaps the best-known detective in the world, and \"The Complete Sherlock Holmes\" is an excellent way to get to know the Great Detective. Spellbinding, smart and gripping.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7GJZYIPNEHAAFNAC2KTETF2XRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G9W2FDL15L21?ASIN=B08KHHH69Z",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "4.0 out of 5 stars great read!",
                "reviewText": "The \"Sherlock Holmes: Complete Collection\" in Kindle Edition by Arthur Conan Doyle is a literary treasure trove for fans of mystery and detective fiction. This compilation gathers all the adventures of the brilliant detective Sherlock Holmes and his trusty companion Dr. John Watson, offering readers a comprehensive and immersive experience.The Kindle edition is a convenient and portable way to carry the entire collection, making it easy to delve into the intriguing world of Holmes and Watson at any time. The stories themselves are timeless classics, showcasing Arthur Conan Doyle's masterful storytelling and his ability to craft intricate mysteries that keep readers on the edge of their seats.The Kindle formatting is generally well done, making navigation through the collection straightforward. The ability to adjust font sizes and customize the reading experience enhances the overall satisfaction for readers of various preferences.However, my four-star rating is primarily due to occasional formatting quirks that disrupt the reading flow. Some stories seem to have inconsistent formatting, affecting the overall aesthetic and readability. While it doesn't significantly detract from the enjoyment of the tales, a more polished formatting could elevate the reading experience.Additionally, the absence of supplementary content or annotations might leave some readers wishing for more background information or insights into the Sherlock Holmes universe. Including introductions or footnotes could enhance the collection's value, especially for those new to the world of Holmes.In conclusion, the \"Sherlock Holmes: Complete Collection\" in Kindle Edition is a must-have for fans of classic detective fiction. Despite minor formatting hiccups and the lack of additional content, the sheer brilliance of Arthur Conan Doyle's storytelling makes this collection a four-star read. It's a captivating journey into the intricate mind of Sherlock Holmes that will continue to captivate readers for generations to come.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tom P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6KCJ4JNDHJPYY2TQO44MOJQCBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RP6FTHXHJ70R?ASIN=B08KHHH69Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Super sleuthie.",
                "reviewText": "I am happy the book included so many novels.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Updegrove",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJ6ZVYJLLXLFURYBINZGKSTHILA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q76RF11W4T3C?ASIN=B08KHHH69Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Holmes is ever Victorious",
                "reviewText": "I discovered Holmes decades ago and thoroughly enjoyed the first two books then. Reading the entire oeuvre now has been a delightful reunion. I look forward to repeating the experience in the future with less delay.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3QP2RJN7GLTDF45QCJZJR7LJZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GXUNI56Z2MHK?ASIN=B08KHHH69Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Entertaining mystery listening 🎶🔰",
                "reviewText": "I picked this novel hoping that there was something new but not to be. I have read or listened 🎶 to each of the stories in this book. Each story is different with interesting well developed characters lots of action and misdirection leading to each conclusion. I would recommend this free novel to 👍 fans of Sherlock Holmes and readers of mystery novels 👍🔰. 2023 😀👒☺👑",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eliane Carvalho",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 8, 2023",
                "reviewTitle": "Bom",
                "reviewText": "Bom",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 7, 2024",
                "reviewTitle": "Ottimo",
                "reviewText": "Il libro è arrivato in buono stato, copertina particolare da collezione. La scrittura è leggibile non troppo piccola",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 5, 2024",
                "reviewTitle": "Good read",
                "reviewText": "I bought this Kindle collection after watching a documentary on Arthur Conan Doyle. Seen lots of film and TV interpretations but never read a book. Now I have and very enjoyable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rizwan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 25, 2023",
                "reviewTitle": "“It’s a wicked world, and when a clever man turns his brain to crime it is the worst of all.”",
                "reviewText": "he Adventures of Sherlock Holmes collects the first twelve Sherlock Holmes stories, originally published in The Strand magazine throughout 1891-1892. The first story in the collection, “A Scandal in Bohemia,” is the story that made Holmes and his creator a household name.What this collection offers is a great look into the character of Holmes as a master of solving what seems to be the unsolvable: puzzling crimes, murders, mistaken identities and generally mysterious circumstances. Doyle really sets the bar and precedent for the detective genre with Holmes as his lead. Many mysteries in contemporary film and book have been influenced in some manner by Doyle’s Sherlock HolmesSome of the highlights in The Adventures of Sherlock Holmes by Arthur Conan Doyle:In “A Scandal in Bohemia”, Sherlock Holmes employs disguises in attempts to find a photograph that could ruin the potential marriage of the King of Bohemia. This story has a light mood and it is enjoyable to see Holmes battle wits with Irene Adler.“The Boscombe Valley Mystery” has Holmes trying to prove the innocence of James McCarthy, whose father was found dead under odd circumstances. Holmes goes to Hatherly Farm, the scene of the murder, to investigate.“The Man with the Twisted Lip”—Holmes and Watson try to discover the whereabouts of Neville St. Clair, who has disappeared without a trace after last being seen in, of all places, an opium den. Many signs point to a mysterious and deformed beggar as the lead culprit. Holmes’ investigation takes them into the dangerous East End opium den.“It’s a wicked world, and when a clever man turns his brain to crime it is the worst of all.”I enjoyed “The Adventure of the Speckled Band” the most. It is a closed-room mystery at hand for Holmes to solve, as one woman’s sister dies under the most unusual and remarkable circumstances. With seemingly no explanation for the murder and no real clue as to a suspect, Holmes and Watson go to the room where the murder happened. The suspense and tension in the dark room towards the conclusion was top notch.Also included: “The Red-Headed League”, “A Case of Identity”, “The Five Orange Pips”, “The Adventure of the Blue Carbuncle”, “The Adventure of the Engineer’s Thumb”, “The Adventure of the Noble Bachelor”, “The Adventure of Beryl Coronet”, and “The Adventure of the Copper Beeches.”Holmes’ methods of deducing are almost always fascinating and entertaining. He is an astute and keen observer of human behavior, and pays attention to every detail in his surroundings. Watson makes for a great sidekick and ally to Sherlock Holmes, and his narration really makes these stories tick and work in a way that would be much less effective with an outside narrator.The Adventures of Sherlock Holmes by Arthur Conan Doyle is a wonderful collection of Sherlock Holmes stories, some of the most popular out there. A collection like this is the best way to start reading Holmes. Sherlock Holmes’ fans will want to also check out A Study in Scarlet as well as The Hound of the Baskervilles, full length novels.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "avalon93avalon93",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 13, 2023",
                "reviewTitle": "Livre relié",
                "reviewText": "Le livre est magnifique grand et épaisLa couverture donne un effet ancienQuand le livre est fermé les pages sont doréesLes caractères ne sont pas trop petitsChaque histoires sont identifiés sur le haut de la page.Une corde a été installée en tant que marque pageLe livre est sublimePour les profanes, je le recommande car il est magnifique dans la bibliothèque",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Lsjw93lqL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71iP8lOSQ2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61JxcuvvHoL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Hmzu7RxBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712Oeg7-PKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/816TY80HdoL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71HfDZY46dL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}