{
    "remaining_requests": 47,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mysteries-Bill-Watterson/dp/1524884944",
    "body": {
        "name": "The Mysteries",
        "price": "$11.32",
        "originalPrice": "",
        "rawPrice": 11.32,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mysteries-Bill-Watterson/dp/1524884944",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/414JW9fe9ZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21TwSeyCX3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/3116MzKyclL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Bill Watterson",
            "link": "https://www.amazon.com/Bill-Watterson/e/B000APZI66/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 939,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 12 hrs 57 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Andrews McMeel Publishing; First Edition (October 10, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 72 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1524884944"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1524884949"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 8.2 x 0.6 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,677 in Books (See Top 100 in Books) #2 in Literary Graphic Novels (Books) #6 in Fantasy Graphic Novels (Books) #36 in Fantasy Manga (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 939 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Complete Calvin and Hobbes The Calvin and Hobbes Portable Compendium Set 1 The Calvin and Hobbes Portable Compendium Set 2 Calvin and Hobbes (Volume 1) More from Bill Watterson: Box Set Box Set Box Set Paperback",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7e7262c0-813a-40ef-9850-cebf09c8aca0.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e508f1a8-fd88-44c7-b757-9e0df529d659.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/33ea6431-f6b7-4623-81e3-b9b80435e57d.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bbe12156-e7a0-4c9d-adc8-0ac83a23246f.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fa582bcb-97c9-465b-9a34-973d11d23630.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2a547a25-7118-45a1-9e88-064a6be6826e.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6758790d-108d-4b88-bdc0-5cdab918b2af.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b913c5b-0fac-4e34-bc8e-d6e880b462e2.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Chuck Minsker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI5VSQHMBHQ5NRA2RT35VYJFYRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R112CZKQCTCIMN?ASIN=1524884944",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars A New Classic from Watterson and Kascht",
                "reviewText": "This book is by Bill Watterson and John Kascht. Watterson is of course the creator of the greatest comic strip of all time - Calvin and Hobbes - a job he retired from almost 30 years ago (1995). So when he shows up with new work, attention must be paid. Here he’s created, essentially, a children’s book with unusual art. The art was mostly done with Kascht, and it almost looks like Claymation. The story takes us to a small kingdom, where the people live in fear of something called “The Mysteries.” The King sends out his knights to capture one - and the rest of the story plays out from there. It’s a slim book with stunning art, but like Watterson’s old work, I was left with a smile on my face. This will bear revisiting. It’s a lot of fun - and it makes you think. Nothing wrong with that!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bliz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNQEDZHZL5DEISQZDGOQSBFUOSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ3UWGZPUAA5N?ASIN=1524884944",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars An art piece, not a book",
                "reviewText": "If you're looking for wit and a strong narrative, you're not going to find it, but I don't think that's what The Mysteries is about at all. I think the target audience for this is really artists and art afficionados. It's not about story so much as the experience of reading, and how the illustrations evoke a certain mood when you view them. If that sounds interesting to you, give it a read, if not, probably best to save your money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Witty&SarcasticBookClub",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGTDB7YR57IMSI2GL54DCAZMDRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSOYC7HFWC1K8?ASIN=1524884944",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "3.0 out of 5 stars The Mysteries is thought-provoking",
                "reviewText": "When I first heard that Bill Watterson- the Bill Watterson, creator of the beloved Calvin and Hobbes– had come out of retirement to share a new book, I couldn’t contain my excitement. I read the book right when it first released months ago, and it has taken me this long to organize my thoughts well enough to write a (hopefully) coherent review.I came in at a disadvantage. I say that knowing full well that I did it to myself. I expected so very much from the creator of what, in my mind, is the greatest comic ever written. I didn’t expect it to be similar to Calvin and Hobbes per se, but I have to admit that I was massively surprised by how very different The Mysteries is. If I didn’t know that Bill Watterson wrote it, I never would have guessed.The book is described as a fable for adults. It is a fable in the very traditional sense of the word. The story seems very straightforward at first glance, so much so that I can’t describe it without giving everything away. To me, it seemed like there was so much more lurking just beneath the surface, if the reader is willing to take the time to look.One of the (many) things I love about Calvin and Hobbes is that, mixed in with all the zaniness and imagination, there is a current of wisdom. And with that wisdom was hope. Well, the hope is missing in The Mysteries. It is an unutterably sad, though timely, tale. If you’re looking for a book with a happy ending, this is not that book.The story is very simply told. The art is black and white and looks like early Claymation (a wee bit creepy but intriguing). The writing is minimal, with sometimes only a single sentence on a page. It is done to convey a tone and it works beautifully.Answering the “what is it all about” question is complicated. This is one of those books that I believe begs to be discussed with other readers from different walks of life. I think that much of “the message” will depend on what the reader brings into it. Is it about the climate crisis? Is it political? Is it about a lack of respect for anything other than humanity’s sense of self-importance as an “advanced” society? Is it none, or maybe all, of these things? To me, it’s about endings. How an ending can seem sudden, but if you look, the buildup and warning signs have been there since the beginning. What’s the phrase: “Every new beginning comes from some other beginning’s end”? At any rate, The Mysteries is thought-provoking.This isn’t a book that I can say I loved or hated. It isn’t that kind of tale. I can say that I mulled it over long after I turned the final page (for the second time. It required a second reading). Unlike Calvin and Hobbes, this isn’t a book that I’ll return to over and over. Months after reading it, all I can say for sure about The Mysteries is that whether I think it’s good or bad will always remain, well, a mystery.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian D ZapfBrian D Zapf",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUVD2ERCIM4DP3XYMFVCEKQ3CIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKC6J7LI0FGTC?ASIN=1524884944",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2023",
                "reviewTitle": "4.0 out of 5 stars Not Calvin, Not Hobbes, Yet Wholly Watterson",
                "reviewText": "If you're looking for more Calvin and Hobbes, you'll likely be disappointed. This isn't an extension of that universe, nor does it claim to be.But, if you enjoy visually striking books with stories that also make you think, you may like this one.I went in with low expectations and was not disappointed. Would I have liked a longer story? Sure.But the promotional materials don't make the book out to be anything more than what it is - a fable for grown-ups, created in a much different style than the authors' prior works.The style of the book reminds me of \"The Mysteries of Harris Burdick,\" by Chris Van Allsburg. That book presented the reader with compelling visuals and let them imagine for themself what the story and implications were. I loved that book as a kid and felt nostalgic reading Watterson and Kascht's \"The Mysteries.\"Like others have noted, this book was a fast read, but I've already read it a second time. It's a book with subtle and not-so-subtle themes and questions worth reflecting on, many of which align with past interviews Bill Watterson has given on his views. Here's some that I noticed:Humans are naturally afraid of what they don't understand. Once they understand a given mystery, it's no longer necessarily something to fear.At the same time, as a species, we've risen from the dark ages to technological heights by solving mysteries of the universe. Things our ancestors would look at in wonder are now commonplace to us. This commonplaceness leads to a lack of awe at the uncovered mysteries underlying these discoveries. It also leads to complacency about further discoveries.Also, our cumulative discoveries have given us a false sense of security that everything is within our control. It isn't.Further, just because we uncover answers to mysteries, doesn't mean we'll act appropriately on the knowledge. There's plenty of information available on \"better\" living, but many of us don't follow it and don't care.Lastly, humanity is merely a blip in the span of time and the vastness of our ever-expanding universe. The mysteries were here before we existed, and they'll likely exist long after we're gone.This also raises the question of whether all of the noise and strife and fighting of our past, present, and future eras really matter in the scheme of things. Given our lack of cosmic significance are there better ways we could spend our brief span of existence?Lastly, art appreciation is subjective. I hope for Bill Watterson and John Kascht that the experience of creating this work was 5-stars. Neither one of them owes us anything, so I'm grateful they decided to share this with us.I hope they're encouraged to share more creative works with us in the future.",
                "reviewVotes": "97 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Ir05fsTSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71V-yMumPML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "kauaiguy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHP5OZQENMOFC7ULCWAAMGSNVVBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RG2AMA43CD0V5?ASIN=1524884944",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars not Calvin and Hobbs, but it's beautiful and moody.",
                "reviewText": "I've been a Bill Watterson fan for so many years - His Calvin and Hobbs series and books were always an inspiration, usually funny, but with his characteristic deep meanings popping through afterwards. This book is a completely different style, and though short, takes us on a somber journey. Beautifully and simply storied and illustrated by his friend John Kascht, it's worth adding to your collection.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 24, 2023",
                "reviewTitle": "Don't Expect Calvin and Hobbes",
                "reviewText": "Bill Watterson has given a lot to myself and my family with his comics. We love them and read them daily. Mr. Waterson is so much more than that and I think this was a different story, for a different audience, that he believed was worth telling. It's a story for adults presented in a children's format. It felt more like a poem to me and with the drawings I find this is more like art. I purchased this to show support and gratitude for his past work. Otherwise, this type of book I never would have even considered purchasing. I'm very grateful that I did. Its simple, and afterwards it left me lost in thought. Thoughts that I'd love to revisit, and I can anytime, very easily with a quick read of the book. The whole idea of what has been created here is innovative...and it's just a book. I intend to introduce it to my kids at some point and see what types of discussions it creates.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sean Fogaty",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 30, 2024",
                "reviewTitle": "Love it.",
                "reviewText": "It's short, and a parable, but it's really lovely and well written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Wright",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 7, 2024",
                "reviewTitle": "Reasons why Bill Watterson an invaluable antidote for human society (a selection):",
                "reviewText": "1) Creative on his own terms 2) Knows when he is done with a project 3) Does not sell out (Cf. Goodbye Christopher Robin movie quote \"Why can't they get their own bear\") 4) The honesty and insight of this new book, The Mysteries.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ada I",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 6, 2023",
                "reviewTitle": "Vuelve!",
                "reviewText": "Una alegría disfrutar de una obra del autor décadas después",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Valerio TagliaferriValerio Tagliaferri",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 2, 2023",
                "reviewTitle": "Il ritorno di Bill Watterson",
                "reviewText": "Il grande Bill Watterson, dopo molti anni, torna a pubblicare un nuovo volume inedito.Watterson, nato a Washington D.C. nel 1958, pubblica nel 1985 la sua prima vignetta dedicata a “Calvin and Hobbes” che in breve tempo diventa una delle strisce satiriche più famose degli Stati Uniti, pubblicate sui più grandi quotidiani del Paese. Nonostante il clamoroso e duraturo successo, il 31 dicembre del 1995 Watterson decide di smettere di pubblicarle, per dedicarsi ad altro, soprattutto alla pittura.Nel corso degli anni le sue vignette vengono ripubblicate in varie raccolte che riscuotono sempre un grande successo, non solo negli Stati Uniti. Ma dopo diversi decenni Watterson pubblica una nuova storia inedita, realizzata nelle immagini assieme al caricaturista e illustratore statunitense John Kascht.Ci troviamo così in un lontano e cupo regno che è afflitto da un grande e oscuro male: i misteriosi, esseri che qualcuno crede sovrannaturali, dalla forza inaudita e capaci di ogni terribile e infame azione. Nel corso del tempo non sono stati pochi gli artisti che hanno ritratto le gesta terrificanti dei misteriosi, cosa che non ha fatto altro che aumentare il terrore in tutta la nazione.Il Re così raduna i suoi migliori cavalieri per catturare i misteriosi e scoprirne i loro segreti per sconfiggerli. Ma, inesorabilmente, di tutti i cavalieri si perdono le tracce, fino a quando uno, ferito ed esausto, torna al castello con una gabbia che racchiude un misterioso…Deliziosa e godibilissima favola per adulti densa della grande ironia tipica di Watterson che, unita alle immagini grottesche e surreali realizzate dallo stesso autore insieme a Kascht, ci regalano un piccolo viaggio memorabile e divertente.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71X8c1njzgL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}