{
    "remaining_requests": 48,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Twist-Knife-Novel/dp/B09TX1H5PR",
    "body": {
        "name": "The Twist of a Knife: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Twist-Knife-Novel/dp/B09TX1H5PR",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41rnxdrDmdL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Anthony Horowitz",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Anthony+Horowitz&search-alias=audible"
        },
        "brand": "Anthony Horowitz&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 7167,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In New York Times bestselling author Anthony Horowitz’s ingenious fourth literary whodunit following The Word is Murder, The Sentence is Death, and A Line to Kill, Horowitz becomes the prime suspect in a murder investigation—and only one man can prove his innocence: his newly estranged partner in solving crime, Detective Hawthorne.“I’m sorry but the answer’s no.” Reluctant author, Anthony Horowitz, has had enough. He tells ex-detective Daniel Hawthorne that after three books he’s splitting and their deal is over.The truth is that Anthony has other things on his mind.His new play, a thriller called Mindgame, is about to open at the Vaudeville Theater in London’s West End. Not surprisingly, Hawthorne declines a ticket to the opening night.The play is panned by the critics. In particular, Sunday Times critic Margaret Throsby gives it a savage review, focusing particularly on the writing. The next day, Throsby is stabbed in the heart with an ornamental dagger which turns out to belong to Anthony, and has his fingerprints all over it.Anthony is arrested by an old enemy . . . Detective Inspector Cara Grunshaw. She still carries a grudge from her failure to solve the case described in the second Hawthorne adventure, The Sentence is Death, and blames Anthony. Now she’s out for revenge.Thrown into prison and fearing for both his personal future and his writing career, Anthony is the prime suspect in Throsby’s murder and when a second theatre critic is found to have died in mysterious circumstances, the net closes in. Ever more desperate, he realizes that only one man can help him.But will Hawthorne take the call? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=10457"
            },
            {
                "name": "Traditional Detectives",
                "link": "https://www.amazon.com/British-Detectives-Mystery-Thrillers-Books/b?ie=UTF8&node=10461"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "8 hours and 31 minutes"
            },
            {
                "name": "Author",
                "value": "Anthony Horowitz"
            },
            {
                "name": "Narrator",
                "value": "Rory Kinnear"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 15, 2022"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09TX1H5PR"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,286 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #45 in Amateur Sleuth Mysteries (Audible Books & Originals) #50 in Traditional Detective Mysteries (Audible Books & Originals) #176 in Traditional Detective Mysteries (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Beverly A. Martin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYOQWJRKGDSGICF5K44P4L5MBQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1K270FEXMA04V?ASIN=B09TX1H5PR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Hawthorne As A Friend",
                "reviewText": "If you've been reading this series, you know that Anthony and Hawthorne comprise an ill-matched, yet effective, duo. In this latest book, Hawthorne and Anthony finally bond.Nearly.Read how he tries, and whether or not Hawthorne succeeds, to come to the aid of his BFF.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JaNea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKF3HDRJ5DPJIGOS6OFSB7U5MHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AOQYVE85FU3P?ASIN=B09TX1H5PR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2023",
                "reviewTitle": "4.0 out of 5 stars Oddly Attached to this Pair",
                "reviewText": "I look forward to the next book but I will say more so than any other of the books this one does explore how dissatisfying justice can truly be.I appreciate Tony as an unreliable narrator of sorts, but having him as our guide reveals one of the simplest aspects of humans what we want and expect from others AND what we give to people. Our image relies on several things and one of those things is in fact what we allow ourselves to share.It’s fun in that aspect, not to mention watching Tony get everything wrong while squawking and complaining keeps me smiling.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Isabella palmetto",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHST2XJVAQZNF77CNOBD3PQUQCPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10DBHR89RQFPD?ASIN=B09TX1H5PR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Virtuoso",
                "reviewText": "As far as AH's \"Hawthorne\" series is concerned, this fourth novel is his masterpiece. I've loved all of them, as well as many of his other books and TV series, but this one is superb. Other reviewers on this site have provided excellent encapsulations, so I'll skip that, and give a few examples of what I loved best about \"Twist.\" On the heels of the Alderney literary crowd, many of whom were delightfully obnoxious in the previous book, AH now take us to the actors and peripheral contributors to one of his London stage plays. He has certainly worked with hundreds of performers for decades, and his insights as to their talents, quirks, narcissism, and dark sides are convincingly portrayed. Perhaps it's because I'm so familiar with his works that I was able to hone in on the most likely suspect within the first 100 pages, but in AH's inimitable fashion, I often had doubts because everyone among the suspects had a motive to kill the poison pen drama critic. The big reveal at the end a la Agatha Christie is very satisfying to those readers who have been paying attention to the many clues sprinkled throughout. Next, the relationship between AH and Hawthorne shifts in a fascinating way: rather than the typical Sherlock-Watson partnership, Hawthorne now has dominance. The suspense of the murder plot is paralleled by the irony of AH's ability to learn more about his reluctant sidekick's background, but like opening a Russian doll, each discovery leads to more inscrutable mystery about the erstwhile detective upon whom AH must now depend for his very survival. Additionally, the contrast between what the audience of \"Mindgame\" sees onstage vs. the backstabbing, gritty furnishings, and shabby-not chic rabbit warren that passes as the backstage area mirrors a common AH theme that appearances are deceiving. Even the actors themselves, who appear strong and confident in their roles, shrink and dissolve in their real life behaviors; all three of them seem to be over-compensating or running away from some unknown secret in each of their pasts, but as art imitates life, it catches up to them, as well as the hapless producer, director, stage manager, and investor. Lastly, the ending suggests more sequels yet to come, despite AH swearing off more Hawthorne books at the get go. If only they were filmed...but that's another wish for another day.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William de Rham",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIO7HNVQSDLCEWJZ5CQSKT72VIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12CI1WNM7J6F9?ASIN=B09TX1H5PR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2022",
                "reviewTitle": "4.0 out of 5 stars Good beach, plane, or train fare.",
                "reviewText": "This is the fourth in a series of murder mysteries in which author Anthony Horowitz fictionalizes himself to join detective Daniel Hawthorne as he utilizes Sherlockian powers of observation and deduction to bring murderers to justice. Only this time, it's Horowitz himself who looks like he's done the murder. All the evidence points to him. And he has every motive. The victim just closed his play--newly opened on London's West End--with an absolutely scathing review. Will Hawthorne be able to save Horowitz? Does he even want to?For the most part, \"The Twist of a Knife\" is a well-written, well-constructed mystery seasoned, in places, with a self-deprecating, dry wit. It's a quick read and fairly light entertainment, perfect for the beach or a long train or plane trip.Plot-wise, there's nothing really new here. Mr. Horowitz has taken a standard template--solving the murder of a victim hated with good reason by all the other characters--and tried to freshen it up by making himself the chief suspect and setting it in the world of the theater and in London and the English countryside. Unfortunately--and this may just be me--I found the device of fictionalizing himself to be distracting. Mr. Horowitz makes more than a few references to his own previous works and projects and I sometimes found it difficult to tell what was real and what was fiction.I also found the Hawthorn character somewhat distant and elusive and difficult to bring into focus--not sharply drawn as, say, a Holmes or a Poirot or a Sam Spade. Yes, his mystery-solving powers are acute, but his personality and his relationship with the fictional Horowitz were not all that they could be.And while Mr. Horowitz does a good job depicting the world of the theater, those who are not interested in or knowledgeable about that world (its plays, traditions, foibles, etc.) may find themselves lost at times.Still, the ending is a surprise and enjoyable since it's well supported by what has gone before.All in all, 3.5 stars rounded up to 4.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5L4DQVMIPD7X5AHIBCYMJD35NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32Q96KI4E6KB3?ASIN=B09TX1H5PR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars It was a present",
                "reviewText": "She liked it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gammyjill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDNUOKH43TOXPIT4LLZLNFH6DRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NHKXTWIXFGS2?ASIN=B09TX1H5PR",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2022",
                "reviewTitle": "3.0 out of 5 stars Disappointing…",
                "reviewText": "I finished British author Anthony Horowitz’s latest book, “The Twist of a Knife”, vaguely disappointed. I’ve read all three previous novels in the Daniel Hawthorne series and been pleased by Horowitz’s writing. He combined mystery and psychological insights into very entertaining books. However, “The Twist of a Knife” was different. It seemed to lack the zip of his previous books and was much more of a conventional murder mystery.I’ve often wondered when an author a book series decides it’s time to end that series. It’s usually after a decline in the author’s writing. He seems to lose interest in his character and his former intricate plots unravel into ordinariness. I wonder if that’s happening with Anthony Horowitz and his Hawthorne series.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "george claridge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 3, 2023",
                "reviewTitle": "Great book",
                "reviewText": "Have always liked his books and this one was more of the same writing that i like.Definably buy it and any of his other books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kritika Kapoor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 9, 2023",
                "reviewTitle": "Gripping mystery with relatable dilemma and character",
                "reviewText": "Anthony Horowitz has cracked the mystery-thriller code. The Hawthorne series has everything- angst, friendship, weird twists, chilling climax and a grappling writer as the main lead. Love it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joanne Sheppard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 3, 2022",
                "reviewTitle": "Witty, original mystery",
                "reviewText": "Anthony Horowitz's Hawthorne novels are what I think is now my current favourite detective series. The Twist of a Knife is the fourth in the series and, as always, Horowitz narrates the story as himself, with the premise that he writing crime novels based on Daniel Hawthorne's investigations.Hawthorne, a disgraced former police officer who was thrown out of the force for assaulting a suspected paedophile in custody, does not make Anthony's task easy. He's secretive about his investigative breakthroughs and his private life, deadpan to the point of blankness, and almost childlike in both his bluntness and his jaw-dropping cheek. He insists on calling Anthony 'Tony', which Anthony hates, and seems to be able to inveigle his way into places with a mysterious charm that's almost never apparent in his relationship with Anthony himself. In short, he is consistently infuriating, and yet at the same time utterly fascinating.At the start of The Twist of a Knife, Anthony has honoured his three-book contract with Hawthorne and has no desire to continue their partnership. Instead, his attention is focused on the opening of his new play in the West End, a career landmark and a lifelong ambition fulfilled. But then a broadsheet theatre critic gives the production a viciously bad review, the kind that can close a show down. The next morning, she's found murdered with one of the souvenir daggers given to the cast and crew on the opening night, and all evidence points towards Anthony being the culprit.Anthony, clearly, should use the one phone call he's allowed when under arrest to contact his solicitor or his wife - but inevitably, when it comes to the crunch, it's Hawthorne's number he dials.Like the previous books in the series, The Twist of a Knife feels like a modern take on Golden Age detective fiction, and it's a highly successful one, complete with a fiendishly clever plot, a sleuth pitting his wits against the police to solve the crime, and a classic ensemble reveal. Horowitz's novels are always masterclasses in pacing, and The Twist of a Knife is no exception, with the investigation itself becoming a race against time to find the real murderer before Anthony is charged.It's also, at times, very funny. The many pretensions and flaws of the characters are well-observed and there is nobody who can take down an ego like Hawthorne, who does so with such an matter-of-fact ease of manner that it's often unclear whether he's even doing it on purpose. As always, Horowitz is remarkably willing to present his own character as very much the Watson to Hawthorne's Holmes, always one step behind in the murder investigation.However, in addition to the self-contained murder plot in each novel in this series, there is a continuing puzzle to be solved, which is the mystery of Hawthorne himself. He appears to have been married at some point, and he has a son. His only interest is making elaborate Airfix models, and his social life seems to consist solely of going to a slightly awkward book club with the other residents of his apartment block, where lives in a peculiarly anonymous flat which he claims to be housesitting in for his 'sort of half-brother'. But most intriguingly, he is extremely cagey about his past, and Anthony has reason to believe that Hawthorne might have an awful lot to hide. Partly driven by a desire to beat Hawthorne at his own game and partly by a writer's natural instinct to build a character's back story, Anthony chips away a little more of Hawthorne's defences in each book in the series.This is made all the more intriguing by an underlying darkness in Hawthorne, which simmers beneath the Christie-esque mystery plot in each novel and occasionally threatens to bubble to the surface. There are elements of Hawthorne's character that hint at sadness, but there are also times when his manner can be sinister, even cruel. He can appear understanding towards the suspects he interviews, but he can also be needlessly hard on them, and one wonders whether any sympathy we see in him is pure deception.As I understand it, there are a few more books planned in this series. As far as I'm concerned, they can't come soon enough.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rosalind Robb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 26, 2022",
                "reviewTitle": "Enjoyable and very funny as expected.",
                "reviewText": "I have enjoyed all the books in this series, and this is another enjoyable and highly entertaining addition. The writing is crisp and concise, often hilarious. I also enjoyed learning new words and how they are used in sentences. The plot cracks along with a satisfying conclusion.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul Smith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 21, 2023",
                "reviewTitle": "Typical Horowitz",
                "reviewText": "It wasn’t one of his better ones cause I figured out who dun it before the twist came. Still worth reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}