{
    "remaining_requests": 108,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Quarry-Girls-Thriller-Jess-Lourey/dp/1542034299",
    "body": {
        "name": "The Quarry Girls: A Thriller",
        "price": "$9.19",
        "originalPrice": "$15.95",
        "rawPrice": 9.19,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Quarry-Girls-Thriller-Jess-Lourey/dp/1542034299",
        "soldBy": {
            "sellerID": "A35CR5HWX5YT8U",
            "name": "WE GARLAND",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A35CR5HWX5YT8U&asin=1542034299&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81fHGvdh-XL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jess Lourey",
            "link": "https://www.amazon.com/Jess-Lourey/e/B001IODOR8/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "WE GARLAND",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 51579,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “[The Quarry Girls is] one of the most anticipated thrillers of the fall season…[The] novel is about innocence lost, the unwritten rules of silence in small towns, what ‘broken men’ do to others, and what boys growing into men do in packs that they would never do alone. And then there’s the courage of one woman who will not allow herself to be killed.” ―St. Paul Pioneer Press“Like Unspeakable Things and Bloodline, Jess Lourey’s The Quarry Girls is ultimately a morality tale―almost a dark fairy tale except that the plots are rooted in reality and the danger is all too real. The sad fact is that there is no shortage of past crimes to prompt Jess Lourey’s creative mind, but readers can rest easy knowing that this author will approach every idea with deep reverence for the victims and a goal of providing a healing and heartfelt journey―for both the characters and their readers―within the pages of some truly exceptional crime fiction.” ―BOLO Books“Jess Lourey’s new novel The Quarry Girls is a love letter to Gen-Xers and Murderinos everywhere.” ―The Big Thrill“The Quarry Girls is true crime told as fiction and most certainly will cause readers to have some sleepless nights.” ―Bookreporter“Few authors can blend the genuine fear generated by a sordid tale of true crime with evocative, three-dimensional characters and mesmerizing prose like Jess Lourey. Her fictional stories feel rooted in a world we all know but also fear. The Quarry Girls is a story of secrets gone to seed, and Lourey gives readers her best novel yet―which is quite the accomplishment. Calling it: The Quarry Girls will be one of the best books of the year.” ―Alex Segura, acclaimed author of Secret Identity, Star Wars Poe Dameron: Free Fall, and Miami Midnight“Jess Lourey once more taps deep into her Midwest roots and childhood fears with The Quarry Girls, an absorbing, true crime–informed thriller narrated in the compelling voice of young drummer Heather Cash as she and her bandmates navigate the treacherous and confusing ground between girlhood and womanhood one simmering and deadly summer. Lourey conveys the edgy, hungry restlessness of teen girls with a touch of Megan Abbott, while steadily intensifying the claustrophobic atmosphere of a small 1977 Minnesota town where darkness snakes below the surface.” ―Loreth Anne White, Washington Post and Amazon Charts bestselling author of The Patient’s Secret“Jess Lourey is a master of the coming-of-age thriller, and The Quarry Girls may be her best yet―as dark, twisty, and full of secrets as the tunnels that lurk beneath Pantown’s deceptively idyllic streets.” ―Chris Holm, Anthony Award–winning author of The Killing Kind“Lourey nails the sights, music, and culture of the 1970s through the lens of teenagers in The Quarry Girls. Lourey’s skillful plotting illustrates how powerless the girls feel when confronted with the actions of older teens and the town’s powerful men.” ―Oline Cogdill, Sun Sentinel About the Author Jess Lourey is the Amazon Charts bestselling author of Litani, Bloodline, Unspeakable Things, The Catalain Book of Secrets, the Salem’s Cipher thrillers, and the Mira James mysteries, among many other works, including young adult, short stories, and nonfiction. An Edgar, Agatha, Anthony, and Lefty Award nominee, Jess is a tenured professor of creative writing and sociology and a leader of writing retreats. She is also a recipient of The Loft’s Excellence in Teaching fellowship, a Psychology Today blogger, and a TEDx presenter. Check out her TEDx Talk for the inspiration behind her first published novel. When she’s not leading writing workshops, reading, or spending time with her friends and family, you can find her working on her next story. For more information visit www.jessicalourey.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 6 hrs 52 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Monday, February 19. Order within 9 hrs 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Killers hiding in plain sight. Small-town secrets. A girl who knows too much. From the Amazon Charts bestselling author of Unspeakable Things and Bloodline comes a nerve-twisting novel inspired by a shocking true crime.Minnesota, 1977. For the teens of one close-knit community, summer means late-night swimming parties at the quarry, the county fair, and venturing into the tunnels beneath the city. But for two best friends, it’s not all fun and games.Heather and Brenda have a secret. Something they saw in the dark. Something they can’t forget. They’ve decided to never tell a soul. But their vow is tested when their friend disappears―the second girl to vanish in a week. And yet the authorities are reluctant to investigate. Heather is terrified that the missing girls are connected to what she and Brenda stumbled upon that night. Desperately searching for answers on her own, she learns that no one in her community is who they seem to be. Not the police, not the boys she met at the quarry, not even her parents. But she can’t stop digging because she knows those girls are in danger.She also knows she’s next.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Thomas & Mercer (November 1, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 335 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1542034299"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1542034296"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,100 in Books (See Top 100 in Books) #117 in Kidnapping Thrillers #176 in Women's Domestic Life Fiction #499 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 51,579 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/ef9d2abb-2b01-4f17-ac1b-9b5e5fb8fce6.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jessica DiMonte",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJJBG4ARTBQHC5MMMPOQMDIP5YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EJH2I3R8CLPK?ASIN=1542034299",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Jess has done it again!!",
                "reviewText": "My best friend had recommended a book that I recently read, and I forgot how similar Jess Loury’s stories were to that one. I decided this would be the next book out of the 150 something I have yet to read and I’m glad I did!!Talk about feeling panic for the girls of Pantown or the overwhelming feeling of finding out some of the character’s dirty secrets. I do have to say, I definitely could relate to certain parts of the story as I became a girl into a woman and the awkwardness that came with it, the unsureness of it all. I would have to say, this has been probably the best book I have read by her so far. I have read a couple of others, but like I said, I could relate to some things that happened in this story as I was growing up.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie Dunn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYHNKRVA5NZTSAZKVE2EC2FT4NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RZHNYLDRIY1D?ASIN=1542034299",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Creepy, Cringy, and Satisfying",
                "reviewText": "I struggled with this book around the middle of it. Trying to convince myself I was bored but really... It was like I didn't want to see what was in front of me. So pushing through I just left the story unfold and really relished in the ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "diana jaycox (my friends call me DJ)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTD6EBTYNRGCUPIYJRTNB664LFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RG5J39U22PZ4Z?ASIN=1542034299",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2022",
                "reviewTitle": "5.0 out of 5 stars An exhilarating, bone- chilling thriller, fiction inspired by truth- a work of art!",
                "reviewText": "The Quarry Girls: A Thriller is a first read by Jess Lourey that I selected as part of a challenge! While I consider myself an eclectic reader, I sadly admit that a book based on a true crime, full of murder and mayhem would not be my usual choice of reading material. If I wanted to be full of anxiety, fear and anger, I could read US NEWS and World Reports. If not for the Kindle challenge to read a book based on true crime I would have missed experiencing the brilliant talent of Jess Lourey. I was totally unprepared for the tsunami of emotions I would feel reading Quarry Girls.In her author notes (pg. 310), Jess Lourey thanks five authors whose words inspire her writing. Jess writes, \" [they] can put together a sentence so unexpected and delicious that I go back to taste it again and again.\" Jess Lourey's writing inspired the same feelings in me. I usually read to escape but with Jess Lourey's Quarry Girls I found myself savoring her words. It was an experience similar to lingering over a magnificent five course meal, allowing the different flavors of the food, the wine and the companionship, to roll over your tongue and incite your mind. A book that excites and involves all 5 of my senses is a new experience for me.As much as I was exhilarated by the suspense of the story, I was facinated by Ms. Lourey's word craft. Quarry Girls is the most highlighted work of fiction I have on my shelves. Jess Lourey through mere words invoked a feeling of childhood nostalgia, taking me back to a time in the 70s I remember to be idellyic and simpler than today. And while I reveled in memories of swimming in the canals around my small Central California town, Jess Lourey's creative words reminded me that I never knew what secrets, plots and political manipulations were occurring at my parents cocktail parties. I thought she might have read my diary but again the opening pages of the book clued me into the fact that miles from California, Jess Lourey shared a similar childhood. The way I instantly related to her characters added to the thrill and chills felt as the story unfolds! Of the 70s for example, Jess character Heather says, \" That summer, the summer of 77,everything had edges. The sharpness took my fiends, but it cut away the blinders, too. And once you understand the truth, there's no living any other way.\" Talk about \"killing me softly with words\"! Jess Lourey took my memories, my adventures, my bad choices and wove them into poetic work of art. If only I had the talent to paint a picture with words the way, Jess does in this novel.I was mesmerized by this book. I read page after page of this novel, ignoring my messy house and myhis dogs whines for attention, and finished this book in a day. I was so enthralled, determine to figure out whodunit and how things would turn out, I didn't realize that night had fallen! And then I was so upset that I had finished already, I almost started over again; this time determined to take my time and savor every word. Instead I purchased the audio version so I could sit back close my eyes and have the words wash over me as I rock in my favorite chair in front of the fireplace this winter.Thanks so much to the Kindle Challenge for forcing me to choose a book out of my usual readings which led me to Jess Lourey. She will now occupy a place on my \"fave author's shelf.",
                "reviewVotes": "84 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pearl ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX5LPR4VOAAWXYK2YIEC7VJMZEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OGH89SGVEHXN?ASIN=1542034299",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "3.0 out of 5 stars Characters were not fully developed.",
                "reviewText": "Warning : spoiler alert .This really drew me in , it was so suspenseful . I know kids are kids but for the eldest, who seemed so responsible, she didn't think much about running here and yonder and letting the little sis run about also whilst a kidnapper/killer is on the loose, come on now. As this book went on I began to totally figure out who the bad guys were. The ending left me very dissatisfied the father and the town leaders were not really addressed as to their character and not much said about their discipline if much at all imo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karissa Eckert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTP676UYEDVCDRACYZMRK7HO5MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1249DJQBFE8E?ASIN=1542034299",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2022",
                "reviewTitle": "4.0 out of 5 stars Intriguing MN setting, well done mystery.",
                "reviewText": "Series Info/Source: This is a stand alone book. I got a copy of this on ebook through Amazon First Reads.Thoughts: This was an interesting read. I am not generally a huge fan of serial killer/thriller types of books. I was intrigued by the Minnesota setting here and I really did end up enjoying that Minnesota setting. There is a lot of background here on the late 1970's in the St. Cloud area, particularly Pantown. I had no idea that so many awful things were happening in that time frame in St. Cloud. I also didn't know the urban myths around the Pantown tunnels.The story follows Heather as she and her two girlfriends get an amazing opportunity for their all girl band to perform at the county fair. This is overshadowed some by the fact that a girl named Beth has recently gone missing. Their first performance at the fair goes awesome and they are pumped for their next until one of their band members, Maureen, goes missing. Heather is smart and she is sure that Beth isn't a runaway and neither is Maureen, so Heather starts digging. What she finds reveals a nasty underside to their idealistic small town.This was a well done story. I enjoyed Heather as a character, although her home life was seriously messed up and got more so as the story continued. It was an interesting look back in time and really drove home how in a lot of ways a \"woman's\" place in society has improved. However, it also drove home how far we still have to go. It was scary how easily society accepted the disappearance of these girls and how readily trusted figures in society accepted and even participated in what was happening.This was easy to read and hard to put down. It is definitely a page-turner and the story kept me guessing. The conclusion wasn't as surprising as I had hoped, but I did enjoy how the story wrapped up. It ends on a hopeful note and I really admired how Heather and Beth handled everything.My Summary (4/5): Overall I enjoyed learning about the history of the St. Cloud area and enjoyed the mystery behind this story. This was well written, easy to read, and not too scary. Will I pick up more Lourey books in the future? Well, as I said, I am not a huge fan of this genre but if another Lourey book comes up in a Minnesota setting and it sounds intriguing I would definitely consider it. This was an interesting read and very well written.",
                "reviewVotes": "51 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emely Shepard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3F4RACMLPFV223ROOLZQCBG5EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UOVN0HTG35HS?ASIN=1542034299",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Truth may hurt but it wins in the end",
                "reviewText": "A great book showing a teenage girl who learns the truth about her town & is afraid to share it. In the end, that truth turns her into a strong, decent young woman out to get justice for friends & to save herself & her sister%",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JamieP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 28, 2023",
                "reviewTitle": "Loved it",
                "reviewText": "The development of the players in this tale was fantastic. I can usually guess who done it halfway through the story…not this one! I couldn’t put it down until I finished it!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Vaughan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 28, 2024",
                "reviewTitle": "A thought provoking read",
                "reviewText": "The book is so well written that I felt like I was in the town with the teens whilst reading the book. The book is emotionally challenging to read but I am glad that most of the issues were explained, if not resolved.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ari • a.final.girl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 11, 2023",
                "reviewTitle": "“i used to think she was shining his soul”",
                "reviewText": "“Men in packs can do terrible things, things they wouldn’t have the hate to do alone. It’s no excuse, just something you should know.”set in the summer of 1977, heather and her friends have all their hopes & dreams & their garage band ahead of them. of course they do, and of course this is the 70s so there’s a serial killer.quarry girls was not what i was expecting, in an amazing way. it’s a coming of age story set from the POV of heather and how hard she’s trying to keep her family together, and beth, who’s been abducted. it touches on so much: a lot of toxic & fragile masculinity, mental health, sexualisation of kids and adult men doing gross stuff to them.this was my audiobook for the last few months, and despite the “voices” of all the characters throwing me off, the story had me pulled in. the entire setting of Pantown (st. cloud, minnesota) and the tunnels underneath the neighbourhood was like having a movie unfold in my head.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lesley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 10, 2024",
                "reviewTitle": "Nice light read",
                "reviewText": "I enjoyed reading this book. I read it on my vacation. It’s easy to read and it is a good story that is well told.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tambok",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 1, 2022",
                "reviewTitle": "Should Be Sold As A Young Adult Book",
                "reviewText": "I was rather torn when it came to reviewing The Quarry Girls by Jess Lourey. It was quite a good story but the way it's written and some aspects of the story,the very unique layout of the streets and houses in the fictional Minnesota with it's house linked by underground passages that the residents scurry around in and much else smacks of Young Adult fiction. In a whole book with a cast of teenagers one character says \"effing\" ,and I mean literally \"effing\" and not the actual \"F word\". While I'm not a fan of excessive bad language in books we're talking about drug taking teens here who are involved in all kinds of nastiness.Admittedly the story is related by a young teenager but I was reading it thinking,despite it's often difficult and disturbing scenes that I was reading something written for people of the same age group as most of the characters. No problem there if the publishers had marketed it as Young Adult fiction as it addresses a number of important issues and situations that young girls unfortunately have to deal with very well.The story is based on real events from Jess Loury's home town as she says in her introduction. A group of teenagers are negotiating the tricky transformation between child and adult with misfit Heather feeling left out as her ,relatively,more mature best friends Maureen and Brenda tackle the minefield of being girls in a woman's body and dipping a toe into the adult drugs,alcohol and male attention.With reports of a girl having being abducted Heather and Benda stumble across something awful ,closely followed by another one disappearing. Thinking there's a link Heather investigates and discovers a different side to the town and people she's known all of her life.I'd strongly suggest that the publishers market this as a YA book. There are many difficult issues addressed in the story addressed in a way that is not explicit , exploitative or patronising. It shows the pressures on young people,girls in particular ,not least from predatory adults.While I appreciate that the narrator is a teenager I wasn't massively convinced by much of it as an adult reader,and I've read plenty of very good books written with \"a young voice\"I'd actually consider this a great book for the 16+ age group, plenty of \"bad stuff\" happens but young people of that age group will be aware of most of the subject matter from tv and movies and it's written in a way that won't give them nightmares. As a YA book I'd actually give it 5 stars.As an adult reader that would be 3 stars,it very nearly lost me right at the beginning with the description of the town and its origins.Split down the middle that's 4 stars",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.73",
                "sellerName": "ZBK Books",
                "sellerRating": "4.5"
            },
            {
                "price": "$9.19",
                "sellerName": "WE GARLAND",
                "sellerRating": "4"
            }
        ]
    }
}