{
    "remaining_requests": 84,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Verity-Colleen-Hoover/dp/1538724731",
    "body": {
        "name": "Verity",
        "price": "$10.98 $7.78",
        "originalPrice": "$16.99",
        "rawPrice": 10.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Verity-Colleen-Hoover/dp/1538724731",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/917iVfhEhxL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Colleen Hoover",
            "link": "https://www.amazon.com/Colleen-Hoover/e/B006SKAK42/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Shakespeare Book House and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 330599,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 4 mins",
            "FREE delivery February 26 - 28 on orders shipped by Amazon over $35",
            "Or fastest delivery February 23 - 25"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Grand Central Publishing; Reprint edition (October 26, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1538724731"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1538724736"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.45 x 0.75 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#58 in Books (See Top 100 in Books) #39 in Psychological Thrillers (Books) #45 in Suspense Thrillers #89 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 330,599 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Too Late Verity Hardcover Verity Kindle Don't miss these other Colleen Hoover titles Colleen Hoover's darkest thriller since Verity Features an exclusive additional chapter Read Verity anywhere on your Kindle",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fd5c4ca2-e5f1-42c6-8077-479abfef136a.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f4a0e2f-080f-43fe-9b96-e5e8ed75ab57.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/04822cd1-6dc5-4d87-8f46-87e6fc1c812a.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a8a9ec12-5749-4756-8f78-25eedb45d67a.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4e76992f-1789-4483-8da0-5ce1f0062999.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9bdc7c7f-9940-42c8-9250-849d1ac29135.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4e124001-e45f-4dbb-85fe-47592f126020.__CR36,0,288,575_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90152a28-833d-4cd9-83bd-4f6c8d9e5f9a.__CR26,0,346,692_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d6cf9f1-06f5-428f-879c-e9014b6c900a.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BethW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXI3Z2W2HWHELDYQGJGYP2BLGCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWS60KB9H71BR?ASIN=1538724731",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars This is one of the best books I’ve read lately!",
                "reviewText": "This book grabs you from the start. It’s twisty! We read it for our office book club. Most of us ordered the soft cover. One friend always orders the hard cover. I would urge you to buy the hard cover! I don’t recall reading this in any other review… The hardcover book has additional text. Kind of like an epilogue I guess. It will blow your mind! My coworker finished the book, and then casually mentioned in the meeting that his book ended differently than the rest of ours and of course we made him let us borrow that book and read the end, it was fantastic. The book is very well written. This is a standalone book. The author also writes series, but this is not one. So you don’t have to worry if you get this book that you’re missing three or four other books that are either before or after it. I should mention all of us in the book club have masters degree in counseling. in our jobs, we see very unusual things. This book caught all of us off guard. ! My advice: BUY THE HARD COVER and enjoy!",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina Teter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJMJQPM2VF7C3ECDMQKNPYB3JFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3J23TEM1WFADK?ASIN=1538724731",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars A Great Read!",
                "reviewText": "I just started getting into books in 2024, I started with the “It Ends with Us” series. Some friends recommended “Verity” to me, so I decided to order it. Once I started reading it, I couldn’t put it down. It took maybe all of 3 days to read this book. I would definitely recommend this book, especially if you are just starting to get into books. I feel like this a good psychological thriller starter book.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JHSiess",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4QWSK6PEY7RKELK2WPE7EKPVSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4TNUVTKVZ0S4?ASIN=1538724731",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2022",
                "reviewTitle": "4.0 out of 5 stars Dark, Twisted, & Shocking -- Lives up to the Hype!",
                "reviewText": "Verity opens with author Lowen Ashleigh having a very bad morning. Her mother died the previous week after a year-long battle with colon cancer. Lowen had a difficult relationship with her mother -- \"a direct result of my own mother being terrified of me,\" she relates -- but still brought her to Lowen's apartment and cared for her during the last nine months of her life. Lowen is a sleepwalker and her mother kept her fairly secluded as a child, afraid of what Lowen might be capable of doing during one of many sleepwalking episodes. Now she has left her apartment in New York City for the first time in weeks, summoned to a meeting at her publisher's office by her literary agent, Corey, with whom she was previously in an intimate relationship. Just as Lowen is waiting for a crosswalk light to change, a man steps into the street and is struck by a truck. Lowen is understandably shaken, and the man's blood is splattered on her face and white shirt.A handsome stranger escorts her into a coffee shop bathroom and literally gives her the shirt off his back. They chat briefly, and Loewn concludes that he \"wants to be invisible in this city. Just like me.\" After all, she moved to New York to become part of the city's invisible millions of invisible residents. Her books have not sold well enough for her publisher to offer her another contract unless she agrees to promote them, something she has refused to do in the past. \"I'm so awkward I'm afraid once my readers meet me in person, they'll swear off my books forever,\" Lowen laments. \"That's why I stay home and write. I think the idea of me is better than the reality of me.\" But another contract was her last hope. She took time off from her writing career believing that her mother would leave her some money. Now, having lived off the advance she received after signing her prior contract, she has learned that she will receive nothing from her mother's estate. And be homeless soon, unless she receives a job offer.When Lowen arrives at her publisher's office, she is shocked to find the man whose shirt she is wearing is attending the same meeting. He is Jeremy Crawford, husband of Verity, a very successful author who is unable to complete the series of books she was writing. Lowen is being offered a flat fee of seventy-five thousand dollars per book to write the last three volumes in the series, with the first installment due in six months. Lowen is determined to turn down the offer until Jeremy informs her that he selected her because Verity read one of Lowen's books and it was among her favorites. She purportedly told Jeremy that they shared a similar writing style and Lowen was destined to be \"the next big thing.\" Verity has been catastrophically injured in a motor vehicle accident, following the deaths of both of her daughters, Chastin and Harper, leaving Jeremy to raise their young son, Crew, alone. Lowen ultimately agrees to take on the project.Lowen makes the six-hour drive to the Crawford home in Vermont, listening to the audio version of the first book in the series en route. She is to spend time in Verity's office, reviewing the research and notes she left there in order to assess how best to approach writing the next book. Lowen meets Crew and learns that Verity's condition is extremely serious. She is in a virtually catatonic state -- uncommunicative and unable to care for herself. Caregivers spend the day in the home, with Jeremy managing at night. Lowen soon discovers that Verity's office lacks organization -- her expansive desk is strewn with stacks from end to end with papers and files, and boxes containing more documents line the walls. Clearly, the process of sorting through it all will take much longer than Lowen originally anticipated. As she begins reading Verity's second book, she realizes the \"books are from the villain's point of view\" and she will need \"time to work myself into that mindset while writing.\" Jeremy claims that he has never read Verity's books because he \"didn't like being inside her head.\"Author Colleen Hoover recounts Lowen's story via a first-person narrative, with the story really taking off as Lowen attempts to settles into the Crawford home. She is keenly observant and inquisitive about Verity's writing, as well as her family, and quickly finds herself attracted to Jeremy, who is still married to the incapacitated woman being cared for in an upstairs bedroom. Searching through Verity's office, Lowen stumbles upon a manuscript entitled \"So Be It.\" Verity hopes it is an outline for the next book, but it is instead an autobiography drafted by Verity. Reading it is not what she has been hired to do, but she justifies her insatiable curiosity by construing her review of the manuscript as research. \"I need to see how Verity's mind works to understand her as a writer.\" Soon she is absorbed in Verity's descriptions of meeting Jeremy, the development of their relationship and the early days of their marriage, as well as her pregnancies and motherhood. The more she reads, the more frightened of Verity Lowen becomes, especially when events she observes appear to be inconsistent with what she has been told about Verity's condition. Nonetheless, Lowen continues returning to the manuscript to better understand the Crawford family's history, and gain insight into Jeremy and Verity's marriage. But Lowen is playing a dangerous game. Verity's purported autobiography is a dark and disturbing confession of Verity's feelings, motivations, and unspeakably vile acts. Lowen believes the manuscript to be an accurate depiction of Verity's life, and concludes that it \"was written by a very disturbed woman -- a woman whose house I currently inhabit.\"Hoover ramps up the tension as Lowen becomes entangled in a budding relationship with Jeremy, influenced heavily by what she is reading in the manuscript. Verity's revelations are horrifying, and as Lowen and Jeremy grow closer, he increasingly opens up to her, sharing details of his life with Verity about which Lowen feigns ignorance. Lowen's suspicions about the accident in which Verity was injured grow. Is Jeremy being completely honest with Lowen? Why is he willing to embark on a new relationship with Lowen when his wife, although injured, is still alive? He claims that he cannot move Verity to a care facility because Crew cannot sustain another loss. While Verity is cared for in their home, Crew can spend unlimited amounts of time at her bedside. Lowen now possesses detailed information about the deaths of Jeremy's daughters. Were their deaths really tragic accidents? Is Crew safe?Hoover's characters are both fascinating and infuriating. The story is related solely from Lowen's perspective. Her childhood was difficult because of her sleepwalking and the way it detrimentally impacted her relationship with her mother. She has achieved modest success as a writer, but because of her discomfort in social situations, her career growth has been stymied. She accepts the offer to write Verity's next three books because she desperately needs the money, but also because it is an opportunity too good to pass up. But she is confused not only by her burgeoning attraction to Jeremy, but the incongruity between what she has been told about Verity's accident and what transpires in the house. Of course, Lowen's feelings and experiences are colored by the information set forth in the manuscript. Interestingly, Hoover has said that even when she depicts Lowen reading Verity's manuscript, readers are \"still not fully in Verity’s head because we’re always in Lowen’s perspective, reading something she found. When I write a book from one character’s point of view, I rarely think about the story from the other character’s perspectives. Sometimes it’s necessary for certain scenes, but with this book, it was important for me to feel the confusion and fear Lowen felt. So as the author, I had to be completely blind to what was happening from everyone else's perspectives.\" Still, as the story progresses, Hoover keeps readers guessing as to how gullible and vulnerable Lowen really is. She believes the manuscript is truthful and accurate, and that Jeremy is not the villain -- if, in fact there is a villain in the Crawfords' story. But could Lowen possibly be opportunistic, calculating, and willing to do anything to be with Jeremy?Jeremy is equally captivating. He is handsome, charming, successful, and by all outward appearances, a family man who has sustained unimaginable losses who has been able to soldier on only because he has a young son to raise. To be fair, although Verity's prognosis is never affirmatively established, his desire to move on with his life is understandable -- Verity sustained a serious head injury which will, in all likelihood, preclude her from resuming a fully normal life. But was his meeting with Lowen on the street just before the meeting at her publisher's office really just coincidental? Did he intend for her to find the manuscript in Verity's office? Has he been fully aware of its contents all along? About that, Hoover says, \"I’m not sure because I was never in Jeremy’s head.\" In other words, readers can draw their own conclusions, based on the evidence Hoover does present.And what about Verity? Is she selfishly conniving and evil, as the manuscript suggests? Or is she a blameless grieving mother who was tragically injured in a horrific car accident?The manuscript provides myriad complications. Lowen debates whether she should discuss it with Jeremy. She doesn't believe he is aware of its existence or content. He claimed he never read Verity's books, after all. Lowen learns that Verity was injured when her vehicle hit a tree, but there were no skidmarks on the pavement. She concludes Verity \"either fell asleep or she did it on purpose.\" Does it matter to Lowen which scenario is accurate? What conclusion has Jeremy drawn about the cause of the accident?Putting aside the perspective from which the story is told, no aspect of the story or the characters can be accepted at face value. Hoover includes plot twists so shocking and unnerving that Verity, originally published in 2018, continues to be one of the most-discussed psychological thrillers ever written. (There is even a Facebook discussion group devoted to the book, boasting nearly twenty-five thousand members!) The book is fast-paced, engrossing, and extremely entertaining. The story's pace gradually accelerates with each surprising development and breath-taking revelations of the truth or, perhaps, a manipulated version of the truth. The tale careens to a jaw-dropping conclusion that will keep readers thinking, discussing, and debating Hoover's extremely clever and nuanced tale, as well as her deliciously intriguing and morally ambiguous characters (who may prove themselves to be not as ambiguous as originally thought) for a very, very long time. Hoover says she \"chose the ending because it’s frightening to me. It’s my biggest nightmare For the darkness in the worlds I create as a writer to somehow\" intrude into her real life.Thanks to Grand Central Publishing for a copy of the book.",
                "reviewVotes": "469 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lola Rojas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3FW5KZ7XDFXTYUQFJSBWPEMXVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3611KV1U15X7P?ASIN=1538724731",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Cant put it down!",
                "reviewText": "I was recommended this book by a friend. I wanted to get into the whole reading thing, but I usually get bored and distracted easily. So I asked her to recommend the best she could think of to avoid me veering off the path. And so far I am in love with it. I haven’t finished the book yet. But so far its gooooood",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariah Elizondo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECJK6ILROPV2FGK2FUICFQ7FZYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OQYFMN2JFN83?ASIN=1538724731",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars WAS SOOO INTRIGUING",
                "reviewText": "I haven’t read a book in so long. I actually have but it’s with books i wasn’t able to finish BUT this book ? this book was SO good. i finished reading this in about 2 days, i could not stop reading. Absolutely loved, it does have some suspense and i am definitely a baby when it comes to scary things however this didn’t included a lot of suspense, just enough to keep you on your toes! highly recommend",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nyasha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMJPX4PMFQZMM5QX4RD2RQ72AIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R54ES49LYG9V5?ASIN=1538724731",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Twists and turns",
                "reviewText": "Are we actually kidding!!! I had so many theories and honestly none of them could have prepared me for that! I did have an idea, but still this was creepy, crazy and had my anxiety levels through roof, it was so well written and the author really portrayed how she expected you to feel towards the characters.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheryl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRE346JFP33J6Z5DTVNNVSGYETA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S7DME5UEDX7D?ASIN=1538724731",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars What an ending!",
                "reviewText": "Several times while reading the book I thought I couldn’t read any farther. But I did! It kept pulling me back in and I had to continue. I’m glad I did but..now I don’t know what to believe. Great read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert LaFave Jr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGR52WWBGTCHSKPHJLEMG4K3CTRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YA9HXLS1F4R4?ASIN=1538724731",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Good book",
                "reviewText": "Was a good read with some intriguing twists and turns now having said that i will proffer this bit of warning/opinion i highly recommend skipping the \"bouns\" chapter. I was recommended this book by a few friends of mine who had read it so it was making the rounds so rather than wait till their copy made it to me i bought my own and saw this copy with the bouns in it, as i read the main story i was deeply invested up to end then moved on to the extra chapter and it was a major disappointment its a \"what happened after the end?\" Type deal and it completely changes your feelings for the characters it feels vary clunks and out of place and has a feel that it may have been part of the first draft but was removed during editing for being unnecessary. And i will also state this is not just one mans opinion i passed on my copy to my fellow readers who didn't get the extra and the feeling was the same that it definitely took away from the story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 13, 2024",
                "reviewTitle": "Fantastic!!",
                "reviewText": "I absolutely loved this book!! Could never have guessed how it would end but it has kept me thinking long after I finished the book!! Its a must read!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 6, 2024",
                "reviewTitle": "insano",
                "reviewText": "Não sei explicar o que estou sentindo. Them um plot muito bom. Leitura bem fluida, acabei em um dia e meio. Super recomendo!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dani",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 26, 2023",
                "reviewTitle": "Muy bien libro",
                "reviewText": "Buena calidad (aspecto físico), muy buena novela, fácil de leer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 31, 2024",
                "reviewTitle": "A real rollercoaster of a read!",
                "reviewText": "Plot with a mega twist, with fascinating characters and loads of atmosphere.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mriganka Shekhar DeMriganka Shekhar De",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 18, 2024",
                "reviewTitle": "This will keep you up all night",
                "reviewText": "I want to start this review saying I’ve had multiple people recommend Verity to me the last few weeks. As an avid reader, I couldn’t help but notice Colleen Hoover, or as avid fans call her “CoHo” has 4 books on the most read books on Goodreads – so why not right? I assumed most of her books are loved by hopeless romantics, not usually my cup of tea – but I felt as though this book had a perfect balance of romantic scenes, erotic scenes, and just plain, great thriller/suspenseful moments. I was hooked from the first page, and finished Verity in less than 24 hours (not sure if that is because the text is big or because the novel was that good – or a mix of both). The cherry on top really came at the end. I finished this novel less than 5 minutes ago, and I’m still trying to wrap my head around the ending, my brain is running a million miles a minute, just what I want from a novel. What really went on in that house in Vermont? It is extremely hard for me to write this review without giving anything away, but if you are in the market for a book that will make your jaw drop, I HIGHLY suggest Collen Hoover’s, or as I can now confidently say “CoHo’s” Verity.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zDPk8Jd+L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.43",
                "sellerName": "Revolver Market",
                "sellerRating": "4.5"
            },
            {
                "price": "$6.44",
                "sellerName": "Shakespeare Book House",
                "sellerRating": "5"
            },
            {
                "price": "$10.65",
                "sellerName": "bookmasters444",
                "sellerRating": "5"
            }
        ]
    }
}