{
    "remaining_requests": 89,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-None-This-True-Novel/dp/B0BHFBQ76G",
    "body": {
        "name": "None of This Is True: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-None-This-True-Novel/dp/B0BHFBQ76G",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51P7Jc0YEJL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lisa Jewell",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Lisa+Jewell&search-alias=audible"
        },
        "brand": "Lisa Jewell&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 28661,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "INSTANT NEW YORK TIMES BESTSELLER From the #1 New York Times bestselling author known for her “superb pacing, twisted characters, and captivating prose” (BuzzFeed), Lisa Jewell returns with a scintillating new psychological thriller about a woman who finds herself the subject of her own popular true crime podcast.Celebrating her forty-fifth birthday at her local pub, popular podcaster Alix Summer crosses paths with an unassuming woman called Josie Fair. Josie, it turns out, is also celebrating her forty-fifth birthday. They are, in fact, birthday twins. A few days later, Alix and Josie bump into each other again, this time outside Alix’s children’s school. Josie has been listening to Alix’s podcasts and thinks she might be an interesting subject for her series. She is, she tells Alix, on the cusp of great changes in her life. Josie’s life appears to be strange and complicated, and although Alix finds her unsettling, she can’t quite resist the temptation to keep making the podcast. Slowly she starts to realize that Josie has been hiding some very dark secrets, and before she knows it, Josie has inveigled her way into Alix’s life—and into her home. But, as quickly as she arrived, Josie disappears. Only then does Alix discover that Josie has left a terrible and terrifying legacy in her wake, and that Alix has become the subject of her own true crime podcast, with her life and her family’s lives under mortal threat. Who is Josie Fair? And what has she done? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10457"
            },
            {
                "name": "Women Sleuths",
                "link": "https://www.amazon.com/Women-Sleuths-Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10480"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 20 minutes"
            },
            {
                "name": "Author",
                "value": "Lisa Jewell"
            },
            {
                "name": "Narrator",
                "value": "Lisa Jewell, Kristin Atherton, Ayesha Antoine, Louise Brealey, Alix Dunmore, Elliot Fitzpatrick, Thomas Judd, Dominic Thorburn, Nicola Walker, Jenny Walser"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "August 08, 2023"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BHFBQ76G"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#20 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Women Sleuth Mysteries #1 in Women Sleuths (Books) #2 in Suspense (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Darlene Boudwin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ4PGNPUGATUMJF3YG2GUNPG66A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DFQN8OWZOLFT?ASIN=B0BHFBQ76G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Best Thriller I've Read in Years",
                "reviewText": "Wow! This is what a thriller is meant to be. Lisa Jewell has created a deliciously disturbing and intriguing story that will keep the reader enthralled to the end. I know I was!Alix Summers and Josie Fair meet on the night of their shared 45th birthday. Josie proclaims them “birthday twins” and approaches Alix, a well-known podcaster, with the idea of making a podcast about Josie’s life and her plans to change her future. Alix is intrigued by Josie’s unconventional relationship with her much older husband. They agree to do the podcast, and Josie spills all the astonishing and disturbing details of her life. But Alix does not realize that Josie is becoming obsessed with her, and she does not notice the impact that Josie is having on her life and family until it may be too late.Everything about this story works. The characters are interesting and well-developed. No one is truly likable, but some are more dysfunctional than others. Josie Fair appears to be meek and simple, but there are disturbing depths to her character that make for an unpredictable, thrilling narrative. Alix is so enthralled by Josie's story and how she can benefit from it that she does not notice as Josie insinuates herself into Alix's life. The action is paced perfectly. The narrative alternates between Josie and Alix's interactions in real time and excerpts from the podcast and the documentary. The documentary sections add just the right amount of suspense by hinting at events that the reader has not yet witnessed. Though the plot is somewhat predictable, the execution is so good that it does not detract from the success of the book.Honestly, I just love a dark, twisted, messed up thriller, and that is what you get with this book. I highly recommend it to readers who enjoy this as well.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robin Fields",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXTWIOHQHP3T5ZKBQB3ABVFDSGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EDB3EH1J1AAT?ASIN=B0BHFBQ76G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "4.0 out of 5 stars A Must Read",
                "reviewText": "Oh my god. This was my first Mystery/ Thriller book I have ever read and it did not disappoint.While it was written in the third person Lisa Jewell gives the reader an amazing insight into the thoughts and motives behind the characters. When you first meet both Alix and Josie you know there is more to them that meets the eye. While yes, Alix's life isn't picture perfect and she has a husband that will go out on benders she is not the perfect instagram podcaster that the internet see's. Josie on the other hand has a dark past and mental health problems that makes everyone wonder is what she is saying true at the end. Josie seems to be living in a web of lies that she brings Alix into as they begin their podcast leading to many dark twists and turns. The addition of the Netflix Series snippets woven throughout the story help to build anticipation as you are also finding out what is going on with Alix and Josie. It leads me to think that maybe this would turn into an amazing Movie/ TV series. The ending is a bit unsatisfying as it does leave the door open to potentially continue Josie's story. At the end of the book Lisa Jewell has the readers questioning who was actually telling the truth and as the title suggests None of this is True.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lindsey Cattau",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBEKB7JWTOWKFITX5JHXZW6KTGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X4JUSCQTNA3C?ASIN=B0BHFBQ76G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars could not put down",
                "reviewText": "This book was so addictive. I luckily had it on loan from the library as an audiobook and kindle, so I was able to switch back and forth and finish it in 2-3 days. It was so messed up with a crazy plot. Definitely worth reading! Her books have such crazy characters and plots: I can’t even imagine how she comes up with them. Great ending too. Audiobook was great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Courtney Wright",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERHKCGD6H2BH2O6SC7MV6XXGTKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3399TGG5DG5W0?ASIN=B0BHFBQ76G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars Captivating! Until the end",
                "reviewText": "I couldn't put this book down, I was so excited to find out what was really going on! Loved the characters and the writing immensely! Unfortunately, the ending fell a little flat for me. Alix's processing of what happened to her was surface level, and the last minute \"roxy is actually a murderer!\" Was like, huh? Ok... So are we now not excited for Erin to be moving in with her? Do we need to get a pov chapter from Roxy, our new additional villain? Just was random and weird. She says in the writers note at the end that she wrote this one quickly, and I think the end is where you can really tell that.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jade",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVU22TKSEET4YU2WYCW2YFT62NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZW1XG23FO0XU?ASIN=B0BHFBQ76G",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "3.0 out of 5 stars Misprint!",
                "reviewText": "Shipping took a while compared to other books I have ordered on Amazon. Finally got to reading it, the first half is a bit slow but as it’s starting to get good I realize I have received a misprint! Goes from page 280 to 345! And then from there the pages are all over the place! So it’s missing 100+ pages and then jumps around! Annoying! Hopefully I get a readable replacement!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick Capone",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5FGYKLRKWTMCEX2LBUYXQZXJJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12RV1NGXL2FE2?ASIN=B0BHFBQ76G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Captivating and Engaging: None of This Is True Leaves a Lasting Impression",
                "reviewText": "\"None of This Is True\" is an enthralling novel that completely captivated me from start to finish. The narrative unfolds in a way that keeps you on the edge of your seat, blending intrigue, mystery, and emotional depth flawlessly. The characters are vividly portrayed, each with their own complexities and layers that add depth to the story.The author's storytelling prowess shines through, creating a narrative that feels both relatable and fantastical. It's a journey that delves into the human psyche, exploring themes of truth, perception, and the intricate nature of relationships.The book's ability to immerse the reader in its world is exceptional. It's the kind of story that stays with you long after you've turned the last page. I found myself pondering the intricacies of the plot and the characters, making it a truly memorable read.For anyone seeking a thought-provoking and immersive narrative, \"None of This Is True\" is an absolute must-read. It's a rollercoaster of emotions and revelations that I wholeheartedly enjoyed and would recommend to fellow book enthusiasts.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBQ5LYLRUXYTUWR2XQNUY7KGUXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TQ975NVA5V06?ASIN=B0BHFBQ76G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "4.0 out of 5 stars What a whirlwind that was",
                "reviewText": "I’m not entirely sure how I feel about this novel just yet. My brain is still recovering from the whiplash it experienced.I will say to was a quick read that kept me mainly interested in the outcome. I entered the book not knowing the premise which caused me to think a bit more as I moved between podcast recordings, a Netflix original series, and real life situations.The book follows a handful of unreliable characters through a true crime series that ends with multiple casualties and the true murder (s) on the loose.Unnerving and wildly realistic in so many ways. I can actually see this story being true.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Morgan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 10, 2024",
                "reviewTitle": "So many feelings… so little time (in the best way)",
                "reviewText": "The emotional roller coaster this sends you on… my goodness, I couldn’t put the book down. So so so well written, words can’t describe the feeling when the book ends. Wish I could read it again for the first time!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caro Medina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 1, 2023",
                "reviewTitle": "Llego perfecto",
                "reviewText": "Es un regalo, no se si ya lo leyo pero llego perfecto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 15, 2023",
                "reviewTitle": "Great book to end the year",
                "reviewText": "It was a fun ride to see how the drama unfolds; highly recommend for when you need to turn your brain off and engage in a simple plot with minimal twists.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 19, 2024",
                "reviewTitle": "Couldn't set this down.",
                "reviewText": "It took a chapter or two to get into it, but once I did, I couldn't set it down. This made for some late nights and painful mornings until I was done. Twists, turns, and some jaw drops. Fantastic story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie R",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 15, 2023",
                "reviewTitle": "Could not put down",
                "reviewText": "I am not a reader. I don’t get drawn into stories very often… but this one captivated me. It creeped me. But I had to keep reading. I needed to see what happened.It’s a touch girly. But that’s fine. There’s an excitement about female friendship and then it slowly but surely goes sour. I feel the ending left you still questioning much of the truth. But that’s maybe what is best for the reader.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}