{
    "remaining_requests": 34,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Crime-Novels-American-Talented-Pick-up/dp/1883011493",
    "body": {
        "name": "Crime Novels: American Noir of the 1950s: The Killer Inside Me / The Talented Mr. Ripley / Pick-up / Down There / The Real Cool Killers (Library of America)",
        "price": "$35.00 $18.33",
        "originalPrice": "",
        "rawPrice": 35.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Crime-Novels-American-Talented-Pick-up/dp/1883011493",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "Only 11 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71JpjB8b0fL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jim Thompson",
            "link": "https://www.amazon.com/Jim-Thompson/e/B000AP80ES/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by -OnTimeBooks- and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 74,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Amazon.com Review The best American crime novels deserve their place in the pantheon of American literature, but they hold special interest for cinema enthusiasts, who can both compare them to the movies they became and can roll imaginary films of the stories in their minds. Crime Novels: American Noir of the 1950s is the second of Library of America's two-volume anthology of underground U.S. fiction. The first anthology featured works from the 1930s and '40s that had been made into classic films noir. This volume focuses on fiction written after the crime genre had acquired conventions that younger writers toyed with and sometimes broke. The movies made from such stories were equally radical. Patricia Highsmith's The Talented Mr. Ripley is the source for René Clément's bristling Purple Noon, a movie that features Alain Delon's quintessential performance. David Goodis's Down There inspired François Truffaut's neo-noir masterpiece Shoot the Piano Player. Jim Thompson, the brilliant author who scripted The Killing and Paths of Glory for Stanley Kubrick, wrote several novels that have been turned into movies, including The Grifters and The Getaway. He is represented here by one of his most uncompromising works, The Killer Inside Me, which was filmed by Burt Kennedy in 1976. Charles Willeford's Pick-Up and Chester Himes's The Real Cool Killers have not yet been made into movies, but the blistering prose and nihilistic worlds of these authors, and of all the writers represented in this volume, is astonishingly cinematic. This lovely hardcover edition contains biographical, textual, and explanatory notes. From Library Journal The Library of America gave a tremendous boost to the reputation of hard-boiled detective fiction with the inclusion of Raymond Chandler among its illustrious ranks (Classic Returns, LJ 9/15/95). This new two-volume set is another giant step in the direction of legitimacy for the pulp mystery genre. This duo collect 11 of the best crime novels in which the criminal rather than the sleuth is the central character. Included here are such gems as James M. Cain's The Postman Always Rings Twice, Cornell Woolrich's I Married a Dead Man, Jim Thompson's The Killer Inside Me, Patricia Highsmith's The Talented Mr. Ripley, and Chester Himes's The Real Cool Killers. These tales of murder and mayhem belong in all fiction collections.Copyright 1997 Reed Business Information, Inc. Review These novels, nearly 2,000 pages in length, beautifully bound and arranged--often following rare first-edition design blueprints--contain some of the best crime writing of the genre's golden decades. They should give much pleasure to lovers of film noir and readers addicted to original and eclectic writing. And for cineastes, Pick-up and The Real Cool Killers, alone among these novels, have yet to be made into films noir. So you'll have to read the books first. -- Los Angeles Times Sunday Book Review, Nicholas Christopher About the Author ROBERT POLITO, editor, is a poet, biographer, and critic whose Savage Art: A Biography of Jim Thompson received the National Book Critics Circle Award. He directs the Graduate Writing Program at the New School and is the editor of David Goodis: Five Noir Novels of the 1940s & 50s, also from The Library of America. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22",
            "Or fastest delivery Monday, February 19. Order within 11 hrs 55 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 6 hrs 40 mins",
            "FREE pickup Thursday, February 22",
            "Or fastest pickup Tomorrow, February 18. Order within 3 hrs 40 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "This adventurous two-volume collection presents a rich vein of modern American writing too often neglected in mainstream literary histories. Evolving out of the terse and violent hardboiled style of the pulp magazines, noir fiction expanded over the decades into a varied and innovative body of writing. Tapping deep roots in the American literary imagination, the novels in this volume explore themes of crime, guilt, deception, obsessive passion, murder, and the disintegrating psyche. With visionary and often subversive force they create a dark and violent mythology out of the most commonplace elements of modern life. The raw power of their vernacular style has profoundly influenced contemporary American culture and writing.LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Library of America (September 1, 1997)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 892 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1883011493"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1883011499"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.3 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.1 x 1 x 8.1 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#417,375 in Books (See Top 100 in Books) #4,506 in Short Stories Anthologies #7,292 in Murder Thrillers #10,779 in Classic Literature & Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 74 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "RaDadIndy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6P37NOD7QQT6CASCFLHGR5NVNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C0TP7P9W92QA?ASIN=1883011493",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2007",
                "reviewTitle": "5.0 out of 5 stars Great, plus a surprising treat",
                "reviewText": "In this area of noir, I suggest starting with Raymond Chandler. If you've whipped through his books, like me recently, as well as those of Micky Spillane and Dashiell Hammett, then you are definitely ready for this collection and its partner volume of crime novels from the '30s and '40s. I need to mention, in particular, a real treasure in this collection, which is The Real Cool Killers by Chester Himes.At this point, allow me a brief political comment. These days, when I see an anthology of five books, and one of the authors is a woman and one is an African-American, perhaps you will forgive me if I guess that something other than storytelling merit went into the selection process. Too harsh? Keep in mind that we are talking about a genre (in this case, hard-boiled crime stories from the 1950s) where you don't exactly expect to see a rainbow coalition of gender and ethnicity. What's more, my suspicion was initially confirmed by reading The Talented Mr. Ripley, which is clearly the weakest story in the collection, and only then observing that this was the first novel in the field I had seen written by a female author.That introduction brings me to the Real Cool Killers, by Chester Himes. I have since learned that he was an African-American author who wrote many books. But I will fight it out with anyone who claims that Real Cool Killers was selected because of Himes' race. This story is the best of the lot, and I look forward to reading more of his work in the future. In fact, our era of political correctness in literature and academia probably means that Himes does not get nearly the attention he deserves. He is wonderfully impartial when it comes to skin hue in his presentation of nasty characters and their evil deeds. He is equally impartial in his socio-economics. The poor are not automatic angels; the police and the wealthy are not cardboard oppressors. Himes is just a great writer. His novel, which is the last in the book, was a surprising treat.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Crane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2WMVOVQ4YHV3T6MH25RNIDDOZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34X00YM8IZHMQ?ASIN=1883011493",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent service.",
                "reviewText": "The book arrived in very good condition, and quickly. I really appreciate the service!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard J. Sloan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBPGRZ2NC3HY2OXMWZPGP5MDRXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAIAW7BM278X?ASIN=1883011493",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2008",
                "reviewTitle": "5.0 out of 5 stars Dark Novels from the 1950's",
                "reviewText": "The Library of America has several interesting compilations of Noir novels. I had read Himes' Real Cool Killers separately and also have just watched his \"Cotton Comes to Harlem\" from the novel, with the same lead detectives. Himes is almost a forgotten author, typical of the bigotry of the Jim Crow era, in that he wasn't appreciated in the US, but received major prizes in France, where he lived out his life.The Killer Inside Me is about a despicable deputy in a small TX town, a character one detests but nevertheless can't ignore. The Talented Mr. Ripley was a movie, and, again, presents an evil young man in his downward spiral. I'm reading it now, having seen a film of it years ago. Two other novels in the volume I've yet to start.These are well bound books with a huge amount of good content for the money. I bought another volume of similar works from the 1930's and 1940's, and one of Dashiell Hammett works at the sme time. Many of these tales have become classic films. I look forward to much pleasant reading from the group.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Louis Axeman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSYLCV7ZNXJZTSRWP5P7FOW35UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Y9JEL1P2AW47?ASIN=1883011493",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2022",
                "reviewTitle": "5.0 out of 5 stars Like New Volume with Novels Much More Expensive to Purchase Individually",
                "reviewText": "The volume was as new and the novels in it would be much more expensive to purchase individually.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael C Gallo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGD3DHW2TIGTAK3C6ILBZYJRWCAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBDIQKZLOCODC?ASIN=1883011493",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 25, 2017",
                "reviewTitle": "4.0 out of 5 stars Pick Up this Volume if only for \"Pick-Up\"",
                "reviewText": "I admit, I haven't gotten through all of the stories yet. I bought it after seeing the film version of \"The Killer Inside Me\", which I found disturbing and creepy. After reading the paper version, to which the film is very faithful, I read Highsmith's novel - and then watched the film version of that (not quite as faithful to the novel. Both of these stories were good, but \"Pick-Up\" is the standout so far. Beyond depressing, nihilistic, existential - if you've ever felt wayyy down, the depiction of hopelessness in Willeford's novel will feel eerie and almost embarrassingly on-target, exposing the raw, pulpy edges of self pity and sheer, undiluted despondence so thick and dark there is no remedy for it. And, no matter how clever the plots or characters in the first two novels, there are no \"wow\" plot twist moments as there is at the end of \"Pick-Up\" - what many see as a gimmick, but which was one of the few really surprising (and though the novel works without it, enlightening) turns in anything I've read in many a moon.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Muscia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRQN724ZGRNBPYDL32CNXEGQ6VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13TWZ4RTVALUO?ASIN=1883011493",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2021",
                "reviewTitle": "5.0 out of 5 stars Beautiful copy of this classic book",
                "reviewText": "Seller described this used book as \"like new\" and in fact it is more like 100% New. Very nice.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noir Fan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTBJ65C7CSFWHCYPVSAVDGUTJGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKGY5MTVJTV2F?ASIN=1883011493",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 27, 2019",
                "reviewTitle": "5.0 out of 5 stars Precise service",
                "reviewText": "Product was delivered in excellent condition.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P.J. van den Broeke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPTWEX53NVU3RWU3HKG5KNKXMKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RWFF0OHOPHNA?ASIN=1883011493",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2020",
                "reviewTitle": "5.0 out of 5 stars Love the black noir",
                "reviewText": "Great book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$25.57",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            },
            {
                "price": "$28.33",
                "sellerName": "allnewbooks",
                "sellerRating": "4.5"
            },
            {
                "price": "$35.00",
                "sellerName": "Books Unplugged",
                "sellerRating": "4.5"
            }
        ]
    }
}