{
    "remaining_requests": 52,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Key-House-Noland-Kids-Adventure/dp/B0B8XQQ6GT",
    "body": {
        "name": "The Key House (The Noland Kids Adventure Series)",
        "price": "$11.81",
        "originalPrice": "",
        "rawPrice": 11.81,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Key-House-Noland-Kids-Adventure/dp/B0B8XQQ6GT",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41qV5EintZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61hkPmv9HtL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mike Curtis",
            "link": "https://www.amazon.com/Mike-Curtis/e/B0B8WV6NW4/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 72,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Mike Curtis' clear, fast-paced writing style worked great for this book. I'm looking forward to reading more by him in the future.\" ­-Kristina Hall, Author, Promises Unbroken\"The latter half of the story was tense and fast paced... it is an enjoyable adventure story with a fun backstory and mystery to solve.\" -Sara Beth Williams, Author, A Worthy Heart\"Mike Curtis' The Key House is aimed at younger readers; however, I found myself smiling and rapidly turning the pages as I relived the joy serial mysteries like The Hardy Boys gave me as a kid. It is a clever story, with realistic family scenarios deftly blended with high adventure, complete with tales of pirates' gold and riddles left by a distant ancestor. Curtis skillfully weaves the underlying Christian message into the story as a natural part of who the characters are, consistent with their overall portrayal. The story's pace builds nicely, with the tension steadily rising until the satisfying end brings readers down from an exciting climax. \" -Tilmer Wright Jr., Readers' Favorite, 5 stars review\"Very well written with obvious thought as the story unfolds... This story captures the reader right away in Chapter 1... This is an excellent read. I will be looking for the next book in the series.\" -Leanne B., Certified Secondary Teacher of 25+ years\"Such a fun adventure story for middle-grade kids!... The hidden passageways, the twists and turns... I really enjoyed this book and can't wait for the next one to come out!\" -Jennifer Spaudo, former Online Editor, Charisma Magazine\"The author has done a wonderful job of instilling suspense and family-friendly lessons in a story intended for younger readers. Even as grandparents, we found the book to be intriguing and engaging and really appreciated the inspiring faith-filled moments in the lives of the Noland kids... This is a well-written book and we look forward to subsequent books in the series!\" -Chris Gardner, Pastor\"I am far too passionate about finding good reading material for myself and my children to recommend any book that we didn't delight in. And I did love this book! It is short enough to be read aloud with my kids, with an engaging storyline that kept me reading into the night. The two brothers who are the heroes are realistic in their squabbles, interests, and humor. The family life portrayed is warm, showing parents who care and support their children as they grow up and explore. I suspect every child dreams of secret rooms, hidden treasure, mysterious and unexpected family history, and exploring on their own. This plot offers it all!\" -Katherine Nolette, former University English Professor\"Your kids will not get bored with this book, I guarantee it. The humor, the lessons, the clear presentation of the Gospel in a relevant way flowed so well in this fun story. Mike writes clearly and keeps the reader on the edge at the end of each chapter waiting to see what happens next. I was excited to read this book and it made me feel like a kid again; I know your kids will love it!\" -Manny Alamo, Lead Pastor\"This book is amazing! It has all the elements I've always wanted to happen in my life...a hidden treasure, adventure, mystery, and a beautiful testimony of how Jesus can change a life. The story has me turning pages wanting to find out what happens next. These characters feel like friends now and I can't wait for their next adventure.\" -Meredith C., Author, Reviewer, Homeschool Conference Speaker\"If I was giving this book a stars rating, I would go over and above the 5 stars. It truly is that good!\" -Pam Collins, Author, The Gift of Simple blogsite, mother and grandmother\"This story captured my attention immediately and was full of fun twists and turns.\" -Edith, 18\"At times, I was at the edge of my seat to see what would happen next!\" -Noah, 13\"It was an excellent book, and I can't wait for the next book.\" -Jenna, 12 From the Author As a boy I was driven by a love for adventure and mystery.I clicked on the flashlight and peered deep into the crevice. Scrutinizing. Surveying. Its twists quickly lost my light. But curiosity led me on as I squeezed between the giant boulders and into a winding cave in search of... what else? Treasure. And not just any treasure... pirate's treasure!At just seven years of age I was flanked by my three brothers, two older, one younger. We were determined to discover the find of the century. Or at least, that's how I remember it (little boys' imaginations do tend toward wild dreams). And this is my story!So, as I was saying... us four boys loved to explore the remains of what looked like an avalanche of huge rocks down the long, steep bank of the Brandywine River. Or perhaps it was the remains of some ancient giant emptying his pockets of stones he had collected that day. As they say, \"I've heard it both ways.\"However they actually got there, they piled on top of each other to form deep, intricate caves. And well aware that pirates always hid their treasure in caves (this was a well-known principle I'm sure I learned from some authoritative source, like my best friend next door who avidly read the newspaper and Readers' Digest), we were determined to soon become wealthy in our discovery.Though such was never our fortune, from my early childhood days I have always loved adventure and mystery. This tale, The Key House, though quite different in some ways from my creative quests as a little boy, plays the same themes of adventure and mystery. And they will tug at any heart in search of these.But stories are also meant to touch the heart.As a young pastor I had learned that if your message, or story, does not touch you deeply, it will not touch those listening. The same is true for the written word. Let it move you, and it will move others.Personal confession here: towards the end of The Key House, I still cry when reading portions. Granted, I am moved by stories of the hurting and their desperate cry of pain. Maybe in part that's why God called me to pastor.So, I invite you to be touched by this story, not simply in its adventure and mystery, but in its drama of two brothers' relationship in turmoil, the deep, bitter heartache of the antagonist, and the beautiful story of redemption and what happens when God is invited into our pain. Perhaps in some way, this is your story. I know in some ways, it is mine."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 12 hrs 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A newly inherited house. A 150-year-old secret. And some mysterious, hidden clues.Join Caleb and David in this fast-paced Hardy Boys meets The Goonies, edge-of-your-seat mystery/adventure, as they seek a rumored treasure and clear their great-great-grandfather’s good name.After moving into a newly inherited house, the Noland kids discover clues to a supposed treasure hidden by their great-great-grandfather. But when town rumors and some spiteful neighbors suggest foul play was involved, Caleb and David set out on a quest to prove otherwise.With unexpected dangers looming large and threatening their mission, can the Noland kids discover the mysterious treasure, or whatever lies at the end of their treacherous adventure, before time runs out and all is lost?",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Childrens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2966"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B8XQQ6GT"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Powerline Productions (August 7, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 234 pages"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 979-8986466408"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 10 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.25 x 0.53 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,616 in Books (See Top 100 in Books) #1 in Children's Christian Humor Fiction #2 in Children's Christian Mysteries & Detective Stories #5 in Children's Christian Action & Adventure Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 72 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "SEE THE WORLD Mystery and adventure that takes you throughout the world. Get ready for wild rides through Central Florida, the Congo, Viet Nam, and the Caribbean. CAPTIVATING BACKSTORIES Every adventure story should offer the reader a plot that presses the limits of their imagination as well as characters with real life-struggles and hurts. To discover that there is a God who can heal those hurts no matter how deep is both refreshing and freeing. This is the stuff of life where fiction meets reality. ADVENTURE IN HIGH GEAR It's one wild ride! With terrorist plots, volcanoes, gunfire, huge serpents, strange creatures, totally unexpected plot twists, heart-pounding and heart-rending backstories, mountain gorillas, more strange creatures, narrow escapes (but don't tell anyone!), and an all-out, run-for-your-life ending, you won't want to start this book too late in the evening. It's gripping and truly a story for ALL ages! (The Lost City of Light)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/767ae471-78ec-4b49-8ad5-876d348ddd7f.__CR0,0,1080,1080_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/17e2a0fa-3005-4ddb-bae3-aab5450609b5.__CR0,0,1080,1080_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/2e2c3ed8-f565-411f-9907-68d216d98372.__CR0,0,1080,1080_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "The Key House The Lost City of Light The Legend of the Craftsman King The Secret of Paradise Cove Number of pages 219 249 314 211 Ages of kids Caleb-12; David-10; Lizzy-8 Caleb-20; David-18; Lizzy-16 Caleb-20; David-18; Lizzy-16 Caleb-21; David-19; Lizzy-17 Country where adventure takes place Florida, U.S. The Congo Vietnam The Caribbean Landmarks (fictional and non-fictional) A 150-year-old house; a cave/cavern The Virunga National Park; a 10-mile-long secluded valley The Phong Nha cave system; a 50-mile-wide cavern An island 30 miles east of Martinique island Book/movie comparison The Goonies Indiana Jones Journey to the Center of the Earth Treasure Island Character lessons ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/53520050-24c6-42bf-a7b5-e85acefe7d36.__CR0,5,970,291_PT0_SX600_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/b6a59662-34f0-41b9-b09e-7eed5f42e86d.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/767ae471-78ec-4b49-8ad5-876d348ddd7f.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/17e2a0fa-3005-4ddb-bae3-aab5450609b5.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/2e2c3ed8-f565-411f-9907-68d216d98372.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/dd9787fa-1e7b-43b9-9cfe-ab89f9b56cc3.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/8e0e0dc7-e4f2-4206-a973-6c11f5cfd225.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/3aabaeaa-cb12-45bb-a660-6c501ab951e5.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/40ac8426-8e1c-4032-ae29-5e6f1494b047.__CR0,0,300,600_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMH4NLSZJT4GLAU4HDVTRVEYJHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BWLLY7Y4UGLK?ASIN=B0B8XQQ6GT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "Couldn’t put this one down. Great for all ages!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYBFCITIU2KMBQPHEFOACE4KQWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34IOV9JGFHBOJ?ASIN=B0B8XQQ6GT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "This was a gift and she loved it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDHUHA6NRDFQX4NVXXIUJM4M22Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REUTXKNI3DP5D?ASIN=B0B8XQQ6GT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 15, 2022",
                "reviewTitle": "4.0 out of 5 stars Fun for the whole family",
                "reviewText": "Great adventure story suitable for the whole family! Enjoyed reading this with my daughter (8) and following the Noland Kids on their adventure!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abuelita58",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKDHVOI3CLUKUMPGD4FHNPRZ5OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37CYKO0Q06LZ1?ASIN=B0B8XQQ6GT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book for preteen boy.",
                "reviewText": "My nephew loves the adventure and mystery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "joy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDYFQ67HYEGW2KM2NVXHXU743BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35ZA8TVF0R7V1?ASIN=B0B8XQQ6GT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Indiana Jones style and clean!",
                "reviewText": "My daughter is 13 and we both enjoy these books wish there were more!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Li",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7AZYPUEAEMLYFESM34AHFMG7LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MP7TPXU7Y49J?ASIN=B0B8XQQ6GT",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "2.0 out of 5 stars Proofreading needed",
                "reviewText": "My child pointed out a few spelling mistakes and punctuation errors in the book. I can’t say I would recommend it to anyone.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathleen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSFZOZ3HVCAAMT5AFSWGLG4CGOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A7QJLAM52XTM?ASIN=B0B8XQQ6GT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Family fun filled mystery",
                "reviewText": "This book was wonderful, Christian-based, fun-filled and mysterious. I love that the book is so family oriented and Godly. I love the relationships between the kids and between the kids and the parents. This is a wonderful book and wonderful story to share with your family. It makes me wish I had kids to share this amazing adventure with.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Busy mom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2TAFQVP4AVPNJMIUSBJKCDGZ2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MWSZOV0CWB27?ASIN=B0B8XQQ6GT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 5, 2022",
                "reviewTitle": "5.0 out of 5 stars A truly wonderful book",
                "reviewText": "I very much enjoyed reading The Key House. It started off a bit slow, but once the plot started to escalate it was hard to put the book down. I appreciated that it incorporated Christian values. The story had some intense parts, but nothing too scary. I would highly recommend this book for kids and teens. I’m really looking forward to reading the next book in this series.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}