{
    "remaining_requests": 69,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Alone-in-Wild-Kelley-Armstrong-audiobook/dp/B07TDND6W6",
    "body": {
        "name": "Alone in the Wild: A Rockton Novel (Casey Duncan Novels, Book 5)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Alone-in-Wild-Kelley-Armstrong-audiobook/dp/B07TDND6W6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61Yl31p96rL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kelley Armstrong",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Kelley+Armstrong&search-alias=audible"
        },
        "brand": "Kelley Armstrong&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1863,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In number-one New York Times best-selling author Kelley Armstrong's latest thriller, the hidden town of Rockton is about to face a challenge none of them saw coming: a baby.Every season in Rockton seems to bring a new challenge. At least that's what Detective Casey Duncan has felt since she decided to call this place home. Between all the secretive residents, the sometimes-hostile settlers outside, and the surrounding wilderness, there's always something to worry about.While on a much needed camping vacation with her boyfriend, Sheriff Eric Dalton, Casey hears a baby crying in the woods. The sound leads them to a tragic scene: a woman buried under the snow, murdered, a baby still alive in her arms. A town that doesn’t let anyone in under the age of 18, Rockton must take care of its youngest resident yet while solving another murder and finding out where the baby came from - and whether she's better off where she is. Number-one New York Times best-selling author Kelley Armstrong again delivers an engaging, tense thriller set in perhaps the most interesting town in all of contemporary crime fiction.A Macmillan Audio production from Minotaur Books Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=10457"
            },
            {
                "name": "Police Procedurals",
                "link": "https://www.amazon.com/Police-Procedurals-Mystery-Thrillers-Books/b?ie=UTF8&node=10482"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 32 minutes"
            },
            {
                "name": "Author",
                "value": "Kelley Armstrong"
            },
            {
                "name": "Narrator",
                "value": "Thérèse Plummer"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "February 04, 2020"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07TDND6W6"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#65,814 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1,535 in Police Procedural Mysteries #1,658 in Crime Thrillers (Audible Books & Originals) #1,907 in Women Sleuth Mysteries"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jessica S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLQG4FKWDQAQGN2SFXS56CHFBNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZK2FEFSVX3E1?ASIN=B07TDND6W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2020",
                "reviewTitle": "5.0 out of 5 stars Another Entertaining Mystery!",
                "reviewText": "I finally got myself caught up in Kelley Armstrong's Rockton series with Alone in the Wild and this one was definitely yet another chilling and eerie mystery. When so many dead bodies continue to show up in the wild that aren't at all animal related, you start to wonder just what exactly is going on in these here woods...and Casey and Dalton find themselves asking that very question.Casey and Dalton were taking a little weekend getaway, which when living in the middle of literal nowhere in Rockton, that just means camping a few hours away from town and being off duty. But while gathering firewood, Casey uncovers a dead body...again. But this time, the dead woman is holding a very much alive baby...out in the middle of the woods, just days away from the Winter solstice. Now, not only does Casey and Dalton need to find yet another murderer, they also need to try to track down the baby's family, as Casey's sister, April, and resident doctor confirmed that there's no way the dead woman is the mother.Having to take care of an infant baby at the height of a Canadian winter is not ideal. It's why there are no children under 18 in Rockton, and while the nearby settlements don't allow for children to be born in winter...if at all. There's a very definite seriousness to this mystery, it's possible that returning the baby to her family could be signing her death warrant all over again. Not only does Casey want to try to locate the baby's family, but to also make sure they are \"worthy\" of being parents. It might be a somewhat negative connotation that Casey gets to be the judge of character in this situation but really, what other choice is there? Casey and Dalton did admit that if for whatever reason the baby's parents are deemed unfit, then they would keep the baby. Can you imagine? Casey and Dalton trying to take care of an infant in the nowhere town in the woods dealing with murders every few months? That's one thing you never seen on TV really and there's a reason for that.Still, I thought the mystery was very well done. We get a little more insight to the residents outside of Rockton that live in the woods. There's definitely different ways of running a town within all these communities and the stance on equality between men and women or lack thereof. Definitely an interesting and insightful read in some respect. While some of the things that Casey learns about these \"neighbors\" of hers are a little disturbing, it honestly felt very realistic to their given situation being out in the middle of nowhere and literally making their own town and rules to live by.In this one, I felt like Casey and Dalton didn't get too much together time, but considering that they were taking care of an infant it's understandable and believable. They make do with they can and it felt realistic. Though I guess I will caution that there was a bit of trigger warning in here, where Casey and Dalton's doggo gets injured by a bad person. It's not a spoiler, and I will already throw out there that their dog is totally fine in the end and she's back to kicking ass in her own way, but just wanted to throw out that caution to anyone who truly gets upset. It happens within the last 100 pages just to give further pre-warning.The whodunit was a nice reveal too. I can't really say I saw it coming, though I suspect I should've when the person first appeared. I always make guesses but in this one...I don't think I ever really nailed down my whodunit officially. Sometimes I get too caught up in the mystery to remember to make my guess. Lol. In a way, that's a good thing because then I just make these discoveries with Casey and Dalton as they do.Alone in the Wild was yet another entertaining read filled with a well though-out mystery. Kelley knows how to give you just enough details to try to solve the mystery and along the way we continue to learn more about the Rockton residents, which I was totally taken by surprise with one of them this go around, as well as the residents of the \"others\" in the woods. While this is a series and events of the past are brought up again in the current book, I wouldn't say you need to read the previous books in order to dive into this series, but as always it's highly recommended! If you're wanting to just give the series a go, dive right in, but know that there are references that just won't make a lot of sense.Overall Rating 5/5 stars",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marty T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBQZWOVDF3LCKAPLCN3BCDYARLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V7XQ8RQQTUZO?ASIN=B07TDND6W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 23, 2020",
                "reviewTitle": "5.0 out of 5 stars Good mysteries to solve, and deeper character study",
                "reviewText": "Can you read this as a standalone, yes but you miss a lot of world building and character development. Example, in book one, Eric basically grunted and said \"f@@@\" pretty much as his vocabulary, now he actually responds with whole words and well thought responses to Casey, especially. Rockton isn't as prominent a character as it has been in previous books, we get to see the outside world, the First Settlement as well as the Second Settlement, and understand the hostiles much better and some of the inhabitants in each. We still get a good mystery, a murder and tracking missing people adventures, some easily achieved and some with a threat of loss of life. Mainly we dig deeper into Casey and Eric both the spoken and unspoken of past, present and future. The story is good character development of people we've come to care for as well as the psychological thrill of the mysteries Casey seeks to solve. Already looking forward to the next installment.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeri B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPSGNQDFQPE6FDV6FEV4UV64VIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27FA2KLATNC0O?ASIN=B07TDND6W6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2023",
                "reviewTitle": "4.0 out of 5 stars A lost baby in the Yukon",
                "reviewText": "Casey and Dalton find a dead woman holding a living infant in the snow. No one seems to know whose baby it is, so trips to the First and Second settlements are in order, but Casey and Dalton love this baby and want to ascertain that she is safe before giving her up. At the same time, the next generation of settlers and hostiles are all interested in trading with Rockton, but no one wants to tell the truth, the whole truth, and nothing but the truth!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "abr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHN7K37HJ4F27JOVOAXWW6ROM4AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RVKZLHZVWUVP?ASIN=B07TDND6W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Couldn't put it down!",
                "reviewText": "Read this series from the beginning for the best experience. Every book is as good as the one before it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rhonda Dee Harness",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM2HP4AH5PHZTDMR3JYTBVNLJZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CAV63VLNXX69?ASIN=B07TDND6W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice",
                "reviewText": "Love",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rita L. Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLU24LK4VREHMSDPVA7MWUNLMBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AKIRHP2588R0?ASIN=B07TDND6W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 9, 2022",
                "reviewTitle": "5.0 out of 5 stars Alone in the Wild",
                "reviewText": "I am enjoying this series. I like escaping to the town of Rockton at least in my imagination. Casey and Dalton’s romance is sweet. Solving murders in the Yukon isn’t easy and it seems as if they sometimes stumble into the answer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "April McConnell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHOVJXYOVQ6NWT2AHM465NLFB5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8CNAXXELT8S1?ASIN=B07TDND6W6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 12, 2023",
                "reviewTitle": "4.0 out of 5 stars better and better",
                "reviewText": "I keep waiting for this series to run out of steam but it just keeps getting better and better. The entire concept is so original and unexpected I just can’t quit!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CHERI D EVANS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXP6NDCCNJ2NO4IB2G32HW2JECQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35USH09H6GRIZ?ASIN=B07TDND6W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 5, 2022",
                "reviewTitle": "5.0 out of 5 stars Alone in the Wild",
                "reviewText": "Another thoroughly enjoyed read. Kelley never disappoints and even though this one didn't keep me on the edge of my seat, it was still every bit as enjoyable as the previous volumes in the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 17, 2020",
                "reviewTitle": "This shows that there is yet material for new stories about Rockton",
                "reviewText": "Note: you could enter the series here, I guess, but I wouldn’t recommend it. You get the most out of it, if you read the series from the beginning.ReviewI love the series, which whoever read any other of my Rockton reviews knows. But even I have to admit that I was wondering, if there are much more stories left to tell about the secluded, even hidden town of Rockton, right in the middle of the Yukon wilderness. Especially since there is a limited cast of characters, due to the solitude and the purpose of the town, which is hiding people from the world. But I was shown that yes, there are still a lot of untold stories here.Actually, this time Casey and Dalton aren’t spending so much time in Rockton (and I admit, I did miss it, because I love the town), but explore a lot of the areas around it. Because Casey literally stumbled over a dead body protecting a still living baby. And after finding out that the dead woman is not the baby’s mother, Casey and Dalton go on an extensive and exhausting search for the parents. This odyssey shows the reader a lot of the wilderness and the people living there: the various settlers, the hostiles and some less than savory merchants dealing in everything. I loved seeing more about the area around Rockton and especially finally learning about the hostiles. The plot did not develop they way I expected it to and I appreciated that. Overall, a worthy addition to one of my most loved series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Heron",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 6, 2020",
                "reviewTitle": "A different kind of mystery.",
                "reviewText": "Rockton is a very unusual town. In the middle of the Yukon territory it's like something from the old west. A complete lack of technology, no electricity, phones, indoor plumbing it's life at its most basic. But the people living there don't mind the deprivations, everyone in Rockton is hiding from something or someone, mainly the law. For a price \"The council\" -----who control access to Rockton----- allow entry for a fixed term ,usually two years of so, which allows people to make plans to get a new start somewhere else. As a result The town is full of people hiding who they really are and why they needed to hide out in Rockton The only exception is the town sheriff Eric Dalton, raised in Rockton The son of the previous sheriff he knows no other way of life and is content with the way things are. His life Changes when Cassie comes to town in the modern world she was a homicide detective and was given entry into Rockton because Dalton needs help policing the town dealing with crimes beyond his investigative skills. By the end of book one Cassie and Dalton have developed a personal relationship which grows and develops in the preceding stories. Now Cassie has been in Rockton a out eighteen months, Christmas is on the horizon and it's the quiet time in the sheriffs department. Dalton and Cassie take advantage.by going on a little hiking trip but not all goes as planned Cassie finds a baby in the snow, swaddled up in the arms of a dead woman with no sign of where she came from. They rush the baby back to town for emergency care where they find the dead woman is not the baby's mother. This leaves a dilemma do they go looking for people who may have abandoned a baby to die in the wilderness or do they do everything in their power to try to reunite a mother with her baby.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa Goldman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 10, 2020",
                "reviewTitle": "another great read !",
                "reviewText": "Another nonstop jammed packed page tuner in the Rockton series !Another amazing story by Kelley Do yourself a favour and get reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bev Darbyshire",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 18, 2022",
                "reviewTitle": "Excellent book",
                "reviewText": "Excellent read. You don't have to read the series to follow the story line but it isn't repeatative either.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debbie Marchant",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 3, 2020",
                "reviewTitle": "Another great mystery",
                "reviewText": "Another brilliant episode in this series. Lots of red herrings in this one, kept me guessing! I also love the ongoing character development.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}