{
    "remaining_requests": 82,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Murder-Degrees-Mystery-Ritu-Mukerji/dp/1668015064",
    "body": {
        "name": "Murder by Degrees: A Mystery",
        "price": "$13.99",
        "originalPrice": "$27.99",
        "rawPrice": 13.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Murder-Degrees-Mystery-Ritu-Mukerji/dp/1668015064",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51XnsuyRjmL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51MpziH9FvL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ritu Mukerji",
            "link": "https://www.amazon.com/Ritu-Mukerji/e/B0C2JHTWQF/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 259,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review *An Edgar Award Finalist for Best First Novel \"Like Jacqueline Winspear’s Maisie Dobbs, Lydia is a strong and indomitable woman who transcends her circumstances to become her true self and a crusader for social justice. This atmospheric novel heralds the arrival of a talented new writer and an unforgettable heroine.\"—Kirkus Reviews (Starred) “Mukerji’s taut plotting and vivid depiction of the era’s medical practices and social customs will leave readers eager for a second installment.”—Publishers Weekly (Starred) \"On the surface, this debut by Mukerji, herself a medical doctor, appears to be a mystery about the death of a working-class servant, but it’s much more, as it examines women’s rights, social conditions, and medicine in Philadelphia just a decade after the Civil War. Fans of Maddie Day’s “Quaker Midwife” series will appreciate this detailed historical mystery.\"—Library Journal (Starred) “Murder by Degrees stars a capable, likeable heroine in Dr. Lydia Weston, who battles for acceptance every day as a female doctor in 19th century Philadelphia, and when one of her favorite patients turns up apparently murdered Lydia will need all her diagnostic skills to unmask the killer. Ritu Mukerji—a practicing physician herself, her expertise shining on every page—pens a heartfelt ode to the historic women who blazed a trail in medicine before her as well as a wonderfully entertaining mystery. Hopefully Lydia Weston's adventures will continue in future volumes!”—Kate Quinn, New York Times bestselling author of The Diamond Eye “In Murder by Degrees, Ritu Mukerji delivers a fresh take on a classic genre. When the smart, compassionate Dr. Lydia Weston teams up with Inspector Volcker to solve the murder of a beloved patient, she proves that science is a formidable truth-teller. Set against the vivid backdrop of 19th century Philadelphia, this twisty debut mystery feels refreshingly modern. I can't wait to see what Dr. Weston does next.”—Michelle Richmond, New York Times bestselling author of The Wonder Test \"Ritu Mukerji weaves a thrillingly atmospheric tale of intrigue, featuring a brilliant female doctor who's ahead of her time. The descriptions of medicine in a bygone era are so vivid, you can almost see the glint of lamplight reflected in Dr. Lydia Weston's scalpel as she slices through skin.\"—Tess Gerritsen, New York Times bestselling author of The Spy Coast \"Suspenseful and captivating. Ritu Mukerji brings the operating theaters, drawing rooms, and back alleys of nineteenth-century Philadelphia to life in this darkly atmospheric mystery.\"—Allison Buccola, author of Catch Her When She Falls “The evocative nineteenth century Philadelphia setting and the very real early history of the Woman’s Medical College is new and fresh and fantastically feminist. But it’s the kindness and care and the wonderful wisdom of Dr. Lydia Weston—even as she uncovers secrets cloaked in privilege and obsessions shrouded in shame—that makes Murder by Degrees one fantastic read!\"—Meg Waite Clayton, New York Times bestselling author of The Postmistress of Paris \"I was kept guessing until the very end of this gorgeously written mystery set in a highly Gothic, 19th-century Philadelphia. Ritu Mukerji illuminates the little-known history of America’s earliest women physicians through her protagonist Lydia Weston, an unforgettable young woman whose intelligence is equally matched by her compassion. A brilliant start to a series that presents the medical mystery in a feminist light.\"—Sujata Massey, author of The Widows of Malabar Hill “A stunning debut. Beautifully crafted characters and twists you won’t see coming. I devoured every page.”—Robert Dugoni, New York Times bestselling author of The Tracy Crosswhite Series About the Author Ritu Mukerji was born in Kolkata, India, and raised in the San Francisco Bay area. From a young age, she has been an avid reader of mysteries, from Golden Age crime fiction to police procedurals and the novels of PD James and Ruth Rendell. She received a BA in history from Columbia University and a medical degree from Sidney Kimmel Medical College of Thomas Jefferson University in Philadelphia. She completed residency training at the University of California, Davis and has been a practicing internist for fifteen years. She lives in Marin County, California, with her husband and three children."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 13 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An Edgar Award Finalist for Best First Novel For fans of Jacqueline Winspear and Charles Todd, Murder by Degrees is a historical mystery set in 19th-century Philadelphia, following a pioneering woman doctor as she investigates the disappearance of a young patient who is presumed dead.Philadelphia, 1875: It is the start of term at Woman’s Medical College of Pennsylvania. Dr. Lydia Weston, professor and anatomist, is immersed in teaching her students in the lecture hall and hospital. When the body of a patient, Anna Ward, is dredged out of the Schuylkill River, the young chambermaid’s death is deemed a suicide. But Lydia is suspicious and she is soon brought into the police investigation. Aided by a diary filled with cryptic passages of poetry, Lydia discovers more about the young woman she thought she knew. Through her skill at the autopsy table and her clinical acumen, Lydia draws nearer the truth. Soon a terrible secret, long hidden, will be revealed. But Lydia must act quickly, before she becomes the next target of those who wished to silence Anna. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Simon & Schuster (October 17, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1668015064"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1668015063"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.01 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 1.1 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#46,499 in Books (See Top 100 in Books) #829 in Historical Mystery #1,600 in Murder Thrillers #2,425 in Women Sleuths (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 259 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/be125b34-452f-44d3-a263-d984aafd979f.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ad19f4ae-9f9d-4920-a416-b6efa3c80dd6.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07e320e2-80db-43bc-a161-ee2236a969e0.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6d48dcdd-9872-4b87-8c3b-ddb128b021fd.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bob B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHPMS5YVT74RENJNL5DOCNSL7PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M9YULL86MUXD?ASIN=1668015064",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Impressive Debut Mystery",
                "reviewText": "A historical mystery set in 1875 Philadelphia. One of 2023’s best debuts.An ambitious novel featuring the indomitable physician, Lydia Weston. She becomes a part-time sleuth when one of her patients, Anna Ward, disappears.What works: Rich historical detail both about post-civil-war Philadelphia and the tortuous path for women in medicine. Good characterization.What doesn’t work: An overly complicated plot. Too many instances where Dr. Weston is subjected to male chauvinism. Without giving away the plot, one too many murders.An impressive debut mystery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWLOYH34V7XP653T2OMQTPHINNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MGXDFPDRTW08?ASIN=1668015064",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "4.0 out of 5 stars A great murder mystery historical fiction",
                "reviewText": "A murder mystery set in 1875, starring a woman doctor who becomes embroiled in the police investigation when a patient of hers suddenly seems to go missing - and the body they discover in the river matches her description. We follow Lydia as she investigates alongside the police to determine what exactly happened to Anna Ward - and whether it was simply suicide, or if it was murder.This book was a solid mystery novel, where at no point were you completely positive where the investigation was going to go, nor who was actually at fault. I enjoyed Lydia as a character - as a female doctor and a professor at her school educating OTHER women to become a doctor - she has an interesting insight to the events going on around her. I liked that while this was a mystery novel, we do spend a decent portion of the book as Lydia goes about her life and the sexism she faces for her profession.When Lydia finds a personal diary from Anna Ward that seems to contain poetry that alludes to her knowing something that someone might want to keep secret - as well as her being frantic the last time she was seen - it adds intrigue to the case. Was someone hunting her? Did she know a secret she should not have? And while the police focus on interviewing suspects, Lydia focuses on discovering the secrets of the journal - which slowly piece together the events that lead to Anna Ward being found dead.Mystery novels involving a complicated and intricate investigation, where you have many suspects but no clear evidence until the end, can be difficult to pull off properly. This book is able to do it convincingly, where even with there being multiple suspects and culprits, how they all fit together works extremely well. I liked how Lydia was able to work alongside the police for the investigation - but also, when she has her own leads will go off on her own.This is a great murder mystery novel, and the meshing of the investigation with Lydia’s daily life almost felt like I was reading something similar to Katherine Arden’s Cemeteries of Amalo series.I would only caution readers reading this if they are squeamish about descriptions of bodies, surgeries, and autopsies as while the descriptions are not overly graphic, they are described fairly well.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiff & Nick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUNCKT6X3RECOC3WDEX6W4P3KGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RJO5F9CBBSBH?ASIN=1668015064",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "3.0 out of 5 stars An enjoyable medical whodunit!",
                "reviewText": "“It was one thing to read an account of disease in textbooks, but there was no replacing the visceral experience of seeing, hearing, touching the patients.” ‼️‼️“Reading was her solace, literature the sustaining force of her life. She thought of the countless times she had sought refuge in her books, when literature had provided the ballast and strength of an old friend.”Synopsis:Philadelphia, 1875: It is the start of term at Woman’s Medical College of Pennsylvania. Dr. Lydia Weston, professor and anatomist, is immersed in teaching her students. When the body of a patient, Anna Ward, is dredged out of the Schuylkill River, the young chambermaid’s death is deemed a suicide. But Lydia is suspicious and she is soon brought into the police investigation. Aided by a diary filled with cryptic passages of poetry, Lydia discovers more about the young woman she thought she knew. Through her skill at the autopsy table and her clinical acumen, Lydia draws nearer the truth. Soon a terrible secret, long hidden, will be revealed. But Lydia must act quickly, before she becomes the next target of those who wished to silence Anna.There are quite a few points in the book where medical terms are used, which I have no issue with as I work in medicine, but might stumble you up if you don’t. Overall this was a slower paced murder mystery full of twists, scheming, old school medicine, and “lady doctors” that got an awful lot of crap for simply being women. An enjoyable and entertaining read!Thank you to @SimonBooks and @RituMukerji for the #gifted copy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Harris Jr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2SEYNBUUBXWHYSVY7BTQU4DA3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X4E7IQY39IQK?ASIN=1668015064",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Good plot, fun characters, and great medical history",
                "reviewText": "As an author of two nineteenth-century physician biographies, I really enjoyed this book. I loved the author's wonderful eye for period and medical details and found the plot well-crafted and suitably twisting. I think Dr. Mukerji has given us an intriguing central character, a great portrait of the challenge this pioneering group of women physicians faced and the men who supported them, as Harlan Stanley supported Lydia Watson, and life at the dawn of America's Gilded Age. For me, this was a fine whodunnit with the right level of historical nuance. It would not be hard to see the storyline as a tv miniseries a la \"The Alienist\" or \"Enola Holmes.\"",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Delphimo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4POQWEHFIA557HMAZ5I3ELI4XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UA7M1EVAEB40?ASIN=1668015064",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "4.0 out of 5 stars Murder By Degrees",
                "reviewText": "Murder By Degrees by Ritu Mukerji gives the reader a glimpse into Philadelphia in 1875 and the perils of women doctors during this period. Mukerji describes an actual autopsy in vivid detail and gives an insight into the medical problems in the 19th century. The novel develops the characters and the setting shows Philadelphia in great detail. The excellent writing pushes the reader to continue reading and finish the novel in a day. The hardships of surgery in the 19th century point to the emergence of anesthesia as a form of controlling the patient’s pain and terror during surgery. A mystery well written, insightful, and interesting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5OQUZFQL35FBFTKBC2ZUTJ6JAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WHZ7HNADST0V?ASIN=1668015064",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Twisted!",
                "reviewText": "This is a new author for me, I enjoyed her style. Well written, with details paid to using all five senses to describe scenes and paint a true picture of what the reader was \"seeing\". Masterful use of poetry, some very deliberate quotes while in other places, a mere hint and nod to other famous works. The plot had plenty of conflict and some very unexpected twists!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}