{
    "remaining_requests": 3,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/River-We-Remember-Novel/dp/198217921X",
    "body": {
        "name": "The River We Remember: A Novel",
        "price": "$15.45",
        "originalPrice": "$28.99",
        "rawPrice": 15.45,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/River-We-Remember-Novel/dp/198217921X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51SSirWTY8L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51l7qnNTP-L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "William Kent Krueger",
            "link": "https://www.amazon.com/William-Kent-Krueger/e/B001H6KG50/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 9653,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “[Krueger] is a fine storyteller, but it is his understanding of his characters and his sense of the past that make The River We Remember more than just a story. As novels go, this one is a work of art.”—The Denver Post“The River We Remember may be [Krueger's] magnum opus…deeply moving…intimate and epic in equal measure.” —Star Tribune (Minneapolis)“William Kent Krueger’s page-turning, rewarding mystery The River We Remember is a superb exploration of the prejudices and complexities of post-World War II America.” —Bookpage (starred review)“Absorbing. . . combines nostalgic settings with depictions of the lingering hardships and traumas of war and the home front . . . in the decade after WWII.” —Booklist (starred review)“Tender, evocative.” —Shelf Awareness“Krueger’s graceful prose coupled with his ability to delve deep into his characters’ inner lives makes The River We Remember a stand-out in a career of excellent novels…[The novel] ebbs and flows to a stunning ending that also is life affirming. This is a story not easily forgotten.” —Sun Sentinel “Irresistible…Book clubs, here’s your next pick. Find The River We Remember, take it home and shut the door.” —Macro Eagle“Historical fiction that resonates with our time makes for a great reading experience—especially when it’s done in the literary style of rich, careful language; realistic evocation of place; and deep exploration into character. William Kent Krueger has delivered just this combination in his latest standalone novel, The River We Remember.” —New York Journal of Books About the Author William Kent Krueger is the New York Times bestselling author of The River We Remember, This Tender Land, Ordinary Grace (winner of the Edgar Award for best novel), and the original audio novella The Levee, as well as nineteen acclaimed books in the Cork O’Connor mystery series, including Lightning Strike and Fox Creek. He lives in the Twin Cities with his family. Learn more at WilliamKentKrueger.com. Excerpt. © Reprinted by permission. All rights reserved. Prologue PROLOGUE THE ALABASTER RIVER cuts diagonally across Black Earth County, Minnesota, a crooked course like a long crack in a china plate. Flowing out of Sioux Lake, it runs seventy miles before crossing the border into Iowa south of Jewel, the county seat. It’s a lovely river filled with water that’s only slightly silted, making it the color of weak tea. Most folks who’ve grown up in Black Earth County have swum in the river, fished its pools, picnicked on its banks. Except in spring, when it’s prone to flooding, they think of it as an old friend. On quiet nights when the moon is full or nearly so and the surface of the Alabaster is mirror-still and glows pure white in the dark bottomland, to stand on a hillside and look down at this river is to fall in love. With people, we fall in love too easily, it seems, and too easily fall out of love. But with the land it’s different. We abide much. We can pour our sweat and blood, our very hearts into a piece of earth and get nothing in return but fields of hail-crushed soybean plants or drought-withered cornstalks or fodder for a plague of locusts, and still we love this place enough to die for it. Or kill. In Black Earth County, people understand these things. If you visit the Alabaster at sunrise or sunset, you’re likely to see the sudden small explosions of water where fish are feeding. Although there are many kinds of fish who make the Alabaster their home, the most aggressive are channel catfish. They’re mudsuckers, bottom feeders, river vultures, the worst kind of scavengers. Channel cats will eat anything. This is the story of how they came to eat Jimmy Quinn. Chapter One CHAPTER ONE IN 1958, MEMORIAL Day fell on a Friday. This was long before the federal government made the celebration officially the final Monday of May. Back then it was still referred to as Decoration Day. Like many rural communities, Jewel took its holidays seriously. The people of Black Earth County were mostly farmers, sensible, hardworking folks. Their days were long, their labor backbreaking. But when they could legitimately give themselves permission to relax and enjoy life, they did a pretty fair job of it. Decoration Day was the first real celebration after the relentless work of spring. By then, the ground had been plowed, harrowed, planted. The honey wagons had spread manure across the seeded fields, and near the end of May, that aroma, which is a peculiar hallmark of farm country, had pretty much disappeared. In its place was a different scent, the fragrance of green shoots and leafed trees and early-blooming wildflowers and, in town, lawns freshly mowed. What had come by the end of May was the smell of promise. Jewel had always called itself “The Gem of the Prairie.” The grand courthouse on the hill was built twenty years after the Civil War, constructed of granite quarried in the Minnesota River Valley seventy miles north. The shops that lined the main street were all family-owned, and proudly so. It was a small town by most standards. There were no stoplights and the only grocery store was Huber’s, in business since before the turn of the century. If you came from the city, you’d probably have thought of it as sleepy. But in 1958, it was bustling, with lots of life in it. And death, too, as it turned out. The Decoration Day parade was a grand affair. The veterans dressed up in their uniforms. The oldest was Gunther Haas, who served with Colonel James W. Forsyth’s 7th Cavalry at the battle of Wounded Knee in 1890. The uniforms of the old vets were generally faded and ill-fitting, but a lot of the younger men, who’d fought in World War Two or the Korean War, still looked pretty snappy in their khaki and braid or their navy whites. The veterans were at the center of the parade, Gunther Haas among them, pushed along in his wheelchair, a frail wisp of a man with ill-fitting false teeth and barely enough strength to wave the little flag he held. Up front marched the Jewel High School Band in its final official performance of that school year. The fire department, as it did for every parade, rolled out its two engines and hit their sirens many times along the route, so that the spectators on the sidewalks screamed with delight. Jack Harris, the mayor, was there in a shiny red Edsel convertible that Wheeler’s Ford dealership was still trying to get rid of. Near the end came the Black Earth Trotters, a group of local show riders, on their mounts, the horses decked out in ribbons and high-stepping proudly. The parade moved down the entire length of Jewel’s business district—three blocks of shops and businesses—and turned at the corner of Main and Ash, where chairs had been set on a high platform so that Harris and a few others could speak, offering the kinds of platitudes expected on such a day. Afterward, in Veteran’s Park, there would be picnics and fireworks. In those days, Jewel’s population hovered around four thousand. A lot of them turned out for the celebration, and a good many farm families came into town as well. Absent that year, as usual, was Brody Dern, sheriff of Black Earth County. Brody would have been among the most decorated of veterans had he chosen to march with the others, but Brody never did. He had duties to attend to, he would say as an excuse, and folks let it go at that. On the Decoration Day when this story begins, Brody was, in fact, occupied overseeing the one prisoner the county jail held, Felix Klein. Felix wasn’t the kind of man who needed much oversight. When he was sober, he was every bit as decent and peace-loving as the next citizen of Jewel. But Felix had demons inside him, or so he claimed when he’d been hitting the Wild Turkey, and these demons sometimes made him do things he regretted. He tried to set fire to the water tower once. When he sobered up and Brody demanded an explanation, Felix was stumped. And late on the previous New Year’s Eve, Brody had found him wandering Jewel in his long johns, his feet bare. Brody had taken him to the emergency room of the little hospital, where, because of frostbite, they’d had to amputate a couple of toes on both feet. When Brody questioned him, Felix said he couldn’t stand to be in his house any longer, not with Hannah there, crying like that. Hannah was Felix’s wife. By then, she’d been dead a dozen years. But get him off the bottle and Felix was a man who could carry his own in an intelligent conversation, and he was one hell of a chess player. That’s precisely what he and Brody were doing that afternoon when the Decoration Day parade was taking place on Main Street. Brody could hear the high school band and the cheers and the applause of those who’d gathered to watch, and now and again he heard the fire engine sirens. Later, when everything had moved to Veteran’s Park, he planned to join his brother’s family and his mother for some cold fried chicken. But at that moment, he was content to be right where he was. Hector, Brody’s golden retriever, lay on the floor not far from the men. Brody had named him for the noble hero of Troy, and when you looked into that beautiful dog’s soulful brown eyes you knew why. The sheriff was thirty-five years old, tall and lean. His hair was the color of acorns. He wasn’t handsome, not in the way of Hollywood. In fact, the Amish of the neighboring county would probably have called him very plain and meant it as a high compliment. With his queen, Brody had just checked Felix’s king and had lifted his coffee mug for a sip when the door to the jailhouse burst open and Herman Ostberg rushed in, breathless. Brody and Felix looked up from the chessboard, and Hector sprang to his feet. Ostberg was a small, excitable man. For several moments, he just stood there panting, his eyes opened impossibly wide. “Brody,” the little man managed when he finally caught his breath. “You’ll never guess.” “No,” Brody replied. “I don’t suppose I will.” “Jimmy Quinn,” Ostberg gasped. “What about Quinn?” “The catfish,” Ostberg said. Then said again, “The catfish.” Brody was a man who’d seen things in war that had inured him to the shock of normal emergencies in a place like Jewel. No one knew the details of his war experiences but they knew of the medals. To settle the little man, Brody said, “Take a deep breath, Herman, then tell me about Quinn and the catfish.” Ostberg stared at the two men, one on either side of the chessboard, tried to calm himself, and finally, as if he couldn’t quite believe his own words, said, “They ate him, Brody. They ate him right down to the bone.” Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "AN EDGAR AWARD NOMINEE In 1958, a small Minnesota town is rocked by a shocking murder, pouring fresh fuel on old grievances in this dazzling novel, an instant New York Times bestseller and “a work of art” (The Denver Post). On Memorial Day in Jewel, Minnesota, the body of wealthy landowner Jimmy Quinn is found floating in the Alabaster River, dead from a shotgun blast. The investigation falls to Sheriff Brody Dern, a highly decorated war hero who still carries the physical and emotional scars from his military service. Even before Dern has the results of the autopsy, vicious rumors begin to circulate that the killer must be Noah Bluestone, a Native American WWII veteran who has recently returned to Jewel with a Japanese wife. As suspicions and accusations mount and the town teeters on the edge of more violence, Dern struggles not only to find the truth of Quinn’s murder but also put to rest the demons from his own past. Caught up in the torrent of anger that sweeps through Jewel are a war widow and her adolescent son, the intrepid publisher of the local newspaper, an aging deputy, and a crusading female lawyer, all of whom struggle with their own tragic histories and harbor secrets that Quinn’s death threatens to expose. Both a complex, spellbinding mystery and a masterful portrait of mid-century American life that is “a novel to cherish” (Star Tribune, Minneapolis), The River We Remember offers an unflinching look at the wounds left by the wars we fight abroad and at home, a moving exploration of the ways in which we seek to heal, and a testament to the enduring power of the stories we tell about the places we call home.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10457"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Atria Books; Special Signed ED edition (September 5, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 432 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 198217921X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1982179212"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.25 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 1.2 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,108 in Books (See Top 100 in Books) #2 in Psychic Mysteries #8 in Native American Literature (Books) #182 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 9,653 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fb22122e-19ff-474a-99c6-c9c2dce135d6.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/68455475-dc60-49cf-b449-3f2e87bd0dec.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Radio Lab Listener",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECOBKAVOSBQYIOWS6Q2Q4XTA2QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HC18RI60EOWL?ASIN=198217921X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars One of Krueger's best novels",
                "reviewText": "Another very well-written novel about people that you come to care about. The setting is \"Black Earth County\" which appears to be close to be close to the actual Blue Earth MN in the southern row of MN counties. I had cousins that grew up near there and I was a young boy at the time. His recreation of that part of the state matches my own memories of my annual summer visits to my cousins.More importantly, this is a really good story with good characters who deal with their imperfect and damaged lives in different ways. But it isn't a story about pathetic damaged people. Instead it shows the dignity and courage with which some people responded to their situations. Some overcome their past, find forgiveness, and go forward with their lives. Others are overcome by their demons and wreak havoc on the lives of others they encounter. The interactions between these different kinds of people drives the story. All the characters are changed as a result.Like This Tender Land and Ordinary Grace, a river plays a central role as both a setting for the most important action, but also as a metaphor for the intertwining and changing of the lives of all the main characters. Yes, this book also has a sheriff (like the Cork O'Connor stories), but this story is less about solving the murder (which is solved in the end) than it is about the people and the choices they make and who they become as a result.I've read all the Krueger books and I would rank this in the top 20th percentile of his books.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Griffin 941",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5PRHGMGZEZAAOE4T37P3NC4IIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22UAX0EKPU2K?ASIN=198217921X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars A Beautifully Written Masterpiece",
                "reviewText": "This book is a masterpiece of glimpses into the souls of the characters and their flaws and their strengths. It demands introspection as well as a compulsion to keep reading, as it is a very interesting mystery. I haven’t found anything I dislike and as a retired psychiatrist I deeply appreciated his compassionate treatment of men harmed, both physically and mentally, by the horrors of war. A serious but profound read. Be prepared to ponder.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard B.  Schwartz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW3DUWSCRVG5OG6WYOZSID2GB7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GQYH1TT5DZZT?ASIN=198217921X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2023",
                "reviewTitle": "4.0 out of 5 stars I miss Cork.",
                "reviewText": "Recently, Kent Krueger has been writing standalones. I wish he would return to Cork O’Connor crime novels. THE RIVER WE REMEMBER is far better than the imitative and sometimes maudlin THIS TENDER LAND, but it is not crime fiction. The story begins with a death, possibly a suicide, probably a murder. For the next 400+ pp. the death is investigated, but the story is really not about the deceased; it is about the living whose lives were touched by his. WKK has said publicly that the story is not about the murder. What it is about, basically, is the effect of war on individuals, in this case, WWI, WWII and, eventually Vietnam. The story concerns redemption (but not to an exclusive degree) and it is about how individuals can be wounded by war forever. This is, in short, a mainstream novel (set in 1958 Minnesota); as such it will draw a larger audience than the Cork O’Connor series. Unfortunately, this will incent WKK to write more mainstream fiction.The writing, of course, is excellent. The setting is fully realized, most of the characters interesting, the plot engaging (though not riveting) and the themes timeless ones. The deficits are the flip side of the story’s attractiveness. The effects of war on individuals is not seldom-plowed ground; we have heard this song before. Many, many times. There is also a ticking of identity boxes, some of which are stereotypical. This politicizes the book (at least for me) and reduces my interest. There is also some unrelenting suffering. All of the women seem to have been assaulted, exploited, or forced to deal with mortal, painful diseases. The men carry dark secrets that involve failure, violence, drunkenness, and so on. For heaven’s sake, Kent, give us some comic relief or reshape the story. I get it that all men lead lives of quiet desperation, but I’d rather read about Thoreau and how he handled his challenges rather than read about the omnipresent desperation.This is all a question of sensibility, genre preferences, etc. As I said in my review of another of his mainstream/standalones, many readers will want to award six stars. I can only muster four.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wisconsin Resident",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPYJXCHE7SX7K3UDL7BEAMR25ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MEDXIXF1LMLL?ASIN=198217921X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars William Kent Krueger is a masterful writer!",
                "reviewText": "From his well known Cork O‘Connor series to his subsequent stand alone mysteries, Krueger never disappoints. I couldn’t put down his 2023 consummate page turner, The River We Remember. I also loved Ordinary Grace and This Tender Land. He captures his characters sublimely, bringing you into their minds, hearts and souls. I look forward to his next masterpiece coming out late summer, 2024.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristy C. Kowatch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUN7TG5TLWHUMRWPIDV3DZJBZBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GL53HNMRR6EK?ASIN=198217921X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Fabulous!",
                "reviewText": "Read this due to a new book club I’m attending. Fabulous book! I’m sure the discussion will be amazing, especially with the prospect of both women and men in attendance and the differing views of sentiment and emotion this book brings. I recommend this to everybody.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Ingvoldstad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJGKB5LOR26J5H42KS25DKAMJLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UCIVSEJYVTH5?ASIN=198217921X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars A brilliant story by a brilliant writer",
                "reviewText": "William Kent Krueger never disappoints. This novel is one of his best, in my opinion. The rich characters, the incredible descriptions, the engaging plot take the reader back in time to a quiet little spot in Minnesota where the reality of life in middle America in the 50s dramatically unfolds. It is a stunning read...a book you won't forget.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIHWD7J2EKQOEMMRU5KWDDET3JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TDH7JJSZ9Q3D?ASIN=198217921X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "4.0 out of 5 stars A very human hero",
                "reviewText": "As I read about Brody Dern, another man entrusted with upholding the law came to mind. This man also had things in his past that trouble him greatly. William Kent Krueger,s evocative descriptions of the countryside in which this story takes place and it's human hero brought to mind James Lee Burke and his human hero Dave Robicheaux.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}