{
    "remaining_requests": 80,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Novel-Disguise-Lady-Librarian-Mystery-ebook/dp/B0B9WJ8FFT",
    "body": {
        "name": "A Novel Disguise (A Lady Librarian Mystery)",
        "price": "$1.99",
        "originalPrice": "",
        "rawPrice": 1.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Novel-Disguise-Lady-Librarian-Mystery-ebook/dp/B0B9WJ8FFT",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71TekGnMI3L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Samantha Larsen",
            "link": "https://www.amazon.com/Samantha-Larsen/e/B0BKR1LBSK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 119,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157305011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B9WJ8FFT"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Crooked Lane Books (May 16, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 16, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 879 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 295 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1639103465"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#47,115 in Kindle Store (See Top 100 in Kindle Store) #462 in Historical Mysteries (Kindle Store) #530 in Historical Mystery #660 in Amateur Sleuth Mysteries (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 119 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCWHKVFCEWYOKILOMSHMU5U5ZFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IXG0KP2S348W?ASIN=B0B9WJ8FFT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 10, 2023",
                "reviewTitle": "5.0 out of 5 stars A fun and novel (unique) book",
                "reviewText": "I really enjoyed this book. It was a good mystery book; it had me guessing to (almost) the very end-it could have gone any number of ways (think alternate endings to the movie Clue). And I learned from the historical aspects of being a woman (not just in Britain) at that time in history.I also appreciated that there was no foul language; nudity that was referred to matter of factly, but not discussed or described in detail, as was the physical abuse talked about in the book.I hope there is a sequel so we can tie together some loose ends. Looking forward to the next book in the series!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pam Meyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGT63UQ2XPWJOQYJ3BHBFCKGPZYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YWHMU81J2ABS?ASIN=B0B9WJ8FFT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 7, 2023",
                "reviewTitle": "4.0 out of 5 stars A quick, fun read.",
                "reviewText": "A quick, fun read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monkey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLY6RY4BTAIJHWRRUYBZSJ3QD2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29QCME1BWJNM4?ASIN=B0B9WJ8FFT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Just one word.....GREAT 🤩",
                "reviewText": "From the first page this book had me hooked. Great mystery, great characters, great historical fiction with accurate depictions of the times!Tiffany was desperate when she masqueraded as her brother and soon got involved in a murder that may have ties back to her family!🙀Playing two persons at once gets harder and harder for her and I was on the edge of my seat waiting for the other shoe to drop and dying to know what would happen!The book also address issues or prejudice, racism, sexism, abuse, slavery, infidelity, women's right, and the law within the story. It was all so well done and I applaud the author 👏👏This is a must buy for me now and I can't wait to start book 2 😍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ex-Pat Brit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBMPQZPDAK7FX3SKGZRWISYBDSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EMFUFMASFK6K?ASIN=B0B9WJ8FFT",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "3.0 out of 5 stars Ok anachronistic murder mystery",
                "reviewText": "Interesting backdrop. Not sure how this got four and five star reviews.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MeezCarrie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY7USF434IMJ6KE5UHIDI2LKIBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KYC9YNXR0BPK?ASIN=B0B9WJ8FFT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 24, 2023",
                "reviewTitle": "5.0 out of 5 stars fun & original - unlike any other cozy mystery I've read",
                "reviewText": "4.5 stars“Of all the ridiculous predicaments to find herself in.”What a fun & original historical cozy! It’s unlike any cozy I’ve read to date, and the author’s charming writing voice immediately drew me into the story world and its characters. Murder, secrets, and books abound, and the English village setting is perfect for the drama that plays out on its pages.We meet Tiffany right away, a spinster celebrating her 40th birthday in a most unique way – by burying her odious and recently-deceased half brother in the back yard of their cottage and concocting a desperate plan to keep him alive. Because if Uriah doesn’t appear to be dead, then Tiffany can stay in the home she loves and not be left to the community’s mercy – with the added bonus of being out from under his oppressive control. Luckily, she could pass as his twin, in appearance and mannerisms, so it’s merely a matter of dressing in his clothes & wig and showing up for his job as the Duke’s librarian – the dream job for someone who loves books as much as Tiffany does! Sounds simple enough, right? Yeah… well… “what a tangled web” and all that. Cue some comedic tight spots for our intrepid heroine, but also be prepared for your heart to swell as Tiffany tastes freedom for the first time in years.I loved the layered exploration of prejudice and injustice, not only toward women in that time period but also by race and by class. It doesn’t bog down the story or turn it into a treatise on rights. Rather, it lends authenticity to the plot, lightly turns the mirror toward society then and now, and provides a framework for the main narrative – namely, that of murder and mystery. You see, it’s not long before Tiffany is both falling in love with the local bookseller and entangled in a murder mystery – either of which could unravel her dual identity with dire rapidity. I enjoyed watching her navigate these obstacles, juggle being two people at once, and solve at least one murder just as much as I loved the spark of a possible romance between Samir and Tiffany for future books (what did he want to say there at the end? I must know!).Bottom Line: A Novel Disguise by Samantha Larsen thoroughly entertained me from beginning to end, and I wasn’t yet ready for it to be over when I turned the final page. In fact, I hope that it’s the first of many books to come in this series. While the murder mystery and a couple of other subplots are neatly tied up by the end, the author has also done a fabulous job of setting the stage for Tiffany’s life from this point forward and I’m dying (bad pun) to see where she takes it. There are also a couple of ramifications from the way things ended here that make me curious to see how they affect her further down the road. The mystery itself is cleverly presented, and I didn’t start to put the actual pieces together until about the same time that Tiffany did. Most of all, I loved watching her breathe in her newfound freedom even despite her need for subterfuge, and I really loved that she continued to think of others in the process.(I voluntarily reviewed a complimentary copy of this book)",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnnieB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHS7O4ONEBZLCU7YLOSLSV72N2IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ABY28D3STUKP?ASIN=B0B9WJ8FFT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2023",
                "reviewTitle": "4.0 out of 5 stars Well written historical cozy mystery",
                "reviewText": "A Novel Disguise is the first book in a new historical cozy mystery series by Samantha Larsen. Released 16th May 2023 by Crooked Lane, it's 320 pages and is available in paperback, audio, and ebook formats. It's worth noting that the ebook format has a handy interactive table of contents as well as interactive links and references throughout.This is a charming historical cozy with an appealing protagonist who employs creative intelligent solutions to counteract some of the harsher realities of Regency history (women often lived lives of tenuous and terrifying insecurity). She's smart and honest (mostly) and clever as well, and generally appealing.The book is well written and the author has a firm grasp on the nuts and bolts of plot, setting, and characterization. It's a light cozy with a strong romance subplot and a surprising amount of effective humor. It's a bookish book, and there are book titles and period book/library trivia and title-dropping throughout. Eagle eyed readers might spot an anachronism, but I found no glaring errors.Four stars. The second book in the series, Once Upon A Murder, is due out first quarter 2024 from the same publisher.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}