{
    "remaining_requests": 37,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wish-You-Were-Here-Novel/dp/1984818430",
    "body": {
        "name": "Wish You Were Here: A Novel",
        "price": "$13.40$13.40",
        "originalPrice": "",
        "rawPrice": 13.4,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wish-You-Were-Here-Novel/dp/1984818430",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/713QEnfk9oL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jodi Picoult",
            "link": "https://www.amazon.com/Jodi-Picoult/e/B000AP7PGM/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "BooktownSolLLC",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 46298,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Stealthily surprising and very moving . . . absolutely a must-read.”—Booklist (starred review) “A satisfying and thought-provoking narrative.”—Minneapolis Star Tribune“Jodi Picoult once again proves she is the master of wading through the darkness to find the light.”—Taylor Jenkins Reid, New York Times bestselling author of Malibu Rising“Wish You Were Here is a transporting and transcendent novel about seeking out glimmers of light in the darkness, and following them wherever they lead. Jodi Picoult is that rare, one-in-a-million writer whose books both squeeze your heart and expand your mind. Her latest is wise, surprising, and utterly extraordinary.”⁠—Emily Henry, #1 New York Times bestselling author of People We Meet on Vacation and Beach Read“In Wish You Were Here, Jodi Picoult does something brilliant, cracking open something extraordinary. I am just overwhelmed by this book. I actually finished it at three in the morning and started reading it again.”⁠—Caroline Leavitt, New York Times bestselling author of With or Without You About the Author Jodi Picoult is the #1 New York Times bestselling author of twenty-seven novels, including The Book of Two Ways, A Spark of Light, Small Great Things, Leaving Time, The Storyteller, Lone Wolf, Sing You Home, House Rules, Handle with Care, Change of Heart, and My Sister's Keeper, and, with daughter Samantha van Leer, two young adult novels, Between the Lines and Off the Page. Picoult lives in New Hampshire. Excerpt. © Reprinted by permission. All rights reserved. OneMarch 13, 2020When I was six years old, I painted a corner of the sky. My father was working as a conservator, one of a handful restoring the zodiac ceiling on the main hall of Grand Central Terminal—an aqua sky strung with shimmering constellations. It was late, way past my bedtime, but my father took me to work because my mother—as usual—was not home.He helped me carefully climb the scaffolding, where I watched him working on a cleaned patch of the turquoise paint. I looked at the stars representing the smear of the Milky Way, the golden wings of Pegasus, Orion’s raised club, the twisted fish of Pisces. The original mural had been painted in 1913, my father told me. Roof leaks damaged the plaster, and in 1944, it had been replicated on panels that were attached to the arched ceiling. The original plan had been to remove the boards for restoration, but they contained asbestos, and so the conservators left them in place, and went to work with cotton swabs and cleaning solution, erasing decades of pollutants.They uncovered history. Signatures and inside jokes and notes left behind by the original artists were revealed, tucked in among the constellations. There were dates commemorating weddings, and the end of World War II. There were names of soldiers. The birth of twins was recorded near Gemini.An error had been made by the original artists, so that the painted zodiac was reversed from the way it would appear in the night sky. Instead of correcting it, though, my father was diligently reinforcing the error. That night, he was working on a small square of space, gilding stars. He had already painted over the tiny yellow dots with adhesive. He covered these with a piece of gold leaf, light as breath. Then he turned to me. “Diana,” he said, holding out his hand, and I climbed up in front of him, caged by the safety of his body. He handed me a brush to sweep over the foil, fixing it in place. He showed me how to gently rub at it with my thumb, so that the galaxy he’d created was all that remained.When all the work was finished, the conservators kept a small dark spot in the northwest corner of Grand Central Terminal, where the pale blue ceiling meets the marble wall. This nine-by-five-inch section was left that way intentionally. My father told me that conservators do that, in case historians need to study the original composition. The only way you can tell how far you’ve come is to know where you started.Every time I’m in Grand Central Terminal, I think about my father. Of how we left that night, hand in hand, our palms glittering like we had stolen the stars.It is Friday the thirteenth, so I should know better. Getting from Sotheby’s, on the Upper East Side, to the Ansonia, on the Upper West Side, means taking the Q train to Times Square and then the 1 uptown, so I have to travel in the wrong direction before I start going in the right one.I hate going backward.Normally I would walk across Central Park, but I am wearing a new pair of shoes that are rubbing a blister on my heel, shoes I never would have worn if I’d known that I was going to be summoned by Kitomi Ito. So instead, I find myself on public transit. But something’s off, and it takes me a moment to figure out what.It’s quiet. Usually, I have to fight my way through tourists who are listening to someone singing for coins, or a violin quartet. Today, though, the atrium is empty.Last night Broadway theaters had shut down performances for a month, after an usher tested positive for Covid, out of an abundance of caution. That’s what Finn said, anyway—New York–Presbyterian, where he is a resident, has not seen the influx of coronavirus cases that are appearing in Washington State and Italy and France. There were only nineteen cases in the city, Finn told me last night as we watched the news, when I wondered out loud if we should start panicking yet. “Wash your hands and don’t touch your face,” he told me. “It’s going to be fine.”The uptown subway is nearly empty, too. I get off at Seventy-second and emerge aboveground, blinking like a mole, walking at a brisk New Yorker clip. The Ansonia, in all its glory, rises up like an angry djinn, defiantly jutting its Beaux Arts chin at the sky. For a moment, I just stand on the sidewalk, looking up at its mansard roof and its lazy sprawl from Seventy-third to Seventy-fourth Street. There’s a North Face and an American Apparel at ground level, but it wasn’t always this bougie. Kitomi told me that when she and Sam Pride moved in in the seventies, the building was overrun with psychics and mediums, and housed a swingers’ club with an orgy room and an open bar and buffet. Sam and I, she said, would stop in at least once a week.I was not alive when Sam’s band, the Nightjars, was formed by Sam and his co-songwriter, William Punt, with two school chums from Slough, England. Nor was I when their first album spent thirty weeks on the Billboard charts, or when their little British quartet went on The Ed Sullivan Show and ignited a stampede of screaming American girls. Not when Sam married Kitomi Ito ten years later or when the band broke up, months after their final album was released featuring cover art of Kitomi and Sam naked, mirroring the figures in a painting that hung behind their bed. And I wasn’t alive when Sam was murdered three years later, on the steps of this very building, stabbed in the throat by a mentally ill man who recognized him from that iconic album cover.But like everyone else on the planet, I know the whole story.The doorman at the Ansonia smiles politely at me; the concierge looks up as I approach. “I’m here to see Kitomi Ito,” I say coolly, pushing my license across the desk to her.“She’s expecting you,” the concierge answers. “Floor—”“Eighteen. I know.”Lots of celebrities have lived at the Ansonia—from Babe Ruth to Theodore Dreiser to Toscanini to Natalie Portman—but arguably, Kitomi and Sam Pride are the most famous. If my husband had been murdered on the front steps of my apartment building, I might not have stayed for another thirty years, but that’s just me. And anyway, Kitomi is finally moving now, which is why the world’s most infamous rock widow has my number in her cellphone.What is my life, I think, as I lean against the back wall of the elevator.When I was young, and people asked what I wanted to do when I grew up, I had a whole plan. I wanted to be securely on a path to my career, to get married by thirty, to finish having kids by thirty-five. I wanted to speak fluent French and have traveled cross-country on Route 66. My father had laughed at my checklist. You, he told me, are definitely your mother’s daughter.I did not take that as a compliment.Also, for the record, I’m perfectly on track. I am an associate specialist at Sotheby’s—Sotheby’s!—and Eva, my boss, has hinted in all ways possible that after the auction of Kitomi’s painting I will likely be promoted. I am not engaged, but when I ran out of clean socks last weekend and went to scrounge for a pair of Finn’s, I found a ring hidden in the back of his underwear drawer. We leave tomorrow on vacation and Finn’s going to pop the question there. I’m so sure of it that I got a manicure today instead of eating lunch.And I’m twenty-nine.The door to the elevator opens directly into Kitomi’s foyer, all black and white marble squares like a giant chessboard. She comes into the entryway, dressed in jeans and combat boots and a pink silk bathrobe, with a thatch of white hair and the purple heart-shaped spectacles for which she is known. She has always reminded me of a wren, light and hollow-boned. I think of how Kitomi’s black hair went white overnight with grief after Sam was murdered. I think of the photographs of her on the sidewalk, gasping for air.“Diana!” she says, as if we are old friends.There is a brief awkwardness as I instinctively put my hand out to take hers and then remember that is not a thing we are doing anymore and instead just give a weird little wave. “Hi, Kitomi,” I say.“I’m so glad you could come today.”“It’s not a problem. There are a lot of sellers who want to make sure the paperwork is handed over personally.”Over her shoulder, at the end of a long hallway, I can see it—the Toulouse-Lautrec painting that is the entire reason I know Kitomi Ito. She sees my eyes dart toward it and her mouth tugs into a smile.“I can’t help it,” I say. “I never get tired of seeing it.”A strange flicker crosses Kitomi’s face. “Then let’s get you a better view,” she replies, and she leads me deeper into her home. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 12 hrs 55 mins",
            "FREE delivery February 29 - March 6 on orders shipped by Amazon over $35",
            "Or fastest delivery February 28 - March 1",
            "FREE pickup February 24 - 26 on orders shipped by Amazon over $35",
            "Or fastest pickup Friday, February 23"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 NEW YORK TIMES BESTSELLER • From the author of Small Great Things and The Book of Two Ways comes “a powerfully evocative story of resilience and the triumph of the human spirit” (Taylor Jenkins Reid, author of The Seven Husbands of Evelyn Hugo and Daisy Jones & The Six)Rights sold to Netflix for adaptation as a feature film • Named one of the best books of the year by She ReadsDiana O’Toole is perfectly on track. She will be married by thirty, done having kids by thirty-five, and move out to the New York City suburbs, all while climbing the professional ladder in the cutthroat art auction world. She’s an associate specialist at Sotheby’s now, but her boss has hinted at a promotion if she can close a deal with a high-profile client. She’s not engaged just yet, but she knows her boyfriend, Finn, a surgical resident, is about to propose on their romantic getaway to the Galápagos—days before her thirtieth birthday. Right on time.But then a virus that felt worlds away has appeared in the city, and on the eve of their departure, Finn breaks the news: It’s all hands on deck at the hospital. He has to stay behind. You should still go, he assures her, since it would be a shame for all of their nonrefundable trip to go to waste. And so, reluctantly, she goes.Almost immediately, Diana’s dream vacation goes awry. Her luggage is lost, the Wi-Fi is nearly nonexistent, and the hotel they’d booked is shut down due to the pandemic. In fact, the whole island is now under quarantine, and she is stranded until the borders reopen. Completely isolated, she must venture beyond her comfort zone. Slowly, she carves out a connection with a local family when a teenager with a secret opens up to Diana, despite her father’s suspicion of outsiders.In the Galápagos Islands, where Darwin’s theory of evolution by natural selection was formed, Diana finds herself examining her relationships, her choices, and herself—and wondering if when she goes home, she too will have evolved into someone completely different.This edition contains a short story, discussion questions, and an excerpt from Jodi Picoult’s next novel.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Ballantine Books (June 14, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1984818430"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1984818430"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.82 x 8.3 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,719 in Books (See Top 100 in Books) #220 in Contemporary Women Fiction #224 in Women's Domestic Life Fiction #382 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 46,298 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Barbara Lincoln",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4RVIOGYGPMQCF7JTWFCWMKEHBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23A1ZNJJJAR34?ASIN=1984818430",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars A Fabulous Read ! Tissue box required !",
                "reviewText": "Ms Picoult perfectly captured the fears, challenges and real dangers of the pandemic. My wife had a Zars type of pneumonia in 2014, and spent 28 days in a medically induced coma, intubated the entire time. She spent another 5 weeks in a rehabilitation hospital and required a small army of home care specialists for many months. Near death she was proned after the first week and then many times throughout her induced coma. There is no question that proning was the key to her survival ! Which her doctors described as a miracle !Her dreams throughout her nightmare were many and as real and vivid as Ms Picoult so expertly described. For years, during and after her recovery, she would question me intensely, “are you sure that this or that didn’t happen” or, “surely so and so did this and that” and so very many other questions Re her extremely lucid memories of a myriad of things that she was positive happened, but did not !My wife was emotionally stunned and delighted with Ms Picoult,s imagery of how shockingly real her narratives described the life that she lived in her mind for 28 days. I would love to see the movie version.A very sincere thank you Jodi Picoult.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXG3J7FM4LTYPSWTDN3VDKZVJWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29AAA5K8ODRPQ?ASIN=1984818430",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "4.0 out of 5 stars Unique Twist",
                "reviewText": "Unique plot twist that I wasn't expecting which was nice . Overall a good book, just not one of my favorites.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pamm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIWF4Z2QHSK7ULJ4ACNALUX7FWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6RO2AZAZ1WW4?ASIN=1984818430",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Could not put this book down",
                "reviewText": "The twist in the story had me in a tailspin. Fantastic story. Really made me stop and think about life",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cerbyman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOM7JV6VWZEVOEPMESYJB3AOVRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XBKAPY8B1QOK?ASIN=1984818430",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars this is not a book about Covid",
                "reviewText": "This book is way more than a story about a pandemic. It’s about life and goals, love and loss and learning to pivot when your plans go wrong or don’t make sense. Another great read by Jody Picoult",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gogal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKMOMGL34LZLNZVIPVZFZH3SUHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VWOTWD8ERGE7?ASIN=1984818430",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 28, 2022",
                "reviewTitle": "3.0 out of 5 stars Ouch.",
                "reviewText": "I haven't finished this book and I probably won't. I feel I've gone far enough (just over halfway) to competently write about why I am not going to bother and why I am so annoyed. Sorry to the author but she can withstand some negative reviews I'm sure. First, I am a fan of the author. Some of her books, a lot actually, are just terrific reads. I wanted to read this because I can't think of anything more compelling than writing about the horrific pandemic we are all enduring. But what a let down. I expected more from this author. This felt contrived and as though social credibility boxes were being ticked off, one by one (Halal?) which is really just an aside so I won't even bother with more of that. First major annoyance: The obvious Yoko Ono character - seriously? Was that intentional? Bizarre. But, ok, never mind all that. What about the read and the main characters? Credit where die: I thought she did a good job portraying what it must have been like to be a healthcare worker in NYC and maybe that's where this book should have focused straight through. Perhaps it even did later but I couldn't suffer one more minute with the main character frankly, a woman who was stupid enough to walk in the opposite direction of everyone else leaving an island during the pandemic. Really? Then, as she received emails from her boyfriend, the doctor in NY who was in serious psychological anguish and horror and physical danger working the front lines of Covid, she never seemed particularly moved by what he was going through but instead writing him about turtles in the Galapagos. Hello, anyone home? Did she ever acknowledge the hellscape he was living in? I didn't notice if she did. I would have rowed home if that were my boyfriend but no, she wasn't horrified apparently. Just angry he pushed her to go but not really meaning it. Meanwhile, she's falling for another man who of course understands life so much better than anyone else because he lives it simply on an island, far from the trappings of superficiality in America. Ugh. Why is this theme repeated in so many books? So predictable. Gruff man with sensitive heart. Yawn. I just couldn't go on. The main character and her hosts on the island were so unoriginal it was brutal - the brooding but sensitive Gabriel, the lonely and misunderstood daughter, and the grandmother with the ever present food...ugh, ugh, ugh. And again, the woman with her life mapped out who finds meaning finally when she communes with nature and brooding men. So sorry, hate to trash a book. There was nothing wrong with the writing on a mechanical level and I wouldn't expect there to be. The author is a terrific writer hence her success. But it would have been nice to see the main character a bit more alarmed and unnerved while her boyfriend suffered at home then her tiptoeing through the tulips thousands of miles away, contemplating her navel and lusting over moody man. I couldn't stand the main character. That's a problem.",
                "reviewVotes": "80 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GL Robinson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIVREHNKJCSLUPPPTROHOUBGK2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JX88DK9TNEJJ?ASIN=1984818430",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2023",
                "reviewTitle": "4.0 out of 5 stars A Different Read",
                "reviewText": "This is ostensibly a Covid story. A young woman gets the virus and nearly dies, but while she's unconscious she lives a whole different existence. When she recovers, she finds she prefers the dreamed experience to her real life.Picoult uses this vehicle to recount the very real and terrible effects of Covid in New York City beginning with the chaos and lack of understanding that characterised it. But it also gives her an opportunity to examine the nature of reality and our perception of time.I have given the book a 4 because at times I felt the research needed to write the book came across as an info dump rather than emerging organically. And I found the chief character, Diana, unconvincingly drawn and hard to like. She seemed more a collection of traits than a real person. She's a business woman, an artist, a teacher, a counselor... but very unkind to the man who stands by her when she's ill.Picault is very good at taking social issues and turning them into very readable novels. I don't think this is her best, but she's an accomplished writer and always tells a good story.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robin K Cox",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQER7H4K5UU4Y7RMGGJ6BMKG7NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RK1VT6KGZPU2?ASIN=1984818430",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Book Club Read",
                "reviewText": "Not a fictional reader, but joined book club and this was their choice. Very descriptive and I felt like I was on this journey. Although I predicted the end of the book before the first chapter, it was a very good read. Good quality of book cover and pages.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NH Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEFUMDRF2PG4IKCPNN35SLDL2KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EGHZTR87GI8V?ASIN=1984818430",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderful writer - great stories",
                "reviewText": "I have read every one of Jodi’s books. I really enjoy that they are based on actual events that happened that impacted Americans so greatly. She takes difficult situations and clearly shows the impact these situations had on so many different people in different situations. A fabulous writer!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Catarí",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 13, 2024",
                "reviewTitle": "Interesante y original forma de dejar una memoria acerca del COVID",
                "reviewText": "Al principio no me gustó, incluso me aburrió, pensé que era una novela americana gastada, lo mismo, lo mismo, hasta la imaginaba en película de Hollywood. Después ya pude ver mejor la intención de la autora y me pareció una interesante forma de rescatar las difíciles experiencias vividas durante la pandemia, de las cuales en lo personal viví y siempre quedé con muchas dudas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cathy H.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 27, 2023",
                "reviewTitle": "Brilliant. Very cleverly written",
                "reviewText": "This book took my breath away. The story is so good and complex. Genius. The only one I have ever read of this kind.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrittika",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 16, 2023",
                "reviewTitle": "A surprisingly refreshing read",
                "reviewText": "My first read of 2023 and a fresh plot with a completely new and different twist.Left me wanting for more when the narration ended.A 5star rating from me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on October 17, 2022",
                "reviewTitle": "Amazing",
                "reviewText": "Meraviglioso",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "irenereads",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 21, 2022",
                "reviewTitle": "One of the best novels in a long time",
                "reviewText": "There are books you don't just read but devour and want to crawl into. Books that make you forget to eat and drink, that make you forget time and place and leave you breathless. \"Wish You Were Here\" by Jodi Picoult is such a book. I can say from my deepest heart that this book is definitely going to be one of the best books I have read in a long time.Plot:Diana O'Toole has it all: A handsome and successful boyfriend, a promising career at Sotheby's and all her future life goals already mapped out, like being married at 30, having two kids at 35 while at the same time climbing the professional ladder in the art auction world. What is more, she is convinced that Finn, her boyfriend, is going to propose to her on their upcoming trip to the Galápagos Islands.But then Covid19 comes along. Finn, a surgical resident, has to stay behind at the hospital but urges Diana to make the trip alone.The moment Diana arrives at theGalápagos Islands, the whole place is put under quarantine. Everything is shut down and she needs the help of a local family to find a place to stay. Stripped of almost everything - her luggage got lost and she's running out of money - she explores the beauty of the islands and meets people who will change her forever. Suddenly she starts questioning everything that has seemed so important to her, and she wonders if she will be a completely different person when she goes back home again.Well, and then a plot twist comes along that really left me speechless. I didn't see it coming and I couldn't have seen it coming. I'm not going to say anything more about it, just this: Please read this book!!!!!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$12.98",
                "sellerName": "BooktownSolLLC",
                "sellerRating": "5"
            },
            {
                "price": "$12.99",
                "sellerName": "Carpe Diem Commerce",
                "sellerRating": "4"
            },
            {
                "price": "$13.18",
                "sellerName": "The Gigantic Book Vault",
                "sellerRating": "4.5"
            }
        ]
    }
}