{
    "remaining_requests": 100,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Last-Thing-He-Told-Me/dp/1501171356",
    "body": {
        "name": "The Last Thing He Told Me: A Novel",
        "price": "$11.25 $7.67",
        "originalPrice": "$17.99",
        "rawPrice": 11.25,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Last-Thing-He-Told-Me/dp/1501171356",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81E93DlDIxL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Laura Dave",
            "link": "https://www.amazon.com/Laura-Dave/e/B001ILME68/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Jenson Books Inc and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 150261,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review #1 New York Times Bestseller“What starts as an intimate meditation on found families deftly turns into a heart-pounding mystery reminiscent of the best true crime stories. But both work so beautifully in this gripping, perfectly-paced novel. I dare you to stop reading.” —Susie Yang, New York Times bestselling author of White Ivy“Laura Dave is a master story-teller. Gripping, big-hearted and twisty, The Last Thing He Told Me grabs readers from the very first page and never lets go.” —Greer Hendricks,New York Times best-selling co-author of The Wife Between Us and You Are Not Alone\"With dizzying suspense and gorgeous prose, The Last Thing He Told Me tackles tough questions about trust, marriage and what it means to be a family. A page-turner of the highest order.\" —Riley Sager, New York Times bestselling author of Home Before Dark“Laura Dave's The Last Thing He Told Me is a thrilling roller coaster of a novel. This smart, intimate exploration of love and family is the foundation of a beautifully constructed mystery filled with twists and turns. A must-read.” —Jean Kwok,New York Times bestselling author of Searching for Sylvie Lee“Dave pulls off something that feels both new and familiar: a novel of domestic suspense that unnerves, then reassures. This is the antithesis of the way novels like Gone Girl or My Lovely Wife are constructed; in The Last Thing He Told Me, the surface is ugly, the situation disturbing, but almost everyone involved is basically good underneath it all. Dave has given readers what many people crave right now—a thoroughly engrossing yet comforting distraction.” —BookPage“A page turner.” —Associated Press“The Last Thing He Told Me by Laura Dave is a fast-moving, heartfelt thriller about the sacrifices we make for the people we love most.” —Real Simple“Light and bright, despite its edgy plot.” —Vogue“Gripping.” —Entertainment Weekly“Page-turning, exhilarating, and unforgettable.” —PopSugar\"Dave’s neat trick is to unveil revelations at a brisk clip that does not overwhelm character development. The novel’s richness comes from the way Hannah and Bailey realize they need each other in the face of staggering loss; the mutual trust that grows between them is genuinely moving. As both daughter and stepmother come to realize, “That’s how you fill in the blanks — with stories and memories from the people who love you.” —The New York Times Book Review\"You will not think that this is Laura’s first suspense novel as it's so sharp and well done.\" —Book Reporter“Mysteries unspool at a steady pace… riveting.” —Publisher’s Weekly\"A stunner with a heart and an ending you'll never see coming.\" —AARP Bulletin“Fast-paced ...but heartfelt.\" —The New York Times, \"Inside the Best-Seller List\" About the Author Laura Dave is the #1 New York Times bestselling author of The Last Thing He Told Me, Eight Hundred Grapes, and other novels. Her books have been published in thirty-eight countries and have been chosen by Reese Witherspoon’s Book Club, Book of the Month Club, and the Richard and Judy Book Club. The Last Thing He Told Me was chosen as the Goodreads Mystery & Thriller of the Year for 2021. It is now a limited series on Apple TV+, cocreated by Laura. She resides in Santa Monica, California."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 5 hrs 6 mins",
            "FREE delivery February 28 - March 2 on orders shipped by Amazon over $35",
            "Or fastest delivery February 26 - 28"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Don’t miss the #1 New York Times bestselling blockbuster and Reese Witherspoon Book Club Pick that’s sold over 2 million copies–now an Apple TV+ limited series starring Jennifer Garner! The “page-turning, exhilarating” (PopSugar) and “heartfelt thriller” (Real Simple) about a woman who thinks she’s found the love of her life—until he disappears.Before Owen Michaels disappears, he smuggles a note to his beloved wife of one year: Protect her. Despite her confusion and fear, Hannah Hall knows exactly to whom the note refers—Owen’s sixteen-year-old daughter, Bailey. Bailey, who lost her mother tragically as a child. Bailey, who wants absolutely nothing to do with her new stepmother. As Hannah’s increasingly desperate calls to Owen go unanswered, as the FBI arrests Owen’s boss, as a US marshal and federal agents arrive at her Sausalito home unannounced, Hannah quickly realizes her husband isn’t who he said he was. And that Bailey just may hold the key to figuring out Owen’s true identity—and why he really disappeared. Hannah and Bailey set out to discover the truth. But as they start putting together the pieces of Owen’s past, they soon realize they’re also building a new future—one neither of them could have anticipated. With its breakneck pacing, dizzying plot twists, and evocative family drama, The Last Thing He Told Me is a “page-turning, exhilarating, and unforgettable” (PopSugar) suspense novel.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ S&S/ Marysue Rucci Books (March 21, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1501171356"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1501171352"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1.2 x 8.38 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,050 in Books (See Top 100 in Books) #67 in Family Life Fiction (Books) #108 in Women's Domestic Life Fiction #311 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 150,261 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Last Thing He Told Me Eight Hundred Grapes Hello, Sunshine ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aecbb75f-9d72-479c-a330-e725bc7fecdb.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90347cf4-44f0-4a73-9981-8de84d832a92.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9765141d-9e92-40ba-9b60-7bae531b879a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bba2b2f3-3040-41cc-b5f1-80efd7ae0f71.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8bc8644e-2a6c-409a-8f19-8def8f084ddc.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/24124737-1913-469c-b45d-c9199e690018.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2def378-0486-4cc5-9a11-718607be5d2e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f0cb01c-9cb3-4ed5-b790-bcd94ac5ab58.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2f6933c6-7273-46b4-a0d9-b2280c7ce15f.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8a91ef54-b6fb-4834-a62b-ae90c631945d.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1406d182-94f8-41e2-bd3a-17eb1bba2983.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Patti D C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3IDHUAJLT7IGO5EGWFDOYDRSGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16OSU0Z3MVS8P?ASIN=1501171356",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Unique, suspenseful and touching",
                "reviewText": "This beautifully written novel is one of a kind. Dave's character development skills are superb, and she draws you into each character's personality flawlessly, inviting sympathy and empathy. Suspense is the rule throughout the book as the plot wriggles here and there, landing in a perfect 10 dismount denouement. I highly recommend this book!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kirker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDY4IMKGHNNZ733IIKM5U27W2UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5CU8GW4VLBGZ?ASIN=1501171356",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 29, 2023",
                "reviewTitle": "4.0 out of 5 stars A solid read, but the devil's REALLY in the details.",
                "reviewText": "I bought this book after watching the limited series of it on Apple TV+, for two reasons: the series received surprisingly mixed reviews for a novel hot enough to incite a bidding war over it – and I wanted to see if I could diagnose, if possible, how it ended up partially derailed – and, in an admittedly odd coincidence, I'm from Austin and have lived in NYC and the Bay Area, the three main settings in each iteration. I'll focus on that since plenty of others have covered its other elements.Given Dave's superlative plotting and prose, and the emphasis throughout the novel placed on divining the meaning of exceptionally specific details, I was frankly taken aback by the lack of detail specific to Austin – or, rather, the lack of *accurate* detail. Her description of the University of Texas campus is accurate, as is one for an renowned 24-hour cafe. (Well, formerly 24 hours: they started closed at 10pm after their post-Covid reopening due to a lack of staff, but I assume Dave finished the novel before the pandemic.) The rest is surprisingly sloppy, and almost made me think I'd somehow purchased an early, unfinished draft. (I was startled to see a mistaken reference to Ethan in the first part of the book, set in Sausalito, for starters.)After arriving in Austin, Hannah & Bailey check into a hotel near Lady Bird Lake, one which Dave places on the south side of the Congress Avenue Bridge (its correct name) – except she subsequently refers to it as the South Congress Bridge AND the Congress Street Bridge. (This for the same bridge, keep in mind.) She correctly cites its bats – it houses the largest urban bat colony on Earth – but mentions seeing \"hundreds and hundreds\" of them.The bat colony has 1.5 MILLION bats, not \"hundreds.\" Nitpicky? Sure, but the entire *novel* is an exercise in a form of nitpicking: sorting through all the tiny clues to divine what happened to Owen, and as it turns out divining Bailey's past while they're at it.A few references make it sound like Dave's never been to Austin, period. She references \"the lake muted outside the car windows\" near the end, the problem being that the lake in question can't be seen from the road at all. (It's a manmade reservoir in the Hill Country – another Dave error btw (she refers to it as \"Texas Hill Country,\" without the \"the\" – kinda the opposite of L.A. screenwriters who refers to freeways as \"the 101\" or \"the 10,\" when in Texas I-35 is just called \"35.\") Hannah's hotel has a jampacked bar at 10am on a weekday; even the SXSW festival isn't *that* rowdy! And Downtown Austin is supposedly \"lined with packed sidewalk cafes\" – again, on weekdays: this wasn't true even *before* Covid, and isn't true today.Another road error: near the end, out near the lake, they drive onto \"Ranch Road.\" Dave should've done more homework on Texas's admittedly unique road-naming conventions. Texas has Ranch Roads (RRs). It also has Farm-to-Market Roads (FMs) and Ranch-to-Market Roads (RMs). It does not have *a* \"Ranch Road,\" sans number. (Texas has over 3,500 FM / RR / RM roadways.) The only RR near an Austin-area lake is Ranch Road 620, which everyone calls 620 and absolutely no one calls \"Ranch Road\" (or even \"Ranch Road 620\" - it's just \"620\").Going briefly to New York: Hannah's studio and shop are in SoHo. If she was a trust-fund brat who could afford $50,000-a-month retail rents, that'd be one thing, but we know she's not. Unfortunately Laura Dave apparently doesn't know that the SoHo art scene peaked in the '80s and was largely gentrified out of existence 20+ years ago; the upscale galleries are in West Chelsea, but Hannah's studio would more realistically be somewhere like Bushwick or Bed-Stuy. (Almost no galleries rely on foot traffic for any real business nowadays; it's all online.)Switching back to the Bay Area: Dave admittedly does Sausalito justice. It's a gorgeous and slightly bizarre area – permanent houseboats aren't exactly commonplace in the US! – but Dave unfortunately derails a bit when the characters venture beyond it. Again, it's the nitpicky details: instead of much-closer SFO or Oakland, Hannah & Bailey fly to Austin out of San Jose. (Even Santa Rosa would be closer than San Jose!) Almost every scene in San Francisco is set in or across from the Ferry Building, as if it's the only thing aside from cable cars that non-locals would know about.Onto a slightly more touchy subject: the characters in the book are EXTREMELY white. And heterosexual. In San Francisco. (The series wisely fixed this bit, turning Hannah's BFF Jules gay and Bailey's boyfriend Asian-American, plus Grady is Latino in it.) There's only a single person of color even referenced, but they don't have an active role in the plot and I can't say anything about said person without spoilers.Okay, screw it: I think I need to delve into the spoilers...******************SPOILER ALERT! YOU'VE BEEN WARNED!******************When I started watching the TV series, it was obvious in the first episode that Owen left for reasons wholly separate from everything going on at work. I *literally* said to my family – jokingly, or so I thought – that the most totally cliche & ridiculous explanation would be him running from the mob.<facepalm>The mafia. IN TEXAS?!? I realize it's fiction, but the drug trade in the Southwest US has been entirely under Mexican-cartel control for a VERY long time, particularly in Texas itself. And speaking of fiction, the book's suggestion that Bailey's mom was killed because she was clerking for a \"Texas Supreme Court judge\" – another error (they're justices, not judges) – who was a far-leftist (!!) about to somehow singlehandedly issue a ruling that would ruin Big Oil (?!?), and she was murdered to \"send a message.\"In a book that already requires substantial suspension of disbelief, this is the single most ridiculous notion proffered. Texas is the energy capital of the world. Its state supreme court is 100% Republican – and like the U.S. Supreme Court, it has nine justices, and no single one of them can do jack by themselves – and even when it wasn't, it never issued any rulings that negatively impacted the oil-and-gas-industry in any substantive way. The entire *point* of the so-called \"Texas miracle\" (its strong economy) is predicated on essentially *zero* oversight (or as close to it as possible) of the oil industry.I get that the point of this tale was to humanize Nicholas, despite Hannah already knowing he's a monster, and to further amplify the novel's core point about truly knowing people, but I thought it was extraneous & distracting, especially given its level of absurdity in the context of actual Texas life. (Also, Nicholas is the one who uses the term \"Texas Supreme Court judges.\" A real Texas lawyer, and certainly one of his level of renown, would know they're justices.)And yet, despite all my complaining, I enjoyed the book and did a speed-read of it in under 48 hours. (Seriously!) As I'd expect from any novel optioned by Hello Sunshine, it has exceptionally strong, well-written female characters, all of whom readily pass the Bechdel test (despite the story, at least at the surface level, focusing on finding a man two women desperately miss). Even after seeing it shown on TV, I was surprised to see a reference as specific as UT's Perry-Castañeda Library (PCL); now THAT is the level of attention to detail I appreciate, and it's the real-life place where a former UT student would go to look up something like a yearbook.Dave even makes Hannah's astoundingly ballsy choice at the end – cutting Owen/Ethan out of her life, for Bailey's sake – believable, with the admittedly clever conceit of having the Big Bad be a mob lawyer, not a mafioso, and one who wanted to have a role in his granddaughter's life despite blaming Ethan for Kate's death. I did *not* see that coming on the series, but Jennifer Garner NAILED IT in that scene as well. (Also, the series allowed for scenes the book's structure – wholly from Hannah's POV – did not, e.g. Bailey meeting her extended family.)But maybe spend a few weeks in a city first before you decide to set two-thirds of your next novel there?",
                "reviewVotes": "56 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHD6H6ZOV6RHNVT2TXVNN27ESHXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QY3WYF128LQH?ASIN=1501171356",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Self Sacrifice",
                "reviewText": "Hannah and Owen are so sweet together. I love that he felt that he could trust his daughter with her. Hannah is so brave. What they had to give up for safety is heartbreaking.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philosophy5280",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEB4PQQXFIAOTZV7JE5JWPVLPKVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JSQP4KPSHUNC?ASIN=1501171356",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 16, 2023",
                "reviewTitle": "3.0 out of 5 stars Mom-Daughter Relationship Overshadowed by Silly Plot",
                "reviewText": "I picked this up because I was interested in the relationship between the stepmother and the daughter and how it developed, and in this sense, it was underwhelming. Dave had good writing, good editing, and good insight into the relationship - basically, being sweet doesn't matter as much as what you do when things get hard, and you have to be willing to put the child first even above the other adult in the relationship, and you need trust. But the actual story *hindered* this character transformation. It made it necessary for the daughter to depend on the stepmother (but not in reverse), and in such an outlandishset of unique circumstances, it doesn't have much applicability for real people, and the spectacularly silly scenario squashed a lot of the emotional nuance a story like this could have had. Worth like $5 in my opinion, but not $14.*****SPOILER ALERT****So in a nutshell: Bailey's father had to run because he offended the mob, but they are in this unique situation where the mob won't mind if Bailey and Hannah are living there on their own, as long as they never see Owen the father again. Hannah eventually decides to do this, rather than go into witness protection, so that Bailey can go back to doing theater and having her boyfriend, and she can have her art career, and they can \"be everything that makes them themselves\".Bailey has to learn to trust and respect Hannah, whom she otherwise hated, as they seek out what happened to Owen and eventually realize they can't get him back. But Hannah doesn't have to learn to trust Bailey. She tells her the truth a few times, but mostly you have the impression that she is leading around an angry bull on a leash, and Bailey repeatedly makes bad choices suggesting she is not worthy of trust. Their relationship is largely characterized by Hannah blandly stepping around Bailey hating her, trying not to trigger Bailey to rebel, and wanting to be comforting but not. Until at the end, when Bailey realizes she has no choice but to accept Hannah as the only remaining adult in her life.So the message is, if you are the only adult in a teen's life, they will have to come around.It seemed like a lost opportunity to develop a relationship based on actual, mutual trust. Or to grapple with the complexities of dealing with a difficult family situation IN a family, rather than essentially stripped of all family and totally alone. Plus, there's a ridiculous mob backstory.",
                "reviewVotes": "87 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JenP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUH3LCZCHIQU7NS3NKZNFGLDJ6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSJ0B2HTVY5VY?ASIN=1501171356",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Strong woman getting stronger",
                "reviewText": "Quick read. Fun parts about Austin if you lived thereSeeing a strong woman make hard decisions in the name of keeping a step-dtr life together",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel Atkins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCBYI72LLB3KZ3A7MYFCRXC2TNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1U43NREOTSL06?ASIN=1501171356",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "4.0 out of 5 stars Mehhhh",
                "reviewText": "A 3.0 is too low but a 4.0 is too high. This book is a good 3.5. It’s a good and easy read but I was never overly excited or shocked. It did keep me locked in on trying to figure out who Owen really was and where he was but Bailey was a brat and Hannah was pretty boring for a main character. Once they got to Texas it became more interesting but still mehhh. I watched the show after I read the book and while I love a lot of the actors/actresses in the show it was mediocre at best too!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPMYVZIPYYMHAS76UOOGX5FARQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GMUJ4GT4R70Y?ASIN=1501171356",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Best Book I’ve Read In A While",
                "reviewText": "I usually know if I will like a book after the first 10 pages. Some take more. If I’m on the fence, maybe a hundred. This book not only pulled me in from the start, but pulled even stronger as it went along. To say it was well written would be an understatement. The characters are well developed, the plot unpredictable and the ending is just right.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 25, 2024",
                "reviewTitle": "Great book",
                "reviewText": "I enjoyed the relaxing read on a Monday afternoon while the kids were at school. I highly recommend it to anyone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SQ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 28, 2023",
                "reviewTitle": "Gran libro",
                "reviewText": "Muy recomendada para cualquier edad, Te mantiene entretenido Toda la lectura con grandes mensajes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carla Guimarães",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 12, 2023",
                "reviewTitle": "Love and courage",
                "reviewText": "The book is easy to read.The story is well told and the end is not the one you expect.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "IG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 9, 2024",
                "reviewTitle": "Good quality. Well packed and fast delivery.",
                "reviewText": "Good quality. Well packed and fast delivery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria Karwath",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 25, 2023",
                "reviewTitle": "Spannend",
                "reviewText": "Ich habe das Buch als Urlaubslektüre gekauft. Super spannend geschrieben - ich konnte es kaum aus der Hand legen.Meine Urlaubsbegleitung hat es dann gleich auch noch gelesen und ebenfalls für sehr gut befunden.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.51",
                "sellerName": "Literacy In Books",
                "sellerRating": "4"
            },
            {
                "price": "$5.00",
                "sellerName": "charlestonsoon",
                "sellerRating": "4.5"
            }
        ]
    }
}