{
    "remaining_requests": 101,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Guest-List-A-Novel/dp/B07WSFQHSX",
    "body": {
        "name": "The Guest List: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Guest-List-A-Novel/dp/B07WSFQHSX",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51yC-tLuYwS.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lucy Foley",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Lucy+Foley&search-alias=audible"
        },
        "brand": "Lucy Foley&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 102599,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A Reese's Book Club Pick“I loved this book. It gave me the same waves of happiness I get from curling up with a classic Christie.... The alternating points of view keep you guessing, and guessing wrong.” (Alex Michaelides, number one New York Times best-selling author of The Silent Patient)\"Evok[es] the great Agatha Christie classics.... Pay close attention to seemingly throwaway details about the characters’ pasts. They are all clues.” (New York Times Book Review)A wedding celebration turns dark and deadly in this deliciously wicked and atmospheric thriller reminiscent of Agatha Christie from the New York Times best-selling author of The Hunting Party.The bride - the plus one - the best man - the wedding planner - the bridesmaid - the body.On an island off the coast of Ireland, guests gather to celebrate two people joining their lives together as one. The groom: handsome and charming, a rising television star. The bride: smart and ambitious, a magazine publisher. It’s a wedding for a magazine or for a celebrity: the designer dress, the remote location, the luxe party favors, the boutique whiskey. The cell phone service may be spotty and the waves may be rough, but every detail has been expertly planned and will be expertly executed.But perfection is for plans, and people are all too human. As the champagne is popped and the festivities begin, resentments and petty jealousies begin to mingle with the reminiscences and well wishes. The groomsmen begin the drinking game from their school days. The bridesmaid not-so-accidentally ruins her dress. The bride’s oldest (male) friend gives an uncomfortably caring toast.And then someone turns up dead. Who didn’t wish the happy couple well? And perhaps more important, why? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Psychological Thrillers",
                "link": "https://www.amazon.com/Psychological-Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10491"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 22 minutes"
            },
            {
                "name": "Author",
                "value": "Lucy Foley"
            },
            {
                "name": "Narrator",
                "value": "Jot Davies, Chloe Massey, Olivia Dowd, Aoife McMahon, Sarah Ovens, Rich Keeble"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "June 02, 2020"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07WSFQHSX"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#271 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #10 in Crime Thrillers (Audible Books & Originals) #20 in Psychological Thrillers (Audible Books & Originals) #41 in Suspense (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Emma Howlett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDATV6WQW4K2U4PF7TG46BOJTMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37U27A4EHMJ41?ASIN=B07WSFQHSX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Got me out of my slump",
                "reviewText": "I am so glad I chose this book to get me out of my reading slump. I had heard good things and they were all true. I loved the various points of view and that they worked well to conceal the ultimate connections of the plot. I changed my mind on how it would end every chapter or so and still didn’t fully predict the ending! Very well written and great character development. Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stacia Levy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVBKVRXS5G4FTHGUPXOIMN6U4VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9PSYB9S2QCRQ?ASIN=B07WSFQHSX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars A \"Locked Room\" Mystery.",
                "reviewText": "I read this for the 52 Week Book Challenge, which challenges you to read a book a week. Week One was on the theme of the \"locked room\" mystery. This novel is a variation of the \"locked room mystery\": that is, the main characters are in a literal or figurative locked room, with no one able to enter or exit, when a crime, usually a murder, occurs. A well-known version of the the \"locked room mystery\" is Agatha Christie's \"Murder on the Orient Express.\" The victim is murdered aboard the famous luxury train while it is moving: hence, the murderer had to be one of the passengers. A key element of the locked-room mystery is the mutual fear and suspicion the characters, who are usually strangers from different walks of life, have for each other. Another element is the claustrophobia as there is no way out of the locked room.In this particular telling of the locked room story, the locked room is an island, the fictional island of Inis, specifically, in a remote area off the Atlantic coast of Connemara, a region in western Ireland. The main characters--the bride, groom, bride's sister, the groomsmen, and so forth--have all gathered there for the destination wedding of Jules, a famous blogger and influencer, and her TV star fiance, Will. The wedding is orchestrated by Aoife, the wedding planner, local, and owner of the inn where the wedding takes place. One of the wedding party will wind up murdered, and the rest of the guests as well as Aoife will fall under suspicion. As is also traditional in this kind of story, most characters have a motive for killing the victim.The story was a little slow at first but picks up in the middle. It is artfully told through multiple points of view of the guests and the wedding planner with their individual perspectives on the other characters and the story events. The narrative also moves back and forth in time, until focusing on that one fateful moment: the murder.This is a worthwhile read for lovers of the mystery genre.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amber Clark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKOE2UEFKXL4BEPNADGZ4YLY44A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OGOAFXV2R3PC?ASIN=B07WSFQHSX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Marriage, manipulation, and murder",
                "reviewText": "A wedding to remember for sure.The twists at the end,,,,my jaw was on the floor. Lucy Foley is a master at thrillers.Atmosphere and characterization was top shelf. I couldn't wait to get back to the story. I was drawn completely into this world. I felt for Olivia and Hannah. I was annoyed and put off by Johnno and the ushers. The perfect couple were easy to dislike.Easy to read, easy to rate.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JAB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAOQT6C5FMKVGPK6U6EXSXO65WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22BCRD01073E9?ASIN=B07WSFQHSX",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2021",
                "reviewTitle": "3.0 out of 5 stars Different than Expected",
                "reviewText": "As one of the most purchased mystery novels of 2020, “The Guest List” appears to have produced a range of reactions from reviewers. From being hailed as genius to castigated as abysmal, the book has proven to be somewhat divisive among literary fans.Taking place on an island off the coast of Ireland, a power couple consisting of a television star and a magazine publisher are set to be married. Then as the wedding festivities proceed, someone ends up dead. In telling the novel’s events, alternating perspectives are given from several narrators that primarily include the bride herself, the best man, the wedding planner, a plus-one who is married to a friend of the bride, and the bridesmaid who is also the bride’s half-sister. As the narrative progresses, several plot twists occur and the book maintains a suspenseful tone that makes it hard to put down at times.However, a key problem with the book is not necessarily one with the novel itself but with the marketing of it, which affects the expectations of readers. Although branded as a sort of modern whodunit, similar to ones written by Agatha Christie, “The Guest List” plays out much more like a social drama that happens to culminate in a murder, rather than being a murder mystery in itself. That said, the book does not entail an investigation of a murder that has already happened but instead depicts the making of a murder that has yet to take place. While readers are teased with snippets of a waitress screaming about a dead body on the island and search parties going out to investigate, the vast majority of the book revolves around flashbacks that lead up to the wedding and subsequent murder. Thus, it is not explicitly stated who died until the book itself is nearly over. Thereafter, the murderer is rapidly revealed and despite an epilogue, the novel ends somewhat awkwardly and abruptly. Until the final thirty pages or so, the book’s content revolves around the relationships between the main characters and the secrets that lie in their respective pasts. While some may enjoy the gradual tension, others may find that the book unnecessarily drags things out that have already become obvious. Another feature of the book is that its dialogue tries to be witty and perhaps socially relevant, especially during passages involving sex and online dating habits, but just feels cringeworthy at parts. Although these issues don’t completely render the book meritless, they are consistently aggravating and prevent the storyline from being as well told as it could have been.In general, “The Guest List” is one of those books that may be a hit or miss for readers. While there’s a neat concept at play, the execution of it could have been better and the format may annoy some, depending on one’s personal preferences. Although a tough book to rate because of its occasional strengths but notable deficiencies, this review’s rating rounds out to three stars because the book’s neither perfect or terrible.",
                "reviewVotes": "43 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ripley7700",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOIW4H4DTL2B7QPMG5BZYC3PO2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26HBWJMPN8TAO?ASIN=B07WSFQHSX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "4.0 out of 5 stars Entertaining but not really a murder mystery",
                "reviewText": "I bought this thinking it was along the lines of a classic whodunit, but it isn’t. It’s really more of a suspense/thriller, but it is very slow burn and much of the suspense is generated by the framework of the book (where the story skips around in time). I understand why it’s compared to Agatha Christie, but I think it’s a faulty comparison. Both And Then There Were None and Murder on the Orient Express are actual murder mysteries, where the reader is trying to figure out who the murderer is throughout the book. That is impossible with this book, for reasons I can’t say without spoiling it. That being said, it’s fine as a suspense/thriller novel…maybe better read at a ski resort than the beach given the dreary atmosphere. I took off a star because I don’t think the first person narrative worked - it would have been much better written in third person. Most of the character voices sounded the same, despite being from very different backgrounds. It really started grating after a while.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LCP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 11, 2024",
                "reviewTitle": "I JUST LOVE HER STORIES!!",
                "reviewText": "Such a great writer! Her stories are amazing!!! Love all of her books!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diana Mabbett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 15, 2023",
                "reviewTitle": "Fabulous",
                "reviewText": "What a great read with lots of twists and turns.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra Neime Carvalho",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 13, 2021",
                "reviewTitle": "Excellent",
                "reviewText": "Gripping, a page-turner... Well-written plot. One of the best thrillers I've read recently. I give a 5 star, although I have figured it all out before the end... It has nothing do to with 'And Then There Were None' by Agatha Christie, however some people were making comparisons, maybe because the murder venue is on an island...and the ones who did were giving a better evaluation to The Guest List... Not true ! \"And Then There Were None\" is the best thriller ever !",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pauline Marklew",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 7, 2024",
                "reviewTitle": "Keeps you guessing",
                "reviewText": "Recently started reading this authors books whilst so far they have been a similar plot still very enjoyable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fotografikus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 8, 2023",
                "reviewTitle": "Spannend bis zum Schluss / Thrilling to the end",
                "reviewText": "[Deutsch]Ein wahrer Lesegenuss. Die Geschichte wird aus verschiedenen Perspektiven (aus der Sicht verschiedener Personene) erzählt. Und davon bin ich, ehrlich gesagt, überhaupt kein Fan. Oftmals hemmt das den Lesefluss enorm. Doch hier ist dieses wechseln der Erzähl-Perspektive fantastisch gelungen.Das Setting ist grundätzlich bekannt: Menschen treffen an einem abgeschiedenen Ort zusammen und jemand wird ermordet. Dann beginnt die Mördersuche während niemand den Ort verlassen kann. Klassisches Murder-Mystery.Doch bei dieser Geschichte ist vieles anders als erwartet und es ist herrlich wie sich am Schluss alles zusammenfügt.[English]A real reading pleasure from the beginning. The story is told from different perspectives (from the point of view of different people). And to be honest, I'm not a fan of that at all. Often it inhibits the reading flow enormously. But here this change of narrative perspective is fantastically successful.The setting is basically familiar: People meet in a secluded place and someone is murdered. Then the search for the murderer begins while no one can leave the place. Classic murder-mystery.But in this story, many things are different than expected and it is wonderful how everything comes together in the end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}