{
    "remaining_requests": 83,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Way-Bear-Novel-Leaphorn-Manuelito-ebook/dp/B0B71NTJZV",
    "body": {
        "name": "The Way of the Bear: A Mystery Novel (A Leaphorn, Chee & Manuelito Novel Book 26)",
        "price": "$10.99",
        "originalPrice": "",
        "rawPrice": 10.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Way-Bear-Novel-Leaphorn-Manuelito-ebook/dp/B0B71NTJZV",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/814-FEf3nZL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Anne Hillerman",
            "link": "https://www.amazon.com/Anne-Hillerman/e/B001JS4JQ8/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4853,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B71NTJZV"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Harper (April 25, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 25, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3899 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 281 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,755 in Kindle Store (See Top 100 in Kindle Store) #11 in Native American Literature (Kindle Store) #18 in Native American Literature (Books) #34 in Cultural Heritage Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,853 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Sacred Bridge Stargazer The Tale Teller Cave of Bones",
                "media_link": []
            },
            {
                "media_text": "Song of the Lion Rock with Wings Spider Woman's Daughter",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/427e69de-5bb7-4785-9d9d-ca1cd37f1724.__CR0,0,1940,600_PT0_SX970_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6ddc25f-1e79-4b02-b6bb-38f3b989b71d.__CR0,0,1940,600_PT0_SX970_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4ca9499c-843b-4494-9ee8-c7aaddbe5e39.__CR0,0,1940,600_PT0_SX970_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8341a608-403b-488e-a7ad-8d855682eb14.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bd6aff8c-5578-4665-b75c-d4d7151f9d23.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a283b4b-68bc-44a8-8e60-1f203e115e84.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ed4da88-fbf7-4a7a-8caa-f40fe629e5db.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ece982b7-ec9a-4874-bf08-f5560e29a058.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/42258a61-124d-406f-b313-ff845a14d9a0.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5161feaf-3edf-459e-9451-20afe1fc3ed6.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "C. Trussell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWO5X6JZAIEI3YLHR32DHRPRIIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SUQBHCY1R1I2?ASIN=B0B71NTJZV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars A great continuation to the story.",
                "reviewText": "Anne Hillerman has once more contributed to the stories of tribal police officers on the reservation begun by her father, Tony Hillerman. This is a story with the themes of birth and death running through it. Husband and wife team Chee and Manuelito have made a trip for some quiet time, but that quickly changes when Bernie’s hike in the desert turns into a run to save her life. Strange things are happening in the desert and it appears to be centered around a local paleontologist. As always, the author weaves in the customs and beliefs of the native people as the mystery unfolds. It will stand alone, but you will get a better introduction to the characters if you start reading the series when Leaphorn is a central character.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LA in Dallas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4AGB3JJOROF4KGTO62ONBLTS4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11LOUKN5JU11W?ASIN=B0B71NTJZV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Lotsa plot, less mystery",
                "reviewText": "The Way of the Bear is the 26th novel in the Leaphorn, Chee, and Manuelito mystery series by Tony and Anne Hillerman, and the eighth since daughter Anne's 2013 reboot of her father's series with Spider Woman's Daughter. (The \"About the Author\" bio at the book's end claims \"This is her eighth novel featuring Bernadette Manuelito and the twenty-fifth in the Leaphorn, Chee & Manuelito series begun by her late father, Tony Hillerman.\" I don't know where the 25/26 discrepancy comes from -- in a series this long, off-by-one errors are easy.)I found this more entertaining than average, mainly because there was always something going on. There's more event and emotion in this one than in the last. If, however, you are a more traditional mystery reader, you might be disappointed in this one, because the mystery is largely spoiled by a short early chapter in which the identity of the main culprit is revealed. If like me you are not personally invested in solving the mystery for yourself, this will not bother you.Most of the action takes place at the USA's newest National Park, Bear's Ears National Monument, which was protected because of its large heritage of fossils and early human remains. Several of the main characters are paleontologists and archaeologists. Although I have no doubt that paleontology is as scientifically exciting as here presented, I seriously doubt that many practitioners find in it a path to fabulous wealth, or a motivation for murder. (It is possible that I am just ignorant of the fossil black market.)This one is entirely about Bernie and Chee, who are together at Bear's Ears for most of the story. (Joe Leaphorn is still in Hawaii with Louisa.) Both are going through some things, and Bernie in particular is in an emotionally fragile state for most of the book. Now, if you've read previous books in the series, you're probably thinking something like, \"'Emotionally fragile'? Bernie?\" Yes, she is. All is eventually explained.So, this is a fun mystery novel that, besides telling a packed story, also advances our understanding of Bernie and Chee. And of course, as always, of the Diné!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ChickJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4PD45PPVH3KSRMKLDOMG5SGLRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REUWBUF1NSN4Z?ASIN=B0B71NTJZV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars A look on how women handle police work",
                "reviewText": "A great story but what hit me was how Bernie is effected by her work. I have read many police crime novels. And they have always talk about how it effect men. This time I enjoyed learning how women think. I mean home life, family life, and the dark problem. (I don't want to reveal for people who hasn't read this book or previous ones.) A must read for all mystery lover. Highly satisfactory.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer Toppi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAIG7YV5YBAN3SR2TQET5QGGI2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DZTSHQCXJ59O?ASIN=B0B71NTJZV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Bravo! Easy Five Stars",
                "reviewText": "Not only is this book a triumph of storytelling, but the setting is the amazing Bears Ears National Monument. At first glance one might say this is a murder mystery, but it's so much more. It's always good to spend time with Jim Chee and Bernie. There is only one thing that would make these books better....a pronunciation guide for Navajo words that are used.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave Schwinghammer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEH7MDLVNET3GWFGMLDVQUUHWKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KF5CROT5IW0S?ASIN=B0B71NTJZV",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "3.0 out of 5 stars Unlikely Villains",
                "reviewText": "I first began reading Tony Hillerman because of his focus on ceremonial and ritual aspects of Navajo civilization, such as The Blessing Way. I thought Anne Hillerman might be doing that with THE WAY OF THE BEAR.The novel is set in Utah’s Bears Ears National Monument. Bernie goes there after being rejected for a position as a detective for the Navajo police. Its peaceful atmosphere makes her feel better until she discover evidence of illegal digging and vandalism of petroglyphs. While examining the destruction, she is chased and shot at by a black truck.Chee has come to Utah to meet with Dr. Chapman Dulles a paleontologist who has made a major discovery at Bears Ears. He’s studying how mammals managed to survive and proliferate after an asteroid destroyed the dinosaurs. His discovery could be worth millions to museums or private collectors. Dulles wants to make a donation to the Navajo Police Department. Before Chee can meet with the doctor, people start to die, and the doctor goes into hiding.Some of the minor characters, mostly villains, need to be fleshed out. A researcher named Jessica loses her husband on the side of the road. She says he froze to death but eventually a bullet wound is found. She has a partner of sorts, Kinsley from the BLM. Both of them want the valuable fossil Dr. Dulles has found. They’re willing to kill for it. There’s a confrontation with Chee and Bernie.As in most of Anne Hillerman’s novels, Bernie’s mother and sister Darlene make an appearance. Surprisingly, Darlene wants to study to be a nurse and is taking care of their mother. She also has a steady boyfriend who wants to marry her.The gunplay starts when Dr. Dulles makes it known he intends to donate his find to a museum. He’s only interested is in advancing knowledge. It’s surprising that a ranger from the BLM and a anthropological researcher would be so greedy. And they’re not the only ones.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Just for Fun",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWC7QG3TDZJOTXV6K7PNCKOGKZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BUVMVOQVIFUI?ASIN=B0B71NTJZV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Always a treat!",
                "reviewText": "Anne Hillerman certainly learned a lot from her celebrated father. But, there is no doubt that her books stand on their own merits. There is so much going on in her stories. How does she come up with so many convincing details without completely losing the reader? A true master story teller.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MF Miller",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 18, 2024",
                "reviewTitle": "The Way of the Bear was a delightful surprise",
                "reviewText": "It's inevitable that a reader's first review of a Leaphorn, Chee and Manuelito book written by anyone other than Tony Hillerman be compared to his brilliant voice and lovingly-portrayed world. All I can say is that his daughter, Anne Hillerman, is a more than worthy successor and faithfully continues his voice, world, and beloved characters. She is a gripping storyteller and presents the Navajo landscape with as much passion, spirituality, and vividness as her father, and it's evident she has the same values and validates her stories with generous acknowledgements and the same meticulous research.This is the first of her Leaphorn, Chee and Manuelito books I have read, and I am happily looking forward to working my way through the others. If her other books in this series are as compelling and enjoyable as The Way of the Bear, they will join Tony Hillerman's in my All-time Favourite Books bookcase.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KGBeast",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 31, 2023",
                "reviewTitle": "Interessanter Wissenschaftsthriller mit ein paar Längen",
                "reviewText": "Nach Chees Beförderung zum Leutnant und Bernies Ablehnung für eine andere Stelle schickt sie ihr Vorgesetzter Chee nach Bears' Ears, wo Chee in seiner neuen Position einen Spender für eine Stiftung für gefallene und verletzte Polizist*innen und ihre Angehörigen becircen soll. Und beschließt diese Reise als Erholung für Bernie zu nutzen.Während sich Chee von der Anreise erholt, fährt Bernie zum Monument um dort den Sonnenuntergang zu genießen und die Petroglyhen zu studieren, die aber traurigerweise Vandalismus erfahren haben. Und kurz darauf wird Bernie fast über den Haufen gefahren - und auch noch beschossen. Und später in der Nacht muss sie auch noch am Straßenrand bei einer Geburt assistieren. Eine langer Ferientagebucheintrag.Als am nächsten Tag auch noch eine Leiche gefunden wird, ist es mit der Erholung endgültig vorbei und Bernie und Chee werden in die Wirren und Irrungen der Paläontologie, Frühgeschichte und damit verbundene Verbrechen und Verordnungen hineingezogen.Viel Hintergrundswissen mit den allvertrauten Hauptcharakteren - wenn auch stellenweise ein wenig zu ausgedehnt - unter anderem durch Informationsdopplungen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "myra69",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 13, 2023",
                "reviewTitle": "Enjoyable read",
                "reviewText": "Have read almost all of Anne and her dad's books. This one is one of her better efforts but she still has a way to go to attain her father's standards.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bryan M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 6, 2023",
                "reviewTitle": "A fitting continuation of Anne’s signal contribution to this beloved group of characters.",
                "reviewText": "Anne Hillerman has made her father’s later characters of Chee and Bernie into well developed and satisfyingly three dimensional people for whom she, and ultimately the grateful reader, care very much about. She maintains the hallmarks of highlighting the extraordinary landscape and Native peoples, with well developed plot lines. She makes you look forward to their next investigative and personal adventures.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Drinse",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 24, 2023",
                "reviewTitle": "ANOTHER GREAT CHEE, MANUELITO STORY",
                "reviewText": "This story is completely in line with the quality of storytelling found in Anne' previous books. She takes in the steps of her father most wonderfully. I hope she never stops these stories.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}