{
    "remaining_requests": 32,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Murder-Abbeymead-Farm-totally-gripping-ebook/dp/B0BNQXDTB4",
    "body": {
        "name": "Murder at Abbeymead Farm: A totally gripping cozy mystery novel (A Flora Steele Mystery Book 6)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Murder-Abbeymead-Farm-totally-gripping-ebook/dp/B0BNQXDTB4",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91OILWu+WBL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Merryn Allingham",
            "link": "https://www.amazon.com/Merryn-Allingham/e/B00NE2GJEM/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1103,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Amateur detective duo Flora Steele and Jack Carrington have gained a reputation for crime-solving. But will they be able to untangle the latest baffling murder in the cosy village of Abbeymead?Sussex, 1957: When Flora and Jack hear that Percy Milburn – a newcomer to the area who has ruffled more than a few feathers with his grand plans for modernising Abbeymead – is missing, they’re determined to find him. But after scouring the village, Flora is shocked to discover the body of the poor man in the cellar of a crumbling farmhouse.Percy’s murder is tragic but not unexpected, as his ambition had made him many enemies within the small, rural community. Flora and Jack get stuck into the case, but they’re sent on a wild goose chase around the village. Whoever is behind the death has taken careful steps to cover their tracks…Was it Miss Minnie Howden, the nervous housekeeper who loved Percy? Sir Frederick Neville, the owner of the farm Percy was trying to buy? Or Colin Palmer, made rich by Percy’s death? Did any of the suspects dislike Percy enough to end his life?The amateur detective duo finds themselves outfoxed at every turn, unable to find any concrete clues. When their prime suspect is murdered, Flora and Jack have their work cut out to find the culprit. But the clever killer has pulled the wool over their eyes and is reeling them ever nearer to danger.Will this case finally bring Flora and Jack closer together? And can they unravel the mystery before they’re led like lambs to the slaughter?A completely addictive cozy crime novel set in the fictional Sussex village of Abbeymead. Perfect for fans of Agatha Christie, Faith Martin and Joy Ellis!Readers love the Flora Steele mysteries:‘Fantastic… Absolutely devoured this book in one sitting!!... Yet another explosive book in an absolutely addictive series!!!... Will keep you guessing throughout! OMG!!!! THAT ENDING!!!! LOVE, LOVE, ABSOLUTELY LOVED!!!!... I LOVED IT???!!!!! Clear your schedules as you won't be able to put this book down!’ Bookworm86, ⭐⭐⭐⭐⭐‘Amazing… a top-notch cosy mystery… an engaging, intelligent and intriguing murder mystery that I found totally absorbing.’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘I absolutely love this book! I was so captivated… I could not put this book down… I read this book in one sitting!… Amazing.’ @thenerdandherbooks, ⭐⭐⭐⭐⭐‘A joy to read… Full of mystery and secrets!… Truly an unstoppable read! And I loved every minute of it!’ NetGalley reviewer, ⭐⭐⭐⭐‘I loved… cozy, heart-warming… It felt like Scooby-Doo meets Agatha Raisin. I am here for it!… Delightful.’ Frosta Wings It, ⭐⭐⭐⭐‘Fantastic cozy mystery!… Fun to read… This author knows how to keep the reader’s attention from the first chapter!’ Books and Benches, ⭐⭐⭐⭐‘Wonderful book! I absolutely adored this… Had me reading and finishing the book in no time! I highly recommend!!!’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘I adore this series so much. I could read them over and over again. This is a wonderful mystery series to read.’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘What a joy… Fabulous… Totally fantastic… I highly recommend this outstandingly fabulous book.’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘You keep turning the pages to find out whodunit. You’ll find yourself rooting for Flora and Jack in more ways than one. I can’t wait for the next book!’ Goodreads reviewer, ⭐⭐⭐⭐",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157305011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BNQXDTB4"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bookouture (May 16, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 16, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2121 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 266 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#17,544 in Kindle Store (See Top 100 in Kindle Store) #63 in Cozy Culinary Mysteries #80 in Cozy Crafts & Hobbies Mystery #86 in Cozy Culinary Mystery"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,103 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Patty Ann D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFXWZSOBXOI4K5OBDTPY65NQTCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z1YXOJMBF19R?ASIN=B0BNQXDTB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Flora has stumbled on another murder",
                "reviewText": "A man who loves books and had worked hard for his money has dreams. Flora respected Percy and felt his ideas were very good. When he disappears she is fearful it's not something he would choose. What a mess with deals, thugs, supposed lawyers and landowner, a nephew who wants to prove himself and the whole town upset by the plans lead by the old school mistress. Who did it?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Holly J. Blake",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVHSWGYNMR52WOU64KDVAJE4TGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ03Y4JQUAIQG?ASIN=B0BNQXDTB4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 19, 2023",
                "reviewTitle": "4.0 out of 5 stars Great characters",
                "reviewText": "This is a wonderful series, the character development is also great. My only issue with some of the series, is that the killer is frequently undetectable to the reader. That said, the author paints a wonderful picture of post WWII England.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kayla",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFDWBBIA7JT2U4DVBO4D6LA2ROA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R247VJNUC46KUH?ASIN=B0BNQXDTB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 5, 2023",
                "reviewTitle": "5.0 out of 5 stars In love with this series!",
                "reviewText": "Murder at Abbeymead Farm (book 6 of series): newcomer Percy Millburn finds himself unwelcome in Abbeymead after making known his plans to bring the village into modern times. When he is found dead, there is no shortage of suspects. While investigating, Flora is targeted in increasingly personal ways. Can she and Jack discover the killer?MAAF is my favorite book in the series so far. First, because Flora and Jack are in love and that makes me so happy. Second, the story was hyper local. It is all about village politics and life in Abbeymead. There are village meetings! Extreme grudges! Bonkers villagers! Truly all of my favorite things. And I loved the mystery itself. Such a satisfying read.This is the last book for now, but a new one is coming out in a few months (just in time for my birthday!) and I am so excited!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHLOYLFQPCFAC2OP3I7SUAMT7BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H7491Y9J9LLV?ASIN=B0BNQXDTB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 29, 2023",
                "reviewTitle": "5.0 out of 5 stars A Few Red Herrings Here!",
                "reviewText": "Flora and Jack had so many choices for the real villain(s) yet, were any of them correct? A not so cozy mystery when in addition tothe murders, there’s someone after Flo. Meanwhile Flo and Jack struggle with Flo’s abhorrence to marriage when her best friend becomes engaged. Will she ever learn to trust Jack’s feelings for her and to allow herself to feel the same for him? Hoping to see Flora recognize disaster is not always around the corner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alison S. Coad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5ZUQGCNPEE5DDILYCXRP4HVAPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R4SW9H0OAHC6?ASIN=B0BNQXDTB4",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "3.0 out of 5 stars Murder in 1950s Rural England",
                "reviewText": "Bookshop owner Flora Steele and writer Jack Carrington are enjoying the spring of 1957 in the village of Abbeymead when the corpse of a newcomer is found in the basement of a local farm that is up for sale by the local aristocratic landowner. Of course they want to find out what happened, but once they start investigating they soon discover a hotbed of controversy, over traditional land use, financial greed and even the movements of villainous gangs in nearby London, not to mention the fact that someone has apparently targeted Flora by attacking all the items that she holds most dear…. I had actually forgotten about the Flora Steele cozy series, of which this is the sixth, until I randomly ran across the author’s name and remembered that I had enjoyed the first five books. Here we have a bit more development in the relationship between Flora and Jack, and we also see the sometimes hidebound attitudes of villagers in a world that is changing around them. I figured out the culprit about halfway through the book, but still enjoyed the setting and the characters, so mildly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jbucella",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQH4DVQ7CXVHPETVAYIRFBMNUOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZDBUDMJ8TR6G?ASIN=B0BNQXDTB4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 17, 2023",
                "reviewTitle": "4.0 out of 5 stars A Passionate Undertaking",
                "reviewText": "Flora once again becomes a target as she and Jack try to uncover the mystery behind the most recent murder. The sale of Abbeymead Farm is the focal point of the investigation that leaves both Jack and Flora stumped. With the seemingly unrelated psychological attacks on Flora, the author weaves her uneasiness throughout the plot. This uneasiness seems to build a barrier between her and Jack for a good portion of the novel. She does not realize that her happiness is also dependent on her relationship with Jack. Hopefully, in the next novel(s), their differences will be resolved as they find themselves in another investigation.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CLS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNDGYNW3OQZ5FHAB23BUV7D4AAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39ECCXPPW3H66?ASIN=B0BNQXDTB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Old friends",
                "reviewText": "Flora, Jack, Alice and Kate feel like old friends. Abbeymeade is perfect, and the setting in the 1950's feels authentic and really just lovely. Not sure where the mystery of Flora's parents is going, but I'm happy to travel along.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol Hoefler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGELKFP737ODH5RGKHK4K3TR52JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R308X8WBI3MEY8?ASIN=B0BNQXDTB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Part of an excellent series",
                "reviewText": "This book is part of a series of books which takes place in the 1950's in England. The book has an idyllic setting, charming characters, and good plots. It's a wonderful respite from our modern times. I am looking forward to the next book in the series by Merryn Allingham.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "I Love Mail-Order",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2024",
                "reviewTitle": "Another nice cosy mystery",
                "reviewText": "I like the characters and can’t wait to see what happens next.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Parkin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "Murder at Abbeymead Farm",
                "reviewText": "This is the 6 th book in the series & thoroughly enjoyed it. Read in succession and hope there will be more to come.Easy read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D.Ploma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 17, 2023",
                "reviewTitle": "Gripping as usual...",
                "reviewText": "but you can feel it is becoming more and more difficult to find new locations where Flora is going to find the next corpse somewhere in a small rural Sussex village. I am expecting the upcoming novel (situated in a French village) with mixed feelings. The pattern of the \"Abbeymead Farm\" novel is as usual - the prime suspect is murdered so that the hunt can start from the beginning. Solid work.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 3, 2023",
                "reviewTitle": "Another great Flora Steele mystery",
                "reviewText": "There are plenty of twists and turns in this Flora Steele book, and an ending that I had not foreseen. A very enjoyable afternoon's reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Xxx",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 27, 2023",
                "reviewTitle": "Good authour",
                "reviewText": "Pricey",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}