{
    "remaining_requests": 51,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/If-You-Tell-Gregg-Olsen-audiobook/dp/B07TNTB329",
    "body": {
        "name": "If You Tell: A True Story of Murder, Family Secrets, and the Unbreakable Bond of Sisterhood",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/If-You-Tell-Gregg-Olsen-audiobook/dp/B07TNTB329",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41BhZByEYcL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Gregg Olsen",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Gregg+Olsen"
        },
        "brand": "Gregg Olsen",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 140182,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "2021 Audie Award Nominee for Best Nonfiction AudiobookA #1 Wall Street Journal, Amazon Charts, USA Today, and Washington Post bestseller.#1 New York Times bestselling author Gregg Olsen’s shocking and empowering true-crime story of three sisters determined to survive their mother’s house of horrors. After more than a decade, when sisters Nikki, Sami, and Tori Knotek hear the word mom, it claws like an eagle’s talons, triggering memories that have been their secret since childhood. Until now. For years, behind the closed doors of their farmhouse in Raymond, Washington, their sadistic mother, Shelly, subjected her girls to unimaginable abuse, degradation, torture, and psychic terrors. Through it all, Nikki, Sami, and Tori developed a defiant bond that made them far less vulnerable than Shelly imagined. Even as others were drawn into their mother’s dark and perverse web, the sisters found the strength and courage to escape an escalating nightmare that culminated in multiple murders. Harrowing and heartrending, If You Tell is a survivor’s story of absolute evil - and the freedom and justice that Nikki, Sami, and Tori risked their lives to fight for. Sisters forever, victims no more, they found a light in the darkness that made them the resilient women they are today - loving, loved, and moving on. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2"
            },
            {
                "name": "True Crime",
                "link": "https://www.amazon.com/true-crime-biographies-memoirs-books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11314"
            },
            {
                "name": "Crime & Criminal Biographies",
                "link": "https://www.amazon.com/Criminals-Specific-Groups-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2438"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 34 minutes"
            },
            {
                "name": "Author",
                "value": "Gregg Olsen"
            },
            {
                "name": "Narrator",
                "value": "Karen Peakes"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "December 01, 2019"
            },
            {
                "name": "Publisher",
                "value": "Brilliance Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07TNTB329"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#528 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #3 in Crime & Criminal Biographies #4 in Murder True Crime #11 in Murder & Mayhem True Accounts"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MrsHReadsALot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENP7NZDOPW2BTBKFXCNQZFBWNTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24PTIH5F9UB6A?ASIN=B07TNTB329",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Families, the original cult? (Beware: LWR)",
                "reviewText": "Riveting and soul crushing, I couldn’t put this book down. My first time reading anything by Gregg Olsen. I’m not well versed in non-fiction, but I thought he did a fantastic job at making me feel horrified and angry for these three sisters who grew up in abject terror of their mother and did everything in their power to just make it out alive. At times I was shocked at all the times no one did anything to leave or get help. But I forget how pervasive fear is. The whole “don’t rock the boat” mentality. I should know better because I was raised by a violently turbulent mother who could be the sweetest, funniest and lovable person and in matter of seconds (always feels instantaneous) turn into the devil. I saw a little bit of myself in each of the sisters. The living inside your head fantasizing about revenge or better yet leaving them behind and forgotten for good and then the sicker and more confusing part of you that still loves them and yearns for the unconditional love in return. But this mother was unhinged 24/7 and completely unredeemable. EVIL. These children were conditioned their entire lives by this “master manipulator” (gaslighting a very powerful tactic) that this is what family is. This what’s normal behavior. But they knew deep in their souls that this wasn’t right. The children I could understand. They were too afraid to speak out because they had been taught that they had no where to go. Their worse fear was that no one would believe them (because sometimes they had a hard time believing, “aka understanding” it themselves) and being brought to even greater heights of torture in retaliation. What I had trouble fathoming were the so called adults. I suppose that shouldn’t have shocked me either, because I’m more than aware that most adults don’t have it all together and can live the majority of their lives in a perpetual state of ignorance. It’s so easy. Out of sight out of mind and all that nonsense. But some people, like Shelly, who was referenced as an apex predator throughout this story had that uncanny ability to sense and then weed out the very vulnerable. People who needed a friend. Were given the barest of minimums in kindness and support and then had it all taken away. By that point they were already in too deep to really understand what they had gotten themselves into. Broke my heart. There are so many lost souls in this world just trying to figure things out and at the same time willing to give everything they have to offer to others. Making it easier to be taken advantage of, which would be bad enough. But these unfortunate souls had the bad luck to make contact with Shelly. And be sucked into her abyss of gaslighting, finger pointing and violent rhetoric that had everyone under her roof a husk of their former selves. And that’s what she thrived off of. Like a vampire sucking the life out of her intended victim. She’d drain them of their confidence, free will and any sense of purpose until they were as empty as she was. It’s hard to imagine that some people are just born evil. But I 100% believe that Shelly is one of those people. Maybe she’s missing something in her brain that provides the ability to truly empathize with others and know what it means to do right by someone other than themselves. But Shelly lacked all of the qualities that make us truly human. I know we all have the ability to be savage and take on the world when we’re being cornered. But Shelly, even as a little girl relished in her ability to be rotten. There was a family history of abuse and neglect. Maybe it was in the blood or learned behavior? Maybe it was too late for Shelly to change by the time she was already brought to live with her estranged father at 6 years old? That’s terrifying. There are no answers as to why this woman did what she did. It’s frustrating that so many people were aware of the situation and did nothing, but it’s not hard to understand why. If not for her inherent laziness and her incredible sense of entitlement, she could have been the leader of a cult that took over entire communities or a country if her vision went beyond just humiliating and dominating over one person at a time. She was so very good at lying and manipulating. Not everyone bought into. But she knew how to pick her battles and who to mess with. She was always in it to win it. She just never realized that her crimes would come to light by her own daughters. Her original victims. The girls by all accounts should have been her own mirror images. But they were born with a conscious. And after years of trying to make it out and stay out they could finally do the one thing that was never an option before. Stand up to the monster. I’m emotionally wrecked after reading this. But it’s paced so well and the subject matter really hits home. Triggering for sure, but written in a way that makes it hard to put down. Sorry for this incredibly long and irrelevant review.",
                "reviewVotes": "253 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle West",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEELGF7KE74LU3JVN4H3AKP5WYQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34FG1WJH6YVKZ?ASIN=B07TNTB329",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars Gut wrenching!",
                "reviewText": "This book was so gut wrenching! Written in such a way that made me want to not believe someone could be so cruel! These poor children endured not only physical abuse but also mental abuse at the hands of someone who was supposed to love them! Shelly, in my opinion suffered from a variety of mental illnesses and unfortunately never received treatment for them. That doesn’t excuse her sadistic behavior but I kept thinking why didn’t anyone call the police? Tell a teacher or a guidance counselor? But then I realized the mental abuse she inflicted caused them to not tell. I don’t know how the legal system works in Washington state, but they should’ve thrown her under the jail and put her on death row!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick Lewis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNQKYCICXKTPLUBN63RJUERZHPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBUYB7AWRNIRR?ASIN=B07TNTB329",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars holy smokes",
                "reviewText": "This book has to be in my TOP FIVE.Disturbing, gut wrenching, sad, overwhelming.. I can’t even use enough disturbing adjectives to describe this book. The part of me who loves a good crime novel didn’t want this book to end but I had to keep reminding myself that this REALLY happened to people. My heart goes out to Kathy and Ron’s family. My heart goes out to Shane who had so much life left to live. My heart goes out to the sisters. I will carry this book and the weight of it in my heart from now on. I feel like I was right there watching it all unfold. Gregg Olson did an amazing job writing this book, I love how he included how he spoke with Danny. It kinda changed my thought process of Danny a little. Although he did awful things, he too was a victim of Shelly’s mind control.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQYXBBABARRUEJZSQDCZ2RMQJHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GFNMR7EW1ES8?ASIN=B07TNTB329",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2020",
                "reviewTitle": "3.0 out of 5 stars \"If You Leave\" Sells the Drama More than Tells the Story",
                "reviewText": "As has been noted in quite a few reviews for \"If You Tell: A True Story of Murder, Family Secrets, and the Unbreakable Bond of Sisterhood,\" this is a book that is simultaneously a rather brutal read yet also a remarkably compelling one.\"If You Tell\" is based upon the true story of an almost unfathomably abusive family led by the iron first of Shelly Knotek, a domineering woman whose abusive ways seemingly have no explanation yet whose ways are inflicted upon nearly everyone who crosses her path including boyfriends, husbands, her three children (Nikki, Sami, and Tori), and some misguided souls who unfortunately cross her path and pay the ultimate price.\"If You Tell\" goes into detail, brutally so, regarding the emotional, physical, and sexual abuse of the three children and the impact it had on their inability to end the cycle until lives had been lost including those of at least two boarders. \"If You Tell\" also provides remarkable detail regarding these crimes, as well.This isn't a book for the timid reader. Best-selling author Gregg Olsen doesn't shy away from the brutality of this household and these crimes. A good majority of the book is centered around these actions, while only a brief section in the beginning goes into Shelly's early years and an even more brief section at the end goes into the post-conviction lives of the three girls who seemingly have managed to build normal lives despite childhoods that were anything but normal.Several of the reviews have commented with disbelief regarding the actions, an understandable and even refreshing response given one would like to believe that everything that unfolds in \"If You Tell\" is the exception and not the rule. It's difficult to fathom a parent being this brutal to so many people and so many people for so many years simply not reporting it.While we could spend days discussing the cycle of trauma that helps to explain the lack of reporting, to a healthy heart and mind it's simply difficult to believe.In some ways, \"If You Tell\" reminded me of one of Indiana's most famous homicide cases - that of Sylvia Likens in 1965 when a young teenager who'd been staying with a neighbor while her parents were traveling with a circus ended up being brutally assaulted/murdered by the mother, her daughter, and several neighborhood children. The same kind of questions arose to the surface - \"How could a family do such things?,\" \"How could children be involved?,\" and \"How did no one notice until it was too late?\"While it's important to note that the children were not involved, other than simply being aware of it and being too terrified to report it and being under a sort of authoritarian spell by a mother who could justify anything, the dynamics are very similar in the stories.If there's a beef I have with the book, and there is, it's that Olsen focuses so much energy on detailing the brutality yet does a relatively weak job of setting up the characters in the story and an even weaker job in providing a satisfying ending. Without giving the ending away, there's so many possible ways to explore questions, pending issues, and possible conflicts that aren't that far off in the future that \"If You Tell\" feels incomplete and, in the end, feels like it's exploiting the story and its subjects.While there's a possible reason to document the stories so brutally, and as someone who has written a book myself from the perspective of being a survivor, it's ultimately the structure of the book that I find insufficient as I wanted more about the lives of the three sisters and how they are ultimately preparing for the future. There is reference to the relationship with the father, but it's practically an afterthought.While \"If You Tell\" is far from a weak book, it's ultimately a book that sells the drama more than tells the story. The survivors deserved much more than that.",
                "reviewVotes": "76 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2024",
                "reviewTitle": "great read!",
                "reviewText": "I’m not a big reader, but this book had me on my toes! Gruesome parts, but was a thrill to read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sadie kirk",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 16, 2024",
                "reviewTitle": "brilliant",
                "reviewText": "Omg this had me in tears and I got angry whilst reading this book . Took longer than normal to read it over 3 days but well worth it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zelin M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 3, 2023",
                "reviewTitle": "If you tell...",
                "reviewText": "A dark story with horrific happenings. Wonderfully written; the details of the victims and abusers were justly done. I don't think it's overdone and too much gruesome details are mentioned. But I think it was needed so we can understand why the victims did what they did. However, I cannot come to terms with the kind and intensity of the abuse. I wish Shelly was given capital punishment for what she did. She truly deserved it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesús ArenasJesús Arenas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 23, 2021",
                "reviewTitle": "A cruel story worth reading.",
                "reviewText": "There are moments while you are reading the book when you wonder why the explicit cruelty with which the writer tells the story of the Knoteck family. There are paragraphs that are hard to read. It is just a true story worth reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/816+R0RbQ7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "In_full_bloom 🌷🌼🌺💐🌸🌹In_full_bloom 🌷🌼🌺💐🌸🌹",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 18, 2021",
                "reviewTitle": "Une autre perle de Gregg Olsen",
                "reviewText": "Après plus d’une décennie, quand les sœurs Nikki, Sami et Tori Knotek entendent le mot \"maman\", il griffe comme une griffe d’aigle, déclenchant des souvenirs qui ont été leur secret depuis l’enfance. Jusqu’à présent.Pendant des années, derrière les portes fermées de leur ferme à Raymond, dans l’État de Washington, leur mère sadique, Shelly, a soumis ses filles à des abus inimaginables, à la dégradation, à la torture et aux terreurs psychiques. À travers tout cela, Nikki, Sami et Tori ont développé un lien défiant qui les a rendus beaucoup moins vulnérables que ce que Shelly imaginait. Alors même que d’autres étaient entraînées dans la toile sombre et perverse de leur mère, les sœurs ont trouvé la force et le courage d’échapper à un cauchemar qui a culminé dans de multiples meurtres.Poignant et déchirant, \"If You Tell\" est l’histoire d’un survivant du mal absolu, et de la liberté et de la justice pour lesquelles Nikki, Sami et Tori ont risqué leur vie. Sœurs pour toujours, plus jamais victimes, elles ont trouvé une lumière dans l’obscurité qui a fait d’elles les femmes résilientes qu’elles sont aujourd’hui — aimantes, aimées et en mouvement. Livre très bien écrit par Gregg Olsen, auteur à succès du New-York Times qui avait déjà participé à l'écriture du fort bien documenté \"If I can't have you\", sur l'histoire de Susan Cox-Powell. D'un anglais facile, je recommande le livre et l'auteur.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71B7DPB0MUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71uyaxvK2UL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}