{
    "remaining_requests": 97,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/First-Lie-Wins-A-Novel/dp/B0C4BHDZGM",
    "body": {
        "name": "First Lie Wins: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/First-Lie-Wins-A-Novel/dp/B0C4BHDZGM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Q50f11cmL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ashley Elston",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Ashley+Elston"
        },
        "brand": "Ashley Elston",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 14296,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "REESE’S BOOK CLUB PICK | INSTANT NEW YORK TIMES BESTSELLER“This fast-paced read has everything you could want in a thriller: secret identities, a mysterious boss and a cat & mouse game that kept me guessing the whole way through.”—Reese WitherspoonEvie Porter has everything a nice, Southern girl could want: a perfect, doting boyfriend, a house with a white picket fence and a garden, a fancy group of friends. The only catch: Evie Porter doesn’t exist.The identity comes first: Evie Porter. Once she’s given a name and location by her mysterious boss Mr. Smith, she learns everything there is to know about the town and the people in it. Then the mark: Ryan Sumner. The last piece of the puzzle is the job.Evie isn’t privy to Mr. Smith’s real identity, but she knows this job will be different. Ryan has gotten under her skin, and she’s starting to envision a different sort of life for herself. But Evie can’t make any mistakes—especially after what happened last time.Because the one thing she’s worked her entire life to keep clean, the one identity she could always go back to—her real identity—just walked right into this town. Evie Porter must stay one step ahead of her past while making sure there’s still a future in front of her. The stakes couldn't be higher—but then, Evie has always liked a challenge... Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Psychological Thrillers",
                "link": "https://www.amazon.com/Psychological-Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10491"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 16 minutes"
            },
            {
                "name": "Author",
                "value": "Ashley Elston"
            },
            {
                "name": "Narrator",
                "value": "Saskia Maarleveld"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 02, 2024"
            },
            {
                "name": "Publisher",
                "value": "Penguin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0C4BHDZGM"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Suspense (Audible Books & Originals) #2 in Psychological Thrillers (Audible Books & Originals) #3 in Suspense Thrillers"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Charles Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMSFDF4URKWUW4KYCOGURAQ2VJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FVRT59Y3AQY3?ASIN=B0C4BHDZGM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Walk a crooked mile. Greet a wicked smile.",
                "reviewText": "The novel, \"First Lie Wins,\" by Ashley Elston, published in 2024 comes on like gangbusters as a fast-paced, live-feed action thriller from the very beginning to the grand finale. The main characters go on the non-stop thrill ride of their lives, one lasting a matter of years, instead of a mere 10-15 minutes at the state fair. There must be an easier way for Cinderella to make a decent living. She should have had her head examined for climbing aboard that absurdly treacherous carnival ride in the first place. Her latest prospective employer basically wants her to \"Do me a favor, walk a crooked mile and wear a wicked smile,\" in the metaphorical and metaphysical sense, if you know what I mean, even if he doesn't exactly come right out and explicitly say so, or spell it out in terms we can all understand. She has certainly put herself in a perilous bind and has few other options available to her, if any at all, at that particular moment. \"Have you ever worked in a soup kitchen before?\" someone inquires, interrupting her train of thought. Hence, she is further incentivized to think quickly on her feet, as the sword of Damocles sways menacingly above her, dangling by a single thread, just about ready to drop. When her single golden opportunity has suddenly been squashed and squandered away, if not severely limited and curtailed altogether, a benevolent-appearing benefactor emerges. He comes to her immediate rescue, just in the nick of time, and supports her magnificently throughout the potentially grim proceedings, considering her present predicament. She could have gone directly to jail had she been duly and properly arrested by the first police officers arriving on the scene. Had they not been flummoxed by the damsel in distress routine, and found out what really transpired, the prosecution might have wanted to lock her up and throw away the key then and there. Truthfully, Cinderella's moral compass may have wavered and temporarily veered way off course, but at least for the time being she isn't completely bankrupt, destitute and cast out in the streets, without any hope whatsoever for a bright, promising future. To her credit, she does possess the uncanny ability to distinguish right from wrong. She is acutely aware of the vaguely ethical gray areas, it seems, and can react accordingly, but this admirable attribute doesn't necessarily constitute slowing her down much, or impeding the progress and rapid advancement she makes in her current line of employment. Undoubtedly, her life has taken a dramatic turn for the better, and it appears that she is indeed moving up on the totem pole. Her intention is to propel herself to the top of the organizational charts like a skyrocket, at least until she accelerates into a brick wall or bounces off the Plexi-glass ceiling. Following the unlikelihood that the initial scenario actually plays out, pans out, or fizzles out, the members of an elite surveillance team working discretely in the background have a brief conversation among themselves before continuing to monitor the situation more closely and carefully. They have a big decision to make, work with her or against her. Up to this point, she has generally been unaware of their physical presence and proximity in the vicinity. But this is all about to change. I'm guessing I can dispense with the elaborate diatribe at this point. The above generic synopsis as it stands should suffice sufficiently in whetting readers' appetites. As you may have already suspected, the novel involves a close-knit group of talented actors with a unique set of specialized skills and character traits. The plot evolves in a boldly dynamic, terrifically suspenseful manner, guaranteed to keep you perched on the edge of your seat throughout the story, wondering what happens next, as they cover a great deal of territory on their quest. Thus, the book represents the category of \"most intriguing new fiction\" quite well, revealing great imagination on the part of the author.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michele",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCZNPWQA2CJSXKXR3MSYVZK5AXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36WAIEVZAGJWM?ASIN=B0C4BHDZGM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars A captivating mystery/thriller",
                "reviewText": "I went into this one pretty blind (and will be trying to do more of that this year). All I knew was that it was a mystery/thriller of sorts. I ended up reading the summary after I finished it and I feel that it gave too much away. Some of the things that I was shocked by were spelled out in the summary, so I highly recommend everyone goes into this one blind.It was clever and intricately crafted. I loved how no detail was left without an explanation by the end. The ending was exactly what I wanted and everything was wrapped up so nicely.Would have given it five stars if the plot twists started a bit earlier in the story. Even though it kept my interest, I felt like I was just reading along until that first plot twist hit.It had strong A GIRL WITH THE DRAGON TATTOO vibes and I loved it. I could easily see this one made into a movie!",
                "reviewVotes": "42 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHPMS5YVT74RENJNL5DOCNSL7PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GNZ79F944ZO3?ASIN=B0C4BHDZGM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars A Superb Con-artist Thriller",
                "reviewText": "A superb con-artist thriller set, primarily, in Louisiana.“Evie Porter” is a successful con-artist with two problems. First, she’s fallen in love with her mark, Ryan Sumner. Second, her very evil boss, Mr. Smith, doesn’t trust her anymore and has destroyed her true identity. Will “Evie” escape from Smith?By the means of clever flashbacks, Ashley Elston tells us how “Evie,” real name Lucca Marino, got into this pickle. Living in smalltown North Carolina, Lucca started stealing to deal with her ailing mother’s medical bills. Lucca came to the attention of Mr. Smith and was given the choice of working for him or going to jail. Under a series of assumed names, Lucca works her way up in Mr. Smith’s criminal syndicate. Then she’s given a vital assignment: find out what information the mark, Amy Holder, had on mob bigwig Victor Connolly. Lucca doesn’t deliver the goods, so Mr. Smith gives her what might be her final job: using the identity, “Evie Porter,” she must con Ryan Sumner or else. Two problems: First, Lucca falls for Ryan. Second, she discovers that Mr. Smith has sent an employee to monitor her, a new “Lucca Marino,” who is her doppelganger.What works: Lucca/Evie is a compelling character. She’s shady but has a moral compass that Ashley Elston skillfully reveals. The author makes us feel Lucca/Evie’s dilemma; she wants to quit working for Mr. Smith but can’t do that until she knows his identity. We’re rooting for her to succeed. The plot moves well.What doesn’t work: Ryan Sumner isn’t a fully developed character. He’s a (slightly tarnished) Ken.A fun page-turner. One of the best thrillers of 2024.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra Fielder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAILX2ZXHRZDEYFYGCPMOPQX2XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PLPU7GP9CGOM?ASIN=B0C4BHDZGM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Complicated But Facinating",
                "reviewText": "The main character had so many names and identities that it was hard to keep up with her. Evie was her last identity. She had been in trouble and saved by the shady Mr Smith. She had to do assignments for him that required her to change her name often. Her friend Devon helps her with computer issues. When she is assigned to find out what she could about Ryan and his businesses, she falls for Ryan. She decides she wants to stop doing assignments and stay with Ryan. It took me a little longer to read this book, because Evie has so many identity changes. I did struggle with keeping up. But the effort was well worth it! The plot takes a few twists and turns. It was an entertaining and intriguing read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMEDY26WWEIJH6DUJYXLEIIE4UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BNMN927XUQ3G?ASIN=B0C4BHDZGM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Lies",
                "reviewText": "I truly wanted to give 5 stars, but one main event held me back. First, it was fascinating to read how many Mr. Smith drew into his scheme. The constant fear of discovery and possible death easily holds the reader's attention. My disappointment was the choice, unless I did not clearly understand, of the main female character to continue the nasty business where Mr. Smith left off after being caught, a plan she seemingly plans to pursue by announcing herself as Miss Smith.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gerardo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 9, 2024",
                "reviewTitle": "Amazing Book!",
                "reviewText": "Could not put this book down. The author did a great job of referring back to her past life, and her present. Easy read!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lynda smith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 13, 2024",
                "reviewTitle": "Utterly amazing!",
                "reviewText": "I’ve not read a book as enjoyable as this for many years - the heroine is ‘one real tough cookie’ - had me hooked from the first chapter - couldn’t put it down but didn’t want it to end - read it in two days - a complicated plot, so many twists and turns - you’ll never guess the ending, not in a million years. What an imagination this lady author has and though she was new to me I now can’t wait for her next book. I highly recommend this thriller.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sahil",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 25, 2024",
                "reviewTitle": "Loved.",
                "reviewText": "Everything you expect from a book like this, it delivers. This needs to be a series. Like now! Loved it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 31, 2024",
                "reviewTitle": "Plot Twists and Turns",
                "reviewText": "Another great pic for bookclub by Reece Witherspoon. Lots of plot twists and turns. Highly recommend this thriller, fast paced and clever. Well done Ashley :-)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VK",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2024",
                "reviewTitle": "Lies Never Pay!",
                "reviewText": "I enjoyed the story line and the suspense made it a non stop exciting book! Characters were both likeable and not likeable in the case of Mr. Smith. The ending of the book was the reason I took a star away. I didn’t find it believable that the main character would take over the con business. The books story was unique & different and that was what kept my interest to finish reading it once I knew who Mr Smith was about half way into the book. 📕",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}