{
    "remaining_requests": 55,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dictionary-Lost-Words-Novel/dp/B08DL66WVK",
    "body": {
        "name": "The Dictionary of Lost Words: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dictionary-Lost-Words-Novel/dp/B08DL66WVK",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51gnGJrTPuL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Pip Williams",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Pip+Williams"
        },
        "brand": "Pip Williams",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 28999,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER REESE’S BOOK CLUB PICK “Delightful . . . [a] captivating and slyly subversive fictional paean to the real women whose work on the Oxford English Dictionary went largely unheralded.”—The New York Times Book Review “A marvelous fiction about the power of language to elevate or repress.”—Geraldine Brooks, New York Times bestselling author of People of the BookEsme is born into a world of words. Motherless and irrepressibly curious, she spends her childhood in the Scriptorium, an Oxford garden shed in which her father and a team of dedicated lexicographers are collecting words for the very first Oxford English Dictionary. Young Esme’s place is beneath the sorting table, unseen and unheard. One day a slip of paper containing the word bondmaid flutters beneath the table. She rescues the slip and, learning that the word means “slave girl,” begins to collect other words that have been discarded or neglected by the dictionary men.As she grows up, Esme realizes that words and meanings relating to women’s and common folks’ experiences often go unrecorded. And so she begins in earnest to search out words for her own dictionary: the Dictionary of Lost Words. To do so she must leave the sheltered world of the university and venture out to meet the people whose words will fill those pages.Set during the height of the women’s suffrage movement and with the Great War looming, The Dictionary of Lost Words reveals a lost narrative, hidden between the lines of a history written by men. Inspired by actual events, author Pip Williams has delved into the archives of the Oxford English Dictionary to tell this highly original story. The Dictionary of Lost Words is a delightful, lyrical, and deeply thought-provoking celebration of words and the power of language to shape the world.WINNER OF THE AUSTRALIAN BOOK INDUSTRY AWARD Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10177"
            },
            {
                "name": "Biographical",
                "link": "https://www.amazon.com/Biographical-Historical-Fiction/b/ref=dp_bc_aui_C_5?ie=UTF8&node=9332127011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "11 hours and 11 minutes"
            },
            {
                "name": "Author",
                "value": "Pip Williams"
            },
            {
                "name": "Narrator",
                "value": "Pippa Bennett-Warner"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "April 06, 2021"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08DL66WVK"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,932 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #9 in Biographical Fiction (Audible Books & Originals) #18 in Biographical Historical Fiction #31 in Biographical Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A3h@live.co.za",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQWO43GXHFSA5LKGYQ354XKTVTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CUF1XOWY0E9G?ASIN=B08DL66WVK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars A compelling read.",
                "reviewText": "\"Dictionary of Lost Words\" delicately navigates through sensitive topics like women's rights, traditional gender roles, abortion, and adoption. Through its nuanced exploration, it amplifies voices often silenced. This meticulously crafted book is a poignant reminder of the power of language in shaping narratives and reclaiming lost stories. A compelling read that resonates long after the final page is turned.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael B. Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMOSBOXVWTN5G74B55TXMEWWZGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3W4JFGR1BMBK7?ASIN=B08DL66WVK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "4.0 out of 5 stars There’s A Word For It",
                "reviewText": "Interesting: Like many who read this novel, I love words, their meanings, and their origins. I don’t geek out per se, but when an interesting word pops up on my daily “A Word A Day” email, I save it and add it to my vocabulary flash cards in the hopes of being able to work it into conversation(s) down the road. Ms. Williams’ novel provided me with many insights into the process behind the creation of the Oxford English Dictionary (OED) by weaving an endearing story around the people (both real and imagined) who make it (literally) their life’s work. That said, the real takeaway for me was the revelation that there is gender bias built into the definitions of the words that comprise our English language, and that bias comes about intentionally in the way the definitions and usages themselves are created, and which words are or aren’t allowed into the dictionary. The novel’s parallel story lines of the creation of the OED and the women’s suffrage movement of early 1900’s England provide the perfect confluence of events to serve as the backdrop for this novel, bearing witness to both struggles. As the historical clock ticks upward toward the arc of the First World War, a third story line arrives on the scene to deliver further difficulties and liberal doses of heartache. In the final analysis, there is triumph on all fronts, but also there is a price to be paid.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KWils",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHNLHE3EJFEFFMJXNWEDKBZ7QPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XEX55B5CN6XG?ASIN=B08DL66WVK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Good read",
                "reviewText": "Easy read, really interesting information about words. The personal story was heartwarming and breaking. Very interesting ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy Hilton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2NEAMDNOV2GRLVJFBPSHJWJHXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17ORQ6P41JGIE?ASIN=B08DL66WVK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Learned history of Oxford English Dictionary and woman’s suffrage",
                "reviewText": "I recommended it for my book club. We review it in JanuaryInteresting story based on a true story. Learned a lot about the Oxford English Dictionary and how it was researched. Loved that author told the story through a Edna a small girl that worked on it most of her life. Also told the story of women’s suffrage events in England",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Louise D. Somes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUZ74UOFYJT26WMVBSMXB6QIB4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R323ZIK7A9RLDZ?ASIN=B08DL66WVK",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2023",
                "reviewTitle": "3.0 out of 5 stars Excellent history, confusing writing",
                "reviewText": "I’m having a difficult time trying to put into words what I thought of this historical novel.On one hand the historical background of the lexicographers of the first Oxford English Dictionary is fascinating with a story interwoven into the narrative to bring the history alive.However, I found the writing to be somewhat vague and confusing. One example is when the main character, Esme, writes to her aunt (or is she a godmother?), Ditte.Esme will state that she needs to write to Ditte but we don’t see that letter, only the response from the aunt.We learn very little of Esme’s time at primary school or the boarding school to which she was sent in Scotland. Therefore, we know little of what is in Esme’s heart and soul.A feminist in every sense of the word, she makes an unfortunate decision that turns out to be very fortuitous at the conclusion of the book, albeit somewhat unbelievable.Esme does marry but we hear nothing of her husband in the ending either.I was disappointed at the author’s choice of words for inclusion in the dictionary from the “common” people, which made them look “dirty.”I can’t recommend this book.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erika",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHG3ARDEMDRASVB4LNGXNZNVYIGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14JOIOXCGK87U?ASIN=B08DL66WVK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Intriguing peek into history",
                "reviewText": "This book surrounds the life of a woman who figures out meaning in words and through their discovery, she also finds meaning for her sense of self. The women's suffrage movement and WWI serve as historical markers, along with the work of compiling the first Oxford dictionary. Essie has a fairly simple life, but the complications of that ease become more evident as she ages in her changing world.Historical reads aren't my preferred novels, but this one was okay. My heart broke over and over for Essie with each trial she faced. So much loss made this a difficult book to read. I did enjoy the dissection of words and meaning. The lighthearted discussions with \"dirty\" words and the empowering commentary on womanhood and equality were highlights in a book that carries a heavy heart.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Helen M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 17, 2023",
                "reviewTitle": "An interesting read - fun",
                "reviewText": "Just a great read with some history attached to it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eugenia Cabral",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 11, 2022",
                "reviewTitle": "Stunning, beautiful, touching, lirical.",
                "reviewText": "An amazing story of real life and the poetry that slips between. Subtle in revealing that many ways we exclude people. Powerful emotional.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ann Victoria Roberts",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 15, 2024",
                "reviewTitle": "Compelling!",
                "reviewText": "Mystery, history, love and adventure, this beautifully written novel is a must-read for anyone fascinated by the world of words. 'What does this word mean?' I would ask as a child; 'Look it up!' my father would respond, handing me a dictionary…This tale of a child brought up amongst a group of men sourcing the meanings of words – in an Oxford garden shed, of all places – had me hooked from the very beginning. Inventing her own games with words – even stealing ones that intrigued her – led me on through lively accounts of Esme’s life and loves from the 1880s to the 1920s. Covering not just changes in her life and experience, but in the life of words – the life of the Oxford English Dictionary.Rarely do I go on beyond the last page of a story to read the acknowledgements and author’s notes, but I was so hooked by Pip Williams’ novel, I had to read every page – and they were equally compelling. Now looking forward to her next novel!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ritika Jain",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 19, 2023",
                "reviewTitle": "For the love of language",
                "reviewText": "Anyone who likes historical fiction or is in love with words, should read this book. It's well-researched and easily absorbs you.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L.B.B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on April 22, 2023",
                "reviewTitle": "Such a gem.",
                "reviewText": "This story is preciously well written and will stay with me for a long time. Love that the narrative is based around this very real and accomplished Murray family. Hope to hear much more from this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}