{
    "remaining_requests": 63,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Widowmaker-Novel-Mike-Bowditch-Mysteries-ebook/dp/B018291NM4",
    "body": {
        "name": "Widowmaker: A Novel (Mike Bowditch Mysteries Book 7)",
        "price": "$11.99",
        "originalPrice": "",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Widowmaker-Novel-Mike-Bowditch-Mysteries-ebook/dp/B018291NM4",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81XBCnRFbLL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Paul Doiron",
            "link": "https://www.amazon.com/Paul-Doiron/e/B002SEJ7EQ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1197,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In Paul Doiron's riveting novel Widowmaker, Game Warden Mike Bowditch is on the trail of a ruthless vigilante amid the snow-covered mountains of MaineWhen a mysterious woman in distress appears outside his home, Mike Bowditch has no clue she is about to blow his world apart. Amber Langstrom is beautiful, damaged, and hiding a secret with a link to his past. She claims her son Adam is a wrongfully convicted sex offender who has vanished from a brutal work camp in the high timber around the Widowmaker Ski Resort. She also claims that Adam is the illegitimate son of Jack Bowditch, Mike’s dead and diabolical father—and the half-brother Mike never knew he had.After trying so hard to put his troubled past behind him, Mike is reluctant to revisit the wild country of his childhood and again confront his father’s history of violence. But Amber’s desperation and his own need to know the truth leads Mike on a desperate search for answers—one that takes him through a mountainous wilderness where the military guards a top-secret interrogation base, sexual predators live together in a backwoods colony, and self-styled vigilantes are willing to murder anyone they consider their enemies. Can Mike finally exorcise the demons of the past—or will the real-life demons of the present kill him first? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B018291NM4"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Minotaur Books; Reprint edition (June 14, 2016)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 14, 2016"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2901 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 317 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#126,931 in Kindle Store (See Top 100 in Kindle Store) #1,114 in Traditional Detective Mysteries (Books) #1,233 in Traditional Detective Mysteries (Kindle Store) #2,911 in Murder Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,197 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. B. Hoyos",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH36N5HJJQCBDAURJUTFAIB4GRFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R43Q1OBIVGSP4?ASIN=B018291NM4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 15, 2016",
                "reviewTitle": "5.0 out of 5 stars While Searching for His Missing Half-Brother, Mike Bowditch Enters the Bizarre World of the Sexual Predator!",
                "reviewText": "Paul Doiron’s “Widowmaker” is one of the most bizarre, provocative installments in the Mike Bowditch series. A beautiful, conniving woman, Amber Langstrom, convinces Mike that her young son, Adam, is his half-brother. Adam is a recently paroled convict, imprisoned for statutory rape, who is missing. Blood found on Amber’s stolen truck indicates that he could be dead. Mike’s search for Adam leads him to the Widowmaker, a ski resort with a tragic, unsavory past, and Don Foss Logging, a camp where sex offenders harvest timber under harsh, slave-like conditions. The setting is incredible. Mike, a game warden for Maine, must endure bone-chilling temperatures and tall snowdrifts during his perilous search for Adam. It’s a cruel, frozen world of which I do not want to be a part. During his odyssey, Mike encounters a multitude of strange characters that include a transvestite; murderous drug dealers who own a hybrid wolf; and three elderly, influential men who call themselves “The Night Watchmen.” Mike’s already strained relationship with his biologist girlfriend, Stacey Stevens, is nearly severed by a horrific tragedy. In fact, tragedy abounds in “Widowmaker. Mike’s heart is broken many times. He can’t escape the hideous shadow cast by his notorious, extremely abusive father, Jack Bowditch, a poacher, who killed two men. Everyone, especially Amber Langstrom, reminds him of how much he resembles Jack. Now that he has a half-brother, Adam, he will never be able to escape Jack. Adam will be a constant reminder. Mike’s heart yearns desperately for a family and this desperation convinces him to search for Adam. Mike is in a constant state of emotional turmoil. He believes Adam received a raw deal. He had sex with his juvenile girlfriend, Alexa Davidson, who was only a few years younger than him; her angry parents filed charges. Many readers may feel the same as Mike. “Widowmaker” is extremely controversial and provocative. It begs the question: Do sex offenders deserve the harsh treatment that is inflicted upon them by the public? In the state of Maine, sex offenders can’t own a weapon. I didn’t think this was fair; I thought owning a weapon is a constitutional right. Does this mean that registered sex offenders don’t have the right to defend themselves, especially against certain members of society who would love to see them dead? One character, Logan Dyer, can’t sell his home because it is next to the logging camp where sex offenders work. Mike believes it must be like living next to a toxic waste dump. “Widowmaker” is extremely engaging. Mike Bowditch experiences one tense moment after another. He narrowly escapes death several times. My favorite scenes involve him and the wolf hybrid, Shadow. This dog is nearly pure wolf; it is an extremely beautiful and intelligent creature. Mike develops a strong attraction towards it. He misses not having a pet. He also spends a few nights with District Warden, Gary Pulsifer, and his family, which includes two dogs that leap into his bed, helping to keep him warm at night. Mike begins formulating plans to further his relationship with Stacey and create a family. I read Paul Doiron’s “Widowmaker” while listening to the audio version on eight CDs. Henry Leyva, an actor, gives a superb performance when reading “Widowmaker.” He has read many of Doiron’s other novels. In fact, he has quite a resume when it comes to reading the novels of best-selling mystery writers. I can clearly understand him and he provides each character with a unique voice and personality. He reads each word very carefully. I learned that Bowditch is pronounced Bo-Ditch (as in a gift bow), not Bow-Ditch (as in a ship’s bow). My only complaint is that not all the CDs stopped at the end of a chapter. Sometimes they stopped at the end of a paragraph within a chapter. I always take notes to keep from becoming lost. Overall, “Widowmaker” is another awesome installment in Paul Doiron’s unique, highly engaging Mike Bowditch mystery series. His fans will not be disappointed. My only complaint is the lack of closure. Not all of the guilty parties are punished. Perhaps that will happen in a later installment. This often occurs in real life. Bowditch silently surmises: “The injustices of this world are why we so desperately dream of a better one yet to come.” I truly believe that a better world will follow this one. Until then, I will continue reading the Mike Bowditch mysteries.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "summerlover48",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2PY2BL3ODVOB2X3PXNIQNFTX5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3REFHRBAXGDIU?ASIN=B018291NM4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2016",
                "reviewTitle": "4.0 out of 5 stars Interesting story and characters",
                "reviewText": "I've read all of Paul Doiron's books. This was not my favorite but it certainly was well written with colorful characters. I sometimes read in bed and fall asleep over the book, in this case, I read in bits and pieces missing cohesiveness. If I had read larger portions at a time, I might have enjoyed it more. I do love reading about places I've been to in Maine. His characters are unique and not always likeable. The plot was well developed and came to a good final comic.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon G. Mensing",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMNA5DTXUOOLR4NPKZOP7D32NLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EEN9DLPB7VQM?ASIN=B018291NM4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2016",
                "reviewTitle": "5.0 out of 5 stars Bowditch matures",
                "reviewText": "Doiron does not disappoint in his most recent Mike Bowditch mystery, WIDOWMAKER, set in Maine as are all in the series. As the book opens, Bowditch finds a strange woman on his doorstep and finds her story even stranger. She asks for his help finding her son Adam, who she claims is Bowditch's half-brother. While Bowditch is skeptical of this claim, there is enough resemblance, both physical and behavioral, between Adam and Bowditch's father that he believes in the possibility. When the young man's mother explains that Adam has just been released from prison after being convicted of statutory rape for a relationship with a teenage girl, Bowditch is intrigued. When Bowditch is wounded on duty and told not to return to work until he recovers, he decides to take on the investigation.Before he disappeared, Adam had been living and working amongst more serious sex offenders in a logging camp close to the area where Bowditch grew up and not far from the ski resort where his father once worked: Widowmaker. Bowditch heads up to the area to talk to Adam's old friends and the owner of the logging camp. He finds both quirky and menacing members of the community, along with a great deal of hatred for the ex-prisoners working at the logging camp. As in all of the books in the series, the resulting murder and mayhem is fast paced, grabbing the reader and making the pages fly by. In the end, the question of what happened to Adam is solved along with the question of his heritage.The book is not all thrilling action, however. Bowditch is maturing through the series, and here he is introspective about his relationships with his father, with his girlfriend, and with the wildlife service for which he works. While at the start of the series it was not difficult to see Bowditch as a 20-something beginning his career as a game warden, the five or six years that have passed since then have made him seem old beyond his years. Bowditch's maturation has made it possible to read each book as a standalone, but it is even more rewarding to read the full series to see how Doiron has managed Bowditch's development.Doiron writes beautifully of the landscape of the Maine wilderness and of its wildlife. A wolf-dog that plays an important role in this book is described lovingly while still recognizing its majestic wildness. The descriptions of the hidden, rural homesteads take the reader to the locations, and one's fingers and toes may tingle with the cold while reading this book. Plot, character, location – all are masterfully handled in this seventh in the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PAMELA B. LINDEMAN",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP275AKWV3OB2RFCJ7DXR7YHMYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHL0NR2ZNBKR1?ASIN=B018291NM4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "5.0 out of 5 stars This is a new author for me",
                "reviewText": "I live his books and read all 14 of the in 2 weeks.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Syl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 6, 2019",
                "reviewTitle": "Love that author",
                "reviewText": "Good book, good author, always good a Paul Doiron book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "warmhearted",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 4, 2017",
                "reviewTitle": "An interesting read",
                "reviewText": "Another good read by Mr. Doiron. He sure puts in a lot of miles in one day. It seems his books are only a week long before he gets to the finish line. There is a lot of sartorial comment; one way to dress up a page, I guess. Oops. However, he does solve the crime and there is usually a happy ending which is always nice. Now, for the next book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 16, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "Great read! Keep them coming!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 24, 2016",
                "reviewTitle": "Dull plot.",
                "reviewText": "So disappointing! I didn`t finish reading it! Dull plot...just went on and on, blah, blah, blah. I loved the Poacher Son, so, thought I was buying another good one. :(",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}