{
    "remaining_requests": 78,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Digging-Daisy-Mainely-Murder-Mystery/dp/0593546652",
    "body": {
        "name": "Digging Up Daisy (A Mainely Murder Mystery)",
        "price": "$8.99$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Digging-Daisy-Mainely-Murder-Mystery/dp/0593546652",
        "soldBy": {
            "sellerID": "A1SEZ1X8R7XDBP",
            "name": "Burlington MA- Used Book Superstore -new books too",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1SEZ1X8R7XDBP&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81tJHV33W0L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sherry Lynn",
            "link": "https://www.amazon.com/Sherry-Lynn/e/B0BS7YY7GR/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Burlington MA- Used Book Superstore -new books too",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 50,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Sherry Lynn spent countless summers on the coast of Maine, knowing she’d one day return to write about the magical location from her youth. Curious by nature, sleuthing became the perfect fit for her, and she has written multiple cozy mystery series under several pseudonyms. Currently, Sherry lives in the Midwest with her husband, but she dreams about one day retiring oceanside with a good book in her hand. Excerpt. © Reprinted by permission. All rights reserved. Chapter 1 Kinsley Clark inhaled deeply. The salty sea air, along with a whiff of the nearby beach roses, sent a smile to her lips. The combined scent was intoxicating. She remembered planting the vivid fuchsia and white shrubs with her aunt Tilly soon after she'd moved into the caretaker's cottage behind her aunt's seaside estate. The Salty Breeze Inn, a mammoth cedar-shingled structure, weathered from the sea, stood proudly above the cliff walk. Trimmed in crisp white, the inn provided the perfect muted backdrop for a bounty of colorful floral hues. Kinsley turned to glance over her shoulder and eyed the scrub brush. The roses had grown wild along the coastline, their tendrils filling every crevice the untamed branches could reach. The silky blossoms fluttered in the cool wind yet pointed up to the light, as if sunbathing in the early-June sun. At twenty-nine, Kinsley didn't realize how that season of planting would define her. Now, owner of SeaScapes, a thriving landscape design company in Harborside, Maine, she almost had to pinch herself. If not for the training her aunt Tilly had given her while she was growing up, Kinsley's entire career might have remained only a wish. Countless designers, landscapers, and artists only dreamed of working for the wealthy coastal homeowners of prominent Harborside. Because she was raised behind the Salty Breeze Inn, perched high above the well-worn cliff walk, the neighbors trusted her. They'd all witnessed the magic she'd created with the lush yet rugged southern Maine landscape, and the neighbors, wild with envy, wanted to replicate the picture-postcard splendor. Sometimes good things do come out of the ashes, Kinsley thought as she turned her attention to face the sea. She returned the other half of an uneaten ham sandwich to the small wicker basket that held the rest of her lunch. She loved taking lunch breaks outside at her favorite spot-a hidden crevice, deep within the rugged rocks, that provided shelter from the crashing waves. This was her office. And not for a moment did she take it for granted. The sound of the waves had soothed her like a lullaby ever since she'd turned thirteen and moved permanently to Maine after her parents' passing. The lullaby had turned into a sweet song, as the sting of loss had been replaced by her aunt Tilly's unending, unconditional love. Kinsley had certainly grieved her parents, but she didn't miss the constant household moves from her youth because of their ever-changing deployments. Her brother, Kyle, however, never tired of the changes. He'd enlisted in the Air Force, following in their parents' footprints, just as soon as he'd turned eighteen. Currently, Kyle lived on a base in Germany, and they didn't connect as often as she'd like. She hadn't seen him in eight months yet prayed for him daily. The numerous Air Force bases had never really felt like home to Kinsley. She, like a perennial flower, always longed for a steady place in which to put down permanent roots. Aunt Tilly's inn, perched high above the Atlantic, had given her that grounding. Years later, no longer a gangly teenager with a mouth full of braces, she still loved living in Harborside. After Kinsley graduated from high school, her aunt had moved out of the caretaker's quarters that they'd shared and converted a room at the back of the inn for herself, leaving the cottage solely to her niece. Kinsley transformed the space into her own private oasis, where she resided and occasionally met with clients for SeaScapes. Although the caretaker's cottage came equipped with a fully functioning kitchen, Aunt Tilly still spoiled her with homemade dishes from the inn after an exhausting day of gardening work. Despite Kinsley's age, she didn't decline the hospitality her aunt so freely gave, or protest the occasional luscious meals packaged and secretly tucked within the confines of her refrigerator, waiting to be reheated at a moment's notice. Her aunt tended to show her love through food, and Kinsley willingly obliged. Kinsley brushed the loose hair that had escaped her long blonde braid away from her face with her forearm. Her hair would be bleached platinum by summer's end due to the many hours working outdoors. She then wiped her hands along her faded jeans to remove any remaining crumbs or mustard remnants from her sandwich. She hated to leave the comfort and the roaring sound of the ocean, but she had a lot more work to do. Kinsley had promised her aunt Tilly that despite her ever-growing list of clients, she'd replace the hydrangea bush that had perished last winter, clean up the yard, and place full, blooming containers throughout the property. The colorful containers were needed, as the summer perennials were not yet in full swing, and she needed to beautify the place before the big event that her aunt was participating in for the third year in a row-the Walk Inns. The Walk Inns was an annual parade of homes, where several local bed-and-breakfast establishments signed up for an open-house showcase tour. Attendees obtained a map showing the participating homes and walked the route, going through the inns at their leisure. Since most of the inns that had taken part were now official SeaScapes clients, the event gave Kinsley a chance to showcase her work, too. Last year, she'd been featured in Coastal Living, standing alongside one of the stately Harborside homes. Kinsley hoped this year good things would come for Aunt Tilly, too-like a chance for the Salty Breeze Inn to be featured in the prominent magazine. But she'd better not get ahead of herself-though one couldn't blame her for daring to dream. She had always believed her aunt deserved so much more than she could possibly ever repay. Tilly's giving spirit was the heartbeat to not only her, but their community as well, as she volunteered for anything and everything, despite her own long hours of work. Kinsley flipped the wicker lid closed on her lunch basket and then rose to a standing position. She stretched her arms high above her head and inhaled one last cleansing breath before grudgingly retrieving the basket and tuning her back to the sea. After dodging a few tidepools scattered with sea urchins, and navigating across several seaweed-covered boulders, she finally made her way safely atop the cliff walk. The concrete cliff walk flanked the Salty Breeze Inn, traveled the coastline, and spanned miles in both directions from her aunt Tilly's estate. To the right, if she continued down the path for roughly half a mile, it would take her to the private sandy beach reserved exclusively for Harborside residents. To the left, the cliff walk would snake its way to the marina where yachts and sailboats moored idly in the water, waiting for their captains to navigate them to the Atlantic Ocean. And beyond that, Breakwater Lighthouse jutted out from the mile-long rock jetty, waiting to guide vessels safely home in the event the fog rolled in, or an impending storm broke. Which, in Maine, was quite common. Kinsley promised herself that a boat would somehow be in her future. She hated to take that leap now, though, as the summer season was the busiest time for SeaScapes, and she wouldn't have time to enjoy that type of luxury. Although winter had its own appeal for her business, too. She loved the opportunity to decorate the wealthy Harborside homes and businesses for Christmas with live greenery, seasonal poinsettias, red roses, and dried hydrangea that she herself had cut when the summer blooms had faded and they'd had a lengthy time to hang upside down to dry. The sound of a whistle caught Kinsley's attention, and her eyes, the color of the sky on a cloudless day, traveled upward to see her aunt waiting for her atop the wide flagstone staircase. The staircase, which wound directly from the cliff walk to a path, led guests to a wide porch that faced the sea. A favorite spot for Salty Breeze guests to relax after a long day in the sun. \"Oh, there you are! Something told me I might find you hiding out here.\" Matilda Hartwig stood atop the rock staircase with her arms wrapped around herself to prevent a light sweater from billowing in the wind. She quickly buttoned the sweater in an attempt to secure it. Her chin-length brown hair, highlighted with a hint of silver, also shifted with the changing breeze. She attempted to smooth her hair with one hand, but to no avail. \"Aunt Tilly, what's the matter?\" Kinsley took the remaining flagstone stairs two at a time to greet her aunt with a half hug at the wide landing. \"Nothing, darlin'. I was just wondering if you wanted to share lunch. I'm taking a minute while many of my guests are off playing tourist, and I thought you might want to join me.\" Her hazel eyes, the color of toffee roses, sparkled with mischief. Kinsley wondered what her aunt was up to. \"I was about to whip up something yummy for us to share, but it looks like you've already eaten.\" Tilly's smile faded as she gestured to the basket in Kinsley's hand. \"Trying out a new recipe? Or do you have something else you want to chat about? You know I always take my lunch breaks out here, any chance I get.\" Kinsley countered the twinkle in her aunt's eye with a raised eyebrow. \"I was hoping we could talk about the event. We've been like two ships passing in the night lately, and I was hoping I could run a few ideas by you. I love your input on these things, especially since you've had a sneak peek at some of our competition.\" \"Ah, I see.\" Kinsley knew there was something prompting this spontaneous lunch visit. It was uncommon for the two to share time during a busy workday. They scarcely saw each other in passing, both fiercely obsessive with their respective work. Some evenings, however, they would sit on the oversized white wooden rockers atop the wide wraparound porch overlooking the ocean. They'd catch up on the day's events over a cup of herbal tea or a late supper. But it had been days since that had happened. Kinsley looped her arm through her aunt's and turned them in the direction of the inn. \"Tell me what's on your mind. I can't really divulge much of what's going on with your competition, because I'm only working outdoors, but I still might be able to help. Do you have additional ideas for the floral decor? I've already decided instead of using your old containers the way they are, I thought I'd spray-paint them to freshen them up a bit before planting. I was also thinking about adding a floral garland to the posts on the porch. What do you think about that idea? Let's walk and talk, shall we?\" Kinsley smiled. \"I have sooo much to do.\" Tilly patted her niece's arm as they walked. \"No, I trust your judgment on the floral design. That's your wheelhouse; I wouldn't dare touch it. Actually, I'm wondering what hors d'oeuvres to serve this year. Do I really have to serve a lobster dish again? Every event I host, we have lobster. Have you heard any chatter about what the other inns might be serving? I'm a bit lobstered out, to be honest.\" Her tone was weary, but then she smiled, causing her age lines to crinkle in the far corners of her eyes. Besides those lines, no one would ever guess her aunt was sixty-two. People often said she looked as if she were in her late forties, which always made Tilly throw her head back in laughter. \"I know you're about fished out, Aunt Tilly, but you have to remember, folks travel from all over for this event. They want the true southern Maine experience. Although you are blessed to have fresh lobster literally waiting for you in your backyard, most people don't have access to that. We're a bit spoiled here, you know.\" Kinsley grinned. Tilly sighed. \"Oh, I suppose you're right. I just want to stand out from my competition. Doesn't everyone on the tour serve lobster something or other?\" She frowned, stopped midstride, and turned to face Kinsley, and then made funny fish lips at her. Kinsley smiled at her animated attempt at a fish face but then turned serious. She placed her hands on her aunt's shoulders, looked intently into her eyes, and said, \"I know how much pressure you put on yourself for everything to be absolutely perfect. Since you love to try new recipes, maybe you just need to create something different? Use the local ingredients but put your own spin on it. You really have a knack for that,\" Kinsley said, smacking her lips in anticipation of what her aunt might come up with. \"Thank you, darlin'. You're right, as always.\" Tilly moved a wisp of hair away from Kinsley's eyes, and Kinsley sensed the deep love in the gesture. \"Maybe I'll make the usual lobster-type fare . . . but add a special finger food dessert.\" A new twinkle caught her eye. \"Exactly. And I'd be happy to sample test recipes-I haven't outgrown licking the bowl. You know, someone has to do the dirty work around here, and not just in the soil,\" Kinsley said, nudging playfully. \"Let's face it. The other inns on the tour have nothing on you. Your delicious food and the hospitality you provide are the bee's knees,\" she added emphatically. \"I can't help that I might be a little biased, too.\" The two shared a wide smile and then they turned back toward the inn. Her aunt moved with a new urgency in her step and hurried a few strides ahead. \"Something deliciously chocolaty, and ooey gooey, and rot-your-teeth sugary,\" Tilly said in a faraway voice. \"A finger food . . . something guests can grab and carry . . . but something they'll crave for days on end . . . something that will make them never forget their visit to the Salty Breeze Inn . . .\" \"Now, that's the spirit!\" Kinsley caught up to her aunt's pace before they made their way to the wraparound porch that faced the ocean. When they arrived at the bottom step, she handed her aunt the lunch basket. \"Would you mind tucking the other half of my sandwich inside your refrigerator? I don't have time to run back to the cottage and put it in mine. I've got so much to do around here before sunset. I can pick it up later.\" \"I'll do one better; I'll eat it myself!\" Tilly said with a laugh. \"Then I can get going on digging into my recipe books to brainstorm and maybe kick some ideas around instead of wasting precious time making lunch for myself.\""
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 3 hrs 33 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 15 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In a fresh new Maine-set cozy from author Sherry Lynn, Kinsley Clark must root out a killer before the killer roots out her.At twenty-nine, Kinsley Clark is living the dream life she always envisioned for herself. She’s the proud owner of SeaScapes, a thriving landscaping company in wealthy Harborside, set on the rugged coast of southern Maine. Kinsley’s veins are filled with salty air, a myriad of colors, and the fragrance of fresh blooms. But one afternoon, while working at her aunt Tilly’s bed-and-breakfast, the Salty Breeze Inn, Kinsley digs up more than she bargained for—a high-heeled shoe. The once sparkly shoe, now caked in mud, is linked to a case the police had appropriately dubbed the \"Cinderella Murder.\"Kinsley panics. Does this mean that her aunt and the inn are somehow connected to this murder? Will it scare away potential guests? Will it subject the inn to a rush of bad press? With Aunt Tilly’s reputation, and possibly her safety, on the line, Kinsley digs deeper into the crime to find out what the shoe was doing on her aunt’s property and who murdered Cinderella, whose real name is Daisy. As she investigates, more suspects rise to the surface, and eventually, Kinsley has to weed out a killer. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10457"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (April 4, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593546652"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593546659"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.15 x 0.8 x 7.92 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#298,034 in Books (See Top 100 in Books) #1,919 in Cozy Culinary Mysteries #6,920 in Amateur Sleuths #11,113 in Women Sleuths (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 50 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kimberly Rhodes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFODE6IQ4GG3VSL6I6ZPZCBSMOYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PHZCBRHLCKM1?ASIN=0593546652",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Packaged well and arrived on schedule.",
                "reviewText": "Arrived as seller described.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deborah M Almada",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEFJEENQ2KRIH5JS3BZ5XJID67Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7W896ZYUVEOP?ASIN=0593546652",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2023",
                "reviewTitle": "3.0 out of 5 stars Some pros and cons",
                "reviewText": "This was an interesting start to a new series. I loved the setting of the Maine coast, the author had a great ability to make the setting feel alive, the characters were good, the mystery a bit weak. I have to admit this book got off on the wrong foot for me when the main character Kinsley, did something with a piece of evidence, in a local murder, that was beyond belief and then when the police get involved they give her a bye, just too much to be believable. I definitely feel like this series has potential but there needs to be more than just wonderful scenary and likable characters, there needs to be a real mystery and realistic actions taken by those characters. I will give this series one more try.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cozybooklady ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFH5OC2JRHDDY2WIYJAA2GXTRGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UTUZWVKE3MJN?ASIN=0593546652",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Fun new cozy mystery",
                "reviewText": "I happened to spot this book while looking for something to read.The story was well written and the characters are likeable.Aunt Tilly is a colorful character that I enjoyed getting to know.I'm looking forward to the next book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shelli L. Fiorenza",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUB2YCELFFAHVLIKQRNRJ63PU2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D6WHXID5UCDE?ASIN=0593546652",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 14, 2023",
                "reviewTitle": "5.0 out of 5 stars EXCELLENT COZY MYSTERY!",
                "reviewText": "I have read other books by this author, but this newest series which takes place in Maine is a wonderful cozy mystery with great characters, terrific story lines and twists and turns aplenty! Getting a recipe and gardening tips at the end of the book is just a fun bonus! Plus there is an excerpt from the next book in the series included at the back of the book that I will have to preorder as I want to go along on the next Mainely Murder Series Adventure. Other books by this author are also excellent and can be found under the names Holly Quinn and Holly Danvers. Enjoy the adventure!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barbara Tobey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4DMKIRMPN37YZF3GT7W4LXDIUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MJ463Y9UEJ7D?ASIN=0593546652",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Entertaining mystery",
                "reviewText": "Loved it. Sherry Lynn made me laugh and she made me cry. Clever mystery. So happy to see this is the first of a series. I am eager to read more of Kinsley's adventures. Thanks to the publisher for providing a copy via NetGalley. My review is voluntary.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Langford",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUT5F72QTGP5XOEDDBEVUBEPAOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WC8ABKQH129E?ASIN=0593546652",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent, Entertaining Cozy!",
                "reviewText": "Kinsley Clark, the 29 year old protagonist owns Seascapes, a thriving landscaping design company in gorgeous Harborside, Maine. (New England is always a favorite setting of mine). Kinsley’s Aunt Tilly, owns and runs a seaside estate, the Salty Breeze Inn. One of the enticing things about this story are all the beautiful flowers and descriptions which are so vivid I could picture the colors in my mind. The ocean view is wonderful, too. An annual event, the Walk Inns, is coming up soon, and Seascapes does much of the local landscaping for Harborside businesses and homes. Re-planting a hydrangea bush at her Aunt’s, Kinsley is shocked to dig up a pink high-heeled shoe in the flower bed! Could it be connected to the death of a woman whose body was recently found just a few miles away? Who would bury it on Tilly’s property? With those basic questions, the Cinderella Killer hunt is on for amateur sleuths, Kinsley and her best friend, Becca, a realtor.Filled with action, the two best friends escapades as they search for clues, humorous scenes, a rival landscaper who’s jealous and destructive, a nosy newscaster, lots of support from friend and local Detective Rachel Hayes, and a plethora of suspects to dig through; this cozy is a dazzling debut that quickly became a favorite. The mystery is edgy and engaging. Once the truth was unearthed and motive, means, and opportunity established, this reader was satisfied that no stones were left unturned. The author provides gardening tips and recipes for readers’ enjoyment.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHHXVI5WCWJ7HOLR7AO62RDODBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GI3FJFW2TLR9?ASIN=0593546652",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 17, 2023",
                "reviewTitle": "3.0 out of 5 stars Promising Start for a New Series",
                "reviewText": "This is a good start to a new series. I enjoyed the setting and the characters but didn't warm to them right away; they seem wooden and a little awkward but get better as the book goes on. The relationships between Kinsley and some of the characters was a little off and seemed forced, particularly with her love interest. The story, itself, was interesting but the plotting was off; it was easy to figure out who the killer was early on and the clues didn't really make a lot of sense. I will try the next in the series, hoping that the plotting improves.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MeezCarrie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY7USF434IMJ6KE5UHIDI2LKIBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D6GNUKI6WAFW?ASIN=0593546652",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2023",
                "reviewTitle": "4.0 out of 5 stars loved the setting & the characters!",
                "reviewText": "I’ve read and enjoyed other books by this author under different pen names, and I fell in love with the cover so of course I had to read it! Kinsley is a landscape artist, something that I myself wish I were talented at but alas, I have yet to meet a plant I couldn’t kill. Kinsley, however, is a pro at transforming yards into beautiful masterpieces, though someone seems set on sabotaging her work around Harborside. Not gonna lie, this totally stressed me out for Kinsley – never mind the murder investigation, let’s catch the saboteur in the act lolI adored her Aunt Tillie, and I hope I’m still as close to my nieces as she and Kinsley are when they’re grown up & I’m elderly. Aunts don’t get a lot of pagetime in fiction, so when I meet a good one in a book I perk up and take notice. Tillie is the kind of character you just want to reach in and hug, and then sit down with a beverage and a sweet treat for a nice long chat – if she has time in between tending to the B&B’s guests, of course. Her relationship with Kinsley is a lovely, positive, and affectionate one, and it’s always uplifting to have characters like that. Speaking of uplifting relationships, Kinsley’s friends Becca & Rachel are also delightful supporting players in this story and actually have fairly significant roles, too. I really enjoyed getting to know all the (hopefully) recurring characters in this series starter, and I’m particularly looking forward to seeing where the low-key romantic possibility vibes lead in the next books.The murder mystery in Digging Up Daisy is an intriguing one with many different elements in play. Where was the victim actually murdered? WHY was the victim murdered? Why did her shoe end up buried in Kelsey’s yard? Where is the neighbor’s missing dog? Is the murderer one of the guests at the B&B or someone from town? Will they solve it – and the plant sabotaging crimes – in time to avoid bad press for SeaScapes and the Salty Breeze Inn? I figured out the whodunit pretty quickly, but that doesn’t mean it was a slam-dunk. I just happened to have an inkling and guessed correctly. There were a couple of other very plausible suspects, and it wouldn’t have surprised me in the least if one of them ended up being the killer(s) instead. Lots of layers to piece together, making it fun for armchair sleuths to play along at home while reading this book.Bottom Line: Digging Up Daisy by Sherry Lynn kicks off what promises to be a fun new series! The coastal Maine, small town setting wraps around cozy mystery fans like a familiar & beloved quilt, though the residents of Harborside are considerably more well-to-do than most of Cabot Cove’s. The aunt in me loved Aunt Tilly, of course, but I also enjoyed Kinsley and her bestie Becca & their interactions. There were some things that could have been a bit tighter, to better advance the story & keep it from dragging a bit in the middle, but overall I enjoyed this first installment in the Mainely Murder Mystery series and look forward to more!(I voluntarily reviewed a complimentary copy of this book)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}