{
    "remaining_requests": 38,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Girl-Blue-Coat-Monica-Hesse/dp/0316260630",
    "body": {
        "name": "Girl in the Blue Coat",
        "price": "$8.99$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Girl-Blue-Coat-Monica-Hesse/dp/0316260630",
        "soldBy": {
            "sellerID": "A8146B9Q816MQ",
            "name": "Martistore",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A8146B9Q816MQ&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/51CE0FddcBL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Monica Hesse",
            "link": "https://www.amazon.com/Monica-Hesse/e/B00BMQP51A/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Martistore",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3768,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review The Edgar Award Winner for Best Young Adult Mystery Novel 2017An Entertainment Weekly Best YA Book of 2016 A Booklist Best Young Adult Book of 2016A 2017 Indies Choice Awards Finalist for Best Young Adult BookA YALSA 2017 Best Book for Young AdultsA New York Public Library Best Book for Teens of 2016A Notable Social Studies Trade Books for Young People Selection 2017A 2017 Bank Street College of Education Best Children's Book of the YearA 2018-2019 California Young Reader Medal nominee2018 All Iowa Young Adults Read\"Girl in the Blue Coat is a powerful, compelling coming-of-age story set against the dark and dangerous backdrop of World War II. It's an important and page-turning look at the choices all of us--including young adults--have to make in wartime. A beautiful combination of heartbreak, loss, young love, and hope.\"―Kristin Hannah, #1 New York Times bestselling author of The Nightingale\"A tapestry of guilt and acceptance, growing responsibility, and reluctant heroism, Hanneke's coming-of-age under heartbreaking circumstances is a jarring reminder of how war consumes and transforms the passions of ordinary life. Every devastating moment of this beautiful novel is both poignant and powerful, and every word feels true.\" ―ElizabethWein, New York Times bestsellingauthor of Black Dove, White Raven; Rose Under Fire; and the Printz Honor-winningCode Name Verity\"In an occupied city, a young woman's daring transforms into true courage when she confronts a mystifying disappearance. From page one, I couldn't turn the pages fast enough. Enthralling.\"―Judy Blundell, New York Times bestselling author of Strings Attached and the National Book Award-winning What I Saw and How I Lied\"It's no small feat to bring the past to life, especially a history as dark and desperate as World War II. Monica Hesse does just this with Hanneke's story. Brace yourself, dear reader, to have your heart bruised--and possibly even broken--in the most meaningful of ways.\"―Ryan Graudin, author of The Walled City and Wolf by Wolf* \"[An] affecting novel...that skillfully combines reality with fiction. Her characters come alive, and...Hesse's pacing infuses her story with thriller suspense, enriching the narrative with dramatic surprises both small and large.\"―Booklist* \"Riveting... a gripping historical mystery.\" ―Publishers Weekly* \"This fast-paced story is alternately touching, heart-pounding and wrenching-but always gripping. ...a heartrending, moving story.\"―VOYA* \"A poignant, wonderfully crafted story of love and loss, courage and redemption.\"―Shelf Awareness\"Taut and intelligent... the historical setting is rendered the way only an expert can do it.\"―The Washington Post\"The themes of love, betrayal, heroism, social responsibility, and atonement are beautifully intertwined with well-developed characters and a compelling story line. Thoroughly researched, this work brings history alive in a clear and concise way that rings true. A must-read for fans of historical fiction, especially stories set during World War II.\"―School Library Journal\"Rich in content and emotion, this is a first-rate companion to the historical tales of the onderduikers, the hidden Jews of Holland, and a compelling read\"―Kirkus Reviews\"This heartbreaking story of terror and loss sweeps you into a time-is-running-out mystery that delivers plot twists and a shocking final punch that'll haunt you for days.\"―Justine Magazine\"A moving immersion into life in WWII.\"―The St. Louis Post-Dispatch About the Author Monica Hesse is the bestselling author of Girl in the Blue Coat and American Fire, as well as a journalist with The Washington Post. She lives outside Washington, D.C. with her husband and their dog."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 9 hrs 40 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 12 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "This bestselling and award-winning novel about a teenage girl in Nazi-occupied Amsterdam speaks powerfully to the realities of grief, heartbreak, and bravery, perfect for fans of Kristin Hannah and Ruta Sepetys. Amsterdam, 1943. Hanneke spends her days procuring and delivering sought-after black market goods to paying customers, her nights hiding the true nature of her work from her concerned parents, and every waking moment mourning her boyfriend, who was killed on the Dutch front lines when the Germans invaded. She likes to think of her illegal work as a small act of rebellion. On a routine delivery, a client asks Hanneke for help. Expecting to hear that Mrs. Janssen wants meat or kerosene, Hanneke is shocked by the older woman's frantic plea to find a person—a Jewish teenager Mrs. Janssen had been hiding, who has vanished without a trace from a secret room. Hanneke initially wants nothing to do with such dangerous work, but is ultimately drawn into a web of mysteries and stunning revelations that lead her into the heart of the resistance, open her eyes to the horrors of the Nazi war machine, and compel her to take desperate action. Beautifully written, intricately plotted, and meticulously researched, Girl in the Blue Coat is an extraordinary novel about courage, grief, and love in impossible times.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Little, Brown Books for Young Readers; Reprint edition (April 4, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0316260630"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0316260633"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12 years and up"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 720L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.45 x 1.1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,732 in Books (See Top 100 in Books) #9 in Teen & Young Adult Holocaust Historical Fiction #42 in Teen & Young Adult Friendship Fiction #67 in Teen & Young Adult Mysteries & Detective Stories"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 3,768 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Girl in the Blue Coat The War Outside They Went Left The Brightwood Code Uncover the award-winning historical fiction of Monica Hesse! The winner of the Edgar Award for Best Young Adult Mystery, perfect for readers of Kristin Hannah and Ruta Sepetys An \"important\" (New York Times Book Review), \"extraordinary\" (Booklist, starred review) novel of conviction, friendship, and betrayal The Sydney Taylor Honor winning, critically acclaimed tour de force historical mystery A breathless, haunting, and rich historical mystery that speaks to the depths of trauma and the power of memory.",
                "media_link": []
            },
            {
                "media_text": "Code Name Verity Black Dove, White Raven The Enigma Game The Pearl Thief Rose Under Fire Stateless Discover more historical fiction with must-read novels from Elizabeth Wein A spy plane crashes in Nazi-occupied France. Its pilot and passenger are best friends. One may survive. The other has already lost. A spy plane crashes in Nazi-occupied France. Its pilot and passenger are best friends. One may survive. The other has already lost. An exhilarating thriller that finds three different young adults united to decode a secret that could turn the tide of World War II. This exhilarating coming-of-age story, a prequel to Code Name Verity, returns to a beloved character before she first takes flight. Allied fighter pilot Rose is captured by Nazis and sent to a women's concentration camp in this story of courage, resolve and survival. This flight competition turned murder mystery set in 1937 Europe soars with intrigue, glamour, secrets, and betrayal.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30cd7ab9-02e6-4b40-9d7c-8674ca3b56ab.__CR7,0,1200,2400_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d83883d5-cfb1-44e6-ab93-f635a0465819.__CR8,0,1200,2400_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b82ac32-e5f1-4b37-b8a7-fa823112eaef.__CR8,0,1200,2400_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1908bcb3-f854-4720-8397-20bb2d5b8327.__CR0,0,1200,2400_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d857b31c-9ffd-48ff-887a-ae2ab6859e2a.__CR0,0,1200,2400_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56f6f2ba-9203-4d97-9ebe-d4cf4f863632.__CR0,0,1200,2400_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b1b1b63c-7526-4046-b6b6-edd8c7c901b8.__CR0,0,1200,2400_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb6dc62d-7086-4491-8871-1706e2b8f439.__CR0,0,1200,2400_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e43d2ec4-2593-4597-9b1e-da814f1ea0f7.__CR0,0,1200,2400_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a919e893-b781-4978-91d7-2366f1baa6a8.__CR0,0,1200,2400_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Diana Grimes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEE54AY6MEOGD32KZPXM5AMWCFSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RDSF971631C1?ASIN=0316260630",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Intriguing read",
                "reviewText": "Def recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Delta High School Library",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRIL277P2X2ZBHJN62EOT32KGXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R341ENXVG8ROR7?ASIN=0316260630",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2022",
                "reviewTitle": "4.0 out of 5 stars Young heroism and perseverance!",
                "reviewText": "Hanneke lives in Holland with her mother and father. She’s a young woman who has lost her boyfriend in the war, who works as the undertaker’s receptionist and also helps the undertaker with black market dealings. Her jobs support her family. On one of her deliveries, an elderly woman confides in Hanneke that she’d been hiding a Jewish teenage girl, in her home, in a secret compartment behind her pantry. The girl is missing and there’s no evidence of how she left the house. The woman pleads for Hanneke to help her find the teenage girl, Mirjam. Hanneke reluctantly agrees to help so she starts searching for any information she can find on Mirjam. As she’s searching, she inadvertently ends up at a resistance group meeting and becomes accidentally involved in a delivery of a Jewish baby, to an adoptive family, after the baby’s family had been detained by the Nazis. Hanneke learns about all of the ways that young adults around her have been helping with the resistance and she sees how selfish she was by keeping to herself and not becoming involved but that changes during her search for Mirjam. The young adults work together to find Mirjam and help everyone they can in this inspiring story of young heroism and perseverance. A wonderful character building historical fiction book, 4 stars!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra K. Stiles",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHFS6UZL4VK7A6HAEQEA3DXCXSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V9XC9V0G7RAR?ASIN=0316260630",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2021",
                "reviewTitle": "5.0 out of 5 stars Great Historical Fiction",
                "reviewText": "This is a book I am excited to put on my school shelves. Hanneke is a young girl in Amsterdam in the middle of Nazi occupation. She smuggles goods to help out. One request will set her on a dangerous journey. Hanneke has been asked to locate a young Jewish girl named Mirjam. For this assignment she will need to get help from a resistance group. The book is true to WWII and the horrors of the Nazis. One reason I find this such an important book for my school shelves is that we have a holocaust unit. I try to provide great books that accurately tell of the holocaust events. So many people sided with the Nazis, not because they hated the Jews but because they wanted to improve their own position in life. Some were just bystanders who didn’t agree but didn’t want to get involved. This book shows so many sides to this war. As a word of caution it is full of the violence that so many experienced. This type of history should never be watered down. I applaud this author for telling a story that is authentic and exactly what kids and adults should learn. We need more books like this that show the importance of resistance groups and people like Hanneke.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LidiaM.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF463K27EAANC5NNDDHJYC7BTWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y4UXRKOVNASG?ASIN=0316260630",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2023",
                "reviewTitle": "5.0 out of 5 stars So, so good!",
                "reviewText": "Beautiful written book. Once you start to read this book ,you will not be able to put it down. Love the book!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Me encanto súper bien y recomiendo 100%",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3UYUWR2I56GX6VL4VDKND72FVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25FYDONRD5RFI?ASIN=0316260630",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Muy buen libro",
                "reviewText": "Llego muy bien, páginas de buena calidad y tamaño de letra .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWQTWH7KR6H5CC23E6ZSD3RFESQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XPBK2C608AWK?ASIN=0316260630",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2017",
                "reviewTitle": "3.0 out of 5 stars Decent read, Parental Guidance Included",
                "reviewText": "In the midst of World War II, a girl makes a living smuggling goods to others in her city. Lipstick, food, coffee, you name it. But one day a customer as a request for something she has never found before. A girl. And when her path becomes intertwined with people from her past, will they together be able to find the girl before she is gone forever?This book was pretty good. I love historical fiction books, especially during the WWII time period, so I have enjoyed books such as The Girl from the Train (or is it the Girl on the Train?), Number the Stars when I was younger, Night, etc. This book had an interesting storyline I had not seen before, hitting off of the fact that certain goods were rare and people still wanted them, hence how the girl in the blue coat made her living. The writing was decent, could have been better, and some things were not necessary. If you do not pay attention things can get a little confusing.There was suspense throughout the book, characters were ok, but I did not like how it did not delve deeper into WWII and remained on the surface about a lot of things. SO, recommending this to younger YA readers, maybe middle school and up because of this and the writing not being super advanced.Parental Guidance: no curse words, sex/nudity, no extreme violence or graphic scenes, etc. Some people might want to know there is one character who turns out to be gay so some might keep that in mind when allowing a younger child to read the book depending on the parent/adult",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Hampton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2E5LXLVKTDHYNLB5OFX7HBMX4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R311FQY0EUVH3A?ASIN=0316260630",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 21, 2022",
                "reviewTitle": "4.0 out of 5 stars Great Read",
                "reviewText": "I enjoyed this book. It was slow going in some parts but worth it in the end. There was a surprise I never saw coming, but ended up completing the book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gottaread",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGBYXUNXNMAO3BEO2R3Y3FJD4DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D0RKZB8E0TR?ASIN=0316260630",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2019",
                "reviewTitle": "5.0 out of 5 stars Amazing",
                "reviewText": "Amazing read! Wow. Makes you think, a lot. I quickly started caring about Hanneke and admired her determination and courage. War brings out so many different parts of our humanity. Hanneke reminds us of the need to harden oneself and look for every way to survive. The story is written so well that you feel pangs in the heart with agonizing loss and hope. It is beautiful that our basic need to love and be loved does not disappear. Ollie is an unsung hero. He is good to the core and I so very much liked him. Judith and Mina are wonderful and thankfully people like Mina left us evidence of the atrocities. I appreciated all the characters and the detail given to them, their roles, and to their surroundings. These teenagers and young adults had to tackle issues and situations that are too complicated for adults. The story was true to emotions dominating until someone managed to steady the situation and be a voice of reason. Anger, frustration, fear, forgiveness, love, bravery and much more were well portrayed. It was incredible how well written the story is and how I did not want to put it down. There were many twists and turns with quite a few surprises. This book is not only for the YA readers. It's a must read, especially if you enjoy historical fiction.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Berengaria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 10, 2021",
                "reviewTitle": "Buena trama.",
                "reviewText": "Un libro entretenido, pero sentí que estaba escrito para lectores jóvenes que aún no saben mucho de los horrores de la guerra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nipo55",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 10, 2020",
                "reviewTitle": "Da non perdere!",
                "reviewText": "Come dimenticare Anneke e la sua ricerca di Miriam? Ho così amato questo libro da rileggerlo. Col suo bel romanzo carico di suspense, la Hesse ci porta nell' Olanda occupata dai nazisti. È una storia sulla presa di coscienza individuale della necessità di lottare contro la barbarie ed anche una straziante storia di amicizia. Da non perdere!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fernanda Furlani",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 19, 2019",
                "reviewTitle": "Very beautiful and powerful",
                "reviewText": "A story about young love, pain and heartbreak that is written with kindness and perfection",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hashit ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 15, 2019",
                "reviewTitle": "Average",
                "reviewText": "Average",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nana S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 19, 2019",
                "reviewTitle": "Mitreißend!",
                "reviewText": "Sehr schönes und mitreißendes Buch, das viel über die damalige Zeit vermittelt.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$4.07",
                "sellerName": "Revolver Market",
                "sellerRating": "4.5"
            }
        ]
    }
}