{
    "remaining_requests": 25,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Murder-Chianti-Camilla-Trinchieri-ebook/dp/B07XXBJY3X",
    "body": {
        "name": "Murder in Chianti (A Tuscan Mystery Book 1)",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Murder-Chianti-Camilla-Trinchieri-ebook/dp/B07XXBJY3X",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/518hFMJs7IL.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/51rtSQVhWDL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Camilla Trinchieri",
            "link": "https://www.amazon.com/Camilla-Trinchieri/e/B01F43NT14/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2210,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Set in the heart of Tuscan wine country, Camilla Trinchieri's new mystery introduces Nico Doyle, a former NYPD homicide detective who's just looking for space to grieve when he finds himself pulled into a local murder investigation. Mourning the loss of his wife, Rita, former NYPD homicide detective Nico Doyle moves to her hometown of Gravigna in the winesoaked region of Chianti. Half Italian and half Irish, Nico finds himself able to get by in the region with the help of Rita’s relatives, but he still feels alone and out of place. He isn’t sure if it’s peace he’s seeking, but it isn’t what he finds. Early one morning, he hears a gunshot and a dog's cries near his new home and walks out to discover a dead body in the woods, flashily dressed in gold tennis shoes. When the police arrive, Nico hastily adopts the fluffy white dog as his own and wants nothing more to do with the murder. But Salvatore Perillo, the local maresciallo, discovers Nico's professional background and enlists him to help with the case. It turns out more than one person in this idyllic corner of Italy knew the victim, and with a very small pool of suspects, including his own in-laws, Nico must dig up Gravigna’s every last painful secret to get to the truth. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10457"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07XXBJY3X"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Soho Crime (July 7, 2020)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 7, 2020"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1416 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 314 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1641291796"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#96,735 in Kindle Store (See Top 100 in Kindle Store) #631 in International Mystery & Crime (Kindle Store) #803 in Traditional Detective Mysteries (Books) #906 in Traditional Detective Mysteries (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,210 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0ce73b82-78c5-4c1b-b6f8-ad77d9c42228.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Roxanne P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFSNNVODKDAQQ5BXSIZBNJIILBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EGXDMCO1WHHF?ASIN=B07XXBJY3X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Enjoyed like a good, rich Chianti",
                "reviewText": "This is what I would call a fun mystery read. There was good character development for the main characters, but I missed some details on some of the lesser characters who became important. That, however, did not deter from the page turning interest so crucial to a good mystery. I thoroughly enjoyed reading Murder In Chianti and look forward to following up with the next one in the series.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patto",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF62B4CNSFVYEQNOQKROHNGC5MUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RC4K4WOPI55Y4?ASIN=B07XXBJY3X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2021",
                "reviewTitle": "4.0 out of 5 stars Strong on atmosphere, characterization and plot",
                "reviewText": "A man is murdered in a woods where the locals go to gather mushrooms. No ID on him, but the way he’s dressed suggests an American. The local head of the Carabinieri, Salvatore Perillo, feels he doesn’t have the experience to deal with a complex murder case, so he befriends Nico Doyle, a former New York Homicide detective, and cleverly ropes him into giving advice.The characters feel very real, and life in a small Tuscan is attractively portrayed. Nico has abandoned New York to live in Tuscany where he can morn his Italian wife in her hometown and be near her relatives. There’s an old man who wanders through the narrative wearing an old coat and quoting Dante. Nico is kind to him. In fact Nico is kind to everyone. Half Irish and half Italian, he doesn’t quite belong, but everybody likes him. He helps his wife’s cousin in her restaurant, and is a good cook himself.It has to be faced that this novel has a lot in common with Martin Walker’s popular series featuring Bruno. While Bruno is Chief of Police in his small town, and Nico has no official status, they are both detecting. Both love to cook. And food and wine figure large in the story. Both authors go on too much about meals for my taste. A few details would be enough for me. But I realize most readers love this.Anyway, the love elements and flirtations in this book are very well handled. The investigation is engaging. And overall, I really enjoyed spending time in the Tuscan world of Camilla Trinchieri. I’ve ordered the next book in the series.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kimberly R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW4E6EMCFORLY3RCIEBBFTJ2XDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Y4TABRLBK30D?ASIN=B07XXBJY3X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Authentic Tuscany",
                "reviewText": "The author weaves authentic Tuscan dishes and customs into her mystery. Every time I pick the book up, I get hungry. Easy Pleasant read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aunt Peggy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVKHZJ36UO6OG2EDQWYPR4VMKYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WULQCS456IH2?ASIN=B07XXBJY3X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2023",
                "reviewTitle": "3.0 out of 5 stars An okay series when you find yourself in between really great books.",
                "reviewText": "As someone else has said, this series is similar to the Bruno series by Walker and Donna Leon's Brunetti series. All three follow one character and include many details of their cities, regions, personal lives, and internal conflicts as well as their professional work. For me, this is in the middle because while I like aspects of the CI Bruno stories, as written by a male author the main character is a consistently heroic, smashingly intelligent, an amazing cook and gardener, and surrounded by fabulous women he can't get enough of nor can he seem to decide between. On the top end of the trio, Brunetti is a charming husband and father, often dismayed by his children as they grow up, and a clever but not perfect Commissioner who solves the crimes but with the help of others.In this case, Nico Doyle is in between. His story is interesting, he's helpful to the local Marshal (Maresciallo, in Italian?) drawing on his experience as a retired NYPD homicide detective, but mostly trying to live his new life in this small village in Italy. He cooks well but not perfectly, befriends and is befriended by locals, falls in love or maybe just temporary lust with a local artist, breakfasts every morning with the town \"character\" nicknamed Gogol, etc.The series is good for local color, heavy on cooking and recipes, charming, but slow paced. Nothing is shocking, and in each case I've guessed at the murderer by the middle of the book. Usually there's one pretty strong hint early on that gets buried with other detritus along the way, but still....And I have to add one pet peeve, not only of these characters but regarding something that has been frequently turning up in current novels recently. Authors are introducing older female characters and describing them with badly dyed hair, wrinkled skin, poor health, sedentary behavior, curmudgeonly dispositions, and generally as near-end-of-life. And then they finish the description with the character's age which is often in their late 60s!!!! They have just described a person who sounds closer to late 80s in age. It's becoming offensive, particularly when the male characters in their late 50s and early 60s are described as being clever, active, appealing, and very much 'middle aged'. If it's just a chronology issue with their characters, the writers need to work on that. If they need an \"old\" person, maybe it needs to be a grandparent and not a parent?",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dom Miliano",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIHXX7KL4X5IJWZSOJNGNQUV3KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ33LDDWCFCHR?ASIN=B07XXBJY3X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2022",
                "reviewTitle": "4.0 out of 5 stars Armchair travel for fans of Italy and mystery",
                "reviewText": "We meet a transplanted American living in Tuscany - ex-NYC cop - recent widower who is dealing with the transition to living alone in Italy while growing his cooking skills by helping out at a local trattoria. Gun shots and a friendly dog greet him in the opening pages and while he has the experience and skills to investigate homicides, his unceremonious \"firing\" from the police force in America makes him less aggressive as the murder is being worked on by a pleasant, not too aggressive pair of local policemen. The author peppers her prose with lots of verbal views of the Tuscan landscape, people and food. She even shares tasty recipes that Nico - our main protagonist - cooks to help friends at the local eatery.Well written with a fun plot and likable characters. It serves as an armchair trip to Tuscany for me and does it while weaving a murder mystery that keeps you guessing until the final pages - a rare achievement.Like Italy? Like well-crafted mysteries? Give this gem a try. I'm already 150 pages into the author's second novel and it's just a good. I have a new friend!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gail Apfel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGFV6DYB2AQ5PV7EQ6IYZLIKWWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R128ZD9CPV4OW4?ASIN=B07XXBJY3X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Murder in Chianti",
                "reviewText": "Murder in Chianti keeps the reader in suspense almost to the very end. Nico, a former homicide detective has come to Chianti with his dying wife to live the remainder of her life where she was born and with the only family she has left.A stranger is found shot to death in the woods on Nico’s property, and when the police arrive he is immediately suspected of the murder because of the mud and blood on his shoes. Within a short time, the police discover his former profession and press him to become involved in solving the crime. Despite the fact that getting involved, Nico helps reveal many secrets, and a surprise ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donald J Cook",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 16, 2023",
                "reviewTitle": "Fast paced",
                "reviewText": "Having been to Tuscany on holidays I felt I was back there while reading this book. Great read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lyntrom",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 13, 2023",
                "reviewTitle": "Enjoyable read",
                "reviewText": "Set in the beautiful Chianti region of Tuscany, Nico, a former NYPD detective, has gone to his wife's hometown and family after her death. Her relatives take him under their wing keeping him busy at the family restaurant and introducing him to a slower, more laid back way of living as he grieves. When a stray dog finds man brutally murdered in the woods behind his home, Nico gains a new four legged companion and finds himself involved in the police investigation.It's a story about family, relationships and life in a small community where everyone \"knows everyone\" and closely guards their secrets. I enjoyed the characters and the story and the surprise ending. A very enjoyable read!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carole Guay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 20, 2023",
                "reviewTitle": "murder in Chianti",
                "reviewText": "Interesting I like the scenery the the murder story is weak , I lost interest in the middle the ending was better",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter Anderson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 30, 2022",
                "reviewTitle": "Entertaining read",
                "reviewText": "This is a light easy read. The author captures the Italian life in a small town. You can feel the air and smell the food. The characters are not complex but the small twists and turns keep you reading.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sean",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 27, 2022",
                "reviewTitle": "Recommended",
                "reviewText": "This is a good read. Besides the intriguing story, it makes one want to go to Tuscany and experience the food and the scenery.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}