{
    "remaining_requests": 65,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mystery-Mrs-Christie-Novel/dp/1728234301",
    "body": {
        "name": "The Mystery of Mrs. Christie: A Novel",
        "price": "$12.97$12.97",
        "originalPrice": "",
        "rawPrice": 12.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mystery-Mrs-Christie-Novel/dp/1728234301",
        "soldBy": {
            "sellerID": "A5JZAI8QHYQN0",
            "name": "Vogman",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A5JZAI8QHYQN0&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81gSCMPAmHL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Marie Benedict",
            "link": "https://www.amazon.com/Marie-Benedict/e/B01EX8MYO4/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Vogman",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 8677,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 6 hrs 15 mins",
            "FREE delivery February 26 - 28 on orders shipped by Amazon over $35",
            "Or fastest delivery February 23 - 25",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 13 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Sourcebooks Landmark (October 5, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1728234301"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728234304"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.84 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#44,901 in Books (See Top 100 in Books) #263 in Biographical Fiction (Books) #806 in Historical Mystery #3,839 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 8,677 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Other Einstein Carnegie’s Maid The Only Woman in the Room Lady Clementine Her Hidden Genius The Mitford Affair Don’t miss these inspiring reads from Marie Benedict! The story of not-so-famous scientist Mileva Marić, who not only loved Albert Einstein, but also shaped the theories that brought him lasting renown. Discover the story of one brilliant woman who may have spurred Andrew Carnegie's transformation from ruthless industrialist to true philanthropist. Based on the incredible true story of the glamour icon and scientist Hedy Lamarr, this book celebrates the many women in science that history has overlooked. The ferocious story of Clementine Churchill, the ambitious woman who did not flinch through the sweeping darkness of war, and who would not surrender to expectations or to enemies. Shines a light on Rosalind Franklin, whose world-changing contributions were hidden by the men around her but whose relentless drive advanced our understanding of humankind. An explosive novel of history's most notorious sisters, one of whom will have to choose: her country or her family?",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/ff940969-f53c-4273-bb04-f3609f715380.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dae090a3-c024-4567-b926-1e343b90a69e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c363481a-3087-4500-8a27-451940311c75.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6aa5556a-5bcb-4ebd-96af-b75474417163.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c6cee579-7ff9-4665-8601-6fffa7c2f31e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e8be6c31-aa5f-4daf-8514-a3420eab8ea3.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce4eb622-3a88-4948-b109-a9231d268bcd.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c10fad9e-5bb8-4d4e-a162-6b574f0c923b.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f875d1c-fc7b-4c52-b1c4-d71ec94d206c.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ec94862-ae6e-4841-9827-f97bbec625ea.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dec89f20-26e5-4e26-a77b-dc99978339f8.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "kmurph31",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLFHJWV2RH3EOJ6CAP2HPOHUONQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31SLSQ9SBCZZU?ASIN=1728234301",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 7, 2022",
                "reviewTitle": "5.0 out of 5 stars Informative! Made Me Smarter!",
                "reviewText": "THE CHRISTIE AFFAIRBY: NINA DE GRAMONTAbout a 4.5 stars.This was a book that I was so excited to read because I love books about famous Author's. This wasn't in the book but, I am adding it because it was a fact that I didn't know until recently; It is that Agatha Christie has sold more books than any other Author. Back to this book. Agatha Christie and Archie Christie both share the same initials and called each other A.C. It is based on the eleven day disappearance of Agatha Christie in December of 1926. Agatha is just in the midst of grieving her mother's death when her husband Archie tells her he wants a divorce.When I first started this I thought that this was going to be a Five star read. It drew me in right away and the writing is engaging. What was disappointing was that most of the book is about Archie's mistress the fictional one called Nan O'Dea. I understood why the author chose to do what she did by the end of the book. I have to be honest though, I was hoping it was going to be more about the Christie's and less about his mistress's back story. It was disappointing because I didn't really seem interested in the mistress's back story. I did give this 4.5 stars, but it was more like a four star reading experience for most of it--but it is worthy of 4.5 after finishing it. It is entertaining when Agatha is involved in the various scenes and that was in the very beginning and towards the last section. In all fairness to Nina de Gramont I can't blame her for choosing to have more Nan than Agatha. It is an excellent book and I am so grateful to have read it. It is my fault for expecting something and assuming it was more Agatha oriented. Any way maybe I can say that Agatha did turn out to be more successful based on her book sales being as being the most sold. Maybe I have issues with cheating or a woman stealing someone else's husband. But most likely if there is a mistress it isn't just her fault. The husband should be held more accountable for lying and sneaking because we all know that they all have the same story to excuse what they do if they do it. So it definitely wasn't all Nan's fault why I was less engaged. I just didn't find her life as interesting. But it was overall a great reading experience when I reflect on all of the book as a whole rather than what I was hoping it would be. I usually enjoy a book the less I know about it. So I take full responsibility for my rating.I might have liked it more if the mistress's back story was more interesting, but for me it just wasn't. I realize that this is historical fiction, but I like to learn things when I read it. Agatha seemed like such a nice person and it is so unfortunate that she had that done to her and I mean a husband whom you love cheat on you while you are living together thinking you are in a happy marriage. In this narrative Agatha is only thirty-six and I suppose if the husband you love is going to cheat it is better to be young and still beautiful. In this story she is ten years older than Nan.This isn't spoiler territory to reveal that Nan was present when Agatha announces to Archie with Nan in the room and she tells him to that there is a lunch planned with her new literary agent. Archie tells Agatha that he can't attend because he has a mountain of work to do. Agatha being the good person that she is and also polite invites Nan to go. Agatha says that they will make it a girls' luncheon. And off they go.This was a very clever endeavor and if it wasn't I wouldn't have been so excited to read it. The last part of the book made me understand why it was formatted and plotted the way it was. I did enjoy it very much and recommend it to mystery lovers. There is a murder and Agatha isn't as well known during this time frame. It seemed that everybody was searching for her all over England. It was well written and I would be interested in reading whatever this Author chooses to write about next.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOPN5DHZGJHLOKJ4BUEYDOJ6W3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27EB990RIOPQM?ASIN=1728234301",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "4.0 out of 5 stars Intriguing!",
                "reviewText": "Ms. Benedict's book was a slow read for the first third of it. The characters developed well, peeling away motivations very methodically. The end is worthy of Agatha herself!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTKTWUMJ52IGZAQQ6LMLEH65AJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39DNM4LXGNO0Z?ASIN=1728234301",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "3.0 out of 5 stars Hard to follow",
                "reviewText": "Hard to follow the story line; but I read to the end and it all came together. It was quite the mystery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tefljudy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZIRVVD6IMI7IF6QKWIRVLCM4RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11LGV07PP7LLS?ASIN=1728234301",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars The Ending Explains Everything",
                "reviewText": "Being an Agatha Christie fan piqued my interest in this book. The further I read, the sadder I grew with this narrative of her first marriage and her life circumstances - and almost didn't finish. Not having read any reviews, I didn't understand until the end the true premise of this book, and it was definitely a happy, surprising revelation. It made me want to go back and re-read some of Christie's works, knowing who some of her famous characters might have been based on. If you are a Christie fan, this will not disappoint.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Liebeslied",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMFIA5CBJZ6HD4UGMP5LWYYUA6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I2N1Q4JTWOOV?ASIN=1728234301",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "4.0 out of 5 stars Unsatisfied.",
                "reviewText": "This was.a book club read. I needed more.. It's an .omniscient divs into Agatha Christie 's life.. Was any of if based on her actual life I have no clue. Now I must research her bio.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nostalgia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF3SE27J5ZH46S4G74ECDMKE6SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34KNM02WI7377?ASIN=1728234301",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Entertaining fiction book",
                "reviewText": "Our book study group found it an entertaining book written by today's woman, to postulate in today's views what was never spoken about in the lifetime of Agatha Christie. It was certainly one possibility; but I suspect that Mrs. Christie intentionally chose to keep her life a mystery.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RSW Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXZLU6VURRSQC2NFU7CK4MH57SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M482FZJ7GHN?ASIN=1728234301",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2021",
                "reviewTitle": "4.0 out of 5 stars 4 Stars",
                "reviewText": "This incredibly fun historical fiction earned <b>4 Stars</b> from me.<b>SUMMARY</b>In real life, Agatha Christie disappeared for eleven days in 1926. Although she was found at a spa hotel, having checked in under her husbands mistresses name, no one could ever fully explain what happened.At the time, she was just beginning to become known as a mystery novelist but her personal life was a mess. Her beloved mother had passed away just a few months prior and her husband was leaving her for another woman.Word of her disappearance made international news, even appearing on the front page of the New York Times. Thousand of people showed up to a search for her. Then, as mysteriously as she disappeared, she resurfaced eleven days later, at the spa seemingly confused about all the fuss.The official cause given by her family was a case of amnesia. Possibly brought on by a car accident or maybe stress related to the loss of her mother.After being found, Agatha retreated to her sisters estate and recovered from her <i>amnesia</i>. Neither she nor her family ever spoke publicly spoke of it again.Shortly after the incident, she and her husband were divorced and before the ink was even dry on the divorce papers, her husband married his mistress.This book explores how author, Marie Benedict, thinks could have happened. She takes facts from a variety of sources, Including Agatha's autobiography, her imagination to recreate the incident.<b>WHAT I LOVED</b>We will never know what really happened during those eleven days, but, OMG(!), I hope this story is what happened!!! It is the PERFECT, most satisfying scenario!I was fascinated by the amount of time women back in the way spent worrying about making sure their husbands were happy and felt like the center of the universe. So funny. While I do not actively try to thwart my husband's happiness, I certainly do not spend my days trying to make create a perfect, happy world for him.I love reading about rich people stuff from <i>back in the day</i>. Agatha's father died and the Miller (Agatha's maiden name) family fortune had dwindled, leaving Agatha, her siblings and their mother, what they considered to be, financially strapped. Of course, to them that means they still have the family estate, she completed her education in France, she spends her time flitting around between house parties and her (literal) dance card is always full, but she did have to have her debutant season in Egypt because London was too expensive. Poor, poor girl!! Just so interesting to be a fly on the wall for all that.<b>WHAT I DIDN'T LOVE</b>Sometimes historical fiction annoys me a little because I will never know how much is real and how much is made up.<b>OVERALL</b>Such a FUN BOOK! If you are looking for a fun distraction, its for you!",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phyllis Roberts",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCLOGPOJQAGX334ZYLSN5JLYB4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RITCHH3FEFPX?ASIN=1728234301",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Great story",
                "reviewText": "If you like Agatha .Christie, you will enjoy this",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 7, 2022",
                "reviewTitle": "Llegó en buen estado.",
                "reviewText": "Debo admitir que debí leer las reseñas de Goodreads antes de comprar este libro y saber que por alguna razón tiene más porcentaje de 3 y 4 estrellas en lugar de 5. No fue lo que la sinopsis me prometía y de verdad detesté a Archibald Christie, pero en fin, muy predecible todo y lo terminé solo para saber si Agatha iba a hacer algo con Archie para vengarse de él jeje.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Livros By F - Fernanda B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 22, 2021",
                "reviewTitle": "O maior mistério da vida da autora",
                "reviewText": "O livro narra o maior mistério da vida de Agatha Christie.Um mistério que até hoje não foi resolvido, o único mistério da vida real, o desaparecimento, por 11 dias, da Autora.Com capítulos alternantes de um lado começamos em 1912, quando Christie conhece o marido, e 1926, simultaneamente, na noite de seu desaparecimento. Ambos os tempos se desenvolvem até encontrarem um ponto em comum na parte 2, no momento que a encontram.Vemos dois tipos de narração, uma, em primeira pessoa, narrada por Christie, e outra, em terceira, mostrando o que se passava na investigação, principalmente envolvendo a figura de Archie Christie.Uma obra extremamente informativa mas que entretém também, vemos todo o rebuliço causado pelo desaparecimento da autora, que foi investigado por dois chefes de polícia, contou com buscas pela Inglaterra e envolveu até a ajuda do autor de Sherlock Holmes, Sir Arthur Conan Doyle, para encontrá-la.Vemos também um pouco da sua situação matrimonial e momentos pivotais na vida da autora como seu casamento, suas primeiras publicações, quando ela se junta ao corpo de enfermeiras durante a guerra, o nascimento de sua filha e a morte de sua mãe.Incrivelmente bem escrita, The Mystery of Mrs. Christie, é uma obra que completa com ficção as lacunas presentes na vida real e traz um desfecho interessante, plausível e incrível para a história!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cristina S Gheorghe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 19, 2021",
                "reviewTitle": "Written in the vein of Agatha Christie",
                "reviewText": "Marie Benedict has created quite a following of faithful readers by tackling various unjustly neglected, but prominent women of history and science, such as Hedy Lamar, Einstein's wife Mitza Maric, and Clementine Churchill. Now she deals with the most famous author of classic murder mysteries : Agatha Christie, whose personal life proves to have been a mystery in itself. Benedict always relies on a basis of methodical research and then adds to that her own intuition and writing talent to present us with an extremely engaging result: a book hard to put down. This latest novel is written according to the plot design used successfully by Agatha Christie herself, and in this case the cleverly devised plot with its surprising twists and turns makes us doubt and wonder to the very last page. It is a stylistic triumph and a very good read!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darryl Telles",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 21, 2022",
                "reviewTitle": "Clever",
                "reviewText": "Some good moments bit a rather consulted plot leads to a less than edifying ending. Not sure it will please all fans but worth reading for its original turn of events. I can't help feeling though that the premise was too clever to actually deliver.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kirsten",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 28, 2023",
                "reviewTitle": "Family drama to mystery novel",
                "reviewText": "I was a little disappointed with the first bit of the book. Agatha Christie is portrayed as a weak character and a poor mother. Both seemingly against her nature but a result of her circumstances. The end of the book though, was fantastic! it turned quite Christie-Esque with the slow unfolding of the unsolvable mystery!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.79",
                "sellerName": "Revolver Market",
                "sellerRating": "4.5"
            },
            {
                "price": "$11.79",
                "sellerName": "ZBK Books",
                "sellerRating": "4.5"
            },
            {
                "price": "$8.33",
                "sellerName": "Warriors SG",
                "sellerRating": "5"
            }
        ]
    }
}