{
    "remaining_requests": 79,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Love-My-Life-Novel/dp/0593297016",
    "body": {
        "name": "The Love of My Life: A GMA Book Club Pick (A Novel)",
        "price": "$10.61 $9.78",
        "originalPrice": "$18.00",
        "rawPrice": 10.61,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Love-My-Life-Novel/dp/0593297016",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81fGb9JMMiL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Rosie Walsh",
            "link": "https://www.amazon.com/Rosie-Walsh/e/B07BVXSCNJ/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Shakespeare Book House and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 19903,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for The Love of My Life:“Let’s put it this way, if it weren’t for work I would have been able to finish this book in a day.”—Lama Hasan, ABC News“Combining the gripping pace of a psychological thriller with the tenderness and sorrow of a love story gone wrong, this one’s a winner.” —People, Book of the Week“The Love of My Life is a dazzling supernova of a book, it picks you up on line one and doesn't let you go until the very end. Each chapter is filled with heart-breaking twists and revelations, and it is brimming with human warmth and intelligence.”—Lisa Jewell, #1 New York Times bestselling author of The Night She Disappeared“Readers won’t be able to stop turning the pages to see how the past and present inevitably collide in Rosie Walsh’s latest. The Love of My Life is a poignant love story, a propulsive mystery and a cautionary tale about the secrets we keep. I couldn’t put it down.“—Greer Hendricks, New York Times bestselling author of You Are Not Alone“Walsh’s hugely compelling The Love of My Life instantly pulls you deep into the interior of a marriage. Part thriller, part mystery, part heart-wrenching love story, this is a treasure for book clubs everywhere.”—Ashley Audrain, New York Times bestselling author of The Push“Rosie Walsh’s The Love of My Life is my favorite kind of thriller—gripping, heartbreaking and impossible to put down.”—Laura Dave, #1 New York Times bestselling author of The Last Thing He Told Me“A bruising and beautiful mystery that kept me guessing till the very end, The Love of My Life delivers on every level. I’m a huge fan of Rosie Walsh.”—Chris Whitaker, New York Times bestselling author of We Begin At The End“How do we really build a new life? About the mystery of identity and the sometimes cost of love, Walsh’s latest is a stunner.” —Caroline Leavitt, New York Times bestselling author of and With or Without You“The Love of My Life is an extraordinary novel. Rosie Walsh combines the emotional punch of the best of romance with the page-turning twists of the most masterful thrillers. I was torn between pausing to weep, and ploughing on to solve the mysteries.”—Clare Pooley, New York Times bestselling author of The Authenticity Project“Walsh masterfully shows both [protagonists’] points of view while maintaining an intoxicating air of mystery…a propulsive thriller with heart that will keep readers guessing.” —Kirkus, starred review“[A] heartbreaking thriller…[that] explores the complexity of secrets in marriages…Walsh cleverly integrates twists that not even jaded readers will be able to predict…that builds to an emotionally raw yet satisfying conclusion. Walsh is a writer to watch.” —Publishers Weekly, starred review“What do you do when you find out everything your wife ever told you about herself is a lie? Allow Rosie Walsh's love story slash mystery, The Love of My Life, to explain.” —Marie Claire“Perfect for your next book club, Rosie Walsh’s The Love of My Life is a love story meets thriller about the complexities of deceit within marriage.”—Parade“I am a huge fan of Rosie Walsh's writing. The Love of My Life is heart-wrenching, beautiful and thought-provoking; it made me cry, smile and hug my own loved ones a little tighter.”—Beth O'Leary, international bestselling author of The Flatshare“Perfection. Every word. Every moment. Every emotion. Brave, heart-breaking, and hopeful. A breathtaking story.” —Lucy Clarke, bestselling author of One of the Girls “Brilliantly plotted and beautifully written, what really elevates Rosie Walsh's book above the competition is the characters. Contradictory, flawed and entirely human, I loved and rooted for them like real people.”—Kate Riordan, author of The Heatwave “Wow, this book! With The Love of My Life Rosie Walsh has achieved a very rare thing: a totally heart-rending love story that is also a page-turning thriller - how does she do it?!?! Addictive, moving, totally unputdownable. It really is superb and has Netflix series written all over it.”—Katy Regan, author of How To Find Your Way HomePraise for Ghosted:“I absolutely loved this book and didn’t want it to end.”—Liane Moriarty, #1 New York Times bestselling author of Big Little Lies“Riveting.”—Cosmopolitan“Walsh has a good ear for dialogue, and the mystery behind Eddie’s disappearance is a particularly satisfying one.”—The New York Times Book Review“A gripping and surprising romantic suspense story. . . . You won't want to put it down.”—NPR About the Author Rosie Walsh lived and traveled all over the world, working as a documentary producer and writer. Ghosted, her American debut, was a New York Times bestseller and has sold more than a million copies worldwide. The Love of My Life is her second novel. She lives in Devon, UK, with her partner and two children. Excerpt. © Reprinted by permission. All rights reserved. One Leo Her eyelashes are often wet when she wakes, as if she's been swimming in a sea of sad dreams. \"It's just some sleep-related thing,\" she's always said. \"I never have nightmares.\" After a fathomless yawn she'll wipe her eyes and slip out of bed to check Ruby is alive and breathing. It's a habit she's been unable to break, even though Ruby's three. \"Leo!\" she'll say, when she gets back. \"Wake up! Kiss me!\" Moments will pass, as I slide into day from the slow-moving depths. Dawn will spread from the east in amber shadows and we will burrow in close to each other, Emma talking almost nonstop-although from time to time she will pause, midstream, to kiss me. At 6:45 we will check Wikideaths for overnight passings, then at 7:00 she will break wind, blaming the sound on a moped out in the road. I can't remember how far into our relationship it was when she started doing this: not far enough, probably. But she would have known that I was on board, by then, that I was no more likely to swim back to the shore than I was to grow wings and fly there. If our daughter hasnÕt climbed into our bed by that time, we climb into hers. Her room is sweet and hot, and our early-morning conversations about Duck are among the happiest moments my heart knows. Duck, whom she clutches tightly to herself all night, is credited with incredible nocturnal adventures. Normally I'll dress Ruby while Emma \"goes down to make breakfast,\" although most days she'll get sidetracked by marine data collected overnight in her lab, and it's Ruby and me who'll sort out the food. My wife was forty minutes late for our wedding because she'd stopped to photograph the tidal strandlines at Restronguet Creek in her wedding dress. Nobody, except the registrar, was surprised. Emma's an intertidal ecologist, which means she studies the places and creatures that are submerged at high tide and exposed at low. The most miraculous and exciting ecosystem on earth, she says: she's been rockpooling since she was a young girl; it's in her blood. Her main research interest is crabs, but I believe most crustaceans are fair game. Right now she's got a bunch of little guys called Hemigrapsus takanoi in special sea-water tanks at work. I know they're an invasive species and that she's looking at some specific morphology she's been trying to pin down for years, but that's as much as I'm able to understand. Less than a third of the words biologists use can be understood by the average human; getting trapped in a group of them at a party is a nightmare. Emma is singing to John Keats when Ruby and I arrive in the kitchen this morning, the sun jagging across the worktops and our cereal hardening in bowls. Her laptop, which displays a page of mind-boggling words and squiggles, plays a track called ÒKillermuffin.Ó When we rescued John Keats from the dog shelter they told us that jungle at a low volume soothed his nerves, and so it has become the soundtrack to our lives. IÕm used to it now, but it took a while. I stand in the doorway with Ruby perched on my hip, watching my wife singing tunelessly to the dog. In spite of a bunch of musicians in Emma's ancestry she is incapable of singing even \"Happy Birthday\" in tune, but this has never stopped her. It's one of many things I love about my wife. She catches sight of us and dances over, still singing appallingly. \"My favorites!\" she says, kissing us both and extracting Ruby from my arms. She whirls off with our daughter and the dreadful singing gets louder. Ruby knows Mummy's been ill; she has seen her lose her hair thanks to the special medicine she gets at hospital, but she thinks Emma's better now. The truth of the matter is, we don't know. Emma had her post-treatment PET scan yesterday and an appointment to discuss the results has been booked for next week. We are hopeful, we are frightened. Neither of us is sleeping well. After a brief stint dancing with her mother, Duck whirling around their heads, Ruby wriggles off to take care of some urgent business. \"Come back!\" Emma cries. \"I want to cuddle you!\" \"I'm too busy,\" Ruby says, regretfully. Then: \"Hi,\" she whispers, to the plant she's looking after for nursery. \"I'm going to give you a drink.\" \"Anything?\" I ask, nodding at the computer. Emma presented a BBC wildlife series a few years back and continues to receive messages from weird men, even though she hasn't been on telly since. But her series was repeated recently, and as a result the messages have increased. Normally, we laugh at them, but last night she admitted she's had some more disturbing ones of late. \"A couple more. One tame, one less so. But I've blocked him.\" I watch her carefully as she fills our water glasses, but she doesn't seem bothered. I think it's fair to say I mind about these messages a lot more than she does. I've tried to get her to shut down her public Facebook page, but she won't. People apparently still post about wildlife they've been tracking, and she's not willing to close the resource down \"simply because of a few lonely men.\" I hope they are just lonely. \"I love your piece on Kenneth Delwych,\" Emma tells me, keeping an eye on Ruby, who's climbing up to the sink with her watering can. My newspaper is on the table with the obituaries page open. I go over to John Keats and fold one of his flappy silken ears around my finger, waiting for the but. The dog smells of biscuits and singed fur after a recent encounter with the iron. \"But?\" I prompt. She stops, caught out. \"No but.\" \"Oh, Emma. Come off it.\" After a moment, she laughs. \"Fine. I do love it, but the female priest is the real showstopper. Hey, Ruby, that's enough water.\" John Keats sighs deeply as I lean over to study my articles. Kenneth Delwych, a peer famed for the legendary orgies he hosted at his Sussex vineyard, is sharing the obituaries page with a Bomber Command navigator and a female priest who had a heart attack during a wedding ceremony last weekend. \"You're at your best when you're completely deadpan,\" Emma says. She puts bread in the toaster. \"That actor last week-the Scottish one, what was his name? Ruby, please don't drown the thing . . .\" \"David Baillie?\" \"David Baillie. Yes. Perfection.\" I reread my Kenneth Delwych piece while Emma deals with the inevitable overflow of water and soil from Ruby's plant. She's right, of course. The female priest, with her far shorter obit, reads better. Unfortunately, Emma's often right. My editor, who, I suspect, is in love with my wife, often jokes that he'd sack me and hire her if she ever decided to quit marine biology. I actually find this quite offensive, because unless he's secretly read her scientific articles, he has only one piece she wrote for the Huffington Post to go on. Emma is a research fellow at the Marine Biological Association in Plymouth, which takes up two days of her week, then she comes back to us in London to teach estuarine conservation at UCL. She is an excellent writer, with instincts frequently better than mine, and she really does enjoy cruising Wikideaths, but this has more to do with her love of a good story than any interest in stealing my job. Ruby and John Keats go out into the garden, where the sun steals through gaps in next door's sycamore, spotting our tiny lawn with gold. Smells of an early city summer roll through the door: still-glossy grass, honeysuckle, heating tarmac. I try to rehydrate our cereal, while outside the dog runs around our pond, barking. It's alive with baby frogs at the moment, which he seems to find unacceptable. \"John Keats, will you be quiet?\" Emma asks, from the doorway. The dog takes no notice. \"We have neighbors.\" \"JOHN!\" Ruby yells. \"WE HAVE NEIGHBORS!\" \"Shhh, Ruby . . .\" I find some spoons and take our breakfast out to the garden. \"Sorry,\" Emma says, holding the door open for me. \"Me and my unsolicited opinions on your work. It must be annoying.\" \"It is.\" We sit at the garden table, still bobbled with dew. \"But you're mostly polite. The main problem is that you're often right.\" She smiles. \"I think you're a brilliant writer, Leo. I read your obits before I even open my work e-mails in the morning.\" \"Hmmm.\" I keep an eye on Ruby, who's just a bit too close to the pond. \"I do! Your writing is one of your sexiest assets.\" \"Oh, Emma, seriously, stop it.\" Emma has a spoonful of cereal. \"Actually, I'm not joking. You're the best writer on that desk. Period.\" Embarrassingly, I can't stop myself from beaming. \"Thank you,\" I say, eventually, because I know she means it. \"But you're still annoying.\" She sighs. \"Oh, I know.\" \"For a whole host of reasons,\" I add, and she can't help laughing. \"You have far too many opinions on far too many things.\" She slips her hand across the table and squeezes my thumb, and tells me I am her favorite, and I find myself laughing, too-and that is our rhythm. That is us. We have been married seven years; together nearly ten, and I know every part of her. I think it was Kennedy who said we are tied to the ocean-that when we return to it, for sport or leisure or somesuch, we are returning to the place from whence we came. ThatÕs how I feel about us. To be near to my wife, to Emma, is to return to source. So when I learn, in the days following this morning-this innocent, commonplace morning, with dogs and frogs and coffee and dead priests-that I know nothing of this woman, it will break me. Two Emma One week later I'm going to be fine,\" I reiterate, into the darkness of our bedroom. I've lost track of time. The hours have melted and dripped all over each other and, when Leo fails to reply, I realize he isn't even in bed. I must have dozed off. I check my watch: 3:47 a.m. The day of my hospital appointment is here, at last. I wait for the sounds of a flushing toilet and our cacophonous floorboards, but nothing comes. Leo is almost certainly downstairs, eating something in the yellow glow of the open fridge. An emergency ration of ham, probably: he said that if my chemo doesn't work he'll go vegan to support me. I went vegan following my diagnosis four years ago, although on more than one occasion since I've eaten cheddar straight from the packet in the Sainsbury's car park at Camden. I get out of bed. I never enjoyed hugging in bed before Leo, but when he isn't here, my body misses his. He isn't in the loo, so I go down to the kitchen. I run my hand over the wall as I descend, thickened and lumpy after decades of paint on paint. I sing \"Survivor\" under my breath. I edge past a tall pile of books. On top sits an enamel bowl of things we never use-keys for unknown locks, paperclips, an economy pack of Vilene Wundaweb. Leo keeps moving the pile to the center of the hallway to make me address it, I keep moving it back. The solution is more shelves, but I am no good at shelves. The problem with this is that Leo is no good at shelves, either, so we're stuck in a holding pattern. \"Leo?\" I whisper. Nothing. Just the near-theatrical creak of the staircase, which babysitters find so unsettling none of them ever comes back. I inherited this house from my grandmother. As well as being an MP and amateur violinist, she became a medium-grade hoarder and didn't remove anything from the house for the last ten years of her life. Leo thinks I'm showing all the signs of having inherited her problem; my therapist, worryingly, agrees. When we have experienced more loss than is bearable, she says, we hold on to everything. The house is part of a tiny Georgian terrace in a lane off the top of Heath Street, where Hampstead Village gives way to the glorious roll of the Heath. It's falling apart and impossibly cramped, and the truth is that we'd probably make a small fortune if we sold it. But these four walls are so much a part of my story, a part of my survival, I couldn't bring myself to leave. Last week Leo showed me details of a spacious three-bed terrace in Tufnell Park. \"Look at the size of those bedrooms!\" he whispered, his face ablaze with hope. \"We'd have a spare room! A downstairs toilet!\" I felt bad. But what can I do? Sell my one safe space for the sake of a downstairs loo? Leo isn't in the kitchen. He isn't in our tiny little study, either, which is a relief. For a moment I thought he might be in there writing an advance obituary for me, which would be intolerable. Every newspaper in the world has a stock of pre-written celebrity obituaries: obit editors live in fear of being caught out by a significant death. And while I'm no celebrity, I probably would merit an obituary in his newspaper. I keep on singing \"Survivor\" and try the little dining room, even though neither of us ever goes in there. It's virtually unusable, swimming with Granny's vaguely stacked detritus and old violin sheet music, but I've promised Leo I'll sort it once I've got this year's master's dissertations marked. \"Leo?\" My voice sounds exactly as it always has. It carries no trace of cancer. I imagine the possibility of malignancy still circulating around my body like cheap wine, but it doesn't ring true. Then a fear fogs in from nowhere: What if Ruby has gone missing, too? I run upstairs, so fast I stumble and land on my hands, but she's there. Of course she's there. And of course, when I check, she is breathing. I look for Leo in the airing cupboard, the trapdoor to our unsafe roof terrace. No sign. Anxiety begins to prickle. What if one of those weird men from the internet has got fed up with me blocking his messages and decided to punish my husband? Ridiculous, I tell myself, but the idea's taken hold. Leo opening the door, only to be knocked out. Leo letting John Keats out for a late wee and being bludgeoned to death by some lonely maniac who thinks he owns me, because he enjoys me talking to grebes on telly. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 13 hrs 3 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 10 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A NEW YORK TIMES BESTSELLER | GOOD MORNING AMERICA BOOK CLUB PICK“Gripping, heartbreaking and impossible to put down.”—Laura Dave“A dazzling supernova of a book, it picks you up on line one and doesn't let you go until the very end.” —Lisa Jewell From the New York Times bestselling author of Ghosted comes a love story wrapped in a mystery: an up-all-night page-turner with a dark secret at its core Emma loves her husband Leo and their young daughter Ruby: she’d do anything for them. But almost everything she's told them about herself is a lie. And she might just have got away with it, if it weren’t for her husband’s job. Leo is an obituary writer; Emma a well-known marine biologist. When she suffers a serious illness, Leo copes by doing what he knows best – researching and writing about his wife’s life. But as he starts to unravel the truth, he discovers the woman he loves doesn’t really exist. Even her name isn’t real. When the very darkest moments of Emma’s past finally emerge, she must somehow prove to Leo that she really is the woman he always thought she was . . .But first, she must tell him about the other love of her life. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Women's Fiction",
                "link": "https://www.amazon.com/Womens-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=542654"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Books (January 17, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 384 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593297016"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593297018"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.04 x 0.68 x 7.76 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#612 in Books (See Top 100 in Books) #53 in Contemporary Women Fiction #213 in Suspense Thrillers #565 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 19,903 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/124f060a-8528-4891-8e27-7596effa99ff.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6dc49134-e444-484d-b6f0-e83fa3825f7d.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e05e4bca-d367-4d18-8388-fa74b19f7271.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97e5e108-0680-4d2c-a67e-cf3bfb940a27.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2bee0e18-63c8-4e7e-b465-3bc6c9c05299.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tennessee Fam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMZEI3FE4S2AZ2TK3IBQUFYLDUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMYUTRTI66V5J?ASIN=0593297016",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Great read!",
                "reviewText": "Starts a little slow but then bam! Your hooked! I don’t want to give it away but totally not what your thinking until the end. I enjoyed it so much I looked up more books by this author.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grace Shin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH466AECKAOWHMNFRGNTAPZGICNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR7CFP76HLXN2?ASIN=0593297016",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Well written but a bit heavy",
                "reviewText": "Be sure you are ready for a couple of day's heavy reading as both the story and descriptions are not for the fainthearted. Goes deeply into what might happen when decisions are made without very careful thinking beforehand.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy Lund",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIUR7JLUDF22YLOO73NK2VLDSAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OZOJ3187BGT6?ASIN=0593297016",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Very good book.",
                "reviewText": "Kept me wanting to read, it was a fast read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Happy with the purchase",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5MGL5UPJYTI7VS5OAFEEBV5LZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R357YPQBI6QM1B?ASIN=0593297016",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "3.0 out of 5 stars Decent Read",
                "reviewText": "Entertaining enough but at the end, you’re kind of wondering…. “Really?”",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMD2L2FMC5YU2CN2EJX5U4LYLXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V7YI6Y8VLQIN?ASIN=0593297016",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Very good read",
                "reviewText": "An interesting story, built around a secret past. Not being from England the many references to specific streets was unimportant and distracting. As the story unfolds you are drawn into guessing the outcome...that's always fun.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sherry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2J2V2ZYARSBHWHY3QMR5SQ6I6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QXUPB4U51O1P?ASIN=0593297016",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent book, excellent condition",
                "reviewText": "Book was easy to order and in excellent condition, although it was used. I started reading it and could not put it down. Really enjoyed it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAVYACKTTNVUXOBCHJWL3BZZ2HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30F03RT23XBI2?ASIN=0593297016",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars The Love of my Life",
                "reviewText": "Started somewhat slow and confusing, but the author gradually and expertly grabs your interest and carries you through plot twist and turns, unable to put the book down until all is revealed.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4D3QVNMEOVJRMHOAZHVG4JTYVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JJ18D1VAQKLE?ASIN=0593297016",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars You can't put it down-",
                "reviewText": "But it's heart-wrenchingly hard to keep reading. At the core of it is the cruelest fate imaginable. It ends all to abruptly and unfinished, but it's worth the read just for the love and pathos you will feel.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EPar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 17, 2022",
                "reviewTitle": "A slow start but powerful",
                "reviewText": "At first I had a hard time getting into the book but once I was in I couldn't stop reading. Soo many life lessons about how people hide the emotions that make them vulnerable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs Michala L Leyland",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 4, 2024",
                "reviewTitle": "Thoroughly enjoyed this",
                "reviewText": "Really good unraveling plot. Believable characters and some very poignant moments. Great read. Would make a great film or mini series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "girl about town",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 29, 2022",
                "reviewTitle": "Ein weiteres Meisterwerk!",
                "reviewText": "Dieses Buch war seit langem mal wieder das erste, das ich in jeder freien Minute verschlungen habe! Ich liebe ihren Schreibstil und die Story geht mir wieder einmal sehr zu Herzen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janet P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 18, 2023",
                "reviewTitle": "Very well written story with interesting plot twists",
                "reviewText": "Emma and her husband Leo are happily married and the proud parents of Ruby. Alerted by a few odd to explain events, Leo begins to delve into aspects of his wife's life and discovers secrets he was unaware of. After quite a slow start the story picked up pace and the plot became more twisty and interesting than I was anticipating. For the most part the writing and plot are fresh and original. However, certain aspects of the ending let it down a little.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rex’s Mom",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 11, 2022",
                "reviewTitle": "Boring 🙄",
                "reviewText": "I would not recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}