{
    "remaining_requests": 42,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Frozen-River-A-Novel/dp/B0BXK3SRBL",
    "body": {
        "name": "The Frozen River: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Frozen-River-A-Novel/dp/B0BXK3SRBL",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61RQ5 bMK3L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ariel Lawhon",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Ariel+Lawhon"
        },
        "brand": "Ariel Lawhon",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 5574,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "GMA BOOK CLUB PICK AN NPR BOOK OF THE YEAR From the New York Times bestselling author of I Was Anastasia and Code Name Hélène comes a gripping historical mystery inspired by the life and diary of Martha Ballard, a renowned 18th-century midwife who defied the legal system and wrote herself into American history.\"Fans of Outlander’s Claire Fraser will enjoy Lawhon’s Martha, who is brave and outspoken when it comes to protecting the innocent. . . impressive.\"—The Washington Post\"Once again, Lawhon works storytelling magic with a real-life heroine.\"—People MagazineMaine, 1789: When the Kennebec River freezes, entombing a man in the ice, Martha Ballard is summoned to examine the body and determine cause of death. As a midwife and healer, she is privy to much of what goes on behind closed doors in Hallowell. Her diary is a record of every birth and death, crime and debacle that unfolds in the close-knit community. Months earlier, Martha documented the details of an alleged rape committed by two of the town’s most respected gentlemen—one of whom has now been found dead in the ice. But when a local physician undermines her conclusion, declaring the death to be an accident, Martha is forced to investigate the shocking murder on her own.Over the course of one winter, as the trial nears, and whispers and prejudices mount, Martha doggedly pursues the truth. Her diary soon lands at the center of the scandal, implicating those she loves, and compelling Martha to decide where her own loyalties lie.Clever, layered, and subversive, Ariel Lawhon’s newest offering introduces an unsung heroine who refused to accept anything less than justice at a time when women were considered best seen and not heard. The Frozen River is a thrilling, tense, and tender story about a remarkable woman who left an unparalleled legacy yet remains nearly forgotten to this day. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b?ie=UTF8&node=10177"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "15 hours and 5 minutes"
            },
            {
                "name": "Author",
                "value": "Ariel Lawhon"
            },
            {
                "name": "Narrator",
                "value": "Ariel Lawhon, Jane Oppenheimer"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "December 05, 2023"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BXK3SRBL"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#61 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #2 in Historical Fiction (Audible Books & Originals) #2 in Women's Fiction (Audible Books & Originals) #3 in Women Sleuth Mysteries"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "KWyly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCCBRDLMOA4SFL5NVOEMUWOVV2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FDX1LVTAM867?ASIN=B0BXK3SRBL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Riveting. Historical Fiction at its finest.",
                "reviewText": "Martha Ballard, mid-wife and healer, wife of Ephraim, and mother of six surviving children, has delivered hundreds of babies in the last three decades. She never said no to a woman in labor. No matter whether it was daylight or dark or what the weather was in northern Maine, when she was needed, Martha would saddle her horse, Brutus, and go. Daily she faithfully wrote in the leather bound journals her husband bought for her. She documented the weather, each mother and birth she attended, and other pertinent information she had witnessed each day.The book begins with a life entering the world and a life snuffed out and thrown in the iced filled Kennebec River which runs through the middle of community of Hallowell, Maine. It took seven men to cut through the ice and pull the dead man out of the river. Martha was called to identify the body and determine the cause of his death. After examining the body and coming to a decision of how he died, Martha was challenged by the new doctor in town BenjaminPage MD - a smug, Harvard educated, pompous, arrogant physician new to the community. Dr. Page not only challenged her decision as to how the man had died, he continued to be a thorn in her side throughout most of the book.Using Martha Ballard’s actual diaries, Ariel Lawhon has crafted a riveting fictionalized tale of birthing babies, corrupt government officials, biased laws and hard court rulings against women. Of rape. Of murder. Of family and what life was like for women who lived in 18th Century America. Martha was a champion of women’s rights before the term was even coined. When starting this book, immediately reader feels that he or she is part of the community and is invested in Martha’s life and the lives of the vulnerable women she assists. This well written, well researched novel is a five star read for me and one on my favorites so far this year. The action never stops. Make sure you read the author’s extensive notes at the end of the book. You will miss out on the real story if you don’t!The Frozen River is my first Ariel Lawhon book. It will not be my last. Don’t miss this book depicting the incredible strength Martha Ballard displays no matter what she faces.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cathryn Conroy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW6562N3JURITICBRTMOQFVZVDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FTS729KUJYW7?ASIN=B0BXK3SRBL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Magnificent Storytelling! Page-Turning Historical Fiction Wrapped Around a Riveting Whodunit",
                "reviewText": "Oh, what a novel! It just pulled me in and wouldn't let go.Before you read this book, know two important things:1. Clear your schedule! Once you start reading, it will be really (really!) hard to stop. Yes, it's THAT good.2. When you finish it, you will have a whopping book hangover.Magnificently written by Ariel Lawhon, this is page-turning historical fiction wrapped around a murder mystery. It takes place from November 1789 to April 1790 in the small village of Hallowell, Maine during a particularly frigid, icy, and stormy winter. Martha Ballard is a 54-year-old midwife and healer, lovingly married to Ephraim, and mother of six (mostly) grown children. One night in late November after a town dance (called a \"frolic\"), Joshua Burgess is found dead in the mostly frozen Kennebac River. It takes seven men to haul him out. But this isn't a man who drowned. He has distinct rope burns on his neck, indicating a hanging, as well as bruises and broken bones, indicating a beating.The plot thickens. The dead man, along with Joseph North, one of the leading and most powerful citizens of the town, are together accused of brutally raping the minister's wife, Rebecca Foster, who becomes pregnant with the baby of one of the rapists. Was Burgess's murder connected to the rape? Outspoken, fearless Martha is determined to solve this mystery and seek justice for the victims even at great risk to herself and her family.The novel is not only a riveting whodunit with smart twists and turns, but also a brilliant story about life in these difficult times early in our country's history. I was completely captivated reading this imaginative tale with colorful characters, a bit of love and romance, and magnificent storytelling.Be sure to read the \"Author's Note\" at the end, as it describes in detail what is and isn't historical fact in this novel. I was quite surprised at how much of it is true. But don't read the \"Author's Note\" until you have finished the book, as it's filled with story spoilers.Bonus: Quotations from Shakespeare's plays run throughout the novel, and many of them are the best ones—the ones that so eloquently insult and defame. Read them and laugh!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CarrieCarrie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXEKYHSZJTJRSPUEKYJJ6Z34K7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RF5O4OUNZRM24?ASIN=B0BXK3SRBL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "4.0 out of 5 stars Martha is a force to be reckoned with",
                "reviewText": "“And then I cry. Mostly for Rebecca and the tiny, unwanted beating heart deep within her womb. But also for myself. And our daughters. And for every other woman who lives, suffers, and dies by the mercurial whims of men.“-MarthaFor being a book outside of my norm as of late, this book was marvelous. It had so many parts that both shocked and awed me. Think of “Call The Midwife” with an “Outlander” feel.Martha is the best. She is someone you want on your side because she is a badass and a sweetheart. She will give the shirt off her back but will also make you pay for what you did. Her character was wonderfully written. How loved she is from those in the town, besides those who’s opinions don’t matter, is shown in the writing.Seeing as Martha is a midwife, following along in her daily life as a wife and mother, but adding her chaotic schedule delivering babies, it was a fun ride. Not all of the stories were sunshine and rainbows, but that added to the reality of the story. Giving it something you can connect to as it is pulling you in. Life is not a Hallmark movie were everyone gets along and the worst that could happen is the caterer cancels on you. No, sometimes the cruelty of man comes out and we have to find a way to live life after those events. In this story, there is a respectable amount of good and bad to show life may have it’s bumps, but there is still parts to cherish. Still to make you want to keep going.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71WThpyqLSL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine Boos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 7, 2023",
                "reviewTitle": "Entertaining, interesting!",
                "reviewText": "This was a great read! The author lent a convincing voice to Martha, inspired by her real life. Very interesting indeed to read about all Martha achieved as a midwife ( not one mother she delivered died ). In this fictional novel though, she is also investigating a murder.... Her story reveals a woman very much aware of the low consideration of women even in case of rapes.... Even though she clearly and loudly dared testify in court, her testimony was not taken seriously....The author painted a warm picture of a very lively Martha. I liked her immensely straight from the beginning of the novel! I loved her courage, resilience, her sense of duty and deep love for her family. Martha is also witty and brought a smile to my face many times! Through Martha's story, the legal and social historical background is meticulously revealed. Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kak",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 14, 2024",
                "reviewTitle": "Wonderful story based on a real life midwife.",
                "reviewText": "I absolutely loved this book. It was such a good story, taken from a diary of an actual woman. So well written, I couldn't put it down. The characters were very engaging and the storyline, although sometimes a little difficult to deal with- justice in the 1700's, was wonderful.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nagem",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Over rated.",
                "reviewText": "I had high hopes from all the great reviews I've read about this book but foundthe last 1/2 extremely underwhelming. There were too many characters and found myself having to keep a log as to who was who. Also the ending was quite lame and by the time the mystery was revealed I was so bored with the story i didnt even care anymore. I'm not an avid reader but I would sadly have to say this one of the most dry books I've ever read. I'm disappointed I paid $17 for the Kindle edition. Definitely not worth it in my opinion",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}