{
    "remaining_requests": 43,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Haunting-Brynn-Wilder-Novel/dp/1542020123",
    "body": {
        "name": "The Haunting of Brynn Wilder: A Novel",
        "price": "$7.00",
        "originalPrice": "",
        "rawPrice": 7.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Haunting-Brynn-Wilder-Novel/dp/1542020123",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Maa WYpiL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51kcN5HRf0L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Wendy Webb",
            "link": "https://www.amazon.com/Wendy-Webb/e/B00386602A/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 25024,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 12 hrs 57 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=10457"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Lake Union Publishing (November 1, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 287 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1542020123"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1542020121"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,223 in Books (See Top 100 in Books) #31 in Ghost Thrillers #132 in Gothic Fiction #194 in Gothic Romances"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 25,024 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Michele K. Rose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAWUUYM6TIKLBOOA534MIO2BCWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHGGNG6UB115S?ASIN=1542020123",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars wow!",
                "reviewText": "Not what I expected. But it was way better than I expected. I would recommend this book to anyone! Great book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karissa Eckert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTP676UYEDVCDRACYZMRK7HO5MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z3N0ELVP29KD?ASIN=1542020123",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 10, 2021",
                "reviewTitle": "4.0 out of 5 stars Well done but the ending feels contrived.",
                "reviewText": "Series Info/Source: This is a stand alone book. I originally got this from Kindle First Reads and then ended up picking up the audiobook from Audible to listen to.Audiobook Quality (4/5): This audiobook is well done. The narrator does an excellent job reading it and I don’t have any complaints, it was very pleasant to listen to.Story (4/5): I liked a lot about this book but thought the ending felt a bit off and too contrived. This is kind of a slow burn mystery with some magical realism, ghosts, and time travel of sorts. There is also a heavy theme of dealing with grief and taking care of ailing elderly family members. This is not really a feel good book, I found a lot of the story to be very depressing and there were a lot of tear jerker moments. However, I enjoyed the vacation town and the characters we met there. There is a heavy theme of love helping people get through hard times too. The story does have a sort of sense of peace about it even as our characters struggle with some tough life issues.Characters (4/5): The characters here were very well done. I enjoyed Brynn and all she was struggling with (ending a long term relationship, death of multiple loved ones, and lack of joy in a job she used to love). Watching her reset in this small town was intriguing. There are a number interesting characters in here with complex pasts and issues they are dealing with. Characterization is in general very well done and if you love character driven stories you should enjoy some aspects of this.Setting (4/5): I love that this takes place on the shores of Lake Superior, one of my absolute favorite places to vacation to. The atmosphere is captured perfectly. I couldn’t find an actually small town called Wharton in MN on Lake Superior but this does capture the vibe of a lot of lakeside small towns in the region. Very well done and fun to visit.Writing Style (4/5): I really enjoyed a lot of this story. The characters were interesting and the setting is a lot of fun. I initially enjoyed the mystery and the spooky hauntings. Then things start to get a bit convoluted, there is talk that Alzheimer’s Disease is really mental time travel and then somehow we are talking about not only time travel but supernatural beings. It was all very contrived and didn’t seem all that plausible. It was a pity that this story got so twisted around these strange elements towards the end because I really enjoyed most of the aspects here.My Summary (4/5): Overall I enjoyed this but was a bit disappointed by how convoluted the mystery resolution got. I liked the characters, the location, and the atmosphere. This had an excellent ghost story going initially but then too many odd elements get thrown together to resolve this mysterious ghost story. I would still recommend if you enjoy Lake Superior, interesting characters or a ghostly magical feel to your story. Just don’t think too hard about how everything wraps up or you might hurt your brain.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. L. Lebron",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5LF26CWD2OFN7DIJY3UQLKKZJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TVS06URNT06V?ASIN=1542020123",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome story",
                "reviewText": "I loved reading this story. I didn't want to put it down. I wanted to finish reading it in o e night. Since I needed my s!keep to be tested for work, I had to force myself to put it away and read it the next day. If you love reading romance and suspense stories, you will enjoy reading this story.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FistiFluffs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXJFICN47ZEQ6I4IYJ2BDHPYNSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30ADDLDEXUITH?ASIN=1542020123",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2020",
                "reviewTitle": "3.0 out of 5 stars The ending ruined it for me",
                "reviewText": "I was looking forward to a light, spooky romance after a very challenging summer and early fall, and at first, I thought this book would be exactly that. The setting is lovely and the characters, other than Brynn's love interest, are pretty richly textured. There are some nice, creepy touches and a good amount of heart to make up for the not always stellar writing (I noticed a lot of really repetitive language that a good editor should have caught - drove me bananas!). You really get caught up in the relationships, and the small town feel. However, the long leadup screeches to a half with a rushed final chapter, a confusing and bumpy transition, and a cheesy, too-thoroughly-explained wrapup that left me nostalgic for the mystery and suspense of the first 95% of the book. Spoilers to follow...........Now, for the bad. First of all, it is not lost on me that the only Black character (who is never even called Black, or even African American, though it is mentioned that he has \"African ancestry\") is the least fleshed out character in the novel. This attempt at colorblindness is irksome on its own, but even more so when you realize that his only character development is when he talks about his dangerous, terrible, childhood (because of course the Black character's first memory is finding a gun and shooting his own father). One could argue that the mystery behind him is part of the story, but, other than constantly repeating how handsome he is, there really isn't much to explain why everyone loves this guy who they know nothing about, except that he's nice, handsome, and drives a fancy car. The mystery around him isn't even very mysterious. No one really ever asks him for more details about his work, or where he goes running off to for his appointments. It's just left to the reader to wonder. It's very hard to believe that, in this small town full of busybodies, no one presses this mysterious stranger for more information.The final part of the novel is extremely rushed. We go from a tense dinner to an intriguing reveal (Dominic may be more closely linked to several mysterious deaths than we realized), but then the whole thing kind of just... Ends. No more confrontations with Nick. No more suspicious revelations. No more suspense. Just a whirlwind romance and a sudden death (which also doesn't really make a ton of sense - why, especially with the knowledge of what he does and what comes after, would Dominic jump into a stormy, freezing Lake Superior? There is no way he would be able to save the man.).Then, after a break where we learn a very little about the rest of Brynn's life, the big reveal at the end. Well, kind of. We come to kind of, sort of know who, or what, Dominic is, and why he and Brynn were drawn together, but there are a lot of unanswered questions. How did he get from his childhood and troubled youth to helping people cross over? Was he always this angelic figure, or only after death? Why would Brynn go off to die alone when she had a family who would worry about her? Where and when did Dominic get his mysterious tattoos? Did he really die, or was he never really alive? Why couldn't Dominic come to her?But I think the thing that bugs me the most was the explanations that went along with everything. Rather than trusting the reader to intuit what was going on with interesting symbolism, it's all sort of... Spelled out. It felt a little like someone explaining a joke. And the ending scene, where everyone is there for happy hour, just felt really chintzy and like the end of Titanic.I enjoyed a lot of this book, but I was so disappointed by the last two parts that I couldn't give it a great review. The experience was really spoiled for me. I felt like the author had a deadline to meet and couldn't figure out how to wrap things up, so she hastily threw something together. It could have been such a good book. What a bummer.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJFKYFBELPBXXOGUONT4ETKPLSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFC7VFD6LX41Y?ASIN=1542020123",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful",
                "reviewText": "Totally breathtaking! I loved it! A must read! I will be following this author. Could not put this book down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel Bridges",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPNSICMTUZ5ZFENUUYROU5SUX4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UZ2UX7SLV48V?ASIN=1542020123",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Judge a book by its cover",
                "reviewText": "The title and cover caught my attention. I love reading all kinds of genres and was in a paranormal mood. The book wasn't what I was expecting based off the title, but was a surprisingly unexpected different take on paranormal from what I'm accustomed to reading. Very much enjoyed the book, and will be reading others from the same author. That last chapter!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEA6GIAKKZ3XJGKPI3AB3V5KQ7HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MDAREO2KOQ3D?ASIN=1542020123",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful book",
                "reviewText": "FANTASTIC! I loved this story. A very relaxing book to curl up with! Looking forward to reading all of Webb's titles.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lauren ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG27MQPJMR7MDV7EFEJFYKZHIAXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R161ZZYD82IQT3?ASIN=1542020123",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Couldn't put it down!",
                "reviewText": "This was one of the best books I have read in a long time! I could not stop reading and upon finishing it, quickly purchased other books written by the author! An absolutely fantastic read if you love a little bit of the shivers mixed in with incredible characters and a love story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica MacDonald",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 12, 2021",
                "reviewTitle": "Beautiful book",
                "reviewText": "Beautiful book. Beautiful ending. I would recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kat Edley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 5, 2023",
                "reviewTitle": "absolutely beautiful",
                "reviewText": "What a beautiful book, really makes you think. And beautifully written. What a pleasure to read. I couldn’t put it down. Now to read The Illustrated man 🤪",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LolaNicole",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 20, 2021",
                "reviewTitle": "Lovely.",
                "reviewText": "Such a nice story. World building and character building was fantastic. Youre writing reminds me of poetry.Id recommend this book to people that enjoy a breezy story.Unfortunately this book isn't to my taste (I prefer the more intense, dark and twisted stories) but this book to me is more of a comfort book and the ending was lovely.Wendy Webb, you're truly a wonderful writer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peggy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2021",
                "reviewTitle": "It’s not scary!",
                "reviewText": "I thought that since I saw this book listed as a horror, I was going to get a good scare. It is your usual boy meets girl story with a bit of fantasy trying to appear scary. It might make for a scary movie but someone touching you in the dark isn’t scary in a book. Fast, easy read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marj Venmore",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 18, 2020",
                "reviewTitle": "A really earthy read",
                "reviewText": "This is the first book I have read by this author although I know a lot of her writing is on the gothic side. Well gothic is not my genre it’s one I have done many years ago and changed to a different genre. Brynn is such a unusual name which funny enough o was drawn to, I do believe in spurts I have had too many things happen to me not to believe. I loved this book a real romantic tale of a meeting new people the short version who fall in love. However one of them Are not a earthly being.I got the impression that neither were. Yet how it’s written TSH as if one I is of this works and one from the next world. The twist that cone take this on a different path then further twist take you back leading into another direction it’s the twist and turns really through you off in directions that changes my thinking I do not know why it’s like I was being pulled by Luane towards my thinking of how the love story will end. I am not going to give anymore I don’t want any spoilers. Overall if you like this type of thing then definitely recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}