{
    "remaining_requests": 10,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Paris-Mystery-Kirsty-Manning-ebook/dp/B0BLTZS2XN",
    "body": {
        "name": "The Paris Mystery",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Paris-Mystery-Kirsty-Manning-ebook/dp/B0BLTZS2XN",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71IsImI+LKL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kirsty Manning",
            "link": "https://www.amazon.com/Kirsty-Manning/e/B00404FLZG/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 300,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157305011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BLTZS2XN"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Vintage (July 25, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 25, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1278 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0593685547"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#116,542 in Kindle Store (See Top 100 in Kindle Store) #1,186 in Historical Mysteries (Kindle Store) #1,524 in Historical Mystery #3,930 in Cozy Mystery"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 300 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Linda B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQICSQ7IPUXUNXDXETSR2KWWHLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D1477AWLNRAO?ASIN=B0BLTZS2XN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Murder in Paris",
                "reviewText": "It’s 1930s Paris, Australian born Charlie (Charlotte) James relocates after a devastating divorce. Based on the byline “Charlie” James and the assumption that Charlie is a man she is hired by the Paris Times newspaper. Determined to prove that she is the best journalist possible and better than any of her male counterparts, Charlie’s first assignment is to cover British expatriate and Socialite Lady Ashworth’s extravagant Circus Ball. Charlie hopes that at the very least she’ll be sure to make connections with the most interesting and exciting upper crust of society. Festivities come to a halt when an influential and detestable banking investor is murdered. Charlie finds herself a part of solving the mystery. Who would be so bold as to murder someone at such a high profile event? As she becomes involved in covering the story, Charlie becomes part of the Paris scene. For me, I found an extraordinary amount of unnecessary details that detracted from the story line. Do I really need to know or care that a hanky tucked into a sleeve is blue? Secrets unravel and suspects are many. There’s an unexpected twist and for that reason I’ve given this ⭐️ ⭐️ ⭐️ 1/2 rounded up to four.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZE4SYUBI3B5CZZQTGMU6A2CKHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10J85KUM36RRW?ASIN=B0BLTZS2XN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "5.0 out of 5 stars mystery, 1930's",
                "reviewText": "Charlie [Charlotte] James is beginning a new job as a journalist for the London Times in Paris. She has moved there from Australia to escape personal issues. She is introduced to Lady Ashworth who she is to cultivate as an entry into society.At the first large social event, there is a murder of a wealthy, crafty banker. Who did it? This is what Charlie searches for the answer. There are many potential condidates for the killer. Several twist in the storytelling.The tale also has vivid description of society life pre- WW II--couture, cocktails, parties.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lag32583",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTHGQCZ36MYMQFIGTGQMXDS7V4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23XQ5AKLW7RLP?ASIN=B0BLTZS2XN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "3.0 out of 5 stars Good",
                "reviewText": "Interesting story and good start to a new series. I think Charlie’s character will develop over time.I received a gifted copy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Msjteach",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLUXS7QLSZ5IPWADY44O2YQX72A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37AC50KGTQBHG?ASIN=B0BLTZS2XN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "4.0 out of 5 stars A spunky main character, and a fun romp through 1930s Paris!",
                "reviewText": "Charlotte “Charlie” James arrives in 1938 Paris from Australia ready to start her dream job of reporting for The Times, and needing to impress her new British boss, but what is she hiding in her past? The Paris Mystery by Kirsty Manning is a fast-paced, intriguing story of a woman determined to find her place and establish herself in a world she is not quite a part of. Charlie is quickly immersed in a world of fancy parties, elegant design houses, and scandalous relationships, and she adapts well. She is determined to get the real story behind the murder of a shady investor, murdered at The Circus Ball, THE event of the season. She will have to rely on others to find the truth, regardless if she can trust them or not.Manning is brilliant at setting the stage and creating the glitzy world of booze, broads, balls, and brutes. You really feel that you are in the fabulous cafes and mansions of 1930s Paris. Manning creates a smart, sophisticated character in Charlie, and you are immediately rooting for her to prove her sexist boss wrong!Charlie’s past is slowly revealed and once done, it makes perfect sense for the character that we know in Paris. And it adds a layer of complexity to the story.The mystery twists and turns and the ending is quite satisfying. And the fact that this should be a series of books (following Charlie’s adventures) is an added bonus. Charlie is just that kind of spunky, saucy heroine you want to read more about.Great writing, lovely setting, and a main character you want to spend more time with after the book is over- all adds up to a 4/5 on the random rating scale.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs. Steg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3CQ5UHUH473WZJTUKVNGTASPIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYGGRHBKDUUFI?ASIN=B0BLTZS2XN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Great read",
                "reviewText": "This is one really great read. Hooked me in from the first page to the last. The characters are all spot on. Has you guessing and then rethinking that guess right up to the last page. Enjoyed this read and highly recommend. I way given an advanced reader copy of this very well written book by NetGalley and I am freely sharing my review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIXZSUOSECMWCMUEGH3BQXQCM3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F38CWH1QD729?ASIN=B0BLTZS2XN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Fun book!",
                "reviewText": "In 1938 Paris, the fashion scene is in full swing, along with fancy dinner parties thrown by elite members of society. Yes, I’m such a fashion outcast that I had to look up most of the fashion words in the dictionary. Haha! My regular fashion words such as tshirt and jeans didn’t quite make the Paris fashion scene if you can believe it!I wish I could attend their fancy parties, though! Ms. Manning’s descriptions of the circus masquerade party thrown by the Ashworths make you feel as if you are right there. The details she carefully crafts about the sights, sounds, and smells put you right in the middle of the action. The trainer leading the tiger around like a puppy, the India maharajas arriving on elephants, the white doves, and the black swans. The jugglers, the acrobats, and the fairy lights.Guests with masks and designer dresses wander the grounds and hobnob with the important people. Those important people make up many characters in this book. These characters make the book. They’re well written, unique, diverse, and so fun! I love Violet’s fashion and Lady Ashworth’s extravagance. Charlie is down-to-earth, yet elegant and sophisticated. She’s relatable and comes across as authentic. The relationships between the characters are also well written and help bring the story to life.There are many twists and turns to this book, and it definitely kept me guessing! It’s entertaining and so fun. I enjoyed my time in 1938 Paris, for sure! I may not fit in wearing my tshirt and jeans, but a girl can dream! This book has a little bit of everything with some romance, mystery, murder, high fashion, fancy masquerade parties, deception, loyalty, and betrayal.Content Rating: PG-13+• Profanity: None• Intimacy: Moderate (There are a couple of scenes, including a “self-pleasure” scene, and some innuendos. They aren’t too detailed or explicit.)• Violence: Moderate (There is a murder with a bloody weapon, and another character dies a very unsettling death.)",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}