{
    "remaining_requests": 36041,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Table-Recipes-Cooking-Eating-French/dp/1797202235",
    "body": {
        "name": "A Table: Recipes for Cooking and Eating the French Way",
        "price": "$17.45",
        "originalPrice": "",
        "rawPrice": 17.45,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Table-Recipes-Cooking-Eating-French/dp/1797202235",
        "soldBy": {
            "sellerID": "AVHMVZX3UPSLZ",
            "name": "QCompany",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AVHMVZX3UPSLZ&asin=1797202235&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51-g9-i520L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51cqbmHQYyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qPm3KW6pL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510W1pr7ICL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5102VbDtzfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XlT0fonYL.jpg",
            "https://m.media-amazon.com/images/I/6167z4a4aVL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Rebekah Peppler",
            "link": "https://www.amazon.com/Rebekah-Peppler/e/B08NHNBC9L/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "QCompany",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 449,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “If the snacks in the last book (Aperitif) can be taken as a preview of Rebekah Peppler's palate, I know the recipes in À Table will be right up my alley.\" ―Food52, \"12 Coming-Soon Cookbooks We Can't Wait to Read\"“As much a lifestyle guide as a culinary one, this is a no-brainer for Francophiles.” –Publishers Weekly About the Author Joann Pai is a food and travel photographer based in Paris. Her work has been featured in esteemed publications such as Saveur magazine, Condé Nast Traveler, and the New York Times. Rebekah Peppler is a Paris-based food writer, stylist, and author. She is the author of the James Beard Award–nominated Apéritif: Cocktail Hour the French Way and Honey, a Short Stack Edition. She is a regular contributor to the New York Times. Her recipes and food writing appear widely, including in Vanity Fair, Bon Appétit, Real Simple, Food Network, and more. When she's not working, you can find Rebekah cooking, eating, and drinking with friends in the 18th arrondissement."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Mastering the Art of French Cooking meets Dinner in French in a beautifully photographed, fresh approach to French cooking and gathering, with 125 simple recipes.À Table: Recipes for Cooking and Eating the French Way is an alluring, delicious invitation to the French table from Paris-based American food writer and stylist—and frequent New York Times contributor—Rebekah Peppler. It is both a repertoire-building cookbook and a stylish guide that will make readers feel as though they are traveling through France with a close friend. Peppler shares 125 elegant \"new French\" recipes that reflect a modern, multicultural French table. With approachable recipes, a conversational tone, and aspirational photography, À Table contains secrets for cooking easy, sophisticated meals, and recreating the everyday magic and charm of French life anywhere in the world. ACCESSIBLE FRENCH COOKBOOK: Included are classics such as Ratatouille and Crème Brûlée; regional dishes like Basque Chicken, Niçoise (for a Crowd), and Alsatian Cheesecake; as well as recipes born of the melding of the cultures and flavors that help define contemporary French eating, from Bigger Bánh Mì and Lamb Tagine to Green Shakshuka. USEFUL ADVICE: Guidance on shopping, stocking the pantry, and preparing the table—plus stories on French food culture—make this not just a recipe-driven cookbook but also a lovely guide to modern French living. FOREVER CHIC: French cooking and the French lifestyle will never go out of fashion. À Table offers a window into an enviable way of life and is filled with inspiring, useful tips—perfect for Francophiles and anyone who likes to cook good food to share with friends and family.Perfect for: Home cooks looking for a simple cookbook full of straightforward recipes that rely less on fancy techniques and more on ease and accessibility Fans of Rebekah Peppler's work, including her James Beard Award-nominated book Apéritif and her regular writing in the New York Times People of all ages who like to plan unfussy meals with delicious food and minimal prep Adding to the shelf alongside cookbooks by Melissa Clark, Yotam Ottolenghi, Alison Roman, Jacques Pepin, and Tieghan Gerard Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Cookbooks, Food & Wine",
                "link": "https://www.amazon.com/Cookbooks-Recipe-Books-Wine-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=6"
            },
            {
                "name": "Regional & International",
                "link": "https://www.amazon.com/Regional-International-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4262"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Chronicle Books; Illustrated edition (April 6, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1797202235"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1797202235"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 7.5 x 1.2 x 10.3 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#77,780 in Books (See Top 100 in Books) #55 in French Cooking, Food & Wine #359 in Entertaining & Holiday Cooking"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 449 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Recreate the magic of a French evening anywhere in the world",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/9761aeaf-5c65-4f9f-91bd-5b1883b1705b.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "125 Simple Recipes for Cooking and Eating the French Way Chaud Comme Le Grand Aioli Tomatoes with Butter and Armanac",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c909ad88-0362-4784-890f-2aa7fddcb023.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/02c80364-47c9-436d-834d-85f7ae0bb720.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d9155d19-c630-4b71-af5a-549953ae1027.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "An inviting & accessible cookbook from a fresh voice in the food world",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/82b82a20-444a-407a-9463-027dc901b6eb.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Shortlisted for the Golden Poppy Awards Roast Chicken with Prunes Ratatouille Kouign-Amann",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/5521569c-d19a-4003-851f-718971b9f442.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/9a549f4c-95a8-4029-9b70-1c1ce29979f4.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3f89b688-65d9-45e2-b484-5b525da92880.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Invite Rebekah Peppler to a Table Why did you decide to create this cookbook? With À Table, I dive into the magic of France that I've gotten to know intimately living here. I share recipes that offer up the sexy, sparkling charm that is the French meal to others, wherever their homes may be. What can readers learn from the French way of cooking? The rituals and customs around cooking in France have long been romanticized, but that doesn't mean they're not accessible. À Table aims to merge the imagined French fantasy with the truth of cooking and eating to create a doable but charming reality. What is your favorite meal to make for yourself? My absolute favorite meal is really a \"snack dinner,\" which sounds much more chic in French: \"apéro dînatoire.\" On my table it includes Le Grand Aïoli surrounded by vegetables for dipping and a tin of sardines. Add a crusty baguette, some olives, maybe a few slices of saucisson, and a good bottle of wine and it's, hands-down, my favorite meal to enjoy.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/adb182c0-2afd-4ea8-901f-2f3ad81e22be.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/9761aeaf-5c65-4f9f-91bd-5b1883b1705b.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c909ad88-0362-4784-890f-2aa7fddcb023.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/02c80364-47c9-436d-834d-85f7ae0bb720.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d9155d19-c630-4b71-af5a-549953ae1027.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/82b82a20-444a-407a-9463-027dc901b6eb.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5521569c-d19a-4003-851f-718971b9f442.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9a549f4c-95a8-4029-9b70-1c1ce29979f4.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3f89b688-65d9-45e2-b484-5b525da92880.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/adb182c0-2afd-4ea8-901f-2f3ad81e22be.__CR0,0,600,600_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "PfutahPfutah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIQTOLD26BD6KTWHDFCI64BMHUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT27KFPN2BWNZ?ASIN=1797202235",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 28, 2021",
                "reviewTitle": "5.0 out of 5 stars Wow factor food without complicated recipes or exotic ingredients!",
                "reviewText": "Words cannot express how much I love this cookbook! I am not a fancy French cook, so was a bit worried that the recipes would be too complicated or the ingredients would be impossible to find. Definitely not the case!I’ve had this cookbook for about a week and I’ve made at least 10 recipes plus quite a few cocktails. I even had a small gathering and cooked exclusively from this book. My friends loved it and have also ordered it!This is completely approachable, with easy to find (or substitute) ingredients, many of which you probably have on hand. The author also gives tips on how repurposing sauces, dressings & leftovers so you aren’t left with a mystery jar in the fridge. And many of the recipes have similar ingredients so you won’t have a mostly full jar of spice gathering dust in the cabinet.The writing is witty and totally inspiring! The pictures will motivate you! Many of these recipes can be made in advance, which is perfect for entertaining. I made the carrot tatin pictured above (I promise, I didn’t decimate the carrots, I used rainbow carrots so the purple ones look charred :)) in the morning and it still looked and tasted great several hours later when my guests arrived.Highly recommend!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1LQVpLJWYS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "trebmalmada",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVJAT2TY3IGYT4H3D5RZLSTLM7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37J3GQGWW19SG?ASIN=1797202235",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2023",
                "reviewTitle": "5.0 out of 5 stars You will keep using this book",
                "reviewText": "There are not a million recipes, thank god. Just delicious ones that are as full of variety as they are preparation required.Also, she is just amazing. You will want to hang out with her after one paragraph.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RSYRSY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFWMGGIAYSOCN4EMYJH2FFSRCNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OPGWJ70U1CK?ASIN=1797202235",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 8, 2021",
                "reviewTitle": "5.0 out of 5 stars Elegant & très chic, À Table allows you to bring the magic of a Parisian table into your own home.",
                "reviewText": "From start to finish, this STUNNING and ELEGANT cookbook displays incredible creative mastery that has beauty, romance and magic layered throughout the pages from start to finish. This book makes you DREAM and gets you excited about the new world that awaits: a world in which we can all gather around a table again, rub elbows with friends and family, eat gorgeous things out of communal dishes, sip on wine for hours and linger on into the night. I'm completely in awe of the stellar aesthetics and impeccable photography, the food styling (done by the author herself!), witty language, the play with shadows and the presence of the female form throughout the book. What I most appreciate is the accurate and vibrant reflection of what modern day Paris looks like around the table (not only classic French, but also gives a fair platform to the myriad of influences (Middle Eastern, Asian, etc) that have made their way into the palates of the French. Each recipe has a \"remarque,\" Rebekah's clever way to introduce a bit of historical context for each cocktail or dish while also adding a personal (and usually hilarious) personal anecdote. Excellent book to have around if you like to entertain and want to add that je ne sais quoi feel and magic into your days and nights! Recommend 100000%.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71O6QDt+epL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91rBwW6TnNL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric DiCiannoEric DiCianno",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHODWQLRVMD3YLZADS4DSDSJOZWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R298L2I71W0DLO?ASIN=1797202235",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2021",
                "reviewTitle": "5.0 out of 5 stars A simple a beautiful look at French cuisine and entertaining",
                "reviewText": "I LOVE this cook book. I lived in France when I was younger just out of college. We had our sailboat in St Maxime and I had a French boyfriend from Brive la Gaillard (lived there too). That experience changed my entire life. I miss France dearly every day. This cook book has hand selected the perfect recipes to showcase life in France. From aperitif to dessert, Rules included, my favourite part. The thing l learned in France was that the rules of gastronomy are the most important. They are the way to experience life. It has been developed over centuries and they, in my opinion and probably the French as well believe it is perfect. I think this book reflects this in a kind and simple way doesn’t intimidate. Right down to the photography. She has done a wonderful job of capturing la vie en France. I am an avid cook and I look forward to making all the creations and reliving my time abroad. 😭😭😭🍷🍷💋",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1NDUXfCHIS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "bookwomen37",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPSCCTA4DUNZCA26DPLKOUATMSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ELQIRHIM4T4L?ASIN=1797202235",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2023",
                "reviewTitle": "4.0 out of 5 stars Cookbook and Entertainment Guide",
                "reviewText": "This book includes recipes and instructions on how to entertain. The photographs accompanying the recipes are beautiful. The recipes seem simple to follow with shopping lists. Most of the ingredients are easy to get. There are also helpful hints to make your dinner parties memorable. I enjoyed reading this book. I have not yet made any of the recipes. Enjoy",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hana Asbrink",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKQQLBE4CIMYL7YO3WZRVA2DPEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LIF10WHJQ0ZW?ASIN=1797202235",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2021",
                "reviewTitle": "5.0 out of 5 stars Don't even hesitate—add to cart immediately!",
                "reviewText": "I had high hopes for this book and it did not disappoint. In fact, it managed to exceed my already lofty expectations. My husband and I have frequently turned to Rebekah Peppler's previous hit, Apéritif, not just for its stellar (lower ABV) cocktails, but for all of the salty, snacky companion recipes. I had no doubt the recipes in À Table would hold up; what I didn't expect was just how much I'd be swept away by the gorgeous photography (another Joann Pai hit) and LOL-inducing (and very thoughtful) commentary. Maybe it's living under lockdown for the majority of the last year, but I read this book cover-to-cover in a single sitting the day I received it, letting myself dream of the days we can freely travel and enjoy the company of others safely again. In the meantime, you can cook and entertain your way through unfussy, approachable Paris life through À Table.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexis deBoschnek",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXINCKFVMRTS4J7K2XHQWY7PKJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQKJWHQ0HUKGN?ASIN=1797202235",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2021",
                "reviewTitle": "5.0 out of 5 stars A must buy for your cookbook collection",
                "reviewText": "Rebekah has managed to perfectly capture what it's like to live in France in the 21st century -- she has an incredible eye for capturing a world which you want to be a part of. I want to be where she is, drinking what she's drinking, and eating her delicious recipes. There's classic French recipes (of course), but with her own twist -- like Coq au Vermouth -- a riff on Coq au Vin, but Rebekah also branches out showing the type of food you might find at a dinner party in France today. The photos are some of the most gorgeous I've ever seen in a cookbook. Every photo has been so well thought out, from the food, to the light, to the styling. In the short time I've had it it's already been a huge source of inspiration. This cookbook is a must-buy!",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sbee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 5, 2022",
                "reviewTitle": "Great recipe book",
                "reviewText": "Really enjoyed this recipe book. Love the writing style, great recipes which are a good mix of faff and less faff depending on the amount of faffing time available to you, and an enjoyable read. Would recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. M. G. Squires",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 23, 2021",
                "reviewTitle": "Very nice book. We haven’t tried thing yet but the look delicious",
                "reviewText": "Home",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kris BanningaKris Banninga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2023",
                "reviewTitle": "Binding was split",
                "reviewText": "Shipping was fast, got what I ordered, unfortunately the binding was split/damaged right out of the box",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/610gxiGL65L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "french hen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 29, 2021",
                "reviewTitle": "nice book",
                "reviewText": "not enough variety for me",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$13.96",
                "sellerName": "Goat*Cheese",
                "sellerRating": "5"
            },
            {
                "price": "$17.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}