{
    "remaining_requests": 12542,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rockland-Luggage-Piece-Black-Size/dp/B003EZXPAK",
    "body": {
        "name": "Rockland Escape 4-Piece Softside Upright Luggage Set, Telescoping Handles, Black Dot, (14/19/24/28)",
        "price": "$78.55",
        "originalPrice": "$239.00",
        "rawPrice": 78.55,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rockland-Luggage-Piece-Black-Size/dp/B003EZXPAK",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CBL929RR"
        ],
        "asinVariationValues": [
            {
                "asin": "B003EZXPAK",
                "variationName": "Color",
                "variationValue": "Black Dot",
                "price": "$78.55",
                "variationImageURL": "https://m.media-amazon.com/images/I/5194njUPS5L._SS36_.jpg"
            },
            {
                "asin": "B00OJZ2JI8",
                "variationName": "Color",
                "variationValue": "Pink Chevron",
                "price": "$78.55",
                "variationImageURL": "https://m.media-amazon.com/images/I/510Lr85v4fL._SS36_.jpg"
            },
            {
                "asin": "B003EZSF3C",
                "variationName": "Color",
                "variationValue": "Pink Dots",
                "price": "$78.55",
                "variationImageURL": "https://m.media-amazon.com/images/I/51PXufkiMNL._SS36_.jpg"
            },
            {
                "asin": "B00N2ZMD3M",
                "variationName": "Color",
                "variationValue": "Tribal",
                "price": "$87.82",
                "variationImageURL": "https://m.media-amazon.com/images/I/51g-+QP05bL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "Only 12 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/5194njUPS5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41PTQOadQIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kjpy bDzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61izKSAHtkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419cFPYseBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aIHV11Q4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511Bb6LcueL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/89dfbd8c-8a69-4ccd-ab41-257fe26472b2/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Rockland Store",
            "link": "https://www.amazon.com/stores/Rockland/page/CAA93E4B-836A-4883-876C-C8D3845C9098?ref_=ast_bln"
        },
        "brand": "Rockland",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 493,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22. Order within 22 hrs 42 mins",
            "FREE delivery Monday, February 26"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Carry-on Upright: 20\"x 12. 5\"x 7. 5\" (with wheels)",
            "24-inch Upright: 24\"x16\"x10\"",
            "28-inch Upright: 28\"x18\"x12\"",
            "Tote: 14\"x11\"x5\"",
            "Two large front pockets",
            "Skate wheels"
        ],
        "description": "This beautiful deluxe 4-piece expandable luggage setis manufactured with a patented heavy duty eva-molded hi-count fabric. this set is perfect for the serious and experienced traveler manufactured with the very best heavy duty polyester and pvc backing, this luggage set is designed for the traveler on the go and comes with three expandable uprights and a flight tote bag. it comes packed with features including: an inside retractable handle, ez-roll in-line skate wheels, back zippered secured pockets, top and side comfort grip handle, stability bars at the bottom to avoid tilting, and locks and keys. upright features include: clear in-line skate wheel system for smooth ride push-button self-locking internally stored retractable handle system ergonomic and comfortable padded top and side grip handles two front full size zipper-secured pockets three internal organizational pockets for all your traveling needs each upright's interior is fully lined with a durable and elegantly imprinted lining elegant silver pewter heavy duty industrial hardware carry-on flight tote bag features include: elegantly imprinted full interior lining detachable and adjustable non-slip shoulder strap spacious main compartment maximum strength industrial hardware 19-inch carry-on upright: 19 inches high x 13 inches wide x 8 inches expandable to 10 inches deep. 6 lbs. 24-inch upright: 24 inches high x 16 inches wide x 10 inches expandable to 12 inches deep. 8 lbs. 28-inch upright: 28 inches high x 18 inches wide x 12 inches expandable to 14 inches deep. 9 lbs. carry-on flight tote bag: 12 inches wide x 11 inches high x 5. 5 inches deep – 1 lb.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b?ie=UTF8&node=9479199011"
            },
            {
                "name": "Luggage",
                "link": "https://www.amazon.com/luggage-suitcase/b?ie=UTF8&node=15743251"
            },
            {
                "name": "Luggage Sets",
                "link": "https://www.amazon.com/luggage-sets/b?ie=UTF8&node=15743291"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "31 x 19 x 13 inches"
            },
            {
                "name": "Item Weight",
                "value": "29 Pounds"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Fox Luggage"
            },
            {
                "name": "ASIN",
                "value": "B003EZXPAK"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "F106-BLACKDOT"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 493 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#474,040 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #367 in Luggage Sets"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Rockland 4 Piece Softside Upright Luggage Set This deluxe 4-piece expandable luggage set is manufactured with a patented heavy duty EVA-molded hi-count fabric. Made with the very best heavy duty polyester and PVC backing, this luggage set is designed for the traveler on the go and comes with three expandable uprights and a flight tote bag. A variety of colors and patterns are available for ever taste! Carry-on upright: 20\"x 12.5\"x 7.5\" (with wheels) 24-inch Upright: 24\"x16\"x10\" 28-inch Upright: 28\"x18\"x12\" Tote: 14\"x11\"x5\"",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1f68353d-7af9-45f4-9f53-10529bf94834.__CR0,196,1768,1768_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Features and Design Telescoping Handle The telescoping handle stows away conveniently and allows for easy maneuvering when extended. Expandable The upright expands an extra 2 inches in depth to maximize your packing capacity. Sturdy Inline Wheels Two sturdy inline wheels allow for easy transport of your belongings.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/6e5e5252-fc24-44c1-9abc-dd1e0a8a76b5.__CR0,196,1768,1768_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/6e727177-fcc8-47db-88b6-f4d4d37920ca.__CR0,1,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/db53ad20-3e72-42ec-a19e-89e79e8429a3.__CR0,220,1768,1768_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "About Rockland Luggage Since its inception in 1998, Rockland by Fox Luggage has been proudly producing quality luggage and bags for the style savvy traveler. Recognized for its graphic and colorful designs, Rockland prides itself on creating products influenced by current trends in design and fashion. Our products turn heads in a crowd and stand out in the baggage carousel, making it easy for quick exits out the airport. Affordable and travel resistant, Rockland bags are an ideal companion for everything from quick trips to the gym to overnight getaways to extended vacations. Our selection includes: luggage sets (4 piece, 3 piece or 2 piece), hard cases, soft cases, carry ons, rolling backpacks, travel duffels, rolling duffels, cosmetic bags, and kids' backpacks. Over the years, a few Rockland products have been featured in film and television. Their colorful designs make them ideal for an eye catching visual element on screen.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f58fbbdb-3d13-49d6-b7a9-c33c8d04dc0d.__CR0,0,2400,2400_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "F102-PINKGIRAFFE F46-BLACKDOT F32-ORANGE PRD322-NEWBLKDOT PTB419-OWL U02-BLACK Pieces 2 (carry on, tote) 4 (carry on, 24\", 28\", tote) 4 (carry on, 24\", 28\", tote) 1 rolling duffel 1 duffel bag 6 packing cubes Material Polyester Polyester Polyester Polyester Polyester Polyester Wheels 2 inline wheels 2 inline wheels 2 inline wheels 2 inline wheels No wheels No wheels",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/1f68353d-7af9-45f4-9f53-10529bf94834.__CR0,196,1768,1768_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6e5e5252-fc24-44c1-9abc-dd1e0a8a76b5.__CR0,196,1768,1768_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6e727177-fcc8-47db-88b6-f4d4d37920ca.__CR0,1,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/db53ad20-3e72-42ec-a19e-89e79e8429a3.__CR0,220,1768,1768_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f58fbbdb-3d13-49d6-b7a9-c33c8d04dc0d.__CR0,0,2400,2400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cfb2bd17-2df1-4005-9168-52a4014dcf17.__CR83,0,895,1790_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f2353b0b-1354-4627-a5bf-5f507843db1b.__CR83,0,895,1790_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/646a18c3-0f1f-4aca-995c-8fb13106beb6.__CR83,0,895,1790_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/009d467b-3715-495d-afd4-0ce439296ccc.__CR83,0,895,1790_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/39625d72-9d73-415c-9488-85a372c60039.__CR83,0,895,1790_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Brittany Waugh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5AKJWFJFQFJSS44NKKH4JK62RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EIRADJ1M0Q8H?ASIN=B003EZXPAK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2013",
                "reviewTitle": "5.0 out of 5 stars I love these bags!",
                "reviewText": "My luggage set actually arrived in just one day with prime, instead of two. It didn't really matter, since my trip is still over a month away, but it is always a nice surprise when this does happen.The reviews concerned me, at first, that I was about to pay $99 for something that would just get ripped up. However, I decided to go for it since I loved the polka dots and I don't see myself getting on a plane anytime soon, or maybe ever.I was actually surprised when I opened the box that the fabric felt thicker and higher quality than the one black rolling back I have been using for years (hand-me-down from my mom). The wheels roll smoothly, the handles open/close smoothly and have a nice, satisfying click to them when you push them back in. Small detail that doesn't matter... the whole handle is black, not gray or silver like in the picture. I actually prefer this.Another reason I like this set over others, is that the bags have the full length pockets on the front, instead of the two smaller pockets that most have. Not only does this look better, but allows for bigger/longer items (such as large envelopes) to be separate from the main bag.My zippers do not, in any way, seem cheap or plastic. I don't know if they upgraded the zipper pulls since previous reviews, but mine are metal with a thick rubber grip on them. They are quite nice and I don't see them snapping off at any point.The inside lining does zip open, if needed. However, the lining is pulled tight and, in my opinion, makes the need for extra support on the back of the bag unnecessary. I was prepared to do the cardboard adding thing, but I actually prefer the bags as they are, since they will provide more room for clothes without putting in a backing. The zipper lining feature is nice, though, as you could easily put extra cash or anything inside in case you are worried someone might go looking through your bags. I'd imagine that the nifty cardboard idea would make the zipper \"pocket\" an even better hiding place.Additional features include little slide in name tags, side handles, large mesh \"pockets\" on the inner \"flap\" and a lock with two keys on each bag. The locks and keys do feel cheap (think middle school diary), but that doesn't matter to me as I never bother locking anything that can be carried away.The smell isn't as strong as I expected from other reviews, but it IS there and it is not pleasant. It is no more than you would expect from any new book bag or anything though. It will air out in no time.Overall, I am in love with this set, and I am so glad I bought it. This is my first luggage set, ever. I used to piece together random bags from my mom for weekend trips. However, we are about to embark on our very first week long family vacation and I figured it was about time to get grown up luggage. I highly recommend this set.. the worst that could happen is you might actually get a defective set, as happens from time to time with any product. However, amazon would help you to exchange them AND they come with a 5 year warranty.Happy shopping!",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "perfume_and_pirates",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7KQRP44KAJTEAL7YMPRN2W3PXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NH266639JS8M?ASIN=B003EZXPAK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2012",
                "reviewTitle": "5.0 out of 5 stars Worked Great!",
                "reviewText": "These were purchased for me as a gift and though I was a little skeptical due to some of the reviews, they served my purpose well. The largest one fits within airline guidelines for checked luggage and I found it was more than enough space for our trip to San Diego. They come with locks attached, but they are a little flimsy. I didn't need them, so that was not an issue for me. There are many, many patterns and colors to choose from and I would recommend them to anyone looking for a sturdy, stylish luggage set. They went through flight changes, being checked and tossed around and were just fine at the end of our trip.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bamachic96",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFTSVF7AAOLM472BWL7YNPGZTZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9PBKCMAURSO1?ASIN=B003EZXPAK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2022",
                "reviewTitle": "5.0 out of 5 stars Amazing Quality, Delivery & Speed and love the discounted price.",
                "reviewText": "Love the colors, pockets, size & durability. Used to travel. Ty",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Lee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJNFN3CYL3JYEV2JDOMFW66AC2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AA9OWEI3C337?ASIN=B003EZXPAK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 23, 2011",
                "reviewTitle": "4.0 out of 5 stars Good looking bags but back a bit flimsy",
                "reviewText": "I loved the versatility of having different size bags all for one price. The biggest one isn't really that big, I was hoping it was a bit bigger in width and height. I like how all of them fit inside eachother to save space when not in use. The only part that I think they could have made a little more sturdier is the back. There is no hard part to it, the back part is just the fabric so if you have something sharp possibly it would poke and probably tear the fabric which isn't very thick. It had this zipper lining inside that you can actually open so I ended up cutting a piece of hard cardboard and putting it inside the bottom and then zipping it back up so it has a sturdy back. Plus it gives it a flat surface to put your clothes in when packing, otherwise it's all over the place. Otherwise for the price it's well worth it for travelers that only need luggage once in a while. I'm sure with time it will break but overall the look is cute and everything looks good!",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nilla",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGWI3JCTOVLGBKYPVYF6LNW6KZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37ZHL1XZALVY6?ASIN=B003EZXPAK",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 29, 2023",
                "reviewTitle": "3.0 out of 5 stars Pretty set!",
                "reviewText": "Decent product but the pink part ripped the first time I flew with them. There are 2 wheels and they don’t rotate so you can only pull them one way.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Myhouse4nine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE52W5A2RNSTU563OHBJ7SH3BHCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QNK0DDRESG1A?ASIN=B003EZXPAK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Bright fun colors on soft side luggage",
                "reviewText": "I needed luggage that was big enough to carry Christmas gifts to my daughter. This luggage was big enough for my needs and it's bright cheerful color is super easy to spot in the airport carousel. I have flown with it a couple of times, and my husband even used it once so he could find it easy. He was not amused by the shuttle driver that gave him grief over having a pink bag, but the bag served him well. It has two wheels that go straight.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teresa Kennedy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHELDZ7TK3SCJJQJ6FXPRZBJJIHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZKM9HP7GFMC1?ASIN=B003EZXPAK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Great",
                "reviewText": "This luggage is very nice and seems to be well-made. I really like the print.!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHB6BNNXFOIQYOWOMJKZCD5D7FKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSKYNPLBSSYW8?ASIN=B003EZXPAK",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 19, 2016",
                "reviewTitle": "1.0 out of 5 stars Cheap, cheap, cheap",
                "reviewText": "I know, I know- 5 pieces of luggage for $239.99 is too good to be true. And when it's marked down to $99.99 that should have been a definite red flag. Where to begin?Let's start with how the colors look online versus in real life. Yes this luggage is kind of loud online. But the pink seems a but muted for being such a true pink, and the material on the body looks like it might be un-cheap enough to offset that bold consummate-V pattern. In real life? Three different tones of neon pink. Neon. And is several different materials- the handle is part fabric strap material and part plasticky my pleather, and im not sure about the rest. And the body material? You can practically see through the white. It screams \"everyone look at my cheap obnoxious luggage!\"Don't even get me started on how the body fabric on the large outer front compartments was seen on noticeably crooked on two of the four pieces. This luggage set went right back in the box faster than I took it out.Long story short: if you want/need a full set of cheap matched luggage that no one else on your flight or continent will have, and you only have $100 to spend, then you hit the jackpot. Everyone else: run.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71nSarNY0HL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariana GOA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 12, 2024",
                "reviewTitle": "Buenas, espaciosas",
                "reviewText": "Tienen ruedas, tienen un cierre que permita que se puedan ampliar un poco, traen candados pequeños para los cierres (la app no me permite subir las fotos)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason Mous",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 9, 2020",
                "reviewTitle": "Didn't even make it out the front Door.",
                "reviewText": "Didn't even make it out the front door. All the zipper stitching came undone on the 30 inch bag. Black thread pieces sticking out everywhere. Also once you add a coupke items the bags will fall over. So disappointed bought this as a Christmas present for myself and my daughters trip and I had to quickly sew up the zippers as we were leaving. Very poor quality. Very unhappy as I had no time to return as they fell apart as we were walking out the door.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on April 10, 2019",
                "reviewTitle": "Compren este juego de maletas",
                "reviewText": "Esto son maletas en condiciones, muy contento",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 26, 2016",
                "reviewTitle": "Great luggage bag",
                "reviewText": "The product is good and light for you to pack your things and you don't have to worry for over weight. I would recommend for anybody to buy it and delivery time was good but UPS guys are terrible in delivering packages, I was at home all day and they dropped a note for me to come pick it up at the nearest UPS pick up zone. I say no no to UPS",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lorenzo grant",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 11, 2016",
                "reviewTitle": "Awesome stuff",
                "reviewText": "Worked well . Strong luggage set",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}