{
    "remaining_requests": 12766,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samsonite-Softside-Expandable-Luggage-Spinner/dp/B07ZZ1LJGR",
    "body": {
        "name": "Samsonite Solyte DLX Softside Expandable Luggage with Spinner Wheels, Midnight Black, 2-Piece Set (20/25)",
        "price": "$424.95",
        "originalPrice": "",
        "rawPrice": 424.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Samsonite-Softside-Expandable-Luggage-Spinner/dp/B07ZZ1LJGR",
        "soldBy": {
            "sellerID": "A314EWXE4BQPNI",
            "name": "Luggage Base",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A314EWXE4BQPNI&asin=B07ZZ1LJGR&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B089F2GWR6"
        ],
        "asinVariationValues": [
            {
                "asin": "B07ZYYS9YL",
                "variationName": "Color",
                "variationValue": "Mediterranean Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/11Y4yEpsXyL._SS36_.jpg"
            },
            {
                "asin": "B07ZZ1LJGR",
                "variationName": "Color",
                "variationValue": "Midnight Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01S8AJjeMPL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Mineral Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41WK4AZKzPL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Cedar Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/018d276QRqL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Iris Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01HcXJg2wxL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "Only 4 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Oodnif3yL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41z49qcS9IL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41GmBxJeeXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51GMvbgumhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51e9IH6C iL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61MbQk5YlKL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Samsonite Store",
            "link": "https://www.amazon.com/stores/Samsonite/page/81A46DBE-C753-4AAF-8778-120CB1CD199F?ref_=ast_bln"
        },
        "brand": "Samsonite",
        "merchantInfo": "Luggage Base",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2581,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 22 - 26.",
            "Or fastest delivery Saturday, February 17. Order within 14 hrs 8 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "2 PIECE SET contains: 20 inch Carry On (meets carry on size restrictions for those traveling domestically and looking to stay light) and 25 inch Spinner (maximize your packing power and the ideal checked bag for longer trips)",
            "USB PORT on 20 inch Spinner for charging devices (battery not included)",
            "SMART FIX BUCKLES to keep tie-down straps out of the way when packing",
            "10 YEAR LIMITED WARRANTY: Samsonite products are rigorously tested to ensure our products meet stringent standards. This bag comes with a 10-year warranty against defects in materials and workmanship",
            "FOUR MULTI-DIRECTIONAL double spinner wheels allow 360 degree upright rolling so there is no weight on your arm or shoulder",
            "BUILT-IN ORGANIZATION including WetPak pocket and zippered mesh pocket"
        ],
        "description": "This Solyte DLX spinner suitcase maximizes packing capacity with an expandable zipper and interior and exterior organization. Responsive 360-degree dual spinner wheels keep up with your pace, and rugged polyester exterior offer years of dependability.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b?ie=UTF8&node=9479199011"
            },
            {
                "name": "Luggage",
                "link": "https://www.amazon.com/luggage-suitcase/b?ie=UTF8&node=15743251"
            },
            {
                "name": "Luggage Sets",
                "link": "https://www.amazon.com/luggage-sets/b?ie=UTF8&node=15743291"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "9.5 x 18 x 25.25 inches"
            },
            {
                "name": "Item Weight",
                "value": "18.61 Pounds"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Samsonite Corporation"
            },
            {
                "name": "ASIN",
                "value": "B07ZZ1LJGR"
            },
            {
                "name": "Item model number",
                "value": "123561-1548"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,581 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#23,249 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #275 in Luggage Sets"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Color Assortment From the bright and stylish design to the accent pops of color, you will never have to worry about keeping track of these eye-catchers. 1548 | Midnight Black 1560 | Mineral Grey 0559 | Mediterranean Blue Samsonite Solyte DLX Go Boldly. Solyte DLX is sleek, modern luggage that’s both stylish and strong. That’s why when you’re going in six directions, you depend on Samsonite to stay with you every step of the way. Maximum capacity, heavy-duty construction, and thoughtful design – these are the qualities you look for in a travel companion. Smart decisions pay for themselves.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/6bdee5c2-de1a-4ac8-916e-a48278092d64.__CR0,57,589,785_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/84303a07-4a56-4910-b3cb-42d8478fef24.__CR0,750,3000,1500_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Functional and Thoughtful Design Smart Sleeve Ultra-maneuverable stackable luggage ensures hassle-free, one-handed mobility of both sizes at once. Secure the Travel Duffel, 20” carry-on spinner or the Underseat Wheel carry-on top of the 25” or 29\" spinners using the SmartSleeve system and never worry about toppling bags again 360 Dual Spinner Wheels Individual hardened steel cartridge bearings in the wheel system help increase mobility. This lightweight line offers heavyweight protection riding on effortless 360 degree Spinner Wheels. All you need to do is push your case along and the wheels do the rest. Push-Button Handle Wider contoured handle tailors to the traveler's unique height and movement allowing multiple points of contact and interaction. Handle stops ensure a roll contoured to heights.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/9dd71325-a779-4b49-8641-c6eb09c74e4a.__CR0,0,3000,3000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2fd4b597-1aad-4594-8f1a-362a78d4b61f.__CR0,0,941,941_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/bdadca19-7265-49fa-8fa1-77e51149c2dc.__CR0,0,3000,3000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "About Samsonite Samsonite’s not just in the business of making luggage, we’re in the business of building confidence. Confidence that when you step off the curb, your luggage wheel isn't going to pop off. Confidence that if you put your laptop in the bag in one piece, that’s the way it will come out. Samsonite has set an industry precedence by perfecting and innovating luggage, casual bags, backpacks, travel accessories, and now electronics carriers and laptop bags. Over one hundred years of reliability, durability, style and innovative functionality have made Samsonite’s iconic products, and brand, the global leader they are today. If you are going to head out the door, do it with peace of mind. Because, life has a way of coming at you fast. Be ready for anywhere.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7d24a368-702d-4b72-9d05-bd7a48ec08d0.__CR0,0,3000,3000_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/6bdee5c2-de1a-4ac8-916e-a48278092d64.__CR0,57,589,785_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/84303a07-4a56-4910-b3cb-42d8478fef24.__CR0,750,3000,1500_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9dd71325-a779-4b49-8641-c6eb09c74e4a.__CR0,0,3000,3000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2fd4b597-1aad-4594-8f1a-362a78d4b61f.__CR0,0,941,941_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bdadca19-7265-49fa-8fa1-77e51149c2dc.__CR0,0,3000,3000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7d24a368-702d-4b72-9d05-bd7a48ec08d0.__CR0,0,3000,3000_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "KrisPT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2JMIYAFSGFUPEHYXYISRZHQQVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25PQDNAA3MCOR?ASIN=B07ZZ1LJGR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "5.0 out of 5 stars PERFECT CARRY ON",
                "reviewText": "This is the perfect bag for carry-on. It is 22 inches from wheels to handle so accepted by most USA airlines for overhead storage. Color is beautiful. Fabric is a good weight and should hold up. It is lightweight and rolls easily. There are a lot of storage pockets to separate items from each other. I should get many uears of use out of this bag.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Keith B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIY3UQU4CN27UQL52G5MAMTXHTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NFUBHWONE9G2?ASIN=B07ZZ1LJGR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice quality for the suitcase, wheels juries out.",
                "reviewText": "Purchased this to replace a 20 year old Samsonite that had to get put out to pasture. I was looking for a lighter weight suitcase that had a few more options and less weight. Since my previous suitcase was a Samsonite hard side I went with the DLX. This is definitely lighter and there are plenty of storage options. Places to tuck various items in. It does expand and hasn't prevented me from getting through any airline size restrictions. The only issue I have is the durability of the extendable handle and wheels. They seemed to have missed the memo on Samsonite quality reputation. One wheel is starting to act up and has an issue swiveling when there's weight. The handle is getting a little loose. Wish they still had a two wheel option.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angela Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVJ5LKDJGG3EL2UIK2SJ5HVYUHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P4PYRNV73NUW?ASIN=B07ZZ1LJGR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Spectacular but Too Small",
                "reviewText": "I've had this same bag for 15 years and the wheel and handle just broke off. It's been around the world with me 23 times. Bought this new bag as a replacement and it's incredibly durable (Same model, features, wheels, zippers, soft shell, etc.) BUT... was marketed as a 22-inch bag and when it arrived was only 20 inches tall with an interior of 19 inches. I use it for my laptop and this was literally a couple of inches too small for my needs. I sent it back and bought the bigger version. NOTE: CHECK the specs on the listing pages. If the 22-inch is unavailable, you will be re-routed to the \"next available\" bag and may purchase the smaller bag without knowing it. This bag though, will take a beating and last for years.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mayor g.m.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDK6EYKASZ44LDXH344YBV5MNXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MGOYE0J3L90B?ASIN=B07ZZ1LJGR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2023",
                "reviewTitle": "4.0 out of 5 stars can't wait to use it!",
                "reviewText": "Ok, I haven't gone a trip with this suitcase yet put I can't wait to try it. I am crazy about researching items before I buy anything and I did a ton of research on suitcases in preparation for a trip I'll be taking later this year. The big hurdle was trying to find a suitcase set I wanted that fulfilled the picky requirements of Air France/ KLM airlines. Don't even get me started on their under-seat bag restrictions. I had to decide between hard side and soft side and chose soft side hoping it would be more pliable and not dent or crack like many hard-sided cases I read about in reviews. I like outside pockets that don't take up room from the interior room for clothes. I wanted a USB port, which this one has, and it's located in an exterior side pocket which I think can double as a water bottle pocket. It does not have the new TSA locks that zippers snap into but that was not a bid deal for me as I've always used my own TSA padlocks and they work fine. The extendable trolley handles seem a teeny bit flimsier than other suitcases I saw in stores but everything else seems so sturdy and well made. Note: the wheels spin very easily and smoothly but they seemed to struggle a bit when I rolled my suitcase from hardwood floor to a thick area rug. Once on the rug it rolled pretty well. I also bought the 25\" case for longer trips and the carry-on bag has a strap that enables you to set it on the trolley handle of a larger case so you don't have to wheel two suitcases around. The interior is simple but well thought out with a wet bag and other compartments. This is ideal not just for swimsuits and really wet items but for those mornings when I have to pack up items I washed the night before that didn't quite dry thoroughly. There are little slots on either side of the main interior compartment that the tie-down straps slip into so they can stay out of the way while you're packing. Good thinking. The main compartment for the carry-on is deep and roomy. I will add to my review once I actually pack. I'm going to try to pack for two weeks abroad in just my carry-on and my under-seat bag but if that doesn't work I'll use the 25\" case. I ordered the blue color which appears to be a medium deep royal blue but in person it's what I call a true dark teal, which I love. In different light it can look like green or blue. I wanted a color or style that doesn't shout out \"A woman uses this bag!\" (for protection...I don't want to be a target) The two brands it came down to were Travelpro and Samsonite. Both have very good guarantees. It was very hard to find a set from Travelpro that had everything I wanted and since I had loved my 30-year-old Samsonite cases I had gotten rid of last year, and the reviews were so good for the Solyte set, I went with Samsonite. The four stars are only because I haven't used them yet. I really hope to give them five stars in a later review.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "drynard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNBRNLDX3N4DKHIYE7DUHQLKAJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZSMQB8HWRT0E?ASIN=B07ZZ1LJGR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Love my samsonite",
                "reviewText": "Had been wanting a spinner carry on for quite a while Used it on a recent trip abroad and it performed perfectly. The only thing that's annoying is I keep getting my hand pinched in the handle, as it stretches out into two sections and then contracts when put down; if you aren't careful, your hand or fingers get caught in between and you will be cussing because it hurts so much. Still great quality and would buy again.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa Cheesebrough",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG256FPCFUUS4LR42E7KUZMWGNIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22TPZC1PG1W3H?ASIN=B07ZZ1LJGR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Fabulous Little Baby",
                "reviewText": "This little suitcase is perfect for a weekend trip whether you're flying or not! Works like a dream in an airplane because it's small enough to push right down the aisle. Works great for car trip because you can toss it right behind your seat and off you go! The wheels are tops and swivel like no other!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janet ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGPHK3E6YA5WCP6AMTJIYQVEQKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EZ3D2AKEV36Z?ASIN=B07ZZ1LJGR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect!",
                "reviewText": "Stain resistant, roomy, easy maneuverability with 360’spimning wheels, lightweight",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUIFQBR4ISKTBMHXLE2Q2TZMELQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R248XRA1LFSECE?ASIN=B07ZZ1LJGR",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "1.0 out of 5 stars Don't Believe the Dimensions!",
                "reviewText": "I ordered this item because the dimensions listed are the same as what I am replacing but when it arrived, it was clearly smaller. I measured it and the length and width are not what was advertised. Both the Overall and Packing dimensions are about an inch less than what is advertised. I am in the processing of returning it. Might be why this item has such a high return percentage. The dimensions being off did not diminish the quality of the item. I gave it one star to help someone else avoid my situation.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rodolfo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 5, 2023",
                "reviewTitle": "Muy Recomendable",
                "reviewText": "Buena calidad de la tela y su hechura se siente resistente para el uso diario, esta de buen tamaño para subirla a la cabina del avion, sus bolsas interiores y exteriores con cierres son muy practicas para separar las cosas necesarias para un viaje, me sirve muy bien para llevar ropa y lo necesario para un viaje de 7 dias, sin duda es de las mejores maletas blandas que hay.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 5, 2022",
                "reviewTitle": "No USB port :/",
                "reviewText": "The media could not be loaded. It's a nice bag, I love samsonite... But there no USB port as described. Just wanted to let potential buyers know. There's a part that looks like it could be a port in the back,but it's a built in address tag.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/D1x-7mc7duL.mp4"
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 3, 2023",
                "reviewTitle": "As expected",
                "reviewText": "satisfied with my purchase",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Huda Saliba",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 15, 2023",
                "reviewTitle": "Not worth for the price",
                "reviewText": "I paid a lot of money for this to get the best quality but unfortunately I had a big problem with the handle, it stopped working in the middle of my busiest time at the airportPlus the USB is not working",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ANA GRACIELA FERNANDEZ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 10, 2020",
                "reviewTitle": "bIEN EN TIEMPO Y CALIDAD",
                "reviewText": "bIEN.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$429.88",
                "sellerName": "Altman Luggage Co.",
                "sellerRating": "4"
            }
        ]
    }
}