{
    "remaining_requests": 12679,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/American-Tourister-Expandable-Softside-Luggage/dp/B07ZSWTBN3",
    "body": {
        "name": "American Tourister 4 Kix Expandable Softside Luggage with Spinner Wheels, Pink, Underseater",
        "price": "$73.27",
        "originalPrice": "$89.99",
        "rawPrice": 73.27,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/American-Tourister-Expandable-Softside-Luggage/dp/B07ZSWTBN3",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08ZV1MM47"
        ],
        "asinVariationValues": [
            {
                "asin": "B074ZRLJHY",
                "variationName": "Color",
                "variationValue": "Black/Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31CS4zpRnTL._SS36_.jpg"
            },
            {
                "asin": "B074ZL3Y6X",
                "variationName": "Color",
                "variationValue": "Purple/Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/413lVnBAbSL._SS36_.jpg"
            },
            {
                "asin": "B07ZSWTBN3",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41mAA3xE0KL._SS36_.jpg"
            },
            {
                "asin": "B074ZWWVQQ",
                "variationName": "Color",
                "variationValue": "Teal",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41SXadTIPvL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41wnkwcALSL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51k Brh7W1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xjoD9QJkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bUNP10rLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511nVqIZDAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 EQFhhfxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lVhGB0heL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the American Tourister Store",
            "link": "https://www.amazon.com/stores/AmericanTourister-SamsoniteCorporation/page/1CBFFEF4-C665-43B8-808D-C586D076D8AC?ref_=ast_bln"
        },
        "brand": "AmericanTourister-SamsoniteCorporation",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 5301,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 22 hrs 56 mins",
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 21 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Single airflow inline wheels",
            "Color pop interior with cross straps and large diagonal blouse pocket",
            "Easy grip soft co molded zipper pulls with sonic welded logo",
            "Takes functional and thoughtful design to a higher level",
            "8x14x18"
        ],
        "description": "This 4 KIX takes functional and thoughtful design to a higher level. All cases expand 1. 5”, single airflow spinner wheels. Color pop interior with cross straps and large diagonal blouse pocket. Easy grip soft co molded zipper pulls with sonic welded logo.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9479199011"
            },
            {
                "name": "Luggage",
                "link": "https://www.amazon.com/luggage-suitcase/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15743251"
            },
            {
                "name": "Carry-Ons",
                "link": "https://www.amazon.com/Carry-On-Luggage/b/ref=dp_bc_aui_C_4?ie=UTF8&node=15743261"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "8 x 18 x 14 inches"
            },
            {
                "name": "Item Weight",
                "value": "5.93 Pounds"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "American Tourister"
            },
            {
                "name": "ASIN",
                "value": "B07ZSWTBN3"
            },
            {
                "name": "Country of Origin",
                "value": "Myanmar"
            },
            {
                "name": "Item model number",
                "value": "92457-1694"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 5,301 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#65,560 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #136 in Carry-On Luggage"
            },
            {
                "name": "Capacity",
                "value": "7 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Color Assortment From the bright and stylish design to the accent pops of color, you will never have to worry about keeping track of these eye-catchers! Teal Purple/Pink Black/Grey Pink American Tourister 4 Kix The 4 Kix lightweight carry on spinner suitcase is weighs in at just 7 pounds, and is easy to pack. The large interior compartment and exterior packing pockets offer plenty of room for everything you need for a 2-3 day adventure. Meeting most airline requirements for carry on sizing, the 4 Kix carry on spinner suitcase makes travel a breeze with its ease of mobility and compact yet roomy style. 21\" Spinner: Packing Dimensions: 20.25\" x 14.0\" x 8.0\", Overall Dimensions: 23.0\" x 14.2\" x 11.0\", Weight: 7.1 lbs. 25\" Spinner: Packing Dimensions: 24.25\" x 17.0\" x 9.5\", Overall Dimensions: 27.5\" x 17.5\" x 12.4\", Weight: 7.9 lbs. 28\" Spinner Packing Dimensions: 28.25\" x 19.0\" x 10.5\", Overall Dimensions: 31.5\" x 19.5\" x 13.2\", Weight: 9.5 lbs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/41ff109b-3c3f-4cc9-8b51-6b96672ae637.__CR375,0,2250,3000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/58faff7f-33d2-478b-b8d3-d5e03249a6a7.__CR0,1145,3000,1500_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Functional and Thoughtful Design Push-Button Handle Wider pull handle combine to provide an exceptionally comfortable grip. Integrated, multi-stage aluminum pull handle for extra lightness. Retracting top and side carry-handles remain protected when checking baggage. Expansion on All Sizes Cases expand for added packing capacity. Large front panel interior pocket for added packing organization. Deep main compartment with mesh modesty pocket for personal items. Compression straps keep clothing neatly packed while traveling. 360 Spinner Wheels This lightweight line offers heavyweight protection riding on effortless 360 degree Spinner Wheels. All you need to do is push your case along and the wheels do the rest. Whether you are checking into to the flight or your hotel, it is super-easy with spinner wheels.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/6f203f6b-90ca-489f-a420-d1549a549326.__CR0,0,1500,1500_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1d4c5bdc-31fd-45e0-b11e-5287a4fa3bd6._SL300__.JPG",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e2f3bc68-263d-4d02-9fa3-bb0c43fd222a._SL300__.JPG"
                ]
            },
            {
                "media_text": "About American Tourister At American Tourister, we believe travel should be fun. We take pride in making stylish, high quality, and yeah, fun luggage that you can rely on. Now, over 75 years later, American Tourister is positioned as one of the largest luggage brands in the world. Thanks to its continued tradition of quality and design at a great value, American Tourister is the smart choice for you and your family, offering a wide selection of travel products including luggage items as well as casual, and business bags. We understand how you travel, so we're ready to go when you are with the gear that's right for you.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1b883f86-6d27-4148-8f41-a9b42204c142.__CR0,0,3000,3000_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/41ff109b-3c3f-4cc9-8b51-6b96672ae637.__CR375,0,2250,3000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/58faff7f-33d2-478b-b8d3-d5e03249a6a7.__CR0,1145,3000,1500_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6f203f6b-90ca-489f-a420-d1549a549326.__CR0,0,1500,1500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1d4c5bdc-31fd-45e0-b11e-5287a4fa3bd6._SL300__.JPG",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e2f3bc68-263d-4d02-9fa3-bb0c43fd222a._SL300__.JPG",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1b883f86-6d27-4148-8f41-a9b42204c142.__CR0,0,3000,3000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f7bf5b29-da6f-48ae-8e53-560b6a7a7fde.__CR530,0,1940,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG55NWNLIHDPZQ55R7TB7KSARNDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQH285ZZZIBR6?ASIN=B07ZSWTBN3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect size for short trip.",
                "reviewText": "I needed a smaller bag for shorter trips that I could put in the overhead compartment by myself. This is PERFECT. Here's what other people have complained about, and my responses: (1) No spinner wheels. OK, if you want a spinner, get one. It's clear from the photos this has two slightly-internal wheels at the back to pull along behind you. The little blocks at the front allow this bag to sit upright without tipping, and the slightly-internal wheels pull along behind me in the airport or the narrow airplane aisle perfectly. Spinner wheels stick out, and get stuck as I try to lift into overhead (I am elderly and not strong). Also, pulling along behind is easier for me. It's incredibly light weight, and even I can put it into the overhead easily. (2) People complain it doesn't fit under some airlines' seats. Clearly, even if it did fit under the seat on some planes, it would fill that area completely. Get a smaller bag to go under seat! (3) People don't like the handles. But many bags this size only have one handle to pull it back out of the overhead. Having the two longer handles that attach to both back and front of the bag gives that combined-handle more control, plus the longer handles makes it easier to grab if the bag shifts to the back of the overhead. Perfect. (4) People have noted it's NOT expandable. Yup, that's right. Bad description. (5) People don't like that the opening flap doesn't like to stay open. I agree, it doesn't. But I just push something against it to make it stay open, or put the bag next to a wall so I can tuck that flap between bag and wall. The reason it doesn't like to stay open is that the zipper opening comes down over the top of the bag, making the opening LARGER. That's of great help. So, big deal, prop something so it stays open, and you get a VERY large opening to put things in and get things out of. A plus. OTHER THINGS TO LIKE about this bag: Besides being light weight, easy for someone like me to get in/out of overhead, and perfect size for shorter trips, the teal color is beautiful and differentiates it from all the other black bags without being too bright. I love the X-style garment straps inside to keep contents from shifting. Other bags this smaller size don't have any straps inside. I like the large extra pocket on the outside - I can fit a light sweater or paperwork in there. (Advice - that pocket is a good size for a computer but I don't recommend that - I put my computer in my much-smaller bag for under the seat because the overhead compartment gets very hot and that's not good for computers.) The fabric is very good quality and this looks like it's going to last. Other bags are more like thin-fabric duffle bags, but this is sturdy fabric. Also, the bottom holds it's shape and won't drag on the floor like the wheeled duffle-bag ones can. Overall - I have tried and looked at many other bags for this shorter-trip purpose, and this one is great! Highly recommend.",
                "reviewVotes": "43 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bobblefrog",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETRYRNGGZCQ4MM7QMLKBYNWPCPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S1J102JJZ3DV?ASIN=B07ZSWTBN3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2018",
                "reviewTitle": "5.0 out of 5 stars Happy happy joy joy",
                "reviewText": "Edit:1st trip accomplished - worked like a gem on Frontier. Just don't overstuff (you can and then it would be too wide). Sticks out from under seat, but I appreciated that so I could prop my feet up. No issue with handle. Packed so the few things I might want access to were in the rounded/top/zippers meet area and could just lean down and get to those things. Didn't have the tendency fall over like these sometimes do. No issues with zippers . Only thing that I felt a little cranky with is the uselessness of the top zipper mesh - the backing is so thin it provides no support between that and what is in the outside pocket....and because it's the full length it's not really useful...just feels like it would quickly tear with any use and bulge awkwardly. Maybe it can be hacked....also I found I missed having one more small pocket, surprisingly. But still, five stars. Amazed at what I could pack in it.I've been using a backpack for flying budget airlines - this one at https://www.amazon.com/gp/product/B074FWDQWW/ref=oh_aui_detailpage_o01_s01?ie=UTF8&psc=1, and while I've been mostly happy with it for Allegiant, it is really tough to squeeze much in and the backpack straps make it messy under the seat - bits hanging out into the aisle, etc.Since I had an upcoming flight with Frontier I splurged and got this American Tourister Underseater - and wow, doing the happy dance, there is so much more room but it meets the size requirements! Pretty color (teal), appears sturdy, and was a good price. Unfortunately, while it would make the 7\" depth for Allegiant and within the 15\" width - it's about half an inch–to an inch with the carry handles–to meet their requirements. If you had an overzealous gate agent you could get tapped for some of those expensive last minute carry on fees that negates the cheap ticket cost.Was also so excited to find that my 13\" airbook fits easily within the front pocket with room to spare - no more opening my whole backpack to pull that out for security. It will fit that, my 3-1-1 bag and other things I want to have access to on the plane - a wrap, snacks, wallet purse, etc. I did not have any issues with the zipper on mine, and while the rolling handle seems somewhat shaky, it opens and closes easily, is long enough for 5'6 height to roll and I'm hoping with care will last. There's supposed to be a limited 10 year warranty - we'll see.Nothing super exciting about the inside - a flimsy'sh mesh pocket the length of the flap, lined with a fun retro design, and compression straps. Between the front pocket back and that mesh lining is only thin cloth. So no structure between whatever you keep in that front bit and the mesh - that's probably the one drawback - especially if you want to keep a laptop and electronic bits - if that makes any sense? On the back is a simple trolley strapI'll come back and edit if it breaks in the future - I have two trips planned, and I may actually use it as a carry-on for my second trip where I get that and personal item free rather than my normal set. Right now it sure seems spacious after cramming my essentials into the backpack!",
                "reviewVotes": "52 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVLZFZ5OEVJ243VMKR6GFPJME3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T4B7706S2XFC?ASIN=B07ZSWTBN3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect Personal Item Bag for Flying!",
                "reviewText": "I got this bag because I fly Frontier and Allegiant a lot and didn't want to pay their charges for a carry on. This bag is perfect! It fits the specifications for a personal item and fits in Frontiers sizer! Don't over pack it though because it is an exact fit. I didn't use the front pocket for anything thick because it adds too much dimension and won't fit in their sizer. It's handle expands easily and is a great height. It's easy to roll, legs support it so it doesn't tip over. I really like the big open packing area. I got compression bags for my clothes and can fit so many shirts and pants into this bag! I have flown 4 times with it now and even with my hands being compromised with arthritis, I was still able to pull it through the airports. I rolled it under the seat in front of me. On Frontier, it does stick out a little and I didn't have much room for my feet. I got the teal color and it's pretty. Very sturdy bag, strong zippers. I love this bag!!",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Larry from TampaLarry from Tampa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMJFVFM3JDVU3URYMCNDAMMR7XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNY4I93O4ACFL?ASIN=B07ZSWTBN3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "4.0 out of 5 stars Good but Not Great",
                "reviewText": "Nice compact design, sturdy construction. It's a little taller than I would like, you can see from the photos that it sticks out from under the seat in front. Note that it sticks out further than my wife's under seat bag (the dark purple one on the right side. When in your plane's seat, it is awkward to find and pull items out of the bag when you are seated. On our recent Southwest Airlines flight (a Boeing 737-800 plane) it was too wide to fit under an aisle seat.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71kmNPmRNuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71lULw2C60L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 16, 2023",
                "reviewTitle": "Great space saver",
                "reviewText": "Small but mighty! Will carry lots. Excited to use!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis Garcia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 9, 2023",
                "reviewTitle": "Se ve un poco más grande que carry on",
                "reviewText": "Se ve muy bien solo que si efectivamente mide más de 55 cm de altura espero no tener problemas por el equipaje grande de mano",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Viridiana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 9, 2023",
                "reviewTitle": "Vale cada centavo",
                "reviewText": "La use en mi ultimo viaje, es muy practica y comoda puedes moverte por todo el aeropuerto, sin terminar con hombros lastimados por cargar una mochila de mas de 5 kilos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ezzio frozzini",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 3, 2020",
                "reviewTitle": "Very light",
                "reviewText": "I received on time,is the one I looking for,good space,very light,strong,good price.I like.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abigail David",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 19, 2023",
                "reviewTitle": "Good, but a bit flimsy wheels",
                "reviewText": "This was a good size luggage for weekend trips. Good quality and hoping it will last like my other American Tourister luggages. My only problem with this one is it is a bit challenging to push along and control on all four wheels. May have been ideal to have better wheels.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}