{
    "remaining_requests": 12802,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Travelers-Choice-Travel-Amsterdam-Luggage/dp/B003O271GM",
    "body": {
        "name": "Travel Select Amsterdam Expandable Rolling Upright Luggage, Burgundy, 2-Piece Set",
        "price": "$109.99$35.68",
        "originalPrice": "",
        "rawPrice": 109.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Travelers-Choice-Travel-Amsterdam-Luggage/dp/B003O271GM",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C97H5WGL"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/414rh+vZsNL._SS36_.jpg"
            },
            {
                "asin": "B003O271GM",
                "variationName": "Color",
                "variationValue": "Burgundy",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41XqYpKA5ZL._SS36_.jpg"
            },
            {
                "asin": "B003O2F0JW",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41GU2wdrhVL._SS36_.jpg"
            },
            {
                "asin": "B003O2B2CG",
                "variationName": "Color",
                "variationValue": "Navy",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41bnHQEgT+L._SS36_.jpg"
            },
            {
                "asin": "B003U8KAHM",
                "variationName": "Color",
                "variationValue": "Orange",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51zH-WF15TL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51iNAkZUIWL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51seJ6pSHJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31jUCskC9vL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51u7BJYx1BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51T0VMNoOWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51He2OflFlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Jeg2P4p9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91PM9Kl6wHL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c570e7e8-0583-4284-855f-123d54eb94e4/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ca6a3cf1-0c88-4f1b-bab3-01ecf4e78641/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/29f9a3f3-ce97-49ec-9c07-844c45b59411/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c676465-2ba2-4d95-99ce-25421c4ddc75/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ae624fcd-175f-4553-a2ea-9bb61bfce24f/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/67ec6f2a-d027-45a8-8ff6-c973374699ae/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/61i3fIOY8hL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/61i3fIOY8hL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Travel Select Store",
            "link": "https://www.amazon.com/stores/USTraveler/page/7C2EBFD0-4076-49A6-AC49-69E1DA071624?ref_=ast_bln"
        },
        "brand": "USTraveler",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 20507,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 23 hrs 14 mins",
            "FREE delivery Thursday, February 22. Order within 23 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Introducing our top-of-the-line travel set that is built to last - made from durable 1200D 2-tone polyester with PVC backing, our carry-on upright is the epitome of luxury and durability.",
            "Experience effortless travel with our retractable push-button handle system and full imprinted lining, while the top & side carry handles and bottom grip handle provide multiple carrying options.",
            "With an expandability feature that increases packing capacity by 25%, you can bring all your essentials without worrying about space; The inline skate wheels with corner protectors ensure smooth and quiet rolling, making it the perfect travel companion.",
            "Inside the carry-on, you'll find a fully lined interior with large zipper pockets and compression straps that keep everything in place; The dimensions of our carry-on are 21\" h x 14\" w x 8\" d, and it’s easy to maneuver through airports and on the road.",
            "Don't settle for less when it comes to your travel needs - choose our luxurious and durable travel set that combines functionality and style for a seamless travel experience.",
            "The dimensions on this carry-on upright are: 21\" h x 14\" w x 8\" d (expands to 10in. d) and is 8 lbs"
        ],
        "description": "Travel in sturdy and affordable style with this Amsterdam 2-Piece Carry-On Expandable Rolling Luggage Set by Travel Select. It is made of superior two-tone polyester fabrication with PVC backing. It features inline skate wheels and an internal retractable push-button handle system for rolling ease and comfort. It has multiple front zippered pockets. It has an add-a-bag strap and clasp for toting an additional bag. Product Dimensions - Upright: 21” H x 13” W x 7.5” D (expands to 9.5in. D) 8 lbs. Tote: 15\"W x 11” H x 6” D; 1.80 lbs.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9479199011"
            },
            {
                "name": "Luggage",
                "link": "https://www.amazon.com/luggage-suitcase/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15743251"
            },
            {
                "name": "Luggage Sets",
                "link": "https://www.amazon.com/luggage-sets/b/ref=dp_bc_aui_C_4?ie=UTF8&node=15743291"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "15 x 9 x 21 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.8 Pounds"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Travelers Choice -- Dropship"
            },
            {
                "name": "ASIN",
                "value": "B003O271GM"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "TS6902R"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 20,507 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,312 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #15 in Luggage Sets"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Capacity",
                "value": "50 Pounds"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9aa440d4-ace2-4444-8841-057bec2bbf77.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f8f0014e-0803-4a83-b8de-ae03baea9b38.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a04b1b10-00e2-4883-a356-0c3ce9505604.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9ec34330-efa7-4e14-8464-ce5dd7272354.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1dae4d59-0833-428d-821a-470662a48ca1.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Afshan Tabassum Hussain",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQCJGS2TPEPTFVQ4MAKN3TH4J3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R376KVGKDLB6HY?ASIN=B003O271GM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2023",
                "reviewTitle": "5.0 out of 5 stars A reliable suitcase",
                "reviewText": "I recently purchased this suitcase for my last trip, and let me tell you, it exceeded all my expectations! This luggage is an absolute game-changer when it comes to convenience, durability, and organization during travel.First and foremost, the build quality is outstanding. The 1200D 2-tone polyester with PVC backing ensures that the luggage can withstand the rigors of travel without showing any signs of wear and tear. No matter how rough the handling, this luggage remained in pristine condition, which gives me the confidence that it will last for many more trips to come.The interior retractable handle with the push-button mechanism is a small yet highly appreciated feature. It makes maneuvering through crowded airports and busy streets a breeze. The handle locks firmly into place, providing a sturdy grip without any wobbling or instability.One of the standout features of this luggage is undoubtedly the inline skate wheels with corner protectors. These wheels glide effortlessly, even on uneven surfaces, allowing me to navigate through airports with minimal effort. The corner protectors have proven to be a lifesaver, preventing any scuffs or damage that could potentially occur during baggage handling.Inside, I found the full lined interior to be quite spacious, providing ample room for all my belongings. The large zipper pockets are perfect for organizing smaller items, while the compression straps keep everything secure and in place. No more rummaging through my suitcase to find things—I can easily access whatever I need with ease.As for the size, the 29” H x 17” W x 10” D (expanding to 12 in. D) measurements are spot-on. It's roomy enough to hold a week's worth of clothes and essentials, yet it still fits comfortably in overhead compartments on airplanes.In conclusion, the suitcase is an outstanding travel companion that I highly recommend to anyone in need of reliable and functional luggage. Its durability, easy handling, and well-designed interior make it worth every penny. I'm extremely pleased with this purchase, and I'm already looking forward to my next adventure with this fantastic piece of luggage by my side!",
                "reviewVotes": "88 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5ESTCGITMHXUZIDUIT355ZR5EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RXPYWS8931SJ?ASIN=B003O271GM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 25, 2022",
                "reviewTitle": "5.0 out of 5 stars My \"Go-to\" luggage",
                "reviewText": "I own this bag in red. I purchased it about six years ago and have average about 4 trips per year with it. I am currently shopping for its replacement.Let me explain the things I love about it. I bought this as part of a patched set and appreciate this in my search of the baggage carousel. The bag’s construction is sturdy and the contents are well protected. There are cubbies or pouches in the most protected corners for safe storage of breakables; they WORK. It is spacious enough to hold a week’s worth of hanging clothes and still have room for everything else I need on a weeklong trip (shoes, toiletries, small clothes, chargers/cables, etc.). The interior shows no wear after 6 years of use all internal parts work as well today as the day I bought it. The telescoping handle is sturdy enough to work well with this bag and a carry-on bag attached to it. It extends to a comfortable height and does a good job controlling the bag while rushing to make a flight. The wheels likewise are large enough to roll well, even in the under-construction airports & airport parking lots which seem to litter our continent. This handle telescoped completely and stores inside a zippered pocket. This garment bag came with handles, a should strap, and the telescoping handle.Here are the things I would change about this piece of luggage. The design is such that when it falls over, it always false face down on the only colorful part of the bag. It makes the luggage one more anonymous black bag on the airport carousel. This also puts the most textured and decorative portion of the bag the side baggage handlers use to slide the bag, which has resulted in much wear and actual tear to the “Nice” side of the bag. The first trip I used the bag the shoulder strap broke. Looking at it later, the swivel snap portion seemed to be formed from a lesser quality metal than the other pieces of the strap and this is what broke. In all fairness I believe this was a quality control error made by the subcontractor from whom they purchased the hardware and not a reflection on Travel Select’s design or manufacture.I have used this bag more than any other in the set. I use it for business travel and vacation travel. It is more worn than any other piece in the set, as is should be. The positives far outweigh the negatives, and it is my “Go-to” luggage. If I could, I would change a few things about this garment bag. They are making this bag for a variety of people with a variety of needs and travel styles, so I would not try to correct the balance issue with the bag falling on its “Face”. I would make the entire bag the same color on all sides, I would select a less textured clothe (while it looks great, it snags on everything in baggage handling), make the metal tubing of the collapsible handle one gauge thicker, and add a check of hardware quality before using it on the luggage. In my current search for a replacement, I may end up buying a new copy of what I already own.",
                "reviewVotes": "155 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doug, CT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELHWMUA3CAWKHUWR5EOKR4TQWNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FM9Q0N9T10JV?ASIN=B003O271GM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2022",
                "reviewTitle": "4.0 out of 5 stars Value product but is serving its purpose",
                "reviewText": "It is so hard to find a 2-wheel carry-on these days, with the rugged embedded wheels instead of those ridiculous flimsy spinning wheels that most bags have these days.This is the perfect design for what I was seeking. It has rugged wheels, to get down the sidewalk and cobblestones, and the wheels are inset so that you get the maximum amount of storage for the carry-on size. The color options are fun as well so you can find it in the sea of black cases. It expands nicely and has a nice useful layout of pockets. And, it is incredibly lightweight! And the price was very attractive.The only drawback is that it does not feel that it is going to hold up for very long. I've had this for about six months (traveled with it about a half dozen times). So far, it is fully in tact. The vinyl handles are tearing but they seem like they might be reinforced under the vinyl tear so they may hold up even if they look like they will fall off. The retractable handle seems flimsy but has not broken. Because it is so lightweight, the shape of the case isn't overly rigid and can get a little distorted if you are pushing it to capacity (it can feel a little like a duffle bag at times).Overall, I really like this bag but durability is a concern.",
                "reviewVotes": "41 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mimi ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 2, 2024",
                "reviewTitle": "Good",
                "reviewText": "Rapport qualité prix ça vaut le coup",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Myrna ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 29, 2023",
                "reviewTitle": "Roomy",
                "reviewText": "This a very roomy carry on and well made.So happy with it, I bought 2.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 12, 2023",
                "reviewTitle": "Amazing price",
                "reviewText": "Very light weight, the capacity is incredible, I bought it for a friend moving to another city, it held a blanket, 2 bath towels, small had towel, a bag of dog food, cutlery, couple of dishes, coffee mugs, couple of glasses, coffee maker and maybe few more things that I can’t rememberMaterial is good and even came with a lockVery well recommended",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monique",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 15, 2023",
                "reviewTitle": "This is what I was looking for the quality",
                "reviewText": "It’s got all pocket I needed and compartiments it’s very sturdy, love it I bought it as a present, and the person who received it was very please",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 6, 2023",
                "reviewTitle": "It is perfect",
                "reviewText": "It came in well packaged and perfect size!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}