{
    "remaining_requests": 12761,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Delsey-Luggage-Helium-Spinner-Trolley/dp/B008PSVUUI",
    "body": {
        "name": "DELSEY Paris Helium Aero Hardside Expandable Luggage with Spinner Wheels, Blue Cobalt, Carry-On 21 Inch",
        "price": "$118.31",
        "originalPrice": "$159.99",
        "rawPrice": 118.31,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Delsey-Luggage-Helium-Spinner-Trolley/dp/B008PSVUUI",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CCWX7VDB"
        ],
        "asinVariationValues": [
            {
                "asin": "B008PSVUUI",
                "variationName": "Color",
                "variationValue": "Blue Cobalt",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01ViGPxkAkL._SS36_.jpg"
            },
            {
                "asin": "B008PSVTY0",
                "variationName": "Color",
                "variationValue": "Brick Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01SVWFhmjCL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Brushed  Charcoal",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/4169IMYddaL._SS36_.jpg"
            },
            {
                "asin": "B073XTNHSL",
                "variationName": "Color",
                "variationValue": "Peony Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51RK0rc3VfL._SS36_.jpg"
            },
            {
                "asin": "B008PSVVY8",
                "variationName": "Color",
                "variationValue": "Titanium",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21NCDyTqnFL._SS36_.jpg"
            },
            {
                "asin": "B084BNS8WX",
                "variationName": "Color",
                "variationValue": "Brushed Charcoal",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31yBbcPuMyL._SS36_.jpg"
            },
            {
                "asin": "B00OZW6IIW",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01peEbe1zcL._SS36_.jpg"
            },
            {
                "asin": "B0CNFTXQQW",
                "variationName": "Color",
                "variationValue": "Nardo Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/319qc2F1lyL._SS36_.jpg"
            },
            {
                "asin": "B01MQQWAW2",
                "variationName": "Color",
                "variationValue": "Teal",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/018LhP4IB8L._SS36_.jpg"
            },
            {
                "asin": "B07STG6TSS",
                "variationName": "Color",
                "variationValue": "Blue Textured",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/11dKbZ0nAjL._SS36_.jpg"
            },
            {
                "asin": "B0CFPLQRF2",
                "variationName": "Color",
                "variationValue": "Latte",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31UTQlq3KSL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "40",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/410vziZ5HGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41RA5ett-bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rjLRNSsiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415KgSWGxvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/314S4rPKOLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51n6phMjr0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Fvmmzj2mL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/06a4a9ef-65ba-42f1-ad64-71ec26eea529/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/50d13cfc-edeb-4a3e-9838-1075823d0a46/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9762457b-cb6e-4c17-a012-23c0d134a051/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6dc1700f-ed7d-423e-9393-f495bdd6688d/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd92a872-bf38-4140-a1c1-67c1d3db70ae/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ccd02d6c-7896-47c0-bd90-5382dd512b2f/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71TJEp5WrkL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71TJEp5WrkL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the DELSEY PARIS Store",
            "link": "https://www.amazon.com/stores/DelseyParisLuggage/page/50B586EC-8B84-4A5F-ABFE-7F9A2E027D67?ref_=ast_bln"
        },
        "brand": "DelseyParisLuggage",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 7396,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22. Order within 23 hrs 7 mins",
            "FREE delivery Thursday, February 22. Order within 23 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Lightweight and Durable: Made of 100% Polycarbonate, which is a material that is extremely resilient to cracking or breaking, with a deep metallic finish",
            "Superior Maneuverability: The double spinner wheels assure exceptional maneuverability and keep ZERO weight on your arm.",
            "Largest Capacity: This suitcase expands up to 2 inches for additional packing space. This feature is great for packing sovenirs on return journeys.",
            "Maximum Comfort: This carry on bag has a comfortable handle system that locks into two positions for ease of use.",
            "Convenient and Secure Packing: Two large fully-lined compartments with multiple pockets allow easy access and organization for all of your items. Web straps and a zippered divider secure clothing and help minimize wrinkles, Fully lined interior with two compartments for packing and organizing clothes and travel accessories",
            "100% polycarbonate with glossy finish which makes the case extremely lightweight,Integrated 3-dial tsa-accepted combination lock"
        ],
        "description": "Secure & stylish Helium Aero collection makes your next adventure as safe as possible. This collection features two full packing compartments and is created with 100% polycarbonate material. The TSA-accepted lock provides maximum security and allows only TSA agents to access your belongings during travel. Established in 1946, Delsey has used its flair to marry tradition with innovation, elegance with modernity and design with practicality. We design tomorrow's luggage with inspiration from many places: travelers and their journeys, societal changes and the evolving environment. As a result our luggage keeps getting lighter, better fitted and more environmentally friendly. Enabling our customers to travel elegantly and limiting any negative impact on the environment is our raison d’être.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b?ie=UTF8&node=9479199011"
            },
            {
                "name": "Luggage",
                "link": "https://www.amazon.com/luggage-suitcase/b?ie=UTF8&node=15743251"
            },
            {
                "name": "Carry-Ons",
                "link": "https://www.amazon.com/Carry-On-Luggage/b?ie=UTF8&node=15743261"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "21 x 14.5 x 10 inches"
            },
            {
                "name": "Item Weight",
                "value": "6.82 pounds"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Delsey Luggage, Inc."
            },
            {
                "name": "ASIN",
                "value": "B008PSVUUI"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "07644BD"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 7,396 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,069 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #19 in Carry-On Luggage"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Capacity",
                "value": "23 Liters"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Lightweight and Durable Aero combines style, quality and convenience in an eye-catching design for travelers to look sharp during their trip. Double Spinner Wheels Double spinner wheels assure smooth and multi-directional mobility that keeps weight off your arm. Deluxe Interior Two full packing compartments with lined divider to minimize shifting of contents. Scratch Resistant & Safe Scratch-resistant, twill texture with deep metallic finish for style. Integrated 3-dial TSA accepted combination lock for security.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fc75d519-9514-4eca-b19d-a27de72538a8.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76309f08-f95c-407b-bdaa-6c6af915d2af.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/271f3ca7-22a1-4571-95d7-2e983e7e0a17.__CR0,0,2000,2000_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fadcf5f6-27a4-4b35-b5ec-9071b9ec6219.__CR0,0,2000,2000_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45ff1ddd-5f08-48bd-94a4-ad24aa68f262.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fc75d519-9514-4eca-b19d-a27de72538a8.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76309f08-f95c-407b-bdaa-6c6af915d2af.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/271f3ca7-22a1-4571-95d7-2e983e7e0a17.__CR0,0,2000,2000_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fadcf5f6-27a4-4b35-b5ec-9071b9ec6219.__CR0,0,2000,2000_PT0_SX220_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alastair KnowlesAlastair Knowles",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIYNWSYJKSUWJ226APFIMEEIJJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27BCENCIQ3MD0?ASIN=B008PSVUUI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 18, 2019",
                "reviewTitle": "5.0 out of 5 stars Slick, durable, thoughtfully designed...",
                "reviewText": "The last time I bought a new roll-aboard it was at least a decade ago (maybe longer); it was a CalPak, and served me extremely well (someone inherited it, some nominal wear-and-tear but was still 100% functional and looked pretty good for a 10+yr old bag). I bought this because I needed something with a compartment that was better suited for folded items that tend to wrinkle (like dress shirts and blazers). Since my last bag served me 10+yrs (during some of those years I traveled once a month, and on slower years I traveled at least 4 times a year), I wanted my next bag to serve me a decade also - so I did a ton of research. I hope this helps others save time on researching.Critical Criteria in my decision making: - (1) it had to fit practically all overhead bins (I refuse to check my bags); - (2) it had to be durable and covered by a solid manufacturer's warranty (minimum of 10yrs - from a manufacturer that's known for solid customer service) - it also needed to be extremely resistant to the elements, incase it was ever gate checked (I live in a place where it snows a ton, and travel to places where it's not unusual for it to rain a ton); - (3) there needed to be a way to divide clean items from dirty items, built in; - (4) the wheels had to be GREAT - whether it was 4 or 2, was not as important as them rolling smoothly and lasting the life (10yrs) of the bag; - (5) there needed to be a built in compartment (main or otherwise) that handles items that wrinkle easily, well (i.e., not have those two vertical ridges for the handle/wheels, protruding into the interior of the compartment - this was the only issue with my last bag, and seems to be an issue with every bag that doesn't have a clamshell design...I understand why they have to be there, so I can't really fault the manufacturer for having them...if they were to make that compartment 'flat', it'd chew up valuable space. There are relatively easy solutions to solving this issue, like filling that space as best as possible with shocks, underwear, t-shirts, etc. until you create a flat foundation for your more wrinkle-prone items...or living the packing cube life (something that I'm tempted by). - (6) aesthetics (if I'm going to own anything for 10yrs, it needs to look nice and be something that should age well); - (7) relatively spacious (I don't want to own one roll-aboard bag for 2 day biz-trips, and one for 10 day vacations); - (8) bonus, something with additional compartments/pockets to separate items that need to be accessed quickly from clothes.Verdict on this bag: a solid 9/10 (this is after 1 trip mind you - if anything changes about my verdict in the future I'll update this) Grade on each criteria below: - (1) GRADE: A- this thing is COMPACT, I was surprised to see how much I could fit in it, and do imagine that it'll fit practically any overhead bin. I flew a number of different aircraft on my most recent trip, and it EASILY fit everything from a CRJ900 (G7)'s overhead bin up. This did NOT fit in a CRJ200's overhead bin, but I don't think any hard-sided roll-aboard (or any practically sized roll-aboard) will. Even though some have said a roll-aboard will fit in the overhead bins, I imagine that only duffle bags, or underseat-sized roll-aboards could fit in those bins (so I can't really ding my grade of this roll-aboard given that...I imagine the vast majority of flights I'll take in the future will allow this to fit overhead easily). In addition, there are policies that require roll-aboards to be gate checked on these CRJ200 aircraft due to weight sensitivity issues of the aircraft - below is an explanation from a pilot, pulled from a travel message board:- \"As a CRJ200 pilot, I can tell you a 22” bag will fit. However, the CRJ200 is very sensitive when it comes to weight and balance. Due to the nose being heavy, all roller bags have to be gate checked and added to the cargo bin in the back to help balance the plane. So, just get the size you need and gate check your carry-on. You’ll be fine without it since CRJs are usually used for short flight, ranging from 20 minutes to 2 hours max.\" - (2) GRADE: A I bought a soft-sided delsey roll-aboard for a close friend 10yrs ago, who is a legit road-warrior (travels 3+ days a week, and might have actually been traveling more than that back then). He LOVED the bag, and it lasted him a long time (he may still have it). Delsey has one of the best warranties in the biz., and I know that their products have lasted others a long time in the past. From my experience thus far, the build quality seems to be top notch. Everything feels and sounds tight, the handles (which is one way I gauge the quality of a bag) all feel exceptionally well engineered - and the telescopic handle has two different settings, and feels extremely sturdy at both settings. The zippers, interior and exterior - all feel solid, and the material is the best for hard-sided luggage currently in use (Polycarbonate - I wouldn't advise any other hard-sided material...others are more likely to crack if flexed too much). Hard-sided luggage does scuff/scratch easier than soft-sided, something you kinda have to compromise on if you want the added internal protection of a hard-sided bag. This thing did have to get gate-checked twice (two CRJ200's) during my trip, and it did get a little scratched on the bottom where handlers would've have slide it in and out of carts...VERY difficult to see though. Hard-sided bags (like this one) are also easier to clean than soft-sided bags, which can be really important if you're traveling to and from places where baggage carts might get dirtier (places with snow, for example). - (3) GRADE: A+ The clamshell design of this bag, along with it's tie-downs and zippered internal dividers does a great job of allowing me to separate items that are clean from those that aren't. This means I don't need an extra bag(s) for doing so. - (4) GRADE: A The wheels are excellent, only complaint I have (which is really a result of the 'type' of bag, and not this specific bag) is that when rolling onto and off of moving walkways, the bag tips if it is being pushed on all 4 wheels at high-speed...I imagine any 4 wheeled bag would experience the same issue, so I can't really take points off for that. Also like the dual wheels (so 8 technically), should help limit their wear, and ensure that as they wear they do so 'evenly'. - (5) GRADE: A The side of the clamshell that the telescopic handle isn't attached to, did a great job of keeping dress-shirts as wrinkle free as possible - the hard-sided luggage also does a better job of ensuring this result. The tie downs in this bag are also great at keeping items from moving during transport (durable and thoughtfully designed). - (6) GRADE: A+ This thing looks sharp. I also feel that the relatively simplistic and muted design will remain attractive for the life of the bag. The things that make this 'look' better than the competition - IMO - are: (a) it has a sheen without being shiney, so it doesn't have the muted appearance of a cheap plastic beach cooler, or the obnoxious shininess of a hefty garbage bag; (b) the accents on the handles, zippers, wheels, and logo are classy without being gaudy; (c) the color I went with was the 'brick', which ranges in appearance from brick to copper depending on lighting...I like this better than the more traditional colors most manufacturers offer AND, it's colorful without being 'loud'; and (d) the surface is smooth, which I personally like the look of versus a more 'textured' surface. - (7) Grade: A The capacity of this thing is darn impressive for a bag this size. Hard-sided luggage will always have slightly less capacity than similar sized soft-sided luggage (again, sacrifice for the protection), even with that factored in, this thing holds a ton. I almost never overpack, and when I do it's by a very narrow margin. For this trip, I wanted to put the bag through its paces and see what all could fit in it 'comfortably'. Below is what was packed, without the bag feeling like any of its zippers were being stressed (for reference as far as the size of the clothing items: I'm a 6'1\" 175lb male, that wears a medium in all clothing items/38R in suits/jackets, and size 10 shoes): - 5 pairs of briefs - 2 pairs of ankle socks - 3 pairs of dress socks - 1 pair of size 10 tennis shoes (relatively pliable) - 1 pair of size 10 dress shoes (not that pliable) - Toiletries (I pack relatively light in this area) - Beard trimmer with charger (average sized) - 2 pairs of exercise shorts (I always pack board-shorts/swim trunks, because they can be cleaned and dry overnight if needed) - 2 t-shirts - 2 long sleeve henley's - 1 pair of jeans - 2 dress shirts - 1 13\" macbook pro w/charger (2015, newer model would fit easier) - IN THE FRONT POCKET (a nice added feature) - 1 lightweight jacket with hood (think windbreaker thickness) - 1 small tech-accessory case (holds two small battery packs and two usb chords) - 1 small notebook (size of a shortish paperback) - 1 kindle in its caseThis was all WITHOUT expanding this bag, which is one of the nice features it has. As someone who is a very light packer, I am confident that I could do 2 weeks anywhere with this bag alone. I moved my tech items and light jacket to my 'personal item' (messenger bag) for this particular trip, but could've definitely fit everything outlined above in the roll-aboard alone. The only thing that would be a problem for a longer trip (and this is the case with any roll-aboard bag) is fitting my water bottle (don't know if many/any roll-aboards have sleeves/carabener hoops for water bottles...that aren't hideous). (8) GRADE: A+ the additional front compartment is a nice touch...it DOES get tighter as the interior is filled because it's technically the same compartment, separated via a heavy duty divider (I like this though, because it allows you to choose if you want to put more in the main compartment, or split it between the two). The included TSA approved lock is another nice 'extra' incase gate-checking happens.",
                "reviewVotes": "477 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71iiUUnjh+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71kt+D92D8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81Ciuz-8s-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81NyguL52uL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81PyGcXjfhL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81groRFl54L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81spewPIYRL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Phillips",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCKDG2QDQLPISR2X7WQ754TYI3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ID1CTI1PPUSV?ASIN=B008PSVUUI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars The perfect suitcase for the world traveler",
                "reviewText": "I have several pieces of Delsey suitcases and I purchased this color for my wife. The cases are extremely light when empty and extremely durable. We travel several times a year and often fly. These suitcases can take a beating and hold up to the rigors of hard travel. The telescoping handle has a great height and easy to retract or extend. The wheels are smooth gliding and shift easily from two to four wheels and back again. The interior features an area that can be divided to protect clothes from shoes or other items and has a snap strap to hold clothing in place.Delsey is a brand worth owning and continues to provide excellent cases for the world traveler.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lauren Baker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5JEFURKEWVV275EALWALKYGUUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Q8CO790RAW6J?ASIN=B008PSVUUI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2017",
                "reviewTitle": "5.0 out of 5 stars Best quality by far for your money",
                "reviewText": "I frequently travel for work, 1-3 nights at a time, and have been looking for a carry-on to meet all my needs. I am small (5'1\") and needed a carry-on that was easy to wheel, luggage that essentially \"propelled\" itself, rather than me pushing or pulling on it. The ease of mobility was my #1 priority in choosing luggage. It is an ease to wheel around all surfaces, pushing on all 4s or pulling on 2 wheels behind you. All the reviews I read on this model, on Amazon, and several published reviews (Business Insider, Glamour, Forbes, etc) rated the wheels as excellent. Delsey seems to have a reputation as quality luggage at a great price. Below is a full review of features:- Mobility: top-rated. no matter how much I pack into this bag, it wheels itself everywhere. The next tier up in wheel-functionality would be 3-4x this price.- Space: when I first opened it, I was surprised and a little disappointed at how small it was. However, I have been able to pack 3 days worth of clothes, toiletries, 2-3 pairs of shoes and a curling iron. Again, I am small, so my clothes and shoes are small. If you are 5'10\" + you will fit much less, especially shoes. For taller people, this is best used as a single night trip, or to carry business items.- Size: I haven't taken this on an international flight, but I've taken it on all size jets domestically. It fits fine in the overhead, and on the smaller planes needs to be tagged upon boarding (as any carry-on of this size would).- Accessibility: I love the front zip compartment. I had been carrying a hard-case single zipper carry-on, with my laptop and work items in a shoulder bag. The front zip compartment allows me to put my laptop, chargers, and other various items in an easy-access area, keeping my shoulder bag much lighter.- Handle: The handle does have a little bit of give. Several reviews say it is \"loose\" or not as sturdy as they'd like. While that is true, I believe this was designed to maximize space inside, by not building in hard walls around the handle. I've jam-packed this, and the handle has held up. While I can feel what people are referring to, I didn't feel like the handle was going to break at all.- Looks: I read a few reviews saying this showed dust easily, and wasn't quite sure what that meant. Let me clarify, the material is slick and shiny and shows lint, hair, dust very easily - think static cling. While this is somewhat annoying, for the functionality and ease of use at this price, it's not enough for me to take away a star.For all the research I did, I am more than happy with this carry-on. I purchased this to try out the Delsey Helium Aero series, and will be purchasing the entire set.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beembar51",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4BYBNZT7OPMYDYLD5VXLHSDDCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31QQXWUC90VS9?ASIN=B008PSVUUI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Very good with a couple of caveats",
                "reviewText": "This is a very good carryon. It’s lightweight and looks good. Had no problems packing for a week away. And the case itself seems to be very sturdy. The issues are relatively minor, but could be important for some. First, it scuffs easily. After one flight there were scrapes and scuffs marring the finish. Baggage handlers are not known for their delicate ways. Not a big deal. The other issue is the handle. When fully extended it feels very flimsy. I’m hoping it doesn’t break. I have a trip to Europe coming up in April. I hope the handle, wheels and the case hold up to being dragged through cobblestone streets for three weeks.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marion beckett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 20, 2023",
                "reviewTitle": "Beautiful Christmas gift for a travelling daughter",
                "reviewText": "Top marks for both style and quality. Just beautiful. Feels like they should cost twice as much. There’s a lot to choose from with luggage and the Delsey brand really hits the mark.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jimena P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 12, 2023",
                "reviewTitle": "Excelente maleta de viaje",
                "reviewText": "Muy practica, le cabe muchísima ropa. El compartimento de computadora no evita que podamos llevar más cosas. Excelente opción.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "F.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 4, 2023",
                "reviewTitle": "Quality carryon",
                "reviewText": "Bigger than what I wanted, may be larger than carryon allowance on some international flights. Dimensions are:21x 13 x 9 inches3.5kg",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WOLFBLACK",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 9, 2023",
                "reviewTitle": "Excelente marca y producto",
                "reviewText": "Claro que me encantó, excelente maleta, práctica para viajar ligero,excelente producto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carlos carreon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 24, 2023",
                "reviewTitle": "Muy bonito color, diseño y tamaño",
                "reviewText": "Muy recomendable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$148.99",
                "sellerName": "PORTMANTOS",
                "sellerRating": "4.5"
            }
        ]
    }
}