{
    "remaining_requests": 40320,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pixicade-Transform-Creative-Drawings-Animated/dp/B0CRC1M2ZB",
    "body": {
        "name": "Pixicade: Transform Creative Drawings to Animated Playable Kids Games On Your Mobile Device - Build Your Own Video Game - Gifts for 10 Year Old Girl, Boys - Award Winning STEM Toys for Ages 6 - 12+",
        "price": "$29.99",
        "originalPrice": "",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pixicade-Transform-Creative-Drawings-Animated/dp/B0CRC1M2ZB",
        "soldBy": {
            "sellerID": "A1KVRN77SYLHA7",
            "name": "BitOGenius Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1KVRN77SYLHA7&asin=B0CRC1M2ZB&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B098BKY9S9"
        ],
        "asinVariationValues": [
            {
                "asin": "B08QDPR545",
                "variationName": "Edition",
                "variationValue": "Pixicade",
                "price": "$20.91",
                "variationImageURL": ""
            },
            {
                "asin": "B0CRC1M2ZB",
                "variationName": "Edition",
                "variationValue": "Pixicade Unlimited",
                "price": "$29.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51JUZZU3F3L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41mCBQehECL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MG1h46RqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vEHtI8XWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51CXefioSOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61JZge52iYS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4156LmxD6qL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Pixicade Store",
            "link": "https://www.amazon.com/stores/Pixicade/page/9A714D42-826D-41DD-95DB-8FAF9D89C27C?ref_=ast_bln"
        },
        "brand": "Pixicade",
        "merchantInfo": "BitOGenius Inc",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2400,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 5 hrs 37 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🍎 #1 FUN LEARNING TOY TURNS DRAWINGS INTO VIDEO GAMES— Kids and teens use colored markers and paper to turn hand drawings into instantly playable video games! Pixicade is an activity that provides kids with positive screen time, the only limitation on Pixicade is your imagination!",
            "🍎 BEST GIFT IDEA FOR KIDS AND TEENS— If you are looking for a favorite gift for boys and girls ages 6, 7, 8, 9, 10+, then you have found the ultimate toy for birthday parties, Christmas, and reward incentives! It includes 5 washable markers, one sketch pad, and two interactive books that teach kids game design concepts, and provide a lot examples to keep kids drawing! Create Unlimited Games with 7 game types!",
            "🍎 SURPRISINGLY SIMPLE AND EASY-TO-USE! Simply draw your game on paper, snap a pic of it, and then play an animated version on your phone or tablet! Create your own character, build obstacles for them to overcome, and design the goal for how to win the game! This is a game you will feel good having your kids play for hours at a time",
            "🍎 EDUCATIONAL STEM GAME FOR HOME & CLASSROOM! Make your teaching moments more fun and memorable using art, engineering, story, creativity, and playing video games! For example, you could have your child make a game based on their favorite book. Or create a math game based on what they are currently learning in math. Interactive learning is far more effective than any other teaching method! Education should be fun!"
        ],
        "description": "Fun for the Whole Family! There is Nothing More Rewarding than Watching Your Kids Unlock Their Own Potential While Learning and Having Fun When your child sits down with the Pixicade, you will see their creativity flowing as they create and play their own uniquely made game. Kids and Parents have a blast creating custom avatars or characters that are on a mission to obtain their objective. This Easy-To-Use Toy will turn Family Game Night into a success! The only challenging part as a parent is not spending too much time with it yourself! Reinforces Good Habits of Problem Solving. Quality Family Time Testing and Conquering Each Others Games. Enough Fun for ALL Ages!",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "8.75 x 11.75 x 2 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.51 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CRC1M2ZB"
            },
            {
                "name": "Manufacturer recommended age",
                "value": "6 years and up"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,400 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Manufacturer",
                "value": "BitOGenius Inc"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Magical Creation of the Pixicade The story of Pixicade begins with a technical computer programmer (Martin) falling in love with a dynamic high school art teacher (Alysha). They got married, had children, and enjoyed dancing their way through life and programming games together. Then on one very special day, Martin had dinner with a friend who showed him a game his son drew. This sparked the idea for Martin to create a sophisticated program to turn drawings into playable video games. The momentum, excitement, and success grew into a full-time passion business! Here is What’s Inside the Box: 3 Activity Books Teach Game Design5 Washable Markers1 code to Unlock The App on One Device and Create Unlimited Games1 additional code to Unlock The App on a Second Device and Create Unlimited GamesInstructions/ Quick Start Guide Harness the Power of Color to Create! In your Pixicade Video Game Creator, each color represents an important function in your game design. Green— Use this color to draw your avatar/ character in the game (animals, people, objects) Black— Use this color to draw walls, floors, and any other solid structures in your game Blue— Use this color to draw the goal of your game (money, points, coins, etc) Red— Use this color to draw the hazards in your game (fire, bullets, poison apples, etc) Purple— Use this color to draw the moveable pieces of your game (wheels, platforms, shapes, etc.)",
                "media_link": []
            },
            {
                "media_text": "Draw Snap & Play! GET YOUR HANDS ON THIS GROUND BREAKING GAME THAT PROVIDES ENDLESS FUN!!! Pixicade Mobile Game Maker sets a new standard in both entertainment and learning. There is an appeal for a wide spectrum of interests: kids that love drawing, kids that love video games, kids that like solving puzzles...they all are amazed at seeing their creations come to life! Parents love it because kids will actually put down their phones or tablets and pick up markers and paper. Kids love it because they can draw their own games, share them with their friends, and play them on their phone or tablet. Pixicade stores your game creations to come back to and play any time. The only thing more impressive than how innovative Pixicade is would be how extremely easy it is to use. Kids get to draw a picture of an idea for a video game using colored markers and real paper. Then, using the Pixicade app available for iOS and android, all that is needed is to snap a pic of the piece of paper! From there, the image is brought to life as an actual video game that can be played on a phone or tablet! The app only requires a camera and an internet connection. (iOS 9.0 and up, android 6.0 and up) The ultimate “wow” factor for hands-on fun, Pixicade was created by a high school art teacher who saw imagination and creativity in students decreasing. There is an educator’s device subscription specifically made for the classroom. Pixicade is also a STEM.org authenticated educational product. Pixicade Mobile Game Maker is unlike anything else on the market, and sure to get your kids’ imaginations working in new ways while keeping them engaged the whole time.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3376fc2b-8a16-4092-8437-1a2f49c1abce.__CR0,539,3394,2099_PT180_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Fun Summer Activity for Smart Brain Development! HOURS OF CREATIVE FUN! Do you want to keep your child’s brain active and engaged over the summer break? Join thousands of happy moms that are turning screen-time into fun, learning time! Pixicade teaches your child to think outside the box to develop creative video game ideas and solutions. Kids gain greater confidence and fulfillment while creating with their unique imagination! A Few Reasons You Will Love Pixicade: Fun and Educational Toy for Kids and AdultsTurns Screen Time into Creative TimeBuilds Pre-Coding SkillsTeaches Art and Engineering AbilitiesDevelops Strategy, Problem Solving, and LogicAnyone can Create a Unique and Fun GameEasy for Kids of All Ages to PlayEndless Design PossibilitiesGreat Gift Idea",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a0730ae8-8d8d-4e38-8379-b1c22700428f.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "The Perfect Gift For Your Child! Kids can create amazing games that they will be excited to Share and Challenge with their friends. With Pixicade you are able to Share and Play your games, as well as each others, all within the App! Share Your Games Across The Pixicade Platform as well as Play games that others have created! Stump your Friends with your own creations! Test Your Skills! Who will be the Reigning Champion? Fun for the Whole Family! There is Nothing More Rewarding than Watching Your Kids Unlock Their Own Potential While Learning and Having Fun When your child sits down with the Pixicade, you will see their creativity flowing as they create and play their own uniquely made game. Kids and Parents have a blast creating custom avatars or characters that are on a mission to obtain their objective. This Easy-To-Use Toy will turn Family Game Night into a success! The only challenging part as a parent is not spending too much time with it yourself! Reinforces Good Habits of Problem Solving. Quality Family Time Testing and Conquering Each Others Games. Enough Fun for ALL Ages!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/6d92dc95-77a8-461c-ab1f-0e7d17e6edcf.__CR1355,0,2274,3032_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/db72f228-2284-4f2a-9d5d-c248c100128b.__CR0,417,5000,2500_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "What's included in your Pixicade Box? 3 Game Design Guide Books 3 Activity Books covering 50 Game Design Concepts, 30 Instructional Activities and over 100 example games. 5 High-Quality Washable Markers The different colored markers represent different actions/avatars. So the app is instantly able to translate the intended actions and turn a drawing into a live video game. Green represents your avatar (or character), red represents hazards, purple represents objects that can move, black is solid ground walls or floors, and blue represents the goals. See product photographs or video for example that illustrates the game. Instructions/Quick Start Guide Instruction and Quick Start Guides are included for you convenience. Jump right in and Enjoy! Pixicade App with 2 QR Codes The Pixicade App is a creative playground full of content you can share or even play users games. The versatile App allows users to have parental controls, as well as other features to create the optimal experience. Just Snap a picture of the QR Code to unlock the ability to create your own games!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/818901b0-a61f-4ebd-b934-5618caf9527b.__CR0,0,459,459_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/177f5c47-4b4f-43fb-9817-121815aa41e9.__CR0,0,459,459_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/0b1bf5ac-dd25-4ad7-b252-544569531a3d.__CR0,0,459,459_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/274e9d02-4671-4157-9340-4d1262a494f7.__CR0,0,917,917_PT0_SX220_V1___.png"
                ]
            },
            {
                "media_text": "GET READY TO ENJOY HOURS OF CREATIVE FUN WITH PIXICADE! Proudly Share your Creations Online with Friends and Family! Show off your brilliant game creation skills! If you are over 13 years old, then you can share a link to your amazing game with friends and family to play on any web browser — even if they don’t have the app! Create Your Own Unique Game in Just 15 Seconds… Just like magic, the Smart Pixicade technology allows you to transform your drawing into a playable video game within just 30 seconds. It is easy and fulfilling to see your unique creations come to life quickly with the press of a button. Kids love making their creative stories and ideas become more “real.” They feel empowered knowing they are smart and resourceful to successfully create games all on their own!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/805dc559-64eb-4ce1-9664-7d719d4f6154.__CR0,0,4042,2500_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/ec24c800-a47c-4fdb-98e9-97eea96f917c.__CR0,29,2304,691_PT0_SX600_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3376fc2b-8a16-4092-8437-1a2f49c1abce.__CR0,539,3394,2099_PT180_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a0730ae8-8d8d-4e38-8379-b1c22700428f.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/6d92dc95-77a8-461c-ab1f-0e7d17e6edcf.__CR1355,0,2274,3032_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/db72f228-2284-4f2a-9d5d-c248c100128b.__CR0,417,5000,2500_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/818901b0-a61f-4ebd-b934-5618caf9527b.__CR0,0,459,459_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/177f5c47-4b4f-43fb-9817-121815aa41e9.__CR0,0,459,459_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/0b1bf5ac-dd25-4ad7-b252-544569531a3d.__CR0,0,459,459_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/274e9d02-4671-4157-9340-4d1262a494f7.__CR0,0,917,917_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/805dc559-64eb-4ce1-9664-7d719d4f6154.__CR0,0,4042,2500_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Holly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVIMRVWDONKBUBM6TT77JWCUVQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W5Q0QMZIQ5HP?ASIN=B0CRC1M2ZB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2022",
                "reviewTitle": "5.0 out of 5 stars Creative and fun !!",
                "reviewText": "My 6 year old LOVES his pixicade ! And as an adult I love it too! This thing is so awesome ! I do have to help him with it because the colors can’t overlap and each color is used for a different part of the game. Green is the character, purple is movable objects, etc. it’s such a fun and exciting thing for us to do at home ! Thank you!!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hailey Lynn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW43OYVQP3ILY7GJJ7WOQPECOEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3C8QKWF25QVE7?ASIN=B0CRC1M2ZB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars What a blast!",
                "reviewText": "Bought this for my son for his birthday and we have both had a blast creating games with it! I also like that instead of just mindlessly playing a video game, you have to use your imagination and can edit the different layers of the game to improve it with each use!! Definitely recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denise",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGP6J4PRYRWXUZISBYJFOVFZ4YQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R515P127OBH4L?ASIN=B0CRC1M2ZB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "4.0 out of 5 stars Not a Favorite",
                "reviewText": "I bought this thinking my grandson would love it. Let's just say he became bored of it and this was a waste of my money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kammie FradyKammie Frady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHON6ATWHSW53ECLYYOODRDUUDSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S7NFJQGSWA00?ASIN=B0CRC1M2ZB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2022",
                "reviewTitle": "5.0 out of 5 stars Make sure to check that you have 3 different books!",
                "reviewText": "UPDATE: I got an email from the company and they replaced it free of charge! Truly appreciated them reaching out and fixing the issue!!! I updated my review to 5 stars!!!I have this gift to my son as a birthday present. He opened it up and began playing with it immediately! It’s a really cool game maker! However, we noticed that it came with two book 2s and no book 1! I am not sure what we missed in book 1 😞. We are past the return window so I guess we will never find out!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CV5eww0gL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa Escue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6PXM7K7ZFONSJVO3Z2JGMCUTIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAOXBV7RA1H2M?ASIN=B0CRC1M2ZB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Cool",
                "reviewText": "Got them as gifts for my nephew's and they both loved it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kathryn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWVVPMUWCC4Y6CUXFKZO5IV7RRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M4XGTCPIBA00?ASIN=B0CRC1M2ZB",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2022",
                "reviewTitle": "3.0 out of 5 stars Markers missing",
                "reviewText": "Purchased Pixicade for my 8 yr old grandson. He was very excited & wanted to use it immediately. Unfortunately, the markers which were a necessary component of the game, were missing! He had to wait until we purchased said markers and he was very disappointed. It’s a great gift and a very creative activity for a child, however, they should be more careful to make sure everything needed is included! Thus the 3 stars.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LilLil",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTP6JE34MMUEHGDNLQWUIFTBX6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28EXKVYZZT66G?ASIN=B0CRC1M2ZB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2021",
                "reviewTitle": "5.0 out of 5 stars 6 and 8 Year old boys LOVE IT (parents do too)",
                "reviewText": "Man I love this thing, but my 8 and 6 year old sons love it even more. We’re those parents who are a little crazy about “screen time” with our kids. Let me tell you something - MOST of the time is spent with the kids building their game - the markers, paper and, most importantly, their imaginations of drawing new games are 90% of the fun because they know that their drawing will eventually “come to life” on the iPad. It sounds crazy, but it’s true. The different colors are used to create different things that the game automatically recognize on paper - e.g. use “red” to draw hazards; use “green” to make your character that can move, etc. My boys draw anything and, like magic, the screen brings it to life and the remaining 10% blows their little minds (and the parents minds too). Not really sure how it works, but we have a giant notebook full of different drawings and games, two boys who can’t stop using it and two parents who are totally OK with this kind of “screen time.”",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1tML6aJQWS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michigan Foodie Girl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJUUGLHKUM3TXOVVLVDF3JIA2TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10TERBLDUBQ?ASIN=B0CRC1M2ZB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Best gift i ever bought",
                "reviewText": "My 7 year old son loves this toy! It allows him to be creative and have fun. It was very easy to get set up. He hasn’t stopped playing with it since he got it. Best gift ever!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thein Htoon Wai",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on April 2, 2022",
                "reviewTitle": "Good product",
                "reviewText": "Fast delivery and well received. Not test yet. Hoping my niece like it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}