{
    "remaining_requests": 40442,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Anbernic-RG35XX-Retro-Handheld-Game-Console/dp/B0CJ3TB29K",
    "body": {
        "name": "Anbernic RG35XX Retro Handheld Game Console - Dual System Linux + Garlic OS- 64Gb TF Card 6831 Built In Arcade Games - Handheld Emulator - 3.5 IPS OCA Screen 2600 Mah Battery. Plug & Play Video Games",
        "price": "$62.99",
        "originalPrice": "$71.99",
        "rawPrice": 62.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Anbernic-RG35XX-Retro-Handheld-Game-Console/dp/B0CJ3TB29K",
        "soldBy": {
            "sellerID": "A2RDJ14I2C8DD2",
            "name": "XPlode",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2RDJ14I2C8DD2&asin=B0CJ3TB29K&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLJRJDMY"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BX275KSC",
                "variationName": "Style",
                "variationValue": "Purple",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CSF7V6CL",
                "variationName": "Style",
                "variationValue": "RG35XX H Black",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CSF6PQ5F",
                "variationName": "Style",
                "variationValue": "RG35XX H Purple",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CSF5WVWS",
                "variationName": "Style",
                "variationValue": "RG35XX H White",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CVF5LQQZ",
                "variationName": "Style",
                "variationValue": "RG35XX Plus- Black",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CPCZJNB3",
                "variationName": "Style",
                "variationValue": "RG35XX Plus- Gray",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CPCZDLV6",
                "variationName": "Style",
                "variationValue": "RG35XX Plus- White",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CGMVSNT1",
                "variationName": "Style",
                "variationValue": "Retro Gray",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CJ3TB29K",
                "variationName": "Style",
                "variationValue": "White",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41T6NS-tpZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/5117YFVAL5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418YhVvh8HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410lZT1-5zL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41yhEZbbjxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61FkLh-VLDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31d-aVNrceL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: XP-lode",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=XP-lode"
        },
        "brand": "XP-lode",
        "merchantInfo": "XPlode",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 74,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 10 hrs 37 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[Anbernic RG35XX Handheld Game Console] Compatible With PS1, CPS, NEOGEO, NEOGEO POCKET, GBA, GBC, SFC, FC, MAME, MD and More. Open-Source Download, so you can Download Any Game that Fits the Console.",
            "[3.5 Inch IPS Sreen] Full viewing angle, zero distance OCA full fit 640x480, Multi-Touch, tempered glass used for double Protection-Scratch Proof and Drop Resistance. Brings Better eye protection.",
            "[HDMI Output] RG35XX Supports TV Connection for a Better Gaming Experience. This Handheld Emulator-Supports connection with 2.4GHz Wireless or Wired Controllers. Multiplayer Mode-Play With Friends.",
            "[Super Long Battery Life] Built-in 2600Mah large capacity lithium battery. Long standby time and battery life. Support up to 6 hours of games. Fast charging using a USB-C cable. Ideal for Long Trips.",
            "[Upgraded Chip A9] Quad-core ARM Cortex-A9 , DDR3 256MB Ram Wich Can Run the Game perfectly, and Make the Game Screen More Smooth-Dual System-Pre-Installed 64GB TF Card With 6831 Games. Perfect Gift"
        ],
        "description": "Anbernic handheld game console RG35XX Linux system (Linux 64 bit system compatible with 32 bit applications). Screen: 3.5inch IPS full viewing angle, zero distance OCA full fit/ 640*480, Multi-touch. CPU: New A9 Chip Quad-Core ARM Cortex-A9, Quad-core Power VR SGX544MP GPU. Memory: 64G TF Card RAM: DDR3 256MB. Game Supports: PS1/CPS/ CPS2/ FBA/ NEOGEO/ GBA/ GBC/ GB/ SFC/ FC/ MD/ SMS/ GG/MSX/ PCE/ WSC/ WIN/ NGG etc 20 kinds of games format. Also Support users to download games in relevant formats. Language: Support multiple languages, such as English, Spanish, French, German, and more than 20 other languages. Note: Only the system interface can be set to other languages, currently the Game is only available in Chinese or English. Speaker: High quality double horn stereo speaker. Battery: Li-polymer 2100 mAh. Others: 3.5mm stereo earphones. Play your favorite retro games in this pocket console. Like Mario from Snes handheld emulator, Almost all Pokemon games such as Pokemon ruby gameboy advance Pokemon Red, Gold from Game Boy Color and more. Rg 35XX gaming handheld is better than soulja boy game console, soujaboygame console, powkiddy handheld game console - powkiddy rgb20, retroid pocket 2 plus, retroid pocket 3 plus, odin ayn, odin handheld, odin pro, aya neo air pro, miyoo mini, miyoo mini v2, analog pocket, analogue pocket, ayaneo air console, ayn odin, miyoo mini v3 Anbernic has the larger range of game handheld console of the market: RG353V, RG353M, RG353VS, RG35XX, RG505 anbernic, Anbernic WIN600, Anbernic RG353P, Anbernic RG552 handheld, abernick rg351v, Anbernic RG280V, Anbernic RG351M, Anbernic RG351MP. anbernic rg analogue pocket anbernic rg35xx miyoo mini v2 retroid pocket 3 plus nintendo 64 emulator console ayn odin pro abernic ambernic abernick rg351v analog pocket gba emulator powkiddy ambernik ayaneo simulator retroboy pokemon gcloud handheld",
        "breadCrumbs": [
            {
                "name": "Toys & Games",
                "link": "https://www.amazon.com/toys/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165793011"
            },
            {
                "name": "Kids' Electronics",
                "link": "https://www.amazon.com/electronic-kids-learning-pets-games-handheld/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166164011"
            },
            {
                "name": "Plug & Play Video Games",
                "link": "https://www.amazon.com/Plug-Play-Video-Games/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166201011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN",
                "value": "B0CJ3TB29K"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 74 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,080 in Toys & Games (See Top 100 in Toys & Games) #23 in Plug & Play Video Games"
            },
            {
                "name": "Product Dimensions",
                "value": "2.36 x 1.54 x 0.55 inches; 10.86 Ounces"
            },
            {
                "name": "Item Weight",
                "value": "10.8 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "XP-lode"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Date First Available",
                "value": "February 28, 2023"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Megan Made Me Buy It",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEQISBY6ECRAGMP3AAV5GYSGBGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Q3VNK2VIDUEI?ASIN=B0CJ3TB29K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Cool Gaming",
                "reviewText": "This handheld game is awesome! My husband and son both love it. It has a ton of games from when I was a kid. You can also easily add games to it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "777",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNWEX5RTXIPOEEU2WK7R6NIQTOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MJGP62NLLA75?ASIN=B0CJ3TB29K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Flawless product",
                "reviewText": "I wasn't expecting much. After purchasing at least a dozen handhelds on Amazon, I was expecting the usual low quality rubbish they peddle. This is mind-blowing fantastic. Perfect graphics, menu screen, game choice, and battery life. I couldn't be more happier.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Connor Reeves",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4MVCSUFJCUOALF652FNU5JMRIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DM0K1B748J8Q?ASIN=B0CJ3TB29K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "4.0 out of 5 stars Good gaming handheld",
                "reviewText": "Solid handheld emulator, lots of decent preloaded games. Truly the only gripe I can think to make is I couldn’t find any key to fast forward/increase game speed which is usually available with emulators. Outside of that function it works perfectly.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Cinnamon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4PDFPLF7BSOVM4OYSHLYO2N6QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTAM2D3V7CMO1?ASIN=B0CJ3TB29K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Good value for the price.",
                "reviewText": "I bought this for a anonymous gift program for underprivileged kids that our church was having. The child requested a specific 300 in 1 handheld that was basically full of retro games. That thing wasn't actually being sold at the big box retailer he specified in his request, and that forced me to scramble to find something else. I searched a lot and found some similar to the one he wanted from Wally World. To be honest it was junk and I felt like this kid deserved better than that.Thankfully the box came without shrink and I was able to open it and check this out. I genuinely want one of these for myself now. It is FULL of games, has a high-quality color screen and if you have any tech savvy you can add a 2nd SD card (or update the existing one) with more roms. My understanding is that it can handle titles up to P_S_1.As it stands it has an abundance of nice titles right out of the box. I am 100% confident that I made the right decision to buy this. Compared to the other cheap handhelds this one is amazing.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne Marie F.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEISMQK45VMUELHPKAS4FR3KFXBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPDGJFBWDPXES?ASIN=B0CJ3TB29K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars So amazing!",
                "reviewText": "Right out the box it has tons of games! I’ve read that you should replace the SD card so I did that and reinstalled the os and new games and it’s amazing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike Eckman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMMFMKLXIDARBQPZIMG2OOGRK2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMDEPJ94G146K?ASIN=B0CJ3TB29K",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "3.0 out of 5 stars OK Handheld Emulator, Overhyped on TikTok, Some Pros and Some Cons, Do Your Research Before Buying",
                "reviewText": "Update 2/7/2024: I've had the RG35XX for a couple weeks now and wanted to update my comments about the battery life. While I still think the included battery offers enough power for long gaming sessions, the way the power button works is not ideal. A single press of the power button only turns off the screen, but the rest of the unit remains on. If you plan on not using the device shortly after turning off the screen, you must remember to exit your game, then totally power off the unit with a long press of the power button. If you forget to do this, the until will remain on, draining the battery the entire time until it dies, which will happen in about 24 hours.While some of you might be thinking, DUUUHHH, just turn it off, you clearly don't have children. I suspect many users (adult and kids alike) of this device fail to do this on a regular basis and come back to play some games only to find the device with no power. It would be nice if there was a way to put the unit in a power save mode which allows you to resume the emulator and game you were in, without having to keep exiting the game, powering down the unit, then fully powering the unit back on, going into your emulator, loading your game and resuming where you left off. That the unit has only full on/full off options is not ideal.------------------------Before I begin, I think it is important to know what my experience is with emulators, and the perspective I am coming from when reviewing this product.I've been playing classic video games on emulators since the early 00s on PC and the original \"black and green\" Xbox. I remember excitedly awaiting the newest releases of MAME, SNes9x, and FCEultra to see which new games support was added for. Back then, reliable emulation of consoles like the N64 and original PS was just a pipe dream.The Anbernic RG35XX Plus is a pretty decent handheld emulator that depending on what your level of experience is, and what you expect out of it, may or may not be for you. I do not know who Anbernic is, however this exact device is available on Amazon and other retailers under a variety of names, so I cannot say for sure if the experience is the same with the many similar alternatives out there.Pros:The unit is reasonably well made with buttons that are easy to press and respond well. The four trigger buttons on the back have the most amount of play in them, but are far from what I'd call cheap feeling. They feel comparable to me to any number of 3rd party controllers for the Xbox or Playstation you can buy out there, but clearly aren't as good as the OEM ones.By far, the best thing about this device is the 3.5\" IPS screen. The resolution is 640x480 which could be better, but is good enough for most classic systems. I found it to be bright and crisp and I had no issue with brightness or contrast using the device in my home, midday, with sunlight coming through the windows. I did not try it in direct sunlight, but who plays video games outside in direct sunlight?I also found the battery life to be pretty good. The 3300mAh rechargeable battery has easily lasted me a few days of moderate gaming over the winter holiday break without needing to be recharged. A quick note though is that while playing, a single press of the power button only turns off the screen. Everything else is still on however, draining the battery. When you are done playing for a while, you should long press the power button to actually get it to shut down and conserve the battery.Performance from the quad-core ARM Cortex-A53 CPU is better than I expected. I had no issues with slowdown in any classic consoles like the NES, SNES, Atari, Sega Genesis, and any of the MAME games I tried. I did notice some slowdowns playing PSP games like Forza however, but that seems reasonable considering the power disparity of the two. I remember 20 years ago when it was a challenge to get SNES games to run properly, so this was a nice thing to see.Dual micro SD cards. It is nice to be able to add and swap as much storage to this device if you like. For those of you who like to tinker, you can load different operating systems on this thing, backup, and duplicate memory cards offering near limitless potential. You can even use this thing as a personal media player if you wish.HDMI port and bluetooth connectivity. These are nice options to have. Connecting the device to my TV is kinda neat, other than the fact that I need to pull out a very long HDMI cable to reach the device and the back of my TV, which I am not likely to do often. Being able to connect some bluetooth headphones for quiet gaming is a nice touch too, but I haven't actually tried it yet. If you don't want to use Bluetooth, there is also a standard 1/8\" headphone jack on the bottom.Cons:Despite what the commercials and obviously biased TikTok videos say, this device is not perfect. For starters, the default UI is pretty basic, and likely will confuse people who don't know alot about emulation, especially if you are in the US. For example, most of the consoles go by their Japanese names, like the NES and SNES are called the FC (Famicon) and SFC (Super Famicon), the Sega Genesis is called the MD (Mega Drive). These names aren't wrong, just not what people unfamiliar with emulation or original Japense consoles would recognize. Additional confusion is that there are multiple MAMEs, making finding the game you want difficult.Speaking of games, while I completely understand that it can be difficult to find every game for every person, the default list of ROMs is missing some pretty glaring games such as every single Super Mario Bros game from both the NES and SNES, the Gameboy is missing Tetris, the original game that came with it, MAME is missing any Pacman games or Spy Hunter (my all time favorite), the Atari 2600 is missing Missile Command.Yes, you can add these games yourself if you have the ROMs, but this isn't something the average novice is going to be able to do. If the company who built this thing and packaged these ROMs together (whether legally or not) wanted it to be the ULTIMATE handheld emulator, essential classics like these should be included.There are two methods for emulation, through something called the Game Room or RA Game (which is actually called RetroArch). Some reviews mention that RA is less stable which I have not observed, however I believe the experience is better through RA as it does not attempt to stretch the resolution of the original game to match the device's native 640x480 resolution which causes really bad artifacts and blurring in some games. Using the RA emulation, although the screen is smaller, the picture quality is much better.Finally, the overall shape and size are not ideal. I found the B/A/X/Y buttons to be too close together. There is room on this unit to space them apart farther without increasing the overall size of the unit, however during heavy game play, with average sized male hands, I find myself hitting the wrong button far too often. If your muscle memory is used to an actual video game controller, you will struggle with these. In addition the location of the four rear buttons are not ideal and cause hand cramps on games that use them, which thankfully aren't any of the games I play, but in a test session playing PSP games, my hands cramped up very quickly using the back buttons.Overall:I could probably come up with a few more gripes, but I have to take into account the price of this thing. For around $80, you get a capable, but flawed, hand held emulator with a terrific screen and enough power to play most classic games. I think the size is too small for anything more than the simplest of games, but at least there are other, larger options out there. The included software is the worst part of this device as it was clearly put together with very little effort.I think that with a much improved user interface, the experience could be better, but ultimately, the device is too small for serious gaming. If you are experienced with emulating and changing operating systems, and you have small hands, this might be the perfect device for you. If however, you are a casual gamer and just want to experience some retro nostalgia from the 80s and 90s, you will likely be disappointed.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John evans",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAH5TALZA7XSOSCWEASP6WNW6YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXGZXJCLA5NP9?ASIN=B0CJ3TB29K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Love this little thing",
                "reviewText": "Great display. There are tons of games loaded. Some great games i had forgot about no complaints. I do plan on doing SD card upgrades and adding a few games but in no hurry because it's a blast the way it is.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cameron Canterbury",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFS7VMJQGWROUKPANB6AAQP56OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P02N98BYM4Y1?ASIN=B0CJ3TB29K",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "1.0 out of 5 stars Awful device that needs work",
                "reviewText": "From cheaply fabricated, to entirely buggy, the anbernic is a mess. I returned the first device after it refused to turn on (after charging, and trouble shooting for hours with the micro sd card as well) and prayed the second would work better. How wrong I was. Fine for a use or two of an hour out of the box before it stopped working as well. Incredibly disappointed in this product. Do not waste your money or time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}