{
    "remaining_requests": 40392,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Players-Classic-Preinstalled-Compatible-Simulator/dp/B0C3YS3JK2",
    "body": {
        "name": "2 Players Retro Classic Game Console HDMI Output Dual Core CPU Plug and Play Video Games for Kids Preinstalled 600 Classic Games Compatible with GBA CP1 CP2 NEOGEO Arcade MD SFC Game Simulator",
        "price": "$29.99",
        "originalPrice": "",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Players-Classic-Preinstalled-Compatible-Simulator/dp/B0C3YS3JK2",
        "soldBy": {
            "sellerID": "A1Q0H5OPA3UBZB",
            "name": "BAORUITENG",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1Q0H5OPA3UBZB&asin=B0C3YS3JK2&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C7KQFCSQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B09FLN2LJX",
                "variationName": "Style",
                "variationValue": "PAPI-new",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0C3YS3JK2",
                "variationName": "Style",
                "variationValue": "X-Game-new",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51RCMhS7VtL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61oL2ZhafEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nBn5XGPsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71XW2ECjnPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61wYL4UEJsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qsjY0yUSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dNVRKjP8L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Dosnura",
            "link": "https://www.amazon.com/Dosnura/b/ref=bl_dp_s_web_23697036011?ie=UTF8&node=23697036011&field-lbr_brands_browse-bin=Dosnura"
        },
        "brand": "Dosnura",
        "merchantInfo": "BAORUITENG",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 50,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 9 hrs 1 min",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 22 hrs 16 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Sleek Design with Classic Feel: The X-Game retro/arcade gaming console brings the nostalgic feel of classic games to your fingertips with its sleek design in pearl white color and two blue game controller handsets. The console's design is reminiscent of classic arcade machines, making it perfect for gaming enthusiasts and collectors.",
            "Powerful Dual Core Processing: With a dual-core CPU and DDRII 128MB RAM, the X-Game delivers uninterrupted gaming performance. The console's 4GB internal memory is designed to store saved games while providing ample storage space for other entertainment options such as movies and TV shows.",
            "Multiple Playback Options: The X-Game console supports various playback options that include HDMI, AV, and USB. The console's high-definition HDMI output ensures that gaming content is displayed with stunning clarity, bringing an enhanced gaming experience. It also supports game and movie playback, adding more versatility to the console.",
            "Extensive Game Compatibility: The X-Game console features over 600 built-in classic games and supports popular gaming formats like CP1, CP2, NEOGEO, Arcade, GBA, MD, and SFC. With such extensive compatibility, the console delivers an immersive gaming experience that appeals to all generations.",
            "Expandable Memory and Accessories: The X-Game console supports TF card expansion up to 32GB, providing additional storage for gamers to store their favorite games and content. The console accessories include an AV cable, HDMI cable, instruction manual, and two wired controllers, making it easy to plug and play right out of the box."
        ],
        "description": "X-Game Retro Game Console - the ultimate gaming experience for anyone who loves classic video games. This handheld console features a sleek retro design and comes Pre-installed with 600 of the most beloved classic games of all time, making it the perfect gift for anyone who wants to revisit the nostalgia of retro gaming.The X-Game Retro Game Console boasts a DDR II 128MB RAM, ensuring it runs smoothly and delivers the latest gaming technology to your hands. The device supports multiple formats of games, including CP1, CP2, NEOGEO, Arcade, GBA, MD, and SFC. So, there's a vast array of games to enjoy, right out of the box.With an HDMI/AV output, the X-Game Retro Game Console can be easily connected to any TV or monitor, making it perfect for multiplayer gaming or viewing movies. It provides an excellent gaming experience in a larger screen, which enhances and adds to the retro feel of the console.This device supports TF expansion, allowing gamers to store even more games on this console. The TF expansion can support up to 32 GB of extra storage, so you can add your favorite games quickly and easily. The X-Game Retro Game Console also comes with USB Joystick 2PCS, which is perfect for two-player games.This device is the ultimate gaming system for anyone who loves classic games, and it is guaranteed to bring joy to gamers and non-gamers alike. Whether you want to rediscover your favorite video games from your childhood or experience them for the first time, this console is the perfect choice.",
        "breadCrumbs": [
            {
                "name": "Toys & Games",
                "link": "https://www.amazon.com/toys/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165793011"
            },
            {
                "name": "Kids' Electronics",
                "link": "https://www.amazon.com/electronic-kids-learning-pets-games-handheld/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166164011"
            },
            {
                "name": "Plug & Play Video Games",
                "link": "https://www.amazon.com/Plug-Play-Video-Games/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166201011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN",
                "value": "B0C3YS3JK2"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 50 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#300,189 in Toys & Games (See Top 100 in Toys & Games) #669 in Plug & Play Video Games"
            },
            {
                "name": "Product Dimensions",
                "value": "9.85 x 2.13 x 7.87 inches; 2.62 Pounds"
            },
            {
                "name": "Item Weight",
                "value": "2.61 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "BAORUITENG"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "April 30, 2023"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW6LDC4PSQESQGPNFUPWXZZAVZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSCSGYUYS8O6Z?ASIN=B0C3YS3JK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2021",
                "reviewTitle": "5.0 out of 5 stars The right move",
                "reviewText": "I did a lot of research on Anberic handhelds before deciding to go for this one and I'm glad I did. This thing is a dream. It feels amazing in the hand, controls really well and runs anything I throw at it (from PS1 era downward). I wanted something premium-feeling and this is it. A couple things for would-be buyers:1) For anyone concerned with the manufacturer name shown in the title here like I was, I can confirm this is an authentic Anberic RG351MP device after poking around in it for a while. I think this is just the name of the distributor or something.2) The screen is the reason you want this model over the RG351M or 351P. It's got a beautiful 640x480 display that's viewable even if you have the thing turned completely sideways. You might have to adjust integer scaling for some consoles/roms, but you'll generally be able to find something that looks good.3) Everything PS1 and earlier runs flawlessly though there might be one or two little exceptions as far as PS1 goes. Anything past PS1 should be treated as a bonus because a lot of it runs poorly, but seeing as this is mainly targeting only up to the late 90's for its library that was fine with me. Expect only about 20-50% of N64/Dreamcast/PSP games to run, if they boot at all. Anything from PS2 onward will be a no-go.4) It came with a 64GB card packed with roms which of course is questionable depending on where you live and what your backup collection is like. But I wiped the card anyway and populated it only with my own copies of games/rom hacks and it went smoothly. It's easy to do but you'll need a microsd card reader, so keep that in mind. The card you want to replace roms on is in the TF2 slot on the bottom bevel of the machine.5) Battery life is good but it'll take a while for the gauge to display the battery life correctly, because it needs to drain/charge fully a few times first. In general I think it's got about six hours in it before you need to recharge.All in all it's a great little product and one I'll definitely get a lot of use out of. Hopefully it doesn't spontaneously break or anything. If it doesn't it's an easy 5 stars.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jmarks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBT6IMFJJ7WMZFSJJRUZUMQG2EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32MZZCSF4Y0R2?ASIN=B0C3YS3JK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 7, 2022",
                "reviewTitle": "5.0 out of 5 stars Great little gaming device",
                "reviewText": "Make sure to watch plenty of youtube videos about this product before you purchase it. Know what you're getting into. It's not that difficult to set up, but if you're new to this, there's gonna be a learning curve. For what it does, its great. Beautiful screen and responsive buttons. The ONLY major downside is the lack of built-in wifi. But that can be solved with a wifi dongle. I even have an Anker USB-C to Ethernet adapter that i can use when I need more speed for updates and file transfers. I strongly recommend this device.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW4IYSSEPZK25GA2YRKS5LRESAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZW1ZCJMNLZR5?ASIN=B0C3YS3JK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2021",
                "reviewTitle": "5.0 out of 5 stars Seems legit!",
                "reviewText": "First day using it and it actually exceeded my expectations surprisingly. I'll update this for the boys if I run into anything. I thought the joystick finger thingies were gonna be lame but they actually feel really smooth. All the controls so far feel really good. I am a 37 Year old man and I love that I can relive my childhood all in my pocket :) If you are on the fence about buying it I'd personally recommend it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frog and Toad are Friends",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ32RTMD62BPHMWXDL4AP2EDFLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6656V67TR31W?ASIN=B0C3YS3JK2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 12, 2022",
                "reviewTitle": "4.0 out of 5 stars Solid, versatile retro gaming system with a premium feel.",
                "reviewText": "No complaints. The ergonomics are good, even though I have larger hands, and the screen is crisp & responsive. Button feel is great, and the size is ideal for packing as a daily runner. It might be heavier than some people prefer, but to me it has the right amount of substance & stability.Reason for the 4 stars instead of 5 is because it needs some fiddling. The Wi-Fi dongle does the job, but it's clunky and a little finicky. The operating system works fine, but much better with 351Elec (AmberElec) if you want a sleek, no fuss OS or ArkOS if you like tweaking your device to the nines. Both operating systems are free and easy to install. Also, I did have to open it up to re-seat the R1 shoulder button - it was spongy out of the box but works fine now. Turning off the system is a Quit command in the menu instead of a power switch press, which for most people may be counterintuitive. But remember, this thing is basically a small computer running a Linux port, so it shuts down like a computer.Overall this is a great handheld if you want to take everything from Pong through PS1 games on the go.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff Decker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRRIFFFMANWOOOMXMK6SBXTSNLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T0F5RHBEGXME?ASIN=B0C3YS3JK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Great gift!",
                "reviewText": "Got this as a gift, he said it worked well!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Grand Proxy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLRP4FY4DBSS7ZGXQ56I3FHER2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB8BOXOZTDROY?ASIN=B0C3YS3JK2",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "1.0 out of 5 stars Absolute scam.",
                "reviewText": "Almost none of the games work correctly, many are foreign or demos. There is literally no options to do anything. The controls are horrible and cannot be changed. There are 10 dollar emulators that perform better. This is just another clone of a clone of a clone",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE72RYQ4TLVL2M7ZPN5RG7KLYRVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OJPXEDMDWTOH?ASIN=B0C3YS3JK2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2022",
                "reviewTitle": "5.0 out of 5 stars This is just about perfect.",
                "reviewText": "I wanted to take a star off for the external wifi but this is too good of a device to do that to. External wifi might be a blessing. Had a PS3 slim where the wifi and Bluetooth hardware failed after an update and it had barely been used. A card separate from the motherboard would have saved it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dalton BaileyDalton Bailey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AES7CGUZRE7OLB6IY44CII5ZVWSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30D4V0UVNPV2Q?ASIN=B0C3YS3JK2",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 25, 2022",
                "reviewTitle": "1.0 out of 5 stars Would have probably been better if I got what I ordered",
                "reviewText": "I received this product and it had noticeable signs of use as well as missing most of the accessories out of the box. The included SD cards were not there as well as the Wi-Fi adapter and charging cable being missing. It also had fingerprints all over the screen and around the buttons. Honestly getting it set up with my own SD card was a giant pain, compared to the experience I was expecting, being able to turn it on and play out of the box.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/517zD3zIOEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61aVZ7kFzKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61e9Fkx3+0L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}