{
    "remaining_requests": 40459,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LKTINA-Screen-Handheld-Portable-Console/dp/B08F5FBVKT",
    "body": {
        "name": "LKTINA 8GB 4.3’’ 1000 LCD Screen Handheld Portable Game Console, Built in 1200+Real Video Games with Media Player, for gba/gbc/SFC/fc/SMD Games, Best Gift for Kids and Adults -Black (Medium)",
        "price": "$32.99",
        "originalPrice": "",
        "rawPrice": 32.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LKTINA-Screen-Handheld-Portable-Console/dp/B08F5FBVKT",
        "soldBy": {
            "sellerID": "AJHGVNV7WE2QN",
            "name": "EverBright Bazaar",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AJHGVNV7WE2QN&asin=B08F5FBVKT&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08MFH98PX"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 5% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418FyQIJdOL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41vhVpU8NfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41thHD1h fL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OqN3q29iL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51r7E3ecM3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41w4fvTiksL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: LKTINA",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=LKTINA"
        },
        "brand": "LKTINA",
        "merchantInfo": "EverBright Bazaar",
        "customerReview": "3.5 out of 5 stars",
        "customerReviewCount": 792,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 8 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 14. Order within 4 hrs 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【FEATURE】4.3 inch 260,000 full-color TFT screen, built-in Rechargeable Lithium Battery, which supports up to 8-12 hours game playing time after being fully charged.",
            "【INTELLIGENT OPERATING】You can save the game progress and play again with last game progress by pressing \"SELECT\" button, then selecting \"Save Game\". Games can be deleted directly or downloaded from the computer.",
            "【BUILT-IN 1200+ SUPER CLASSIC GAMES】Built-in 1200+real no-repeat Games, Support GBA/GBC/GB/SFC/FC/SEGA/SMC Games. Perfectly satisfy your daily games needs and bring back your memory of childhood having fun playing games.",
            "【SUPPORT TV OUT】You can connect the 4.3-inch screen game console to the TV so that you can enjoy the fascinating and lively video game in bigger screen.",
            "【OTHER FUNCTIONS】 E-book Reader, recorder, calendar, time show and stopwatch, LRC show, bookmark device etc. Please contact us if you have any problems. We will reply to you within 12 hours."
        ],
        "description": "Built-in 1200+ real no-repeat old school classic games, super classic games covering a variety of types of games, such as adventure, shooting, action, racing and so on. and other classic FC games. You can play more than 1200 built-in games anytime and anywhere. Note: After turning on the ON/OFF button, please press start button to start the console. Since we have many games built into the console, only some of them are shown on the desktop, for more games, please select the \"game\" icon in the lower left corner to view them. Specifications: Screen: 4.3 inches, 260,000 full-color TFT screen Battery: Built-in 1500 mAh battery, the movie about four hours, MP3 music 8 hours. Multi Language: English, Japanese, Korean, Spanish, Portuguese, Russian, Italian French, German. Game features: support 8 emulators, 8-128 the following games, online games Video: supporting format of AVI, WM FLV,RM, RMVE, MP4, 3GP, MPEG, VOB, DAT and SWF. Music: supporting format of WMA, OGG, MP3, APE, FLAC, WAV, ACC play in format. Audio recording built-in microphone, stopwatch\\calculator\\calendar function, Learning features support eBook, Lyrics synchronization support two-line display lyrics ,File storage any storage file browser, delete, copy and other operations, data manager Point Play. Control and regulation: does not support multi-tasking operations. External expansion card: maximum support 32GB TF Card. AV cable not include. How to find more games? Find the \"Games\" icon in the lower left corner of the screen, press the \"A\" key to enter, select \"built-in game\"or\"Optional Game\"---\"Dir List\", press the \"A\" key to enter, you will see more games. How to archive game？ When playing the game, press \"SELECT\" to exit the game then select \"save game\" in the menu, press A to determine, a game saves up to six game progress. If you want to follow the previous game schedule, after entering the game, press \"SELECT\"-\"load schedule\" to do so. How to add games\\game delete? Contact us to get more game download URL. 1.When connected to the computer, you can see the tour in the \"GMAE\" file.The game can be deleted, but the game fixed in the machine can not be seen on the computer, it can not be deleted. 2.How to download the game? Users can search for games online, download the games to the computer first, and then use USB.Connect the game console to the computer and copy the downloaded game from the computer to GAME in the game console.Folder (Game File Suffix Name： gba/gbc/gb/sfc/nes, due to downloaded games from various websitesFiles may be different. Sometimes there will be situations that do not support them. Please delete them and download them on other websites. Troubleshooting 1.Game consoles can't boot Check if the battery is running out. Connect to USB or charger and try to restart it after charging. 2.No sound can be heard in headphones Please check if the volume is set to 0. Please check if the headphone is inserted into the jack correctly. 3.Serious noise Please check that the plug of the headphone is clean. Dirt can cause noise. Please check if the music file is damaged and try playing other music to make sure. If the file has been damaged, it may cause damage.To produce a very serious noise or jump. 4.Screen display scrambling Check that the correct language options have been set 5.Unable to dowrtoad files Make sire that the computer is properly connected to the game console Make sure that the storage space of the internal memory is full Make sire the USB connection is damaged. Package Included: 1x Handheld Game Console 1x Earphone 1x USB Cable 1x User Instructions",
        "breadCrumbs": [
            {
                "name": "Toys & Games",
                "link": "https://www.amazon.com/toys/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165793011"
            },
            {
                "name": "Kids' Electronics",
                "link": "https://www.amazon.com/electronic-kids-learning-pets-games-handheld/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166164011"
            },
            {
                "name": "Plug & Play Video Games",
                "link": "https://www.amazon.com/Plug-Play-Video-Games/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166201011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3\"L x 2\"W x 1\"H"
            },
            {
                "name": "Item Weight",
                "value": "8.8 ounces"
            },
            {
                "name": "ASIN",
                "value": "B08F5FBVKT"
            },
            {
                "name": "Manufacturer recommended age",
                "value": "36 months - 20 years"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#56,763 in Toys & Games (See Top 100 in Toys & Games) #122 in Plug & Play Video Games"
            },
            {
                "name": "Customer Reviews",
                "value": "3.5 3.5 out of 5 stars 792 ratings 3.5 out of 5 stars"
            },
            {
                "name": "Release date",
                "value": "June 1, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "LKTINA"
            },
            {
                "name": "Size",
                "value": "Medium"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Brand",
                "value": "LKTINA"
            },
            {
                "name": "Theme",
                "value": "Retro"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "john cary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4PVEUQUQCQY6LK6HFJA2CFLIUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38DWDZKF2D7CQ?ASIN=B08F5FBVKT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 1, 2023",
                "reviewTitle": "5.0 out of 5 stars The battery life is great!!",
                "reviewText": "I bought this for my 8 year old for a long trip and he absolutely loved it! Too many games for him to play which kept him very busy and entertained. The sound was amazing and he loved all of the other features. Very happy with this and a great value for the price.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MikeJG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBICYL45DTVIX3OWFBM3U6MUMEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DK5LPOLZ53RQ?ASIN=B08F5FBVKT",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "1.0 out of 5 stars Great System. Died after a year",
                "reviewText": "The system is great with a nice screen and plenty of different games to choose from. The problem is the battery died about a year in and now it only works when it’s plugged in, which isn’t great for a portable system.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJCDBLJIP6RDOWUEXH5L6XVGL4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16B80M55CGU08?ASIN=B08F5FBVKT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2022",
                "reviewTitle": "5.0 out of 5 stars It was given as a gift.",
                "reviewText": "I liked that is looked expensive. It was shiny black. I gave it as a gift to a 10 yr old boy asking for a hand held game for Christmas. It was a pick of mittens off a tree so I did not know the child I bought this for. I thought it a bit expensive for the size, but I guess it's a technology of games that one pays for. Hope he liked it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen M Crisler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNAIWPX7JIF6W4H6FRCTXQ6BADQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SZ2OLQYRYIXI?ASIN=B08F5FBVKT",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "3.0 out of 5 stars unhappy with this purchase",
                "reviewText": "I bought this product for my daughter, the battery life very disappointing, doesn't last as long as it was stated for. Charging also disappointing takes long then stated in description. Also included in purchase was a headset that was broken when arrived. Overall my daughter was heart broken, very disappointed in her gift.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "thelifepdx",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIXZPGSLAJIXPF65NBLFW4LEZ5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZASIAK3YBOG?ASIN=B08F5FBVKT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 7, 2023",
                "reviewTitle": "4.0 out of 5 stars X6 Game Console Review",
                "reviewText": "The media could not be loaded. This PSP clone is a decent portable gaming system It can easily play game Boy, Gameboy color, Gameboy Advance, Nintendo, Super Nintendo, and Sega Genesis. It does have a hard time playing PlayStation or higher games due to hardware struggles. Overall I would recommend this! The menu is easy to navigate, the games are easy to load onto the system, everything is built generally good. I would complain about the d-pad though. There are only four directional buttons, which for games like Mortal Kombat with special moves back down forward is nearly impossible to do. It feels awkward in games like MK and Street Fighter, but the joystick comes in handy only in those times. I would use the joystick in the menu mainly. Again for $30 for a portable game system with a decent screen and sound that plays all the classic 8-bit and 16-but games, why not. Oh and it loads fine without the SD card in it. Turn the system on then put in the SD card it works fine otherwise it won't boot. Happy gaming!",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0284767d-4dee-4757-9d1e-c86b620dbfd5/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Tammy Hobbs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED66FZPUAXES2UTZQLWKBKEXBKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MDXGY9O3OXEI?ASIN=B08F5FBVKT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Love",
                "reviewText": "Love it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fray rosario",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRMWSQT4XLQGUQ4UBQKD2V5SNUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24ATZI86VGJNX?ASIN=B08F5FBVKT",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2022",
                "reviewTitle": "2.0 out of 5 stars Nit worth 10$.",
                "reviewText": "The hype to try and go back to retro console specially handheld its captivating however, this one ain't it. Battery doesn't last but 5mins after first charge, the buttons layouts are not as described (Button A has the B functions), the equipment in itself weights just as much if not lighter than a solar calculator (this should tell you the quality of what you're getting; except a solar calculator is worth 4.99$), the list goes on. Go find something else that it's l9ng lasting and much attention calling to your little one or for yourself. This will just be a waste a money that will last you no more than a week. Not to mention, you can't play games while charging it as it will shut off on you but battery will not hold the charge.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Jackson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2SI33QYJDXJM73S7SOVJ7WQTBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20INIQOZP19IN?ASIN=B08F5FBVKT",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "1.0 out of 5 stars Didn’t work",
                "reviewText": "Send me broken toy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alice",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 16, 2019",
                "reviewTitle": "ottima qualità, bellissimo gioco portatile",
                "reviewText": "mia figlia lo ha ricevuto per Natale e da allora lo tiene nello zaino per giocare all'intervallo coi compagni. è un ottimo gioco (fino a 4 giocatori) portatile, la plancia/tabellone di gioco diventa anche contenitore grazie alla cerniera.è una versione degli shangai moderna, colorata e simpatica in cui serve molta destrezza grazie alla calamita con 2 livelli di potenza diversi. in famiglia ed viaggio ci giochiamo dai 40 ai 3 anni tutti insieme.consigliatissimo!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cris Rainbow",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 19, 2019",
                "reviewTitle": "Great game",
                "reviewText": "Such a great game. An absolute success with children (from about 5) and adults.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laeti",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 21, 2018",
                "reviewTitle": "A glisser dans le sac",
                "reviewText": "Jeux très pratique à emporter partout.Même les petits peuvent y jouerAu top pour occuper les enfants au resto ou dans l’avio.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tasha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 22, 2018",
                "reviewTitle": "Great game",
                "reviewText": "Love this game. Great to take away. A lovely family game",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marie josé Hospital",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 2, 2018",
                "reviewTitle": "gamefactory",
                "reviewText": "Très bon jeu de patience pour tout âge. Pochette de transport très pratique et peu encombrante. Très bon jeu familiale. Aimant de bonne qualité.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}