{
    "remaining_requests": 40300,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Console-Wireless-Nostalgia-Emulators-Controllers/dp/B0CLHWZ8LQ",
    "body": {
        "name": "Retro Game Console, Wireless Nostalgia Game Stick Built in 20000+ Classic Games, 4K HDMI Output Plug & Play Video Games for TV with 9 Emulators, Retro Gaming Console with 2.4G Wireless Controllers",
        "price": "$44.62",
        "originalPrice": "",
        "rawPrice": 44.62,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Console-Wireless-Nostalgia-Emulators-Controllers/dp/B0CLHWZ8LQ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51EdBT1ImWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51YNe7hNMoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JjCOTkqXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zKmGXKkPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QUCe4aXaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510nb2hLBVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/912z0NNxJnL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a5c01601-deb3-48c3-8d78-8bfab02b7d36/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: LOGOPLAY",
            "link": "https://www.amazon.com/LOGOPLAY/b/ref=bl_dp_s_web_120927013011?ie=UTF8&node=120927013011&field-lbr_brands_browse-bin=LOGOPLAY"
        },
        "brand": "LOGOPLAY",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "5.0 out of 5 stars",
        "customerReviewCount": 1,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🎮【20000+ Retro Games】This 64G wireless game console has built-in 20000+ nostalgia stick games, including classic games such as racing, fighting, and tanks. With this nostalgic game stick, you can play over 20000 of your favorite games without downloading or connecting to the internet, perfect for summer holidays to reminisce about childhood fun with family or friends.",
            "✨【9 Emulators】The 2024 latest handheld game console supports 9 simulators, each emulator has a different type of game, you can play over 20000 classic games happily. The retro game console with built in games supports a favorites/search/history function, you can put your favorite game in your favorites to quickly find it, or you can find the game you want to play by searching. I think this plug and play video games for TV is the best gift for friends or elders.",
            "⭐【2 Wireless Controllers】The emulator console is equipped with 2 black&white wireless gamepads. Compared with traditional wired controllers, it does not have messy cables to affect the beauty of the living room and is more flexible to operate. The 2.4G wireless game controllers can control a distance of up to 33 ft, so you can play games anywhere in your living room. The 2 joysticks on the controller are perfect for racing games, where you can easily and accurately control the throttle.",
            "🌈【4K HDMI Output】The plug and play 4K game stick is thin and small. You only need to connect to TV, computer, projector and other devices with HDMI interface through HDMI cable, you can enjoy 20,000+ classic games. (Please ensure that your device has an HDMI input port so that the game console can connect to your device). The new 4K upgrade chip makes the screen clearer and the game smoother and more stable, bringing you a new gaming experience.",
            "💝【 Ideal Gift 】This HDMI retro game stick can not only awaken the childhood memories of adults in the 80s and 90s and help them reduce work pressure, but also bring fun gaming experiences to today's children and spend a pleasant holiday.The wireless gaming stick is an ideal gift for all ages. If you have any problems during the use of the retro games TV stick, please feel free to contact us and we will provide you with a satisfactory solution within 24 hours."
        ],
        "description": "Do you often miss the time when you played retro games with your friends when you were young? -The newly upgraded retro play helps you regain your interesting childhood. 🎮【20000+ Games】Our wireless game console supports 9 emulators, with a total of 20304 classic nostalgic games for you to play. The nostalgia stick also supports favorites/search functions. 🎮【4K HDMI Output】Newly upgraded chip, HDMI high-definition image quality output, clearer game graphics, smooth gaming without stuttering, allowing you to enjoy lively and interesting video games on the large screen. 🎮【2 Wireless Controllers】Our wireless controller is ergonomic and comfortable to hold. Equipped with 2 joysticks, you can more calmly control racing, shooting and other games. 🎮【Easy to Use】Plug and play 4K retro game console through HDMI extension cable connected to TV, computer, projector and other devices with HDMI interface, you can play 20,000+ classic games. (Computers and projectors may require HD collection cards to function properly) 🎁【 Perfect Gift 】Whether it is elders, friends or children, this nostalgic classic game console is an unforgettable gift for them, and you can experience the joy of retro games with them. 💡How to connect the retro game console correctly?💡 🎈1. Please insert the TF card and USB receiver into the game stick. 🎈2. Connect the HDMI extension cable and game stick to the HDMI interface of the TV. 🎈3. Connect the USB cable and game stick to the USB port of the TV.What is included in the packaging? 📍 Wireless Gamepad × 2 📍 Game Stick × 1 📍 TF Card × 1 📍 USB Receiver × 1 📍 HDMI Extension Cable × 1 📍 Micro-USB Cable × 1 📍 Instructions × 1",
        "breadCrumbs": [
            {
                "name": "Toys & Games",
                "link": "https://www.amazon.com/toys/b?ie=UTF8&node=165793011"
            },
            {
                "name": "Kids' Electronics",
                "link": "https://www.amazon.com/electronic-kids-learning-pets-games-handheld/b?ie=UTF8&node=166164011"
            },
            {
                "name": "Plug & Play Video Games",
                "link": "https://www.amazon.com/Plug-Play-Video-Games/b?ie=UTF8&node=166201011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1 x 1 x 1 inches"
            },
            {
                "name": "Item Weight",
                "value": "14.4 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CLHWZ8LQ"
            },
            {
                "name": "Item model number",
                "value": "1"
            },
            {
                "name": "Manufacturer recommended age",
                "value": "14 years and up"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#199,532 in Toys & Games (See Top 100 in Toys & Games) #458 in Plug & Play Video Games"
            },
            {
                "name": "Customer Reviews",
                "value": "5.0 5.0 out of 5 stars 1 rating 5.0 out of 5 stars"
            },
            {
                "name": "Manufacturer",
                "value": "LOGOPLAY"
            },
            {
                "name": "Brand",
                "value": "LOGOPLAY"
            },
            {
                "name": "Model Name",
                "value": "1"
            },
            {
                "name": "Color",
                "value": "M8 Game Console-white 001"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "leejongkook",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4G2BNXVS5BX6PEIWCP73B2FORA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GQK9HL7BK030?ASIN=B0CLHWZ8LQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Old School and Hard Core Gamers- This One Is For You!",
                "reviewText": "Bought for my husband who loves video games. We were blown away by how many fun games it included. This gaming stick has tons of emulators and tons of games! The search function is very useful and you can also bookmark it. Comes with 2 controllers and easy to use. Playing these games really brings you back to the 90s or.. 80s. Super Mario, Donkey Kong, Contra and even \"newer\" games like Crash Bandicoot is included. Lots of fighting games and many imports. Love the portability of this unit! The setup is relatively simple, and while the quality of the game shows off the skill that went into creating this game, the nostalgia is worth the trip down memory lane! If you have a friend or loved one who loves vintage video games, this would be a really fun gift for them!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}