{
    "remaining_requests": 40456,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Aojiao-Handheld-Console-Electronic-Birthday/dp/B0CLLY1LLJ",
    "body": {
        "name": "Aojiao Handheld Game Console for Kids 3.0\" Large Screen with Built in 268 Classic Retro Video Games Seniors Electronic Gaming Players Boys Girls Birthday (Blue)",
        "price": "$27.99",
        "originalPrice": "",
        "rawPrice": 27.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Aojiao-Handheld-Console-Electronic-Birthday/dp/B0CLLY1LLJ",
        "soldBy": {
            "sellerID": "A2UF9942X47Y19",
            "name": "jiuliangtuo339872",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2UF9942X47Y19&asin=B0CLLY1LLJ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CMPXXZ9R"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CLLY1LLJ",
                "variationName": "Color",
                "variationValue": "Light Blue",
                "price": "$27.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41GOUvR1HML._SS36_.jpg"
            },
            {
                "asin": "B0CLLWNXD1",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "$27.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41nqfiuWu+L._SS36_.jpg"
            },
            {
                "asin": "B0CLLY9QNQ",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$27.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41PJByDp5YL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 30% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41GOUvR1HML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/519Y4W-r-7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Kpxa1UzqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nMBY7UhcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51l7xVOyL2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mp DvUGnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QbwD0mQJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Aojiao",
            "link": "https://www.amazon.com/Aojiao/b/ref=bl_dp_s_web_39097213011?ie=UTF8&node=39097213011&field-lbr_brands_browse-bin=Aojiao"
        },
        "brand": "Aojiao",
        "merchantInfo": "jiuliangtuo339872",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 71,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 14. Order within 9 hrs 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "💖NOVEL DESIGN: This handheld game console features a stylish colorblock design. Free with preloaded 268 classic games.Join the joystick with the same function as the direction button, you can experience the fun of arcade.It's a great kid's birthday, Christmas gift!",
            "💖USER-FRIENDLY DESIGN: Regardless of the screen size (3.0 inches) or the size and layout of the buttons, this game console fully considers the portability and practicality of the child. Parents are worried about their little cute excessive use of mobile phones or pads, easy to be affected by bad content on the Internet. This game console is a very good substitute. No matter whether your kids are on the road or at home, it is a reassuring partner.",
            "💖RECHARGEABLE: Built-in a rechargeable lithium polymer battery, providing a steady stream of energy for your child's happiness. It also eliminates the parents from buying and replacing batteries frequently. Use the micro charging interface, compatible with most electronic product adapters. It only takes 1-2 hours to fully charge and you can play for 5 hours.",
            "💖SIMPLE AND EASY TO USE: This handheld game console is an easy to use and portable gaming device that lets you play your favorite games on the go. With its comfortable and intuitive controls, even 4 year olds can enjoy gaming fun without having to worry about complicated buttons or controls.",
            "💖TRUSTWORTHY SERVICE: This game console is suitable for birthday, Christmas, and party gifts for both adults and children. This will be a big surprise for them. Our warranty covers any defect caused during product production and delivery. We can offer you full refund or free replacement within 30 days and 6 months warranty, whichever is at your most convenience."
        ],
        "description": "Welcome to our store.Introducing our all-new Handheld Game Console, the ultimate entertainment device for kids! Packed with 268 exciting puzzle, action, educational, and sports games, this console guarantees endless hours of fun and learning. Designed with convenience in mind, our handheld game console is rechargeable, allowing your child to enjoy uninterrupted gaming sessions. Its user-friendly design ensures that even young children can easily navigate through the games and controls. Crafted with high-quality ABS material, this console is not only durable but also absolutely stunning in its appearance. Its sleek and compact design makes it perfect for on-the-go entertainment, whether it's during long car rides or family vacations. With this handheld game console, your child will never be bored again. It offers a wide variety of games that cater to different interests, ensuring there's something for everyone. From solving puzzles to engaging in action-packed adventures, this console provides a well-rounded gaming experience. Invest in our Handheld Game Console today and watch your child's imagination and cognitive skills soar as they dive into a world of exciting games and endless possibilities. Get ready to witness their joy and excitement with every game they conquer!As a gift for children, friends, parents,on birthdays, holidays and other beautiful moments are perfect. Advantageous Features Built-in rechargeable lithium battery,eliminates the hassle of buying and replacing batteries frequently,entertainment kids convenient parents. Using a standard Micro USB charging interface,compatible with most electronic device adapters. Charging one hour can play for 5-6 hours. Package Contains 1 x Game console 1 x Lithium Polymer Battery 1 x User Manual 1 x USB Cable",
        "breadCrumbs": [
            {
                "name": "Toys & Games",
                "link": "https://www.amazon.com/toys/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165793011"
            },
            {
                "name": "Kids' Electronics",
                "link": "https://www.amazon.com/electronic-kids-learning-pets-games-handheld/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166164011"
            },
            {
                "name": "Plug & Play Video Games",
                "link": "https://www.amazon.com/Plug-Play-Video-Games/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166201011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6 x 2.8 x 0.75 inches"
            },
            {
                "name": "Item Weight",
                "value": "90 Grams"
            },
            {
                "name": "ASIN",
                "value": "B0CLLY1LLJ"
            },
            {
                "name": "Item model number",
                "value": "GB-682S-BE"
            },
            {
                "name": "Manufacturer recommended age",
                "value": "4 years and up"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#186,153 in Toys & Games (See Top 100 in Toys & Games) #427 in Plug & Play Video Games"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 71 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Manufacturer",
                "value": "Aojiao"
            },
            {
                "name": "Color",
                "value": "Light Blue"
            },
            {
                "name": "Brand",
                "value": "Aojiao"
            },
            {
                "name": "Theme",
                "value": "Handheld Game Console"
            },
            {
                "name": "Screen Size",
                "value": "3 Inches"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Itech",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFERSRODOOBH6RGSVG26HVOSWARA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PP9AHCBRNP6S?ASIN=B0CLLY1LLJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars For 5 years old and up",
                "reviewText": "A great little toy, very amusing and enjoyable for toddlers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Clay Birdyshaw",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVPEX7R63SYSGKGZ3OILYENIRTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25Z2LCZRWX0CL?ASIN=B0CLLY1LLJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars Pretty basic, but a ton of games",
                "reviewText": "This handheld console is basically exactly what you would expect for the price. It is not bad, but obviously not on the level of a Gameboy. The screen looks decent, but has a strange glare that almost looks like a green light in front of the screen from certain angles. The buttons feel pretty cheap and are a little crunchy.There is a ton of games divided into 6 different categories. None of the games that I have tried were very good though. With the amount available I am sure there are probably some gems, it just make take some time to find them.Overall I am completely neutral on this item. It is fair for the current price, but I wouldn't recommend it for over $20. If your expectations are set correctly I think you will be happy with it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian Severn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMUT4BKXZBD5PKSMOD2QHVHSKZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HKSRN735YSBF?ASIN=B0CLLY1LLJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Can't go wrong with this retro gaming hand held!",
                "reviewText": "These retro handheld video game consoles have gotten so ridiculously inexpensive we decided to order a few different ones to compare them. This one intrigued my 5 year old daughter the most because, it's pink!This retro hand held has a nice variety of classic games, and some I've never heard of, something for everyone for sure. For anyone that's played around with these retro mods, you get that there can be controller mapping issues, trial and error to controller operation that may be different for each game, some games may not even work, or whatnot, all quirks of these setups. This one seems to work pretty well. Haven't found any \"dead\" games yet, and they play nice once you figure out the controller mapping.My five year old is having a blast with it. This one gets props for using (and including) a rechargeable battery, along with a USB charging cable. It has a decent color screen, for the price [especially with the coupon!] this a bargain in my opinion!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany Gordon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOG3EYIWBJ4P3YSQZC4ND7BZPTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB1F99YJZJMGB?ASIN=B0CLLY1LLJ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "3.0 out of 5 stars Cute but a bit of a let down.",
                "reviewText": "My 4yo loves the color of this device and how easy it is for her to carry around. To me, it feels a little cheap. The most important part, however, is how well it entertains my little girl. She loves playing games but the games on this device were very hard to maneuver or figure out. Part of the problem is that the controls are not as responsive. Another part is that you don't see how to play the game. You just play and hope you end up doing something right.She ended up losing interest because she couldn't find a clear goal that she could achieve in the games she tried out. There are many games though so maybe there were better ones that she just didn't get through yet.I gave it 3 out of 5 because overall, it just didn't work for what we wanted. It's a very nice concept though and may work fine for somebody else.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. GrundmannD. Grundmann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG62UYNZ2W7NIEEEFELMOXSHEWXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNJPUN6YAXTYM?ASIN=B0CLLY1LLJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Fun toy for busy kids",
                "reviewText": "This is a fun little gaming device which includes games mostly from the 90's. They are not going to be main title games but a lot of them will be familiar when looking at that generation.There's a set of classics and mostly they are 2d games (runners/asteroids/etc style). The categories are well sorted between shooters to adventure/puzzle games. Navigating the menu system is straight forward, but nothing tells you that per category there are multiple pages, use the left/right to page.In terms of controls it's a reasonable setup. The left hand has essentially 2 d-pads that do the same thing, one just looks like a stick. The right has the typical buttons which for most games only one or two are used. There very much is a learning curve per game to figure out the controls which can be frustrating as there's no help or hints.My 10yr old loves to pick this up randomly to play games. He never asked for any kind of help on how to operate it so I presume the controls are intuitive enough to him coming from using a xbox style game controller.So far the battery has lasted several hours without needing to be recharged. It uses what looks like an old Nokia battery style (BL-5C) which is replaceable and purchasable via Amazon with a simple search.If you're looking for a low cost entertainment solution for a road trip/etc this would work very well for that.NOTE: The headphone jack that you see in the description pictures is not for headphones. This is for a TV out which no cable is provided. There are no headphone jacks",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/6122GPrhmjL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI6KKO5HJIO4XPBB24YLZC72Z7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B8WDVIDH8393?ASIN=B0CLLY1LLJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Nice starter game console",
                "reviewText": "This was the perfect starter handheld game console for kids. As a family of gamers, we wanted something for my niece who wants to play games, that wouldn't break easily. This was perfect - having tons of games but also durable and still a great price if something were to happen and we need to replace.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christeen RivaRigobert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFW3VFOPIBEKCM6THTBYWFY4TDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8TADRP20NF3F?ASIN=B0CLLY1LLJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful game for children in offices or long rides",
                "reviewText": "This is a really nice way to entertain children when on a long road drive or in a doctors office waiting room. With tons of games, soft feel control, volume control, and easy button access this game will keep your child busy for as long as it takes. It comes with its own rechargeable battery that take about an hour to fully charge by last pretty much all day. It comes with a manual for instructions and a pretty short charging cable. There is no charging block with this game.Yes, I’d recommend this game for toddlers from 2 up to children maybe 5 to 7 years of age. It’s an awesome game and gift idea.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "hammer5505",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQB5DE4Y4CY627TCHWGSOWEW6AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8CSAQIB3IHYS?ASIN=B0CLLY1LLJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars My 6 year old nephew is obsessed",
                "reviewText": "I gave this to my nephew as a Christmas gift and he is obsessed with it. Perfect for a 6 year old because the old-school games are simple and so much easier to learn than today's modern xbox or PS games. His mom said it's fabulous at the dinner table while they're waiting for food, or as a 'you get 30 minutes' treat on a rainy day. Highly recommend for elementary school kid who wants a device but is too young for a phone or a full system.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}