{
    "remaining_requests": 40535,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Nintendo-Switch-Neon-Blue-Joy%E2%80%91/dp/B07VGRJDFY",
    "body": {
        "name": "Nintendo Switch with Neon Blue and Neon Red Joy‑Con",
        "price": "$299.99",
        "originalPrice": "$299.99",
        "rawPrice": 299.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Nintendo-Switch-Neon-Blue-Joy%E2%80%91/dp/B07VGRJDFY",
        "soldBy": {
            "sellerID": "A2NJJS65JSTOFD",
            "name": "Always Innovating",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2NJJS65JSTOFD&asin=B07VGRJDFY&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ePdv dhwL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41wPUFD3mhL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da25d045-1b8f-43ab-942f-e7369c3f8d4c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/354efda8-8cfd-486f-8139-6f7ba84410a2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e3da9e61-811a-4826-ba32-1c14007621fc/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dd0bc9e6-16a9-45ad-a25e-767a51688fb1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e3590e6f-0bd3-47b0-956d-7340b629d56a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7f54cf11-d038-4da7-84d5-37d9f6ee6ab6/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7941537d-c33f-4b62-b5c7-ba1c823c837b/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 7,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Nintendo Store",
            "link": "https://www.amazon.com/stores/Nintendo/page/BE0EB5D0-0AD6-4564-8BC5-4A129A3A9CFD?ref_=ast_bln"
        },
        "brand": "Nintendo",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 79733,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 20 - 22.",
            "Or fastest delivery Tomorrow, February 14. Order within 11 hrs 31 mins.",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "3 Play Styles: TV Mode, Tabletop Mode, Handheld Mode",
            "6.2-inch, multi-touch capacitive touch screen",
            "4.5-9 plus Hours of Battery Life will vary depending on software usage conditions",
            "Connects over Wi-Fi for multiplayer gaming; Up to 8 consoles can be connected for local wireless multiplayer",
            "Model number: HAC-001(-01)"
        ],
        "description": "Get the gaming system that lets you play the games you want, wherever you are, however you like. Includes the Nintendo Switch console and Nintendo Switch dock in black, with contrasting left and right Joy‑Con controllers-one red, one blue. Also includes all the extras you need to get started. Model number: HAC-001(-01) (product serial number begins with “XKW”) This model includes battery life of approximately 4.5 - 9 hours. The battery life will depend on the games you play. For instance, the battery will last approximately 5.5 hours for The Legend of Zelda: Breath of the Wild (games sold separately). Introducing Nintendo Switch, the new home video game system from Nintendo. In addition to providing single and multiplayer thrills at home, the Nintendo Switch system can be taken on the go so players can enjoy a full home console experience anytime, anywhere. The mobility of a handheld is now added to the power of a home gaming system, with unprecedented new play styles brought to life by the two new Joy-Con controllers.PLAY ANYWHEREHome Gaming SystemAt home the main unit rests in the Nintendo Switch dock, which connects the system to the TV and lets you play with family and friends in the comfort of your living room.On-the-GoLift Nintendo Switch from the dock and instantly transition to handheld mode for on-the-go gaming. By sharing Joy-Con, players can go head-to-head while away from home. You can also enjoy the same great games in tabletop mode by using the included stand to prop the system up.New Play StylesRemove the detachable Joy-Con from either side of Nintendo Switch for more play styles:One player can use a Joy-Con in each handTwo players can each take oneMultiple Joy-Con can be employed by numerous people for a variety of gameplay options (additional Joy-Con sold separately)Slip a set of Joy-Con into a Joy-Con grip accessory, mirroring a more traditional controller. Or, select an optional Nintendo Switch Pro Controller. Bring together up to 8 Nintendo Switch systems for local face-to-face multiplayer. Are Parental Controls available for the Nintendo Switch console? Yes, a robust set of options is included to help both parents and kids have the best possible gaming experience. Parents can set controls on the system, or use the free Nintendo Switch Parental Controls app to set restrictions on games and purchases, monitor gaming time, and more.",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b?ie=UTF8&node=468642"
            },
            {
                "name": "Nintendo Switch",
                "link": "https://www.amazon.com/Nintendo-Switch/b?ie=UTF8&node=16227128011"
            },
            {
                "name": "Consoles",
                "link": "https://www.amazon.com/b?ie=UTF8&node=16227130011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.7 x 13.82 x 7.87 inches"
            },
            {
                "name": "Item Weight",
                "value": "10.2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07VGRJDFY"
            },
            {
                "name": "Item model number",
                "value": "Nacional"
            },
            {
                "name": "Batteries",
                "value": "2 AA batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 79,733 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,835 in Video Games (See Top 100 in Video Games) #19 in Nintendo Switch Consoles"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "Yes"
            },
            {
                "name": "Date First Available",
                "value": "August 29, 2019"
            },
            {
                "name": "Manufacturer",
                "value": "Nintendo"
            },
            {
                "name": "Platform",
                "value": "Nintendo Switch"
            },
            {
                "name": "Input Device",
                "value": "Gamepad"
            },
            {
                "name": "Brand",
                "value": "Nintendo"
            },
            {
                "name": "Model Name",
                "value": "Nintendo Switch"
            },
            {
                "name": "Color",
                "value": "Neon Blue and Red"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Check out what's inside the box",
                "media_link": []
            },
            {
                "media_text": "Three modes in one Nintendo Switch is designed to fit your life, transforming from home console to portable system in a snap This is Joy-Con The included Joy-Con controllers give you total gameplay flexibility. TV Mode Dock your Nintendo Switch to enjoy HD gaming on your TV. Handheld Mode Pick it up and play with the Joy-Con controllers attached. Tabletop Mode Flip the stand to share the screen, then share the fun with a multiplayer game",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Additional games and/or systems may be required for multiplayer mode. Games and systems sold separately. Nintendo Switch Lite plays all games that support handheld mode.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/152b28e4-d111-49cc-aef7-717742fbc491.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/405ae78d-20a0-4255-bc55-be18f5dfb17d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6d8181e3-e269-484f-9443-beaac22dee96.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1968bdc9-67e7-425d-bda6-c3441b5630ad.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/81aa7fe2-5024-4a61-aa6a-729970fcbafc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4025389e-c7f9-43e2-8837-a7a43d23c0e6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ddeb9b0b-68c9-49f8-9c5b-96ae943b17b4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a7277cc6-7819-4682-8636-b78b0909be8e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0061353e-4a58-4aaa-971c-1e88c31f6b7c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/681a440d-2055-4a52-9964-7ab6b645b671.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c302d8d4-8007-47f7-9ef1-94ee93b0edbc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "David",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5VWFJ6MGK3C2XSVD5IPCMQ6VHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SLFSU6WZRKU8?ASIN=B07VGRJDFY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Another amazing product by nintendo",
                "reviewText": "Nintendo has nailed the portability game. I purchased this product as a portable gaming device for when I don't want to bust out my laptop. It works like a dream. Super easy to use and set up.Pros:Portability: 5/5I can bring this thing practically anywhere. It fits in my pocket in a pinch, but I don't think I'd ever want to transport it that way. Very lightweight and all you need is the console. Pick it up, go wherever and play however you want.Screen: 4/5Not as nice as the new oled screen, but I wanted the smaller model. I know that might be strange for some, but I prefer the portability. The screen is still quite good. Clear and sharp images at 60hz.Battery life: 5/5I can play for a couple hours a day and have to recharge it every 3 days or so. If you play all day every day then it will probably only last you a single day, but you're going to be hard pressed to find a gaming machine that lasts you multiple days playing all day.Cons:Default stand isn't great: 3/5The little plastic stand that you can use to prop up the switch isn't amazing. I don't really use it so it's not a big deal to me, but it has absolutely no stability and unless you're playing on a flat surface that isn't moving then you're going to have a bad time.TLDR: If you want a Nintendo portable console then pull the trigger. These things are amazing and even when a new system comes out I don't see myself getting rid of this thing.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thoughts.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ7BETQAZ3QHP3W5B2GSQ6NEMAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30FKHEVP57IY6?ASIN=B07VGRJDFY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Interactive and tons of fun!",
                "reviewText": "How can you not love the switch! So much fun and way more fun than scrolling your phone all day.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Keonyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOQW22ILHQGZ5IELCXX5KWSX32Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Q6Y4YHYFCUXO?ASIN=B07VGRJDFY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 7, 2021",
                "reviewTitle": "5.0 out of 5 stars Nintendo's best console in a long time",
                "reviewText": "Sure, it's no PS4 or PS5, but it's an incredible little machine with such incredible versatility in such a tiny package. While it might not have the pure processing power and graphics capability of the other two major systems it does do what Nintendo has done best for a long time, provide a reasonably priced quality portable gaming system. The advantage this time is that the Switch is both a home console and a portable console in one unit. This is something that consoles in general have never really been able to do until now and it's amazing how great the game quality is even in this small form factor.I mean, the Wii was good in the motion control but the gimmick did wear after a bit. The WiiU really felt like a disappointment in that it just didn't bring much to the table and Nintendo clearly wasn't going to be able to compete in the home console market against the other two juggernauts. What Nintendo has always been great at though is dominating the portable gaming market and the switch sees them bringing their expertise in the portable market to the home console market in a power play that really paid off in my opinion.Now, this system does still suffer from some of Nintendo's generally less favorable business practices so do take that in to account. The price for the Switch itself actually isn't that unreasonable so I don't fault them for that whatsoever. The peripherals, on the other hand, really put a dent in the pocketbook if you need to buy anything that didn't come in the box (and you probably will need to at some point, let's be honest). The price of games also comes at a premium just as it has with past Nintendo systems as you will rarely see even older games every discounted or put on sale while such things are very common with the the competing systems. For instances, \"Zelda: Link's Awakening\", which has roughly 13 to 15 hours of content, will still cost you $60 which is incredibly high for a game that offers so little content with little replay value. Sadly Nintendo has a tendency of doing this and always has so do be prepared to pay premium prices for most games with the Switch.All in all I still think the unit is worth it particularly since you just can't find a better portable gaming platform than this. I definitely recommend getting the Switch over the Switch Lite as those are fully integrated and if you bust an analog stick or a button you're pretty much screwed. With a Switch you can replace the side controllers as you need and we all know controller buttons and analog sticks can wear over time so that alone is worth it. I mean, for $100 more you get a heck of a lot better of a system than you do with a lite so I highly recommend going this route if you're looking in to a Switch.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wesley mcgee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKU7LEVQUJ2OJC7MJB6MXZVOW7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EM1DTRZS7B2Q?ASIN=B07VGRJDFY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Came on time.",
                "reviewText": "Love Ninetendo products. Always top notch. Got this one as secondary unit for upstairs in mancave. 🤣",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shirley campbell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3CF2THPLBI23VSYV7EJOPO4SOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24D8CAAD3AQM9?ASIN=B07VGRJDFY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Great gaming system, but the Asurion plan isn't worth buying",
                "reviewText": "My grandson loves it! Worked like a charm for a year and half until the battery stopped holding a charge. I purchased the Asurion protection plan because it said it would cover all malfunctions. However, when I tried to submit a claim, it said it wasn't covered. So, the gaming system is worth buying, but don't waste your money on the protection plan. (Game Stop's protection plan is way better!)",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSSHPP7VQRWVDRV2SX3DGX5MELA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBJX5JSTJ5YM5?ASIN=B07VGRJDFY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2020",
                "reviewTitle": "5.0 out of 5 stars Buy it for the exclusives or don't buy it at all.",
                "reviewText": "If you look at Nintendo's list of exclusive games and think, \"Yeah, I'm all about that\", dive in. This is a fun console that offers play on your TV screen or handheld (switch... duh). With multiple controller configuration options including extra peripherals that will make your controller become a steering wheel, a golf club, a fishing pole, and a fitness ring just to name a few, there is a lot of fun and creativity built into Nintendo's latest console.Add to all of this, with a Nintendo Online subscription you get access to tons of free and low cost games. They have included a virtual NES and SNES console with a good selection of classic games. There are also other free games like Tetris 99 and the new Super Mario 35 which are loads of fun. There are also lots of other games that can be had for as little as $2.99If however you're looking for a console to play the latest cross platform hits, you're probably better off with a PC or one of the next gen gaming consoles. Playing a big cross platform game, you will notice a difference in graphics quality. The Switch only displays in HD, while every other console (and pc) is up to 4K now. Plus the Nintendo controllers, while fun and creative, will not hold up to long term play for something like a FPS. They are fun controllers, and work perfectly for the Nintendo games, but they feel like they would ultimately break after a few serious button mashing sessions. If you've seen all the drama about controller drift, you now know why.Bottom line is if you're all about Nintendo exclusives like Mario, Zelda, Animal Crossing, Metroid? (please?), get this console. It will provide a great deal of entertainment. If you're trying to play the big gaming hits available across all consoles and PC, there are better options.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIOCLURT33KHR4NKQPY6JYPNEUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X4JPPCB1VA79?ASIN=B07VGRJDFY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Popular and fun game",
                "reviewText": "Easy to take on the road with",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 8, 2024",
                "reviewTitle": "La mejor consola portatil",
                "reviewText": "Excelente. Buen precio. Buen catálogo de juegos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FelipeFelipe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 15, 2022",
                "reviewTitle": "É bom. E não é pouco bom.",
                "reviewText": "O Switch é FINO!Muito bem construído, embalado e agradável na hora de jogar, principalmente se forem indies e jogos de plataforma no geral. A tela é bonita, brilhosa, bem grandona (usando um iphone SE de 2a geração talvez eu esteja enviesado) e definitivamente NÃO torna esse console portátil. Você com certeza precisará carregar ele dentro de alguma bolsa, mas o tamanho da tela compensa esse fator.Os Joycon são maravilhosos e muito bem acabados. Costumo jogar no PC utilizando um dualsense, então minha expectativa não era exatamente baixa para esse componente. O dock é muito fácil de utilizar, cumprindo a função numa boa.Não custa barato. Mesmo com a moeda não valendo nada atualmente, ele seria naturalmente um console mais caro do que o normal devido ao acabamento. O 3DS é um brinquedo perto do Nintendo Switch.Baita console guys. Os caras inovaram.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7172-GJd4pL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61xctSCEUML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61uReu0--9L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dhaval Patel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 10, 2020",
                "reviewTitle": "It's Worth The Money!!",
                "reviewText": "The Nintendo Switch is the best!! It's portable, light weight, and perfect for gaming on the go. The unboxing and setup experience was easy and straight forward. It has lots of fun games and Nintendo exclusives making it a great gaming system. The battery lasts long and the product itself feels very high quality too. I use my Switch mostly in handheld mode but playing in TV mode is just so much better because of the 1080p output and bigger screen. The joy-cons feel very nice in the hand and the HD rumble makes the games feel so much more immersive. The dock is also not as big as I thought it would be and it doesn't take up much space either. There is even a HDMI cable included so even if you don't have a spare one, you don't have to worry because it's already included in the box.Also another thing to note, the Switch does not have a built in microphone, so in order to voice chat with your friends in online games like Fortnite, you have to connect a pair of headphones that have a mic, use a gaming headset, or use the Nintendo Switch Online app on your phone or tablet. Some games also require the Nintendo Switch Online Subscription in order to play online but its very cheap and affordable at only $4.99/month or $24.99/annually. I am glad that Nintendo has chosen to keep the online subscription prices so low!The Nintendo Switch and its games are expensive but I am glad I bought it because it's worth the money and gives you so many hours of play time.",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnzuAnzu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on December 4, 2023",
                "reviewTitle": "Pretty good, recommended",
                "reviewText": "Been almost a year since i got it, i enjoy playing with it and no issues so far! Pretty worth it, bought it with a friend when it was on sale!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61WHNECL2JL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rodrigo Klaim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 21, 2023",
                "reviewTitle": "Produtor perfeito.",
                "reviewText": "Produto veio em perfeito estado, com todas as peças inclusas e caixa lacrada e intacta.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$299.99",
                "sellerName": "Greener Sales",
                "sellerRating": "5"
            },
            {
                "price": "$299.99",
                "sellerName": "LO Store (We Record Serial Numbers To avoid FRAUD)",
                "sellerRating": "5"
            },
            {
                "price": "$299.99",
                "sellerName": "Sole Providers",
                "sellerRating": "4.5"
            }
        ]
    }
}