{
    "remaining_requests": 26521,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/8212560-8269145-Kit-Beaquicy-Kitchen-Aid/dp/B08JLSS7SN",
    "body": {
        "name": "Upgrade 8212560 & 8269145 Dishwasher Side Mounting Bracket Kit with Screws by Beaquicy Fit for Kenmore, Whirlpool, Kitchen-Aid Dishwasher du1010xtxq5 kdtm404ess3 wdf310plaw3 gu2275xtvb0 kudc10fxss7",
        "price": "$7.89",
        "originalPrice": "$8.99",
        "rawPrice": 7.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/8212560-8269145-Kit-Beaquicy-Kitchen-Aid/dp/B08JLSS7SN",
        "soldBy": {
            "sellerID": "A22BDCX4SUNGSV",
            "name": "YKZ SUPPLIER",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A22BDCX4SUNGSV&asin=B08JLSS7SN&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "Buy 3, Save 10%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41rB6hANKJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41DECfSWUTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31IC4othn L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/319GL7SDPbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51aXzcNl EL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rRcIW5W9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411CWRDfIVL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Beaquicy Store",
            "link": "https://www.amazon.com/stores/Beaquicy/page/3356F20B-A385-4623-960D-AC52CBA1670E?ref_=ast_bln"
        },
        "brand": "Beaquicy",
        "merchantInfo": "YKZ SUPPLIER",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 251,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 12 hrs 42 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【8212560 & 8269145 DISHWASHER MOUNTING BRACKET KIT】 - Includes 2 x 8212560 Dishwasher Mounting Brackets with 4 x Black Installation Screws, 2 x 8269145 Dishwasher Upper Brackets with 2 x Silver Installation Screws. Black and silver, different colors, and slightly different style/design. The 8269145 & 8212560 Dishwasher Side Mounting Bracket Kit secure the upper side of the dishwasher to the underside of the counter or cabinet. ➤8212560 & 8269145 Dishwasher Mounting Bracket can fix the FOLLOWING SYMPTOMS: The old one is damaged. Dishwasher moves. Dishwasher falling off cabinet. Dishwasher will tilt forward. Door latch failure. Door won’t close.",
            "【HIGH QUALITY】 - 8212560 & 8269145 Dishwasher Side Mounting Bracket Kit is made of high quality, durable materials that have been rigorously tested by the manufacturer to meet OEM standards to ensure long-lasting, effective performance. High quality materials make the 8269145 & 8212560 Dishwasher Side Mounting Bracket Kit with Screws stronger and less likely to bend and break under the weight of the dishwasher itself. The ability to maintain a long-lasting and effective action improves product longevity and reduces the number of replacements.",
            "【REPLACEMENT PART No.】 - The 8212560 & 8269145 Dishwasher Side Mounting Bracket Kit with Screws Replacement can replace for Whirlpool, Kenmore, Crosley, Maytag, Amana, Kitchen-Aid, Jenn-Air, Estate, Inglis, Roper and other dishwasher brands. ➤8212560 Undercounter Mounting Bracket replace: 1201084, AP3953705, PS1487167, EAP1487167, etc. ➤8269145 replace: WP8269145VP, AP3039168, PS393134, AH393134, EA393134, 830941, PS11745496, EAP11745496, etc.",
            "【WIDE COMPATIBLE】 - The 8212560 & 8269145 Dishwasher Bracket Mounting Kit Compatible with: kdfe104hbl0, kdtm404ess3, kdte254ess2, kdtm504epa2, kudc03fvwh3, kudc10fxss7, kude20ixss3, kude40fxbl4, kude40fxwh1, gu2275xtvb0, gu2275xtvq1, gu3200xtxq4, gu2275xtvy3, gu2300xtvb0, gu2300xtvq3, gu2300xtvs0, gu2475xtvb0, gu2800xtvb1, du1300xtvs8, du1010xtxq5, du1014xtxt5, du1015xtxb0, du1014xtxb1, wdf111pabb2, wdf310plaw3, wdf730payt6, mdbh979sab0, mdbh979saq0, mdbh979saw0, mdbh949pam0, etc.",
            "【FIT MANY MODELS】 - The 8212560 & 8269145 Dishwasher Side Mounting Bracket Kit can also fits the following models: 66512833K311, 66513253K110, 66513922K010, 66513923K010, 66513929K010, 66513942K015, 66513943K014, 66513943K015, 66513944K014, 66513944K015, 66513949K014, 66513964K014, 66513969K014, 66514043K010, 66514043K014, 66512093K210, 66512413N410, 66512413N411, 66512413N412, 66512723K310, 66512723K311, 66513009N511, 66513009N510, 66513004N511, 66513004N510, 66513003N511, etc.",
            "【EASY TO INSTALL】 - The installation of 8212560 & 8269145 dishwasher mounting bracket with screws are simple. Before installation, please disconnect the power and water supply and put on working gloves. Determine the position of the mounting brackets, insert the mounting brackets into the rack, screw them through the round holes in the brackets and fix them in the cabinet. NOTE: Make sure that the dishwasher does not wobble. If it does, please continue to tighten the screws. ➤Durable 8212560 & 8269145 Dishwasher Side Mounting Bracket Kit with Screws is quick and easy to install, all you need is a screwdriver. You can have a working dishwasher in just a few minutes, and it's a great option!",
            "【LIFETIME WARRANTY】 - The 8212560 & 8269145 Whirlpool Dishwasher Side Mounting Bracket Kit support LIFETIME return and exchange. During the warranty period, if the 8212560 & 8269145 Dishwasher Side Mounting Bracket Kit has quality problem or other reasons, we support refund or exchange. If you have any questions, come and contact us and we will answer them as soon as possible. The models in the page are not all the applicable models of the product, if you have any questions about the suitability of the 8212560 & 8269145 dishwasher mounting bracket kit, please come and consult us."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2619525011"
            },
            {
                "name": "Parts & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3741181"
            },
            {
                "name": "Dishwasher Parts & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3741201"
            },
            {
                "name": "Hoses",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2232357011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎Beaquicy"
            },
            {
                "name": "Model Info",
                "value": "‎8212560 8269145 Mount Kit"
            },
            {
                "name": "Item Weight",
                "value": "1.92 Ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎3 x 1 x 2 inches"
            },
            {
                "name": "Item model number",
                "value": "‎8212560 8269145 Mount Kit"
            },
            {
                "name": "Installation Type",
                "value": "‎Screw-In"
            },
            {
                "name": "Part Number",
                "value": "‎8212560 & 8269145"
            },
            {
                "name": "Special Features",
                "value": "‎8269145 dishwasher upper brackets with 2 pcs silver installation screws, secures the upper side of the dishwasher to the underside of the counter or cabinet to prevent the dishwasher from moving, shaking, or tilting forward., 8212560 Dishwasher Side Mounting Bracket Kit with 4 pcs black installation screws, secures the top of the dishwasher to the side of the cabinet."
            },
            {
                "name": "Color",
                "value": "black and silver"
            },
            {
                "name": "Material Type",
                "value": "‎Metal"
            },
            {
                "name": "Included Components",
                "value": "‎8269145 Dishwasher Mounting Bracket Kit, 8212560 Dishwasher Side Mounting Bracket Kit"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "Manufacturer Warranty",
                "value": "‎Beaquicy 8212560 & 8269145 Dishwasher Mounting Bracket Side Kit support 365 DAYS return and exchange."
            },
            {
                "name": "ASIN",
                "value": "B08JLSS7SN"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 251 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#39,664 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #54 in Dishwasher Replacement Hoses"
            },
            {
                "name": "Date First Available",
                "value": "September 21, 2020"
            },
            {
                "name": "Brand",
                "value": "Beaquicy"
            },
            {
                "name": "Material",
                "value": "Metal"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Compatiblity Kenmore: 66213012K112, 66213013K112, 66213014K112, 66213019K112, 66213023K112, 66213033K112, 66213039K112, 66213042K112, 66213043K112, 66213044K112, 66213049K112, 66213272K112, 66213273K112, 66213279K112, 66213282K112, 66213283K112, 66213289K112, 66213292K112, 66213293K112, 66213299K112, 66513362K110, 66513362K111, 66513362K112, 66513363K110, 66513363K111, 66513363K112, 66513369K110, 66513369K111, 66513369K112, 66513402N410, 66513403N410, 66513409N410, 66513412K701, 66513413K701, 66513419K701, 66513452K901, 66513452K902, 66513453K901, 66513453K902, 66513459K901, 66513459K902, 66513462K900, 66513462K901, 66513462K902, 66513462K903, 66513463K900, 66513463K901, 66513463K902, 66513463K903, 66513469K900, 66513469K901, 66513469K902, 66513469K903, 66513472K900, 66513472K901, 66513472K902, 66513472N410, 66513472N411, 66513473K900, 66513473K901, 66513473K902, 66513473N410, 66513473N411, 66513479K900, 66513479K901, 66513479K902, 66513362K110, 66513362K111, 66513362K112, 66513363K110, 66513363K111, 66513363K112, 66513369K110, 66513369K111, 66513369K112, 66513402N410, 66513403N410, 66513409N410, 66513412K701, 66513413K701, 66513419K701, 66513452K901, 66513452K902, 66513453K901, 66513453K902, 66513459K901, 66513459K902, 66513462K900, 66513462K901, 66513462K902, 66513462K903, 66513463K900, 66513463K901, 66513463K902, 66513463K903, 66513469K900, 66513469K901, 66513469K902, 66513469K903, 66513472K900, 66513472K901, 66513472K902, 66513472N410, 66513472N411, 66513473K900, 66513473K901, 66513473K902, 66513473N410, 66513473N411, 66513479K900, 66513479K901, 66513479K902, 66213012K112, 66213013K112, 66213014K112, 66213019K112, 66213023K112, 66213033K112, 66213039K112, 66213042K112, 66213043K112, 66213044K112, 66213049K112, 66213272K112, 66213273K112, 66213279K112, 66213282K112, 66213283K112, 66213289K112, 66213292K112, 66213293K112, 66213299K112 Whirlpool: GU2275XTVB0, GU2275XTVB1, GU2275XTVB2, GU2275XTVB3, GU2275XTVQ0, GU2275XTVQ1, GU2275XTVQ2, GU2275XTVQ3, GU2275XTVY0, GU2275XTVY1, GU2275XTVY2, GU2275XTVY3, GU2300XTVB0, GU2300XTVB1, GU2300XTVB2, GU2300XTVB3, GU2300XTVQ0, GU2300XTVQ1, GU2300XTVQ2, GU2300XTVQ3, GU2300XTVS0, GU2300XTVS1, GU2300XTVS2, GU2300XTVS3, GU2300XTVT0, GU2300XTVT1, GU2300XTVT2, GU2300XTVT3, GU2475XTVB0, GU2475XTVB1, GU2475XTVB2, GU2475XTVB3, GU2475XTVQ0, GU2475XTVQ1, GU2475XTVQ2, GU2475XTVQ3, GU2475XTVY0, GU2475XTVY1, GU2475XTVY2, GU2475XTVY3, GU2800XTVB0, GU2800XTVB1, GU2800XTVB2, GU2800XTVB3, GU2800XTVQ0, GU2800XTVQ1, GU2800XTVQ2, GU2800XTVQ3, GU2800XTVS0, GU2800XTVS1, GU2800XTVS2, GU2800XTVS3, GU2800XTVT0, GU2800XTVT1, GU2800XTVT2, GU2800XTVT3, GU2800XTVY0, GU2800XTVY1, GU2800XTVY2, GU2800XTVY3, DU1010XTXB0, DU1010XTXB1, DU1010XTXB2, DU1010XTXB3, DU1010XTXB5, DU1010XTXD0, DU1010XTXD1, DU1010XTXD2, DU1010XTXD3, DU1010XTXD5, DU1010XTXQ0, DU1010XTXQ1, DU1010XTXQ2, DU1010XTXQ3, DU1010XTXQ5, DU1010XTXT0, DU1010XTXT1, DU1010XTXT2, DU1010XTXT3, DU1010XTXT5, DU1014XTXB0, DU1014XTXB1, DU1014XTXB2, DU1014XTXB3, DU1014XTXB4, DU1014XTXB5, DU1014XTXD0, DU1014XTXD1, DU1014XTXD2, DU1014XTXD3, DU1014XTXD4, DU1014XTXD5, DU1014XTXQ0, DU1014XTXQ1, DU1014XTXQ2, DU1014XTXQ3, DU1014XTXQ4, DU1014XTXQ5, DU1014XTXT0, DU1014XTXT1, DU1014XTXT2, DU1014XTXT3, DU1014XTXT4, DU1014XTXT5, DU1015XTXB0, DU1015XTXB1, DU1015XTXB2, DU1015XTXB3, DU1015XTXB4, DU1015XTXB5, DU1015XTXD0, DU1015XTXD1, DU1015XTXD2, DU1015XTXD3, DU1015XTXD4, DU1015XTXD5, DU1015XTXQ0, DU1015XTXQ1, DU1015XTXQ2, DU1015XTXQ3, DU1015XTXQ4, DU1015XTXQ5, DU1015XTXS0, DU1015XTXS1, DU1015XTXS2, DU1015XTXS3, DU1015XTXS4, DU1015XTXS5, DU1015XTXT0, DU1015XTXT1, DU1015XTXT2, DU1015XTXT3, DU1015XTXT4 Kitchen-Aid: KUDE20FXBL4, KUDE20FXSS4, KUDE20FXWH4, KUDE20IXBL3, KUDE20IXBL6, KUDE20IXBL8, KUDE20IXSS3, KUDE20IXSS6, KUDE20IXSS8, KUDE20IXWH3, KUDE20IXWH6, KUDE20IXWH8, KUDE40FXBL3, KUDE40FXBL4, KUDE40FXBL5, KUDE40FXWH1, KUDE40FXWH3, KUDE40FXWH5, KUDE20FXBL4, KUDE20FXSS4, KUDE20FXWH4, KUDE20IXBL3, KUDE20IXBL6, KUDE20IXBL8, KUDE20IXSS3, KUDE20IXSS6, KUDE20IXSS8, KUDE20IXWH3, KUDE20IXWH6, KUDE20IXWH8, KUDE40FXBL3, KUDE40FXBL4, KUDE40FXBL5, KUDE40FXWH1, KUDE40FXWH3, KUDE40FXWH5 Maytag: MDBH949PAM0, MDBH949PAW0, MDBH979SAB0, MDBH979SAQ0, MDBH979SAW0, MDBH949PAM0, MDBH949PAW0, MDBH979SAB0, MDBH979SAQ0, MDBH979SAW0",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/150cfe7e-ecab-4357-8ddd-6ee704e5d3bd.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "8212560 Dishwasher Side Mounting Bracket Kit with 4 pcs black installation screws.For plastic Tall-Tub dishwashers. 8212560 dishwasher side mounting bracket secures the dishwasher top to the side of the cabinet. 8269145 dishwasher upper brackets with 2 pcs silver installation screws to mount dishwasher to the bottom side of the countertop. 8269145 metal bracket secures the upper side of the dishwasher to the underside of a counter or cabinet to prevent the dishwasher from moving, shaking or tipping forward. The 8212560 & 8269145 whirl-pool dishwasher mounting bracket kit is suitable for Whirl-pool, Ken-more, A-mana, May-tag, Kitchen-Aid, Cros-ley dishwasher. 8212560 Side Mounting Bracket Kit replaces: 1201084, AP3953705, PS1487167, EAP1487167, etc. 8269145 Mounting Bracket replaces: WP8269145, WP8269145VP, 830941, AP6012289, PS11745496, EAP11745496, etc. 8212560 & 8269145 Dishwasher Mounting Bracket Side Kit with Screws fixes below symptoms: NoisyWill not startWill not tumbleDoor latch failureDoor won't close",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d0c61e71-d821-4b8a-8dfb-dfb3b623d1de.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d233b558-7609-4e8d-aeda-cb08acd24a71.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b15d799-1370-4d29-8513-718a883984e4.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Part Description Brand: Beaquicy Condition: 100% New Package Includes: 2 x 8212560 dishwasher mounting brackets with 4 x black installation screws 2 x 8269145 dishwasher upper brackets with 2 x silver installation screws",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e0fb61a0-f445-4b52-b88d-c41560df802a.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Easy to Install Tools Needed: Screwdriver Installation Tips: Turn off the power and water supply valve, disconnect the water supply line from the water inlet valve, and release the power cord from the junction box.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d9c13a47-de22-4992-a54d-00388f6720b4.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "8269145 Undercounter Dishwasher Mounting Bracket with Screws 5001DD4001A Dishwasher Mounting Bracket Kit DD94-01002A Assembly-Install Kit W10518394 W10134009 Dishwasher Heating Element 165314 Dishwasher Rack Wheel Functions 8269145 dishwasher brackets for whirl-pool is used to secure your dishwasher to the underside of a kitchen counter. It prevents the dishwasher from tipping over when you slide out the racks. 5001DD4001A Dishwasher Mounting Brackets include two brackets, a hose clamp, and two screws. The brackets are perforated so they can be cut or broken to the desired length if they stick out from underneath the countertop. DD94-01002A assembly-install kit is used to secure your dishwasher to the underside of a kitchen counter. It prevents the dishwasher from tipping over when you slide out the racks.The package includes 2 Brackets And 6 Screws(3 Different Sizes). W10518394 ken-more dishwasher heating element heats the water during the dishwashing cycle. It helps dry the dishes at the end of the cycle.The package includes 1 x W10518394 Heating Element, 2 x heater fasteners. 165314 Bosch Dishwasher Basket Wheels are designed for use in the lower rack of a dishwasher, allowing the rack to be easily pushed in and out of your appliance. Product includes 8 x 165314 Dishwasher Lower Rack Wheels. Compatiblity Brand Ken-more, Kitchen-Aid L-G Sam-sung Cros-ley, Estate, Ken-more, Kitchen-Aid, May-tag, Whirl-pool Bos-ch, Ken-more Replacement Part Number 66514742N511 66514743N511 66514749N511 66514812N610 66514813N610 66514815N610 66514819N610 66512413N412 66513002N510 66513003N510 66513004N510 66513009N510 66513073K217 66513092N412 LDF7932ST LDF6810BB LDF6810BB-01 LDF6810BB-02 LDF6810ST LDF6920BB LDF7932ST, LDF7811ST LDF7811ST-01 LDF6920BB LDF6920ST DMT400RHS/XAA, DW80F600UTS/AA-01, DMR78AHS/XAA-00, DW80K5050US/AA-00, DW80K5050US/AA-01, DW80K5050US/AA-02, DW80K5050US/AA-03, DW80F600UTB/AA-01, DW80F600UTW/AA-01, DW80K5050UG/AA-00, DW80F800UWS/AA-01, DW80K7050UG/AA-00, DW80J3020US/AA-00 66513289K114, 66513289K115, 66513289K116, 7WDF530PAYM5, 7WDF530PAYM6, 7WDT770PAYM0, MDB6709AWS3, MDB6709AWS4, MDBH949AWW4, CUD6710XB0, CUD6710XB1, CUD6710XB2, CUD6710XB3, IUD8100YS0, IUD8100YS1, IUD8100YS3, ADB1300AFB0, ADB1300AFS0, ADB1300AFS1 SHE43M02UC/50, SHE43M02UC/52, SHE43M02UC/53, SHU6805UC/14, SHE33M05UC/46, SHE33M05UC/47, SHE33M05UC/48, SHE33M05UC/50, SHE33M05UC/52, 63016302403, 63016302404, 63016302405, 63016302406, 63016303400, 63016303401, 63016303402, 63016303403, 63016303404",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2a2822bc-37c8-4f08-b64e-6989d3718cce.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/150cfe7e-ecab-4357-8ddd-6ee704e5d3bd.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d0c61e71-d821-4b8a-8dfb-dfb3b623d1de.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d233b558-7609-4e8d-aeda-cb08acd24a71.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b15d799-1370-4d29-8513-718a883984e4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e0fb61a0-f445-4b52-b88d-c41560df802a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d9c13a47-de22-4992-a54d-00388f6720b4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6717c5db-3744-4cec-9826-bdb82678eebe.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8a4d150a-ff7a-482f-bb62-b5dd7d6cf355.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9eae76de-3bd9-4294-b92b-81d4008b1fe9.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c228f518-6821-4f6d-bdce-9390c2755211.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c094e69b-6517-4419-aced-9b69a9971305.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "KO",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHA6XQQISCXX4JC4ETODC3Q4NHYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X2EA4QHGNK7G?ASIN=B08JLSS7SN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Dishwasher side mount securing plates",
                "reviewText": "Work well. Easy installing. Just like the OEM PARTS.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lance D Hammerdorfer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWGX6UVE522E44DPDMULF3MGLWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R128412DAPFKXD?ASIN=B08JLSS7SN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2023",
                "reviewTitle": "5.0 out of 5 stars worked as advertised",
                "reviewText": "Putting in a dishwasher, my girlfriends house, and somehow they lost these. These worked really well and they're cheaper than buying them from Lowe's or Home Depot.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John CookJohn Cook",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6ITHXJCSDX2JG6OX2WJ3ZMQ7OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLIX61A321976?ASIN=B08JLSS7SN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2023",
                "reviewTitle": "4.0 out of 5 stars Works on Whirlpool WDF750SAYB3 with modifications",
                "reviewText": "These were about 5x cheaper than an OEM bracket that was on another site. The Amazon pics looked a little bit different than what came with my dishwasher. But the other site's looked the same as Amazon, so I figured I'd have to make modifications either way.I had to bend the tabs back 90°, drill a new hole, and cut off the rounded top. But it wasn't too hard and worked out well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714rr5KA0ZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71fvEZCrX1L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pMQGVcQEL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonathan M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXJJJ4LVSE4VYKABOAMFQWNLTLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHA59AA1Z970B?ASIN=B08JLSS7SN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Works as described",
                "reviewText": "Easy to install simple and clean",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RZRRick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHD5CVCJHCABSZVOLLEVYH4DDYTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV2D8L9VEFPQG?ASIN=B08JLSS7SN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Works as described!",
                "reviewText": "I bought a used dishwasher, and needed these to complete the installation. It worked great!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allison",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEAUP47IFY2NVSPLOLTOTSYIS4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16HCSQI42F2MJ?ASIN=B08JLSS7SN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Just what we needed",
                "reviewText": "Amazing. Black side pieces needed a little influence from the hammer to fit, but other than that, works perfectly. Whirlpool sells one top bracket for about $20. Definitely worth the money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phillip Forrest",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6UHXGIGBXMZBB2L3MYF3UNJVCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CVOZ6TNNWX7H?ASIN=B08JLSS7SN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Worked perfectly",
                "reviewText": "Easy to install- worked perfectly",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBYU4XSIH4F3IRR4RI7FWW7KIUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WCMZPYUKHNIT?ASIN=B08JLSS7SN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Work great",
                "reviewText": "Work like it should",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}