{
    "remaining_requests": 26712,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cascade-ActionPacs-Dishwasher-Detergent-Fresh/dp/B002IXHQ9K",
    "body": {
        "name": "Cascade ActionPacs Dishwasher Detergent, Fresh Scent, 85-Count",
        "price": "$15.37$15.37 ($0.18$0.18 / Count) $13.75$13.75 ($0.16$0.16 / Count)",
        "originalPrice": "$16.99",
        "rawPrice": 15.37,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cascade-ActionPacs-Dishwasher-Detergent-Fresh/dp/B002IXHQ9K",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09KM34GPP"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Scent",
                "variationValue": "Fresh,Original",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B002IXHQ9K",
                "variationName": "Scent",
                "variationValue": "Fresh",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Scent",
                "variationValue": "Lemon",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Scent",
                "variationValue": "fresh scent",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "8.1 Ounce (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07PQXQ1LJ",
                "variationName": "Size",
                "variationValue": "25 ct.",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07NDTLQZV",
                "variationName": "Size",
                "variationValue": "25 Count (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "37 Count (Pack of 4)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00IJGCGG8",
                "variationName": "Size",
                "variationValue": "60 Count (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B002IXHQ9K",
                "variationName": "Size",
                "variationValue": "85 Count (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08QVLGBBT",
                "variationName": "Size",
                "variationValue": "105 Count (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "110 Count (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "Savings",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41PA54qb5gL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41UoOQFEXPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XRmnlNvJS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bphfMmgsS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 ysTXbsDL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Cascade Store",
            "link": "https://www.amazon.com/stores/Cascade/page/0E99298E-8E1F-4C11-A918-8015DB2D2BBB?ref_=ast_bln"
        },
        "brand": "Cascade",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 4883,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 15. Order within 30 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 15. Order within 30 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE pickup Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 15. Order within 8 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Cascade Original ActionPacs dissolve fast in your dishwasher to release cleaning ingredients earlier in the cycle. Let Cascade do the dishes, so you can get back to doing what you love.",
            "Running the dishwasher daily saves water* Save up to 20 gallons of water per dishwasher load when you skip the pre-wash *ENERGY STAR certified dishwashers use 4 gallons per cycle. Running the tap for 11 minutes handwashing uses up to 24 gallons of water.",
            "#1 Recommended Brand in North America* *More dishwasher brands in North America recommend Cascade based on co-marketing agreements vs. other automatic dishwasher detergent brands",
            "Convenient, premeasured ActionPac with no finicky plastic wrapping. Phosphate free."
        ],
        "description": "Product Description Cascade ActionPacs power away greasy residue for sparkling dishes in one easy-to-use, premeasured pac. ActionPacs combine the scrubbing power of Cascade and the grease-fighting power of Dawn to leave your dishes virtually spotless with a brilliant shine. Formulated with built-in rinse aid action plus water softeners to help prevent hard water deposits on glasses, ActionPacs dissolve in your dishwasher to leave virtually no mess—only sparkling dishes. Simply load your machine, pop in a pac, and go! From the Manufacturer Rinses away residue to leave dishes sparkling. view larger Formulated with the grease-fighting power of Dawn. For dish cleaning that packs concentrated cleaning power, try Cascade ActionPacs dish detergent. ActionPacs combine the scrubbing power of Cascade and the grease fighting power of Dawn to leave your dishes virtually spotless with a brilliant shine in one easy-to-use, pre-measured pac. Formulated with built-in rinse aid action plus water softeners to help prevent hard water deposits on glasses, ActionPacs dissolve in your dishwasher to leave virtually no mess—only sparkling dishes. Simply load your machine, pop in a pac, and go!3 Steps to Your Perfect Clean view largerFor a virtually no-fail clean, try Cascade’s ultimate dish routine.Cascade Platinum – Use every wash for a brilliant clean that even helps keep your dishwasher sparkling.Cascade Complete Rinse Aid – Fill your dishwasher’s rinse aid dispenser and refill as needed.Cascade Dishwasher Cleaner – Use once per month.Beyond Detergent view largerSecret ingredients for added shine, protection & performance.Cascade Rinse Aid – Protects glassware from spots and filming and delivers a dazzling dose of shine.Cascade Dishwasher Cleaner – Easy-to-use pacs help remove limescale buildup, grease, and odors lurking in your dishwasher.Frequently Asked QuestionsHow much Cascade detergent should I use in my dishwasher?For Cascade powder and gel detergents, start by trying the recommended amount on the back label. There may be times when it’s necessary to use a little more or less, depending on your dish load and water hardness. For something even simpler, try Cascade ActionPacs. Each pac provides the perfect dose of clean, so you know exactly how much to use, every time.How do ActionPacs work?Cascade, Cascade Complete, and Cascade Platinum ActionPacs make dishwashing even simpler by taking out the guesswork. They’re easy to use because they require no measuring, unwrapping, crumbling, or cleanup. ActionPacs contain a higher concentration of detergents than powders and gels, plus built-in rinse and shine ingredients. To use, simply pop an ActionPac into your dishwasher’s detergent cup, close the cup lid, and let your dishwasher run.My dishwasher manual says to fill both cups with detergent. Do I need to use two ActionPacs?Nope. You only need one ActionPac because the formula is concentrated. They’re designed to give you a convenient, simple way to dose detergent with no premeasuring.Do I need to pre-rinse my dishes?Actually, with Cascade Complete powder, gel, and ActionPacs, and Cascade Platinum ActionPacs, you can skip the pre-scrub and load your dishes in right off the table. These formulas contain advanced cleaning and rinsing power, so pre-rinsing isn’t necessary.What if I have hard water?Water hardness varies depending on where you live. The good news is all of our ActionPacs are formulated with water softeners to help fight hard water deposits on your dishes.How can I prevent filming on my glasses and dishware?Here are some simple steps you can take to help keep your glasses film-free:Fill both detergent cups for each load (if you’re using Cascade ActionPacs, you only need to use one).Try using Cascade Rinse Aid, which protects surfaces and boosts drying to prevent spots and streaks.Dishwasher water temperature should be at least 120 degrees Fahrenheit. Try running hot water at the kitchen sink before starting the load to help reach this temperature.To help prevent low water pressure, make sure that no other water is being used in the house (showers, grass watering, washing machine, etc.).Be sure the dishwasher is loaded so that no items block the sprayer arms and prevent adequate water from reaching all the dishes.Once a month, use Cascade Dishwasher Cleaner to help remove limescale, grease, and odor buildup that can contribute to spotting and filming.Product Comparison Cascade Platinum Cascade Complete Cascade Our ultimate clean for dishes, and even helps keep dishwasher sparkling. Powers away 24-hour stuck-on food—no pre-rinse needed. Rinses away residue to leave dishes sparkling. Grease-Fighting Power of Dawn ✓ ✓ ✓ Fights Tea & Coffee Stains ✓ ✓ ✓ Brilliant Shine ✓ ✓ ✓ Virtually Spotless Dishes Best Best Better Tough Food Enzyme Action Best Better Good Our Best Film Prevention for Sparkling Machine ✓",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Dishwashing",
                "link": "https://www.amazon.com/Dishwashing-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15693761"
            },
            {
                "name": "Dishwasher Detergent",
                "link": "https://www.amazon.com/Dishwasher-Detergent/b/ref=dp_bc_aui_C_4?ie=UTF8&node=15693671"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 12 x 12 x 12 inches; 3.37 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 18629"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ April 4, 2012"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Cascade"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B002IXHQ9K"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,237 in Health & Household (See Top 100 in Health & Household) #47 in Dishwasher Detergent #1,960 in Sales & Deals"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 4,883 ratings"
            },
            {
                "name": "Brand",
                "value": "Cascade"
            },
            {
                "name": "Item Form",
                "value": "Pac"
            },
            {
                "name": "Scent",
                "value": "Fresh"
            },
            {
                "name": "Material Feature",
                "value": "Concentrated"
            },
            {
                "name": "Number of Items",
                "value": "1"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7G2HBE2YM3DRPNVUVUP2ZFY4FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25LFA0ZIFCGAZ?ASIN=B002IXHQ9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Work So Well! Great Value",
                "reviewText": "I’m not one of those people who washes the dishes completely before they load them in the dishwasher. I started off using other pod brands, and they didn’t get things clean. Then I found Cascade Platinum pods, and they worked super well, but the strong scent of them gave me headaches. I didn’t think that this type of Cascade pod would work as well as the Platinum, but for me, it really does. The only difference I can tell in my dishes is that they don’t smell strongly of chemicals like they did with the Platinum version, the stuff is just clean! Love these and this bull option.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDRG6FDR6TFKK3YDOB2IEYZZSJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW2OP3RTDWM0U?ASIN=B002IXHQ9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Works well, doesn't leave residue when used with JetDry",
                "reviewText": "While pods are more expensive then powder or liquid cleaner, you can't beat the convivence. Modern dishwashers work just as well with pods vs other cleaners. I think Cascade pods work better then Total, but that could be user preference. I do think they work better with JetDry, so I always use both. I almost never run my dishwasher on heavy, always on normal, and almost never have any food debris left on dishes.If I've left heavy grease or cookware without pre-rinse, heavy cycle seems to always remove everything. These pods work really well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dana Dee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5BMS2QZOYQNXIXRWKOTCGMKGYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIOOURHZXO19E?ASIN=B002IXHQ9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Best value, best dishwasher soap!",
                "reviewText": "Cascade is the best dishwasher detergent hands down! This tub of 105 packs of the OG Cascade is $20 bucks. The fancy tub of the platinum super soaker stuff gives you 62 packs for $20. I have very hard water so i use 2 packs when I have a really big or really dirty load. Maybe 4 out of 10 loads...I think I'm the winner in this game! The pretty colors and extra sections on top of the fancy expensive versions are just not worth it. I actually bought a big bottle of the original liquid Cascade (orange scent of course) and it did a wonderful job as well! Just use more detergent if you have hard water, use a rinse aid, Finish is the best in my opinion, and put it on turbo wash. Your dishwasher (and dishes) will thank you!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQNOQHGMBR7UHXWWZXDWB46OTBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWCYDUIHORY8Z?ASIN=B002IXHQ9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Good product",
                "reviewText": "Good product, but I received an envelope later from this company it was all ripped up not sure what was actually in it, all that was in there was a small thank you card, hope there was nothing else that was supposed to be in there!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "trevor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSGPR6NNKCSCDUTF45W3H37LCQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39HCQPLU9IK9B?ASIN=B002IXHQ9K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 4, 2016",
                "reviewTitle": "4.0 out of 5 stars These pacs are easy and awesome",
                "reviewText": "These pacs are easy and awesome! I used to buy the cascade gel, but was noticing a white powder residue on some of the dishes. I bought jet dry thinking that may have been the issue, but it wasn't the residue was still there. I ordered these to try something different and they rock! It's an all in one!Pros: super easy, no mess, clean greatCons: if you do not be sure to dry out the area where your pac is placed, it may not release the pac properly. The water makes the outer coating stick to the dishwasher canister. If I know water got in that area, I will take a paper towel and dry it out with hopes it will release completely for a proper clean with all the powder (not 3/4 of it from being stuck)Love these pacs! will not be going back to powder/gel! Highly recommend!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Krystal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPE4H33E2USWK6AY5QWKS22JPHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JKGHFRTXKUBN?ASIN=B002IXHQ9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Great cleaner",
                "reviewText": "Great value. Does a good job cleaning even on the quick wash setting, without leaving residue behind. I like that they're not individually wrapped.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joshua",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGE2DMT7ZRDW24EXQ5TWUH7UDV2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14XVBQB4CC5BE?ASIN=B002IXHQ9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars How many?",
                "reviewText": "It's Cascade, it does the job. But how can you actually pass this up for the price? 85?! Really? I'm good for the year!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Schoolmom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZV3JMBTTI7ZRXGR55JR7MRGZDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M1HLX9E8RL1V?ASIN=B002IXHQ9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great",
                "reviewText": "Love this soap. Works as good as the super pricey stuff.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "💖Whity-mom💖",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on February 22, 2017",
                "reviewTitle": "ありがとうございました。",
                "reviewText": "海外からなので到着に時間が掛かりましたが、無事に受け取りました。とても気に入ってます。ありがとうございました。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abraham",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 21, 2015",
                "reviewTitle": "excelente producto",
                "reviewText": "muy buen producto es facil de usar ,funciona bien incluso en residuos pegados y deja los vasos libre de manchas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$15.99",
                "sellerName": "Super Cyber Savings",
                "sellerRating": "4.5"
            },
            {
                "price": "$16.18",
                "sellerName": "Useful Universe",
                "sellerRating": "5"
            }
        ]
    }
}