{
    "remaining_requests": 26756,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cascade-Platinum-ActionPacs-Dishwasher-Detergent/dp/B086ZJTVS5",
    "body": {
        "name": "Cascade Platinum Dishwasher Pods, Dishwasher Detergent Pod, Dishwasher Soap Pod, Actionpacs Dish Washing Pod, Lemon, 62 Count Dishwasher Detergent Pods (Packaging may vary)",
        "price": "$18.94$18.94 ($0.31$0.31 / Count) $16.95$16.95 ($0.27$0.27 / Count)",
        "originalPrice": "$20.99",
        "rawPrice": 18.94,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cascade-Platinum-ActionPacs-Dishwasher-Detergent/dp/B086ZJTVS5",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "Savings",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51pcqzb0gNL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51faXqwUb9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51IifkhULwS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51YTUPiqJJS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bR1Ko1CxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41edpETvPCS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 ysTXbsDL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/51manaQF1PL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/51manaQF1PL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Cascade Store",
            "link": "https://www.amazon.com/stores/Cascade/page/0E99298E-8E1F-4C11-A918-8015DB2D2BBB?ref_=ast_bln"
        },
        "brand": "Cascade",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 21968,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 51 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 51 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Cascade Platinum ActionPacs dishwasher detergent cleans burnt-on messes in just one wash, with no pre-wash needed.",
            "Dissolves fast to release the grease fighting power of Dawn, while food seeking enzymes latch on and break down food into particles so small they can flow right down the drain",
            "Get virtually spotfree sparkling clean dishes on even the toughest messes",
            "Formulated to help prevent hard water spots and filming to keep your machine looking fresh and clean",
            "Running the dishwasher daily saves water* Save up to 20 gallons of water per dishwasher load when you skip the pre-wash *ENERGY STAR certified dishwashers use 4 gallons per cycle. Running the tap for 11 minutes handwashing uses up to 24 gallons of water.",
            "#1 Recommended Brand in North America* *More dishwasher brands in North America recommend Cascade based on co-marketing agreements vs. other automatic dishwasher detergent brands",
            "Convenient, premeasured ActionPac with no finicky plastic wrapping. Phosphate free."
        ],
        "description": "Cascade Platinum ActionPacs dishwasher detergent cleans burnt-on messes in just one wash, with no pre-wash needed. That's because the pod dissolves fast to start cleaning right away, releasing the soaking power of Dawn dishwashing liquid, while food-seeking enzymes latch on and break down food into particles so small they can flow right down the drain. It's so powerful it even works in the Quick Wash cycle. Plus, Cascade Platinum dishwashing detergent is formulated to help prevent hard water filming, keeping your machine looking fresh and clean. Simply pop in an ActionPac and reveal a Platinum sparkle. Save up to 20 gallons of water per dishwasher load when you skip the pre-wash and run your dishwasher with Cascade Platinum. #1 Recommended Brand in North America* *More dishwasher brands in North America recommend Cascade vs. any other automatic dishwashing detergent brand, recommendations as part of co-marketing agreements.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Dishwashing",
                "link": "https://www.amazon.com/Dishwashing-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15693761"
            },
            {
                "name": "Dishwasher Detergent",
                "link": "https://www.amazon.com/Dishwasher-Detergent/b/ref=dp_bc_aui_C_4?ie=UTF8&node=15693671"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 6.73 x 5.51 x 7.24 inches; 2.64 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 10037000744518"
            },
            {
                "name": "Department ‏",
                "value": "‎ Dishwasher Detergent"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ January 1, 2019"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Procter & Gamble"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B086ZJTVS5"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#203 in Health & Household (See Top 100 in Health & Household) #3 in Dishwasher Detergent"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 21,968 ratings"
            },
            {
                "name": "Brand",
                "value": "Cascade"
            },
            {
                "name": "Item Form",
                "value": "Tablet"
            },
            {
                "name": "Scent",
                "value": "Lemon"
            },
            {
                "name": "Material Feature",
                "value": "Gluten Free"
            },
            {
                "name": "Number of Items",
                "value": "1"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Use All 3 Products for Our Ultimate Clean Removes burnt-on food. No pre-wash needed. Dries and shines with virtually no water spots or streaks. Removes grease, odors and limescale build-up.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ff3008f3-f2b6-4b37-9040-98b758d180fd._CR0,0,300,300_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ba429142-3736-4255-960b-36dd3d58a34b._CR0,0,300,300_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/448eaf2e-d08e-43b9-a53f-90625556dbb1._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Cascade Platinum ActionPacs Cascade Platinum Rinse Aid Cascade Platinum Dishwasher Cleaner Cascade Platinum + Oxi ActionPacs Cascade Pure Essentials Lemon Essence ActionPacs Removes burnt-on food. No need to pre-wash. Sheeting action helps prevent water from clinging to your dishes. Remove limescale build-up, grease, and odors from your dishwasher. Cascade’s best stain fighting formula. Pure cleaning for your family. Perfume infused with essential lemon oils. Leaves Dishes Shining ✓ ✓ ✓ ✓ ✓ Eliminates Need to Pre-Wash ✓ ✓ ✓ Convenient Pac Form ✓ ✓ ✓ Grease Fighting Power of Dawn ✓ ✓ ✓ No Phosphates & No Chlorine Bleach ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b7e029ff-c0d4-40ab-a18a-59db8314c290._CR0,0,970,300_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d5a074c2-d5e4-4b63-b86d-24b12bd3b544._CR0,0,970,300_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ff3008f3-f2b6-4b37-9040-98b758d180fd._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ba429142-3736-4255-960b-36dd3d58a34b._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/448eaf2e-d08e-43b9-a53f-90625556dbb1._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/39939fa3-2d84-449f-911b-388b94dcf157._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/03951278-7edb-457c-b996-0d2233eeab44._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a55e6953-4e88-4e90-bf31-c9db9cc720de._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1e876b05-3e98-4839-b035-1ec9218d2f08._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1edfbbc1-beb0-400e-9e27-8b66c7d86fc1._CR0,0,150,300_PT0_SX150__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stephanie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZGVHGXQ2GJSFKNIZWIYKNGXB6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYFLI6HQ40C7T?ASIN=B086ZJTVS5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Sparkling Clean Every Time!",
                "reviewText": "Cascade Platinum Dishwasher Pods have transformed my dishwashing routine into a hassle-free, sparkling success! These Actionpacs are nothing short of amazing, and I can't sing their praises enough.The cleaning power of Cascade Platinum is impressive. It tackles everything from tough, baked-on stains to everyday grime, leaving my dishes spotless and gleaming. Even my glassware comes out crystal clear, free from any residue or streaks. I love opening the dishwasher to a load of dishes that look like they just came out of a professional cleaning service!The Platinum formula is fantastic at preventing hard-water buildup and limescale deposits on my dishes and dishwasher. It's like a protective shield that keeps everything in top-notch condition. Plus, the fresh scent that wafts out when I open the dishwasher is a pleasant bonus.I appreciate the reliability of Cascade Platinum. I can trust these pods to consistently deliver outstanding results load after load. The value for money is exceptional, given the quality and convenience they provide.In conclusion, if you want a dishwasher detergent that takes the stress out of dishwashing and leaves your dishes gleaming, Cascade Platinum Dishwasher Pods are the way to go. They've earned a permanent spot in my kitchen, and I wholeheartedly recommend them to anyone in search of a top-tier dishwasher detergent.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jay johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7YSNAMOGTUTHBCKJZTCXEQYLBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRJKOIRC2SMQC?ASIN=B086ZJTVS5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Reliable cleaning power!",
                "reviewText": "As a resident of a rural area with water that tends to challenge the cleanliness of dishes, finding an effective dishwasher detergent has been an ongoing quest for me. After trying several brands, I've found that Cascade Dishwasher Pods have proven to be a reliable solution for keeping my dishes sparkling clean, even with our hard water and infrequent dishwasher use.Let's start with the positives. One of the first things I noticed about Cascade pods is their delightful fresh scent. It's not overpowering, and leaves a pleasant aroma as the dishes are washing. Plus, the convenience factor cannot be overstated. Just pop one pod into the dishwasher, and you're good to go. No measuring, pouring, or mess involved. This simplicity makes them a breeze to use, especially on those busy days when time is of the essence.I also appreciate the thoughtful packaging. The sturdy bucket not only keeps the pods organized but also makes it easy to grab one without fumbling around with flimsy boxes. It's a small touch, but it adds to the overall user experience.Now, onto the downside. While Cascade pods generally deliver excellent cleaning results, I've found that using just one isn't always sufficient for heavily soiled dishes, particularly if they've been sitting for a while between washes. In my case, I've had to resort to using two pods—one in the bottom of the dishwasher and one in the door—to ensure that everything comes out spotless. While this might be seen as a minor inconvenience, it does mean going through pods a bit faster than anticipated.Despite this drawback, the effectiveness of Cascade Dishwasher Pods outweighs the need for an extra pod in my book. The peace of mind knowing that my dishes will consistently emerge clean and sparkling makes it a worthwhile investment, especially considering the challenges posed by our rural water and sporadic dishwasher usage.In conclusion, if you're looking for a dishwasher detergent that combines convenience, a pleasant scent, and reliable cleaning power, Cascade Dishwasher Pods are an excellent choice. Just be prepared to use an extra pod for those tougher cleaning jobs.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alyssa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIP3N2WTATEZSMUGGXHV2RDBJOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HDV887T9K3R0?ASIN=B086ZJTVS5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Shiny China and great price!",
                "reviewText": "Always has my dishes coming out clean! Great price- household of 2 and the last time I purchased was October- didn’t need to repurchase until January!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EdwardEdward",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETI4YIJOAKQVOMZ4ROSIIJ7VYZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3T3HR4O26MBVY?ASIN=B086ZJTVS5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Effortless Cleaning with Cascade Platinum Plus ActionPacs",
                "reviewText": "I've been a loyal user of Cascade dishwashing soap for years, and the switch to the Cascade Platinum Plus ActionPacs Dishwasher Detergent Pods has been a game-changer in my household. This transition wasn't just about convenience; it was about making dish duty accessible for everyone, including my small human helper.One of the major reasons for making the switch was to simplify the dishwashing process, especially with my little one involved. The liquid detergent led to a few mishaps, including over-pouring and failed attempts at measuring. Enter the Cascade Platinum Plus pods, and suddenly, life got a whole lot easier.These pods work exactly as advertised. I load up my dishwasher with dishes that still have remnants of food, and they come out sparkling clean. No more pre-rinsing or worrying about food particles clinging to my dinnerware. The convenience of simply tossing in a pod and letting the dishwasher do its magic has made a noticeable difference in the efficiency of my kitchen routine.What truly impresses me is the results—the glasses are streak-free, and the silverware shines like new. The Cascade Platinum Plus ActionPacs leave no room for disappointment. The cleaning power is evident, and it's a relief to open the dishwasher to spotless, gleaming dishes.For anyone looking to simplify their dishwashing routine without compromising on cleanliness, these pods are a must-try. The transition from liquid to pods has not only made my life easier but has also ensured that even my small human can handle the task effortlessly. Cascade has once again proven why it's a trusted name in dish care. Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71LeGL5BRGL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$19.92",
                "sellerName": "VOI Products",
                "sellerRating": "4.5"
            }
        ]
    }
}