{
    "remaining_requests": 26627,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/WD21X10519-Dishwasher-Compatible-Replacement-WD21X10492/dp/B0C7PZ62FK",
    "body": {
        "name": "New Upgrade WD21X10519 GE Dishwasher Flood Switch Compatible gdt gdf series GE Appliance Switch Flood Asm Replacement WD21X10492 WD21X20204 3028650 PS8690623 AP5781465",
        "price": "$13.90",
        "originalPrice": "$21.99",
        "rawPrice": 13.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/WD21X10519-Dishwasher-Compatible-Replacement-WD21X10492/dp/B0C7PZ62FK",
        "soldBy": {
            "sellerID": "A3AZHDDFQ5LRAH",
            "name": "DawnTech",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3AZHDDFQ5LRAH&asin=B0C7PZ62FK&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 5% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-4tmn9FcL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41fhmBiSvvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AlYUa061L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ybyndZm9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/6124PMJeBsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61woDf55PfL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: REEPLAR",
            "link": "https://www.amazon.com/REEPLAR/b/ref=bl_dp_s_web_107229517011?ie=UTF8&node=107229517011&field-lbr_brands_browse-bin=REEPLAR"
        },
        "brand": "REEPLAR",
        "merchantInfo": "DawnTech",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 47,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 11 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Purchase suggestions: Dishwashers that do not supply water properly, dishwashers that have been washed with a smell, and cannot be completely dried may all be due to switch flood asm,it is recommended to purchase this part when the above issues occur.",
            "Fits models: Compatible with ADT, CDT, DDT, GDF, GDT, PDT, ZDT series General Electric Hotpoint RCA dishwaher. Please refer to the product description below or contact us for specific suitable models.",
            "Replacement: WD21X10492 WD21X20204 AP5781465 302865 PS8690623 EAP8690623",
            "Quality assurance: GE wd21x10519 switch flood asm using higher quality materials, the user experience is consistent with or better than OEM, and it is well compatible with GE dishwashers, working perfectly.",
            "Easy to install: Usually, we only need to use YouTube videos to install dishwasher float switch ourselves without waiting for technical personnel."
        ],
        "description": "Flood Switch Replacement: WD21X10492 WD21X20204 AP5781465 302865 PS8690623 EAP8690623 Switch Flood Asm Function: Control the filling of hot and cold water into the dishwasher to ensure whose temperature is suitable. Dishwasher Flood Switch Installation: The detailed installation process can be found on YouTube, and can generally be completed within 30 minutes with a 1/4in Nut Driver.",
        "breadCrumbs": [
            {
                "name": "Appliances",
                "link": "https://www.amazon.com/Appliances/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2619525011"
            },
            {
                "name": "Parts & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3741181"
            },
            {
                "name": "Dryer Parts & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2232336011"
            },
            {
                "name": "Replacement Parts",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9425850011"
            }
        ],
        "productInformation": [
            {
                "name": "Manufacturer",
                "value": "‎REEPLAR"
            },
            {
                "name": "Part Number",
                "value": "‎WD21X10519"
            },
            {
                "name": "Item Weight",
                "value": "‎2.08 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎2.1 x 2.1 x 5.6 inches"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎WD21X10519"
            },
            {
                "name": "Material",
                "value": "‎Plastic"
            },
            {
                "name": "Included Components",
                "value": "‎WD21X10519 ge flood switch"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "Warranty Description",
                "value": "‎2 years"
            },
            {
                "name": "ASIN",
                "value": "B0C7PZ62FK"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 47 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,341 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #102 in Dryer Replacement Parts"
            },
            {
                "name": "Date First Available",
                "value": "June 12, 2023"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Flood Switch Replacement: WD21X10492 WD21X20204 AP5781465 302865 PS8690623 EAP8690623 Switch Flood Asm Function: Control the filling of hot and cold water into the dishwasher to ensure whose temperature is suitable. Dishwasher Flood Switch Installation: The detailed installation process can be found on YouTube, and can generally be completed within 30 minutes with a 1/4in Nut Driver. Fix GE dishwasher issues: Not drying Not taking on water Not heating water or element The washed tableware has a smell",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dec8b086-31ab-422d-881d-a2b540f3c59a.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Specially designed for general electrical dishwashers, perfect for various models, making it the perfect choice for your dishwasher. Unplug the dishwasher power before installing WD21X10519, you can start repairing just by preparing a 1/4in Nut Driver and save money compared to buying a new dishwasher. Always provide customers with higher product quality, and every part undergoes strict inspection to ensure that the product is upgraded as an OEM part.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e4c6bdb-0d75-4c37-89fd-d231ed5ecd5c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5fab27c-fac3-4788-9746-27d1c5f06713.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee38a124-2c2d-4974-b93f-111f5331c52a.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "You can enter your model by pressing \"Ctrl+F\" to find out if your model matches. ADT series ADT521PGF0BS ADT521PGF0WS ADT521PGF2BS ADT521PGF2WS ADT521PGF4BS ADT521PGF4WS ADT521PGF6BS ADT521PGF6WS ADT521PGJ0BS ADT521PGJ0WS ADT521PGJ2BS ADT521PGJ2WS CDT series CDT725SSF0SS CDT725SSF2SS CDT725SSF4SS CDT725SSF6SS CDT725SSF7SS CDT765SSF0SS CDT765SSF1SS CDT765SSF7SS DDT series DDT575SGF0BB DDT575SGF0WW DDT575SGF2BB DDT575SGF2WW DDT575SGF4WW DDT575SGF5WW DDT575SGF6WW DDT575SGF7WW DDT575SGF8BB DDT575SGF8WW DDT575SMF0ES DDT575SMF2ES DDT575SMF4ES DDT575SMF5ES DDT575SMF6ES DDT575SMF7ES DDT575SMF8ES DDT575SSF0SS DDT575SSF2SS DDT575SSF4SS DDT575SSF5SS DDT575SSF6SS DDT575SSF7SS DDT575SSF8SS GDF series GDF510PGD0BB GDF510PGD0WW GDF510PGD1BB GDF510PGD1WW GDF510PGD2BB GDF510PGD2WW GDF510PGD4BB GDF510PGD4WW GDF510PGD6BB GDF510PGD6WW GDF510PGJ0BB GDF510PGJ0WW GDF510PGJ2BB GDF510PGJ2WW GDF510PGJ4BB GDF510PGJ4WW GDF510PGJ5BB GDF510PGJ5WW GDF510PGJ6BB GDF510PGJ6WW GDF510PMD0SA GDF510PMD1SA GDF510PMD2MB GDF510PMD2SA GDF510PMD4SA GDF510PMD6SA GDF510PMJ0SA GDF510PMJ2SA GDF510PMJ4SA GDF510PMJ5SA GDF510PMJ6SA GDF510PSD0SS GDF510PSD1SS GDF510PSD2SS GDF510PSD4SS GDF510PSD6SS GDF510PSJ0SS GDF510PSJ2SS GDF510PSJ4SS GDF510PSJ5SS GDF510PSJ6SS GDF520PGD0BB GDF520PGD0CC GDF520PGD0WW GDF520PGD1BB GDF520PGD1CC GDF520PGD1WW GDF520PGD2BB GDF520PGD2CC GDF520PGD2WW GDF520PGD4BB GDF520PGD4CC GDF520PGD4WW GDF520PGD6BB GDF520PGD6CC GDF520PGD6WW GDF520PGJ0BB GDF520PGJ0CC GDF520PGJ0WW GDF520PGJ2BB GDF520PGJ2CC GDF520PGJ2WW GDF520PGJ4BB GDF520PGJ4CC GDF520PGJ4WW GDF520PMJ0ES GDF520PMJ2ES GDF520PMJ4ES GDF520PSD0SS GDF520PSD1SS GDF520PSD2SS GDF520PSF1SS GDF520PSF2SS GDF520PSF4SS GDF520PSF6SS GDF520PSJ0SS GDF520PSJ2SS GDF520PSJ4SS GDF540HGD0BB GDF540HGD0WW GDF540HGD1BB GDF540HGD1WW GDF540HGD2BB GDF540HGD2WW GDF540HGD4BB GDF540HGD4WW GDF540HGD6BB GDF540HGD6WW GDF540HMF0ES GDF540HMF2ES GDF540HMF4ES GDF540HSD0SS GDF540HSD1SS GDF540HSD2SS GDF540HSF1SS GDF540HSF2SS GDF540HSF4SS GDF540HSF6SS GDF570SGD0BB GDF570SGF0BB GDF570SGF0CC GDF570SGF0WW GDF570SGF2BB GDF570SGF2CC GDF570SGF2WW GDF570SGF4BB GDF570SGF4CC GDF570SGF4WW GDF570SGF6BB GDF570SGF6CC GDF570SGF6WW GDF570SGF7BB GDF570SGF7CC GDF570SGF7WW GDF570SGF8BB GDF570SGF8CC GDF570SGF8WW GDF570SSF0SS GDF570SSF2SS GDF570SSF4SS GDF570SSF6SS GDF570SSF7SS GDF570SSF8SS GDF610PGJ0BB GDF610PGJ0WW GDF610PGJ2BB GDF610PGJ2WW GDF610PGJ4BB GDF610PGJ4WW GDF610PMJ0ES GDF610PMJ2ES GDF610PMJ4ES GDF610PSJ0SS GDF610PSJ2SS GDF610PSJ4SS GDF620HGJ0BB GDF620HGJ0WW GDF620HGJ2BB GDF620HGJ2WW GDF620HGJ4BB GDF620HGJ4WW GDF620HMJ0ES GDF620HMJ2ES GDF620HMJ4ES GDF620HSJ0SS GDF620HSJ2SS GDF620HSJ4SS GDT series GDT530PGD0BB GDT530PGD0WW GDT530PGD1BB GDT530PGD1WW GDT530PGD2BB GDT530PGD2WW GDT530PGD4BB GDT530PGD4WW GDT530PGD6BB GDT530PGD6WW GDT530PSD0SS GDT530PSD1SS GDT530PSD2SS GDT530PSD4SS GDT530PSD6SS GDT535PGJ0BB GDT535PGJ0WW GDT535PGJ2BB GDT535PGJ2WW GDT535PGJ4BB GDT535PGJ4WW GDT535PGJ5BB GDT535PGJ5WW GDT535PGJ6BB GDT535PGJ6WW GDT535PSJ0SS GDT535PSJ2SS GDT535PSJ4SS GDT535PSJ5SS GDT535PSJ6SS GDT545PGJ0BB GDT545PGJ0WW GDT545PGJ2BB GDT545PGJ2WW GDT545PGJ4BB GDT545PGJ4WW GDT545PSJ0SS GDT545PSJ2SS GDT545PSJ4SS GDT550HGD0BB GDT550HGD0WW GDT550HGD1BB GDT550HGD1WW GDT550HGD2BB GDT550HGD2WW GDT550HGD4BB GDT550HGD4WW GDT550HGD6BB GDT550HGD6WW GDT550HSD0SS GDT550HSD1SS GDT550HSD2SS GDT550HSD4SS GDT550HSD6SS GDT580SGF0BB GDT580SGF0WW GDT580SGF2BB GDT580SGF2WW GDT580SGF4BB GDT580SGF4WW GDT580SGF5BB GDT580SGF5WW GDT580SGF6BB GDT580SGF6WW GDT580SGF7BB GDT580SGF7WW GDT580SGF8BB GDT580SGF8WW GDT580SMF0ES GDT580SMF2ES GDT580SMF4ES GDT580SMF5ES GDT580SMF6ES GDT580SMF7ES GDT580SMF8ES GDT580SSF0SS GDT580SSF2SS GDT580SSF4SS GDT580SSF5SS GDT580SSF6SS GDT580SSF7SS GDT580SSF8SS GDT590SGJ7BB GDT590SGJ7WW GDT590SMJ7ES GDT590SSJ7SS GDT625PGJ0BB GDT625PGJ0WW GDT625PGJ2BB GDT625PGJ2WW GDT625PGJ4BB GDT625PGJ4WW GDT625PSJ0SS GDT625PSJ2SS GDT625PSJ4SS GDT635HGJ0BB GDT635HGJ0WW GDT635HGJ2BB GDT635HGJ2WW GDT635HGJ4BB GDT635HGJ4WW GDT635HMJ0ES GDT635HMJ2ES GDT635HMJ4ES GDT635HSJ0SS GDT635HSJ2SS GDT635HSJ4SS GDT680SGH2BB GDT680SGH2WW GDT680SGH4BB GDT680SGH4WW GDT680SGH6BB GDT680SGH6WW GDT680SGH7BB GDT680SGH7WW GDT680SGH8BB GDT680SGH8WW GDT680SSH2SS GDT680SSH4SS GDT680SSH6SS GDT680SSH7SS GDT680SSH8SS GDT720SGF0BB GDT720SGF0WW GDT720SGF2BB GDT720SGF2WW GDT720SGF4BB GDT720SGF4WW GDT720SSF0SS GDT720SSF2SS GDT720SSF4SS GDT740SIF0II GDT740SIF2II GDT740SIF4II GDT740SIF7II GDT740SIF8II GDT740SIFAII GDT740SSF0SS GDT740SSF2SS PDT series PDT720SGH5BB PDT720SGH5WW PDT720SGH6BB PDT720SGH6WW PDT720SGH7BB PDT720SGH7WW PDT720SSH5SS PDT720SSH6SS PDT720SSH7SS PDT750SMF1ES PDT750SMF2ES PDT750SMF4ES PDT750SMF5ES PDT750SMF7ES PDT750SMF8ES PDT750SMFAES PDT750SSF0SS PDT750SSF1ES PDT750SSF1SS PDT750SSF2SS PDT750SSF4SS PDT750SSF5SS PDT750SSF7SS PDT750SSF8SS PDT750SSFASS PDT760SIF0II PDT760SIF1II PDT760SIF5II PDT760SIF7II PDT760SIJ7II PDT760SSF0SS PDT760SSF1SS PDT760SSF5SS PDT760SSF7SS PDT760SSJ7SS ZDT series ZDT800SIF0II ZDT800SIF1II ZDT800SIF5II ZDT800SIF7II ZDT800SPF0SS ZDT800SPF1SS ZDT800SPF5SS ZDT800SPF7SS ZDT800SSF0SS ZDT800SSF1SS ZDT800SSF5SS ZDT800SSF7SS ZDT870SIF0II ZDT870SIF1II ZDT870SIF5II ZDT870SIF7II ZDT870SMF5GS ZDT870SMF7GS ZDT870SPF0SS ZDT870SPF1SS ZDT870SPF5SS ZDT870SPF7SS ZDT870SSF0SS ZDT870SSF1SS ZDT870SSF5SS ZDT870SSF7SS",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/057fd9aa-cb1f-4bef-a03c-2c97f20bb722.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/000e352e-6d52-4ca2-baf3-d59155271680.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dec8b086-31ab-422d-881d-a2b540f3c59a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e4c6bdb-0d75-4c37-89fd-d231ed5ecd5c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5fab27c-fac3-4788-9746-27d1c5f06713.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee38a124-2c2d-4974-b93f-111f5331c52a.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A Heaton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFR72GSJDTJHYHUQCWR7DHECOMBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10LSX2ZU75DH6?ASIN=B0C7PZ62FK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Fixed the ‘no heat’ issue!",
                "reviewText": "This simple part brought the heating element back to life in our GE dishwasher. After years of use the original part had become clogged resulting in the heating element being non-functioning. The installation of this new part (only takes 10-15 minutes to replace) was the cure all. Back in business - the dishes are clean and the drying cycle works! Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Spiderman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4ZE4L5ZP7ONQWDFQIO4EOVKTSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XW9V88PU8TF9?ASIN=B0C7PZ62FK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Fixed the problem! Fast delivery!",
                "reviewText": "With guidance from YouTube, installation went well. Now the heat dry/sanitize on my dishwasher works again! Very affordable and not-too-difficult repair. Definitely recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joe P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMIECJDI2UQYT7I4P3SU2SOR2PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R363YML5G3IWGD?ASIN=B0C7PZ62FK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy install...Dishwasher is drying again",
                "reviewText": "Easy install, fixed the problem and now the dishwasher is drying again. Affordable solution to add some more life on this 8 year old GE dishwasher!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lisa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETCQTTGGBHWLWR4S2W5TNAFHMBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RVYV28U01WIQ?ASIN=B0C7PZ62FK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Worked perfectly",
                "reviewText": "Noticed my dishes were still wet n some weren't clean. After reading n first thing saying rinse aid n that wasn't it, then this. I personally, a female, changed this in 5 minutes n again the heat started n clean n dry dishes again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tom Lemire",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTJZXHV4WSMQS65YN6ZPM7LPXLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MHZB92THRL5I?ASIN=B0C7PZ62FK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Value",
                "reviewText": "This was a great fit and the cost was great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3GMYZ5KN4GUHYS54VVCM5BMGQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23P2E3H98UJJ3?ASIN=B0C7PZ62FK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Dishwasher thermistor",
                "reviewText": "Replaced thermistor in dishwasher. Works fine. Easy to replace. Good value looks just like the original",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James Bush",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAVDNJMJKYAVWEWAR3UGOP5ML6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DPNC4S29QS0D?ASIN=B0C7PZ62FK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Proplem solver",
                "reviewText": "If your dishwasher is not heating, try this fix first. Easy 15 minute install with many video available on Youtube. Try this before replacing the heating element or calling a repairman.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "morethan925",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVJWRVW36XLWKJGQCTSRVDVO2BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37CNZI3UOCOFY?ASIN=B0C7PZ62FK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent replacement part for original GE float sensor (so far!)",
                "reviewText": "Day two of this piece being in our dishwasher (bought in 2016). I was worried we would have to scrap the dishwasher but learned this float sensor was a common issue with the dishes not going through the heated dry cycle. Watched a You Tube video on how to change this part out, found this one on Amazon and took a chance based on the reviews that this one would work instead of a genuine GE part, and voila! It worked. Saved me hundreds in a repairman cost — handy Mom to the rescue. Go me!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cossackkasyl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 31, 2024",
                "reviewTitle": "fixed the dishwasher!",
                "reviewText": "After reading online decided to try this part for a dishwasher that was not heating up. This fixed the issue and it is awesome to have dishes come out clean",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KLH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 24, 2023",
                "reviewTitle": "Works great",
                "reviewText": "Worked great on my GE Profile dishwasher. We thought we needed a new element until we did a little research. This fixed the issue. Was easy to replace and great price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stéphane Bergeron",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 9, 2023",
                "reviewTitle": "Bon produit",
                "reviewText": "Fonctionne très bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}