{
    "remaining_requests": 48729,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/JBL-230NC-Wireless-Cancelling-Headphones/dp/B09FM6PDHP",
    "body": {
        "name": "JBL Tune 230NC TWS True Wireless In-Ear Noise Cancelling Headphones - Black, Small",
        "price": "$99.95",
        "originalPrice": "$99.95",
        "rawPrice": 99.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/JBL-230NC-Wireless-Cancelling-Headphones/dp/B09FM6PDHP",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09KT2Q34R"
        ],
        "asinVariationValues": [
            {
                "asin": "B09FM6PDHP",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/314SeozaUUL._SS36_.jpg"
            },
            {
                "asin": "B09FMNXHM6",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31Jlh5umxOL._SS36_.jpg"
            },
            {
                "asin": "B09FMS2QYD",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31tYZ2wrbXL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/314SeozaUUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31B9Bqb0C7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31lJ9R6h79L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hQ4xzBhCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51n4avu-6DL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31IzPOubTOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515TwB6wO3L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/61uFsWkGPuL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/913EFj4QO8L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the JBL Store",
            "link": "https://www.amazon.com/stores/JBL/page/17575AD5-FBC3-4ACB-8002-79EF7CF1DE1E?ref_=ast_bln"
        },
        "brand": "JBL",
        "merchantInfo": "Ships from and sold by Seller1ON1.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 16665,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 14 hrs 15 mins",
            "FREE delivery Wednesday, February 21.",
            "Or fastest delivery February 14 - 15."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "JBL Pure Bass Sound: Smartly designed 10mm drivers enhanced by the Dot form factor deliver JBL's Pure Bass Sound so you'll feel every pulsing beat.Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ears.Specific uses for product : Sports and Exercise",
            "Product Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ears, Charging time - 2 Hrs",
            "Active Noise Cancelling with Smart Ambient: Hear more of what you want, less of what you don't. Active Noise Cancelling technology with 2 microphones lets you minimize audio distractions. With Ambient Aware, you can tune into your surroundings at any time so that you feel safer when you're out in the world, while TalkThru lets you stop for a quick chat without having to remove your headphones.",
            "4 mics for perfect voice calls: Enjoy hassle-free, hands-free calls in stereo. The Tune 230NC TWS are equipped with 4 microphones, so you'll always be heard with perfect clarity. Never hesitate to take or make a call again..Note:If you face issue in Bluetooth connectivity please turn off the Bluetooth function for a couple of minutes, then turn it back on",
            "Up to 40 hours of battery life: Never miss a beat with 40 (10 plus30) hours of battery life or 8 hours, plus 24 hours in the case when noise cancelling is engaged. Need a boost. Speed Charge for just ten minutes to get 2 hours of playtime.",
            "Water resistant & sweatproof: Don't be deterred by bad weather. Thanks to IPX4 water resistance and sweatproofing, there isn't a workout or downpour the Tune 230NC TWS can't handle. Dynamic frequency response range (Hz) 20 Hz – 20 kHz"
        ],
        "description": "Tackle your day one song at a time with the JBL Tune 230NC TWS. True wireless earbuds give you 40 hours of exceptional JBL Pure Bass Sound, while the ergonomic and water-resistant design gives you all-day comfort in any weather. Connect calls simply and seamlessly with 4 mics that cancel out ambient noises offering perfect calls anywhere. And with Active Noise Cancelling and Smart Ambient technology, you choose whether you want to tune out the world or engage with your surroundings. The light stick-closed design ensures comfort all-day long. Best of all, the JBL Headphones App lets you personalize your entire listening experience. Stay connected to your world, your way.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b?ie=UTF8&node=172541"
            },
            {
                "name": "Earbud Headphones",
                "link": "https://www.amazon.com/Earbud-In-Ear-Headphones/b?ie=UTF8&node=12097478011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3 x 3 x 3 inches"
            },
            {
                "name": "Item Weight",
                "value": "58 Grams"
            },
            {
                "name": "ASIN",
                "value": "B09FM6PDHP"
            },
            {
                "name": "Item model number",
                "value": "JBLTUNE230NCTWSBAM"
            },
            {
                "name": "Batteries",
                "value": "2 CR2 batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 16,665 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#554 in Electronics (See Top 100 in Electronics) #80 in Earbud & In-Ear Headphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "September 7, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "JBL"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Charging Time",
                "value": "2.25 Hours"
            },
            {
                "name": "Units",
                "value": "1.0 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "JBL"
            },
            {
                "name": "Model Name",
                "value": "Tune 230NC TWS"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "In Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "JBL Tune 230 True Wireless Headphone All you feel is the music Tackle your day one song at a time with the JBL Tune 230NC TWS. True wireless earbuds give you 40 hours of exceptional JBL Pure Bass Sound so you'll never miss a beat. Active Noise Cancelling helps you tune out distractions, while 4 mics cancel out ambient noises for perfect calls every time.",
                "media_link": []
            },
            {
                "media_text": "Active Noise Cancelling Active Noise Cancelling technology lets you minimize audio distractions. With Ambient Aware, you can tune into your surroundings at any time so that you feel safer when out in the world, while TalkThru lets you stop for a quick chat without having to remove your headphones.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b2e89d84-5f48-43d7-8670-90e36a3c8092.__CR0,0,1464,600_PT0_SX1464_V1___.png"
                ]
            },
            {
                "media_text": "All-day fit & comfort Never be without your music. The Stick Closed design ensures comfort without pressure, eliminating ambient distractions with a design so light, you may forget you're wearing them.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6555ad4e-6aa9-458e-83ba-40d130ee178f.__CR0,0,1464,600_PT0_SX1464_V1___.png"
                ]
            },
            {
                "media_text": "4 mics for perfect voice calls Enjoy hassle-free, hands-free calls in stereo. The Tune 230NC TWS are equipped with 4 microphones, so you'll always be heard with perfect clarity. Never hesitate to take or make a call again.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cc872862-46b2-46f7-8d54-2dc823533622.__CR0,22,1464,600_PT0_SX1464_V1___.png"
                ]
            },
            {
                "media_text": "Additional Features Up to 40 hours of battery life Never miss a beat with 40 (10+30) hours of battery life or 8 hours, plus 24 hours in the case when noise cancelling is engaged. Need a boost? Speed Charge for just ten minutes to get 2 hours of playtime. Water resistant & sweatproof Don't be deterred by bad weather. Thanks to IPX4 water resistance and sweat proofing, there isn't a workout or downpour the Tune 230NC TWS can't handle with adjustable tips to make sure you have the best fit.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/494b953f-6be5-44ed-a08d-3775464cd8b0.__CR0,500,2348,1264_PT0_SX650_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3b72aff9-718e-42fb-99c3-ccd90f98374c.__CR0,525,2508,1350_PT0_SX650_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b2e89d84-5f48-43d7-8670-90e36a3c8092.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6555ad4e-6aa9-458e-83ba-40d130ee178f.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cc872862-46b2-46f7-8d54-2dc823533622.__CR0,22,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/494b953f-6be5-44ed-a08d-3775464cd8b0.__CR0,500,2348,1264_PT0_SX650_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3b72aff9-718e-42fb-99c3-ccd90f98374c.__CR0,525,2508,1350_PT0_SX650_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dru Ha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUR62MXQUALQJX5LDFW3KOQBQLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PDE5V244R06D?ASIN=B09FM6PDHP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2023",
                "reviewTitle": "5.0 out of 5 stars At 50% or more off, these are great.",
                "reviewText": "I have one pair for work and one for home/going out. I wouldn’t have spent $100 on each pair but at $50 per pair they’re a good deal.The ANC is pretty impressive for little earbuds. Makes the background sounds in an IHOP at 9:30 on a Sunday nearly disappear. They also eliminate the sound of snoring dogs and humans.Took a recent trip on an airplane and opted to bring these instead of my Sennheiser Momentum 3’s. I’m an audiophile on a budget. They can’t compete with the over-ear Momentum for sound reproduction. But for earbuds they’re a great product at the sale price.There is a JBL app you can download to your smartphone but the controls are reasonably intuitive. I have big fingers so I probably miss the sweet-spot for function control more than the average person. I’ve found the bass to be a little lacking but I think that’s due to the EQ setting I’ve selected. You do have some EQ presets to choose between in the app.They come with three sets of the rubber earplugs for various sizes of ear-canals. Medium worked for me. I can use them to sleep, travel, shut out the loud noises in restaurants, and for Zoom calls.Consider the color you want to stand out against your bedding when they fall out if falling asleep with them in.I like them enough that I bought a second, dedicated pair for work.The ANC has three settings but so far I haven’t found one that totally mutes audio output from your device in the “ambient-aware” or “talk through” modes. That’s a feature I like on my Momentum. It can be accomplished by the extra step of just pausing playback with a tap on the right, then tap the left to toggle through the three ANC modes.They work great with an iPhone as well as Windows 10/11 computers.Much greater clarity the the JLAB go, which don’t seem to have any functional ANC. I should have spent the extra money at the get-go.Buy them when on sale. They’ll probably be fine for you.If ANC and a variety of EQ options are the most important features for you, spring for the current $300 - $400 Sony over-ears. I have a pair of those in the house-too. Their ANC is better but for the music I listen to the Sennheisers are #1. However I would recommend the Sonys for over-ear for the average listener and these for travel, etc. it’s a lot harder to lose a big set of cans than earbuds so I don’t want to invest too much in these little guys.JBL has always served me pretty well for the price in the pro-audio and live sound amplification area so I had some confidence in the name when I bought these.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Supershopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ2IXYFGUM6KQZWTTNQ4AJ2RRTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HLF1VYR6MPGV?ASIN=B09FM6PDHP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing and I am very fussy about sound quality!",
                "reviewText": "First time buyer of Bluetooth earbuds - it’s about time! I am super picky about sound, back in the 70’s as a teenager, I saved all my money to buy a Marantz receiver and tape deck. I loved the Marantz sound so much! I still have it and still use it.Anyway, OMG, the JBL earbuds are amazing! I compared them to the $300 Sony 1000XM5 and $300 Technics AZ80’s.The Sony’s were out of the running right away, the sound just wasn’t there and the app mainly just had canned sound profiles. Too controlling, no way to set custom EQ curves. If there was, I couldn’t find it. The app overall was horrible, however the one thing I liked was that it had a player in it. I know fit is a very individual thing, but these felt like they were going to fall out no matter which rubber fitting I used.The Technics have a very good sound and if I didn’t have the JBL’s to compare with, I would have gone with those. However, it only has one custom EQ setting. So if you want to modify it, the previous one is lost. The fit was better than the Sonys for me.The JBL’s have the best app and fit of all of them. The app lets you save multiple custom EQ curves! So you can choose from your own curves based on the song qualities. And they feel very solid in the ear. The sound is just amazing after you choose your curves. I cannot believe something at this price point could be this good. Only thing is I am not sure the noise cancelling has much if any effect. I need to compare the Technics for this. Doesn’t really bother me as I have never had or needed noise cancellation before. Highly recommended, you can’t possibly be disappointed with these.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Love",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZYWTX4DWEYTGWMVJVRWCJBXPIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E98JJK30KTBI?ASIN=B09FM6PDHP",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Great Sound, Weird Quirks",
                "reviewText": "Pros:- Sound quality is awesome! Love the ability to use the app for EQ.- Noise cancellation is superior! (So great for shopping during the holidays, you can block out all the crowd chatter and repetitively Christmas music!)- Ability to switch noise cancellation modes is easy! (So you can optionally listen to people speak while cutting out a few decibles like fan noise.)- Build quality is solid!- The JBL app works flawlessly!- They connect to phone and other devices easily, total plug & play!Cons:- They tend to disconnect more often, which isn’t that annoying per se — except it makes a beep sound to alert you that something is wrong. (The Apple earbuds just turn off, so there’s no jarring loud beep in your ears.) This is especially annoying when it happens in the middle of a song.- This one is weird — If you hold the two earbuds in your hand, and they touch in a certain way, it makes a loud chirping noise. (Almost like the feedback of two microphones being too close together.)- They’re kind of bulky, and fall out of my ears more often than the Apple AirPods did. Even after changing the rubber tips. (The bright side is that because they’re so bulky, they’re easier to find on the ground.)- Though you can use the JBL app to find your earbuds, it doesn’t help you find the charging chase.Conclusion:- For $50, I’ll keep ‘em! The sound quality is truly excellent enough to look past the weird quirks.And if they get lost, as most earbuds often do, it won’t break my wallet to do so. (The Apple ones are comfy and have less quirks, but kind of overrated at that price point.)So I would buy JBL earbuds again — though I might look into the smaller models, that maybe (hopefully) aren’t as prone to pop out of the ear like a cartoon bean.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RURABY DANIEL RODRIGUEZ ROMERO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 28, 2024",
                "reviewTitle": "Increible",
                "reviewText": "Muy buen producto se escucha demasiado bien lo cual lo hace un buen producto y su pila dura mucho en general un producto increible",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Excelente!!!Excelente!!!",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 17, 2024",
                "reviewTitle": "Recomendo.",
                "reviewText": "Excelente sonoridade! Consigo treinar e correr com eles. Só o sistema de cancelamento de ruído não é tudo isso que eles vendem talvez no futuro quando a tecnologia se desenvolver mais.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41g97Sso1zL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brently",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 3, 2023",
                "reviewTitle": "Great Sound",
                "reviewText": "The container is nicely finished and obviously fits the ear buds very well. I’m also very happy with the way they stay in my ears. Best Bluetooth set I’ve owned.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexander Rappoport",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 20, 2023",
                "reviewTitle": "I was pleasantly surprised by the sound and silence quality!",
                "reviewText": "I have been looking for some wireless headphones for a while now. Tried a few options under $100 but all of them were bad. Low audio quality, low voice quality or couldn't be heard in anything other than a quiet room, poor battery, poor connectivity, you name it.I was already set on increasing my budget to $150-$200 until I saw these JBL on sale for $70 (I think the original price was around $150) and knowing that JBL produce great sounding speakers figured I had nothing to lose by ordering them.They really hit the mark! for the money I paid I get very nice actual noise cancellation (I commute on subway to work and listen to podcasts) and great audio for music, podcasts, and conversations. Who ever I asked about the sound quality of my speech always replied I was crystal clear, no matter the surroundings (I'll admit that when standing next to a loud bus the quality diminishes, but that's just an outlier and no one, not even the $300 set, will be able to tune out that noise). They fit very snuggly in my ear and don't fall out even as I am pushed out the subway or working out.Pros:+ great value for money+ awesome audio+ very good noise cancellation for the pricecons:- haven't had any for nowOverall, I highly recommend getting these if they're on sale! I don't know if I'd pay full price for them as they have competition once you go to the $150-$200 price range.Will come back in a few months and update if something's not right.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 30, 2023",
                "reviewTitle": "Un achat parfait pour écouter de la musique ou communiquer",
                "reviewText": "La livraison a été plus rapide soit de deux jours, une livraison en point Amazon, le colis n'a pas été abimé ou ouvert",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}