{
    "remaining_requests": 48705,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Apple-Generation-Cancelling-Transparency-Personalized/dp/B0CHWRXH8B",
    "body": {
        "name": "Apple AirPods Pro (2nd Generation) Wireless Ear Buds with USB-C Charging, Up to 2X More Active Noise Cancelling Bluetooth Headphones, Transparency Mode, Adaptive Audio, Personalized Spatial Audio",
        "price": "$189.99",
        "originalPrice": "$249.00",
        "rawPrice": 189.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Apple-Generation-Cancelling-Transparency-Personalized/dp/B0CHWRXH8B",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CKM1GKSH"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/2110TEYPKnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31PbPujVDrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21yN7r6nkYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/11HqPOkX7kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/111YY-lLeYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21 6ulgbtLL.jpg",
            "https://m.media-amazon.com/images/I/61na4SrzoqL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fb043d87-2a63-4e0d-a0a3-52c8b536ea0d/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a52267e3-dc09-4e20-8ebb-c8b9febe92d2/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Apple Store",
            "link": "https://www.amazon.com/stores/Apple/page/77D9E1F7-0337-4282-9DB6-B6B8FB2DC98D?ref_=ast_bln"
        },
        "brand": "Apple",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 10028,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 14 hrs 12 mins",
            "FREE delivery Monday, February 19"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "RICHER AUDIO EXPERIENCE — The Apple-designed H2 chip helps to create more intelligent noise cancellation and deeply immersive sound. The low-distortion, custom-built driver delivers crisp, clear high notes and full, rich bass in stunning definition.",
            "NEXT-LEVEL ACTIVE NOISE CANCELLATION — Up to 2x more Active Noise Cancellation for dramatically less noise when you want to focus. Transparency mode lets you hear the world around you, and Adaptive Audio seamlessly blends Active Noise Cancellation and Transparency mode for the best listening experience in any environment.",
            "CUSTOMIZABLE FIT — Includes four pairs of silicone tips (XS, S, M, L) to fit a wide range of ears and provide all-day comfort. The tips create an acoustic seal to help keep out noise and secure AirPods Pro in place.",
            "DUST, SWEAT, AND WATER RESISTANT — Both AirPods Pro and the MagSafe Charging Case are IP54 dust, sweat, and water resistant, so you can listen comfortably in more conditions.",
            "PERSONALIZED SPATIAL AUDIO — With sound that suits your unique ear shape along with dynamic head tracking, AirPods Pro deliver an immersive listening experience that places sound all around you. You can also listen to select songs, shows, and movies in Dolby Atmos.",
            "A HIGHER LEVEL OF CONTROL — Manage playback functions from the stem with touch control. Swipe up or down to adjust volume, press to play and pause music or mute and unmute yourself on calls, and press twice to end calls. And hold the stem to switch between listening modes.",
            "LONG BATTERY LIFE — Get up to 6 hours of listening time with Active Noise Cancellation enabled. And get up to 30 hours of total listening time with Active Noise Cancellation enabled, using the case.",
            "A MORE CAPABLE CASE — Keep track of AirPods Pro with Precision Finding and a built-in speaker. A lanyard loop helps keep your AirPods Pro close. Charge with an Apple Watch or MagSafe charger, USB-C charge cable, or Qi-certified charger.",
            "MAGICAL EXPERIENCE — Conversation Awareness intelligently switches AirPods Pro into Transparency mode and lowers your media volume — so it’s easier to interact with people nearby when you choose to. Summon Siri with a simple “Hey Siri” or just “Siri.” AirPods Pro connect to your devices in a tap, pause music when you take them out, and seamlessly switch to the device you’re using. You can even share a song or show between two sets of AirPods.",
            "LEGAL DISCLAIMERS — This is a summary of the main product features. See “Additional information” to learn more."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Apple"
            },
            {
                "name": "Model Name",
                "value": "AirPods Pro (2nd Gen, 2023)"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Form Factor",
                "value": "In Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Weight",
                "value": "AirPods Pro (each): 0.19 ounce (5.3 g), MagSafe Charging Case: 1.79 ounces (50.8 g)"
            },
            {
                "name": "Dimensions",
                "value": "AirPods (each): 0.94 by 0.86 by 1.22 inches (24.0 by 21.8 by 30.9 mm), MagSafe Charging Case: 1.78 by 0.85 by 2.39 inches (45.2 by 21.7 by 60.6 mm)"
            },
            {
                "name": "AirPods Sensors (each):",
                "value": "Dual beamforming microphones, Inward-facing microphone, Skin-detect sensor, Motion-detecting accelerometer, Speech-detecting accelerometer, Touch control"
            },
            {
                "name": "Power and Battery",
                "value": "Up to 6 hours of listening time on a single charge (up to 5.5 hours with Personalized Spatial Audio and Head Tracking enabled), Up to 4.5 hours of talk time with a single charge. AirPods Pro with MagSafe Charging Case: Up to 30 hours of listening time, Up to 24 hours of talk time, 5 minutes in the case provides around 1 hour of listening time or around 1 hour of talk time"
            },
            {
                "name": "Additional information",
                "value": "Active Noise Cancellation performance measured as compared to AirPods Pro (1st generation). Adaptive Audio and Conversation Awareness work with AirPods Pro (2nd generation) with USB-C with the latest firmware when paired with a compatible Apple device running the latest operating system software. AirPods Pro (2nd generation) with USB-C are dust resistant and sweat and water resistant for non-water sports and exercise, and they are IP54 rated. Dust, sweat, and water resistance are not permanent conditions. Compatible hardware and software required for Personalized Spatial Audio with dynamic head tracking. Works with compatible content in supported apps. Not all content available in Dolby Atmos. iPhone with TrueDepth camera required to create a personal profile for Spatial Audio, which will sync across Apple devices running the latest operating system software, including iOS, iPadOS, macOS, and tvOS. Mute and unmute on calls available in compatible applications with the latest firmware. Battery life depends on device settings, environment, usage, and many other factors. MagSafe charging requires a compatible MagSafe charger. Wireless charging requires a Qi-certified wireless charger. AirPods Pro (2nd generation) with USB-C charging case also works with the Apple Watch charger or USB-C connector. Just “Siri” available in English (Australia, Canada, United Kingdom, U.S.). This feature is not available on AirPods with the H1 headphone chip and Intel-based Mac computers. Devices must support and have the latest operating system. One-tap setup, Automatic Switching, and Audio Sharing require a compatible Apple device running the latest operating system software. Device compatibility varies by feature. One-tap setup and Automatic Switching also require an iCloud account."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Digital Donkey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2JCQEWME2H6ZGCDIRIQWUKHSRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20WKFWRZ5FLOD?ASIN=B0CHWRXH8B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars The Symphony in Your Ears: Apple's AirPods Pro 2nd Gen, A Sound Revelation",
                "reviewText": "Apple's AirPods Pro (2nd Generation) Wireless Ear Buds with USB-C Charging soar into the tech stratosphere with a symphony of features, earning a resounding five-star rating. These aren't just earbuds; they're a testament to Apple's continuous innovation in audio technology, offering an immersive sound experience in a sleek, wireless package.The moment you pop these AirPods Pro into your ears, it's like stepping into your own personal concert hall. The sound quality is crisp, clear, and rich with detail, turning every song, podcast, or call into a high-fidelity auditory adventure. It's the kind of audio performance that makes you repeatedly rediscover your music library.Noise cancellation is another area where these earbuds shine. They create a cocoon of sound, cutting out the chaos of the world with an efficiency that's almost magical. It's like having a 'do not disturb' sign for your ears, perfect for those moments when you need to focus or just escape into your favorite tunes.But it's not all about blocking the world out. The transparency mode allows you to stay aware of your surroundings, blending your music with the ambient noise in a harmonious mix. It's a feature that's as practical as it is impressive, keeping you connected to the world when you need to be.The inclusion of USB-C charging brings these earbuds in line with the latest charging standards, adding a layer of convenience for those already in the USB-C ecosystem. It's a nod to universality and future-proofing, ensuring these earbuds are ready for the evolving tech landscape.And let's not forget the comfort. The AirPods Pro 2nd Gen are designed to fit snugly and comfortably in your ears, making them perfect for long listening sessions. They're so lightweight and unobtrusive you might even forget you're wearing them.TL;DR: Apple's AirPods Pro (2nd Generation) Wireless Ear Buds are an audio marvel, offering exceptional sound quality, effective noise cancellation, and convenient USB-C charging. They provide a comfortable, immersive listening experience, deserving of their five-star rating.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert Campbell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEQKNDZYSW6ZHA6356HBKMQIEOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RLU7LNEXM249?ASIN=B0CHWRXH8B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars A nice upgrade",
                "reviewText": "The button and microphone on one of my iPod Pro 1st gen. stopped working. So, I upgraded for Christmas.The upgrade was worth the money. Sound quality for music is excellent and for calls is very nice, and the noise canceling works really well. I did not have to get rid of my Comply tips either. The adaptive mode is interesting. If you sing with the music, it kicks in, and so you have to change to another mode. If you talk to yourself, it kicks in. It is great when you want it, and a nuisance when you don't.Changes I would suggest: In the adaptive mode, when I speak, the volume would mute, but the song or audiobook would continue. So, when the volume increased, I would miss the portion of the music or book. It would be nice if it paused and then resumed.Second, the volume control takes a great deal of practice. I still can't seem to get it to work right, and there are not any instructions to help. It is not that important, and I could look up for some help.Other than that, the buds work as expected. Battery life is acceptable, and I noticed they charge very quickly. When they are charging, I have Pinnacle P1s that provide great sound.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HJeffKHJeffK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDRFBA64VH2SHGAB5W27J4ZTKHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PQX3FG6BD7WJ?ASIN=B0CHWRXH8B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Really really really good.***Update***",
                "reviewText": "I am a rare duck in the tech space as I really don't have a preference between Android and iOS. I have traditionally carried an Android phone and used Apple tablets and laptops. I just honestly find Samsung's innovation in hardware more intriguing. That said, I recently bought a new iPhone 15 Pro for a second phone to leave in my house and saw these new Airpods on sale, so I scooped them. The move to USBC convinced me I need to try both. I have used darn near every credible earbud that has come to market in the last four years. Sony, Bose, B&W, Anker, Apple, Beats, Sennheiser, and many others. I have been chasing the perfect set. I think I found them here or, at the very least, found the closest thing there is to perfection. Here are my thoughts on the new Airpods Pro2:Sound: This is the one area that they don't win hands down, but they sound great. Many of my buds feature larger more well tuned drivers. Some even have dual drivers. Many have the option to upscale to more lossless sound by using AptX. None of that is here, but what Apple has done with sound is commendable. There is good separation between the highs, mids, and lows. Unlike previous Airpods, these things bring a very solid low end that can rumble a bit. I am not an audiophile, but these sound really good. I still think that the new Sony buds and Sennheiser buds are better but it isn't a landslide. Apple has nailed it with active noise cancelling here as well. While the Bose Quiet Comfort buds are still the GOAT for me, these are at least as good as the runner up from Sony. These block out all but the most sudden noises. Really good all around.Call quality: These are easily the best there is for calls. It really isn't close. They do an unbelievable job of masking background noise so folks on the other end can hear you. I was on a call with a friend who was using them as well and his son was in the background gaming. He was yelling at the game and, occasionally when he spoke, I could pick up on it a bit, but only when he spoke. The processing here is just so good.Form Factor: I hate stem style buds generally, but these are solid. They are light and have real balance in the ear. I think because the Pro's have silicone tips they just work better for me. The squeeze functionality makes these so accurate to use when compared to others that rely on tapping and the swipe volume control is really outstanding. For my ears, and this is subjective for sure, these are all day comfortable. You get a solid IP54 water and dust resistance, so these will hold up well in the gym.Battery Life: These are average in this space when compared with their peers. I am getting about five hours on bud. You get another three to four charges from the case. Many others are better here, but I find battery life to be perfectly acceptable for everyday use.Intangibles: There are almost too many things to mention here. First, the case is, as always, the best in the business. It is tiny, solid, packs a great battery, and has the most satisfying magnetic click when closing. I love the spatial audio. It is gimmicky but really fun when it is executed properly during a show or movie. The speech detection is amazing. As is the easy pairing and use on the iPhone. Find my buds is the BOMB. There is so much more that I will update later. These are very well thought out.Conclusion: For me, Apple has crushed it here. Having FINALLY moved to USBC (even if it took the EU to force them) makes all Apple things so much better. These buds might not be the best at much, but they are very good at everything. I can honestly say that these are the best buds on the market. Will I use others for different occasions? Yes, but I doubt that as long as I have an iPhone, I will use many of them often. Buy these now with complete and total confidence. Wow Apple, just wow! Well done!***Update*** So, I am three weeks in with these and I have a couple of other thoughts I should add. First, the thing that jumps off the page to me is the speaker built into the case. I have owned dozens of buds and this is a first to me. It is awesome. The case chimes when the buds are properly returned to the case. You get a low battery notification and it is also used to “find my AirPods.” It is simply brilliant and an example of how thoughtful some of Apple’s designs are. The case is simply next level and that means more than most people think since you interact with it regularly. The other thing that stands out is how much customization there is and how intuitive it is to set up in your settings. Sony offers similar customization and, in some ways more, but it takes a lot more work. Like I said, there are better options for a lot of things, but the polish and attention to detail here from Apple make these a clear winner overall. If you are on the fence, don’t be. I will update with anything else but these are easily the best all around buds on the market. Buy with confidence",
                "reviewVotes": "1,193 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61amS1U6t0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7141ZhyrvZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71cRiRs9NtL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71d+bFthWQL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samuel Herklots",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 28, 2023",
                "reviewTitle": "Expensive, but premium quality.",
                "reviewText": "The sound quality is fantastic, and the build quality is second to none. The usability is fantastic, as it connects to your phone in seconds, and it's never a hassle waiting for the devices to pair. Of course, it's quite expensive, especially compared to other wireless earbuds on the market, but it's apple, so that's expected. The design is beautiful, and they're comfortable to wear, provided you select the correct tip size (included).",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 25, 2023",
                "reviewTitle": "New iPhone used and seriously impressed",
                "reviewText": "I was a Samsung android user for about 15 years and finally decided to make the switch to iPhone with the new 15 Pro lineup, as I love my M1 MBP and I have been following Apple products from afar since. Now that the 15 lineup is USB C, I decided to go all in on the Apple ecosystem.I am blown away by these airpods. Thankfully the second gens come with XS ear tips, because that's the only size that doesn't slowly push themselves out of my ear.But let me get to what I really love about these things:- the seamless transfer of connection between my M1 macbook pro and iPhone. It happens in about 1.5 seconds flat as soon as I begin playing audio/video on another device. And somehow it also knows when I don't need it to transfer?! I don't even know.-the charging speed of the pods themseld. I think I just popped them into the case for 10 mins, less than 15 for sure, and they jumped from 18% charge to 80% just like that.-transparency and noise cancellation. Remarkable and I use both depending on my environment. Haven't really found a use for Adaptive mode after a while, but that's ok. When you're walking on a busy street, noise cancellation is so soothing. Drowns out like 90-95% of the traffic sounds.-conversational awareness is great too, but I generally leave it off unless I'm in a grocery store or somewhere that I might need to interrupt the audio by speaking to someone for a few seconds. Only time I use it.- Con: they're super slippery! I have dropped the pods a couple of times because of this, especially when you get any skin oils on them, but no damage so far. I also just got a silicone cover for the charging case, in hopes that the pods don't just eject themselves when you drop the whole case on the floor. I think that fixed my concern in some quick tests from a 2 foot drop on carpet, because I've seen them eject from that height before.BONUS: These airpod pro 2s with USB C have a special feature that lightning cable pro 2s do not! Lossless audio, but this only applies to using them with the Vision Pro. I probably won't but the Vision Pro any time soon, but it's good to know that I will have that feature should I ever get them in the future.Buy these at full price or especially buy them when you see them 10-17% off. You will NOT be disappointed.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jewy McJew",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 4, 2024",
                "reviewTitle": "Surprisingly great & affordable hearing-aids",
                "reviewText": "Amazing voice clarity & background noise blocking. Best since the \"Bose Hearphones\" which was unfortunately discontinued.The UI is surprisingly clumsy and poor battery life compared to a Hearing Aid of course. But at 1/10th the price, it's a no brainer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Taylor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 31, 2024",
                "reviewTitle": "If you have an iPhone you need these",
                "reviewText": "I have been a die hard android user for a majority of the time they have been on the market until this year, and I am beyond pleasantly surprised at the quality of products Apple puts out.I saw that someone else referred to apple products and peripheries as an “ecosystem” and honestly it’s fitting. Incredibly easy to connect to my devices, and seamless transfer of audio between iPhone and iPad.Battery life on the AirPods are actually better than I originally expected, I can get around 8 hours of use out of them depending on the settings being used. Huge bonus is the optimized charging so that the batteries don’t deteriorate as quickly.Sound quality is really good, the noise cancelling works exactly how it should and it’s impossible for me to hear someone talking to me from less than a foot away when it is on. Spatial Audio is also a really nice feature, especially when I’m cleaning around the house and want to listen to a more personalized sound instead of over the speaker.The huge plus for me is Siri reading my texts and other incoming messages out to me so that I don’t have to stop what I am doing to pull my phone out and read messages every five seconds.The only major downside to anything from Apple is the price tag attached to their products, but if you have the means to get these I definitely recommend them",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarath MohanSarath Mohan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2024",
                "reviewTitle": "AirPods Pro 2nd Gen: Unparalleled Sound, Comfort, and Innovation!",
                "reviewText": "I am thoroughly impressed with the AirPods Pro 2nd Gen! The sound quality is exceptional, providing a rich and immersive audio experience. The active noise cancellation is a game-changer, ensuring a distraction-free listening environment. The sleek design and comfortable fit make them a joy to wear, and the improved battery life is a definite plus. Overall, a fantastic upgrade from the previous version, and I highly recommend these AirPods Pro 2nd Gen for anyone looking for top-notch wireless earbuds.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71F+0O2w5qL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}