{
    "remaining_requests": 48692,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Plantronics-87300-41-RB-Voyager-Wireless-Bluetooth/dp/B00TJ0PGDS",
    "body": {
        "name": "Plantronics 87300-41-RB Voyager Legend Wireless Bluetooth Headset - Black (Renewed)",
        "price": "$69.99",
        "originalPrice": "",
        "rawPrice": 69.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Plantronics-87300-41-RB-Voyager-Wireless-Bluetooth/dp/B00TJ0PGDS",
        "soldBy": {
            "sellerID": "A18VKNJVCFOGJM",
            "name": "Park Deals",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A18VKNJVCFOGJM&asin=B00TJ0PGDS&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41gW1S4WbBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31-66cQf90L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Xv5M0EOJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41M2tlwqw2L.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Park Deals",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 1574,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "Smart Sensor technology intuitively directs calls to phone or headset pauses music for incoming calls allows automatic answer by simply placing the headset on your ear",
            "Multi microphones optimize voice and minimize noise caused by wind movement and background sounds",
            "Tap the voice button to check battery level connection status or dial Vocalist* hear emails newsfeeds and more. Say inanswerin to accept a call or inignorein to decline",
            "Separate power mute and volume buttons provide easy access and control"
        ],
        "description": "Plantronics Voyager Legend is the newest headset in the Voyager family to deliver unsurpassed audio clarity and all‐day comfort. Combining triple‐mics that cancel noise and wind, voice commands, and Smart Sensor technology, Voyager Legend understands how and when you want to talk. Sensors react when you put the headset on, letting you quickly take a call without a click. If you're already wearing it, Voyager Legend announces who's calling and waits for you to say \"answer\" or \"ignore.\" Simply tap the voice command button and ask to check battery level, connection status, and more. With technology this nimble, Legend is the first truly intelligent Bluetooth headset. Ideal for the mobile professional who needs wireless communications anywhere they work, the Voyager Legend can conveniently connect to your favorite mobile devices--smartphone or tablet--to ensure a seamless connection regardless of the device being used. You can also use the free MyHeadset app to display the battery meter on your Android smartphone. Offering a balanced, comfortable design, the Voyager Legend has a 25 percent smaller body size (compared to the Voyager PRO HD) and features up to 7 hours of talk time. Offering a high level of audio quality, the Voyager Legend enables you to roam into any environment with the confidence that every word will be heard clearly. The enhanced Digital Signal Processing (DSP) provides a more natural voice sound, while the wideband audio with noise cancellation capabilities enable clearer conversations over PC telephony. Finally, SoundGuard technology ensures listening comfort and acoustic limiting for protection against audio spikes. More than just taking calls on your mobile phone or tablet, the Voyager Legend also includes the A2DP Bluetooth profile, enabling you to stream music, podcasts, GPS directions, and other audio. Please Note: This product comes with 1 earbud. Does not include additional earbuds.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Accessories & Supplies",
                "link": "https://www.amazon.com/Accessories-Supplies/b/ref=dp_bc_aui_C_2?ie=UTF8&node=281407"
            },
            {
                "name": "Telephone Accessories",
                "link": "https://www.amazon.com/Telephone-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172607"
            },
            {
                "name": "Headsets",
                "link": "https://www.amazon.com/Headsets-Telephone-Accessories-Supplies/b/ref=dp_bc_aui_C_4?ie=UTF8&node=229193"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "4 x 2.5 x 0.4 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.64 ounces"
            },
            {
                "name": "ASIN",
                "value": "B00TJ0PGDS"
            },
            {
                "name": "Item model number",
                "value": "MAIN-88852-RB"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 1,574 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#53,972 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #208 in Telephone Headsets #4,387 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "Yes"
            },
            {
                "name": "Wireless communication technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Connectivity technologies",
                "value": "Wireless"
            },
            {
                "name": "Special features",
                "value": "Noise Cancellation"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Form Factor",
                "value": "In Ear"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Phone Talk Time",
                "value": "7 Hours"
            },
            {
                "name": "Manufacturer",
                "value": "Plantronics"
            },
            {
                "name": "Date First Available",
                "value": "February 13, 2015"
            },
            {
                "name": "Weight",
                "value": "0.04 Pounds"
            },
            {
                "name": "Units",
                "value": "1.0 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Plantronics"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Wireless Communication Technology",
                "value": "Bluetooth"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alejandro R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESJCPLG7FCE2SSMSHDLHI5A2EDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TI72GR2WCOWT?ASIN=B00TJ0PGDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Plantronics 87300-41-RB Voyager Legend Bluetooth Headset Review",
                "reviewText": "The Plantronics 87300-41-RB Voyager Legend Wireless Bluetooth Headset is a reliable and versatile headset designed to provide enhanced communication in various environments. With its advanced features and comfortable design, this headset is a perfect companion for professionals, commuters, and anyone in need of hands-free communication. In this comprehensive review, we will explore the features and benefits of the Plantronics 87300-41-RB Voyager Legend Bluetooth Headset, highlighting its performance, comfort, and versatility.Crystal Clear CommunicationThe Plantronics 87300-41-RB Voyager Legend Bluetooth Headset offers exceptional audio quality, ensuring crystal clear communication. Equipped with precision-tuned triple microphones and noise-cancellation technology, this headset filters out background noise, allowing you to hear and be heard with clarity. Whether you're taking important business calls or enjoying hands-free conversations on the go, the Voyager Legend delivers an immersive communication experience.Convenient and Comfortable DesignDesigned for all-day use, the Plantronics 87300-41-RB Voyager Legend Bluetooth Headset prioritizes comfort without compromising on functionality. The ergonomic design fits securely and comfortably on your ear, providing a snug fit even during extended wear. The headset features intuitive controls, allowing you to answer calls, adjust volume, and activate voice commands with ease. Its lightweight construction and durable materials make it the ideal choice for those who require a headset that can keep up with their active lifestyle.Wireless Freedom and VersatilityThe Plantronics 87300-41-RB Voyager Legend Bluetooth Headset offers wireless freedom, allowing you to stay connected without the hassle of tangled wires. With Bluetooth connectivity, you can easily pair the headset with your smartphone, tablet, or other Bluetooth-enabled devices. The headset also supports voice commands, enabling hands-free operation and enhanced productivity. Whether you're driving, working, or multitasking, the Voyager Legend keeps you connected and in control.Renewed Quality AssuranceThe Plantronics 87300-41-RB Voyager Legend Bluetooth Headset is renewed, ensuring its quality and performance. Renewed products undergo thorough testing and inspection to meet high standards before being made available for purchase. This allows you to enjoy the benefits of a premium headset at a more affordable price. The renewed Voyager Legend headset offers the same reliability and functionality as a brand new device, providing excellent value for your money.ConclusionThe Plantronics 87300-41-RB Voyager Legend Wireless Bluetooth Headset combines exceptional audio quality, comfort, and wireless convenience to deliver an outstanding communication experience. With its crystal-clear sound, convenient controls, and versatile design, this headset is an excellent choice for professionals and individuals on the move. Enjoy hands-free communication with the renewed Plantronics 87300-41-RB Voyager Legend Bluetooth Headset and elevate your communication capabilities to new heights.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luke Rogers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHS7IBTYDR4JCTGWIFS77OKEDF5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFM8MVQZBWWM8?ASIN=B00TJ0PGDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2015",
                "reviewTitle": "5.0 out of 5 stars Review after 2 months.",
                "reviewText": "The is a great piece. I bought two. One for me, and one for my girlfriend, and they work perfectly. The noise reduction is truly impressive. I can be walking in the wind outside, and she can be driving her loud car, and the sound is near perfect. When she is driving, it sounds like she is a quiet room, where before she would need to shout into her iphone 6, and I would need to strain to hear her. The operation is very simple, but still full of features. She is not good with technology... at all, but she can easily use this after I walk her through pairing it. I love finding all of the options, and there are plenty to find. My favorite is the feature that disables the headset when you aren't wearing it, and knows when you put it on. With my other device, I would always forget it was in my pocket, and go to answer the phone, and they would not be able to hear me, so they would hang up before I switched the audio. Doesn't happen any more. When this one is in my pocket, I answer the phone, and the audio is on my phone. I then put the bluetooth on, and it automatically either answers the call if it is still ringing, or switches audio to the bluetooth. It works great. The fit over the ear is very comfortable. She is really picky about headphones and how things fit in her ear, but this stays in place perfectly. It is easy to put on, and easy to switch ears. overall, I love it.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason Spencer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4DBRNEJINUYCQMNYE5OAOO2XOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C2L6DFSUNT94?ASIN=B00TJ0PGDS",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2015",
                "reviewTitle": "1.0 out of 5 stars Battery Dead in first 4 months, no one cares...",
                "reviewText": "As of this review, ordering a brand new Voyager Legend directly from Plantronics on Amazon can be had for and extre $10 by going here -- Plantronics Voyager Legend Wireless Bluetooth Headset - Compatible with iPhone, Android, and Other Leading Smartphones - Black .I highly recommend you take that option, if for no other reason you'll get a full 1-year warranty instead of just 90-days that the third party sellers are supplying. My seller that I purchased from was \"Pavilion Electronics\" and I contacted them exactly 120 days after my original order. The unit I received wasn't really holding a charge that well, but now I can charge it to full and even if I turn it off it will be dead within a few hours. (Or at least to the point it tells me to recharge already.)I'm sure this is a great headset. The first month I had it, I loved it -- except for the lack of talk time. Sounded good with my iPhone 6. They've fixed the power button issued I had with the old Voyagers. The boom mic doesn't smack the side of my cheek and rub my beard like the older models did.I'll likely order a new one, direct from Plantronics. At least then I know I'll get a solid year of usage for $65 instead of about three months for roughly the same price.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZAHW2NQT2ZZPXLXB5MXYLBTHHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZP3QK3CZ1UXK?ASIN=B00TJ0PGDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2015",
                "reviewTitle": "5.0 out of 5 stars Best wireless bluetooth available at any price.",
                "reviewText": "Best bluetooth headset I have ever used. Comfortable and amazing at killing even the noisiest traffic. I was outside a Starbucks talking to a client and was recording the conversation. I honestly thought that it must be very hard to hear me even though the client assured me there was not problem from their side. The noise from the traffic was so loud I could barely hear myself talking. When I got off the call I immediately played back the conversation and to my surprise, it honestly sound as if we were the only people in a quite room. There was no hint of background noise even with lulls in the conversation. It gives me 5 to 7 hours of talk time and easily self attaches to the magnetic charging cable. The only drawback is that it does require a special charging cable but that is not too big of a problem but does add $10 to $20 to the cost of owning since I went ahead and bought 2 extra charging cable, one for the car and one to carry in my computer bag. Because if you don't have this cable you cannot charge the headset. Not enough of a negative to even drop a star because it performs so well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pearl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 2, 2019",
                "reviewTitle": "Great earpiece, nice and clear",
                "reviewText": "I love this earpiece alot",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 6, 2017",
                "reviewTitle": "Auricolare",
                "reviewText": "Ottimo articolo, funziona alla perfezione lo consiglio a tutti in maniera particolare a chi guida e usa molto il telefono",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gfiery",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 22, 2016",
                "reviewTitle": "Top notch",
                "reviewText": "Best Bluetooth I've had yet ... this is my 5th different headset and it's so easy to use ...voice activated and very clear reception & told by folks I call they can hear me really clearly too",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "alain ouimet",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 9, 2020",
                "reviewTitle": "👍",
                "reviewText": "👍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 2, 2017",
                "reviewTitle": "Amazing",
                "reviewText": "Amazingly perfect",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}