{
    "remaining_requests": 48816,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beats-Studio-Cancelling-Earbuds-Built-Bluetooth-Headphones/dp/B096SV8SJG",
    "body": {
        "name": "Beats Studio Buds - True Wireless Noise Cancelling Earbuds - Compatible with Apple & Android, Built-in Microphone, IPX4 Rating, Sweat Resistant Earphones, Class 1 Bluetooth Headphones - Black",
        "price": "$99.95",
        "originalPrice": "$149.95",
        "rawPrice": 99.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beats-Studio-Cancelling-Earbuds-Built-Bluetooth-Headphones/dp/B096SV8SJG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CM71KCBP"
        ],
        "asinVariationValues": [
            {
                "asin": "B096SV8SJG",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31XcVBWCTmS._SS36_.jpg"
            },
            {
                "asin": "B09VWH36DH",
                "variationName": "Color",
                "variationValue": "Moon Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31fRD1+1lcL._SS36_.jpg"
            },
            {
                "asin": "B09WQ1FB5R",
                "variationName": "Color",
                "variationValue": "Ocean Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/310ImJwQbNL._SS36_.jpg"
            },
            {
                "asin": "B096SSCV5K",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31NOHEZImRS._SS36_.jpg"
            },
            {
                "asin": "B09WPMT8TG",
                "variationName": "Color",
                "variationValue": "Sunset Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31j5Br8h5NL._SS36_.jpg"
            },
            {
                "asin": "B096SRYXMP",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21JLvMbsgES._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31XcVBWCTmS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Yh4YM3q0S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4145n RUH1S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qrDKG4Q4S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Vt8UgHqrS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lg-WL2HuS.jpg",
            "https://m.media-amazon.com/images/I/81jX5MqqlSL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ed1127ce-a6f7-47d6-8d45-03c1ba913abf/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/74bb131a-0a2f-46e6-a0b2-86bddeedf447/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/61goSf4vIVL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/61goSf4vIVL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Beats Store",
            "link": "https://www.amazon.com/stores/Beats/page/395474F7-47DA-4331-929B-3ED7C7DC2C43?ref_=ast_bln"
        },
        "brand": "Beats",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 83966,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 26 mins",
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Custom acoustic platform delivers powerful, balanced sound",
            "Control your sound with two distinct listening modes: Active Noise Cancelling (ANC) and Transparency mode",
            "Three soft ear tip sizes for a stable and comfortable fit while ensuring an optimum acoustic seal",
            "Up to 8 hours of listening time (up to 24 hours combined with pocket-sized charging case)",
            "Industry-leading Class 1 Bluetooth for extended range and fewer dropouts",
            "High-quality call performance and voice assistant interaction via built-in microphones",
            "IPX4-rated sweat- and water-resistant wireless earbuds",
            "Beats wireless headphones and earphones are compatible with Apple and Android devices",
            "What’s in the box – Beats Studio Buds true wireless noise cancelling earphones, charging case, ear tips with three size options, USB-C to USB-C charging cable, Quick Start Guide, warranty card (USB-C power adapter sold separately)"
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Beats"
            },
            {
                "name": "Model Name",
                "value": "Studio Buds"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "In Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "AirPlay, Wireless, Bluetooth"
            },
            {
                "name": "Weight",
                "value": "Studio Buds (each): 5g, Case: 48g, Total: 58g"
            },
            {
                "name": "Dimensions",
                "value": "Length: (case) 7.2cm / 2.83in (bud) 2.05cm / 0.81in, Width: (case) 5.1cm / 2in (bud) 1.85cm / 0.73in, Height: (case) 2.55cm / 1in (bud) 1.5cm / 0.59in"
            },
            {
                "name": "Power and Battery",
                "value": "Beats Studio Buds (single charge): up to 8 hours of listening time. Fast Fuel: a 5-minute charge provides up to 1 hour of playback."
            },
            {
                "name": "Release Date",
                "value": "6/25/2021"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "philip seitzphilip seitz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMDCDCHBIWSEI6RDYBCY4MXXVZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EO2GBST2UICI?ASIN=B096SV8SJG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Initial review and comparison to other brands",
                "reviewText": "I love these earbuds. They feel definitely worth the price and a all around great buy. Giving me exactly what I was looking for.For years I have used the raycon E55 and some of the features I loved about raycon was the manual button in the earbuds, excessive bass and great inside-ear fit.Recently however, raycon has gone the way of the world— they have put sensors on the earbuds in the place of buttons and Balanced out the audio. So I began my search for new earbuds.—THE SOUND—Both the AirPods, galaxybuds and raycons I have tried tend to be balanced and prioritize giving equal notes to all instruments For a clear and concise sound, But to someone who is not an audiophile it sounds very flat and devoid of the punch that I desire. For me- I want it to be great sounding but also noticeably bass heavy. These Beats Studio buds deliver. The company recognizes that your not using these to analyze a song. These are for the people who like bass and want to feel some gravitas in their ears!—CONNECTIVITY—These connect effortlessly to iPhone, as if they were AirPods. It was the single biggest factor that blew me away with these. They are incredibly easy to connect. I cannot speak for android but these work great. They do not have a lot of audio adjustments like Bose but I frankly don’t need them to. You can easily see the battery state on both buds and the case from a pop up window in your apple home screen whenever opening the case, just like AirPods.—FIT—The fit is not as good as the raycon E55 but only by a little bit. They fit snuggly in your ears well enough that they do not fall off when running and working out. Although adjustments might need to be made to them occasionally. (I have small ears, so the fit is review as such)—THE CONTROLS—The controls are simple and straightforward. They are just like what you come to expect from earbuds. Single tap, double tap, triple tap.The earbuds HAVE AN ACTUAL BUTTON… which I thought was extinct, I personally hate the sensor buttons because adjusting your earbuds in your ears would trigger the controls.While these do have a very sensitive physical button— it is easy to avoid while adjusting with practice.—BATTERY—The battery lasts me all day, what more do you want?—RANGE—Very good, about 30+ feet—CONS—-no MagSafe compatible charging-fit isn’t as perfect as some brands but is really good-if your an audiophile these earbuds are not balancedFinal call-If you like bass, and hate the sensor controls on most earbuds— these very well could be the best earbuds you could get. These are on par with earbuds in the 200$ range. And if your anything like me, you will love them! And if not, they might still be worth it to you—UPDATE—they have a hard time staying in when working out, and so I had to buy wing tips for these. They automatically have active noise cancellation on when you take them out of the case… which I personally hate.And the cases battery is pretty short lived… only lasts two days generally",
                "reviewVotes": "366 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61jPut6+1qL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71M3NbgKTkL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Connor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEITP6Y25NKH3KB2LXWQCC7STIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUUJJA0TERA67?ASIN=B096SV8SJG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2022",
                "reviewTitle": "5.0 out of 5 stars Compared to 4 other Earbuds...",
                "reviewText": "I bought these earbuds along with 4 other pairs, with the intent of comparing them over a couple weeks and returning all but my favorite. Here were the results:Beats Fit Pro - https://www.amazon.com/dp/B09JL65GNM?psc=1&ref=ppx_yo2ov_dt_b_product_detailsPros – These buds had some great base, and the wingtip gave them a fit that made them refuse to fall out of my ears. But the best feature? Physical “clicky” buttons on each one of the buds. You press in and hear/feel the click, rather than relying on a touchscreen-like feature. No need to guess if you tapped them once or twice, you will know.Cons – The wingtip gives a very sturdy fit, but not the most comfortable. I wouldn’t recommend to anyone with smaller ears. The noise canceling was solid, but nothing special. And this may be picky, but I didn’t care for most of the color schemes available. I prefer my earbuds to be hard to notice, and even the black ones have a bright red letter “b” in the middle.Beats Studio Buds - https://www.amazon.com/dp/B096SV8SJG?psc=1&ref=ppx_yo2ov_dt_b_product_detailsPros – Very comfortable with the same great physically “clicky” buttons as the Beats Fit Pro. Noise canceling seemed slightly better than average. Great base. Classic look.Cons – Tested during a workout, a little bit of sweat had these sliding right out of my ear. The case for these earbuds also was the flimsiest of any I had tested, with a very weak hinge that I was scared of breaking off within the 2 weeks of using.Samsung Galaxy Buds Pro - https://www.amazon.com/dp/B08MWZHHKP?psc=1&ref=ppx_yo2ov_dt_b_product_detailsPros – A neat feature that I noticed only in these earbuds was that it had noise amplification as well as noise cancelation. With one swipe in the app, the surrounding sound was actually louder and clearer than it would be without the earbuds in. Great if you are hard of hearing, or just enjoy snooping on conversations out of reach.Cons – Similar to the Beats Studio Buds, these didn’t stay in during a workout. They were usable, but every 10 minutes I found myself pushing them back into my ear. And this is an opinion, but these are the ugliest earbuds out of the bunch. The shiny black gleam made it look like a large beetle was hanging out in my ear. No visible brand placement either, which makes them appear cheap and generic rather than the quality Samsung they are.Samsung Galaxy Buds Live - https://www.amazon.com/dp/B09TBM1L3S?psc=1&ref=ppx_yo2ov_dt_b_product_detailsPros – Cost effective! I added these to the test group because of the unique shape, and for that they are worth giving a try. If you have small ears and do not like the rubber insert that is standard in most other earbuds, these may be perfect for you.Cons – Poor fit for large ears. These were tested the least of all of the buds, because the fit was so bad for my ear shape that they wouldn’t stay in if I turned my head too fast.Bose QuietComfort - https://www.amazon.com/dp/B08C4KWM9T?psc=1&ref=ppx_yo2ov_dt_b_product_detailsPros – Bose noise canceling is unmatched. If your primary use for earbuds is to cancel out that background white noise, this is the pair for you. The sound quality is great, not too heavy on the base. The case for the earbuds stood out from the rest as the only one that impressed me. Felt very study, and I had no worries tossing it into a gym bag or cup holder. The only case with a button latch to make sure it doesn’t open accidentally.Cons – This was the most expensive pair of earbuds by a longshot, and there were still some things I felt could be improved. The rubber inserts had more of a “flayed” shape rather than the “rounded” shape that is standard. My guess is that this was by design, because the earbuds were also slightly heavier than others and may need that extra in-ear grip. The flayed shape did make them sturdier, but at the cost of them being uncomfortable in an active situation. They were also the largest earbuds, and stuck out from the side of my head further than I would have liked.My favorite? The beats fit pro! While I wouldn’t recommend this pair for everyone, it was perfect for my routine. My music taste benefits from the boosted base, and the wingtip shape was perfect for any workouts. The feature that really convinced me was the physical buttons, something that I didn’t realize how desperately I needed.",
                "reviewVotes": "1,785 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2024",
                "reviewTitle": "Great Value",
                "reviewText": "I purchase these Earbuds for my husband's Christmas gift. He loves them, the sound quality is fabulous, product quality is awesome. I also purchased it at a great price. You can't go wrong with this purchase.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis Enrique Nogales López",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 14, 2023",
                "reviewTitle": "Cumple muy bien las expectativas",
                "reviewText": "Son un muy buen producto. Cómodos, batería que cumple y un muy buen sonido para mi gusto. El único pero que le pondría a a la caja, en específico la tapa que se siente frágil. No son tan baratos pero valen lo que se paga.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on January 8, 2023",
                "reviewTitle": "Excellent buy",
                "reviewText": "Item received in good order, delivery was as promised, happy with the purchase",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Álvaro c.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 8, 2023",
                "reviewTitle": "Valen la pena",
                "reviewText": "La garantía llegó caducada, pero decidí quedarme con ellos por el costo, hasta ahorita están súper bien , la cancelación de ruido y todo funciona perfecto, no se me caen al hacer ejercicio , les dura la batería bastante, en general dudo muchísimo que me vayan a fallar y necesitar esa garantía, llego sellado y todo en orden , totalmente nuevos !!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arda Gunel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 14, 2022",
                "reviewTitle": "nice one",
                "reviewText": "It is my first wireless headphone. Yet I cannot compare it with other devices. I am using this for 20 days and here is my review:+the grip is okay. they didn't dropped from my ear while doing some physical activity and for long time usage.+i liked the noise cancelling. it was sufficient for me. / in some cases normal mod was also enough.+EQ mid. good for people who listens different types of music.+battery life is okay.+sound quality is okay.+mic tries to block noises.+i think approximately 1.30 hour needed for full battery charge which was okay.+type C to C charger+easy connection.+find my earbuds feature with iphone-transparency is mid. near than half of the times i really understand what people were saying. i mostly get off one of them while speaking with people beside me.-EQ mid. it may felt dull for some.-mic is not the best thing in this set. while trying to block some noises, like wind etc., it gives your sound very low to the other people. / while ordering coffee or in public transport, it captures environmental noises like your normal vocal sound so the people you are speaking may have a hard time.-type C to C charger-hard to change devices. cannot use with multiple devices",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}