{
    "remaining_requests": 48554,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/RUNOLIM-Cancelling-Headphones-Playtime-Microphone%EF%BC%8CBluetooth/dp/B0BR9QJS5R",
    "body": {
        "name": "RUNOLIM Hybrid Active Noise Cancelling Headphones, 65H Playtime, Built-in Microphone, Bluetooth Wireless Over Ear Foldable Headphones with HiFi Audio, Home Travel Office",
        "price": "$16.99$16.99",
        "originalPrice": "$21.24",
        "rawPrice": 16.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/RUNOLIM-Cancelling-Headphones-Playtime-Microphone%EF%BC%8CBluetooth/dp/B0BR9QJS5R",
        "soldBy": {
            "sellerID": "AW2XZKXYQ92BG",
            "name": "RUNOLIM Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AW2XZKXYQ92BG&asin=B0BR9QJS5R&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CV5CYLDT"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BKPRTRXK",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$13.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41cXL0jBTRL._SS36_.jpg"
            },
            {
                "asin": "B0BR9QJS5R",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$16.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41tCiRnReqL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41tCiRnReqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51atOsKUaUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41deWxlQkeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DuaGu4RGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51eIHmKibwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514Js1JXjHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51aXGaLqrRL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/D1w00T3c2qL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/D1w00T3c2qL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the RUNOLIM Store",
            "link": "https://www.amazon.com/stores/RUNOLIM/page/772A98F7-D4B0-45B9-A0CD-D875F95DC439?ref_=ast_bln"
        },
        "brand": "RUNOLIM",
        "merchantInfo": "RUNOLIM Store",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2994,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 12 hrs 45 mins",
            "FREE pickup Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 12. Order within 11 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "ADVANCED ACTIVE NOISE CANCELLATION: RUNOLIM Hybrid Active Noise Canceling Headphones have been proven to effectively reduce external ambient noise by 95% in over 10,000 experimental results, allowing you to enjoy true pure music and focus on your own business, no matter on a noisy street or coffee shop.",
            "Hi-Fi Audio & HD MICROPHONES: For immersive music performances, RUNOLIM wireless bluetooth headphones adopted updated sound processing technology, can easily handle bass and mid-range sound details, built-in high-definition microphone, can clearly capture your real voice when using voice assistant, video conference, or online class.",
            "65 HOURS PLAYTIME & BACKUP AUDIO CABLE: Low power consumption technology allows Runolim bluetooth headphones can continuously play up to 65 hours in standard music mode, up to 40 hours in ANC mode. By included 3.5mm audio cable, you can also change it to wired mode when powers off, no power shortage problem anymore.",
            "SEAMLESS BLUETOOTH 5.3 CONNECTION: Foldable and adjustable design makes RUNOLIM headphones suitable for different head sizes people. Bluetooth 5.3 wireless connection technology enables ultra-fast and stable connections within a range of 33 feet (10 meters). Compatible with All Devices with Bluetooth Enabled or 3.5mm Audio Jack.",
            "ULTRA-COMFORTABLE DESIGN: The Ear muffs of the over-ear headphones are made of protein leather which mimics the texture of human skin, perfectly fits over your ears without any pressure. 30 days of free returns and 1years warranty is RUNOLIM guarantee, please feel free to contact us if you have any questions during using."
        ],
        "description": "RUNOLIM Active Noise Cancelling Headphones Designed to be Your Soulmate Multiple Compatibility: totally compatible for your mobile (Andriod and iOS System), tablet, Chromebook, Laptop and PC. Advanced Active Noise Cancellation Technology: cancel out unwanted ambient engine noise. Powerful Battery Life: ultra long standby time, up to 65 hours in standard music mode, up to 40 hours in ANC mode. Comfortable and Adjustable: earmuffs with memory protein foam, adjustable headband suit for different head sizes. Easy to Carry: headphones are foldable and portable. Advanced Active Noise Cancellation Technology: cancel out unwanted ambient engine noise. Powerful Battery Life: ultra long standby time, up to 65 hours in standard music mode, up to 40 hours in ANC mode. Comfortable and Adjustable: earmuffs with memory protein foam, adjustable headband suit for different head sizes. Easy to Carry: headphones are foldable and portable.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "Over-Ear Headphones",
                "link": "https://www.amazon.com/Over-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097479011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7.35 x 6.46 x 3.18 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.26 Kilograms"
            },
            {
                "name": "ASIN",
                "value": "B0BR9QJS5R"
            },
            {
                "name": "Item model number",
                "value": "WH301A"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,994 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,952 in Electronics (See Top 100 in Electronics) #444 in Over-Ear Headphones"
            },
            {
                "name": "Date First Available",
                "value": "December 29, 2022"
            },
            {
                "name": "Manufacturer",
                "value": "RUNOLIM"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "RUNOLIM"
            },
            {
                "name": "Color",
                "value": "Blue"
            },
            {
                "name": "Form Factor",
                "value": "Over Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Wireless Communication Technology",
                "value": "Bluetooth"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "RUNOLIM Active Noise Canceling Headphones - 65Hours Playtime, Wireless Bluetooth Headphones, HiFi Sound Quality, and Deep Bass Experience quiet with RUNOLIM Active Noise Cancelling Headphones.Runolim headphone featuring advanced chips and a hybrid noise reduction algorithm, is designed to isolate and eliminate noise across various frequencies.Extensively tested with over 10,000 experiments, RUNOLIM ANC headphones can significantly reduce ambient noise by up to 95%, providing you with exceptional audio quality and tranquility.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0203ad1-9276-4e1c-8511-d288362d9ab9.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "What You Get RUNOLIM ANC Headphones cancel out unwanted ambient engine noise. Active noise cancelling technology is also a effective way to protect your hearing health. RUNOLIM ANC Headphones USB Type-C Charging Cable 3.5mm Audio Cable User Manual RUNOLIM Active Noise Cancelling Headphones Designed to be Your Soulmate Multiple Compatibility: totally compatible for your mobile (Andriod and iOS System), tablet, Chromebook, Laptop and PC. Advanced Active Noise Cancellation Technology: cancel out unwanted ambient engine noise. Powerful Battery Life: ultra long standby time, up to 65 hours in standard music mode, up to 40 hours in ANC mode. Comfortable and Adjustable: earmuffs with memory protein foam, adjustable headband suit for different head sizes. Easy to Carry: headphones are foldable and portable. Advanced Active Noise Cancellation Technology: cancel out unwanted ambient engine noise. Powerful Battery Life: ultra long standby time, up to 65 hours in standard music mode, up to 40 hours in ANC mode. Comfortable and Adjustable: earmuffs with memory protein foam, adjustable headband suit for different head sizes. Easy to Carry: headphones are foldable and portable.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e5b64053-05d5-4cfe-81ce-93cfb5f4403a.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0776f56-bd2c-4d65-b119-1bc212d385d7.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Bass Boost Technology With dual 40mm drivers and most adcanced sound processing technology, RUNOLIM headphones over ear can easily handle bass and mid-range sound details, to offer an almost concert hall-like feel to your favorite music Transparency Mode & ANC Mode Transparency Mode: Use ClearAware Mode to stay aware of your surroundings and connected while enjoying music. ANC Mode: Immerse in musical bliss with ANC Mode, blocking distractions for exceptional sound. Easy to Carry RUNOLIM adopts a foldable, adjustable design, ensuring greater convenience whether neatly packed in a backpack or comfortably draped around your neck. This design simplifies operation and enhances portability.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cfbdca7d-9d0d-41cd-ab3d-86c21e5711c3.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36022a7c-aa83-495a-9ba7-29183f62b43b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f57ec040-f8a5-4911-a44a-a107b75c6138.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Comfort in Wear RUNOLIM paid attention to every detail, ensuring that the headphones are lightweight and snug, even during extended use. Whether you're enjoying music, taking calls, or focusing on work, you'll experience unmatched comfort while wearing them. 40H ANC Wireless Headphones RUNOLIM Bluetooth Wireless Noise-Canceling Headphones come with ANC mode activated, allowing you to enjoy up to 40 hours of continuous noise-cancelled playback, extendable to 65 hours in standby mode. Whether you're on a plane, traveling, or deeply focused on your studies, these headphones are your ultimate choice. 33ft Wire Free Working Range Adopted most advanced bluetooth 5.3, the transmitter range of our wireless headphones is up to 33ft, no need carry play device all around.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0f5955fe-2601-4fb8-83c0-d4b4430d2e39.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f20a0bed-62ed-4c8d-b5bd-286c2820629b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0cb73596-628a-45fe-af1e-3ac48534049b.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "RUNOLIM Black Noise Canceling Headphones RUNOLIM Silver Noise Canceling Headphones Hybrid Active Noise Cancellation ✓ ✓ Over Ear Size ✓ ✓ Microphone Function ✓ ✓ 65H Playtime ✓ ✓ Foldable Design ✓ ✓ HiFi Audio & Deep Bass ✓ ✓ Bluetooth 5.3 ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0203ad1-9276-4e1c-8511-d288362d9ab9.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e5b64053-05d5-4cfe-81ce-93cfb5f4403a.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0776f56-bd2c-4d65-b119-1bc212d385d7.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cfbdca7d-9d0d-41cd-ab3d-86c21e5711c3.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36022a7c-aa83-495a-9ba7-29183f62b43b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f57ec040-f8a5-4911-a44a-a107b75c6138.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0f5955fe-2601-4fb8-83c0-d4b4430d2e39.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f20a0bed-62ed-4c8d-b5bd-286c2820629b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0cb73596-628a-45fe-af1e-3ac48534049b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a54b746-62c4-4554-a922-47c1a8498b73.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/66d2ca8c-529a-4c73-815f-8954a2c95277.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/65236f14-d32c-47e1-bc87-6e63e4b43729.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9708c4e2-f406-488a-a332-e98a9de4d50a.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ZuSu  (£цэ!#)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNQ4LZ7IDK54GIKCMDUKP5TZ35Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R194BHP3AWCY6B?ASIN=B0BR9QJS5R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Sound Quality and Battery Life at a Bargain Price",
                "reviewText": "Since I live in an apartment, I use over ear Bluetooth noise canceling headphones to watch TV or listen to music on a daily basis. I have a Sony 1000-XM2 that I love, an MPow M5 and Soundcore Q20 that I gave to my mom. The Sonys are my gold standard for sound quality, but both the MPOW and Soundcore are exceptional as well.The MPow M5 finally started to physically break after 4+ years of years of near daily use, so I purchased these to replace them.I selected these because they were the among the highest rated and most purchased over ear noise canceling blue tooth headphones under $40.I received my headphones in about a couple days. The box contained the headphones, a carrying case, and cables. The build quality of the headset seems very solid with substantial earcups, a large battery between the head padding and earcups. The construction is all mat plastic with a metal leaf spring in the headband. I’m not sure if the swivel hinges are metal. ANC is controlled with a sliding switch behind the left ear while on/off, volume, skipping, pausing and pairing are controlled with three plastic push-buttons behind the right ear.When you press the buttons you hear/ feel a mechanical click that I am guessing is designed to be hepatic feedback and less intrusive than audible beeps in the headphones. Primary function of the buttons are track skipping and on/off. Holding the track buttons for a couple of seconds will allow you to control volume. This exactly the opposite of most headphones and very annoying in my opinion, as I more often want to adjust volume than skip tracks. The center (on/off) button, also allows you to pause and when held for about five seconds will put the headphones in pairing mode. As the noise canceling is on a separate slider but it does turn off with the headphones unlike other budget brands/ models. Aside from the very annoying track skipping, the controls are intuitive and reasonable.Sound quality is really good for the price. These is some punch in the bass but it isn’t overpowering. Mids and highs are clear. At the highest volumes the sound remains super clear with consistent bass. The sound quality is very good overall and exceptional at the price, better than my MPOW on par with Soundcore Q20s.Noise canceling operates as a single mode without a bypass/ ambient sound feature which is expected at this price point. Noise canceling is at least reasonably good for this price point. Low frequency noise can’t be heard, but, mid-to-high frequencies are not affected much. The sonic profile does not change with noise canceling on. Overall, noise canceling is what one can expect at this price point. If you need more mid to high frequency noise reduction, I’d recommend just getting a pair of Sony MX’s.Range is good. I can go anywhere in my apartment or even outside nearby with no loss of sound quality. Again, at this price point, I think this is expectedly good. Battery life seems insanely good. I have probably listened to 80.hours of TV and music on a single charge.The headphones have a “C” profile that curves moderately off the side of my head. I have a small to medium sized head, and I find these fit reasonably. However, they are a bit on the heavy side and the protein pads are thick and can get a little hot, though not unreasonably so.Overall I give this set extremely high marks for sound quality and battery life. Build quality, noise cancellation, and comfort are good. The only detraction I see are that that weird track skipping primary function in the controls. If I could give four and a half stars, I would, but given how Amazon reviews work, I’ll give this five stars.",
                "reviewVotes": "153 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher Galgon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEGVU4RPP2WTK7QTZ5J7DPVK6RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21YWBMLH1NAQK?ASIN=B0BR9QJS5R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Before you spend hundreds, try these first...",
                "reviewText": "These headphones do everything right at an astounding price. Sure, more money will buy you better noise cancellation and better sound. But right here you have *good* ANC and *good* sound, built into light, comfortable headphones that connect quickly and (so far) reliably. They are also light, foldiable and comfortable. They don't come with a case and they take 5 seconds to power on and off, but those are the only negatives at this price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KayCee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVP7JJLJZFQC54OOTBXPSTTUPLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PCYUZNIC4PB9?ASIN=B0BR9QJS5R",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2023",
                "reviewTitle": "4.0 out of 5 stars Good value for the money.",
                "reviewText": "I ordered these headphones to replace my main noise-cancelling headphones. I don't have a large budget right now to purchase electronics, so these were a good price for me. I was able to purchase these headphones for just under $30. I currently live in an apartment that tends to have a lot of very loud background noise, so noise cancelling headphones, as well as white noise, have become a necessity for me.I ordered these headphones on Thursday, and promptly received them on Friday, the next day. They came with all the items that were supposed to be included. I really like that there is a hard shelled case that is included. However, the case is enclosed in a fabric that seems to be kind of irritating/scratchy to the touch. I haven't used the case, yet, but, it may come in handy in the future. One thing that I really like about these headphones is that they are so lightweight. They have a good, solid feel to them, without being bulky or weighty. They are snug, but, not to the point that I have to keep readjusting them to make them fit comfortably. I used them all day Saturday, and I have only experienced maybe slight itchiness inside my right ear. My ears have not gotten irritated, itchy, or overheated, as is the case with a lot of headphones that I have used. I wear glasses and alot of headphones push my frames in to the point of being painful. These headphones do not cause problems or discomfort with my wearing glasses. The one thing that I do not like, is the loud, (to the point of being jarring), voice prompt that lets the user know that the headphones are connected. I have found that I am better off not wearing them when they are connecting or disconnecting, as the voice prompt is so loud. I wish that there was a way to turn that down. They seem to hold a charge, and even when I have charged them, they don't seem to take very long to charge. The noise- cancelling could be a little better, but, they do seem to reduce some of the background noise. Overall, I have enjoyed using these headphones, and am very pleased with this purchase.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda Brenda ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDFNODDO2JP2PCILTGXXFHLXHJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8ZSSCRYHVC90?ASIN=B0BR9QJS5R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Great headphones",
                "reviewText": "Bought these for work as I work in a very busy office setting with 11 other people. It can be a very distractive environment. It's easy to not only listen to my music but also tune out the busy office environment so that I can focus on my work. Battery seems to last a while. Headphones are very comfortable on my ears. It folds easily for travel purposes as well. Comes with two chords one for charging and one to go into my cell phone I have several pairs of headphones and I would recommend this one to people who are looking at getting noise canceling headphones.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61dy-UwYb7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61jf60ra6xL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "DRS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 24, 2024",
                "reviewTitle": "Good for its price",
                "reviewText": "Great buy if you get it on sale . Comfortable headset with really good sound. Blue tooth connection is easy. and solid. Noise cancellation is not as impressive as a high end headset but overall a really good product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 28, 2023",
                "reviewTitle": "Excelente calidad",
                "reviewText": "Excelente calidad y completamente cancelación de ruido...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Rutledge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 17, 2022",
                "reviewTitle": "Comfortable. Excellent sound. Don't have to charge very often. Forget i have them on my head.",
                "reviewText": "Basically I like the feel of these headphones -- when they're on my head that is. I have other headphones galore, but some are too heavy, some are too floppy. I like these because they are comfortable, stay put, and I forget I have them on my head. The sound is great with my Mac. I like them with my Yamaha silent guitar where those qualities I mentioned previously are important, to me.One disappointment only: when using them with my silent guitar I have to use the included 3.5mm cord because these headphones don't have sufficiently low latency to accommodate the instrument via a plugged in Bluetooth transmitter. I pluck a string and it is heard half a second later. But that's the only issue. And using the 3.5mm cord makes sense anyway because it simplifies things since I'm frequently jumping up and shutting things off or back on again and I don't want to have to consider Bluetooth anyway.i'd give them 5 stars if the latency wasn't an issue with my guitar. Actually, I may buy another pair so one set can be dedicated to may Mac and the other pair to my guitar.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcello Oliveira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 21, 2021",
                "reviewTitle": "Pretty decent budget headphones, seamless bluetooth pairing",
                "reviewText": "So... after the first attempt at receiving this headphone due to shipping delays, the seller did contacted me personally and offered to send over another one free of charge, so I appreciate them for going out of their way for that.Now as for the headphone... After testing it for about an hour while paired up on my Samsung Galaxy A21 phone while listening to some songs on Spotify, it seems to be pretty good. The noise cancellations on this headphone while outdoor is so-so, even if for example, you're at a subway station or the bus platform. The mic quality seems to be pretty good during a call. The build quality is alright, though I would prefer it to not be a hard plastic kind, but I won't hold it against them for that.Honestly, if you really want a Bluetooth headset, you could go for this one if you're tight on a budget. Otherwise, it wouldn't hurt if you spend a little extra. The name-branding on the side of the ear cups is a bit much, but no big deal.I would also like to suggest the seller for a possible consideration of providing an replacement ear pads for this headphone for those who wanted something a little more comfort. Just my two cents.All in all, this is a pretty solid headphone for those who're on a tight budget.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ms.H",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 23, 2023",
                "reviewTitle": "Awesome!",
                "reviewText": "These headphones have very good sound, connect easily, have a long battery life and are very comfortable to wear. Good padding on the ear pieces also.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}