{
    "remaining_requests": 48567,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Belkin-Soundform-Mini-Built-Ear/dp/B0BH4KKZB4",
    "body": {
        "name": "Belkin SoundForm Mini Kids Wired Headphones with Built-in Microphone & Fun Stickers, Over-Ear Headsets for Online Learning, School, Travel, Compatible w/iPhone 15, iPad, Galaxy S23, & More - Blue",
        "price": "$22.07$18.23",
        "originalPrice": "$24.99",
        "rawPrice": 22.07,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Belkin-Soundform-Mini-Built-Ear/dp/B0BH4KKZB4",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNY2RG63"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BH4HYM6C",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/015kOFkfd1L._SS36_.jpg"
            },
            {
                "asin": "B0BH4KKZB4",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01S5lN1qIHL._SS36_.jpg"
            },
            {
                "asin": "B0BH4JC2S5",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01XK7qTaUFL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01FxTkbfNDL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Lavender",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/118iIZAY5LL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Rbi1t1cCL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91xJgd8BPwL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91qbZgdAL2L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Belkin Store",
            "link": "https://www.amazon.com/stores/Belkin/page/2995B430-5393-4D60-8CDE-EE1F10036867?ref_=ast_bln"
        },
        "brand": "Belkin",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4859,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 12. Order within 2 hrs 19 mins",
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 12 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "DESIGNED FOR KIDS: Premium quality headphones reimagined for kids, with distance learning, travel, and streaming online content in mind. These headphones feature a 3.5mm wired audio connection, so your child will always have a stable audio connection.",
            "BUILT-IN MICROPHONE & SAFE SOUND: The wire has a built-in microphone for video and phone calls. And with Belkin Signature Sound with audio tuned specifically for kids, this headphone set has an 85dB volume limiter to protect your little one's ears.",
            "COMFORTABLE DESIGN: SoundForm Mini is cleverly crafted for a wide range of boys and girls, with an over-the-ear design and comfortable, kid-sized cushions. This headset also has a built-in micro-USB port for charging (micro-USB to USB-A cable included).",
            "KID FRIENDLY CONTROLS: Kids won't need any help setting up or using their wired headphones, as simple one-button touch mic control on the cable turns sound on and off for kids to enjoy their favorite music and more.",
            "OOPS PROOF MATERIALS & FUN STICKERS: These kids wired headphones are durability tested to withstand 3,000 uses, surviving spills and accidents for up to 2 years. And kids can get creative and customize their headset with the included stickers!"
        ],
        "description": "Keep your kids’ ears comfortable and protected with premium wired on-ear headphones designed just for them. Intuitive controls on the 3.5mm audio cable are perfect even for young children, whether they’re doing schoolwork online or watching videos in the back seat. A volume cap of 85dB protects their hearing, and durability testing assures these headphones are safe from damage from spills and accidents for up to 2 years. They’re designed to work with popular distance learning devices and apps. Connect these headphones to any compatible iOS or Android device and enjoy all your favorite sounds. Belkin is an established accessories market leader creating high-quality, innovative tech solutions for 40 years. Specifications: Cup Width: 2.7in/69.5mm Headband Width: 6.7in/171mm Compatibility: Any device with 3.5mm audio output jack 2-year limited warranty Package Includes: SoundForm Mini Wired On-Ear Headphones for Kids 3.5mm audio cable Fun stickers.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "On-Ear Headphones",
                "link": "https://www.amazon.com/On-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097480011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "19.69 x 19.69 x 11.02 inches"
            },
            {
                "name": "Item Weight",
                "value": "210 Grams"
            },
            {
                "name": "ASIN",
                "value": "B0BH4KKZB4"
            },
            {
                "name": "Item model number",
                "value": "AUD004btBL"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 4,859 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,833 in Electronics (See Top 100 in Electronics) #220 in On-Ear Headphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 7, 2022"
            },
            {
                "name": "Manufacturer",
                "value": "Belkin"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Units",
                "value": "85 None"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Belkin"
            },
            {
                "name": "Model Name",
                "value": "SOUNDFORM Mini"
            },
            {
                "name": "Color",
                "value": "Blue"
            },
            {
                "name": "Form Factor",
                "value": "On Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Belkin Belkin is one of the accessories market leaders delivering power, protection, productivity, connectivity, audio, security and home automation solutions for a broad range of consumer electronics and enterprise environments. Designed in Southern California and sold in more than 50 countries around the world, Belkin creates products that empower people through technology whether at home, at work or on a new adventure. In 2018 Belkin International merged with Foxconn Interconnect Technology to bolster its global influence and remains forever inspired by people and the planet we live on.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/5a0977a5-69ae-4161-965a-3006296671a8.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/5a0977a5-69ae-4161-965a-3006296671a8.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joclyn Brodhagen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6N6RDY34VHZAI2FIP2DJOE7HEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UQVQE24APJRQ?ASIN=B0BH4KKZB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Mom & kid approved",
                "reviewText": "Purchased these headphones for my 2nd grade son. They are sturdy, comfortable, easy to set up, and hold a charge. Love that they come with a case so you can pack them up for a road trip and keep them protected. We have gone through several pairs in the last few years and these are well made and sturdy while still being lightweight. 10/10 recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Clarence Shen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBYQPESP2YHTQ2EET2HBSP7RBEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMXM9J2124AAQ?ASIN=B0BH4KKZB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 26, 2022",
                "reviewTitle": "5.0 out of 5 stars Fantastic for the price!",
                "reviewText": "These Belkin bluetooth headphones are *fantastic* for the price (under $30). Amazon shows a number of critical reviews dragging down the review score for these based on pairing/connectivity issues, but like many older bluetooth devices, this can be very device-dependent with newer phones/tablets being more reliable.I'm glad I gave these a shot since I personally had no issues pairing the Belkin headphones with my Google Pixel 6. I paired them once and now the Belkin headphones connect immediately when turned on and disconnect immediately when turned off. I have multiple other bluetooth headphones and speakers paired with my phone, and they each connect perfectly to my phone when turned on (although I never turn on more than one headphone/speaker at the same time).These Belkin headphones fit great on my 6 year old daughter at the smallest setting. The headband has plenty of adjustment to the point where they could even stretch to fit my adult head, so they should continue to fit her well for years to come. One thing to note is that if you have larger teens, the thinner plastic in the headband becomes unsheathed when extended and I could see that being less durable. But at the smallest setting, these feel pretty sturdy, especially in light of how affordable they are.Sound quality and battery life are both more than acceptable for the price point and intended use for kids. My daughter thinks they are clear sounding and told me several times she appreciates how she can better hear the words in her favorite songs. She uses the headphones mostly for longer car rides, so I haven't been able to confirm whether it achieves the quoted battery life, but it is plenty long enough for our needs.Last thing to note: I suspect that the listening protection/maximum volume of 85 dB is for bluetooth only. I wanted to buy a bluetooth headphone that also can connect via wired since my daughter can use it when playing our keyboard/digital piano. However, when plugged in to our keyboard at full volume, these Belkin headphones get noticeably louder than they do over bluetooth. So if you're going to have your kids use these wired, consider supervising or monitoring the volume to avoid hearing damage!",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sir Arthur",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYIVDSTZWLOF3UKIVWXJFKIECYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VSQH4ITVRDI?ASIN=B0BH4KKZB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2022",
                "reviewTitle": "5.0 out of 5 stars Great fit for toddler",
                "reviewText": "My kod is 1.5yrs old and this fits great at the smallest setting. Being his first headphones we didn't want to drop $100 on a pair. The $20 JLabs looked like it would be too big so we opted for these Belkins. The sound quality is as expected for the price range. When maxed out it didn't seem as loud as standard headphones. I could barely hear them at listening volume when they were sitting on the coffee table.On the first go, the tike kept them on for over 5 minutes. Whether it was the allure of Vivo or not, it was comfortable enough to not be bothered. He has since gotten more used to it. Hopefully, 2 months is long enough for him to enjoy having them on or else that 5hr flight is gonna be rough...Pairing them is very simple. I do not like how you cannot enter a pairing mode with a long press. Regardless of device, it needs to be unpaired before you can pair it to another device.Can't speak on the battery life too much since the kid hasn't used it enough to warrant a recharge. That being said, he's used it for at least 1 hr - longer if you include standby mode.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AV",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEAAXVM4NKGUAJPRMGNKX4VXLIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HSH3MZL7N2X0?ASIN=B0BH4KKZB4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Durable headphones that last several hours",
                "reviewText": "Good wireless headphones that fit both my 3 and 5 year old. I took them on multiple airplane trips and they lasted the whole flight without needing a charge. They're durable and work well but I do not believe they're noise cancelling. I didn't buy them for noise cancelling though so it wasn't something I was bothered by.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7CXEOV5XH5OXZPSUT5HQQKIRGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39FLBSBXWTRWM?ASIN=B0BH4KKZB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Great headphones with a zipper case!",
                "reviewText": "I purchased these for my 3 year old daughter. She will be traveling by plane for the first time, and I think these are going to be perfect! The overall fit is great and the design is perfect. I love that the product came with stickers, so she can decorate them. It only took 1 hour to fully charge the headphones, and pairing the device with Bluetooth was super easy! I tested the volume out myself before allowing her to use them. The sound is very clear and the perfect volume for a little one. I couldn’t hear any noise from the headphones after she put them on, so I believe these truly are noise cancelling. I also love that there is an auto shut down that occurs after 5 minutes without use, so the battery doesn’t get drained! Overall, I’m very impressed. I hope the battery life is as great as all of the reviews have said!!! Don’t hesitate! Make the purchase!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shaye Charbonneau",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZTWLZISFYB3A3D2JU7JQTXAIYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SUL6DAUVV0VE?ASIN=B0BH4KKZB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Good buy",
                "reviewText": "These work good for my son. They are easy to charge. Hold a good charge and he can connect them to his iPod easy. They are not to loud for his ears either. Soft for the ears and fit his head good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG7SP7TZ6EWWLLKKYKBQGBQ76VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IJELBN81IUD4?ASIN=B0BH4KKZB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Great headphones",
                "reviewText": "Easy setup, comfortable, good sound. Great for kids.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick SNick S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG64U54KVY4MEUYXAHFXXIRRAW7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YQZF5ZV4I5OI?ASIN=B0BH4KKZB4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars PERFECT EARBUDS FOR TINY EARS!",
                "reviewText": "I have TINY ears. I have never been able to wear ear buds because they would always hurt me or pop out within seconds of putting them in my ears. These fit in my ears AMAZINGLY! They don’t hurt, don’t pop out, and came with several size ear pieces (I have to use the smallest one they came with 🤣.) They also have pretty good sound too. I like that they don’t get louder than 85 decibels to protect my hearing. They have touch controls to switch songs, pause what you’re listening to, answer calls, and control the volume.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61nqrkbgexL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71SX70YpV5L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arusha Ayaz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 23, 2023",
                "reviewTitle": "best purchase",
                "reviewText": "best headphones for kids. i got one before but unfortunately my kid break that. but he love this soo much that i bought the same one again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Customer K",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 8, 2023",
                "reviewTitle": "Nephew Loves them",
                "reviewText": "Fit kids head well. Sound is clear and battery life is sufficient.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elle V",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 15, 2023",
                "reviewTitle": "Decent for tiny ear adults, but mic is no bueno",
                "reviewText": "So I am a fully grown adult with the ear canal size of a small child. I have searched high and low for tips that fit because literally every other earphone I've tried would fall out, and I came across these and bought them because they had tiny size earbuds so I gave it a shot. The xxs fit perfectly in my ears (embarrassing) so I'm really really happy about that. HOWEVER... the mic sucks. I bought these pretty much solely for talking on the phone and apparently I sound muffled and as if I'm underwater. Sound quality on my end is great, music sounds great and clear, touch controls are easy. But if you are buying these to talk on the phone, don't bother. Only music? Get it. Need tiny tips? Absolutely, but find another brand of earphones to use the tips on. 3 stars for sound quality on my end and tiny tips.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 8, 2023",
                "reviewTitle": "Lasted less than three months",
                "reviewText": "Got for my kid for Christmas, one earbud totally stopped working last week. Save your money, time and the aggravation of a kid who is upset and frustrated, especially after they worked hard at making sure they took care of their belongings only to have the company fail them. Belkin - please do better. People work hard for their money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "scottintheway",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 31, 2023",
                "reviewTitle": "Expected more for the price",
                "reviewText": "Build feels pretty flimsy for fifty bucks. I assumed it would be USB-C but it's the older mini usb, which sucks. Sound quality is not terrible but again, for the price I expected better.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$30.81",
                "sellerName": "Hot Deals 4 Less®",
                "sellerRating": "4.5"
            }
        ]
    }
}