{
    "remaining_requests": 48829,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beats-Solo3-Wireless-Ear-Headphones/dp/B07YVYZ8T5",
    "body": {
        "name": "Beats Solo3 Wireless On-Ear Headphones - Apple W1 Headphone Chip, Class 1 Bluetooth, 40 Hours of Listening Time, Built-in Microphone - Black (Latest Model)",
        "price": "$99.95",
        "originalPrice": "$199.95",
        "rawPrice": 99.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beats-Solo3-Wireless-Ear-Headphones/dp/B07YVYZ8T5",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CM7HPSV7"
        ],
        "asinVariationValues": [
            {
                "asin": "B07YVYZ8T5",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41sBRQTnnFL._SS36_.jpg"
            },
            {
                "asin": "B07YVYPNRH",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41WFSKyNyxL._SS36_.jpg"
            },
            {
                "asin": "B07YVYPNRD",
                "variationName": "Color",
                "variationValue": "Rose Gold",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/416gcN9z1TL._SS36_.jpg"
            },
            {
                "asin": "B0CCBKGDJD",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31dBKa7neVL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41sBRQTnnFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41NI7XCEklL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41a0apzlGtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bS7sJ5vVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41y2bmWEsOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415WW8CpApL.jpg",
            "https://m.media-amazon.com/images/I/414JBI9BmHL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3c6e4947-1ebe-40c1-93c7-d7a129857693/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Beats Store",
            "link": "https://www.amazon.com/stores/Beats/page/395474F7-47DA-4331-929B-3ED7C7DC2C43?ref_=ast_bln"
        },
        "brand": "Beats",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 74008,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tomorrow, February 12. Order within 1 hr 13 mins",
            "FREE pickup Friday, February 16",
            "Or fastest pickup Tomorrow, February 12. Order within 6 hrs 43 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "High-performance wireless Bluetooth headphones",
            "Features the Apple W1 chip and Class 1 wireless Bluetooth connectivity",
            "With up to 40 hours of battery life, Beats Solo3 wireless is your perfect everyday headphone",
            "Compatible with iOS and Android devices",
            "With Fast Fuel, 5 minutes of charging gives you 3 hours of playback when battery is low",
            "Adjustable fit with comfort-cushioned ear cups made for everyday use",
            "Sleek, streamlined design that’s durable and foldable to go everywhere you do",
            "Take calls, control your music, and activate Siri with the multifunction on-ear controls",
            "The award-winning sound and design you’ve come to love from Beats, with premium playback with fine-tuned acoustics that maximize clarity, breadth, and balance",
            "What's in the box - Beats Solo3 Wireless headphones, Carrying case, 3.5mm RemoteTalk cable, Universal USB charging cable (USB-A to USB Micro-B), Quick Start Guide, Warranty Card (USB power adapter sold separately)"
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Beats"
            },
            {
                "name": "Model Name",
                "value": "Beats Solo3"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "On Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, USB"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Christian WaymireChristian Waymire",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6FFZWTYTQH3JFZKOI4VDFSDWRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAI90QWJQJF03?ASIN=B07YVYZ8T5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Literally mind-blowing upgrading from AirPods Pro 2",
                "reviewText": "Beats**all coming from an airpods & airpods pro 2 user**Two notes about me:* I have a pretty average sized head & ears* I wear glassesThoughts:- Noise isolation is way better than people give credit for, works about as well as the active noise cancellation on my airpods pro 2.- I can FEEL the bass.- Can hear all kinds of details in music (like when I upgraded to airpods pro but slightly better than even those). The AirPods gen 2 did that for me, then the AirPods Pro 2 did it again, and now these are doing the same.- Electronic music sounds absolutely amazing. Better than any other headphones or speaker I’ve heard.- Classical sounds amazing—way better than AirPods Pro 2.- Folk sounds amazing, & it’s like someone’s playing a really high end guitar right next to me while also serenading me.- Piano also sounds especially amazing- Case is slightly padded, but leaves a lot to be desired there—they also barely fit (see pictures).- They feel durable, even at hinges (which shocked me).- They DO fingerprint easily, if that matters to you.- Box is very sleek & giftable.- Not having the automatic ear detection is really nice for when I lift one side up to hear someone or something.- They are more comfortable than AirPods Pro, even with memory foam ear tips on those. But they do get slightly annoying with glasses but there is a sweet spot where it’s not bad (if I angle the headband towards the back of my head instead of having it straight up and down). But it’s not so uncomfortable that I don’t want to use them. Merely a minor inconvenience.- I ever so slightly wish I could see the battery percentage on my phone while charging, but it’s not any real inconvenience.- The micro-USB charger is potentially going to be a slight inconvenience because they wear out—USB-C or a lightening cord would’ve been way better.- Pairing with an iPhone is extremely easy.- The included carabiner for the case is a nice afterthought, but it’s a super flimsy carabiner and the loop keeping it on the case is tiny and I wouldn’t trust it. If it were better sewn and had a bigger loop, that’d be fantastic. I CAN attach an aluminum locking carabiner, but it’s just barely big enough for that.- Charging seems pretty fast, and while I do wish it would show me the percentage while charging, I really appreciate seeing the percentage in the battery widget while connected because other non-apple Bluetooth headphones don’t have that and I’m left guessing how much is left on the tiny control center icon with those.In sum, I HIGHLY recommend these if you’re looking for good bluetooth headphones and don’t have $400+ to spend. I snagged them for $99.95, and I couldn’t be happier. They’re definitely a good value at $200, but they’re mind blowing at a part-time, minimum wage budget. Almost every feature has been either mind blowingly fantastic, but those that aren’t are barely worth commenting on.Are they perfect? No. Should one expect perfection at this price? Absolutely not. I’d highly recommend buying if they’re in your budget!!!",
                "reviewVotes": "345 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/715GuYSbNEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71OsM5uUriL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71qwNImwmbL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81St2evwXNL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claudia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL76XOJ7ICB2JDVEV7Q6A3G5TQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16LNJ5E4CMHTP?ASIN=B07YVYZ8T5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars AMAZING!!!",
                "reviewText": "I purchased these for Prime Day and I am glad I did! They work amazing, easy to use, sound is great, love the noise cancelation I love that they fit perfectly on my ears, they aren't heavy at all! Battery lasts a very long time & charge really fast! The color is one of my favorites",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Big Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2ZWJV6ZDRERQQYUYERSRGNCI7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7IANOKQ2Z93P?ASIN=B07YVYZ8T5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Second pair need red",
                "reviewText": "Have the black solo 3s. Love them so much I bought the red. Comfort, sound and quality all right here. Not risking another brand when these are winners. Great for the gym. Very difficult to get sweat buildup but it is possible so that’s another reason why I got a second pair. Much more enjoyable than AirPods Pro or Beats Pro (pods)Easily worn three hours with no discomfort. No charging problems. Connect is easy to iPhone. They never fall off or slip at the gym or while biking yet not uncomfortable at all.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariah Chapman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKIWC4UYPVHMRXYTTGAEA655Q2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IQV1A1SCQDVZ?ASIN=B07YVYZ8T5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars These headphones deserve the hype!",
                "reviewText": "At last I finally found the perfect wireless headphones!! I bought these back in November when they were on sale for Black Friday (only $80!) and wanted to give them a test period before I reviewed them. Here’s what I’ve experienced this far:Pros1. The sound quality is impeccable. Literally everything is so clear and crisp. Funny enough, to put it into perspective, I was watching a movie and did not notice faint background music until I put these headphones on.2. The battery life is great. For me, they last roughly 72 hours before I need to fully recharge them. With charging, it takes maybe 40 minutes to an hour to get back up to a full charge. Impressive3. They’re compact and foldable. You’d be surprised how many headsets don’t fold when you’re done using them but these are perfect if you need to travel.4. They can connect to anything! I connected them to the Bluetooth on my tv for the first time since I didn’t want to wake my roommate up at 2am and set up was easy and simple.5. Changing the volume or song is simple and easy.6. Not really a pro, just an opinion, but they are really cute and stylish.Cons:1. A lot of people were right about them hurting your ears after having them on for too long; maybe more than 4 hours of continuous wear. I wish the part that goes around your ears was a little bigger to minimize the discomfort, but nonetheless it’s not a huge deal.2. Don’t connect them to numerous things at once. For instance, I had these paired with my iPhone and laptop at the same time. When I turned on my laptop it disconnected from my iPhone automatically and vice versa. My suggestion, disconnect from the device you’re not using and only focus on one sole device at a time.3. I wish the charger came with a charging block instead of just a wire. If you don’t have an extra block make sure you get one.4. They are not 100% noise cancelling but it does block out a good amount of outside noise5. My only concern is that when you call someone or someone calls you there’s a weird echo in the background. Like every time you talk it sounds like you’re talking in a tunnel? Again not a big deal just something I’ve noticed.Overall, I’m really happy with this purchase and if you’re considering getting these just do it. I really needed them for studying purposes and they get the job done 100%.",
                "reviewVotes": "87 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Megan Johnston",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 10, 2023",
                "reviewTitle": "Battery lasts forever",
                "reviewText": "Having recently acquired the Beats Solo3 Wireless On-Ear Headphones, I am thoroughly impressed with their performance and design. These headphones deliver a stellar wireless audio experience, making them a standout choice for music enthusiasts.The wireless connectivity provides a seamless experience, allowing me to move freely without being tethered to my device. The Bluetooth technology ensures a reliable connection, and the setup process is quick and straightforward.The sound quality is exceptional, with a robust bass and clear, crisp highs. Whether I'm listening to music, watching videos, or taking calls, the audio clarity is consistently impressive. The on-ear design contributes to noise isolation, enhancing the overall listening experience.One of the notable features is the impressive battery life. The Solo3 headphones offer an extended playtime, making them ideal for long journeys or extended use throughout the day. The Fast Fuel technology is a game-changer, providing several hours of playback with just a short charging period.The sleek and stylish design adds a touch of sophistication, and the foldable structure enhances portability. The cushioned ear cups and adjustable headband ensure comfort during prolonged use.While the price point might be higher compared to some alternatives, the Beats Solo3 Wireless On-Ear Headphones justify the investment with their premium sound quality, comfortable design, and convenient wireless functionality. They are a fantastic choice for those who prioritize both style and audio performance in their headphones.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arely AreM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 22, 2023",
                "reviewTitle": "Todo excelente",
                "reviewText": "Llegaron perfectos, la pila les dura bastante, muy cómodos, claro después de cierto rato puede molestar un poco la diadema, sin embargo es ajustable y no quita que todo lo demás esta perfecto, excelente sonido y el color muy lindo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "João Matheus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 20, 2023",
                "reviewTitle": "Bom fone, com alguns pontos.",
                "reviewText": "Basicamente já era usuário de um Beats Solo3, e acabei comprando um novo para mim pois dei o meu anterior para outra pessoa. É um fone bom, de qualidade impar. Após um ano, é notavel certo desgaste das borrachas no arco superior do fone, que soltam com o tempo. O fone é um pouco desconfortável pelo tamanho das almofadas. Para quem tem lobulos grandes ou faz uso de óculos, recomendo o studio.Almofadas também superaram as espectativas, se mantendo intactas após 1 ano de uso contínuo. Não sei se foi feito uma revisão no fone, pois meu primeiro fone é de 2016. Anteriormente as almofadas se soltavam.Qualidade do bluetooth também melhorou. Meu fone antigo, depois de uns 8 meses, parou de funcionar o bluetooth. Já para este atual, segue perfeito.DICA: Comprem o preto, os coloridos tendem a amarelar por conta da gordura corporal, mesmo efetuando limpeza. Almofadas também.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mafer cuga ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 10, 2024",
                "reviewTitle": "Me encantó",
                "reviewText": "El sonido es increíble y llegó en buen estado y listos para usar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pablo Vilela de Barros",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 1, 2024",
                "reviewTitle": "Excelente aquisição",
                "reviewText": "Produto sensacional. Custo benefício foi essencial para aquisição.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}