{
    "remaining_requests": 48542,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Jabra-Evolve-Professional-Cancelling-Headphones/dp/B00OD753U8",
    "body": {
        "name": "Jabra Evolve 80 MS Teams Wired Headset Professional Telephone Headphones with Unrivalled Noise Cancellation for Calls and Music, Features World Class Speakers and All Day Comfort,Black",
        "price": "$255.53$207.82",
        "originalPrice": "$419.00",
        "rawPrice": 255.53,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Jabra-Evolve-Professional-Cancelling-Headphones/dp/B00OD753U8",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07RWKXW3X"
        ],
        "asinVariationValues": [
            {
                "asin": "B00OD753U8",
                "variationName": "Style",
                "variationValue": "MS Teams Optimized",
                "price": "$255.53",
                "variationImageURL": ""
            },
            {
                "asin": "B00ODRSQKW",
                "variationName": "Style",
                "variationValue": "UC Optimized",
                "price": "$261.86",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41LDxzOfe L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51vxX6Db5WL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fZ S-sSNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ReRhgwtyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bcwtjpXIL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1ksCG2wbIS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1ksCG2wbIS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Jabra Store",
            "link": "https://www.amazon.com/stores/Jabra/page/84E991A6-9AC8-4C5D-923C-2C9075D04F62?ref_=ast_bln"
        },
        "brand": "Jabra",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 487,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 13 hrs 43 mins",
            "FREE delivery Monday, February 19"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "UNRIVALLED NOISE CANCELLATION The Jabra Evolve 80 Wired Headset is built to eliminate noise. Jabra’s unique Active Noise Cancellation (ANC) filters out low frequency background noise to help avoid interruptions and increase focus",
            "INCREASE AGENT FOCUS Along with ANC; an integrated busy light notifies colleagues when a call is in process to avoid interruptions. You can also manually activate it to create your own concentration zone and keep from being disturbed whenever required",
            "WORLD CLASS SOUND Find inspiration in sound with an immersive music experience delivered by world class speakers in this premium around the ear work headset",
            "ALL DAY COMFORT With leather feel ear cushions and around the ear design; this Jabra headset is built for comfortable all day use",
            "COMPATIBILITY The Jabra Evolve 80 Wired Headset works with all leading UC platforms. Certified for MS Teams; Cisco; and more. Plus; it features simple plug and play setup with a USB A; USB C; or 3.5mm jack connection options. Connectivity USB A Optimized for Microsoft Team and USB A Optimized for Unified Communication."
        ],
        "description": "The Jabra Evolve 80 Professional Headset is engineered to be the best headset for concentration in an open office. It’s built to eliminate noise with Jabra’s unique Active Noise Cancellation (ANC) that filters out low frequency background noise. Plus the uniquely designed ear cushions are not only built for all day comfort but they also block out high frequency sounds so you can enjoy the immersive world class speakers without distractions. Whether you’re on a call or working on a task needing your full attention this office headset has an integrated busy light on the ear cups letting people around you clearly see your availability. You can activate the red busy light to create your own concentration zone and keep you from being disturbed whenever required. Find inspiration in sound with an immersive music experience delivered by world class speakers in this premium around the ear office headset. Get easy access at your fingertips to the most used functions like answer calls volume up/down and mute microphone. Plus the simple plug and play setup allows the Jabra Evolve 80 Headset to work straight out of the box. Installation is as easy as simply plugging it into the USB A or USB C port or 3.5mm jack. The Jabra Evolve 80 Wired Headset works with all leading UC platforms. Certified for MS Teams, Cisco and more.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "Over-Ear Headphones",
                "link": "https://www.amazon.com/Over-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097479011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "8.46 x 9.13 x 2.24 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.2 pounds"
            },
            {
                "name": "ASIN",
                "value": "B00OD753U8"
            },
            {
                "name": "Item model number",
                "value": "7899-823-109"
            },
            {
                "name": "Batteries",
                "value": "1 C batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 487 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#57,268 in Electronics (See Top 100 in Electronics) #1,006 in On-Ear Headphones #1,757 in Over-Ear Headphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "OS",
                "value": "Windows, macOS"
            },
            {
                "name": "Wireless communication technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Special features",
                "value": "Flexible, Adjustable Headband, Noise Reduction, Digital Signal Processing, Comfortable"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Audio Jack",
                "value": "Wired"
            },
            {
                "name": "Form Factor",
                "value": "On Ear"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Whats in the box",
                "value": "Evolve 80 headset, Poly bag for Quick Start Guide and WWD, Warranty leaflet, Warning leaflet, Quick Start Guide"
            },
            {
                "name": "Manufacturer",
                "value": "Jabra"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "September 29, 2014"
            },
            {
                "name": "Charging Time",
                "value": "2 Hour"
            },
            {
                "name": "Weight",
                "value": "1.2 Pounds"
            },
            {
                "name": "Units",
                "value": "1.0 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Jabra"
            },
            {
                "name": "Model Name",
                "value": "Evolve 80 MS"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Jabra Evolve 80 Professional headset for concentration The Evolve 80 has superior Active Noise Cancellation and Passive Noise Cancellation in an over-the-ear wearing style. An integrated busylight shields you from interruptions and enhances your productivity.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/65221a9a-7468-413e-b0cd-72c11552a91d.__CR0,0,1464,600_PT0_SX1464_V1___.png"
                ]
            },
            {
                "media_text": "Previous page Active Noise Cancelling Work effectively Remove background noise with superior ANC & eliminate background noise noise cancelling microphone. Microsoft Certified Flexible connectivity Works with all leading UC platforms. Certified for MS Teams, Skype for Business, Cisco, and more. Find inspiration in sound Professional Sound Immersive music experience delivered by world-class speakers in a premium over-the-ear headset. Busylight Get more productive Integrated busylight automatically turns on during a call to avoid interruptions. Leather ear cushions All-day comfort Leather-feel ear cushions, and around-the-ear design for all-day use. Next page 1 Work effectively 2 Flexible connectivity 3 Professional Sound 4 Get more productive 5 All-day comfort",
                "media_link": []
            },
            {
                "media_text": "Jabra is certified Compatible with your platform All Jabra USB headsets and speakerphones work with all the most popular online voice call services. Jabra is certified with all major communication platforms but as a minimum, all Jabra USB devices will work as audio only.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/99375d74-3375-434f-9980-e30a5684efbf.__CR0,0,800,600_PT0_SX800_V1___.png"
                ]
            },
            {
                "media_text": "Compare the Evolve Range Evolve 80 Add to Cart Evolve 75 Add to Cart Evolve 65 Add to Cart Evolve 40 Add to Cart Customer Reviews 3.7 out of 5 stars 487 4.3 out of 5 stars 1,071 4.2 out of 5 stars 10,556 4.4 out of 5 stars 8,273 Price $255.53$255.53 $254.99$254.99 $149.99$149.99 $69.99$69.99 Active Noise Cancellation ✔ ✔ ✘ ✘ Busylight ✔ ✔ ✔ ✔ Wireless ✘ ✔ ✔ ✔ NFC ✘ ✘ ✔ ✘ Listen In ✔ ✔ ✘ ✘ Microsoft Teams Certified ✔ ✔ ✔ ✔ Charging stand (optional) ✘ ✔ ✔ ✘",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/65221a9a-7468-413e-b0cd-72c11552a91d.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/825ea941-1584-482d-b362-f395556a20aa._CR0,0,1464,600_PT0_SX1464__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ea9b1e6a-027c-413a-ad2e-fc1d4f37b13c.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7d884685-5deb-49b2-97cc-ad60d507ec17.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8e5e8144-86e3-40dc-a100-e096088c3eb6.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/980fa83f-6f29-4188-bcd4-732f73d7b63c.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a08e1486-0f4b-43c0-b973-5b03c38a1dd7.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/99375d74-3375-434f-9980-e30a5684efbf.__CR0,0,800,600_PT0_SX800_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2183fdb7-0bdd-4529-91bf-9cdd0dda0f8f._CR0,0,200,225_PT0_SX200__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e4dbd116-a9d5-46f3-9d3e-d1ca073d7142.__CR0,0,200,225_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0c2413c8-ca26-407b-93d6-b7395c9ede4e.__CR0,0,200,225_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7239461d-59a5-4313-acd0-508f587a0f5e.__CR0,0,200,225_PT0_SX200_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE67WKAGYFJQRCE2BVQZOSHRSOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1U2GGGEGJHI01?ASIN=B00OD753U8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2016",
                "reviewTitle": "5.0 out of 5 stars Work in a cube farm? You need these!",
                "reviewText": "I own several pairs of high end headphones - Sennheiser, Entymotic research, Bose, Grado, etc. These were the first hedphones I bought specifically for their Lync integration - which works great. The audio quality is as good as my ears can hear and favorably compares to the other brands I mentioned. The noise cancellation is fantastic - in an office environment, these outperform my Bose noise cancelling headphones. It's not unusual for me to not notice someone trying to get my attention verbally - if you have low volume music playing, you won' hear much of what goes on in the open office. They are also very versitile - phone calls, music, gaming, etc.In my opinion, Jabra hit it out of the park with these.Compared to the Bose QuietComfort 25 Acoustic Noise Cancelling Headphones for Apple Devices, Black , these are more comfortable (but bigger) and don't make you fuss with replacing AAA batteries (and because they charge plugged into your PC, probably won't ever be dead - but if you plan on using them on airplanes and such, the AAA battery may be more attractive). The Bose headphones has the microphone in the cord, which is bad for audio quality. The noise cancellation on the Jabra seems to work better in office environments. The one thing I like better about the Bose headphones is the detachable cord - I've yanked on that cord way too many times, but it just pops right back into the headphones.Overall Likes:- Noise Reduction is fantastic- Comfortable - I can easily wear these all day in the office- Lync integration - the red LED rings on the headphones to tell people I'm in a meeting is a good touch for a work-oriented set of headphones- Microphone works great, no negative complaints of audio and I'm not worried about using them on customer calls- Charges when plugged into computer- Signalling Lync to transfer the call when unplugging from base is neat- Will work fine with a mobile phone (just won't charge when plugged in)- You can hear yourself when on calls - useful because hearing your key clicks will remind you that everyone else can hear them too.- Work great for gaming too- Mute button on right ear cup is good when someone is trying to talk to you - it disables all audio and turns the NR off temporarilyDislikes:- They are fairly big (as are all active noise cancelling headphones)- For this price, the cord should be replacable- I can't really see myself walking around using these with my cell phone- Would like mute button to pause iTunes",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew Kocsis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRNC3TOUTFVZTBW7HPBNNKXM4SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IILIF7L31KD7?ASIN=B00OD753U8",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2018",
                "reviewTitle": "1.0 out of 5 stars Great until the right side quit.",
                "reviewText": "Product was great, good quality sound and microphone. The wired connection and USB connector are both useful for computer and phone / plane use.After 4 months right earpiece stopped working suddenly, no sound, no noise cancellation. I tried a few different devices and it's dead. Since the ANC isn't working either it must be a dead speaker or broken internal wire. For an expensive product I expect much greater reliability. It was especially frustrating because it stopped working in the first 10 minutes of a long international trip.I'm going to try the warranty repair process, but it looks painful and they say I'll have to pay for some of the shipping. I may just request a full refund and dump them in the trash instead.Update: 8 days later and there is no response to my warranty request. Jabra Support is \"assisting other customers\" so calling them appears to be useless. Really disappointed.",
                "reviewVotes": "57 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY5MAIGUONUMOMGHQ7WJY2MAPYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWUDGOU2S8HIK?ASIN=B00OD753U8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2020",
                "reviewTitle": "5.0 out of 5 stars Astounding upgrade from the Evolve 40s.",
                "reviewText": "I bought these for my workplace, since they only hand out Jabra Evolve 40s. The 40s are pretty lackluster, it is difficult to hear the call sometimes, and noise bleeds in since there is very little sound isolation.These Jabra Evolve 80s are a godsend for my farm of agents on the phone or just chatting noisily. They don't look super stylish, and it'll need some adjusting so the headset sits proper on your head without having the mic half an inch from your mouth, but their performance cannot be understated. I can hear 95% of all my calls with the Automatic Noise Cancellation off, and whenever the calls feels too quiet, or if I need extra concentration, I can swith the ANC on, and almost instantly the sound quality and volume gets boosted, and the noise of my co-workers goes neat silent.With ANC on, you do somewhat hear yourself talking. It's a bit hard to explain, but the closest explanation is that you're hearing what the mic is picking up being passed through a filter. So some background noise, like a very loud talker, will break through the noise isolation and be a bit distracting, but the volume/audio quality boost is invaluable.These headphones also sound amazing for music. Just the passive noise isolation is superb. Then I can flip the switch for ANC, and bam, more fidelity.The ANC is battery powered, and the headphones charge through the aux cord when plugged into the little USB hub! Pretty amazing.Overall, these are worth buying used. Mine were like new, and were a steal at $100. Full price, you'll feel a bit irked by plain silicone sheathing for the wire, and how the earpads rub against each other when taken off (at least at the tallest setting, I have a big head). They're not amazingly comfortable, and I always take them off after a call because you'll miss interactions from your supervisor or coworker (they show you're deep into your work) and ear sweat/grime is a potential hygiene issue (like with all over the ear headphones).Will very much boost your effectiveness if you're upgrading from the Jabra Evolve 40, people won't bother you with them on, and music sounds twice better. Very solid choice for a noisy workplace.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bernardo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 18, 2022",
                "reviewTitle": "Muy caros con respecto al producto",
                "reviewText": "La calidad de audio no es muy buena. Los auriculares hacen mucha presión a la cabeza, no son comodos.Por el precio esperaria que el microfono tuviera cancelación de ruido pero es incluso peor que el microfono abierto de la laptop.No lo volvería a comprar",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richardon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 3, 2022",
                "reviewTitle": "Great performance",
                "reviewText": "The headphones produce great sound. The noise cancellation is helpful, especially for at home use. Even with a door closed there is noise from other family members and this eliminates it. I didn't think the feature would be so useful.The headset is comfortable, support and warranty is excellent.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 7, 2024",
                "reviewTitle": "Pesanti",
                "reviewText": "Funzionano bene, audio e microfono molto buoni.Rese perché molto pesanti e fastidiose dopo lunghe sessioni.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gonzalez Jordan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on May 3, 2022",
                "reviewTitle": "Très efficace",
                "reviewText": "On travaille ensemble en distanciel avec ma conjointe. Quand elle est en réunion je met le casque, j'active la réduction anti bruit et je n'entends rien d'autre que ma musique. C'est super efficace pour se mettre dans une bulle de concentration.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "raprap",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 11, 2022",
                "reviewTitle": "Très bien ... Mais",
                "reviewText": "Casque au top, vraiment un bon produitJe m'en sers quotidiennement, en faisant toujours attention à ne pas l'abîmerMais même pas un ans l'arc en plastique se casse. C'est dommage, car j'ai l'impression que le support était trop fin",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51FkKCsabpL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$254.15",
                "sellerName": "BecTech Global",
                "sellerRating": "4.5"
            },
            {
                "price": "$266.99",
                "sellerName": "All n' Home",
                "sellerRating": "5"
            },
            {
                "price": "$299.99",
                "sellerName": "AIRY Inc.",
                "sellerRating": "4.5"
            }
        ]
    }
}