{
    "remaining_requests": 48835,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sony-Wired-Headphones-MDRZX110-WHI/dp/B00NJ2M43M",
    "body": {
        "name": "Sony ZX Series Wired On-Ear Headphones, White MDR-ZX110",
        "price": "$9.99",
        "originalPrice": "$19.99",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sony-Wired-Headphones-MDRZX110-WHI/dp/B00NJ2M43M",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00PKTU83U"
        ],
        "asinVariationValues": [
            {
                "asin": "B00NJ2M33I",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31l-2wT+ZoL._SS36_.jpg"
            },
            {
                "asin": "B00NBR705M",
                "variationName": "Color",
                "variationValue": "Rose",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31IBIbif5wL._SS36_.jpg"
            },
            {
                "asin": "B00NJ2M43M",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/216RVj-iwbL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/21391kOJIlL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31qVwrqnpvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/210KbjNVTSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/3130y3N92ZL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81T0OyiwzaL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71zJMRRdSdS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Sony Store",
            "link": "https://www.amazon.com/stores/Sony/page/AEA5D08A-7FC6-45D4-B121-C8A6FA25219F?ref_=ast_bln"
        },
        "brand": "Sony",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 112239,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 14 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Lightweight 1.38 in neodymium dynamic drivers deliver a punchy, rhythmic response to even the most demanding tracks",
            "The swiveling earcup design allows easy storage when you’re not using them, and enhances portability when you’re traveling",
            "Cushioned earpads for total comfort and enfolding closed-back design seals in sound",
            "The wide frequency range—spanning 12 Hz to 22 kHz—delivers deep bass, rich midrange, and soaring highs",
            "Plug: L-shaped stereo mini plug 3.5mm"
        ],
        "description": "Maximizing your personal audio experience has never been easier than with SONY ZX-Series Monitor headphones. Built with comfort and performance in mind, there's no need to compromise.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b?ie=UTF8&node=172541"
            },
            {
                "name": "On-Ear Headphones",
                "link": "https://www.amazon.com/On-Ear-Headphones/b?ie=UTF8&node=12097480011"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "4.2 Ounces"
            },
            {
                "name": "Manufacturer",
                "value": "Sony"
            },
            {
                "name": "ASIN",
                "value": "B00NJ2M43M"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "MDRZX110/WHI"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 112,239 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8 in On-Ear Headphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "April 8, 2013"
            },
            {
                "name": "Units",
                "value": "1.0 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Cable Length",
                "value": "1.2 Meters"
            },
            {
                "name": "Brand",
                "value": "Sony"
            },
            {
                "name": "Model Name",
                "value": "MDRZX110 ZX"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Form Factor",
                "value": "On Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "MDR-ZX110 Sony ZX Series Wired On-Ear Headphones Maximizing your personal audio experience has never been easier than with SONY ZX-Series Monitor headphones. Built with comfort and performance in mind, there’s no need to compromise.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d12545e6-363e-4019-997c-7d6e7951e31d._CR0,0,800,600_PT0_SX800__.jpg"
                ]
            },
            {
                "media_text": "Enjoy rich, full frequency response 30 mm driver units deliver full, balanced sound for a complete listening experience from 12 - 22,000 Hz.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/6de396a5-404d-4ef5-a943-1854f2dc4efc._CR0,0,800,600_PT0_SX800__.jpg"
                ]
            },
            {
                "media_text": "Swivel, folding design Compact for portability yet affording listening flexibility, the swivel, folding earpads let you enjoy music in many ways.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c3e480b4-5d85-4ded-ac7a-ed5ff3f6d42f._CR0,0,800,600_PT0_SX800__.jpg"
                ]
            },
            {
                "media_text": "Tangle-free cables The durable, 1.2 m y-type cable resists snags and tangles so you can get caught up in your music, not your cord.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e7e79013-a3d6-4582-9107-bb05c0fe6373._CR0,0,800,600_PT0_SX800__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d12545e6-363e-4019-997c-7d6e7951e31d._CR0,0,800,600_PT0_SX800__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6de396a5-404d-4ef5-a943-1854f2dc4efc._CR0,0,800,600_PT0_SX800__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c3e480b4-5d85-4ded-ac7a-ed5ff3f6d42f._CR0,0,800,600_PT0_SX800__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e7e79013-a3d6-4582-9107-bb05c0fe6373._CR0,0,800,600_PT0_SX800__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ronan johnstonronan johnston",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOJUXAGFFIPWCQ2HGGZA7GSHJ5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RMB7AUKTDCJA?ASIN=B00NJ2M43M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2023",
                "reviewTitle": "5.0 out of 5 stars comfortable with a good sound quality, though not very noise cancelling. amazing for the price!!",
                "reviewText": "overall - 4.5 starsmy main complaint is the noise cancellation but looking past that these headphones are honestly amazing for only $10. they're great budget headphones for average use, but don't expect them to be anything fancy (i see a lot of people complaining about the lack of bass. the bass sound comes through perfectly and is still there, it's just not boosted.) they're definitely not crap quality headphones, these are probably the best headphones in their price range.sound quality - 5 starsi think a lot of personal preference goes into sound quality but as someone who's never had a super expensive pair of headphones i LOVE the sound quality in these. the bass comes through well (it's not anything boosted though, but i don't mind as i didn't expect it), plus it really does sound like a small stereo next to your ear. the quality still holds strong at loud volumes as well. in songs where they split parts of the audio between two ears i can make out both parts clearly. vocals also come through beautifully!noise cancellation - 3 starsi listen to music pretty loud so this may be mostly personal preference but the noise cancellation is pretty bad lol, though they're not over-the-ear so i somewhat expected this. when i take off my headphones in a quiet room with my computer volume halfway up, i can still hear my music clearly. despite this i don't think it'd bother another person across the room, maybe someone closer to you though. when i have the volume all the way up in a quiet room and i take my headphones off, the music is perfectly clear and sounds like its coming from a phone at a low volume.fit - 5 starsI am a 14 year old boy, these headphones fit my head perfectly with no discomfort. when i turn or shake my head lightly they don't slide around, but when i lean my head forward they start to fall. they surprisingly fit my ears very well though! i can wear them for an extended period of time without my ears starting to hurt. the foam on both speakers is comfortable as well.quality - 4 starsthey seem kinda flimsy but that's what i'd expect with $10 headphones, especially the part that connects the two speakers. the foam over the speakers looks well made, and it's firmly attached to the plastic on the speakers. the wire also looks sturdy, it's a third the thickness of my pinky (again, 14 year old boy). the headphones fold up so that they're flat, and you can also wrap up the wire well for storage as it doesn't get tangled easily. the headphone jack looks sturdy and not easy to damage.look and feel - 5 STARS!!! 10 IF I COULDby far the most aesthetically appealing headphones I've worn or owned. they don't look clunky on my head or around my neck. they are light and don't weigh down my head. plus the speakers are flat so they're perfect for decorating with stickers and paint and such (something i plan to do) they are made with soft foam and a matte feeling plastic, apart from the outside of the speakers which is a more smooth and slightly reflective plastic (perfect for stickers lol)headphone jack/plugin - 5 starsits a standard 3.5mm jack, so this means it's not directly compatible with most newer phones (anything above an iPhone 6, anything above a Pixel XL, and most new androids made past 2018). despite this it works with pretty much all computers and gaming consoles (works with my nintendo switch fine). and even if these headphones don't plug directly into your phone, you can buy headphone adapters for your specific phone model.lifetime - unratedi have yet to use these headphones for a while, but from what i see from other reviews these can last 2 years if you're careful with them which is great. they also seem like they'd survive a while from the quality, but I've seen mixed opinions about how long each speaker lasts. despite all that i'm pretty sure these should last a while if you're mindful of how you handle them.",
                "reviewVotes": "113 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41G50goJ-sL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Udo Schuermann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWB7C5EHUFZY7ZSPSZFMOOQMR7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW8I3MF84ILM0?ASIN=B00NJ2M43M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Fantastic bang for the buck",
                "reviewText": "This review may be a bit lengthy, but I shall strive to give as comprehensive and hopefully useful a review as I can:I bought a pair of these on impulse in early 2021 at a store, when I began an 80-day \"workation\" trip around the country. My first impression, after unpacking, was that they were flimsy and would likely break within days or weeks, but treating them gently, I have traveled with them literally for months in a pocket of my backpack, taken them out and put them back on a daily basis, and they are still in perfect shape after practically daily use for the past 2.5 years. Fearing recently that they might break some day no matter what, and I would never find another pair, I bought two more when I saw them here on Amazon. I like them that much!They are light-weight and the ear muffs (not cups, they won't go around your ear, but sit lightly against) will fold inward into the bow by which they rest atop your head. This makes them compact for travel. If you do take them on the road, you might consider keeping the box in which they came, as it will protect them better against crushing, but as I said, I traveled with them many times, and they have held up admirably.The headphones will adjust for your head size. From the top of the bow to the center line between the ear muffs, their height can be adjusted from about 5 inches (13cm) to 6.5 inches (17cm), which I imagine should fit just about anyone.They are marked (L)eft and (R)ight, but also the ear muffs are very slightly angled so that you feel immediately if you have left and right reversed.I will not pretend to be an audiophile, or to have investigated audio range or such, but from a purely objective standpoint, the audio quality seems well-balanced and makes my music enjoyable: I have another pair of head phones which sound a bit \"tinny\" by comparison. These Sony headphones sound full and reproduce audio quality which I find pleasing and eminently enjoyable.I also use them for meetings: I listen to people talking, and rely on the laptop's built-in microphone to pick up my voice. This works well for me. Audio quality from people talking is excellent.I've worn these headphones for near-three hour meetings, barely noticed that they were on my head, and not felt the need afterwards to rub my ears, meaning that I've found them quite comfortable for long-term wear.The audio cable is permanently affixed (not removable), sturdy, and about 3.5 feet (1 meter) in length. It's enough for me to stand up from the laptop into which they're plugged, to stretch or reach for something on the bookshelf behind me, but it doesn't provide a great deal of range. If I ever felt this to be an actual limitation (and couldn't afford to remove the headphones for a moment), I might consider an audio extension cable.All that said, these are extremely basic head phones, as reflected in the price. They have no volume control, no noise cancellation, no microphone, nor any \"advanced\" features at all. Plug them in, listen to music, and enjoy.I feel that for this price especially, there is simply no better bang for the buck.",
                "reviewVotes": "118 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nelly LG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 20, 2024",
                "reviewTitle": "Excelente compra",
                "reviewText": "La marca no decepciona, aunque son económicos tienen excelente calidad y sobre todo se escuchan muy bien🙌",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gordon Pritchard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 26, 2023",
                "reviewTitle": "Tremendous value! Comfortable for all-day usage, solid audio performance",
                "reviewText": "The 30mm drivers give 12Hz-22kHz response, exceeding normal hearing.The construction is plastic - headband and earpieces. This makes it quite lightweight and comfortable for long periods of use.The cord is maybe a bit short for some situtations - some users may want to get a 3.5mm extension (easily found). The cord is simple rubber-jacket (no braid, no premium materials) but it is suitably limp and tangle-free. The cord is perma-attached, but on the other hand there are absolutely no creaks when turning my head, and there won't be future connector-scratchiness.The ear-cups sit comfortably on my ears, with only modest squeezing pressure. As such they allow some ambient hearing, and do not make my ears sweat like my over-ear / surrounding headphones do.These headphones pretty much exactly meet my expectations for a lightweight, on-ear, plastic set of headphones. And for $20, they are tremendous value! They work well, and you can use them all day long.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacqueline Hopper",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 7, 2023",
                "reviewTitle": "They work great",
                "reviewText": "I have significant hearing loss, but these headphones help.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ricardo da silva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 14, 2022",
                "reviewTitle": "de ótima qualidade",
                "reviewText": "produto veio certinho em ótimo estado qualidade excelente",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lukki",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Poland on January 23, 2024",
                "reviewTitle": "Ladne i dobrze wykonane",
                "reviewText": "Działają jak należy, ładnie wyglądają.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}