{
    "remaining_requests": 48714,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beats-Fit-Pro-Cancelling-Built/dp/B0BTK5XPF6",
    "body": {
        "name": "Beats Fit Pro - True Wireless Noise Cancelling Earbuds - Apple H1 Headphone Chip, Compatible with Apple & Android, Class 1 Bluetooth, Built-in Microphone, 6 Hours of Listening Time - Tidal Blue",
        "price": "$159.99",
        "originalPrice": "$199.95",
        "rawPrice": 159.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beats-Fit-Pro-Cancelling-Built/dp/B0BTK5XPF6",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CM7DHSCR"
        ],
        "asinVariationValues": [
            {
                "asin": "B09JL41N9C",
                "variationName": "Color",
                "variationValue": "Beats Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31k0oYM9hfL._SS36_.jpg"
            },
            {
                "asin": "B09JL5QGCZ",
                "variationName": "Color",
                "variationValue": "Beats White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/317G4XPa1sL._SS36_.jpg"
            },
            {
                "asin": "B0BTJWJB7P",
                "variationName": "Color",
                "variationValue": "Coral Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31Ejn+z7rXL._SS36_.jpg"
            },
            {
                "asin": "B0B6LW47C8",
                "variationName": "Color",
                "variationValue": "Dune",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31HUkpTDBLL._SS36_.jpg"
            },
            {
                "asin": "B0B6LVP93W",
                "variationName": "Color",
                "variationValue": "Moon",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31-or00dDmL._SS36_.jpg"
            },
            {
                "asin": "B09JL65GNM",
                "variationName": "Color",
                "variationValue": "Sage Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31lqG9Jfs7L._SS36_.jpg"
            },
            {
                "asin": "B09JL5CY5Z",
                "variationName": "Color",
                "variationValue": "Stone Purple",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31lxxrUg13L._SS36_.jpg"
            },
            {
                "asin": "B0BTK5XPF6",
                "variationName": "Color",
                "variationValue": "Tidal Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31BpHbFLcpL._SS36_.jpg"
            },
            {
                "asin": "B0BTKMLZSJ",
                "variationName": "Color",
                "variationValue": "Volt Yellow",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31PXLrrWCRL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31BpHbFLcpL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31sE27PmwFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Wj7wEAGoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41jS-Xkx1dL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pdIt7nr7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41O9K-weeVL.jpg",
            "https://m.media-amazon.com/images/I/61Rib7rvhHL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/492a9529-42e2-416b-bed5-27fe939b22b1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/df105679-b515-4b4c-82ae-f673354e761a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0460084-b4de-4f14-a90e-a738d2d89b11/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8b57370c-419e-4b9c-9b6a-051fa85ab003/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Beats Store",
            "link": "https://www.amazon.com/stores/Beats/page/395474F7-47DA-4331-929B-3ED7C7DC2C43?ref_=ast_bln"
        },
        "brand": "Beats",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 35614,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 14 hrs 13 mins",
            "FREE delivery Monday, February 19"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Flexible, secure-fit wingtips for all-day comfort and stability",
            "Custom acoustic platform delivers powerful, balanced sound",
            "Spatial Audio with dynamic head tracking for immersive music, movies, and games",
            "Three distinct listening modes: Active Noise Cancelling, and Transparency Mode, and Adaptive EQ",
            "Enhanced by the Apple H1 chip for Automatic Switching, Audio Sharing (with another pair of Beats headphones or Apple AirPods), and “Hey Siri”",
            "Sweat and water resistant (IPX4-rated) earbuds",
            "Up to 6 hours of listening time (up to 24 hours combined with pocket-sized charging case)",
            "High-quality call performance and voice assistant interaction via built-in microphones",
            "Industry-leading Class 1 Bluetooth for extended range and fewer dropouts",
            "What’s in the Box – Beats Fit Pro True Wireless Noise Cancelling Earbuds; Matching charging case; Eartips with three size options; USB-C to USB-C charging cable; Quick Start Guide; Warranty card. (USB-C power adapter sold separately)"
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Beats"
            },
            {
                "name": "Model Name",
                "value": "Beats Fit Pro"
            },
            {
                "name": "Color",
                "value": "Tidal Blue"
            },
            {
                "name": "Form Factor",
                "value": "In Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Apple H1 Chip, Wireless, Bluetooth, NFC"
            },
            {
                "name": "Weight",
                "value": "(case) 55.1g (bud) 5.6g (total) 66.3g"
            },
            {
                "name": "Dimensions",
                "value": "Length: (case) 6.2cm / 2.44in, (bud) 3cm / 1.18in; Width: (case) 6.2cm / 2.44in, (bud) 2.4cm / 0.94in; Height: (case) 2.85cm / 1.12in, (bud) 1.9cm / 0.75in"
            },
            {
                "name": "Connectivity",
                "value": "Apple H1 chip Class 1 Wireless Bluetooth®"
            },
            {
                "name": "Power and Battery",
                "value": "Beats Fit Pro (single charge): up to 6 hours of listening time; Fast Fuel: a 5-minute charge provides up to 1 hour of playback"
            },
            {
                "name": "Release Date",
                "value": "11/5/2021"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Connor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEITP6Y25NKH3KB2LXWQCC7STIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REDXSAP527XVD?ASIN=B0BTK5XPF6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2022",
                "reviewTitle": "5.0 out of 5 stars Compared to 4 other Earbuds...",
                "reviewText": "I bought these earbuds along with 4 other pairs, with the intent of comparing them over a couple weeks and returning all but my favorite. Here were the results:Beats Fit Pro - https://www.amazon.com/dp/B09JL65GNM?psc=1&ref=ppx_yo2ov_dt_b_product_detailsPros – These buds had some great base, and the wingtip gave them a fit that made them refuse to fall out of my ears. But the best feature? Physical “clicky” buttons on each one of the buds. You press in and hear/feel the click, rather than relying on a touchscreen-like feature. No need to guess if you tapped them once or twice, you will know.Cons – The wingtip gives a very sturdy fit, but not the most comfortable. I wouldn’t recommend to anyone with smaller ears. The noise canceling was solid, but nothing special. And this may be picky, but I didn’t care for most of the color schemes available. I prefer my earbuds to be hard to notice, and even the black ones have a bright red letter “b” in the middle.Beats Studio Buds - https://www.amazon.com/dp/B096SV8SJG?psc=1&ref=ppx_yo2ov_dt_b_product_detailsPros – Very comfortable with the same great physically “clicky” buttons as the Beats Fit Pro. Noise canceling seemed slightly better than average. Great base. Classic look.Cons – Tested during a workout, a little bit of sweat had these sliding right out of my ear. The case for these earbuds also was the flimsiest of any I had tested, with a very weak hinge that I was scared of breaking off within the 2 weeks of using.Samsung Galaxy Buds Pro - https://www.amazon.com/dp/B08MWZHHKP?psc=1&ref=ppx_yo2ov_dt_b_product_detailsPros – A neat feature that I noticed only in these earbuds was that it had noise amplification as well as noise cancelation. With one swipe in the app, the surrounding sound was actually louder and clearer than it would be without the earbuds in. Great if you are hard of hearing, or just enjoy snooping on conversations out of reach.Cons – Similar to the Beats Studio Buds, these didn’t stay in during a workout. They were usable, but every 10 minutes I found myself pushing them back into my ear. And this is an opinion, but these are the ugliest earbuds out of the bunch. The shiny black gleam made it look like a large beetle was hanging out in my ear. No visible brand placement either, which makes them appear cheap and generic rather than the quality Samsung they are.Samsung Galaxy Buds Live - https://www.amazon.com/dp/B09TBM1L3S?psc=1&ref=ppx_yo2ov_dt_b_product_detailsPros – Cost effective! I added these to the test group because of the unique shape, and for that they are worth giving a try. If you have small ears and do not like the rubber insert that is standard in most other earbuds, these may be perfect for you.Cons – Poor fit for large ears. These were tested the least of all of the buds, because the fit was so bad for my ear shape that they wouldn’t stay in if I turned my head too fast.Bose QuietComfort - https://www.amazon.com/dp/B08C4KWM9T?psc=1&ref=ppx_yo2ov_dt_b_product_detailsPros – Bose noise canceling is unmatched. If your primary use for earbuds is to cancel out that background white noise, this is the pair for you. The sound quality is great, not too heavy on the base. The case for the earbuds stood out from the rest as the only one that impressed me. Felt very study, and I had no worries tossing it into a gym bag or cup holder. The only case with a button latch to make sure it doesn’t open accidentally.Cons – This was the most expensive pair of earbuds by a longshot, and there were still some things I felt could be improved. The rubber inserts had more of a “flayed” shape rather than the “rounded” shape that is standard. My guess is that this was by design, because the earbuds were also slightly heavier than others and may need that extra in-ear grip. The flayed shape did make them sturdier, but at the cost of them being uncomfortable in an active situation. They were also the largest earbuds, and stuck out from the side of my head further than I would have liked.My favorite? The beats fit pro! While I wouldn’t recommend this pair for everyone, it was perfect for my routine. My music taste benefits from the boosted base, and the wingtip shape was perfect for any workouts. The feature that really convinced me was the physical buttons, something that I didn’t realize how desperately I needed.",
                "reviewVotes": "410 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "theInternational",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJD4656VLR6I3TCW544TITKJBUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35IQTO062Y7LU?ASIN=B0BTK5XPF6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2022",
                "reviewTitle": "5.0 out of 5 stars Best wireless noise cancelling earbuds I have used so far",
                "reviewText": "I am a long-time user of the Bose QuietComfort 20 Acoustic Noise Cancelling Headphones. These are my favorite noise cancelling option to use while taking walks. I like to listen to audio books while walking and the QuietComfort 20 are superb for this use. I also like to use a noise cancelling option while listening to audio books and podcasts in the car, especially because my car does not contain road noise well. I decided I would like to have a second QuietComfort 20 reserved for use in my car. An additional advantage to having a second one is if anything happens to the one I walk with, I'll have a backup. But, unfortunately, Bose discontinued the QuietComfort 20 forcing me to have to find another option for use in the car.I first purchased the wireless Bose QuietComfort Earbuds. But I found much to dislike about them. They feel heavy in the ears; the buds themselves just feel heavier and less comfortable than the QuietComfort 20 Headphones. I also disliked that every time I put the Bose QuietComfort Earbuds into my ears they speak to me telling me they are trying to connect to my device and also reporting battery state. I found this incredibly annoying. Another thing I hugely disliked was that there is an uncomfortable \"boom boom\" sensation as I walk with them in. I wear Vibram FiveFinger shoes and do not walk with a heavy gait. I do not get this \"boom boom\" sensation when walking with the QuietComfort 20 headphones. I also disliked how big the Bose QuietComfort Earbuds' case was. I disliked how the Bose QuietComfort Earbuds sometimes felt like they weren't secure in my ears and when I would try to adjust their stability I would accidentally change the noise cancellation setting. On two occasions, an uncomfortable high pitched sound emitted from one of the buds; it only lasted for a couple seconds but it was annoying. I tried using the Bose QuietComfort Earbuds for a month and never could bring myself to like them, so I returned them. I now have a strong dislike for Bose, primarily because they discontinued my beloved QuietComfort 20 Headphones. But up until recently, I was a huge Bose fan.I purchased Apple AirPods Pro. I immediately fell in love with the H1 chip operation. But I didn't like the color white. I also didn't like the stalk that extends down. But I started using them thinking I had found my noise cancelling option for the car. And although the AirPods Pro delivered some \"boom boom\" sensation while walking, it was much much better than the Bose QuietComfort Earbuds. Then I started to become aware of a huge problem with the AirPods Pro. They would not stay in my ears. I would place them in ear, hear the noise cancellation activate and then in time the noise cancellation would turn off because one of the pods had pushed out of my ear enough to cause the noise cancellation function to disengage. I found myself constantly having to push them into my ear in an effort to keep them from pushing out. A couple times they plain fell out of my ears. I consulted instructionals on how to properly insert them into my ears for proper fit. I also did the fit test and passed the test indicating I had good seal. Only the seal wouldn't last and the pods would eventually push out of my ears. So I had to return the AirPods Pro because they wouldn't stay in my ears.I purchased some non noise cancelling earbuds thinking that a passive seal would be enough, but I found a number of problems with this option. I didn't like shoving thing way into my ear. Not only was it a little uncomfortable, but I also wondered about the sanitariness of touching (e.g., foam inserts) prior to shoving them into my ear. Maybe this could lead to ear infection? Also, the amount of sound isolation was too good which diminished my situational awareness while walking and/or driving. So passive noise block earbuds weren't solving my use need.I was worried there was no option for the car and I would not have a backup to my beloved QuietComfort 20 headphones. I really wish I could buy another pair of QuietComfort 20 headphones just to have a backup for the future. After delaying and delaying, I decided to go to the trouble to try one last option for the car: the Beats Fit Pro. Eureka!The Beats Fit Pro are fantastic! They have the H1 chip, which is awesome. They fit and feel way better than the Bose QuietComfort Earbuds and are super secure in my ears, unlike the AirPods Pro. The Beats Fit Pro feel so light to wear. I can wear them all day and there is no discomfort. They also have a button to cycle through the noise cancellation options, which I like a lot better than the tapping that was needed on the Bose QuietComfort Earbuds. I also like the button press on the Beats Fit Pro better than the stalk-squeeze on the AirPods Pro.The one edge that I might say the Bose QuietComfort Earbuds have over the others is the noise cancellation. The Bose QuietComfort Earbuds arguably provide more intense noise cancellation that results in more of a bass presence and a sense that the content being played is closer to you. However, there is a cost to this that I don't think is worth it. The biggest cost for me was the \"boom boom\" sensation while walking. I don't know exactly what is to blame for this but it completely ruins the earbuds for what I want to use them for. I found the fit and noise cancellation of the Beats Fit Pro to be better suited to my needs.I wrote this to help others in their quest to find the earbuds that work best for them. I strongly recommend giving the Beats Fit Pro a try. I like them a lot. I think many others will too.ADDENDUM (added 2022-NOV): My beloved wired Bose QuietComfort 20 Acoustic Noise Cancelling Headphones stopped working a few weeks ago. I purchased the wired Bose Headphones many, many years ago and used them a lot, so it was not unexpected. Fortunately, the Beats Fit Pro have been able to replace the wired Headphones for my daily walks. The Beats Fit Pro have minimal \"boom boom\" sensation while stepping/walking. Although the Beats Fit Pro have more \"boom boom\" than the wired Bose Headphones, the \"boom boom\" is minimal and much, much better than offered by the wireless Bose QuietComfort Earbuds. I have been using the Beats Fit Pro in cold weather lately and discovered that the physical side button on the Beats Fit Pro works fantastically when wearing a hat. For example, if I am wearing a thick knit winter hat, I can still activate the side button on the Beats Fit Pro by pushing on the outside of the hat. This can't be done with a touch-operation \"button\" like found on the Bose QuietComfort Earbuds. The AirPods Pro \"button\" might be more difficult to operate with a hat on too. So if you are intending to use earbuds under a hat or hood, Beats Fit Pro will give you the advantage of still having full, easy use of the side button for play/pause operation from outside the hat.",
                "reviewVotes": "665 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Giovanni Torres",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 7, 2023",
                "reviewTitle": "Excelente audio",
                "reviewText": "Se escuchan muy bien. Para el precio/ calidad están bien y razonables",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ramona Strange",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 13, 2023",
                "reviewTitle": "not for small ears",
                "reviewText": "I ordered these, hoping they would work for me. But alas, with my small ears, they did not work. The small earbud tip was good, and got a decent fit, but the wing tip is huge, barely could be bent to 'fit' in my ear, and caused painful pressure after less than an hour. (if the wing tip was removeable, or also able to change for size, these would be perfect. But it is not.)the sound quality it stunning, and the ANC is amazing. When I put them in, I was sitting next to a noisy air conditioner, and because the design senses when they're in your ear - even though I wasn't 'listening' to anything - they immediately cut the noise. I was sitting in a silent room. Crazy cool. And shocking how well it works. I tested the other sound settings, the 'transparent', which yes, could listen to music and also hear everything going on around me; as well as the basic 'off', which was between the two and a good choice for some situations.So, I was super sad to return these due to fit. Highly recommend. Seamless instant pairing for iphone. Simple settings found under the bluetooth connection for them (a dedicated app, [or setting] would be nicer & easier to locate)The one drawback is the face of the earbud is a 'button'. so anytime you try to adjust how the earbud is sitting in your ear (like because it's not fitting right) you press the button. Turning music on/off, or whatever you have the button etc. to control. And at least you can change what it operates.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carlos noberto p da silva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on April 7, 2022",
                "reviewTitle": "Qualidade de audio.",
                "reviewText": "Boa qualidade de audio,Bom sistema de fixaçãoRazoável Sistema de cancelamento de ruídoDeveria ter um aplicativo com mais funções",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kenza khidioui",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2024",
                "reviewTitle": "The best for athletes",
                "reviewText": "I have been using it for more than a year so I can give an honest opinion about the sound quality and why it's really best for workoutSound Quality: An outstanding sound quality. Whether it's the deep bass in high-energy tunes or the subtle nuances in acoustic sessions, these earbuds offer an unparalleled listening experience.Noise Cancellation: Well it's not the best active noise canceling pair but it does effectively eliminate external noise. So it=f you re in your neighboring gym or jogging in a crowded park, they will ensure that you remain focused unless you want otherwise :DDesign: The secure-fit wingtip design is a game-changer. Regardless of the intensity of the workout or your ear size, these earbuds stay securely in place.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alaska",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 6, 2023",
                "reviewTitle": "A bit uncomfortable",
                "reviewText": "I really liked this set of earbuds. The sound was clear and they had good bass. They would not fall off my ears. I was very happy with them, except for a couple of things that bothered me. The first one was the bluetooth kept disconnecting depending on the area of the house I was entering. The same happened when I was outside, and my phone was in my purse, because of the movement it would disconnect sometimes. The second thing that bothered me was that after 1-2 hours or wearing them my ears started to hurt.The earbuds in itself are amazing, a bit pricey but of very good quality. You can drop them in water and they keep working. The only problem for me was my ears are sensitive, and I couldn't wear them for too long.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}