{
    "remaining_requests": 48541,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Meze-Classics-Walnut-Silver-Headphones/dp/B01EJMYOHO",
    "body": {
        "name": "Meze 99 Classics Walnut Silver | Wired Over-Ear Headphones with Mic and Self Adjustable Headband | Classic Wooden Closed-Back Headset for Audiophiles",
        "price": "$309.00",
        "originalPrice": "",
        "rawPrice": 309.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Meze-Classics-Walnut-Silver-Headphones/dp/B01EJMYOHO",
        "soldBy": {
            "sellerID": "A43XUH5I6FNM3",
            "name": "Crutchfield",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A43XUH5I6FNM3&asin=B01EJMYOHO&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B079ZX2JDT"
        ],
        "asinVariationValues": [
            {
                "asin": "B018VZBH5M",
                "variationName": "Color",
                "variationValue": "Gold",
                "price": "$309.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41eZsA4NJEL._SS36_.jpg"
            },
            {
                "asin": "B01EJMYOHO",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "$309.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/415OHzZ1anL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/415OHzZ1anL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51M4rDfLqdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OuRUVZN2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513lNctp7vL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410-wYB0weL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wXniV2cbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41y7pRmh4sL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a293fe1f-42ef-452f-8d62-0dfd9b708d1c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9158c2a0-c0ef-483a-ba99-ed41c8781200/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ab73c371-2237-47b3-8a10-3671a2a9ff64/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/3c53ff1e-99d7-560c-bd67-17afd4bbbf44/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1aedc523-4dc0-4fdc-92f5-b39fd80fd8fb/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/beb928b7-71a9-4a8e-bb82-6f3b26bc47ca/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: MEZE AUDIO",
            "link": "https://www.amazon.com/MEZE-AUDIO/b/ref=bl_dp_s_web_20593889011?ie=UTF8&node=20593889011&field-lbr_brands_browse-bin=MEZE+AUDIO"
        },
        "brand": "MEZE AUDIO",
        "merchantInfo": "MEZE AUDIO",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1375,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 13 - 14.",
            "FREE pickup Friday, February 16",
            "Or fastest pickup Tuesday, February 13. Order within 9 hrs 13 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Regarded as the stepping stone into the world of audiophiles, the MEZE AUDIO’s 99 Classics series are renowned for their exceptional performance. POWER EFFICIENT WITH ANY DEVICE due to low impedance (32 Ohm). No need for amplification.",
            "EQUIPPED with GENUINE WOODEN EARCUPS, these headphones offer excellent natural sound isolation, making them ideal for tasks like studio recording, video editing, and podcast monitoring. They seamlessly connect to your computer or smartphone, and for an enhanced music listening experience, consider pairing them with a DAC, AMP, or DAP.",
            "SELF-ADJUSTING PU Leather HEADBAND that spreads the weight out and fits all head sizes, making the Meze 99 Classics a comfortable premium high-end headphone. It features a Lightweight hi-res headset weighing only 9.2 ounces, with soft comfortable earpads made for long listening sessions with no ear fatigue. Suitable for all music lovers, guitar, midi keyboard, and instrument players.",
            "INCLUDED ACCESSORIES: Hard carrying pouch for better protection, detachable 1.2m thread Kevlar OFC cable with microphone and remote, detachable 3m thread Kevlar OFC cord, 3.5 mm to 6.3mm gold-plated jack adapter, airplane jack adapter, cable pouch.",
            "FULLY SERVICEABLE: No glue, just nuts, and bolts. We guarantee that all the 99 Classics are made of replaceable parts. These headphones are built to last."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "Over-Ear Headphones",
                "link": "https://www.amazon.com/Over-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097479011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "9.45 x 8.67 x 4.33 inches"
            },
            {
                "name": "Item Weight",
                "value": "9.2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B01EJMYOHO"
            },
            {
                "name": "Item model number",
                "value": "M99C-WG"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,375 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#52,762 in Electronics (See Top 100 in Electronics) #1,657 in Over-Ear Headphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Wireless communication technologies",
                "value": "No"
            },
            {
                "name": "Connectivity technologies",
                "value": "Wired"
            },
            {
                "name": "Special features",
                "value": "Microphone"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Audio Jack",
                "value": "3.5 mm Jack"
            },
            {
                "name": "Form Factor",
                "value": "Over Ear"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Whats in the box",
                "value": "Cable"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Meze Headphones"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "Date First Available",
                "value": "April 20, 2016"
            },
            {
                "name": "Weight",
                "value": "9.2 Ounces"
            },
            {
                "name": "Units",
                "value": "1.0 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "MEZE HEADPHONES"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired"
            },
            {
                "name": "Wireless Communication Technology",
                "value": "No"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Meze 99 Classics delivers perfect natural sound even to the pickiest of audio lovers. The walnut wood earcups, soft earpads, and the spring steel headband will make the 99 Classics an heirloom rather than just a pair of headphones",
                "media_link": []
            },
            {
                "media_text": "ONE OF A KIND HEADPHONES Just like fingerprints, wood grain is as unique, thus making each pair of Meze Headphone a one of a kind. You will love how they feel in your hands. Sturdy built and precise assembly. The ear cups are made with a satin finished wood grain. Put them on, sit back, and enjoy your favorite sound of plucked strings, upbeat grooves or thumping beats while still looking classy",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/f906fea7-e8cf-4c30-9bc1-01c06f573047.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "PREMIUM SOUND DESIGNED FOR THOSE WHO KNOW We're taking headphone design to a new level by combining modern with handcrafted design, using natural materials and focusing on delivering the best premium sound. Our aim is to change the perception of headphones as technical devices or as cheap plastic accessories and create a mature product to fall in love with.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/0ecbc1c4-7744-45dc-a836-1f1bf57a6ae9.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "WOOD TECHNOLOGY The choice of wood is an inherently difficult one. The rich colors of walnut require the use of air drying, a long and expensive procedure. The process of shaping just a single pair of earcups takes up to 8 hours. The whole process of sanding, lacquering, and finishing lasts 45 days. The wooden components are carefully inspected and no flaws are permitted to reach the final assembly.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/ebaca9ec-11d4-4a68-9009-b851d9f89cfe.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "FULLY SERVICEABLE We aimed for perfection in every component we designed. CNC carved wood ear cups, cast zinc alloy hardware with electroplated coating, stamped manganese spring steel headband, memory foam and soft PU leather are the materials your hands and eyes will get to enjoy. No plastic here for you to see.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/80cf9dc9-a368-4bd7-bbc8-fccf45c336e5.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/7024d16e-5fc8-4964-837c-e62d895cb90b.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/f906fea7-e8cf-4c30-9bc1-01c06f573047.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/0ecbc1c4-7744-45dc-a836-1f1bf57a6ae9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/ebaca9ec-11d4-4a68-9009-b851d9f89cfe.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/80cf9dc9-a368-4bd7-bbc8-fccf45c336e5.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "George R.George R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSLK6WEJZSC2SS7HW6XUZHGGIRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR18RIWE9JTUM?ASIN=B01EJMYOHO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2022",
                "reviewTitle": "5.0 out of 5 stars An astounding introduction to the world of audiophile headphones.",
                "reviewText": "So first things first this is going to be a bit long in the tooth but the TLDR version is as follows: For someone just starting to develop their ear for audiophile peripherals and devices who also happens to be leaning towards luxury stylings, this is an unbeatable package (that also doubles as an investment). These deliver a detailed and non fatiguing listening experience and damn do they look good doing it!I'm going to begin by explaining a brief background on my listening habits and what devices I have experience with. First and foremost I am by no means an audiophile, but I am becoming more interested in HIFI audio as time has gone on. My very first pair of headphones I ever purchased were the Auvio 33-290 (A very apt direct comparison to the Meze 99s if only looking at the contents of the boxes haha!). I seriously thought they were the coolest headphones ever what with the ANC (powered by two AAA batteries as was the fashion at the time) and a hard case as well as two cable attachments 1 for a hifi stereo and another for an airplane audio port (the perfect set up for an angsty teen who's family moved around as often as mine did). I used these as my daily drivers for years and I never even considered there being a better alternative. So you could imagine my surprise the first time I tried on a pair of first generation Bose QuietComfort QC1s. Before then I never realized a pair of headphones could simultaneously be quiet (the Auvios being all plastic and rather cheaply made rattled like crazy), comfortable (the plush memory foam on the Bose was a treat to my head after the abuse the earcups and headband padding had taken on my Auvios), and actually make music sound better (the first time listening to a pair of high end headphones after only ever listening to a set of cans from radio shack is really only something you can experience for yourself). Now all that being said I never did buy that set of Bose headphones because I didn't really care much about the difference in quality once I saw how much more expensive they were than my Auvios. Even though I didn't buy them, that first experience with a luxury headphone still stuck with me and eventually lead me to the Meze 99 Classics over a decade later.I can safely say listening to the Mezes for the first time took me right back to that same feeling I got with the QC1s! For starters calling Meze headphones high end or luxury is to almost understate the actual beauty of the headphones themselves and the overall presentation. From the logo on the form fitting hard case to the gold accents and walnut ear cups, everything on these exudes confidence and quality craftsmanship (hell even the zippers are satisfying). I'm going to break everything down to those three key areas I mentioned before:Quietness:These headphones have a spring steel headband which means they're extremely solid (no rattle to be found here). You also won't find any plastic on these headphones and every piece is secured with screws so all you hobbyists out there can tear them down and replace components as needed with very little fuss! The cord also is part woven kevlar and part rubber coated which also contributes to a nearly noiseless headphone (the most noise I've heard from them has been the earpads adjusting after slipping the headphones on, something that will change once they're broken in of course). This cable can of course be upgraded to a balanced cable should you aim for a more audiophile focused listening experience.Comfort:The first thing I noticed when I picked up the box was just how light the entire package was, something that was a great indicator of just how comfortable these were going to be for extended listening. You couldn't imagine my face once I was actually holding the headphones solo, it was like some sort of antigrav technology (hyperbole I know, but they're seriously light!). Then once I actually got them on I immediately knew I could never go back to a standard headphone band. Having a self adjusting memory foam headband coated in PLU with the lush earcups was a total treat! Again I have to express how weightless the package feels due to how comfortable it is! The fact that they don't majorly squeeze your head is a major plus as well. This is still yet another area that can still be improved further with the wide availability of differing earpads (I am honestly smitten with these ones though, the comfort and noise isolation is perfect for my tastes and I haven't noticed the pads contributing to any sort of increased base presence as I've seen mentioned in other reviews).Music Enjoyment:Again, I can't stress enough that I'm not an audiophile but that I do thoroughly enjoy music and have a pretty decent ear for it (don't worry though, I'm not about to go on about frequency response and things of that nature, better to leave that to the pros). So when I say that these improve the listening experience what does that mean exactly? Aside from the obvious comfort of the headphones themselves (a must for extended listening sessions) you also get a far more full bodied 3D audio experience from your music. This is a headphone that will seriously give you moments of amazement and joy as you're able to hear elements of your favorite songs that you might never have noticed before. If you pay attention you may even start to get this spatial awareness of where the different elements composing a particular song are coming from. It's really one of those experiences that will stand out to you the more time you spend with these headphones. That being said, you may be wondering if there's a particular genre that these excell at and so far I haven't found one that stands apart from the rest. I listen to A LOT of music encompassing many genes (I'd say my comfort zone is somewhere between punk and prog rock with a lot of new age jazz for some variety) and these headphones have truly improved the listening experience with every song I've tried them with. They can even take some crunchier punk recordings and still pump some extra depth into them without really making you notice that lowfi quality in a bad way. They're just really great all around headphones delivering depth that you would normally need open backed headphones to even scratch the surface. They handle these different elements all while delivering a really fun listening experience that isn't going to fatigue your ears and doesn't require anything more than the device of your choice to achieve.Final Verdict:Given that my most recent pair of headphones prior to purchasing these was not my old Auvios I must admit my world was not turned upside down in the exact same way with my first listening session, my enjoyment more so built over time. These days I use a pair of Sony WH-CH510s for music and a pair of Skullcandy Hesh 3s for gaming and travel. Neither of these are particularly high quality headphones, but they can still deliver a pleasurable listening experience without being overly expensive or fussy. The 99 Classics, on the other hand, are in a class all their own in terms of the quality and engineering in comparison to their cost. Not only do they look the part of a premium headphone but they sound incredible to boot and are fully serviceable. This all boils down to these being more of an investment for me personally as I'll be able to keep these operating for years to come and even upgrade certain components as my needs change. The fact that these headphones can hit so many marks at the $300 price point is truly a remarkable feat and something to be admired (especially in the wake of planned obsolescence). All in all, I'm overjoyed to own these headphones and if you find yourself looking to invest in a quality pair of headphones, I think these could fit your needs just fine!",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51OKYlxFCML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61++y-ZFKoL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/614ik8+FSdL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61FgeBup8iL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61I79PFzd0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61WF+vpI74L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61WzQmnAU+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61jn7bgzq4L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Browncoats Unite!Browncoats Unite!",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNE7HJ47POZQSWQI3NCPSJ7RB5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIHS5Y293H8RO?ASIN=B01EJMYOHO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome set of headphones",
                "reviewText": "Let me start by saying that I am far from being a headphone aficionado, but I’ve tried some more pricey headphones from Beats and Thieaudio, as well as the iPod Pro earbuds. I have to say that these are my favorites by far!Starting with the style and build quality, they’re fantastic. They look cool (to me), the fit and finish is excellent, and the parts are designed to be user-serviceable should there ever be a problem in the future. Moving to comfort, I find these to be very comfortable to wear for long listening sessions. I tried some angled Brainwavez ear pads, but very quickly switched back to the stock pads. These headphones are lighter weight than expected and have just enough adjustment to be comfortable without too much of the clamping feeling you can get from other headphones. Next are the included accessories, which consist of a rigid zipper case, two sets of cables (one long, one short), and a couple of adapters in a separate storage pouch. The cords have in-line controls that work with my iPhone (and Android devices as well).Now we get to sound quality. I mostly listen to hard rock and metal, and I like some good bass response (something I found lacking in my other headphones). These sound fantastic! The highs are clean, the mids are full, and the bass is more than I could have asked for. Being closed-back headphones, they also do a decent job of not disturbing other people around you. The resistance is low enough that you can listen to these on a cellphone, but pairing these with an amp really makes them shine!I don’t claim that these are the absolute best sounding headphones available, but I feel that they are amazing for headphones in this price range.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714wmVooEXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71YK9GJ4-3L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTQR6SW77EOMM63GETVHNXFEKBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYP3CFUWNWVL4?ASIN=B01EJMYOHO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing, fun, colored option.",
                "reviewText": "Solid wood, real metal construction, self-adjusting headband... So hard to beat. I'm actually listening with them right now while writing this....These are as comfortable as AKG K240s, however, I prefer the circular earpads over these. They're a bit small, but I've gotten over it. They are still over-ears, just they have to sit *perfectly* so the inside of the pads don't touch your ears. Note: the driver does not touch, just the inside edge of the pads, and that's only if it's not adjusted perfectly.Replaceable earpads. I wouldn't normally highlight this, but I returned Austrian Audio headphones for these and I was disappointed in the non-replaceable earpads...Semi-standard cable. I love that I can effectively pick my left/right, however, I could see that being a potential issue where some headphones have the drivers facing more towards the ear. These are just flat so you can wear them either way.The default cables are kind of garbage. They look nice and feel okay. Braided up to about 12\" from the headphones where it shifts to rubber for some reason. This part of the cable can sometimes pick up noise from rubbing on shirts and zippers, but it's not terrible and really only noticed when I do it on purpose to test.The in-line mic and controls on the shorter cable isn't great. It's a single button hidden under this awkwardly long rubber section making it all soft. It makes it hard to find the button. The plastic housing is also round removing a lot of friction to squeeze. Most in-line controls are a rectangle prism, so 2-4 flat sides, with the button(s) on a flat side. This gives a good pinch point. This housing kind of rolls around, and sometimes I'll wear these while not having great dexterity like gardening with gloves, or doing dishes.The left cable has a little bump on it making it easy to find the difference between left/right in the dark or without looking at it. The shorter mic cable has the housing and controls on the left cable, but the longer studio cable has nothing. Both have the slight ridge on the housing of the left cable plug, making it easy.Both cables have very nice brass connectors on them making it feel premium.All this writing and I'm still not on the sound of the headphones!! They sound amazing. I'm discovering details in songs I've listened to for years. The bass is higher than some might like, but it's not muddy. It's just slightly higher. They're not reference, but they're not supposed to be. They're fun. It's got a V sound, but it's subtle. I've let friends try them compared to my k240s (open-backs, but still) and they're blown away being able to hear new instruments in the background of songs, or getting able to hear the texture of an instrument instead of just the *sound*.The box is beautiful. I'm keeping it on a shelf.The case is amazing. Mine got damaged in the first week of owning it sadly, but it's just a few scratches. Nothing major. I'm taking the headphones with me on vacation soon and I'm mainly bringing them over other options *because* of the case. I feel confident I can throw it around and it'll be fine. It's got a little pouch in the center for all the cables and accessories.THE ACCESSORIES!! It's got the longer cable (I don't remember the measurements. They're in the product description, and I can't be bothered to look), the shorter mic/in-line controls cable, the aux adapter (smaller to larger) that just PLUGS IN. No screw BS. I can use it for other headphones as well completed to the threaded one I received with a couple other sets that are incompatible. Also in the pouch is an airplane dual-mono > aux adapter. You can tell the founder flew a lot lol.Also considering the repairability of the product, as a proud Framework laptop owner, I love it. You can tell the company really cares about it's customers. I've had no problems with the headphones yet, but I will certainly be in contact when I have an issue and need a part!! Easy 5-star, and I'll be buying something else from this company next time!How much I would love the Empyreans.....",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "STEGO BOARDSTEGO BOARD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 23, 2022",
                "reviewTitle": "The best headphones I have ever felt on my ears. Warm sounding music. Close, tight sound.",
                "reviewText": "First, a few things that are important to mention. I am not an audiophile at all. I do not pretend that I know more about anyone else when it comes to headphones.I have tried a few different headphones and can afford any headphone set inside the higher price range on the market. All I want, is a simple, excellent sounding, extremely attractive looking set of over ear headphones. But also something people notice, while probably never seeing it before. I like having things people will most likely not have. So I didn't want a Bose or Sony. When I have 30 minutes to 2hrs to relax, I want to slip into a comfortable music bubble and enjoy what I'm hearing.I had never heard of Meze before. No one I know has either. You probably haven't either. After doing a history check, this headphone set has been around since 2015. Internally, there has probably been some engineering changes to the headphones since then. (Read recent reviews instead of the original ones. I have read they changed the product since the ones from 2015) Any product that can stay around that long, (from a small company in Romania) as well as have incredible reviews (across many websites and youtube), was worth me trying. So I bought a pair.A few more things that are important to mention. The 99 Classics and 99 Neo are both made in China. There is no sound cancelling. They are not wireless. There are no bass buttons or switches on the earcups. There is a microphone on the short cable, which I don't care about, haven't used and never will. I'm not taking calls with these. The paper booklet included does say to use them for 40hrs of burn-in time to reach optimal performing state. After already burning my wallet.The cables are very nice. 10ft and 4ft. You can switch them easily. There's no left and right labels on the earcups. The cables have the labels L and R. The case is the perfect size and shape. It feels good to grab with your hand. Outside feels okay. I think it could be better on the inside. (Basic fuzz that holds velcro nicely, but looks cheap). Some fabric would make it feel more like a luxury item. The logo emblem should be metal for the price. Overall, the case is classy looking.The look. Straight up sexy. The walnut and gold with steel frame look so different from anything else you see people wearing. And they look expensive. Wore them in the office. Turned heads. Questions were asked. Many people liked them. You say \"CNC Machined Walnut\" and people know, these aren't standard headphones.The feel. The best headphones I have ever felt on my ears. That will be the experience for most people who try them on. I have standard size ears, that don't angle or cup outwards. The cups fit perfectly over my ears. The inside face of the cup does just barely lay on my ears. Just a slight touch. I know for some people this is a deal breaker and downside. It isn't for me. The ear pads are memory foam that feel like wonderful marshmallows that seal extremely well. They feel excellent. My ears got warm in 30 mins. The headband has some stretchy thing in it that allows adjusting instead of the way you do with most headphones. I have a slightly larger than average male head and it worked well and was comfortable for me. I have a set of Status Audio CB-1 headphones, which have been really good for video editing and general use, but after 1.5hrs, they do start to give me a headache. I've read this is actually really common for many people (over ear headphone use) and had no idea. I thought it was just me. The Classics 99 do not do this for myself and I don't know why. However, I do find sweat gathers at the ear pads in most situations where there is no air conditioning in the room (after 30 mins or so). It's a very tight seal. Others have mentioned the PU peels off the ear pads after months of use. Since they are not leather, this is definitely going to happen at some point. But there are after market ear pads I have seen from a variety of sellers. These headphones are actually designed with replacement parts in mind. Which is good because the thought of throwing out good high priced headphones because of PU peeling off earpads is not cool. I wish more headphone companies would do this.The sound. After giving them 40 hrs of use, this is what I experienced. Warm sounding music. Close, tight sound. A small soundstage. For the first time, I can really tell the difference between low quality mp3's and high quality ones. Everything I listen to sounds better (in my very inexperienced opinion) than what I paid for. And that's all I really wanted.When I have the music going, (kind of loud) a coffee grinder can be used 15ft from me and I don't hear it unless I really try. Impressive, but it's probably only because the earcup memory foam seals good. So then I figured, if they sound this good, will they sound better with an amp? They don't need one at all, but a few people had written on different sites, that they actual do sound slightly better with an amp. Again, I'm not an audiophile, and don't know if an amp will do anything worthwhile so I didn't want to spend a lot. So I found a cheap amp on Amazon called MYPIN HA.0290. Super cheap with good reviews. And it actually did make the sound just a bit little bit better. I don't know how to describe the change. Obviously I could drive volume louder with no distortion. The sound was a bit brighter and warmer. Not by much, but it still was very cool, that a cheap amp.. did anything at all. So I kept it. After falling in love with this new combination of toys, I decided it would be nice, to have an mp3 player and amp together in one unit with a short cable linking them. Found dual 90 degree short headphone cable on Amazon called Sinloon. Then got my old iPhone 6 and designed a 3D printed case holding the phone and amp together. One day I'll get something better, but I'm new to all of this and it does the job perfectly as is. Now I just grab the headphones and the player/amp whenever I want to escape into a nice music nap.Anyone I have let listen to these headphones love them. But none of them are headphone snobs or audiophiles, so they may be just as pleased with anything else in this price range. But the comfort and the looks are next level to me.I took some pictures in my photo booth with my iPhone. Enjoy!Update: Four months in and these headphones still work perfectly. Everyone that has tried them likes them a lot. I decided that it was time to design a very good 3D printed case with rubber cushions to keep them safe. I also don't have to unplug the cables from the earcups to put them away each time. All the files are free to download and print for anyone. Just search Thingiverse for Meze 99 Classics.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61TG5cnVQKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61gVKnlLW+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7191iNWesVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61RHV-EcEHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51WzOju27oL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61TxDzjhevL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Kx3UtlNmL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Du95PnChL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "GG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 6, 2023",
                "reviewTitle": "Eine Ansage...",
                "reviewText": "... die schon bei der Verpackung anfängt. Eine gut designte Verpackung aus dicker Pappe mit Magnetverschluss. Drinnen findet sich ein Hardcase aus Kunststoff mit 2 verschieden langen Kabeln und 2 Adaptern in einem separat gepolsterten Etui und natürlich der Kopfhörer. Auch das ist bei weit teureren Boliden nicht gängig.Als ich ihn das erste mal sah, dachte ich, waohh, aber den kannst du dir eh nicht leisten und dann sah ich den Preis und er ging mir nicht mehr aus dem Kopf.Und jetzt ist er hier. Er sitzt perfekt auf meinem Kopf und auch lange Sessions sind möglich. Wenn ich so in die Musik versunken bin, spüre ich ihn nicht mehr. Top.Und der Klang? Ich bin eher analytischer Hörer und regel die Höhen bei meinen nuVeros etwas nach oben, der Basschalter steht auf reduziert und der Bass ist noch etwas nach unten korriegiert aber das Klangbild dieses Boliden ist schon etwas besonderes. Glasklare Höhen ohne Spitzen, helle und saubere Mitten ohne nach Dose zu klingen. Ein schneller, fetter und trockener Bass mit etwas mehr im Mittenbass, der manchmal in den Ohren ein wenig kitzelt. Und genau dieser Bass macht etwas besonderes mit dem Sound. Da braucht es für mich keinerlei Korrektur weil die Abstimmung schlicht perfekt ist. Das betrifft auch eine für mich weite und tiefe Räumlichkeit mit der Möglichkeit Instrumente im Raum zu orten. So etwas erlebt man eigentlich nur sehr selten und in weit höheren Preisgefilden.Auf der Kopfhörermesse CanJam 2016 hat er in der Kategorie \"Best Product\" neben dem Sennheiser HE1 (59000€ - kein Scherz) und dem Focal Utopia (5000€) den dritten Platz gemacht und nach ca 3 Wochen und etlichen Stunden Einspielzeit mit unterschiedlichen Genres weiß ich auch warum.Er ist immer nur besser geworden und wenn ich ihn sehe, möchte ich sofort weiter damit hören. Hören mit dem Meze 99 Classic ist purer Genuss. Er spielt einfach grandios authentisch, holt dich voll und ganz ab und lässt dich den Alltag vergessen. Suchtgefahr garantiert.Zu den Nachteilen oder Einschränkungen sei erwähnt, dass das Mikrofon samt Schalter, welches im kurzen Klinkenkabel verbaut ist, nur bei Handys funktioniert, die einen 3,5 Zoll Klinkenanschluss haben. Beim Einsatz eines USB-C Adapters oder gar einem externen Hires DAC, funktioniert das Mikrofon entweder verzerrt oder gar nicht mehr.Im Übrigen und der Bauart geschuldet, ist der Kopfhörer eher nicht zum Herumlaufen geeignet, da die Nebengeräusche nicht unerheblich sind und auch die Geräusche, die vom Kabel ausgehen, sind nicht zu verachten.Da mobiler Einsatz aber nicht mein Hauptkriterium ist, ziehe ich hierfür keinen Stern ab.Was bleibt ist nach wie vor ein echt heißes Teil mit einem besonderen Sound, der so klingt, wie er aussieht, der Top verarbeitet ist und weit über seine Preisklasse hinaus spielt, sehr weit und ich habe schon einiges gehört. Ein absoluter Preisknaller und eine gediegene Ansage der Firma Meze an die Konkurrenz, der beim Hören immer wieder ein breites, zufriedenes Grinsen produziert.Glückwunsch und vielen Dank für bis jetzt schon viele Stunden Musikgenuss pur, weit ab vom Alltag.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jb1014",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 22, 2023",
                "reviewTitle": "Musical and immersive",
                "reviewText": "Straight out of the box I was struck by the beautiful design of the headphones with the wood cups a real standout - much more striking that the pictures. Obviously what matters most is the sound. I’ve always preferred in ears in the past and have many pairs ranging from £100 to £700. The in ears are on a par with the more expensive in ears I have. Incredibly musical and immersive is the best way I can describe it. You can really get lost in the music. Very impressed and I can’t wait until they are properly worn in. Big thumbs up to Meze!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Titanesk",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 4, 2022",
                "reviewTitle": "Design, léger, et un son de qualité",
                "reviewText": "Pour commencer, le casque parait plus grand sur les photos qu'en réalité, j'avais peur d'avoir deux grand cerceaux métalliques qui recouvre ma tête et en faite, non, il est de taille raisonnable, la qualité de fabrication est exemplaire, le bois est doux, pas brillant, mais satiné.J'ai opté pour la version argenté, je trouve qu'elle va mieux dans me setup et surtout elle fait moins bling bling, c'est une question de goût.Très confortable en tête, je le porte pendant des heures et je ne le sent pas, les coussinet sont bon, j'en ai commander Brainwavz Audio la version \"Angled Oval Headphone Memory Foam Earpads\" histoire de voir si l'effet de résonance que j'ai quand je parle en stream diminue et aussi pour encore plus de confort.La qualité audio est top, ça me change de mes HyperX alpha, et ils sont class, bien que je ne sois pas un expert niveau sonore, j'apprécie le son qu'ils dégagent.Foncer vous ne serez pas déçu.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robyn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on October 21, 2022",
                "reviewTitle": "Wonderful consumer-oriented phones.",
                "reviewText": "Simply put;these cans are not the best value if you only factor in sound fidelity but...As for outdoor, traveling and general consumer oriented purposes, I love them.The 99's are built like a tank while looking as refined and classy as they do. You can easily drive these from nearly any powered output, reacting very potent to additional amplification too, even if unnecessary.Sound is noticeably warm and rather wide, though not excessively dark.You can certainly call them 'coloured', in general terms. This can work quite well for bassy electronic music,largely due to compressed nature of this genre, less so for mud-sensitive genres (metal, indy, new-wave,...)Verdict: I wouldn't want any other set of cans for going about my day, more serious equipment awaits me when I return to my listening room.Satisfied!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$309.00",
                "sellerName": "Audio Advisor, Inc.",
                "sellerRating": "5"
            },
            {
                "price": "$309.00",
                "sellerName": "Photo-Zone",
                "sellerRating": "5"
            }
        ]
    }
}