{
    "remaining_requests": 48561,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/INFURTURE-Cancelling-Headphones-Wireless-Bluetooth/dp/B0B879C5DS",
    "body": {
        "name": "INFURTURE Active Noise Cancelling Headphones, H1 Wireless Over Ear Bluetooth Headphones, Deep Bass Headset, Low Latency, Memory Foam Ear Cups,40H Playtime",
        "price": "$54.99$38.13$54.99",
        "originalPrice": "$59.99",
        "rawPrice": 54.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/INFURTURE-Cancelling-Headphones-Wireless-Bluetooth/dp/B0B879C5DS",
        "soldBy": {
            "sellerID": "A3F83MYX57HMN3",
            "name": "INFURTURE",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3F83MYX57HMN3&asin=B0B879C5DS&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09RWNL2SW"
        ],
        "asinVariationValues": [
            {
                "asin": "B08HDBZNZ9",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$49.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/315bIPRwA2L._SS36_.jpg"
            },
            {
                "asin": "B0B879C5DS",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$54.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41DbObEYJHL._SS36_.jpg"
            },
            {
                "asin": "B0C2HQCLGH",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "$54.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41xCgSDmgmL._SS36_.jpg"
            },
            {
                "asin": "B08RC6981L",
                "variationName": "Color",
                "variationValue": "Rose gold",
                "price": "$54.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41wYayLIB3L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $5 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41DbObEYJHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41B-1FUPWfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41KGpLcTLoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51WYW8UnIFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pOIqAkRwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416wKxfnGZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410Yza2Eo6L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the INFURTURE Store",
            "link": "https://www.amazon.com/stores/GiveyoutheBest%EF%BC%81/page/3805F26B-25E9-44DF-810B-149FDC70E55F?ref_=ast_bln"
        },
        "brand": "GiveyoutheBest！",
        "merchantInfo": "INFURTURE",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 15073,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tomorrow, February 12. Order within 3 hrs 3 mins",
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 48 mins",
            "FREE pickup Friday, February 16",
            "Or fastest pickup Tomorrow, February 12. Order within 13 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Reduces most environmental noise: Infurture Noise Cancelling Headphones adopts the latest noise reduction technology, a combination of active noise reduction and passive noise reduction, which can detect and eliminate a wider range of low and intermediate frequency noise, such as car and aircraft engines and Busy office.",
            "USB-C Fast Charging Function for 40H Playtime: 10 minutes of charging can provide you with 2 hours of listening time. You can enjoy a noise-free world for up to 40 hours. Note: If you do not use Bluetooth Headphones, please turn off ANC to avoid power consumption.",
            "90° swiveling earcups and Universal Comfort: The memory foam earcups can be gently shaped on your ears, and the swivel joints of the headband will automatically adjust the angle of the earcups to fit your head shape.​​ And the Over Ear headphones only weights 7. 2oz(204g) for long-time wear.",
            "High-quality built-in microphone and Bluetooth 5.0: Built-in CVC8.0 microphone can ensure clear calls. You can make hands-free calls, which allows you to easily get rid of the shackles of wires. Note: The microphone can only work in Bluetooth mode.",
            "Powerful bass effect: 40mm drivers can bring better bass. Infurture's active noise-cancelling surround ear headphones bring you crisp, powerful sound and quiet sound, which will help you enjoy music better. Extraordinarily silent listening to fully balanced bass and high-fidelity tones, with extraordinary clarity."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "Over-Ear Headphones",
                "link": "https://www.amazon.com/Over-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097479011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "6.06 x 5.2 x 3.31 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.45 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B0B879C5DS"
            },
            {
                "name": "Item model number",
                "value": "BN601A"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 15,073 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,769 in Electronics (See Top 100 in Electronics) #204 in Over-Ear Headphones"
            },
            {
                "name": "Date First Available",
                "value": "August 1, 2022"
            },
            {
                "name": "Manufacturer",
                "value": "INFURTURE"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Charging Time",
                "value": "5 Hours"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "INFURTURE"
            },
            {
                "name": "Model Name",
                "value": "H1"
            },
            {
                "name": "Color",
                "value": "Blue"
            },
            {
                "name": "Form Factor",
                "value": "Over Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "INFURTURE H1 Active Noise Cancelling Headphones Reduces most environmental noise INFURTURE noise cancelling headphones are high quality stereo headphones that combine active and passive noise cancellation, which blocks most low frequency ambient noise (such as airplane engines, street noise, etc.) and allows you to focus on your music. No matter where you are, on the road, in the office or anywhere else, just turn on the ANC switch to block all distractions and bring you perfect peace and quiet. Note: Normal human voice is not low frequency noise, noise reduction will be less effective Active noise reduction40mm large aperture driverBuilt-in microphone40 hours of play timeLightweight and rotatable designDual Bluetooth Device Connect 2 modes: Bluetooth mode and wired mode When your headset is out of power, you can use the 3.5mm cable to continue using the headset（Enjoy the music） Included Components: 1 × USB-C Charging Cable, 1 × 3.5mm Audio Cable, 1 x Infurture H1 Bluetooth headphones 1 x Manual",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1b40b8cf-489f-46c2-a160-6de946512df0.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Dual Bluetooth Device Connect to your Devices wirelessly with Bluetooth 5.0 INFURTURE Noise Canceling Headphones have Bluetooth 5.0 technology, which supports a dual device connection. Stay connected to your phone while listening on your computer, too..Connect with your device via Bluetooth name: H1 (Please note: For TVs without built-in Bluetooth, a Bluetooth transmitter is required) Soft and Comfortable This Noise Canceling Headphones can be worn for a long time without sweating or oppressing USB-C Fast Charging 10 minutes of charging can provide 2 hours of listeningYou don't have to worry about the battery when you go out",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/297f4bd1-52e2-4dc5-9a43-4e3ee1829fa3.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/42a5a3bf-b583-43e7-b575-11687d83b5ed.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/629641bd-7a1d-4113-82a4-99c7f8ec2455.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Bluetooth mode and wired mode 1.Bluetooth mode 2.3.5mm wired mode When your headset is out of power, you can use the 3.5mm cable to continue using the headset（Enjoy the music） Built-in microphone The microphone of Infurture Noise Canceling Headphones improves sound reception, ensuring that your voice on the other side is clear.Note: (due to the built-in microphone, the sound delivery may not be so loud) Accessories 1. INFURTURE Noise Canceling Headphones 2. USB-C Charging cable 3. 3.5mm audio cable 4. Earphone storage bag 5. Instructions",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3c1411b8-31ac-4220-9d44-d7bd788ef049.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15272ccc-1ac2-43a8-8c8a-6faae366f68b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dcf7c8b0-220c-40d2-9384-6f0af78f04d2.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "INFURTURE H1(BN701A) Main Feature High-quality bass: INFURTURE H1 active noise-canceling headphones have a 40mm driver that can reproduce high tones up to 20kHz, providing full sound with excellent clarity. Active noise reduction: through the intelligent active noise reduction chipset, the Low- and mid-frequency environmental sounds and up to 95% of engine noise are eliminated. Built-in microphone: the enhanced sound pickup can ensure that your voice can be heard clearly when using the INFURTURE H1 noise reduction headset. 40-Hour Playtime: up to 40 hours of listening in noise reduction mode, and 2 hours of listening after 10 minutes of fast charging. Multi-point connection: INFURTURE H1 Bluetooth headset can connect 2 devices at the same time, which is convenient for switching. After device A is connected to the headset, disconnect it and enter the pairing mode to connect to device B. After device B is connected, open the Bluetooth function interface of device A and reconnect the headset to complete the multi-point connection function. Play audio from the first device first If you want to listen to the audio of the second device, please pause the audio on the first device and press play on the second device Phone priority No matter which device you are currently listening to, H1 will automatically answer the call Specification Impedance: 32Ω Driver (full frequency): 2 × 40mm Frequency response: 20Hz-20kHz Item Weight: 0.48lbs Package Weight: 0.7lbs If there is any problem with the product or you have any questions,please contact our support team.（Reply within 24 hours） Download the user manual and QA Manual at Product guides and documents on this detail page",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1b40b8cf-489f-46c2-a160-6de946512df0.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d93a2966-285b-41bb-9c33-1e1a605acd05.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/297f4bd1-52e2-4dc5-9a43-4e3ee1829fa3.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/42a5a3bf-b583-43e7-b575-11687d83b5ed.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/629641bd-7a1d-4113-82a4-99c7f8ec2455.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3c1411b8-31ac-4220-9d44-d7bd788ef049.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15272ccc-1ac2-43a8-8c8a-6faae366f68b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dcf7c8b0-220c-40d2-9384-6f0af78f04d2.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Elizabeth Delehanty",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSZMTNBCFIIJTKHSVWVJET2FDYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T9U955Y8R836?ASIN=B0B879C5DS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2023",
                "reviewTitle": "5.0 out of 5 stars 4.5/5 Stars (not 5/5) LOVE EM’!!!!",
                "reviewText": "REAL PERSON REVIEW! For the price, these headphones are absolutely perfect and exactly what I was looking for. The sound quality is outstanding and they are so comfortable! I bought and returned a few pairs of over ear headphones before I decided on these ones. The ones I tried before always ended up hurting my ears if i would wear them for a few hours and then take them off, so I can clearly remember the moment when after a few hours of wearing these headphones, I took them off and I thought to myself “wow, these don’t hurt me at all!”I gave 5 stars because 4.5 wasn’t an option, but 4.5 is my true rating because the only complaint I have for these headphones is the noise canceling feature. It does a fantastic job for straight white noise which is nice, but it doesn’t do really anything in the way of canceling out voices or anything like that. That being said, the sound quality is absolutely fantastic, so if I need to block out all sound I can still easily do that by playing music, a book, or white noise. I’m very impressed with the sound quality.I also love the design of the headphone. They are not bulky at all and are easily compactable. They even come with a cute carrying pouch so the headphones won’t get dirty in your bag. Also, the battery life is additionally pretty nice. I prefer headphones with longer lasting batteries because i usually forget to charge them, so these have been perfect for me. They last a super long time and don’t take all that long to charge either!If you are still reading this review and have gotten all the way to this point, I say buy the headphones. They are honestly worth it. Also i change my rating to a 4.8, lol. Get them!! you won’t regret it.",
                "reviewVotes": "90 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ZuSu  (£цэ!#)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNQ4LZ7IDK54GIKCMDUKP5TZ35Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCI19AFS45JRD?ASIN=B0B879C5DS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 10, 2023",
                "reviewTitle": "5.0 out of 5 stars The best ANC headphones you’ll find under $40",
                "reviewText": "Since I live in an apartment, I use over ear Bluetooth noise canceling headphones to watch TV or listen to music on a daily basis. I have a Sony 1000-XM2 that I love an MPow M5 and Soundcore Q20. The Sonys are my gold standard for sound quality, but both the MPOW and Soundcore were exceptional as well.The MPow M5 finally started to physically break after 4+ years of years of near daily use, so I purchased these to replace them.I selected these because they were the among the highest rated and most purchased over ear noise canceling blue tooth headphones under $40.I received my headphones in about a couple days. The box contained the headphones, a carrying bag, and cables. The build quality of the headset feels good, but not premium. The construction is mostly mat plastic with metal hinges and of course a metal leaf spring in the headband. ANC is controlled with a sliding switch behind the left ear while on/off, volume, skipping, pausing and pairing are controlled with three plastic push-buttons behind the right ear.When you press the buttons you hear/ feel a mechanical click that I am guessing is designed to be hepatic feedback and less intrusive than audible beeps in the headphones. Primary function of the buttons are volume and on/off. Holding the volume buttons for a couple of seconds will allow you to skip forward or back. The center (on/off) button, also allows you to pause and when held for about five seconds will put the headphones in pairing mode. As the noise canceling is on a separate slider, you’ll need to remember to turn this off when you power down the headset or you might drain the battery. All controls seem to me to be very intuitive and standard.Sound quality is really good for the price. These is some punch in the bass but it isn’t overpowering. Mids and highs are clear. At the highest volumes the sound gets a tad muddy, but why would you crank the volume if you have noise cancelation? The sound quality is very good overall and exceptional at the price, on par with MPOW but maybe not quite as good as Soundcore Q20s. I imagine these are best suited for TV, movies, rock and blues music. Though if you like boomy bass or just super heavy bass, you might find the headphones weak in that regard.Noise canceling operates as a single mode without a bypass/ ambient sound feature which is expected at this price point. Noise canceling is at least reasonably good for this price point. Low frequency noise can’t be heard, but, mid-to-high frequencies are not affected much. The sonic profile does change slightly with noise canceling on. It’s hard for me to tell exactly what happens, but I think the mids drop slightly and I get an even more v-shaped sonic profile. In any case, it is a pleasing effect. Overall, noise canceling is what one can expect at this price point. If you need more mid to high frequency noise reduction, I’d recommend just getting a pair of Sony MX’s.Range is good. I can go anywhere in my apartment or even outside nearby with no loss of sound quality. Again, at this price point, I think this is expectedly good.The headphones have a “C” profile that sits a bit off the side of my head. I have a small to medium sized head, and I find these very comfortable, perhaps the most comfortable pair that I have every tried. The headset feels reasonable light and my ears don’t get hot with extended use.Overall I give this set extremely high marks for sound quality and comfort which are the two most important aspects of such headphones. Build quality, noise cancellation are expectedly good, and I see no major detractions, so I am giving this set five stars",
                "reviewVotes": "226 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hello!",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDSBPF4O6LPYPLKWZNJ5BOGNZ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NB4O2E4X5ISI?ASIN=B0B879C5DS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Cheap, simple, don’t expect much.",
                "reviewText": "I wanted simple headphones that wasn’t gonna be expensive, still sound decent & I can use at the gym. I have a gym at my apartment so that’s what I use and I’ve been going when it’s just me so take my review with that in mind (aka not sure how this holds in noisy environments).For about $40 (I believe) it’s been great. Comes with a pouch, while the headphones is mostly plastic, the earmuffs are super soft! I have small ears & multiple piercings and it does not bother them at all. Sound quality is not going to be top tier. I had AirPod pros before this and the sound difference is night and day- however, over the course of a week I would say I do not mind the sound quality. It’s what you expect from something that’s about $40. Again, I had no high expectations as I wanted something for the gym. There’s a button switch for ANC or not but I kind of found there’s minimal to no difference between the two, sometimes I’m not even sure if I have it on or not. Sound does leak so be aware!I do sweat a lot and I’m not sure if the earmuffs are sweat proof so I make sure to wipe it after use and air dry. They’re pretty much secure but I had to adjust once’s or twice while doing a HIIT workout on the treadmill and would fall when doing core work outs.I have been on FaceTime with these on, walking on the treadmill, and the other person said they could hear the treadmill but I was very very clear. Could definitely hear me with no problems!Honestly for what it’s worth, it’s cheap and does the job for me. They do look cute as well! Rating it 4 stars I do wish the sound quality was a “tad” bit better but for $40 it’s still good!",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rocky Mountain ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 6, 2023",
                "reviewTitle": "Great headphones after almost 2 years of active usage",
                "reviewText": "I just connected these headphones to my computer via bluetooth to listen for some music and instantly remembered that I never left any review on them. After 2 years of active use, i think these Infurture headphones deserve a positive review.What can I say, great great great headphones, I bought this item in July 2021 and soon it will be 2 years since I use them almost all the time. The sound is amazing, rich and clear. Good highs, relatively deep bass, clear mids. It plays all frequencies from 70hz to 15khz, i guess. The only downside to consider - it has very weak(bad) microphone, people almost never hear you adequately. I use these headphones almost 100 percent of the time on bluetooth. Huge battery life, I almost never charge it and the headphones stays charged for weeks. I don't remember them running out of power at all.In general, I highly advise it, in terms of sound they are similar to more expensive models from Sony, Bose, Sennheiser, but cost around 50 bucks. Use them carefully and you won't have any problems with them. Very soft ear cushions, comfortable to wear for a long time. Headphones never broke, ripped or had any problems with bluetooth connection. As for noise cancellation, it's kinda weak here, but I hardly ever use them outdoors or in noisy places. Take it, you won't regret, 100%.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vincent",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 26, 2022",
                "reviewTitle": "Excelente opción, supero mis expectativas.",
                "reviewText": "Por el precio, estos audiófonos superaron por mucho mis expectativas.Obviamente no tiene el mejor aislante de ruido pero la verdad es que sin activar este funciona bien, el audio me sorprendió, soy muy quisquilloso en la calidad del audio y la verdad es muy MUY buena.Son cómodos y los recomiendo para uso de algunas horas no demasiadas, los materiales son buenos y la presentación igual.El rendimiento de batería es impresionante y la carga no toma mucho tiempo lo cual es algo que al menos en mi opinión te servirá mucho si viajas, trabajas o siempre mente disfrutas de escuchar música.Los botones son duros y si estás acostumbrado a que sean sensibles o al touch, podrán verse molestos pero fuera de eso, son excelentes para considerar como una opción.Y por último, son muy fáciles de guardar en espacios pequeños por su capacidad de movilidad además de tener una protección para evitar que el cable se dañe.Audífonos impresionantes y que recomiendo enormemente pues podrían compararse con marcas de precios más elevados y por lo que pagas es una inversión muy buena.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 27, 2024",
                "reviewTitle": "Ottimo rapporto qualità prezzo",
                "reviewText": "Scrivo questa recensione dopo 4 anni che uso ININTERROTTAMENTE queste cuffie (e nel frattempo ho acquistato altri due paia di modelli; uno come regalo - graditissimo - e l'altro come sostituto, ancora intatto nel pacco perché non c'è ancora stato bisogno di usarlo fino ad oggi, ma solo perché il mio PC sta avendo problemi con il bluetooth, le cuffie funzionano ancora perfettamente).Non ho mai avuto un dispositivo di questo tipo così durevole nel tempo. Dopo un anno e mezzo o due (ripeto, di quasi ininterrotto uso di circa 10 ore giornaliere) ho riscontrato qualche difetto con l'ingresso jack - cose snervanti che purtroppo capitano - , ma il bluetooth funziona impeccabilmente ed è comodissimo.La qualità audio è molto buona, ottima per il gaming, per i prodotti cinematografici e, soprattutto, per i melomani come me che ascoltano musica di generi diversi, sempre e comunque; ottime per chi in particolare ama ascoltare musica classica, corale (cori valorizzatissimi), varie sfumature di metal, di rock, pop rock, e tutti i generi che spaziano dal blues al jazz allo swing; l'unico fastidio che eventualmente si può avvertire è con alcuni tipi di generi della musica elettronica (o ibrida - mi è capitato anche ascoltando i Muse), soprattutto alcuni brani contemporanei che hanno ottimi arrangiamenti, ma spingono già di loro su dei bassi piuttosto \"prepotenti\", e si ha una vibrazione leggermente eccessiva (per intenderci, un po' la sensazione di frittura delle orecchie) anche a volume basso. Si tratta di casi sporadici, ad ogni modo, che attribuirei più alla concezione di certi brani in sè ed effetti concepiti per funzionare in un certo modo all'udito, più che al dispositivo di riproduzione. L'annullamento del rumore non è eccellente, ma comunque molto efficace.Sono inoltre estremamente, estremamente comode.Le amo follemente. Se avete un amico melomane o videogiocatore, sono veramente un ottimo regalo; ripeto, soprattutto durevole nel tempo. Che non è assolutamente scontato.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alessio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 7, 2023",
                "reviewTitle": "Una bella scoperta sonora.",
                "reviewText": "Quando recensisco un paio di cuffie faccio sempre due premesse: da audiofilo ed ex-musicista, per semplice passione provo tante cuffie (ATH-M50, Bose AE2, varie JBL, Sennheiser, Soundcore) Seconda premessa: le acquisto di tasca mia, niente prodotti in regalo da recensire (spesso fasullamente). Detto ciò, parto subito col dire la mia necessità. Avevo bisogno di un paio di cuffie over-ear con ANC, economiche ma discrete da utilizzare prettamente fuori casa (principalmente palestra, tragitti medi a piedi, treni e viaggi intercontinentali) per cui volevo un paio di cuffie non costose, allo stesso tempo non troppo cheap ne ingombranti. Dopo varie recensioni in rete, ho deciso di dare fiducia a queste INFURTURE e devo dire di esserne rimasto positivamente sorpreso. Nel loro range di prezzo, e forse pure qualcosa in più, le reputo le migliori per rapporto qualità/prezzo. Esteticamente gradevoli (io le ho prese argento ma le avrei preferite di un semplice bianco), di dimensioni contenute, leggere ma soprattutto comode. Qualità costruttiva nella media, cuscinetti in memory-foam di buona fattura (vedremo nel lungo termine...). Resa sonora buona, pulita, tendente ad enfatizzare un pò troppo i medi. L'ANC non è affatto male (quello delle Soundcore Q30 è di un altro pianeta) anche se ovatta e distorce di un (bel) pò il suono e riduce la durata della batteria. Manca un'app e un equalizzatore, la confezione è molto minimal (troppo?). Non è inclusa una cover rigida ma solo un sacchettino. Pratico si, ma morbido che quindi non protegge le cuffie se le mettete in uno zaino o valigia.Per il resto null'altro di negativo da segnalare. Pagate 39,99€. Non avevo grosse aspettative ma a questo prezzo e con queste prestazioni direi che me le tengo strette.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ched",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 5, 2023",
                "reviewTitle": "Satisfaction totale !",
                "reviewText": "Très bon produitBeau design. Très léger et confortable, doté de la fonction réduction de bruit qui fait le taf.Apairé facilement avec ma télé-et plus exactement avec ma bande son- ainsi que mon téléphone pour la musique.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$55.99",
                "sellerName": "INFURTURE 2-US",
                "sellerRating": "4.5"
            }
        ]
    }
}