{
    "remaining_requests": 48723,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bose-Cancelling-Wireless-Bluetooth-Headphones/dp/B07Q9MJKBV",
    "body": {
        "name": "Bose Headphones 700, Noise Cancelling Bluetooth Over-Ear Wireless Headphones with Built-In Microphone for Clear Calls and Alexa Voice Control, Black",
        "price": "$299.00$193.84",
        "originalPrice": "$379.00",
        "rawPrice": 299.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bose-Cancelling-Wireless-Bluetooth-Headphones/dp/B07Q9MJKBV",
        "soldBy": {
            "sellerID": "A17MC6HOH9AVE6",
            "name": "Adorama",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A17MC6HOH9AVE6&asin=B07Q9MJKBV&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BN534JBB"
        ],
        "asinVariationValues": [
            {
                "asin": "B07Q9MJKBV",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$299.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41e4Mk9NdyL._SS36_.jpg"
            },
            {
                "asin": "B07Q4QK379",
                "variationName": "Color",
                "variationValue": "Silver Luxe",
                "price": "$379.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/31V+wuBNs5L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41e4Mk9NdyL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31tHyW3SplL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41i8-Y8gM2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31KYu2AEPOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21SzZLN71eL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iaORVmSeL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e657604c-3f2b-41fd-9790-68db7364f543/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a9396356-45bc-467e-a5be-9d793bb34ad3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a7ed9e88-d23f-49cd-8cfe-609dfeac0452/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/93a0b59b-9905-499a-900c-7e32e116447e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f4ba2db1-1e81-4dca-9411-3a8ae951ac3a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/62920c4c-3495-4758-8128-963ceb1aaaa5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c31de686-87ed-4a29-8314-d9570d9d02fe/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 7,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/911KdXJ9aML.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1yY0ljgseL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Bose Store",
            "link": "https://www.amazon.com/stores/Bose/page/9E24AFD5-B420-4859-BD2F-A993BA579B20?ref_=ast_bln"
        },
        "brand": "Bose",
        "merchantInfo": "Ships from and sold by Renovar Tech.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 35071,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 14.",
            "FREE delivery February 15 - 21.",
            "Or fastest delivery February 13 - 16."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "POWERFUL NOISE CANCELLING HEADPHONES: 11 levels of active noise cancelling let you enjoy music, podcasts, videos & calls without distractions",
            "ASTONISHING SOUND: Crisp, clear details. Deep, full bass. These wireless headphones produce exciting, lifelike sound that’s full and balanced at every volume level",
            "UNRIVALED VOICE PICKUP: A revolutionary microphone system adapts to noisy and windy environments so your voice always sounds crystal clear on calls",
            "KEEP YOUR HEAD UP AND HANDS FREE: With easy access to voice assistants like Alexa and Google Assistant for music, navigation, weather, and more, and intuitive touch control on the earcups — you can stay connected without reaching for your phone",
            "PREMIUM DESIGN AND COMFORT: With a lightweight stainless steel headband and earcups tilted for the perfect fit, you can comfortably wear these bluetooth headphones for hours",
            "BATTERY LIFE: Get up to 20 hours of wireless battery life on a single charge",
            "ONE TOUCH TO LISTEN TO SPOTIFY: Instantly listen to your last Spotify session or discover new music by tapping and holding the right earcup. Currently only available when using iOS devices with your headphones",
            "ALEXA CALLING: Use these wireless noise cancelling headphones to place a call to a Bose smart device or the Amazon Echo device with the Alexa mobile app",
            "BOSE SIMPLESYNC TECHNOLOGY: SimpleSync pairs your Bose Noise Cancelling Headphones 700 with select Bose smart soundbars for a personal TV listening experience. Independent volume controls allow you to lower or mute your soundbar while keeping your headphones as loud as you like.Away from your phone? Press and hold the Bluetooth button on each device to sync their sound. Already got a group going? Link by pressing the Action button to connect at a moment’s notice. Bluetooth range: Up to 33 ft (10 m)"
        ],
        "description": "Bose Noise Cancelling Headphones 700 have redefined what wireless headphones can do. Keep your head up to the world with easy access to voice assistants — perfect for music, navigation, weather, and more. Confidently take calls or speak to Alexa anywhere. An unrivaled four-microphone system picks up and isolates your voice while cancelling the noise around you. With these Bluetooth headphones, Bose has even improved on what it’s most known for. 11 levels of noise cancellation let you truly personalize your environment. Set it low to let more of the world In, somewhere in the middle, or turn it all the way up to block out the noisy world around you. Signature active EQ promises an immersive listening experience at any volume. Whether you’re relaxing with quiet music or really cranking it, your music sounds like it should. These touch-sensitive wireless headphones are also designed with a streamlined stainless steel headband, and a lightweight, comfortable fit. The intuitive controls keep everything simple — manage volume, calls, and music just by touching the earcup. One touch is all you need to reach Spotify — instantly open your last session by tapping and holding the right earcup. You can repeat this step to discover brand new content. The Bose Music app gives you even more control. The Bluetooth headphones feature up to 20 hours of wireless battery life. Includes Bose Noise Cancelling Headphones 700, USB charging cable, audio cable, and carrying case. Available in Black or Silver.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "Over-Ear Headphones",
                "link": "https://www.amazon.com/Over-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097479011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2 x 6.5 x 8 inches"
            },
            {
                "name": "Item Weight",
                "value": "8.8 Ounces"
            },
            {
                "name": "ASIN",
                "value": "B07Q9MJKBV"
            },
            {
                "name": "Item model number",
                "value": "794297-0100"
            },
            {
                "name": "Batteries",
                "value": "1 CR2 batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 35,071 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,174 in Electronics (See Top 100 in Electronics) #120 in Over-Ear Headphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "May 29, 2019"
            },
            {
                "name": "Manufacturer",
                "value": "Bose"
            },
            {
                "name": "Charging Time",
                "value": "2.25 Hours"
            },
            {
                "name": "Units",
                "value": "1.0 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Bose"
            },
            {
                "name": "Model Name",
                "value": "Headphones 700"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "Over Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "An adaptive mic system for superior voice pickup. Bose headphones 700 feature an unrivaled microphone system that picks up and isolates your voice while cancelling the noise around you. You’ll hear and be heard like never before. These headphones are also optimized for Amazon Alexa and the Google Assistant.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/dedd8773-be89-4837-9039-89cb3da13280.__CR0,0,800,600_PT0_SX800_V1___.jpg"
                ]
            },
            {
                "media_text": "Quiet for them. Loud for You. Bose SimpleSync pairs your Bose Headphones 700 with your Bose Soundbar 500 or 700. With independent volume controls, one of you can sleep as the other continues watching — guilt free. Learn More.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e6a3f0e-ab6e-4b07-9741-5f960620cc10.__CR0,147,1920,787_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dedd8773-be89-4837-9039-89cb3da13280.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/37778c23-af54-4559-b60b-87d57892c995.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2e1a9a9c-3049-483e-9267-7090d9c35a7f.__CR0,153,1920,787_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0239db18-a69d-4edd-9834-a5af221f042a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9452b078-56d3-4275-9cec-992948683537.__CR0,42,1920,787_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A. Clark Fine ArtA. Clark Fine Art",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGR7CSKHU5EJ7UXLHEE7NABIXTYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZIS9GF8Z8EGP?ASIN=B07Q9MJKBV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2020",
                "reviewTitle": "5.0 out of 5 stars Quiet the world without sacrificing the Music’s quality! Amazing sound, features & Alexa enabled!",
                "reviewText": "The noise cancellation is exceptional on these headphones. With 10 levels I can block out most of what is going on around me, when it is safe to do so. If you are someone that startles easily, like myself, you will probably get scared a lot because you will not hear what or who is walking up behind you. My husband finds this very humorous.The sound quality was every bit of what I expected from Bose. Crisp, rich audio, with an amazing range of clarity, from your treble to mid tones and excellent bass. It’s easy to slip into your own little oasis with these on.They are also quite comfortable, their padded band and ear cups are soft and do not apple much pressure against your head. They are very light weight and I can wear them for hours without issue.The included case is well made, sturdy and not overly bulky allowing my to pack it and take it with me anywhere. It has a storage compartment for your cables so you always know where they are.The battery life is excellent! I can go days without charging, but if I do need to charge, they replenish quite quickly and I am right back in business. I have easily gotten a full 20 hour charge out of these. I like that when you turn them on they immediately tell you how many hours they have left on their current charge and what devices they are connected to. This makes it easy to check how long you can use them on their current charge, before you head out somewhere where you might not have access to a plug. I found the time they tell me I have left on my charge to be quite accurate. I am able to connect to more than one device (like my iPhone and iPad) and they intuitively play the sound from the device I am using at the moment. I love that feature it’s easy to switch from watching something on my iPad to listening to music from my phone. Bose also includes a cable so you can plug directly to your device and go wired. I have not used this feature because the battery life is so long, I have not run into a situation where it was necessary.The buttons and touch features of these headphones are wonderful. I can turn Alexa (Siri or Google) on or off depending on my needs. I can control the volume sliding my finger up or down on the surface of one ear and can tap to pause and swipe to change songs. With one button I can rotate between 3 levels of noise cancellation that I can set within my app. I have not had the chance to utilize some of the AR on these yet but cannot wait to try it on our next vacation, it will be like bringing along our own tour guide.I love that Alexa is built in. I’m an artist and when I’m painting in my studio it is very nice to be able to use Alexa to change my music without needing to touch my device or my headphones.I saved and waited to get these after trying them and comparing to the Sony competitive model and I am so glad I did. I found the bass of the Sony WH1000 series to be a little scratchy sounding and the overall sound just wasn’t as crisp as the Bose 700 series. I had a pair of Cowin E-7s and those, while they were great at their price point and did the job while I was saving up for these, they just weren’t even in the same class as the Bose 700. These, in my opinion (and I spent a lot of time putting headphones on and off, listening to how everything sounded on each), set the bar and everything else is just trying to measure up. Only the Sony WH1000 series could come close, but for me their sound quality still fell short. The only way to describe it was, you knew you were listening to a recording, whereas the sound from the Bose 700, you could close your eyes and it sounded like you were listening to it actually being played by the artist live the sound is just that crisp and clear no echo or scratch it’s clear vibrant and rich, everything I expected from Bose.I am very happy with my purchase, they were worth the wait and I would certainly recommend them to everyone!One Note I have very sensitive sinuses and when I put on noise canceling headphones, I can actually feel a pressure in my ears and sinus cavities, this does happen with the Bose as well (it happens with every brand I have tried if the cancellation is of any really quality). That said it does not deter me, nor do I feel it’s would be a reason I wouldn’t recommend them or give them a lower star rating. I can feel it when I activate the noise cancellation at its max level but everyone else I have asked to try them, can’t. So chances are very likely this will not be something that the average person even realizes. I can still use the noise cancellation and can block out enough that I never hear my husband walk into my studio until he taps me on the shoulder and scared the heck out of me. I only include this info in case there are others out there that also experience this, with the Bose 700 you can control the levels and it’s easy to step your way up through 10 levels of cancellation and find one that blocks the noise out, while still being comfortable to your sinuses. That is why I would recommend to everyone! Other headphones are cancellation on or off and if you are sensitive to it that can render the feature useless. Again not the case with the Bose 700 series. I use this feature all the time, have found the level that is perfect for me and the noise cancellation is amazing. It is so nice to finally be able to use this feature.I will also add that unlike other headphones the noise cancellation does not affect the quality of the sound I am listening to either! I have tried many where the sound completely changes the moment you turn it on, not with these. The sound remains crisp and rich and clear as it did without the noise cancellation. The only difference is the world around you gets quieter and the music sounds amazing! If you read this whole review Thank You if you are considering these headphones and trying to compare, in my opinion there is no comparison and I don’t think you will be disappointed choosing the Bose 700 series. I hope this info helped.",
                "reviewVotes": "343 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/714fLMUE04L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71MRvMMs4WL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71YxGPDNq-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71ambU7MEcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71jCmCBMiUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81jv8SakIbL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81wIF+UR9DL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7OOPOQWCUNV3U7KFWABXT3YSTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KCO78K6DA1GK?ASIN=B07Q9MJKBV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 16, 2020",
                "reviewTitle": "5.0 out of 5 stars Top notch noise cancellation headphone",
                "reviewText": "I’ve had the Bose 700s for 5 months and have been impressed with their all around performance. Now that the headphones have an update to add an equalizer they are tough to beat!Pros:Outstanding noise cancellationAdjustable noise cancellationNew equalizer featureExcellent audio performanceExcellent call performanceExcellent comfortAbility to connect to 2 devices at onceDecent battery lifeSleek modern looksCons:Bose Music app can be flakyOccasional break up of noise cancellation with extreme sounds.Not rated for water resistance at allToo expensive at regular priceBattery lasts for me about 8 days before I get to 20% battery remaining and I have a long commute. From a practical standpoint 20 hours is plenty. The battery indicator is pretty accurate at providing the remaining hours left although somehow it never gets past 19 hours at full charge. They fully charge in 2 1/2 to 3 hours which is as advertised.Great noise cancellation. Overall works the noise cancellation works well on a commuter train. Also good at blocking background noise in open space office. I've used it when doing yard work and it does a great job of saving your ears from power tools. It can’t block out everything but no headphones can. There is occasional leakage of voices from the side and back when someone is talking right next to you. It is best at blocking sounds from the front. I have noticed an occasional break up of the noise cancellation with some sounds such as loud jet engine during take off or with certain lawn tools but that is pretty rare. The adjustable noise cancellation is awesome since there are times I want to hear my surroundings like when I’m walking on city streets or need to make sure I am not making a lot of noise with headphones on when I’m at home.Another strong point is the call quality. People can hear me clearly during calls and you can adjust how loud your own voice sounds on the calls as well which is a nice touch. The 700s do a great job too of blocking out ambient sounds during calls when you are speaking.The Bluetooth connection is excellent especially with Apple products. Another plus is ability to connect to 2 devices at same time. Great for use of laptop and phone. Pairs easily with my Windows 10 HP laptop. Automatically switches audio to the active device. Also nice job of switching when you get a call on your phone.It remembers every device its connected to and automatically connects without pairing which is awesome. It did have hiccoughs sometimes not picking up your voice on video conference calls with Zoom and Webex but these have been resolved with the latest firmware update.Comfort is excellent. I was a little worried with them since I wear glasses but did not find that to be a problem. They do not get hot or uncomfortable when you wear them for several hours at a time.The ear cup touch controls work great. I can attest that they work fine in cold weather in below freezing temperatures in Chicago. They only get sensitive if they get wet. Sadly they aren’t even water resistant so take care wearing them in the rain.The Bose Music app works most of the time but has its glitchy moments. Occasionally it won't find my headphones even though they are paired and connected to my phone (the headphones still work fine even when to app doesn’t connect). Also sometimes the Music App doesn't successfully update the headphone software.I did an informal comparison between the Bose and the Sony WH-1000XM3 Noise cancellation was pretty comparable. I found the Sony’s too boomy in bass for me at standard settings. I prefer a more balanced sound the Bose provides. The 700s look way better than the Sony’s (and the QC 35s).This is not an audiophile quality headphone but for wireless noise cancellation the sound is excellent all things considered. Now that the latest firmware adds an equalizer you can FINALLY adjust the sound! The equalizer has bass mid and treble adjustments you access using the Bose music app and do make a difference in the sound quality. The 700s can create some thumping bass at max bass boost and likewise the treble and mid boost is substantial.So a few niggles but excellent in every other area. Highly recommended, especially when they are on sale!",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 1, 2022",
                "reviewTitle": "Fantastic sound & noise cancellation, not to be used as a gaming headset",
                "reviewText": "I've been using these every day for just about a month, and they're easily the best headphones I've ever owned. With the noise cancellation set to the maximum level, I can just barely hear a dehumidifier running right next to me, or the sound of a bus running while riding it, or just about any sort of constant background sound.They are awkward with sharper sounds, which they're not meant to filter out anyway; if someone is typing at a mechanical keyboard a couple feet away from you, it'll get through very easily.The actual sound on the headphones is of better quality than I'm used to. I've listened to all sorts of music on them to test it out, and found that there were quiet elements of songs I've been listening to for years that I only just picked up now. (Disclaimer: I have an auditory processing disorder, so the average listener may not notice this difference.)The battery lasts SO LONG. I habitually charge them each night anyway, but I listened for almost 9 hours in one day recently and it was still at 50% charge.I also use these for Discord group calls 2-3 times a week for 3-4 hours, and they hold up well during that. The mic definitely makes my voice sound more canned than the previous cheap \"gaming headset\" I used before, but not so much that it's unbearable for anyone. It has a definite advantage in a more precise pickup range, as it never picks up a person talking to me in the same room like my old headset did.There are only two small issues I've run into with the Bose 700 headphones:- Bluetooth connection can be fiddly to get going sometimes. It requires the Bose app on your phone, even if you're just connecting to a computer. This leads to the second issue.- If you're using the mic (at least in Discord), you cannot also listen to any playback apart from the voice call you're in. YouTube, any music software, even system sounds - none get through while your mic is active in a call. This isn't a deal breaker for me, but I do find it really irritating in a headset that I spent this much on. If you're playing a game and also in a voice call without an external mic, you won't be able to hear the game. This is apparently a normal issue with Bluetooth, but I wasn't aware of it until it happened.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Xarregens",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on February 6, 2024",
                "reviewTitle": "I like these",
                "reviewText": "Confortable, nice battery and good quality sound",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rahul Safai",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 23, 2023",
                "reviewTitle": "Good sound",
                "reviewText": "Does its job as described. However switches to phone from pc if phone rings , that makes me surprised",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dirk 196450",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on December 13, 2023",
                "reviewTitle": "Great sound quality and noice cancelling",
                "reviewText": "I used to have the predesessor for many years. I wear it mainly when I am travelling. This new headphone has better noice cancelling and great sound. Also the buttonless controls work great (once you are used to it ;-)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philip Ekeberg",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on October 20, 2023",
                "reviewTitle": "Amazing Headphones",
                "reviewText": "I've been using QC35 for many years and wanted a fresh set of headphones. Since I was so happy with my QC35 the choice of brand was easy. Bose NC 700 is the most amazing headphones I've ever tried, good looking and comfortable for many hours. The sound quality is just incredible, working smoothly with the mobile app. As aspected, Bose delivers.. Adding that extra joy in life.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}