{
    "remaining_requests": 48802,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Otium-Headphones-Bluetooth-Waterproof-Cancelling/dp/B0734S1YBS",
    "body": {
        "name": "Otium Bluetooth Earbuds Wireless Headphones Bluetooth Headphones, Sports Earbuds, IPX7 Waterproof Stereo Earphones for Gym Running 15 Hours Playtime Sound Isolation Headsets,Black",
        "price": "$15.99",
        "originalPrice": "$19.99",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Otium-Headphones-Bluetooth-Waterproof-Cancelling/dp/B0734S1YBS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTXWC4MX"
        ],
        "asinVariationValues": [
            {
                "asin": "B0734S1YBS",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41WlXRp6szL._SS36_.jpg"
            },
            {
                "asin": "B07F336T8K",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$26.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41MujszWbDL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41WlXRp6szL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41VrpzkuSWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QCeaGxZbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Lc0 lbDrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Zj2-UwCfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oWEYAwPGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41TFsZHKI L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Otium",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=Otium"
        },
        "brand": "Otium",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 15471,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 13 hrs 25 mins",
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 13 hrs 25 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "True HD High Fidelity Sound: Update Bluetooth Headphones own latest Bluetooth 5.3 technology and IMPROVE acoustic components that produce incredible sound quality with deep bass and crystal clear treble.Also we have upgraded the bluetooth name from \"Otium\" to \"U18\", it will more conveniently to search and connect with the headphones.",
            "IPX7 Waterproof Rating: With ergonomic design and silicone ear hooks, wireless headphones secure stay on your ears, feel great to wear and will never fall out. Upgraded Waterproof Rating, 100% prevents ordinary splashing water and rain.",
            "Longest Battery Life: The new improved lithium polymer battery allows seamless enjoyment of music for up to 16 hours and 240 hours stand-by with a charge of only 1.5 hours. Neckband design prevents troublesome wires from tangling during your workout.",
            "Sound Isolation Technology: Connect seamlessly with all Bluetooth enabled devices up to 30 feet （10m） away. With Noise Suppression Technology reduce background noise. So you can focus on your favorite music, no matter where you are.",
            "Foolproof Operation: Allows Skip/Play/Pause on your music tracks as well as all phone use without reaching your phone."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "Earbud Headphones",
                "link": "https://www.amazon.com/Earbud-In-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097478011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5 x 1.8 x 4 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.22 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B0734S1YBS"
            },
            {
                "name": "Item model number",
                "value": "U18"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 15,471 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#820 in Electronics (See Top 100 in Electronics) #115 in Earbud & In-Ear Headphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "June 22, 2017"
            },
            {
                "name": "Manufacturer",
                "value": "Shenzhen Huan qiu yi tong technology Co,.Ltd"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Charging Time",
                "value": "1.5 Hour"
            },
            {
                "name": "Units",
                "value": "1.0 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Otium"
            },
            {
                "name": "Model Name",
                "value": "U18"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "In Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Perfect Comfy & Secure Fit Headphones hooks are made of high-quality rubber, perfectly fitting the curve of the human ear. IPX7 Waterproof Protection IPX7 waterproof provide water, splashes and sweat resistant, ideal for intense workouts and running. Next page 1 Ergonomic Design 2 IPX7 Waterproof",
                "media_link": []
            },
            {
                "media_text": "Previous page Steady Connection Stay connection without any dropouts. Connect to your phone will effortless and smooth. Simple & Clear Battery Status Display You will find the battery capacity of earbuds on your phone and the low battery voice notification. Crystal-clear Calls Reject noises around you, keeping your voice sounding clear for every call. Next page 1 Bluetooth 5.3 2 Battery Status Display 3 Built-in Microphone",
                "media_link": []
            },
            {
                "media_text": "Why is “Otium” not printed on the product now? The product is the latest upgraded version, in order to improve the customer experience , we did not print the logo “Otium\"; Don't worry, you can see from our product page that the brand is otium. Reset Long press the MFB button for about three seconds while charging. The red and blue LED will flash three times to indicate that factory settings have been restored. How to connect two smart phones at the same time? 1.Pair with device 1; 2.Turn off the Bluetooth of device 1; 3.Pair with device 2; 4.Turn on the Bluetooth of device 1. And it would finally show that both smart phones are successfully connected to headphones.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6188797-55d6-4862-a6af-05e2b6c2d46b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6e585c5-fd9e-4702-98e9-72aa4c3bf3cb.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64cd41be-0820-476f-9926-7ee634dfe95f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb24ea96-0f24-4938-ae59-aa71643f4055.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b86ece56-31a9-4cb1-ad8f-bc171a823639.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c17480b0-a083-49a1-976e-081132d04e23.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3af8209c-6a46-438d-9a9a-8634e8038236.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fdc4b35e-7ef5-4965-9938-92c03a2948d7.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/06e78692-6c2b-4590-9864-98ae8af1bc03.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jason R. WilsonJason R. Wilson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIS4YMGIWJRHAQQ5QF4B5QJLL5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWTXMM9V6ERSN?ASIN=B0734S1YBS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2018",
                "reviewTitle": "5.0 out of 5 stars A great quality headphone for an economical price!!!",
                "reviewText": "I have purchased a similar pair of Bluetooth headphones from another company that was at the time considered an “Amazon Choice” because of their high ratings and economical price point. I have actively used them for the last few months and was asked by Otium to try their product.Shipping was fast (I received the headphones in two days), and the next morning opened up my shipment to try the headphones out.Packaging was simple to get into—no tape or plastic wrap covering the product; only a cardboard sleeve with the box that contained the headphones. Upon opening, everything was neatly packaged, and there was no damage to any of the inner contents.The zipper case containing the headphones displayed the Otium company logo on the outside of it, was black in color and had a carabiner attached to it so you could carry it on a backpack, purse, belt loop, or anything that you could think of to connect it to. Inside the case was the headphones, and two additional sizes of earpieces and a plastic cinch to keep the wire between the right and left side of the headphones from flopping around. Also, in the box was a USB cable to charge the headphones, a warranty card that gives the customer an additional 6-month free warranty for buying the product and an instruction manual explaining the use of the headphones, including troubleshooting, and also what is allowed and not allowed with the waterproof feature of the headphones, which I will get to later in this review.The first thing the instructions suggest is to charge the product entirely, which takes 1-2 hours to charge. When I plugged the USB into my laptop, it only took a little less than an hour to charge the headphones fully. The one thing I noticed immediately about the headphones that the ones I had purchased a few months earlier were that the part that wraps around the ear to keep them in place was stiffer than my previous ones. I liked that because the other headphones had a very flimsy ear wrap.Connecting them to my iPhone X was simple and easy. You hold the power button down for a total of eight seconds to pair to your phone. Then, you go to your Bluetooth settings, and either the name “Otium” will appear (depending on your phone), or you will need to type in a password for it, which is “0000”. After pairing your headphones to your phone, you are ready to go. You also have the option for “multi-pairing” to two devices, which I thought was a cool feature!As far as the buttons, the power button (located on the right side) turns on/off the headphones, pairs the headphones to up to two devices and answers/ends/rejects phone calls/redials the last number called. You can also transfer/pause/play audio with the power button. The volume controls allow you to mute the microphone/turn up and down the volume and move forward/reverse audio tracks that you are listening to.You can talk up to 8 hours, which I will admit I have never tried, and they state that the standby time is close to 220 hours, which is all dependent on usage.The headphones sound great! The voices come in clear, and there is a decent amount of bass, which I tend to like. The earphones stay in my ear, which is another feature I appreciate, considering that the Apple earbuds and other headsets I have tried in the past have not fit well in my ears (I must have a larger left ear canal, because that is the side that all of my earphones would fall out of!). The wire connecting the earphones stays out of my way, and I usually don’t use the cinch, because I am a bigger person in size, and do not like having something constricting in the back of my head. The ear wrap is comfortable around my ears, the only downfall is that they are not adjustable for different ear sizes, but they are flexible to fit around different ear sizes of most people. The earbuds allow a for some noise isolation – another great feature! The volume sounds pretty good at different levels; it becomes just a little distorted at higher volumes. I’ve seen a few negative reviews that have mentioned that they have difficulty pairing to their phone after a period using the Bluetooth headphones, but I have not used them long enough to experience that problem. The box does give information on how to contact them if there are any technical problems, so if anything does happen in the future, I will try to reach out to them and see how they handle customer service issues. Finally, the price point is perfect! With other higher-end headphones on the market, for an economical pair of headphones, these are great!The only negatives are first, the volume buttons. I’m used to holding down on the button on older earbuds due to my age (LOL!), and I keep forgetting that it will skip to the next song or go back to the previous song. However, I’m slowly getting used to repeatedly clicking to turn up/down the volume, so it is something that is a minor complaint that I can quickly get over. Secondly, I was listening to Amazon Prime Music on my iPhone through these headphones and paused the music to hear what my wife was saying at the time. When I went to play the music as instructed in the manual, it would not restart the music. I had to open the app and manually press the play button to continue listening to music. That was frustrating. If I was driving down the road while listening to music, it is inconvenient to go to look down at my phone and keep driving down the road and risk having an accident happen. I did try listening to a podcast and tried pausing and playing using the same process, and it worked, so it is a software issue, which I hope Amazon would fix in the future.Now, I told you that I would mention what you can get away with when it comes to water. The instruction manual states that you can get away with splashes, rain, snow, incidental exposure to water up to 1 meter for up to 30 minutes, and believe it or not, showering! Seriously! Who showers with headphones on?! I am nervous to try that, but it would be interesting to see if it would actually withstand a shower!Situations it cannot withstand when it comes to water is swimming or any type of watersports, which makes perfect sense.I would honestly recommend these headphones for the ease of use, quality and price point! I gave my wife the headphones I previously purchased and have used these full-time! These are great headphones! Buy yours today!",
                "reviewVotes": "61 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61DR5Kz2EtL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71gdsaSUBRL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robyn Starveling",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGP2IWKLYAIYNY7WEH53AKYKBBOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QN40GB3UHIN2?ASIN=B0734S1YBS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars So Comfortable!",
                "reviewText": "This is the second pair of Otium I have purchased: Cheap, solid, no fuss headphones. The IPX7 trading makes it decent for showers but (sadly) not submersion.They are very comfortable in the ears and, if you don't mind \"the dongle\", can be used one ear piece at a time (just remember which has the control).Battery life is great, sounds is ok -- and they stay-put during active tasks. I can even wear them with glasses.They are easy to pair and can connect with both phone and computer at the same time (must be paired separately).I'll keep these in my \"buy again\" list for when I need another pair.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAAWN6W32SDIBYQ4G43OU54OT7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29PJZ8V6QP6IZ?ASIN=B0734S1YBS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2020",
                "reviewTitle": "4.0 out of 5 stars A solid option for entry-level wireless headphones",
                "reviewText": "For no reason in particular, it took me a while to make the switch from wired earbuds to wireless. While I've had a couple of Bluetooth mics over the years, they were all the single-ear models with mini boom mics that only worked for phone calls and made you look like a stock broker or Hollywood agent about to throw a fit at the Starbucks barista. Respect your food service workers, they put up with a lot. In any case, I figured I might as well try headphones that I wouldn't fall asleep on/get snagged on a door handle and mess up my phone's headphone port/strangle me.Not knowing what exactly I should expect with wireless headphones, I figured that for the time being, I should get something relatively cheap so I could get an idea of what I did and didn't want from a headset. Plus, I travel and run outdoors a lot, so the potential for losing something that was normally physically tethered to me and my device was high. I've paid good money for headphones before (I have a couple of very coddled Sennheisers for when I really want to try and feel impressive to strangers), so I was all for paying less than $20 for what was essentially a test drive set that I'd wear to death (see my history with headphones above).PACKAGING:There isn't much to say about the box. It arrived unharmed. Production value was fine enough. The logo and packaging wasn't that far removed from the Beats by Dre sets. As someone who saw a lot of knockoff Beats in bazaars in Afghanistan, it struck me as funny but not a red flag. Those ones weren't half bad either (or so some buddies claimed, during their mid-deployment career transition to retail wholesaler). Good enough branding to catch a well-meaning grandma shopping for her grandkids off guard. You'll end up with these and some Transmorpher DVDs.The carrying case was nice, kind of a faux carbon fiber external and a soft fuzzy interior. Pliable enough to where you couldn't use it as a bludgeon, but firm enough to where you'd notice if you started to sit on it. Just don't sit all the way on it - it isn't really carbon fiber. It fit the headphones, and a 3-inch charging cable that I never really used because only Luddites don't have at least one micro USB cable magically appear in your junk drawer.After the headphones, tiny cable, and case, the only other item was the instructions. They were not written by someone who speaks English as their first language. Probably not second, either. Whatever. Google Translate did the best it could.SET UP:Translation problems aside, the quick start guide was simple enough that you'd get the gist. Actually pairing them to my Galaxy S9 was also simple, although I had to do it three or four times until the two devices actually got to know each other. I'm an introvert, so I didn't hold it against them. Once paired, reconnecting was easier, but still not instant. I'd say the rate of automatically pairing on the first try was about 90%. I'd have to turn on the headset and set my phone to scan at pretty much the same instant, but that was easy enough to learn (I don't set my phone's Bluetooth to \"always-on,\" so perhaps I'd do better if I had). Exact same experience pairing the set to my Alienware home computer and Apple iPad mini (4th gen, I think - it was a gift that was new in 2018). So, it pairs easily across Windows, Android, and iOS hardware as if they were the same.CONNECTIVITY AND EASE OF USE:The button layout is pretty standard if you've ever had headphones with phone control functions. There's a single multipurpose button on the right bud that handles power, playing/pausing, and answering/hanging up calls. Above that is a volume rocker that handles previous/next track with a long press. Each button has a satisfying, tactile click to it that leaves little to the imagination. Response is immediate, you know when you've pressed the right buttons. Sensual and effective. Good times.The range is better than I anticipated for what I paid. I live in a 600 square foot/65 square meter apartment, and I've neglected to realize that I set my phone down on the table by my front door while listening to music in my bedroom down the hall and on the other side of a wall. It's never broken its pairing with my devices. That being said, I've probably never tested the range beyond 50 feet/15 meters. Beyond that, I'd probably permanently lose one or both devices to the ether. I won't risk it. I'm forgetful sometimes.It will, however, skip repeatedly at random. This is my biggest problem with this set, and it loses half a star for it. I'd be listening to music with the phone in my left pant pocket and the sound will cut out or \"skip\" like if you bumped an old CD Walkman. Sometimes, it would last a split second, sometimes it would garble for five or six seconds. Holding my phone directly next to the headset would always improve it, but if I put it back in my pocket, it was 50/50 whether it stayed normalized. After fuzzing out for a minute or so, it would self-right itself and I'd be good for the next few hours until it repeated itself. I could never find a rhyme or reason for why it went when it did, but it seemed to get worse the more I used them for phone calls and not just music. Calls were a mess, and I had to ask a caller to repeat themselves at lease once or twice every conversation. However, as much as I listen to music, phone calls were a very small portion of the headset's workload. Honestly, it was a minor inconvenience, but given that it only has two functions (streaming audio and streaming calls), it's a glaring one.Another small issue is the low battery warning. A voice tells you that the battery is low, and you'd be lucky to make it more than ten minutes before it shuts down. The battery's good for six hours, and since I'm pretty good at topping off my devices, it was rarely an issue.AUDIO QUALITY:As a disclaimer, I'm not an audiophile that can lecture on the specifics of sound quality. I can't debate the merits on one brand over another. I can't afford recording studio-quality. I've tried many headphones over the years, with price points ranging from \"no-name-found-only-at-gas-stations\" to \"well-to-do-but-definitely-not-country-club-member.\" I do know the difference between bass and treble, and not much else. For reference, I have some Sennheisers that proved my all-time personal gold standards for headphones (an HD 558 for home use and a CX 300B MK II for travel, with a MX 365 for daily use).These are not Sennheisers. They're probably not even Jbuds.I'm not saying they're bad. Actually, they're quite good - for the price point. Basses are good (when they're occasionally there), but tend to get drowned out by normal street traffic. Everything else is sharp and vocals are clearly defined but it all feels muted to a degree. If I were to sum it up, it's as if I were listening to a decent headset through a dense pillow. I'm confident the problem isn't my sound settings on my phone. I've never really tried to fiddle with the equalizer, but I've used both my wired Sennheiser earbuds and a JLab J4 wired to much greater effect under standard settings.Audio quality during phone calls is hit-or-miss, and I suspect a lot of that was because of the \"skipping\" issue mentioned above in the Connectivity section. Since conversations aren't constant streams of audio like songs are (mine aren't, at least - no judgment on you fast talkers), it's harder to gauge. Voices sounded tinny a lot of the time, but clear. I've been told I sounded fairly clear when I talked through them. I only ever had trouble hearing callers when I was walking down a busy street.IN CONCLUSION:I still don't know enough about the performance gap between wireless and wired headphones, if there is one at all anymore. It is 2020, after all. That being said, my experience with Otium was far more positive than negative. Despite connectivity issues that led to some occasionally garbled audio during music and calls, the ease of use, good battery life, feather-light weight, and solid construction make this a great choice for someone looking for a simple wireless headset at an entry-level price point.Sadly, I lost my headset after accidentally leaving it in the back of an Uber. Considering I bought it for $17, owned it for about a year, and it would cost me at least $15 in fees to Uber to retrieve it, I chalked it up to a loss. That being said, if I still had it, I could easily imagine owning it for at least a year after that, something that I'd never consider with a wired headphone at the same price. The performance was totally consistent throughout that year. On the plus side, this gives me an excuse to get more in-depth with the range of wireless headsets out there. I'm using my $20 wired Sennheiser MX 365s for now, but I definitely miss the qualities of being tangle-free. Even if I don't return to Otium, they definitely helped me get my foot in the door. I'll definitely give them a lot of credit for that.",
                "reviewVotes": "65 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$19.99",
                "sellerName": "pizago Direct",
                "sellerRating": "5"
            }
        ]
    }
}