{
    "remaining_requests": 48819,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sony-MDREX15LP-Earbud-Headphones-Number/dp/B00Q6P4CMA",
    "body": {
        "name": "Sony MDREX15LP in-Ear Earbud Headphones, Black, Model Number: MDREX15LP/B",
        "price": "$6.99",
        "originalPrice": "$14.99",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sony-MDREX15LP-Earbud-Headphones-Number/dp/B00Q6P4CMA",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00QUG4XL0"
        ],
        "asinVariationValues": [
            {
                "asin": "B00Q6P4CMA",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31hGZhGGsWL._SS36_.jpg"
            },
            {
                "asin": "B00IJXBX74",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/214fahJDubL._SS36_.jpg"
            },
            {
                "asin": "B00IJXCAWQ",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31pkKV3OGKL._SS36_.jpg"
            },
            {
                "asin": "B00IKYI3SO",
                "variationName": "Color",
                "variationValue": "Violet",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31aWoq-HQGL._SS36_.jpg"
            },
            {
                "asin": "B00IJXCNMI",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/11LZVSMe4-L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31hGZhGGsWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31cMvIO7RYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Kq3qQPsnL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91atf5df3hL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71baUkgwx+L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Sony Store",
            "link": "https://www.amazon.com/stores/Sony/page/AEA5D08A-7FC6-45D4-B121-C8A6FA25219F?ref_=ast_bln"
        },
        "brand": "Sony",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 17645,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 15 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ear",
            "Hybrid silicone earbuds for secure, comfortable fit",
            "High quality 9mm dome type driver units",
            "High energy neodymium magnets for powerful sound",
            "Y-type cord with slider to prevent tangling",
            "Two-tone color design",
            "Connectivity technology: Wired"
        ],
        "description": "Great sound, designed for comfort with fashionable colors to compliment your style. The 9mm drivers units deliver powerful bass while hybrid silicone ear buds ensure a secure fit.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "Earbud Headphones",
                "link": "https://www.amazon.com/Earbud-In-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097478011"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "0.8 Ounces"
            },
            {
                "name": "Manufacturer",
                "value": "SONY"
            },
            {
                "name": "ASIN",
                "value": "B00Q6P4CMA"
            },
            {
                "name": "Country of Origin",
                "value": "Vietnam"
            },
            {
                "name": "Item model number",
                "value": "MDREX15LP/B"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 17,645 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#425 in Electronics (See Top 100 in Electronics) #66 in Earbud & In-Ear Headphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "November 27, 2018"
            },
            {
                "name": "Units",
                "value": "1.0 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Cable Length",
                "value": "47.25 Inches"
            },
            {
                "name": "Brand",
                "value": "Sony"
            },
            {
                "name": "Model Name",
                "value": "MDREX15LP/B"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "In Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Sony MDREX15 Fashion Color EX Series Earbuds Great sound, designed for comfort with fashionable colors to compliment your style. The 9mm drivers units deliver powerful bass while hybrid silicone ear buds ensure a secure fit.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/df2156fe-2008-49c3-827a-3b56e5bfa1f4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Powerful, Balanced Sound With 9 mm Neodymium Drivers feel the thump of bass and the clarity of midrange and treble sounds with high-power neodymium magnets. Lightweight Lightweight for ultimate music mobility. Enjoy music for long hours without any discomfort. Comfortable Enjoy comfort and stability with hybrid silicone earbuds. 8 Hz - 22 kHz Frequency Range The wide band frequency range spanning 8Hz to 22kHz helps to hear the detail in every track and stay in tune with all your music.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4da45777-49cb-4b8f-b34d-185e205c5a57.__CR0,38,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/99ddce59-07bb-41ee-9dbc-3c61051358b0.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/5aced294-5448-4a5c-beaf-2737f224cb93.__CR0,38,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c34bf551-1236-4883-8156-59aedcecfd8e.__CR0,38,300,225_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Sony ear bud headphones MDR-EX15AP Add to Cart MDR-EX15LP Add to Cart MDR-XB55AP See Details MDR-E9LP Add to Cart Customer Reviews 4.3 out of 5 stars 16,859 4.4 out of 5 stars 17,645 4.5 out of 5 stars 3,870 4.2 out of 5 stars 14,685 Price $9.99$9.99 $6.99$6.99 — $6.99$6.99 Microphone Yes No Yes No Different sizes of earpiece 3(S, M, L) 3(S, M, L) 4(XS, S, M, L) No Extra Bass No No Yes No Colors Black, Blue, Violet, White Black, Blue, Violet, White Black, Blue, Red Black, Blue, Pink, White Drive unit Size 0.35 inch Close type 0.35 inch Close type 0.47 inch Close type 0.53 inch Open type",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/df2156fe-2008-49c3-827a-3b56e5bfa1f4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4da45777-49cb-4b8f-b34d-185e205c5a57.__CR0,38,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/99ddce59-07bb-41ee-9dbc-3c61051358b0.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5aced294-5448-4a5c-beaf-2737f224cb93.__CR0,38,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c34bf551-1236-4883-8156-59aedcecfd8e.__CR0,38,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0b77c150-ebbb-4ab0-88df-0e865c3611d2.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d2811454-9cc2-47b1-8154-485b40f7dfb4.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dee36d31-166e-4bdd-9876-bbb88327937f.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6b917898-2281-43b9-8042-54768cc6998a.__CR0,0,200,225_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stoney",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQLX6RV5S77JF25T57X4UC3473A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VL3O2JAZ7BSW?ASIN=B00Q6P4CMA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2023",
                "reviewTitle": "5.0 out of 5 stars >>> DOES THE JOB",
                "reviewText": "> MUSIC QUALITY – The sound-quality of music using the Sony MDREX15LP is very good – with typical earbud base. That’s just a matter of physics, earbud drivers are simply to small to produce good base. (\"Base boosted\" earbuds produce louder base (which smothers the high- and mid-tones), but \"loud\" (lacking any detail) is not the same thing as \"good\"). Suggestion, use the earbuds when you are out, but purchase a Sony ZX headphone set for listening to music at home -- and enjoy the base.> VOICE QUALITY – Clean, clear and crisp in the voice-range, without fiddling with an equalizer – largely because the base is poor. So these (or similar) earbuds are clearly the choice for listening to audiobooks, podcasts, talking on your phone, etc. Listening to music, with base-rich music, can be very enjoyable -- but Sony ZX headphones produce far better base than any brand of earbuds, at any price.> Loud vs efficient. Sony MDREX15LP earbuds are very efficient --- the volume is loud at low volume settings -- not TOO loud, there is plenty of room for adjustment, but louder than many other earbuds and louder than most headsets, at the same volume settings. Practically speaking, \"efficient\" means that the earbuds do not drain the battery on your battery-operated device as quickly. \"Efficient\" is a good thing. Also, if you pay attention, you can usually lower the volume, and the sound quality will be just as good -- and your battery will last longer. Always play music at the lowest setting that you can hear well. Or you can crank up the volume and plan on being deaf by the time you are 50 --- 40 if you use garbage \"base-boosted\" earbuds.> EXERCISE, ETC – Stays in place better than most earbuds. But, if you engage in strenuous exercise, consider Panasonic ErgoFit, which fit deeper in your ear. The down side of the Panasonic ErgoFit is that they fit so securely that it is difficult to get them out of your ear quickly, to answer a phone, etc.> SYMMETRY – The Sony MDREX15L are close to being bilaterally symmetrical – It doesn’t really matter if you put the put the left earbud in your right ear, etc. However, the Panasonic ErgoFit are not, they fit deeper into the ear, and are shaped differently to match your right and left ear canals. It can take a while to get used to inserting the right Ergofit earbud into your right ear, and the left into the left.> ISOLATION – All truly in-the-ear earbuds, with cup-shaped rubber cushions, are good at reducing outside noise, better than headphones – often good enough for air travel (depending on the aircraft and the location of your seat). Many earbud brands claim to feature “noise cancellation” but do not actually have any noise cancellation circuitry. Passive isolation (such as provided by the Sony MDREX15LP earbuds), is NOT noise cancellation. Feedback reduction (on wi-fi earbuds with microphones) is often called noise cancellation, but isn't. Beware that while true noise cancellation works moderately well for aircraft engines (and similar sounds), it doesn’t work at all for screaming children or random noise. If your earbuds feel loose in your ear, you may need to install large cushions on the earbuds, to get them to seal in your ear canal good enough to provide good isolation.> COMFORT – The secret to comfort when using earbuds is to use the smallest cushions which work for you. Three sets, small, medium, and large are included with the Sony MDREX15LP earbuds. You might be most comfortable with smaller cushions. It a can also take a while to build up tolerance. So, if earbuds hurt your ears, build up slowly wearing them a little longer each day. It can take weeks to get to the point that you can wear them all day long without pain. Changing, or replacing, earbud cushions is easy -- just pull the cushion off, and push the new one (or cleaned one) back on.> PLUG – The plug is angled, at 90 degrees, unfortunately. If you pull on the cord, you won't easily pull the plug out the socket, but you will put on strain on the cord (where the cord attaches to the plug), and potential damage it. In my experience, this is how most headphones fail.> PACKAGING – The Sony MDREX15LP earbuds that I purchased came in wonderful frustration–free packaging — in a small plastic bag in a small easy-to-open cardboard box. But, I can’t promise that you won’t get a horrible retail anti-theft pack. Amzn used to promote and feature frustration-free packaging -- but, sadly, doesn't anymore.> SLEEPING – The Sony MDREX15L don’t stick out as far as some other brands, and so, may be more comfortable when resting with your head to the side (or inside a helmet). Panasonic ErgoFit fit deeper in the ear, and are a little more comfortable in such situations. APTEK offers a nice earbud set for sleeping that is even smaller–but the cushion is built-in, so you can’t choose the cushion size. However, even with the APTEKs, I cannot comfortably sleep with an earbud in the ear that is on the pillow. My solution – I just use one earbud in the ear that is NOT on the pillow. In fact, I recycle earbud sets where one earbud has failed, by cutting the failed earbud off, and using the working earbud, shifting the earbud from ear to ear if I change sides.> TIP – CLEANING EARBUDS – The build up of earwax is a serious problem. It can actually muffle and distort or block the sound, and when it gets that bad, effective cleaning is difficult or impossible. The best and simplest strategy is to take a look at your earbuds every few days, and vigorously scratch/flick the open hole of the cushion several times. That breaks loose the wax into flakes, which you can then just blow away. Wiping (such as with a Q-tip) doesn’t work so well (unless you take the cushions off, clean them, and reinstall them), because wiping with a Q-tip may just grind wax into the little screen in front of the speakers, which is then impossible to clean. Caveat, Sony MDREX15L earbud cup-cushions are a slightly different shape from other brands, with a smaller hole, and seems to collect less earwax -- even so, regularly checking and clearing earwax is a good thing to do.",
                "reviewVotes": "97 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFVDJHB5O2NQYLXII25I2KBWD2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HCVAMQRXZ36J?ASIN=B00Q6P4CMA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Not top quality, but absolutely worth the price!",
                "reviewText": "I use them every morning for my work zoom meeting. They have held up well. Mic is good. They don't hurt the ears. They don't cancel out all of the office noise.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Thistlethwaite",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJQUCZMF4NADLHXZN77MJSST7RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C1CV9WPX0F1M?ASIN=B00Q6P4CMA",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Sony earbuds for a great price.",
                "reviewText": "This review is for the Sony MDREX15LP earbuds. They are lightweight, inexpensive, and have a good, neutral, sound. I wish the cable was longer and sturdier, but it's hard to beat the price.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dd3",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOMIDSAI73BJOH6HSYJNZFSA57A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EH6L5D562V0N?ASIN=B00Q6P4CMA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Fine for my purpose",
                "reviewText": "These are just fine for use with my laptop. They don't cancel out ambient noise but I don't need them to. They fit well in my ear and are comfortable for extended wear. They came with different size cups (?) to swap out for a better fit if you need it.I'm not exacting about sound quality. I want to watch YouTube videos and not disturb anyone else in the room. I don't want them to hurt my ears. That's my critera and as such they're doing a great job.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "thepinkowl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGC5VY6HTDAOZNEGLCY2SKPN5N4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P0CQCNCJ7VD1?ASIN=B00Q6P4CMA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Earbuds!",
                "reviewText": "I needed a pair of low-stakes earbuds to keep in my purse in case I want to listen to something on the go. These work great and ACTUALLY STAY IN MY EARS! Getting earbuds to stay in my ears is a real challenge, so I was happy to find these at an affordable price. Overall I recommend these for any small-eared customers out there!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETD3VWJITEUKCEK7QMY34NKUR5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QIUQWQZIBY47?ASIN=B00Q6P4CMA",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "3.0 out of 5 stars You get what you pay for. $7 for about a month and a half of use.",
                "reviewText": "Bought these headphones for gym use and to listen with my Roku remote. They worked fine and were pretty good at noise canceling for earbuds.Ordered in mid-October and by December 7th, the right earbud was dying. I thought I was losing my hearing in that ear, but thankfully it was just the cheap headphones.$7 is a deal, but you may want to buy 2-3 pairs or even setup an Amazon subscription for them because they are a poorly made stopgap more than anything else.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ALP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHBOZK3H3AAZIVSBDT6TUVNUXDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WTH9L9PLIL3G?ASIN=B00Q6P4CMA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Great price for a good quality earbuds",
                "reviewText": "I'm very particular with sound quality. I tested these with 8D, 24D, an 32D songs and I'm impressed. This model offers great and clear sound. It's not the best quality earbuds but it's great enough for the price. I can compare the sound quality to the samsung or apple earbuds but these are better in terms of comfort in your ears.Just make sure to use the right size of earpads for your ears. These need to be snug fit and shoudn't have air gaps when you wear them.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jae Kim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD4GLRCSZJ7VYIKILOOFBTDUE5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JFIVMAIDGZKF?ASIN=B00Q6P4CMA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Bang for a buck. Its value is beyond amazing!",
                "reviewText": "Never in my life I would have said Sony products with great value for its price. This one is the ultimate value one. Just amazing. IT does not have noise cancel or all those features, but it just gets your job done greatly, with dependable quality. If you found this when your old one broke, good for you. This one will get your job done.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Y. L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 5, 2024",
                "reviewTitle": "The best budget headphones.",
                "reviewText": "I have used Sony's headphones for many years and these are probably the cheapest ones that you could buy without hearing any quality issues in terms of sound. They fit comfortably and provide decent sound cancellation. My previous ones lasted for over 2 years before the left side of the headphone broke due to wear and tear. Still I highly recommend these!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anillo plata .925",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 28, 2024",
                "reviewTitle": "Excelente relación precio-calidad",
                "reviewText": "Me encanta que se percibe muy bien el sonido, son de calidad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vijayvijay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 20, 2023",
                "reviewTitle": "Best in sony",
                "reviewText": "Quality earphones at low price from Sony and sound quality is so good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61xW3NlsDlL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 17, 2023",
                "reviewTitle": "Muito caro",
                "reviewText": "Adoro esse fone. Já é o terceiro que compro. Mas acho que o preço aumentou muito. E tb achei que este último o fio enrola demais.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 5, 2022",
                "reviewTitle": "Fits my ears perfectly.",
                "reviewText": "These fit my ears better than any of the many different headphones I have tried and they last longer than any other too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.99",
                "sellerName": "Focus Camera LLC",
                "sellerRating": "4.5"
            }
        ]
    }
}