{
    "remaining_requests": 48669,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Qaekie-Hybrid-Noise-Cancelling-Headphones/dp/B0CLCLDDKG",
    "body": {
        "name": "Qaekie Hybrid Active Noise Cancelling Headphones - 100H Playtime Wireless Over Ear Bluetooth Headphones Deep Bass, 40DB Noise Canceling Headphones with Mic,Comfort Fit for Adults Travel/Home/Office",
        "price": "$59.98",
        "originalPrice": "$79.98",
        "rawPrice": 59.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Qaekie-Hybrid-Noise-Cancelling-Headphones/dp/B0CLCLDDKG",
        "soldBy": {
            "sellerID": "A3UQE37IRT9XJV",
            "name": "Junesh",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3UQE37IRT9XJV&asin=B0CLCLDDKG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTK5DYR8"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 50% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41zJqJTOEQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41qoYkb-cHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sI5LAbkjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZpyttjWAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qITP9EKSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41utRI--tfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91IufH6ooWL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe6566a6-bd5f-4866-a6d1-1494394c98e1/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Qaekie Store",
            "link": "https://www.amazon.com/stores/Qaekie/page/00BF0162-58EC-4F0E-A88C-20C4713DD110?ref_=ast_bln"
        },
        "brand": "Qaekie",
        "merchantInfo": "LBE-US",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 124,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tomorrow, February 12. Order within 6 hrs 7 mins",
            "FREE pickup Friday, February 16",
            "Or fastest pickup Tomorrow, February 12. Order within 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🎧【Advanced Hybrid ANC algorithm Technology - Noise Canceling Headphones】Qaekie Q30 Active Noise Cancelling Headphones support ANC Technology makes the noise cancellation depth up to -40db. Professionally block 95% of surrounding noise from airplane, subways, cars and other background noise.Featuring a hybrid ANC algorithm and 3 ENC microphones,Qaekie Q30 deliver exceptional noise control across a wide frequency range.Experience the power of advanced ANC that blocks out unwanted noise,allowing you to focus on your music or calls without distractions even in noisy streets.(Note: ANC are both available when in Wired and Wireless Mode)",
            "🎧【All-day Comfort & Adjustable Design- Noise Cancelling Headphones Bluetooth】Designed for extended wear, our ANC wireless headphones feature plush ear cushions and an adjustable headband for a customized and comfortable fit throughout the day. Designed with ergonomic ear cups and adjustable headbands, a comfortable fit for extended listening sessions, allowing you to indulge in music without any discomfort.Over-Ear headphones have ultra-soft protein leather ear paps with memory foam padding and super-soft,pressure-relieving ear pads to rest gently and firmly fit your ears.(Note: Turn off the ANC function to avoid electricity consumption if you not use wireless headphones)",
            "🎧【Hi-Res Audio & Superior Sound Quality - Active Noise Cancelling Headphones】Enjoy crystal clear audio with enhanced clarity and depth, delivering an immersive sound experience that brings the music to life. With Qaekie bluetooth headphones, enjoy high-fidelity sound that allows you to discern every detail of your favorite music, from deep bass to crisp highs. The highly-flexible silk diaphragms reproduce thumping bass and crisp treble that extends up to 40kHz for improved clarity.",
            "🎧【Crystal Clear Calls & Built-in ENC 5 mics - Hybrid Active Noise Cancelling Headphones】Built-in 4pcs CVC 8.0 microphones with advanced noise signal processing technology and 1 digital mic used for talking. Qaekie Q30 hybrid active noise cancelling headphones deliver a clearer voice quality for all your phone conversation as well as block out the noise while phone talking.",
            "🎧【100 Hours Playtime - Noise Cancelling Wireless Headphones】Built-in 1000mAh battery, With up to 100 hours of listening time of our bluetooth headphones in ANC OFF mode, 5 times as much as other noise cancelling headphones. A single charge offer you enough juice to listening to over 1000 songs or soundtrack multiple long haul flights. As well, included with a 3.5mm audio cable, you can effortlessly transition to a wired mode when the battery has run out, guaranteeing uninterrupted listening.",
            "🎧【Seamless Connectivity Bluetooth 5.4 - Headphones Noise Cancelling】Connect effortlessly to your devices using Bluetooth 5.4 technology, ensuring a wireless and hassle-free listening experience. Bluetooth 5.4 ensures stable transmission speed, lower latency and better audio output. Active noise cancelling headphones will automatically connect to your bluetooth-enabled device immediately after the first connection.",
            "🎧【Both Wired and Wireless Connection - Over Ear Headphones】Qaekie Q30 over ear headphones noise canceling support both wireless and wired connection. Compared with other hybrid active noise cancelling headphones, Qaekie Q30 headphones support ANC in wired mode, which is the most desired features during long-haul fights. Also, when with wired connection, custom oversized 40mm dynamic drivers produce Hi-Res Sound for extraordinary clarity and detail.",
            "🎧【Transparency Mode - Wireless Noise Cancelling Headphones】Qaekie Q30 Bluetooth noise cancelling headphones support to amplify the sound of the environment for safety and interacting with the surroundings around you.",
            "🎧【Multi-point Connection & Wildly Compatibility- Noise Cancelling Bluetooth Headphones】Support to connect with two bluetooth device such as cellphones, tablets, mobile phone, notebook and TV so that you will never miss any calls while using the another phone to enjoy the music.",
            "🎧【18 Month Warranty - Wireless Headphones】Qaekie offer 90 day money-back guarantee for any reason and 18 month for quality-related issues with replacement and whole life warranty. At the same time, our customer service will handle your warranty within 48 hours."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "Over-Ear Headphones",
                "link": "https://www.amazon.com/Over-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097479011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "6.38 x 5.39 x 3.54 inches"
            },
            {
                "name": "Item Weight",
                "value": "13.7 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CLCLDDKG"
            },
            {
                "name": "Item model number",
                "value": "Noise Cancelling Headphones - Q30"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 124 ratings 4.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,348 in Electronics (See Top 100 in Electronics) #77 in Over-Ear Headphones"
            },
            {
                "name": "Date First Available",
                "value": "October 19, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "Qaekie"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Qaekie"
            },
            {
                "name": "Model Name",
                "value": "Noise Cancelling Headphones - Q30"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "Over Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless, Bluetooth, RF, Wired, ANC"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Hear Nothing but Music ANC noise-detecting microphones pick up and filter out up to 95% of low-frequency sound. Hybrid Active Noise Cancelling Deliver an outstanding personal listening experience by reducing up to 95% of low-frequency noises. Pleasant Travel Up to 95% of engine noise is cancelled out, so you can sit back and relax during flights. Outdoor Mode The sound of outside and traffic are blocked out, so you can focus on what you're listening to. Next page 1 High Quality Sound 2 Hybrid ANC Technology 3 Transport Mode 4 Outdoor Mode",
                "media_link": []
            },
            {
                "media_text": "Previous page Indoor Mode Indoor mode adjusts the noise cancelling to suit quieter locations while still blocking out noise. Hear natural and clear ambient sounds Enables you to simultaneously enjoy music while being aware of your surroundings or talking. Never Miss a Beat The new 40mm drivers achieve a pure and clear sound ideal for reproducing a range of frequencies. Immersive Sound Precise Guitars, Clear Vocals, and clean bass. Discover the best sound quality from your music. Next page 1 Indoor Mode 2 Transparency Mode 3 40MM Dynamic Driver 4 Deep Bass",
                "media_link": []
            },
            {
                "media_text": "Previous page Clear Hands-free Calling Built-in ANC and ENC microphones to make calls more clear and block the noise. 1000 mAh Rechargeable Lithium-ion Battery Exclusive Over-voltage protection technology ensures safety during headphones charging and playing. All-Day Comfort Feature ultra-soft protein leather earcups with memory foam padding that fit snugly over your ears. Ultra Light Ultra light design bring you no pressure over the head when long time listening. Next page 1 Crystal Clear Calls 2 100 Hours Play Time 3 Soft Material 4 Super Lightweight",
                "media_link": []
            },
            {
                "media_text": "Previous page Pressure-Free Comfort Air Pressure Balance to reduce sound wave pressure of active noise reduction. Bluetooth 5.4 Bluetooth 5.4 ensures a fast and stable connection, providing lower latency and better audio output. Wired Connection with ANC When Qaekie Noise Canceling Headphones have no power, you can use 3.5 mm Audio cable to enjoy music. Multi-Point Connection Connect to two Bluetooth device at the same time to switch between calls, video conterencing, music. Widely Compatible Cell Fhones, Tablets, Laptops Suitable for all device with Bluetooth or 3.5mm audio interface. Next page 1 Superior Comfort 2 Bluetooth 5.4 3 Wired Connection 4 Multi-Point Connection 5 Widely Compatible",
                "media_link": []
            },
            {
                "media_text": "Does ANC work when wired mode? YES Yes, The ANC of Qaekie Q30 Noise Cancelling Headphones will turn on in wired mode and ANC will be available both in Wired and Bluetooth Mode. Does ANC work when wireless headphones power OFF? YES Yes, The ANC of Qaekie Q30 Noise Canceling Headphones will be workable when bluetooth headphones power off. It is wired and wireless noise cancelling headphones. Does this headphones have transparency mode? Yes, Qaekie Q30 Noise Cancelling Headphones have three mode: noise canceling mode, transprency mode, normal mode. How to turn on ANC when in wired mode? Press ANC button for 1.5 seconds to activate the ANC and then switch three mode via press ANC button one time. How to connect two bluetooth devices? After connected with first bluetooth device, turn off the bluetooth function of first device, and connect the second device, after connected with second one, turn on the first bluetooth device, then manually click to connect first device.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/512d4fef-5965-450d-a8fb-7a8194de2e46.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a43acc90-e88a-4df4-adfa-b5d8aa3826c1.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5742740a-7dad-4e4f-9548-647469c6daa6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07b532ed-21bc-4647-a9a9-39c2e397e36a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a470b48f-9a74-4b3a-b29a-4fe468f01d02.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/42cabf38-387c-4dcf-ab2f-42ec68fd088a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/50797ac1-ba09-4cb0-8534-a327b434e73c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a5f74895-745c-4c25-bf6d-54e89d564b66.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f070151-8e8b-4123-bfbc-68cff4e016d9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/76ab69ec-91fb-4233-9932-ca6295938243.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4449ff15-33a9-425e-b689-5b10ad0f1e28.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/70541fb1-e9ae-4230-94d9-0559dd334eec.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d75fdc6-7be7-488c-8adb-1c3539f32600.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b5ff2769-c59a-4c85-a6a6-e66b1780ea17.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/92cea004-7b13-427f-bfea-0f9e475fa6c2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/efae0939-63ee-4323-8228-39dad68cdf8e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fed39f10-25fe-4d7b-8d7a-47e880244b1c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Scouter DougScouter Doug",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY5TRCJ3ZNH56POZAZKHXRVTGYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROX136X9R0QOR?ASIN=B0CLCLDDKG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Qaekie Q20 Headphones is a WIN!",
                "reviewText": "This review is for the newly released Qaekie Q20 ANC style noise cancelling over-ear headphones.I already have and like a pair of their Q10 Bone conducting headphones - so they sent me a pair of these to try for free (they actuallly reimbursed me in less than an hour and were great with email correspondence). But this is a real, objectivem initial review. I'll give updates if anything changes good or bad.This is my 1st pair of ANC noise cancelling headphones, but I have tried a nice $200 set my son has as these are very comparable, which is impressive at the start. The sound quality, both at low volume and high, is well balanced, distortion free, and not overly heavy on bass, but has solid bass. That alone makes these well worth the $35 I paid. Also, the description is identical to pair they list at about $100 more. I find the real test for headphones is how they sound at LOW volume - and they are great. Also, you can use lower volume because the noise cancelling really works!The headphones look cool with machined looking side panels - I do a lot of lawn mowing and hope to use these for hearing protection and to listen to music, books and podcasts while working. I am comparing them to my 3M Worktunes headphones that I previously used while mowing. These are nealy half the weight and bulk and MUCH more comfortable, but with the noise cancelling on, they cut noise noticably better. I tested this by standing about 6 feet from my running air compressor which is very loud, much louder than a mower. The 3M's are ANSI certified, so that is impressive. Sorry, I don't have a sound dosimeter, or I'd give you some numbers.I can't attest much to the battery life, these charged very quickly and have an indicator light when fully charged, I've used them for an hour with the ANC on and they still show 100% on my phone (which is a nice feature) but I don't know how long the battery lasts, likely quite a while the description says 100 hours depending on use. The ANC does use some battery as it is always on when activated. Make sure to briefly press to power button a 2nd time once paired to turn on the ANC - there is a blue indicator light that will come on to show this feature is on. Also, the noise cancelling works even when nothing is playing over the headphones - it feels a little like you are cocooned from the outside world - very soothing. But it doesn't eliminate outside noises, just muffles noises, especially constant noises - not as much with sudden noises like clicking a seat belt or clapping.In the pics you will see how they came, nicely packaged with good instructions that are suprisingly easy to follow. They paired easly with my Pixel 7 and re-pair seamlessly. They come with a 12 inch USB C cord and, as a nice feature, a 1 meter long, audio patch cable to use in case the battery goes out or your device doesn't have bluetooth - they really thought of everything. I tested the patch cable and it sounded excellent directly plugged into my tablet. I got some weird feedback when I tried it through a 2nd patch cable on my desktop - so best used directly maybe.In summary, this looks like a solid, well packaged, set of headphones at an exceptional value. Initially everything works as advertised. I hope this review helps.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Nly5aXRML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71vRPALrvgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zCeDiQp-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Audra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA4JJ7PWW4JGWWRADQBMYG46QFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB2H3RAEVIBWK?ASIN=B0CLCLDDKG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Headphones!",
                "reviewText": "I'm loving these headphones. They were super easy to pair. The sound is top notch. They hold a charge for all day and then some. The noise cancelling is great. They super soft and love that they collapse to be smaller for storing. I highly recommend these to anyone looking for a nice quality super comfy pair of headphones.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Justin & Crystal BrownJustin & Crystal Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYZ5XPDW56Z5NRN23AMNVTUITZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU4Q1JOY8YV8H?ASIN=B0CLCLDDKG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Wirelessheadphones for $36 that are actually good??? What??? Huh…they’re right!",
                "reviewText": "The headphones arrived secured in a nice looking box. The package contains the headphones, a charging cable, and a 3.5mm aux cable. The charging and aux cables are underneath the black molded insert. They also come with a QR code for a 18 month warranty. I don’t know if the headphones came partially charged or not, I just tossed them on the charger to start with. The USB charging cable is very short so I used a power bank to charge it up.First up – the good!I can only compare these to my airpods, and yes, they are different products with one being a headphone and the other an earpod, but since they are made to do the same job and it’s the only thing I have to compare with (except some cheap gaming headphones which I’ll touch on just a bit later) that’s what I’ve done.The headphones are beautiful. I’m more of a blue than red person myself, but I can’t deny how purty the red/black combo is. Very flashy. They also fit my head and ears perfectly, and I mean PERFECT. I’m a 5’7 adult with a normal sized head and I did not have to extend the headphones at all. If you have a smaller head than normal these miiiiiight be a little big for you on the default size, and if you have a larger head the extension on them will cover you. I can’t picture anyone who has a larger enough head that these wouldn’t work with. Maybe Hagrid. Maybe. (And I’ve stood next to the full animatronic head so I know!)Next up, the sound test. I was able to pair them to my TV via Bluetooth and immediately popped onto youtube and played some music. Impressive! The bass was very good and much better than I’d expected from these. I also liked how my TV remote can control the volume of the speakers. Big bonus for that! The volume is good and should be loud enough for anyone’s tastes. The noise cancelling is good, and I plan on taking them to the gym with me to see how they compare to my airpods. They also have a transparency mode and a noise-cancelling “off” mode.Next I switched to Netflix to test any possible delay/lag and was happy to find there was none. Very cool.Then I paired them to my phone and also found the quality to be on par with the TV. My airpods might get a little louder…maybe.Battery life: GOOD. I’m not sure if they will last 100 hours as advertised, but I’ve had them over a week now and have not charged them once aside from the initial charge.Second – the not so good.I primary bought these to use with my TV, and in the hopes it would be possible to output my PS5’s sound through the TV’s Bluetooth and into the headphones. Alas…like so many others it does not work. The sound does come through, but the lag is awful and sometimes choppy too. No worries through…99.9% of other wireless headphones also do this without utilizing other magic. I can’t really fault these headphones for this though since so many others also have the same problem. Sony just hates Bluetooth I guess. It won’t lessen my review score…after all, it was a longshot. You can use these for wired play via the PS5 controller as well but I don’t recommend using the included 3.5mm cable. Use a better quality one. The one included routed full audio to one ear while only partial in the other and was scratchy from the connections at both ends. The headphones also have a “game mode” but I can’t figure out what it does…activating it only shuts off the audio. The box it comes in says it helps with the latency but I can’t seem to get them to perform.The ANC, ANC-Off, and Transparency modes have minimal differences between them. Unlike the airpods where ANC is really noticeable when there is no audio playing, I could barely tell a difference between the modes on these, but, since they are full sized headphones that isn’t really a big deal.The only other complaint I with these is the instruction manual. You might as well toss it in the trash and just figure it all out on your own. The section of the manual that lists what each button does is incorrect. I spent about 10 minutes scratching my head going over the instructions and wondering why it wasn’t working correctly before I tossed them aside and just started fiddling with it myself.Here is the correct buttons: The power on/off button is the round symbol button between the volume up and down buttons. “This is labeled as button 2 in the manual…but the manual says to use button 5, which is the ANC button.) Hold the button down until it turns on/off. It takes about 3 seconds each way.The section of the manual showing how to pair the Bluetooth is missing a crucial step…how to put the headphones into pairing mode! Here is how you do it: Just turn them on…using button 2. If you push button 5 (ANC) it will turn them on and then into whatever ANC mode you have it set to, but it will not enter pairing mode and you will have to turn them off, then back on with button 2 to start pairing. If you have paired them to two devices they will automatically pair when the headphones are turned on again. If you want to add a third device make sure the other paired devices are not in range, or have the Bluetooth turned off, so the headphones can go back into pairing mode.The final score: These get 5 stars from me. I rate them on cost versus functionality. They work, and they work great for what they are supposed to do especially in their price point. The issue with the PS5 gets a pass (although if it had worked I’d be screaming from the rooftops to everyone with a PS5 that I know to get them) and begrudgingly the instruction manual gets a pass too, but only because once I tossed it aside I found the headphones to be user friendly and easy to figure out.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41m45-BhzZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41wr5TxhPfL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ArianelleArianelle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFS6QMM5NP6ST3FGFJN7ZQASL36Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BPOWLETKBUCF?ASIN=B0CLCLDDKG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Great headphones for the price",
                "reviewText": "I was very impressed with how easy they are to set up and get going right out of the box. No frills, turn on, connect Bluetooth and go! Great sound quality, headphones are not too heavy and they are comfortable to wear. Battery lasted a long time. Very happy with purchase overall for what I paid.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61zlAJsNdDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71oU5cN45ZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ahcafe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNT6VYO3CPXQ7KWEA6OWEUWO2JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REL4HSQ8JHI74?ASIN=B0CLCLDDKG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Great value with nice option to plug in an aux cord",
                "reviewText": "Sound quality, comfort, noise cancelling, and battery life are better or as good as other headphones I’ve bought at similar prices. But the main feature I like about these headphones are the ability to plug in an aux cord and use them as a regular pair of headphones. Some of my devices are slow to pair and the flexibility to bypass pairing when I don’t feel like going through the trouble is great and makes using these very hassle free.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vathsala Manjunath",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5HIZO4X5LKJFKIBTTO5ZXNPD4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QFVUSWDAFG7O?ASIN=B0CLCLDDKG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Wireless headphones",
                "reviewText": "It’s a great headphone, adjustable size, wireless with noise cancellation. Very good quality and comes with a charging usb and connecting wire as well for air travel purpose. Love the color and model. Snugs ear very well with cushioned ear muffs. Highly recommend it!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$59.98",
                "sellerName": "LBE-US",
                "sellerRating": "0"
            },
            {
                "price": "$63.98",
                "sellerName": "Qaekie Direct",
                "sellerRating": "5"
            }
        ]
    }
}