{
    "remaining_requests": 48751,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/sephia-SP3060-Earbuds-Lightweight-Tangle-Free/dp/B0170RBJ9Q",
    "body": {
        "name": "sephia SP3060 Wired Headphones, HD Bass Driven Audio, Lightweight Aluminum Wired in Ear Earbud Headphones, S/M/L Ear Bud Tips, Earphone Case, 3.5mm Tangle-Free Cord (Without Mic)",
        "price": "$14.95",
        "originalPrice": "$19.99",
        "rawPrice": 14.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/sephia-SP3060-Earbuds-Lightweight-Tangle-Free/dp/B0170RBJ9Q",
        "soldBy": {
            "sellerID": "A1E9G6B6XDJLWB",
            "name": "Sephia-London",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1E9G6B6XDJLWB&asin=B0170RBJ9Q&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41MTmYNyGjL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41GJX6kMBtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sA1GdFEOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51aWK6ml7CL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/313bmYsKjaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/316XrJzc26L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Go1NgUjnL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f05b2623-6f94-4c3a-8042-3874beebabb6/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/608b6cc0-21a4-4dc5-aa1f-e99d6066e4e5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4bd2081e-6eb7-42f9-a0ab-e82a04716d68/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/efb63e93-928b-4a37-b643-fbe8467f0820/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/adee92ec-4a35-4101-9db8-b405715e866e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f7361d5a-db54-44e2-8830-c72e48dde049/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/618Us-M0mYL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/61NzHDiHEhL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the sephia Store",
            "link": "https://www.amazon.com/stores/Sephia/page/5156279B-EA8A-42A5-B2C6-4B3BB4148E85?ref_=ast_bln"
        },
        "brand": "Sephia",
        "merchantInfo": "Sephia-London",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 34774,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 13 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Wired in ear earbud headphones best for listening music while running or GYM, with 6 sets of ear buds (S/M/L), headphones stay in your ears while keeping surrounding noise out",
            "A powerful 10mm Neodymium earbud magnet provides bass driven audio and clarity for all music genres; Together with the in ear noise isolating earphone design, these wired headphones reduces external noise and minimizes sound leakages significantly",
            "Sp3060 wired in ear headphones featuring Y shape cord, 3.8 feet long tangle-free earphone wire, noise isolating ear bud tips, 3.5mm head phone jack, 20 hz- 20000 hz frequency range",
            "Headphones closed back in ear design seal the sound in so they are also ideal for train, bus, commuting, school. Metal earphone construction and lightweight aluminum earbud housing generates pure audio, makes the bass more mellow and layered",
            "Compatible with a range of electronics devices, iPhone, Samsung Galaxy Sony Xperia, tablet, laptop, you can plug in these headphones into virtually any device with a 3.5mm headphone jack (some devices may require adapter)",
            "12 Months limited warranty against manufacturing defects, if you experience any issues, please refer to the user manual or troubleshooting guide under product guides and documents"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "Earbud Headphones",
                "link": "https://www.amazon.com/Earbud-In-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097478011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.94 x 3.94 x 3.94 inches"
            },
            {
                "name": "Item Weight",
                "value": "16 Grams"
            },
            {
                "name": "ASIN",
                "value": "B0170RBJ9Q"
            },
            {
                "name": "Item model number",
                "value": "SP3060"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 34,774 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#415 in Electronics (See Top 100 in Electronics) #65 in Earbud & In-Ear Headphones"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "November 10, 2016"
            },
            {
                "name": "Department",
                "value": "Unisex Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Betron"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Units",
                "value": "1.0 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "sephia"
            },
            {
                "name": "Model Name",
                "value": "SP3060"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "In Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Noise isolating Earbud Headphones Sephia SP3060 Earbuds are the ultimate combination of sound, style and sophistication. Each earbud is embellished with silver details for a sparkling touch of eye-catching glamour. Upgrade Your Music Experience To New Levels With the Sephia SP3060 Earbuds Expertly crafted to provide bass driven audio, the Sephia SP3060 earbuds are user friendly and enhance any genre of music. You can immerse yourself in your favourite tracks anytime, anywhere. All Round Audio Performance A powerful 10mm Neodymium magnet provides balanced audio and clarity for all music genres. Together with the in-ear design, the SP3060 reduces external noise and minimises sound leakages significantly. Bass Driven Balanced Sound Pamper your ears with the lightweight SP3060 earbuds. Designed to deliver deep bass with balanced tones for all music playback. Experience impressive bass with sparkling highs and detailed sound, provided by a high-performance dynamic earphone driver system. Stylish And Ergonomic Design Easy to slip in your pocket or backpack. The charm silver and black colour make them look more noble and elegant, while high quality and enhanced materials mean they last longer. Enjoy superior and fuss-free music listening with the reinforced tangle-free cables, that reduce unwanted contact noises, and the gold plated plug that offers a high-grade connection.",
                "media_link": []
            },
            {
                "media_text": "In-Ear Earbud Headphones Noise isolating Earbuds Custom Comfort The shape and size of the headphones has been optimized to give a perfect fit and long-lasting comfort, and they come with ear adapters in various sizes so you can find the best fit for you. Lose Yourself In Music The adapters also provide effective noise isolation so you'll be able to fully immerse yourself in your music. Noise Isolation Noise isolation does not make use of any power or electronics to block out surrounding noise. Rather, it employs the choice of optimum construction materials and an ergonomic design to block out as much noise as possible from entering the ear. Think of it as sound-proofing for your ears. 10mm Audio Driver with neodymium magnet Thanks to 10mm neodymium magnet drivers these unique headphones are supremely powerful and are capable of producing top grade, punchy, bass boosted sound, that is normally only associated with far larger and more expensive headphones. Noise Isolating Earbuds The ergonomic in-ear design isolates ambient noise",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/4d39777b-1731-4051-8662-81af925d5d22.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Noise Isolation Technology Noise Isolation technology keeps it personal- it’s just you and the music. There’s no need to take measures to drown out outside noise; the SP3060 earbuds have you covered.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1E9G6B6XDJLWB/B0170RBJ9Q/xAopTg8R4yu.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "3.5mm Connector 3.5mm gold plated audio connector for perfect signal transfer. Metal Housing With a sleek and durable metal housing, the earbuds are lightweight and perfect to use on the go. Three Sizes Of Earbud The SP3060 earbuds come with a large selection of ear bud sizes to provide hassle free luxurious comfort and a good addition to your style. The item comes with a pouch, making transportation easy. Sleek Protective Case The SP3060 earbuds come with a carry case, making it easy to transport your headphones, keeping them protected while looking stylish.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/536cb051-e76e-4d43-b6cf-d9194ba2906a.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1E9G6B6XDJLWB/B0170RBJ9Q/mg9uytn1SaKX.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1E9G6B6XDJLWB/B0170RBJ9Q/5kAicJKhSrKO.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1E9G6B6XDJLWB/B0170RBJ9Q/oNRtiDQQas.__CR0,0,300,300_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Sephia SP3060 Earbuds Specifications Cable length 120 cm Driver Size 10 mm Connectivity 3.5 mm Gold plated jack for maximum connectivity Impedance 16 Ohm Sensitivity 112 dB Frequency response 20Hz - 20000Hz Silicon Earbud Sets 6x Memory Foam Earbud Sets 2x Carry Case Included Yes Earphone Type In Ear Microphone NO, Without Microphone Earphone weight 16gr Wired Connection YES Cable Type Tangle-Free Wire Earbud Driver Type Neodymium Magnet Dynamic Drivers",
                "media_link": []
            },
            {
                "media_text": "SP3060 Earbuds SP3030 Earbuds Sp2040 Earbuds Connection Type 3.5mm Jack 3.5mm Jack 3.5mm Jack Microphone Feature Without Microphone Without Microphone Without Microphone Driver Size 10mm 9mm 10mm Driver Type Dynamic Dynamic Dynamic Cable Type Tangle-Free Wire Tangle-Free Wire Tangle-Free Wire Noise Isolation ✓ ✓ ✓ Memory Foam Earbuds ✓ ✓ ✓ Silicon Earbuds ✓ ✓ ✓ Case ✓ ✓ ✓ Wire Clip ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/7cf8cf49-2a5f-4958-9e06-dc924c88cb8f.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/4d39777b-1731-4051-8662-81af925d5d22.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1E9G6B6XDJLWB/B0170RBJ9Q/xAopTg8R4yu.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/536cb051-e76e-4d43-b6cf-d9194ba2906a.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1E9G6B6XDJLWB/B0170RBJ9Q/mg9uytn1SaKX.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1E9G6B6XDJLWB/B0170RBJ9Q/5kAicJKhSrKO.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1E9G6B6XDJLWB/B0170RBJ9Q/oNRtiDQQas.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c74c80ed-8c61-4d71-8398-054e243c4f54.__CR68,0,750,1500_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8ade1eec-e4b1-4f44-923b-4f67aac8cc7c.__CR341,0,750,1500_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b89c24a5-e64c-42ab-91f9-e5c43b828d66.__CR205,0,750,1500_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "GOBLUE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTWZQFXO34CYFKNHYJMF4GGUMGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAQKQ46P7Z70Q?ASIN=B0170RBJ9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Powerful sound. Clear. Hard hitting. Absolutely love them!",
                "reviewText": "Id like to thank the Sephia customer service team. I did have issues with my original set. Before I decided what coarse of action to take, Sephia reached out to me. I didn't even reply before they sent me a replacement set - wow! They offered to replace them if I was still having issues. They also noted there is a warranty (if needed) to replace them in the future. After a few days passed, I received a replacement set. I greatly appreciate it. I was still having intermittent issues with the original set, so everything is now working out perfectly. The set works wonderfully. As I noted before, I really loved these Sephia earbuds from the get go. They have great sound quality. Powerful bass, yet also clear mids and highs without suppression. Usually I have to adjust earbuds and headphones thru an EQ - not these. Just right for me. They sound great in every device I plug them into. Right now, I have them connected to an external DAC that's hooked up to my desktop PC. No problems with power handling either. No distortion at high volumes. I listen to mostly Alt Rock and respective off shoots. Electronica, Trip Hop, Punk - all sound awesome on these Sephia earbuds. Dubstep & EDM - no worries. Sounds great! I was listening to the live recording of The Distillers @ Reading in 2004 - sounds way to good for $15 earbuds!!! (it also makes me miss those days and wish I had the money and time back then to fly from the US to England to see it in person).... Bottom line is - u feel the music with these Sephia earbuds. Enough to actually feel an emotional connection to what you're listening to. I'm so glad I ran across them on Amazon. No regrets. Also - customer service is exceptional if u have any issues. If anything occurs that would alter my review, I'll give an update. Advice to readers- buy these right now. No need to read anymore reviews.Previous update:I added one star (2 stars total) because I can get these Sephia earbuds to work properly intermittently. I'm being nicer than (probably) anyone else in this case. I really do like...no wait -love these Sephia earbuds. I had to keep trying bc it's not worth it (multiple reasons) for me to physically return them...(health issues, printer issues, inconvenience, etc) After playing around with them a bit (very gently - moving around the wires, carefully plugging and unplugging them) -still no response from the right side driver that went out. <<<Again- this is only the 2nd / 3rd day now using them>>>. Also, I can assure u, I am very gentle with all my electronic devices and accessories. Matter of fact, I embarrassingly admit I'm literally (for real) OCD about my earbuds, headphones, etc. I have 3 listening stations in my house. I have a total of 4 headphone stands and also a couple of wall hook/racks that house my assorted headphones and earbuds. I'm extremely careful with everything - to the point someone watching me handle them would think im a little over the top OCD. So - point is, I didn't hurt these earbuds. It occurred to me that maybe there's an impedance or resistance issue with these earbuds. Or maybe (for some reason) the right side driver isn't getting enough power to it...so I decided to plug them into one of my headphone amps to see what happens.They worked! Came to life like nothing happened. I tried another source (a Bluetooth transmitter/ receiver) that runs a little bit of extra power - and BOOM....still works. I once again tried several other headphones and earbuds plugged directly into my phone. No issues with all other listening devices plugged into my phone. So, these Sephia earbuds are working intermittently depending on what you plug them into. So I gave them a second star. ****Obviously there's still a major problem with this particular set of earbuds. I really wish they worked properly all the time. Later, depending on if they still work, I may give more details on what I do like (pretty much everything). I've read a bunch of low ranking reviews and many of them are completely mistaken or even wrong. I say very confidently, that people who think they sound tinny, have no bass, or sound way off -;they aren't getting a good seal. Even folks that \"know what their doing\" can have a bad fit with their earbuds and not realize it. I've had it happen to me. I kept getting differing sound results (unfavorable) with a particular pair of earbuds that I was 100% certain I had fit properly. However, after spending a lot of time changing out ear tips (that both came with the set and other extra ear tips i had layn around). In that case (again - not these Sephia's but a different pair) I ended up using an extra pair of Spinfit 360 ear tips I had. It was a world of difference and those earbuds sounded as great as the reviews in that particular case. So a lot of these bad reviews here are likely unwarranted. Of coarse, the ones that have drivers going out (like this one ) are valid. I did see a ridiculous one star review where the person absolutely loved earbuds (like me) but gave it one star bc they only lasted a year and a half. Yes - a product such as this should last longer (even being very inexpensive) - but only one star when the person loved them...a year and a half isn't great, but it's not the next day like mine ....or several months like others. I would (maybe) take off one star <max> in that case, but my gosh - for a price that's usually around $15 for these, I certainly wouldnt complain much if they did a great job for that long. Especially if I really liked them. I would say with certainty that $15 is worth it ever year and a half if they did a great job and I really liked them. Anyway, even with my not-so-good situation with these, I want to be at least fair when reviewing this product. If anything changes, I will come back to add comments. I am still very disappointed btw :( Original comments: Up until the 2nd day of listening to these Sephia earbuds, I truly loved them. Great audio. Nice balance with deep hardcore bass. Mids and treble are nicely done with detail and no harshness. Matter of fact, this is one of the very few listening devices that I didn't need to change my EQ settings (or at least very little tweeks in some instances...very little). Plenty of ear tips to choose from. Comfortable to wear. The fit and finish is superb. Super nice in every possible way. I was actually thinking about much I love listening to music with these earbuds when the right driver went out for no reason. I didn't everything to make sure it wasn't a connection issue. I also plugged in other headphones into my phone to see if it was a phone issue. It wasn't. Just these Sephia 3060 earbuds don't work. Huge shame. Massively disappointed. Because of the trouble and inconvenience of returning them, it's not really worth it for me. My printer isn't working right right either, so printing off a label would be a hassle. Driving all the way to a UPS store isn't convenient either...not for something this inexpensive. I got them for $13. I would be a steal if they stayed working for more than a day. Now it's just a waste of money. I had these on my shopping list in Amazon for a long time - but since I have several other earbuds and headphones, I never bought these. I was a little nervous getting them because they are cheap and a name I've never heard of of. Sometimes I'm lucky with random brands and other times I've gotten burned...I guess I'll chalk this up as a burn. I will contact the seller, but I'm not confident that anything will be resolved. :(",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas F. Reilly III",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYOFA6SQXXYZWRKYNF2IW6TK4GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTTHD8BVCV3X8?ASIN=B0170RBJ9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars For the price? Wow.",
                "reviewText": "Great ear buds for the price! Solid construction, great sound. Even the packaging is good. (memory foam inserts, too)Pleasantly surprised.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim Aaron Green",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVBAKKIZNXRD4BXJYMSQS6NK6SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20BCR4U4ACJNS?ASIN=B0170RBJ9Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "4.0 out of 5 stars some longevity issues but good customer support",
                "reviewText": "Edited review:I am raising my prior star rating of 2 up to 4 because the company reached out to me to remind me that the earbuds that I was having problems with would still be under warranty.After detailed description of the intermittent problem I was having and some troubleshooting suggestions. they sent replacements at no charge very quickly. I hope this third set will last at least as long as the first ones I purchased because when they are working well I am very pleased with the product.Original review below:I have been quite happy with the sound quality for the price point, at least as long as they work. I like the feel of the metal, seems higher quality than plastic. Different sizes of earplugs allows for finding a good fit. All of this is good.The first set I bought lasted just over a year before one of the earbuds died which did not surprise me given the price, so I ordered another set expecting a similar experience. After about one month I started having issues; sometimes low volume, usually one earbud going dead. The odd thing is that the dead earbud varies, sometimes left, sometimes right. It can change while I am using them. Sometimes they both work. I have been using them this way for a month now and cannot determine a pattern to the malfunction. Jiggling wires and connection seems to have no effect.To counter the problem of determining R from L I used a small drop of UV cured plastic glue to provide a tactile method of identifying which was which, but this was back when I expected both to work.Despite the aspects of these earbuds that I enjoyed I do not think I will buy another of this brand, too expensive if I have to replace them every month. Did I just get a bad unit? Maybe, but I am not excited to try best of three.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CHROMiEO !",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2022",
                "reviewTitle": "Good Buy.",
                "reviewText": "Sound is Good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Moisés",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 23, 2021",
                "reviewTitle": "Gran valor. Buenos audífonos.",
                "reviewText": "Sin más preámbulos, excelentes audífonos por el dinero. La presentación de los mismos es de un producto más costoso. Los audífonos en sí no se ven muy premium, pero el cable sí, de mayor grosor que audífonos más comerciales. Pero lo importante es el sonido. Es muy balanceado, todos los rangos de frecuencia se escuchan bien. Bajos buenos, sin ser para bassheads, las voces se escuchan claras, los instrumentos igual, guitarra, piano, batería, todo se oye chido. Completamente complacido. Suenan mejor que unos que compre recientemente y que me costaron tres veces más. No son \"audiófilos\", pero la música se escucha viva, divertida. Solo son 14 USD, cómpralos.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Renato",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 2, 2019",
                "reviewTitle": "Calidad de los bajos",
                "reviewText": "Me han encantado.Cable podría ser anti enredante",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on May 30, 2022",
                "reviewTitle": "kind of average quality for me",
                "reviewText": "i do not have perfect ears sounded kind of average to me. however audio preference is a personal thing",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Spectre Bazza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 15, 2017",
                "reviewTitle": "Better Than Expected",
                "reviewText": "If you're on the fence about buying these then you need to jump off that fence right now! Don't be put off by the low price and think that their sound and build quality are as bad as your average stock headphones that come with your phone, or the cheap Skull Candy range, because they are not. I've owned Beats headphones in the past and trust me, these are literally just as good, if not better due to their affordability. These headphones are amazing, particularly at such a low price. I've been using a pair standard headphones that came with my phone for a while now because I lost my last pair of Sephia ones. That's the fourth time I've lost them because I has the dumb. But pay day is around the corner and I'm ready for my fifth set! The bass is brilliant, the sound quality is superb. You can tell that these aren't just a cheap pair of headphones you'd get from a random market stall. The metal finish feels sturdy and of professional quality, you can certainly feel the care that's been put it for building these and the ear buds fit very comfortably and a ridiculously effective for their noise cancellation. They come in a stylish box with numerous different sized ear buds and a handy pouch for when you're out and about and you want to put them away; no more tangled wires! I haven't had any issues with these during the past few months that I've been using them. All in all they're a top quality set of headphones that you will not regret buying, especially given the fact that they're so cheap when compared to others of the same quality on the market, such as Beats. 10/10 would recommend. Take a leap, save some money and invest in a pair of these beauties. You definitely will not regret it.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}