{
    "remaining_requests": 48810,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beats-Studio-Pro-Personalized-Compatibility/dp/B0C8PR4W22",
    "body": {
        "name": "Beats Studio Pro - Wireless Bluetooth Noise Cancelling Headphones - Personalized Spatial Audio, USB-C Lossless Audio, Apple & Android Compatibility, Up to 40 Hours Battery Life - Black",
        "price": "$199.95$183.95$199.95",
        "originalPrice": "$349.99",
        "rawPrice": 199.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beats-Studio-Pro-Personalized-Compatibility/dp/B0C8PR4W22",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CM7PJDL4"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C8PR4W22",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41BH74ZyJpL._SS36_.jpg"
            },
            {
                "asin": "B0C8PT7DF5",
                "variationName": "Color",
                "variationValue": "Deep Brown",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41x7U+Sqj3L._SS36_.jpg"
            },
            {
                "asin": "B0C8PWSW7T",
                "variationName": "Color",
                "variationValue": "Navy",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41em9KnYnUL._SS36_.jpg"
            },
            {
                "asin": "B0C8PSMPTH",
                "variationName": "Color",
                "variationValue": "Sandstone",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31nvao7P-9L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41BH74ZyJpL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41GlAp243AL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41z96yhmZRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zssL5Y7GL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41IVQMyja5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BPu xKTiL.jpg",
            "https://m.media-amazon.com/images/I/713tE1Vr8gL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2dac7ca-5a47-4c20-8192-f3fecb436306/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2fe868ec-5425-4656-a2b1-f150b68c4b00/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/182f96f5-d1b6-486c-b93b-69dfe6cf1113/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Beats Store",
            "link": "https://www.amazon.com/stores/Beats/page/395474F7-47DA-4331-929B-3ED7C7DC2C43?ref_=ast_bln"
        },
        "brand": "Beats",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4639,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tuesday, February 13. Order within 13 hrs 26 mins",
            "FREE delivery Friday, February 16. Order within 13 hrs 26 mins",
            "FREE pickup Friday, February 16",
            "Or fastest pickup Tomorrow, February 12. Order within 13 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "BEATS' CUSTOM ACOUSTIC PLATFORM delivers rich, immersive sound whether you’re listening to music or taking calls.",
            "LOSSLESS AUDIO via USB-C plus three distinct built-in sound profiles to enhance your listening experience",
            "HEAR WHAT YOU WANT with two distinct listening modes: fully-adaptive Active Noise Cancelling (ANC) and Transparency mode",
            "ENHANCED COMPATIBILITY with one-touch pairing and a robust set of native Apple and Android features",
            "PERSONALIZED SPATIAL AUDIO with dynamic head tracking place you at the center of an immersive 360-degree listening experience",
            "LONGER LISTENING - Up to 40 hours total battery life. A 10-minute Fast Fuel charge provides up to 4 hours of additional playback.",
            "LOUD AND CLEAR - Voice-targeting mics precisely filter background noise for crisp, clear call performance",
            "ON DEVICE CONTROLS - Take calls, control your music, and activate Siri with the multi-function on-ear controls",
            "WIRELESSLY CONNECT to more devices with Industry-leading wireless Class 1 Bluetooth for extended range and fewer dropouts",
            "WHAT'S IN THE BOX: Beats Studio Pro Wireless headphones, Woven carrying case, 3.5mm audio cable, Universal USB-C charging cable, Quick Start Guide, Warranty Card"
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Beats"
            },
            {
                "name": "Model Name",
                "value": "Studio Pro"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "Over Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless, Bluetooth, Wired, USB-C, 3.5mm"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Blessed",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHYBSO7YHSOBNEAY7MPH4XLP2BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32V0ZI84EA969?ASIN=B0C8PR4W22",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars NOT FOR IOS! Sounds AMAZING ON PC & DROID",
                "reviewText": "I have both an iPhone 14 & a Samsung S23. When I first paired these beats studio pros to the iPhone, I was quite disappointed. The sound quality was low & muffled-missing more to be desired especially with the lack of bass- like previous reviewers have stated.HOWEVER, On the Samsung S23 these headphones sound amazing! It comes with its own dedicated beats APP that the iPhone doesn't have! The sound was a huge NOTABLE DIFFERENCE. Every instrument possible could be heard-the bass enriched the instrumentals-completely matching the sounds surrounding it.THE TRUE MAGIC arrived when I connected the USB-C to my Galaxy Book 2 Pro. This granted me access to DOLBY ATMOS & LOSSLESS AUDIO. This where I could also access 3 different \"EQ\" Settings. Ranging to \"BEATS SIGNATURE, Entertainment mode, & a conversational mode. I could also seamlessly switch between my Samsung back to my galaxy book. This FEATURE however does not exist with an iPhone & MACBOOK.BEWARE IF YOU'RE USING IOS ONLY!Considering I can use these STUDIO BEATS into my Samsung ecosystem with such BEATIFUL SOUND, I rate these \"BEATS STUDIO PROS a 5-star Soley for that reason. However, if you're in the IPHONE ecosystem I would rate these a SOLID 1 STAR- as it is lacking many features that are present & shown on PC.A few OTHER FEATURES: to mention if you're still reading by now.ANC: NOISE CANCELATION: Is not perfect but is more than enough. I would say that it doesn't completely cancel out the background noise, but it does reduce it to 65%.TRANSPRACEY MODE: is not perfect as well but not bad either. I can still hear myself talk & move. This could be better but its FAIR-not great or bad.COMFRTABILITY: Wore these for the first 4 hours & I can say these feel amazing & light. At the 5th hour However, I did start to notice my ears would feel a little irritated from the ear cups pressing on a little too firm but its bearable nothing too bad. I love that they fold back & the case is very durable & flexible.BATTERY: The battery is amazing & charges 4 hours in 10minutes. I have not tested the battery completely myself, but I did leave them on for 8 hours straight at full charge- it's still at 76%The rest is for you to DISCOVER!",
                "reviewVotes": "48 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Spazzola",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGMDHUXSF76BWEEVF5IAL7E6NKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RSUGFYRCGKOF?ASIN=B0C8PR4W22",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Sound, Good Quality.",
                "reviewText": "Well, after having lost one of my AirPods (gen3) and not being able to justify purchasing a replacement left pod for $90, I started doing research.I came across these beats studio pros and looked at their stats. 40 hours of play time? Probably the most enticing thing about them to me. Then came the active noise cancellation, and spatialized audio. ANC intrigued me. I wanted it to be better than the AirPods at cutting out sound. While I was looking into these I happened to be doing it during Black Friday deals. Which meant I thought they were $170, which was the price of brand new AirPods. Then I saw their original price of $350. Which enticed me even more in a way, thinking of the price tag fallacy, higher price must mean quality. I mulled this over and over and eventually ended up missing the half off sale. Then I knew I wanted these babies. I watched and waited for a sale to come up again. I was not willing to pay $350 for wireless headphones, as I am not willing to pay $350 on just about anything, but thats just me. For me, $179 is splurging significantly. I caught another sale. I bought them and hoped for the best.I will have to be honest in saying I was hesitant to stray from AirPods and move over to headphones. The less I have on me the better, so having something sit in my ear rather than over my head appeals to me. But having my device constantly slip out of my ear or feel unsecured was not enjoyable. That’s how I lost my left AirPod in the first place. These headphones feel sturdy for me. I was pleasantly surprised. Although I still did not particularly care for a bulkier heavier device, I did appreciate their securedness. They do eventually make my ears sore but I usually just adjust them. I will not count this against them because every pair of headphones I have ever owned eventually made my ears hurt or gave me a headache. Im sensitive what can I say? The padding on the top band that goes over your head was a nice touch.The ANC is powerful. I loved being immersed in my music. I have no complaints really.Spatial Audio… I personally could care less about it, so I don’t have much to say about it. I just don’t use it as a personal choice, not saying it isn’t good.The sound quality seems adequate to me.The volume is pretty great, I never have to have it all the way up to get clear sounding audio or to feel like I can actually hear something. Which with my AirPods was a constant problem.The mic on these, I am thoroughly impressed with. Compared to my AirPods, its like award winning lol. People on calls usually can’t tell I am using a headset at all.I’m not sure how long it truly takes to charge them, as I haven’t charged them from dead to full yet. I imagine from the little bit of charging I did do when they first arrived they will take a little bit, but to me it’s worth it.Overall, I feel my money was well spent on a good product. I got a better bang for my buck with these beats than I did with my airpods. The compactness of AirPods are nice, and I like a compact item so having a larger device is something to get used to but I still think it’s worth it.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "richard Bedard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 19, 2024",
                "reviewTitle": "Perfect",
                "reviewText": "The design, finish and sound are excellent. I love it! Worth the money even if they are a bit expensive.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 19, 2023",
                "reviewTitle": "Great headphones.",
                "reviewText": "Great headphones, they are an upgrade to my solo3. Sound is immersive and crisp. They are comfortable for long sessions and I like the ability to just plug them to my Switch. Can’t compare it to others as those are the only ones that I have tried because of budget but I am happy with them overall.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antho",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 7, 2023",
                "reviewTitle": "Great headset !",
                "reviewText": "Great headsetAmbient noise cancellation is very effective. This headset is really comfortable, you almost don't feel it. The sound is excellent!Worth every penny",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B.H.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 5, 2024",
                "reviewTitle": "It’s ok",
                "reviewText": "Noise cancelling 2/5Sound 4.5/5Comfort 3.5/5Battery life 5/5Overall 4/5They’re cute but the noise cancelling isn’t the best. It’s somewhat comfortable but it does put some pressure on ur jaws, and if you wear them for a while they do get sweaty. Otherwise they’re pretty good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tate Mbavarira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 31, 2024",
                "reviewTitle": "Just what I needed",
                "reviewText": "Being in the apple ecosystem and already owner of some Beats fit pros this was the perfect headphone choice as I still can’t justify AirPod Max at this stage. Even after discount at $300 CAD is feel this was a good value for what you get. You lack a few features that come with apple chip like auto device switching linked to your Apple ID but still can pair easily with my Apple Watch or Apple TV. Really happy with these , I would get these apple friendly features only Sony or any of the competition.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}