{
    "remaining_requests": 48757,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Skullcandy-Crusher-Wireless-Over-Ear-Headphone/dp/B08FCGH2RL",
    "body": {
        "name": "Skullcandy Crusher Evo Over-Ear Wireless Headphones - Black (Discontinued by Manufacturer)",
        "price": "$128.90",
        "originalPrice": "$199.99",
        "rawPrice": 128.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Skullcandy-Crusher-Wireless-Over-Ear-Headphone/dp/B08FCGH2RL",
        "soldBy": {
            "sellerID": "A3V25H3S1O04O9",
            "name": "Top Sports",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3V25H3S1O04O9&asin=B08FCGH2RL&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNVCDWZQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B08FCGLYFZ",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "$128.90",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Q1qHDyOEL._SS36_.jpg"
            },
            {
                "asin": "B08FCGH2RL",
                "variationName": "Color",
                "variationValue": "True Black",
                "price": "$129.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41BuX4uvI8L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "Only 8 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41BuX4uvI8L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/519RD9kJPEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-DHWtT2kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417pC8R6p6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4179UzrtoFL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/61Mg1C9IjZL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/61rNSeo4YlL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Skullcandy Store",
            "link": "https://www.amazon.com/stores/Skullcandy/page/9F16B940-F912-43FE-888C-5BB1B86337A9?ref_=ast_bln"
        },
        "brand": "Skullcandy",
        "merchantInfo": "Top Sports",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 15599,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17. Order within 13 hrs 18 mins",
            "FREE pickup Friday, February 16",
            "Or fastest pickup Thursday, February 15. Order within 13 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "This product is not eligible for manufacturer's warranty.",
            "Search ASIN B0CBLM9MMC to find the latest model of this product."
        ],
        "description": "Skullcandy Crusher Evo Wireless Over-Ear Headphone - True Black.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172541"
            },
            {
                "name": "Over-Ear Headphones",
                "link": "https://www.amazon.com/Over-Ear-Headphones/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12097479011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7.91 x 7.36 x 3.54 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.01 Ounces"
            },
            {
                "name": "ASIN",
                "value": "B08FCGH2RL"
            },
            {
                "name": "Item model number",
                "value": "S6EVW-N740"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Metal batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 15,599 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,859 in Electronics (See Top 100 in Electronics) #153 in Over-Ear Headphones"
            },
            {
                "name": "Date First Available",
                "value": "September 2, 2020"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Skullcandy"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "Charging Time",
                "value": "40 Hours"
            },
            {
                "name": "Units",
                "value": "1.0 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Skullcandy"
            },
            {
                "name": "Model Name",
                "value": "BT_CRUSHER_EVO"
            },
            {
                "name": "Color",
                "value": "True Black"
            },
            {
                "name": "Form Factor",
                "value": "Over Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless, Wired"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Gil Selinger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOMIXW7EOWABBEUXC6LBCOB76AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R166DYME31U9TY?ASIN=B08FCGH2RL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing headphones at this price",
                "reviewText": "These are great headphones. As a professional musician, I am concered with hearing everything clearly. The fact that they test your hearing and adjust levels based on that is fantastic. The bass is a bit gimmicky but it is a super mega bass and you have a lever to turn it from off to way overboard full. Otherwise though the sound is punchy and balanced, espically impressive are the mids which usually get lost in less expensive headphones. The battery life is also insane, I've had these for 3 weeks and have been listening for a few hours every day and have yet to need to recharge the headphones. I still am at 35% after 22 days of listening, Incredible. I got these a flash sale a month ago for half price, so just a great deal. I've had other skull kandy earphones since I first discovered them about 12 years ago and they have always punched way above their price point. I had a pair of $10 plug in wired ear buds back in the day that were quite excellent too and were 85% as good as the $200 super high end ones I tried out back then...",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arkten Arachlassair",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXBJQLXJR2YZCVEKO5ZT6L7KUJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R353SROP7DA5WX?ASIN=B08FCGH2RL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2022",
                "reviewTitle": "5.0 out of 5 stars Best headphones I've ever had",
                "reviewText": "First of all, a bit about me that's relevant. Idk if I'd call myself an audiophile per say, but, my range of hearing is fine to the level of better than most musicians.Nothing messes with me more than when I have a cheap pair of headphones which interfere with what I'm listening to.... If their cheap and they distort the sound, or, are insane with treble so as to be piercing, I'll notice and it'll probably be painful to my ears. Most of the audio ranges I hear are at the - 10 range, meaning, almost perfect hearing.That means, even on a $20 set of headphones, I'll probably use them because of necessity, but hate the experience because of how much they interfere with my experience since I can tell if there's a quality issue even at a very fine degree, I'll find it and it'll bug me, and, given that I have headphones on most of they day and listen to things frequently, it's important that I buy quality headphones.So, I'm no stranger to Skull Candy. Their audio quality is the best of all the headphones I've had over the decades. The issue which always has me hesitant to buy them is a matter of durability.Most of my less expensive Skullcandy headphones have broken very easily, which sucked when I was on the go... It was to the point which I was hesitant to buy these headphones because of similar fears and the price...That said, these headphones were an investment, and and investment that panned out.I've been using the Crusher Evo headphones for more than a year now, constantly, daily, most of the day and even when sleeping, so, this review is based on almost 24/7 usage for more than a year... And...They're still working amazing, the battery life is still phenomenal, the advertising that states they're able to play for hours on a charge of only a few minutes is absolutely true too. I've accidentally stepped on them, I've slept with them on most nights, and nothing has happened except that, after such heavy usage, today one of the earpads got a tear around the edge that tucks under the plastic of the headphones which... Thankfully, they sell replacements for the foam.The product is sturdy, has a very nice feel, solid, durable weight and plastic, the foam wraps around the ears nicely, and I can easily get a proper, snug fit every time which, I have a big-ish head and long-ish ears, so, that's not something that's easy for me usually.Not only are they extremely comfortable and scream quality from their physical aspects, but it came with a rugged carrying bag and nice aux chord, and extremely high quality long charging cable. It didn't come with a charging brick, but has worked with all the charging bricks I've used on them, including my Nintendo Switch charger.Now, all that's fine... Being the most durable and comfortable feeling headphones is important... But, headphones can feel amazing, but have Crap sound quality so, that's the aspect I love the most about these... That sound quality.... One word... Amazing...So, everything sounds accurate, there's no distortion and, even having been playing things at max volume for a year straight, there's still no distortion and everything sounds just as amazing as they used to. One of the aspects I love is the bass...That's another thing I need to be spot on with headphones, bass. They could be clear, have accurate sound and everything, but of there is no bass, or the bass is very weak, I physically can't use the headphones... That's how important bass is to me... Furthermore, accurate bass is a necessity. Idk how many pairs of headphones I ended up chucking into the bin because, yeah, they had powerful bass, but that bass wasn't accurate, and that bass lead to the rest of the sounds being obscured/distorted/sounding like someone is talking normally right next to a sub-woofer.These headphones play the bass loud, accurate, and do so without compromising the quality of the rest of the audio... And... Holy gods.... I was startled to the point the headphones flew off my ears by how powerful the bass is when you adjust the slider on them to max bass boost... Why? They vibrated intensely. Not in a bad way, as in, when you have them on and the bass hits and vibrates the speakers, you won't be bothered by it/it won't cause an unpleasant feeling, but it is there and.... Idk... I find I like it because it's a part of the engineering of the headphones and not an unintended result.That said, these are, by far, the best audi investment I've ever made. I have used them constantly for a full year extremely heavily, and they're still here and working just the same. By contrast, previously, I'd have gone through 5/6 pairs of other headphones by Now, so.... If you can afford these, get them.They are technically a headset unit, and actually prefer to take calls with them, but, I can't tell you if the microphone quality is the best, just that I haven't had any complaints from anyone, so, given that even with the best microphone on prior headsets, I got complaints, I'd imagine that is also good with these headphones because, I have never gotten a complaint or someone saying \"You're breaking up. What did you say?\".These will be used when I get back to mixing tracks and making music when I fix my computer, that's how good they are.Tl;Dr - Worth it.",
                "reviewVotes": "263 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Olympusmons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQUEBN3MFU2VEN3TCI47TRTQHXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32T26HS9LWBNS?ASIN=B08FCGH2RL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Good Sound Quality",
                "reviewText": "Venturing into the world of audio bliss, I embarked on a journey with the Crusher Evo headphones, a wise purchase at the delightful price of $149. Brace yourselves; these headphones are about to take you on a symphonic rollercoaster.As I immersed myself in the auditory realm, it became evident that these headphones possess a rare gift - the power to transcend their humble price tag. The sound quality is nothing short of extraordinary. It's as if each note and beat is meticulously sculpted, and the bass, oh, the bass, it's a revelation. If you're a bass aficionado like me, these headphones will make your heart skip a beat.But hold on, they're not merely a one-trick pony. Some skeptics may have doubted their versatility, but I found these headphones to be quite the musical chameleons. Whether it's classical compositions or bass-thumping hip-hop, they adapt with grace.Now, let's address the comfort factor. They do carry a little extra weight and possess a snug clamp, but fear not, it's a minor compromise in the pursuit of musical ecstasy. Extended listening sessions? No problem.The build quality adds another layer of satisfaction. These headphones feel like they could withstand a few lifetimes of musical adventures.And then there's the battery life, a revelation in itself. Going beyond a week without recharging is akin to discovering an oasis in the desert of daily charging routines.Now, here's a fun twist - they might not be the go-to choice for audiophiles with ears finely tuned to unearth every audio nuance. But for us regular mortals, they are nothing short of a sonic revelation. These headphones may not grant superhuman hearing abilities, but they sure make the rest of us quite content.In conclusion, my journey with the Crusher Evo headphones has been a symphony of surprises. Priced at a mere $149, they deliver an audio experience that defies expectations. From exceptional sound quality to versatility, durability, and a battery life that seems almost magical, these headphones have left me humming with delight. The minor quirks of weight and clamp can't overshadow the value they offer. So, if you're looking to elevate your audio experience without breaking the bank, these headphones are your golden ticket to musical nirvana.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 26, 2024",
                "reviewTitle": "Mi opinión",
                "reviewText": "Los audífonos son increíbles, es la primera vez que compro unos audífonos de gran calidad y tenía la duda si valían la pena, y totalmente si valieron la pena, son increíbles, los uso diario para ir a la universidad y al gym, le dura bastante la batería tenía una semana sin cargarlos desde que me llegaron, me impresionaron los bajos son muy potentes y está increíble, su cancelación de ruido es increíble, no oyes nada, hay que tener cuidado si estás en la calle, y está perfecta la aplicación para modificar los sonidos, nada más un punto que hay que tener encuenta, es que no son aprueba de agua si sudas mucho como yo en el gym limpien bien su sudor para que no le caiga el sudor pero si aguantan una que otra gotilla (cierta cantidad de sudor) no pasa nada",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ricardo Augusto Mett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 19, 2023",
                "reviewTitle": "Produto completo",
                "reviewText": "Produto com um som de qualidade ótima…Sem contar o sistema de grave, realmente a melhor opção para quem gosta de treinar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lauriane Tremblay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 7, 2023",
                "reviewTitle": "The bass made me giggle",
                "reviewText": "I read over and over again about the bass, I knew it would be good, but I didn't know just what exactly I was getting into. Songs I've been listening to for years now feel completely different and my neighbors are probably wondering why I kept giggling for a good hour as the bass shook my brain like fresh popcorn. The app is great, the headphones didn't connect right away so be patient with it, it took me a few minutes before the app finally recognized the device, but the personalized sound is awesome, I fear going back to my earbuds will feel like a downgrade now. If you're hesitant about getting these headphones, please don't, they're worth it",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Devin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 11, 2022",
                "reviewTitle": "Awesome headphones! Eye rattling BASS!",
                "reviewText": "If you want ridiculous bass for music or gaming or movies these are the right choice, the bass is completely ridiculous. Even on the lowest it is pretty intense but at full blast some songs rattle my eyeballs, no joke. I'm not an audiophile so i can't tell you if these are great sound quality wise but they are the best headphones I'VE ever had. Battery life is great too, 40 hours on a single charge, and if they die, you plug them in to charge and the 1st 10 minutes gives you 3 hours of emergency listening, I've only had them run out once and that was after a few days of gaming and I forgot to charge them. The charger is usb c(into headphones)to usb a(into laptop, pc, phone charger, etc.). They look nice too and they are comfy. They also come with a 3.5 mm to 3.5 mm cord one end plugs into the headphones the other into device. Bluetooth works great and I've never had a signal drop when I'm anywhere in my apartment, i tried going downstairs and out of my building(I'm on the third floor)and they actually worked for a bit, then it got spotty and then the connection dropped entirely so I'd estimate the max range is maybe 15-30 metres or 50-100 feet? The ear cups are soft and comfy and removable. There's also an app that works for these but i haven't used it much. These headphones are compatible with the \"Tile\" system so if you lose them you can use that to find them. Phone calls can be answered and ended with a press of the centre button on the right side of the back of the ear cup and that's where the volume buttons are too, you can skip music tracks too. The left ear cup has the power/pairing button and the BASS slider, the slider goes from ridiculous to straight ludicrous. The bass will probably make me deaf in the long run but it was worth it. Great headphones. The bass is ACTUALLY insane, it's not just marketing hype. I don't think these have ANC but the bass is so intense i can't hear anything anyways. The only thing i noticed that i don't like is when i have them connected with the included 3.5 mm audio cord there is a high pitched whine, it can only be heard when there is no music or audio playing so i didn't take a star off but i wanted to mention it so maybe Skullcandy could fix it with the next model. And I'm seeing seeing a few reviews saying they break easily? Any headphones will break if you sit on them. I've had mine since April 2021 and they work great still and aren't broken cause i haven't sat on them and if yours did spontaneously crack then I'm sorry. I saw review say that when he turned up the volume on his hifi stereo these distort then said that his other headphones(which cost $900), and i quote \"aren't afraid of the volume\" like, umm, OF COURSE your headphones that cost $700 more dollars than these will be better. But for this lowly peasant these will do.🤣",
                "reviewVotes": "47 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 17, 2022",
                "reviewTitle": "Muy buena opción de audífonos",
                "reviewText": "Muy buena calidad, hasta el momento me han gustado mucho, funcionan muy bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$129.99",
                "sellerName": "Real Deal sales",
                "sellerRating": "4"
            },
            {
                "price": "$129.99",
                "sellerName": "Just Right!",
                "sellerRating": "4"
            },
            {
                "price": "$139.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}