{
    "remaining_requests": 48718,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bose-QuietComfort-Wireless-Cancelling-Headphones/dp/B0CCZ1L489",
    "body": {
        "name": "NEW Bose QuietComfort Ultra Wireless Noise Cancelling Headphones with Spatial Audio, Over-the-Ear Headphones with Mic, Up to 24 Hours of Battery Life, Black",
        "price": "$379.00",
        "originalPrice": "$429.00",
        "rawPrice": 379.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bose-QuietComfort-Wireless-Cancelling-Headphones/dp/B0CCZ1L489",
        "soldBy": {
            "sellerID": "AJFLJ7J2AIXGD",
            "name": "Frontrow Tech LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AJFLJ7J2AIXGD&asin=B0CCZ1L489&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CJ3TJD1P"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CCZ1L489",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$379.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/312Gw7w4CVL._SS36_.jpg"
            },
            {
                "asin": "B0CCZ1HQ39",
                "variationName": "Color",
                "variationValue": "White Smoke",
                "price": "$379.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/31BsuGwJToL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/312Gw7w4CVL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31vOW4LQ8VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qgQsIwalL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31SNaXk8vXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/313szdJLvFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31sCzo4s91L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41IsH-Pw9KL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/621282ba-2df1-4168-893f-5d6b754eceed/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/81b132d6-bd4e-4716-9c95-f0348d2f8df9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d5a4c2d-ea05-492c-8d4b-f6d8f3a53f80/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/19614a82-77c1-4c8b-80a9-843e1a47ec68/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/21045731-8f26-4a7c-974a-9434f69d619c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/590713dd-04b3-4aa5-8c6f-1f984293720a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e440ff1b-221e-4186-9600-8e6ee90d689e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a7ed9e88-d23f-49cd-8cfe-609dfeac0452/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 8,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71OuuUlz0BL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1TYwVrSQiL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Bose Store",
            "link": "https://www.amazon.com/stores/Bose/page/9E24AFD5-B420-4859-BD2F-A993BA579B20?ref_=ast_bln"
        },
        "brand": "Bose",
        "merchantInfo": "Frontrow Tech LLC",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 929,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 13."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LEVELED-UP LISTENING: Bose QuietComfort Ultra Headphones with spatial audio give you an immersive experience that makes music feel more real; CustomTune technology offeres personalized sound, shaped to you",
            "WORLD-CLASS NOISE CANCELLATION: These noise cancelling headphones feature Quiet Mode, Aware Mode and Immersion Mode, which combines full noise cancellation and Bose Immersive Audio",
            "CRYSTAL CLEAR CALLS: Microphones focus on the sound of your voice and the noise cancelling headphones with mic filter out background noise for the clearest phone calls of any Bose headphones",
            "ELEVATED DESIGN, LUXE COMFORT: Soft ear cushions hug your ears, the band spreads pressure evenly and elevated materials let you make a statement with these noise cancelling over-the-ear headphones",
            "BLUETOOTH WIRELESS HEADPHONES: Advanced Bluetooth 5.3 offers connection within 30 feet of your device; SimpleSync allows you to sync with a Bose smart soundbar so you can listen to TV at your own volume",
            "24-HOUR BATTERY LIFE: Listen longer with up to 24 hours of battery life (up to 18 hours with Immersive Audio), a 15-minute charge offers up to 2.5 hours of play time (up to 2 hours with Immersive Audio)",
            "CONNECT AND CONTROL: Touch controls on each earcup allow you to change volume, skip tracks, answer calls and change modes; you can also turn the Bluetooth headphones on/off simply with head motions"
        ],
        "description": "Bose QuietComfort Ultra Headphones take everything music makes you feel to new highs. The high-end headphones start with world-class noise cancellation that’s quieter than its predecessors. Breakthrough spatial audio headphones allow your music to feel more immersive than ever before. Bose Immersive Audio takes what you’re hearing out of your head and places it in front of you for the most natural listening experience, no matter the content or source. CustomTune technology upgrades sound even more by analyzing your ear’s shape and adapting the audio performance so everything you listen to hits exactly as it should. Noise cancelling headphones with mic feature a revolutionary system of mics that focus on your voice, allowing you to enjoy crystal clear phone calls. These noise cancelling over-the-ear headphones keep the session going with up to 24 hours of battery life (up to 18 hours with Immersive Audio) and unrivaled comfort from luxe materials. The earcups wrap your ears in a soft hug while the band spreads pressure evenly. The sleek metal arms add a statement of sophisticated design for ideal audiophile headphones. Sync sound between your QC Ultra Headphones and a Bose smart soundbar with SimpleSync technology. The headphones also feature Snapdragon Sound Certification for Android and quick pairing with Google Fast Pair. Connect these wireless Bluetooth noise cancelling headphones to your devices with advanced Bluetooth 5.3. Keep track of what you have paired in the Bose Music app. The app makes setup quick and easy, gives you access to Adjustable EQ settings and more.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b?ie=UTF8&node=172541"
            },
            {
                "name": "Over-Ear Headphones",
                "link": "https://www.amazon.com/Over-Ear-Headphones/b?ie=UTF8&node=12097479011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2 x 5.5 x 7.7 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.56 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CCZ1L489"
            },
            {
                "name": "Item model number",
                "value": "880066-0100"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 929 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#470 in Electronics (See Top 100 in Electronics) #28 in Over-Ear Headphones"
            },
            {
                "name": "Date First Available",
                "value": "September 14, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "Bose"
            },
            {
                "name": "Charging Time",
                "value": "3 Hours"
            },
            {
                "name": "Units",
                "value": "1.0 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "Bose"
            },
            {
                "name": "Model Name",
                "value": "Bose QuietComfort Ultra Wireless Noise Cancelling Headphones, Over-the-Ear Headphones with Mic, Up to 24 Hours of Battery Life, Black See more"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "Over Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless, Wired"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Sound just got real Bose Immersive Audio Bose Immersive Audio push the boundary of what it means to listen. For you it means music that sounds realer than ever before. World-class noise cancellation Bose Noise Cancellation Find a mode for your musical mood with Bose Quiet, Aware and Immersion Modes.",
                "media_link": []
            },
            {
                "media_text": "Leveled-up listening Featuring breakthrough spatialized audio technology for personalized sound makes your music feel more immersive than ever before. It’s everything music should make you feel taken to new highs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5407c6de-5b15-4664-9c5f-682e5ee02a7e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Compare Bose Headphones QuietComfort Ultra Headphones QuietComfort Headphones QuietComfort 45 Headphones Audio Quality Breakthrough Spatialized Audio Audio Quality High-Fidelity Audio & Adjustable EQ Audio Quality High-Fidelity Audio & Adjustable EQ Battery Life Up to 24 Hours Battery Life Up to 24 Hours Battery Life Up to 22 Hours Bluetooth 5.3 Bluetooth 5.1 Bluetooth 5.1 Luxurious Comfort Durable, All-Day Comfort Durable, All-Day Comfort Features Quiet, Aware & Immersion Modes, Wind Block, CustomTune, Snapdragon Sound Features: Quiet & Aware Modes, Wind Block, Audio Cable With In-Line Microphone Features: Quiet & Aware Modes",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ba371d8f-b8f0-4c2e-b27f-c2fd3e12764c.__CR0,0,300,225_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3b36f051-4256-4215-8032-312bd8e2c0cc.__CR0,0,300,225_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/859ac505-35ae-4eec-a5cd-7402b544f5fb.__CR0,0,300,225_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "How do I setup my QuietComfort Ultra Headphones? Download and install the free Bose Music app from your mobile device's app store. The Bose Music app lets you set up and control your product from any mobile device, such as a smartphone or tablet. How do I connect my QuietComfort Ultra Headphones to my Bluetooth device? 1. Ensure Bluetooth is enabled on your device 2. With your headphones on, press and hold the Bluetooth/Power button until you hear \"Ready to connect\" 3. Select your headphones from the list of available devices How do I update the firmware/software of my QuietComfort Ultra Headphones? To update your product, you can either connect it to a computer with a USB cable and then visit the Bose update site or you can update it wirelessly from the free Bose Music app on an Android or iOS device. How do I reset my headphones? 1. Connect the USB cable to a plug/port 2. On your headphones, press and hold the Power/Bluetooth button 3. Whilst holding the button, connect the USB cable to the right earcup. Power light will blink twice 4. Wait two seconds then release the button How do I clear the Bluetooth pairing list? 1. Press and hold the Bluetooth/Power button and Multi-function button until you hear “Bluetooth device list cleared. Ready to connect.” 2. Delete your headphones from the Bluetooth list on your Bluetooth device",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/00c2f95b-da9e-496c-bacf-7fa940817344.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/01f10a08-0bd0-493a-8ee0-9b425a6b5711.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5407c6de-5b15-4664-9c5f-682e5ee02a7e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ba371d8f-b8f0-4c2e-b27f-c2fd3e12764c.__CR0,0,300,225_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3b36f051-4256-4215-8032-312bd8e2c0cc.__CR0,0,300,225_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/859ac505-35ae-4eec-a5cd-7402b544f5fb.__CR0,0,300,225_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Aluzion TV",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUIDLDIOAE4GTNEFYZ4HSFY52RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YP4ID328PUTK?ASIN=B0CCZ1L489",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Best Sounding Bose Headphones I Have Ever Heard!",
                "reviewText": "These are simply the best Bose headphones I have ever heard. Usually Bose has made headphones that are lacking in Bass and while that works for a lot of people, it never worked for me. Im happy to report that these headphones have really nice punchy bass and an EQ in the Bose Music App that you can tune these headphones to your exact liking.The app is good and all works well.- The Multi-Point connection takes a little time to understand how it works. You can have up to 2 devices connected at the same time, but you have to stop the audio on the first device before you can start the second device. Once you learn that it works great. *Within the \"Sources\" section of the Bose Music App you can mage all connected devices and I believe you can store up to 8 devices here. Each device will have an On/Off slider that you can choose to have active at the same time as your phone or main device.I like this because I have both of my TV's, My iMac, iPad and phone saved here and can choose which devices I want to listen to by turning on or off that specific slider.- The sound quality of these headphones is honestly what I have been looking for, for sometime.I listen to Dance and EDM a lot and these headphones sound amazing. Plenty of Bass that is clear and punchy. You can fine tune everything within the EQ section of the Bose Music App. This is something that I honestly love about using these headphones. ALL HEADPHONES should have an adjustable EQ that stays with the headphones not just in an app.- The battery life has also been very good no complaints here.- The weight of these headphones is simply awesome for carrying around in my backpack and wearing them. It's almost like you're not wearing anything at all! Very comfortable and lightweight. I use them on the train everyday and I am very happy.- The case is also amazing. The headphones fold down and pack very nicely into this really nicely constructed case. It's also one of my favorite things about these headphones. Having a nice custom case from the manufacturer is where it's at. Aftermarket cases for most things tend to not have perfect fitment or build quality and can be bulky.There’s more but honestly I think I covered the most import things and I def recommend them.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSTD2AYMAB6WBEFIBFH4CIGZNNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RACOTB7LQ8ZGJ?ASIN=B0CCZ1L489",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Love these Bose",
                "reviewText": "These headphones are the best I have ever owned. They have the most effective noise cancellation of any over-ear models I have tried, and they also have amazing sound quality. The immersive audio mode creates a realistic and spacious soundstage that makes me feel like I’m in a live concert. The headphones are also very comfortable and lightweight, and they have a long battery life. They support the AptX Adaptive codec for high-quality streaming on compatible devices, and they also work as a Bluetooth speaker. The design is sleek and elegant, and the materials are premium and durable.I gave them 5 stars because they are worth every penny. They are easy to use and work flawlessly. They are the perfect headphones for anyone who wants to enjoy music and shows without any distractions. They are a huge upgrade over previous models and a strong competitor in the market. I would recommend them to anyone who loves sound and noise cancellation. 😊",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MichaelMichael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFNIYBZ7EMW3CTBLV2E75KRRI3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VCE67YU7ENPU?ASIN=B0CCZ1L489",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Bose Does it Again",
                "reviewText": "Let me start by saying, I am an audiophile and I am constantly trying new headphones and new audio technology. In my opinion, Bose still stands far above the competetion in most catagories. The crisp sound, unmatched comfort, and superior noise cancelling set these QuietComfort Ultra headphones apart from everything I have used. I travel a lot for work and I am constantly grabbing this headset for the airport, loud flights, and just leisure music listening.Design:As you take the Bose QuietComfort Ultra headphones out of the case you will immediately note that it has the same sleek curves and overall clean appearance of a Bose product. The case fits the headphones perfectly with enough room for small accessories like a charging and auxiliary chord.Comfort:These are easily the most comfortable pair of headphones I have ever used. The ear cushions are made of the distinct Bose memory foam and they are fully adjustable to any head size. I wore them on a 8-hour long-haul flight and my head didnt hurt or have suction/red marks from overuse. I was incredibly impressed.Intuitiveness:The controls and simplicity of the button layout is something that I really started to like. The volume is a simple swipe up or down on the side of the headset and the multi-function button is intuitive and does exactly what you would expect. I found that using the app for things like connecting bluetooth and adjusting sound modes worked better than pressing buttons on the headphones themselves.Battery Life:My only small complaint is that using Active Noise Cancelling (ANC) and playing louder music, the battery tends to drain somewhat faster than I expected. After a full charge I find that the headset will drop to 60-70% fairly fast. That being said, the battery has never run out on me, not even once.Noise Cancelling:This headset is far and away the best noise cancelling I have ever experienced with headphones, and I have tried all the major brands. I would say the ANC is slightly better than previous generation Bose headsets. Also, I did not notice fatigure or ANC induced headaches, which is a huge plus. I feel like you can literally enter your own quiet world in a busy space like an airport or aircraft, and for me that is everything.Overall:This headset is the marquee of excellent sound quality, unmatched comfort, and the best noise cancelling on the market. The headset looks great on your head and sounds even better than it looks. Bose does it again.",
                "reviewVotes": "43 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wANkUzyCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wJf0y7uSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71yiqX8moBL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allan J. Blitzstein",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 15, 2024",
                "reviewTitle": "Sound, comfort and fit!",
                "reviewText": "You’ve got it all in these outstandingheadphones. The immerse feature isreally impressive!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jess",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 13, 2024",
                "reviewTitle": "Muy Sobresaliente",
                "reviewText": "Bose realmente se lució con estos audífonos. Soy un usuario frecuente de la marca y mis anteriores audífonos son unos QC35. La calidad de la cancelación de ruido es asombrosa y supera en mi opinión a los Airpods Ultra. Vale la pena cada peso que inviertes en este equipo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mauriziomaurizio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 5, 2024",
                "reviewTitle": "Grandi cuffie wireless: grande suono in stile Bose",
                "reviewText": "Permetto che è la prima volta che mi affido a modo un paio di cuffie wireless serie quindi la recensione sarà inevitabilmente influenzata dal fatto che non ho molti termini di paragone! Detto questo però posso dire che il suono di queste Bose è veramente bellissimo: caldo dettagliato e piacevolissimo su tutta la gamma delle frequenze.l’isolamento da rumore non comporta quella sensazione di ascolto o ovattato che spesso si verifica con altre cuffie soprattutto in ear. si connettono immediatamente al telefono indicando con un messaggio la percentuale di batteria rimasta che peraltro può essere visualizzata anche attraverso l’apposita app. La modalità di ascolto immersi dal mio punto di vista non aggiunge niente di particolarmente interessante rispetto al suono naturale così come esce dal dispositivo. Sui padiglioni sono presenti dei tasti che consentono di mettere in pausa, passare al brano successivo o tornare a quello precedente oltre che una zona in cui scorrendo il dito è possibile alzare o abbassare il volume. Un tasto inoltre permette il passaggio da una modalità all’altra di ascolto: è infatti possibile scegliere un maggiore o minore grado di dal mio punto di vista restituisce un ascolto più naturale perché evita la necessità di comprimere le cuffie sulle orecchie. Anche l’archetto così come i padiglioni stessi è imbottito di materiale che rende estremamente confortevole tenere le cuffie addosso anche per un tempo prolungato sebbene io non abbia fatto mai sessioni di oltre un’ora. Se devo proprio proprio trovare un aspetto migliorabile lo riscontro nell’applicazione soprattutto per quanto riguarda la parte relativa alle equalizzazione che avrebbe potuto essere un pochino più curata e capace di modificare un numero maggiore di parametri. Molto valida anche la possibilità di poter ripiegare sul loro stesse le cuffie riducendo di almeno 50% lo spazio occupato dalle stesse.buona, gradevole e al tatto e funzionale in termini di protezione la custodia che oltre ad ospitare le cuffie consente anche di riporre i due cavi in dotazione (cavo di ricarica e jack da 3,5 mm). In conclusione devo dire che da quando ho queste cuffie ho aumentato molto l’ascolto consapevole di un gran numero di album (motivo per cui ho fatto questo acquisto).se pensate di utilizzarle immobilità e non volete rinunciare ad una qualità audio importante penso che malgrado il prezzo possano fare al caso vostro! se questa recensione vi è stata utile vi chiedo la cortesia di IndyCar cliccando sulla apposito tasto qui sotto sotto sotto! Grazie!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61aNz-EGmZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710VOdAG-3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71cs8lZ5yBL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "H. ScheeroorenH. Scheerooren",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 7, 2024",
                "reviewTitle": "ANC ist überirdisch",
                "reviewText": "Andere (kabelgebundene) Kopfhörer, die ich besitze, sind von höherer audiophiler Qualität in Preisklassen von 800 Euro und mehr.Ich habe auch einige Erfahrung mit kabellosen Kopfhörern wie dem bekannten WH-1000XM4 und auch kabellosen TWS-Ohrhörern mit ANC von sehr bekannten Marken.Ich war nie wirklich ein Fan der Marke Bose, aber ich hatte viel Gutes über diese QuietcComfort Ultra gelesen und es gibt jetzt auch viele Erfahrungen auf Reddit.Die häufigste Beschwerde ist, dass dieser Ultra fast 100 Euro mehr kostet als die anderen Modelle.Glücklicherweise konnte ich ein gutes Amazon Black Friday Angebot nutzen.Ist der höhere Verkaufspreis gerechtfertigt? Ich denke schon.Zunächst einmal ist das ANC überirdisch gut, so gut habe ich es nicht einmal bei XM4 und XM5 gehört.Bässe und hohe Töne sind bereits standardmäßig großartig, und wenn es einem nicht gefällt, kann man mit der mitgelieferten App den Klang nach eigenem Geschmack einstellen.Auch die immersive Audiofunktion ist einfach großartig, neben zahlreichen anderen Erfindungen.Ein \"Nachteil\" ist nach Meinung vieler, dass der verwendete Kunststoff ein \"Magnet\" für Ohrenschmalz und Fingerabdrücke ist. Ich habe dieses Problem für mich selbst reduziert, indem ich den Kopfbügel mit 3M-Folie beklebt habe, wodurch auch ein einzigartiges Aussehen und Gefühl entsteht.Außerdem verleihen die hochwertigen Metallbügel und -scharniere diesem Kopfhörer glücklicherweise ein hochwertiges Aussehen, und im Gegensatz zum WH-1000XM5 lässt er sich in der mitgelieferten Tasche gut zusammenfalten. Positiv ist, dass die Ohrmuscheln nicht knarren oder quietschen wie bei der Konkurrenz in dieser Preisklasse.Die Akkulaufzeit ist aufgrund der Standby-Funktion etwas kürzer, aber dafür bietet er den Luxus der automatischen Wiedergabe in Kombination mit der Ohrerkennung.Wenn man sich erst einmal daran gewöhnt hat, versteht man, warum alles so konstruiert ist und fängt an, sich damit anzufreunden. Gewöhnungsbedürftig ist auch der Touch-Control-Lautstärkeregler - entweder man mag es oder man mag es nicht. Ich finde, es ist eine natürliche Steuerung und sie funktioniert sehr gut.Alles in allem kann ich sagen, dass ich mit diesen Kopfhörern sehr zufrieden bin.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/518gZSXtLcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71EeVuqdsFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "SG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on January 26, 2024",
                "reviewTitle": "A good product that's been updated.",
                "reviewText": "If you have used the 45 before then you're going to love this one. Every single thing is better. Really love the updated sound. Sound quality and faster charging are my favourite improvements.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$379.00",
                "sellerName": "WORLD WIDE STEREO",
                "sellerRating": "5"
            },
            {
                "price": "$379.00",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            },
            {
                "price": "$379.00",
                "sellerName": "Frontrow Tech LLC",
                "sellerRating": "5"
            }
        ]
    }
}