{
    "remaining_requests": 48764,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Waterproof-Over-Ear-Headphones-Wireless-Cancelling/dp/B07V225763",
    "body": {
        "name": "Waterproof Over-Ear Headphones,V5.0 HD Stereo Sound Wireless Headphones with Mic, Passive Noise Cancelling Headsets for Gym Running Workout Men, Women",
        "price": "$19.99",
        "originalPrice": "$24.99",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Waterproof-Over-Ear-Headphones-Wireless-Cancelling/dp/B07V225763",
        "soldBy": {
            "sellerID": "A3MAW04P0P71GA",
            "name": "BroHonor",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3MAW04P0P71GA&asin=B07V225763&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BKZ8KHY6"
        ],
        "asinVariationValues": [
            {
                "asin": "B07V225763",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$19.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/417-ed-xGZL._SS36_.jpg"
            },
            {
                "asin": "B0B4JWZR7H",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$19.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/311WDl+iKKL._SS36_.jpg"
            },
            {
                "asin": "B0B4JQBQXJ",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "$19.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41grX7pwI6L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/417-ed-xGZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41o0ywM-4hL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nlZG3CFML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vmErwYLkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/414AxctR9HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kItAjQyPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HUtnZuFHL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: SUMEE",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=SUMEE"
        },
        "brand": "SUMEE",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 2334,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 14 hrs 19 mins",
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35. Order within 11 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Much Better Sound - Powerful speaker with the BT 5.0 technology. High quality built-in microphones software and HD sound technology, offer you high fidelity stereo music with deep bass and crystal clear speech when you listen to music or watch movies.",
            "Hand-free call & Built in Mic - Provide a quick and stable connection with your BT enabled devices like cell phones, tablets, PC, TVs within 33 feet, with a high-quality built-in microphone for hands-free calls, which is convenient for you to free yourself from wires.",
            "Both Wireless and Wired Mode - BT headphones can work well both in wire and wireless mode. Battery can be used 20-hours music time/ talking time in a single charge for wireless mode. You can also use it as a wired headphone with the provided audio cable so the headphones will never power off.",
            "Upgraded Soft Ear Cushions - Comfort with the professional protein earmuffs, More durability and comfort, enjoy high-quality, long-listen comfort, skin texture, light weight, comfortable around-ear fit you can wear all day long. Gentle Reminder: please take off the headphone every 2-3 hrs to get your ears relax, in order to get better hearing enjoyment, and keep the head comfortable.",
            "We offer good customer service. If you have any question, please feel free to contact us."
        ],
        "description": "Our Bluetooth headphones is a amazing headphone designed for a happy life, It is suitable for everyone, grown-up, students, kids or teenagers. It is a great option as a gift to your loves as you can share the joy to you friends and family.Immersive Hi-Fi SoundDesigned for an excellent listening experience, Bluetooth headset with CSR chip and around-ear cushion design can provide robust, immersive and Hi-fidelity sound.Advanced CompatibilityThe Bluetooth headset can easily and quickly connect with smart phones, tablets, TVs and other Bluetooth devices within 33 feet, bringing you crystal clear sound effect. Please make sure the driver software of receiving adapter is fully updated when connected to PC or laptop, and you need a separate Bluetooth adapter when connected with TV.Foldable and Portable DesignThe foldable design makes it easy to store them when not in use or during travels. The stainless steel slider headband allows you to find the perfect fit and provide excellent durability.Dual mode: Wireless &WiredIn the wireless mode: With a built-in Lithium-ion polymer rechargeable battery which provides 10 hours' continuous wireless playback and let you get rid of the tangled cables on the move.In the wired mode: Used as a wired headphone with an audio cable.Product SpecificationBluetooth Version: 4.2Range: 33 feet (10 meters)Talking Time: Around 10 hoursStand-by Time: Around 250 hoursCharging Time: 4 hoursCharging Voltage: 3.7VBattery Type: Rechargeable lithium polymer.Battery Capacity: 420mAhWeight:0.55lbs",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Headphones, Earbuds & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=24046923011"
            },
            {
                "name": "Headphones & Earbuds",
                "link": "https://www.amazon.com/Headphones-Accessories-Supplies/b?ie=UTF8&node=172541"
            },
            {
                "name": "Over-Ear Headphones",
                "link": "https://www.amazon.com/Over-Ear-Headphones/b?ie=UTF8&node=12097479011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6.5 x 3.6 x 7.1 inches"
            },
            {
                "name": "Item Weight",
                "value": "9.52 Ounces"
            },
            {
                "name": "ASIN",
                "value": "B07V225763"
            },
            {
                "name": "Item model number",
                "value": "D-422"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 2,334 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,527 in Electronics (See Top 100 in Electronics) #374 in Over-Ear Headphones"
            },
            {
                "name": "Date First Available",
                "value": "July 9, 2019"
            },
            {
                "name": "Manufacturer",
                "value": "ACSUN"
            },
            {
                "name": "Charging Time",
                "value": "4 Hours"
            },
            {
                "name": "Units",
                "value": "1 Count"
            },
            {
                "name": "Number Of Items",
                "value": "1"
            },
            {
                "name": "Brand",
                "value": "SUMEE"
            },
            {
                "name": "Model Name",
                "value": "D-422"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Form Factor",
                "value": "Over Ear"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless, Bluetooth 5.0"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Daniel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF53DJFPYFWYK7ZCMGDI2KKNLT4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTF0HHS2WAU23?ASIN=B07V225763",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2020",
                "reviewTitle": "5.0 out of 5 stars One of the best, cheapest headphones out there to date.",
                "reviewText": "I'm a headphone enthusiast. Although, I have been through my fair share of headphones and earphones, I can definitely say without a doubt that these headphones are one of the best ones I've had. I had always bought Beats headphones because honestly I was buying the brand so people knew I was wearing trendy headphones but after a few uses of the Beats studio 3 wireless, the cushion started to peel off. Not only that, it affected the audio and it sounded mushy and really bad. It was hurting my ears. Yes, they were comfortable but after a long time they started to feel uncomfortable. Anyways, back to these headphones. In terms of cushion, it doesn't peel at all. I am a very sweaty dude and every headphone and earphone has stopped working after a few months because of sweat (I'm guessing) but these really did last long. They are rather uncomfortable, my left ear always ends up hurting the most even when I adjust them so the only issue I have with them is that when I'm trying to relax they always end up hurting my ear when I wear them too long.The sound is crisp and clean. I was honestly expecting a raunchy sound from cheap headphones but boy oh boy was I incorrect. These headphones proved me wrong and they really show that even after workout sessions, they truly are a top quality headphone material.Noise cancellation was also very very good. I can barely hear anything even when my volume is rather low. It's a good thing when you're in a library trying to listen to your music at a somewhat silent rate and at the same time, not hearing people around you whisper to each other. It really does do its justice and lives up to its expectations.All in all, these headphones are amazing for such a cheap price. The sound is amazing, the ease of buttons is amazing, the fact that you can change the quality of sound is amazing, everything about these headphones are amazing. The only thing I would change is the comfortableness of the cushion because they kinda hurt after a while. Maybe it's my ears but hopefully for the next person they are okay with that feature. I recommend these headphones over any beats headphones out there without a doubt. Take it from me who spent about $320 on one pair. I could've bought these and extra pairs if another one stopped functioning rather than spending $200 on repairs for Beats. New buyers of sport headphones or any headphone users. PLEASE BUY THESE HEADPHONES! :D",
                "reviewVotes": "85 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shar shar ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5A6DMSA3DW3UT34J6TXC55MQ3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F92J6RQ9VJAM?ASIN=B07V225763",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2023",
                "reviewTitle": "5.0 out of 5 stars beats airpods any day",
                "reviewText": "so i think the age of me wearing airpods is over (just kidding, i have them on reserve for when these run out of battery) which prompted me to buy noise cancelling over-the-ear headphones. i was not disappointed.not only are these extremely stylish, but they're cheap too. for the quality put into these, i wouldn't be surprised if they were over twenty. alas, the poor kids are in luck. they're very generous when you put them on, and when they're off, you can hang them around your neck no problem. they're super comfortable as well, given that the plush leather on the inside keeps your ears from feeling muffled. now if only i had that but for my gaming headphones.the battery life lasts for quite some time and it's okay if you forget to turn off the headphones like i do on occasion because they do turn off automatically. if i had the space, i'd definitely buy another one just for the hell of it.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71btxMOlijL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71mKsJgtaXL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOJFTZB7XYOSN3HFUTZ7CQXIU3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PS201Z9071FO?ASIN=B07V225763",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2022",
                "reviewTitle": "4.0 out of 5 stars Great Gym Headphones Great Bass",
                "reviewText": "Model: Sumee D-422Pros:Great Bass! If your a bass head, get these!Bluetooth connects fastlightweight/Not bulkySticks to head while working outReversible. You can wear them backwards and nobody will know your wearing your headphones backwardsGranular volume control (granular yes.. but.. read cons)Cons:Buttons are loud when you click them. Not a big con... but for some people this may be annoying.Buttons are on the wrong side in my opinion. I wear them backwards and that solves the problem.Volume buttons are somewhat annoying as you have to hold them down and have fast enough reflexes to stop at the right time.This is on-ear NOT over-ear, meaning, some other people might be able to hear what your listening to. Not a big con for me as I listen using low volume. This may be a big con for others.Not really a con.... but battery life is kind of short.. I've maxed it out once.. Maybe got 8-9 hours of listening.Treble is not as clean. Thats fine for me because treble hurts my ears and bass totally makes up for it!Other Throughts:Headphone technology has came along way. As small as these headphones are, its shocking how much bass they have! These headphones are amazing!",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH56OBKOKZ2IEKQV3XO6AZIS6XJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38NPSUU7CVMCY?ASIN=B07V225763",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars great headphones",
                "reviewText": "left them in the car for two to three days and still had enough charge for the gym for a couple of hours. Once i started to play my music I heard absolutely nothing. The best headphones for the price.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eli",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZITRDQNP7Q3RN63ZFOPHOMIFOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CFJAV7POV9WH?ASIN=B07V225763",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 3, 2021",
                "reviewTitle": "3.0 out of 5 stars Not bad",
                "reviewText": "You get what you pay for. It's a cheap pair of headphones and they do the job. Best part is that they do actually fit over the ear completely, and are pretty comfy. The sound quality isn't bad, a lot better than I expected. I bought it hoping it would have a decent amount of noise cancellation, which it did not. Barely any at all. Pretty disappointing.Over all, not bad. But I was extremely disappointed when I opened the package and found a paper promising a 10 dollar amazon gift card if I gave it a five star review. That's incredibly scummy, and definitely contributed to the overwhelming amount of positive reviews that do not hold up once you try the product.",
                "reviewVotes": "48 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$21.99",
                "sellerName": "Telustyle",
                "sellerRating": "5"
            }
        ]
    }
}