{
    "remaining_requests": 40295,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Apple-MX532AM-A-AirTag/dp/B0933BVK6T",
    "body": {
        "name": "Apple AirTag",
        "price": "$24.00",
        "originalPrice": "$29.00",
        "rawPrice": 24.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Apple-MX532AM-A-AirTag/dp/B0933BVK6T",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "15",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/314YPlM dcS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31-aH0bzOSS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-6Scr6lwS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41TO7qTMkeS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41i44CHxbXS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pxCWSRdyS.jpg",
            "https://m.media-amazon.com/images/I/51r7k-fWL2L._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/79fc1ea7-1a01-4c3b-b72f-bfda142b9167/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Apple Store",
            "link": "https://www.amazon.com/stores/Apple/page/77D9E1F7-0337-4282-9DB6-B6B8FB2DC98D?ref_=ast_bln"
        },
        "brand": "Apple",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 167721,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 34 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Keep track of and find your items alongside friends and devices in the Find My app",
            "Simple one-tap setup instantly connects AirTag with your iPhone or iPad",
            "Play a sound on the built-in speaker to help find your things, or just ask Siri for help",
            "Precision Finding with Ultra Wideband technology leads you right to your nearby AirTag (on select iPhone models)",
            "Find items further away with the help of hundreds of millions of Apple devices in the Find My network",
            "Put AirTag into Lost Mode to be automatically notified when it’s detected in the Find My network",
            "All communication with the Find My network is anonymous and encrypted for privacy, Location data and history are never stored on AirTag",
            "Replaceable battery lasts over a year",
            "AirTag is IP67 water and dust resistant",
            "Make AirTag yours with a range of colorful accessories, sold separately"
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Apple"
            },
            {
                "name": "Are Batteries Included",
                "value": "Yes"
            },
            {
                "name": "Number of Batteries",
                "value": "1 Lithium Metal batteries required. (included)"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            },
            {
                "name": "Item Weight",
                "value": "0.39 Ounces"
            },
            {
                "name": "In the Box",
                "value": "AirTags with CR2032 coin cell battery installed, Documentation"
            },
            {
                "name": "Accessories",
                "value": "Make AirTag yours with a range of colorful accessories, sold separtely"
            },
            {
                "name": "Precision Finding",
                "value": "Precision Finding compatible with iPhone 11, iPhone 11 Pro, iPhone 11 Pro Max, iPhone 12, iPhone 12 mini, iPhone 12 Pro, iPhone 12 Pro Max, iPhone 13 mini, iPhone 13, iPhone 13 Pro, iPhone 13 Pro Max, iPhone 14, iPhone 14 Plus, iPhone 14 Pro, iPhone 14 Pro Max, iPhone 15, iPhone 15 Plus, iPhone 15 Pro and iPhone 15 Pro Max. Testing conducted by Apple in March 2021 using preproduction AirTag units and software paired with iPhone 11, iPhone 11 Pro, iPhone 11 Pro Max, iPhone 12 mini, iPhone 12, iPhone 12 Pro and iPhone 12 Pro Max units running preproduction software. Battery life based on an everyday use of four play sound events and one Precision Finding event per day. Battery life varies with usage, environmental conditions, replacement battery manufacturer and many other factors; actual results will vary."
            },
            {
                "name": "Splash, Water, and Dust Resistance",
                "value": "AirTag is splash, water, and dust resistant and was tested under controlled laboratory conditions with a rating of IP67 under IEC standard 60529 (maximum depth of 1 meter up to 30 minutes). Splash, water, and dust resistance are not permanent conditions and resistance might decrease as a result of normal wear. Refer to the Safety and Handling documentation for cleaning and drying instructions."
            },
            {
                "name": "System Requirements",
                "value": "Requires iPhone SE, iPhone 6s or later, or iPod touch (7th generation) with iOS 14.5 or later, or iPad Pro, iPad (5th generation or later), iPad Air 2 or later, or iPad mini 4 or later with iPadOS 14.5 or later."
            },
            {
                "name": "Connectivity",
                "value": "Bluetooth 5.0 for proximity finding Apple-designed U1 chip for Ultra Wideband and Precision Finding NFC tap for Lost Mode"
            },
            {
                "name": "Speaker",
                "value": "Built-in speaker"
            },
            {
                "name": "Battery",
                "value": "User-replaceable CR2032 coin cell battery"
            },
            {
                "name": "Sensor",
                "value": "Accelerometer"
            },
            {
                "name": "Diameter",
                "value": "1.26 inches (31.9 mm)"
            },
            {
                "name": "Height",
                "value": "0.31 inches (8 mm)"
            },
            {
                "name": "Weight",
                "value": "0.39 ounces (11 g)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kadir Berkhan AKALINKadir Berkhan AKALIN",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGNFNKFAOF2SCLO6RL5LYTQY6YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27027C35FA1LW?ASIN=B0933BVK6T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Best thing should have it!",
                "reviewText": "The Apple AirTag is an absolute game-changer in the world of item tracking, and it unquestionably deserves a perfect 5-star rating. As an Apple enthusiast, I had high expectations for this tiny device, and it not only met but exceeded them in every aspect.Setting up the AirTag was a breeze. The seamless integration with the Find My app on my iPhone made the process effortless, and I had my AirTag up and running within minutes. The precision of location tracking is remarkable, and the ability to play a sound to help locate a misplaced item is a lifesaver.The design of the AirTag is classic Apple—sleek, compact, and aesthetically pleasing. The build quality is exceptional, ensuring durability and longevity. The IP67 water and dust resistance provide peace of mind, knowing that the AirTag can withstand daily wear and tear.One of the standout features is the Precision Finding with Ultra Wideband (UWB) technology. The directional arrows and distance indicators on the iPhone screen make it incredibly easy to pinpoint the exact location of the lost item. It's like having a personal radar for your belongings.The battery life is impressive, and the replaceable CR2032 coin cell ensures that the AirTag stays operational for an extended period. The low-energy Bluetooth connectivity strikes the perfect balance between efficiency and performance.The AirTag's versatility is another highlight. Whether it's attached to keys, placed in a wallet, or slipped into a bag, the AirTag seamlessly adapts to various items, making it a versatile solution for keeping track of all your essentials.Security is paramount, and Apple has implemented robust privacy features. The AirTag is designed with user privacy in mind, and the end-to-end encryption ensures that your location data remains secure and private.In conclusion, the Apple AirTag is a technological marvel that has simplified the way we keep track of our belongings. Its user-friendly setup, precise location tracking, sleek design, and privacy-focused features make it an absolute must-have for anyone in the Apple ecosystem. This product has earned its 5-star rating, and I wholeheartedly recommend it to anyone looking for a reliable and efficient item tracker.",
                "reviewVotes": "98 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/616D0A-Zk-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ClonseeClonsee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPQ5BAZE53M6FTPR2GGNZ7WSKAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JPVC92MCI3B6?ASIN=B0933BVK6T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Everything You Should Know Before Buying!!!",
                "reviewText": "Setting up the Apple AirTag is a breeze, it really takes no effort at all. Your phone guides you through the set-up process and you'll be done in less than a minute. A hassle-free experience right from the start.Changing the battery is super simple. The battery the Airtag uses is a CR2032 coin cell and the AirTag is actually battery efficient, lasting about a year. The process of changing the battery is a simple 3-step process: twisting off the cover, changing the battery (CR2032), and twisting the cover back on. After that, you could enjoy the peace of mind of never running out of power, until next year of course.Now, onto real-world use – it works exactly as you would expect. I personally use it on my AirPods, especially because the built-in tracker isn't dependable on the second-gen. I used to always misplace my AirPods but ever since I bought this AirTag last year, I've never misplaced my AirPods. To be honest, I sometimes look forward to not knowing where I put my AirPods so I could use the AirTag. Hearing the sound and using the precision tracking is oddly satisfying.The sound it blasts when you want to find it is super noticeable and loud. If you have a nearly quiet room, it's impossible to miss. Even if you don't use the sound, the precision tracking is AMAZING. It points you in the direction of the AirTag and tells you how many feet away it is. The software on the FindMy app is super sleek and easy to use.My only con is the lack of a feature for multi-level buildings. These AirTags can't tell if the airtags are above or below you on another floor so if you lost your item on a multi-level building, you would have to check floor by floor. Then again, with a bit of critical thinking and the use of precision tracking and the sound, it wouldn't add any struggle at all. But it would be a wonderful add-on for any future AirTags.IMPORTANT: Be aware that the appearance on Amazon may be a bit misleading; the actual AirTag is fully silvery/gray, not the black/dark gray and gray combination as advertised in the first product image. Not a deal-breaker for me, but worth noting. I speak from experience since I bought this thinking that I would get that design. Check my images for how they actually look.For me, this product isn't overly priced like many other Apple products. The functionality makes up for the price, especially since you'll never feel the frustration of losing the item ever again. I 100% recommend it and I know you'll love it!",
                "reviewVotes": "192 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51wb82M-xML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/816PZFlQreL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81FyeuTJNTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81STsHMejfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81SmRaHlZIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81XwZOif7QL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81r9HJpkPeL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chicago Dan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEMRVC4FH66OMPCCHMWCQTMARTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NN97IB08ZA61?ASIN=B0933BVK6T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars 📍🌐 \"Never Lose Sight: The Amazing World of AirTags!\" 🌐📍",
                "reviewText": "TLDR: 🌟🌟🌟🌟🌟 AirTags: Tiny tech wonders making 'lost and found' a thing of the past! 📍🔍Setting up an AirTag? A breeze! Just pop off the plastic cap, let your iPhone do its magic, and boom – you're connected. Customizing it is fun too. Wallet? Keys? Backpack? It's like naming your pets but for your stuff. 🐶🔑🎒The replaceable CR32 battery is a major win. No need to buy a new tag every time the juice runs out – just twist, swap, and go. Simple and sustainable. 🔋♻️The proximity alerts are the real MVP. Leave something behind? Your phone's on it faster than a detective. And if you're driving, it's like having a backseat reminder. \"Hey, you forgot your wallet!\" Talk about peace of mind. 🚗💼I've got three AirTags now – for my wallet, keys, and backpack. It's like a personal security detail for my belongings. And they're so reliable, I get alerts at the gym when I'm pumping iron and my gear's in the locker. 🏋️‍♂️🔒Love that you can mute notifications for familiar places like home. No more 'You left your backpack' nags when I'm just chilling on my couch. And the app's so smart, it figures out where 'home' is all on its own. 🏡🤖The real test? A SuperBowl party where I left my backpack at home. The AirTag network is like a secret society – it knew my wallet was with me, my keys were chilling in the car, and my backpack was 44 miles away, thanks to a nearby iPhone's help. 🏈🎉I've even accessorized my AirTags – a sleek wallet holder, a stylish keychain, and a classy leather loop for my backpack. It's like high fashion meets high tech.In conclusion, AirTags are more than just gadgets. They're like tiny guardians, always keeping an eye on your stuff. Totally worth it!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 8, 2024",
                "reviewTitle": "They exist and they work very well",
                "reviewText": "Why wait for an untoward event before buying an airtag? These are available, they exist and they work very well and are very easy to use. In addition, the price is very affordable...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebeca Zimerman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 6, 2024",
                "reviewTitle": "Muy buen producto con buen alcance de rastreo y puntual",
                "reviewText": "Calidad y precio",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOAO APULO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 17, 2022",
                "reviewTitle": "Excelente produto",
                "reviewText": "Produto original. Funcionando perfeitamente. Bom preço. Produto entregue antes da data prevista. Satisfeito com a compra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 25, 2024",
                "reviewTitle": "It is what it is",
                "reviewText": "The Apple AirTag represents excellence in item tracking. Its minimalist design and integration with the Find My app simplify the process of locating misplaced belongings with precision. The long battery life of the user-replaceable CR2032 adds to the AirTag's sustainability. Its privacy-focused features and seamless compatibility with the Apple ecosystem elevate the user experience. The Apple AirTag is a perfect solution for practical and reliable item tracking.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paulo R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 19, 2022",
                "reviewTitle": "Excelente produto! Ótimo vendedor!",
                "reviewText": "Produto original e novo. Vendedor rápido e eficiente.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}