{
    "remaining_requests": 40158,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AMERICALOC-GL300W-Mini-Portable-Tracker/dp/B0197FV8YU",
    "body": {
        "name": "AMERICALOC GPS Tracker. GL300 MXW Series. Advanced Mini Personal and Vehicle GPS Tracker. Long Battery Life. Advanced CAT M1 Technology",
        "price": "$55.00",
        "originalPrice": "",
        "rawPrice": 55.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AMERICALOC-GL300W-Mini-Portable-Tracker/dp/B0197FV8YU",
        "soldBy": {
            "sellerID": "APZB7XU9RWF84",
            "name": "ORBIFLEX INC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=APZB7XU9RWF84&asin=B0197FV8YU&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41nciJ8ljuL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51YKSoAZZrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41A8jjyugLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MJTLmL0HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31NkF4gz4RL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51stFHfsYeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91lYVRoieBL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d761b84b-ab04-45b2-a16e-3218432c6c22/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the AMERICALOC Store",
            "link": "https://www.amazon.com/stores/Americaloc/page/EB5E7CC8-87F5-47C0-BBA5-F2373ADEE02C?ref_=ast_bln"
        },
        "brand": "Americaloc",
        "merchantInfo": "ORBIFLEX INC",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1587,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 12 hrs 45 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "GPS Tracker for vehicles, people, assets. Magnetic case included. For serious and intensive tracking. Provides extraordinary battery life and coverage using cutting-edge CAT M1 technology. Service available in over 180 countries, including the US, Canada, and Mexico. Compared to other cheaper alternatives, our device reports location updates more frequently with no extra cost, ensuring you always have accurate and up-to-date information right at your fingertips with no surprises on your bill.",
            "Why is Americaloc better? extraordinay battery life, detailed maps, and super-detailed tracking service, our official apps and website provide a seamless experience. Plus, you'll receive configurable text and email notifications for all events - not just some of them - at no extra cost. Unlike other services, we won't charge you more for more frequent location reporting. Dedicated customer support area, where our team is always ready to provide fast, reliable replies to all of your questions.",
            "Text and Email Alerts: movement,parked, speeding, device on/off, low battery, entering or leaving zones, front button pressed. Battery life measured in weeks and up to a month, not in hours as basic trackers",
            "With our real-time tracking and comprehensive tracking history, you'll always be up-to-date on the whereabouts of your vehicles, people, or assets. Access your tracking information from any computer, tablet, or phone, or simply download our convenient Android or iOS app for on-the-go tracking.",
            "Don't settle for less. Cutting-edge device with super-detailed tracking and smart features. Location updates available every 60, 30, or even 10 seconds at no extra cost. And now, with our super cool new feature, you can ask the system to analyze the tracking history and provide visual report highlighting the most frequently visited places. Our system also allows you to easily create and manage shareable device location links. Top-of-the-line GPS tracker for all your tracking needs."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2.7 x 1.51 x 0.92 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.3 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0197FV8YU"
            },
            {
                "name": "Item model number",
                "value": "GL300XW"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,587 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#70,304 in Electronics (See Top 100 in Electronics) #217 in GPS Trackers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Connectivity technologies",
                "value": "Wireless"
            },
            {
                "name": "Special features",
                "value": "Super detailed Tracking"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Manufacturer",
                "value": "Queclink tracker set up for Americaloc"
            },
            {
                "name": "Date First Available",
                "value": "December 11, 2015"
            },
            {
                "name": "Brand",
                "value": "AMERICALOC"
            },
            {
                "name": "Special Feature",
                "value": "Super detailed Tracking"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Supported Application",
                "value": "GPS Tracker"
            },
            {
                "name": "Material",
                "value": "Plastic"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "GPS tracker for vehicles, assets, employees, family. Long battery life. Magnetic case already included. Why choose Americaloc? It's not just about tracking; it's about advanced functionality and insightful analysis. Experience super-detailed tracking and alerts, visual reports, 3 years of historical data, and official apps. Benefit from fully configurable text and email notifications for all events, not just on some. Americaloc owns its GPS tracking and management platform and it is not just a white label reseller. More than 16 years of experience providing GPS tracking solutions for both individuals and companies of all sizes. Ideal for monitoring vehicles, assets, employees, and family members.Featuring our longest battery life on a portable device, this GPS tracker delivers up to a month of use on just one charge.Every unit includes a magnetic case for easy placement. Experience full configurability online, allowing you to set location updates at intervals of 10, 20, 30, or 60 seconds, all at no extra chargeE-mail and text alerts.Works in the US, Canada, Mexico and in more than 180 other countries. Ready to use.The device can detect a range of activities: movement, parking, speeding, powering the device on or off, low battery status, entering or leaving specific zones, and even front button presses.Real time tracking and 3 years of tracking history.Not just tracking as many others. It's about advanced functionality and insightful analysis.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/887508d4-fa1d-44fe-bff9-d63b23ea9c5b.__CR0,0,4043,2501_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Real-Time Tracking and Tracking History. Experience the ultimate level of control over your assets with Americaloc's real-time tracking and comprehensive tracking history. Keep a close eye on your assets' movements and create detailed reports with ease. Whether you're at your desk or on the go, our platform lets you track from any computer, tablet, or phone, so you're always connected to your assets. And for even greater convenience, simply download our Android or iOS app to access real-time tracking and tracking history with just a few taps. With Americaloc, you're always in control, no matter where you are. Experience the ultimate level of control over your GPS tracking with Americaloc. We're committed to providing unbeatable value, which is why we offer customizable location updates at no extra cost. Set your location updates to occur every 10, 20, 30, or 60 seconds while on the move, and enjoy complete flexibility and control over your tracking. With Americaloc, you're never limited by a predetermined reporting interval - you control the update frequency from our easy-to-use online portal or app, so you can track your assets precisely the way you want to. You will not incur any extra charges for increasing the frequency of location reporting, so you can get the most out of your tracking experience without breaking the bank. Trust Americaloc for the ultimate in tracking performance and affordability. Power-saving design. When it comes to GPS tracking, long battery life is essential - that's why Americaloc is proud to offer a super efficient power-saving. Our devices feature a built-in movement detector that saves battery while idle, so you can enjoy a longer Battery life measured in weeks and up to a month, not in hours as basic trackers. We're committed to providing reliable and long-lasting performance that you can count on, so you can track your assets for extended periods without the need for frequent recharging. Trust Americaloc to provide the power-saving features you need for uninterrupted tracking.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cb0f798b-440d-4120-b5c4-6e829d8761c3.__CR2,0,5210,5210_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c8f3b51-cfe4-47ff-99cb-286c3a9ea69f.__CR0,0,1251,1251_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8222c62f-e508-4798-9ea5-764e4f348e3a.__CR0,0,1251,1251_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Configurable text and e-mail alerts. Our devices are designed to alert you on all events, including movement, parked, speeding, switching the device on or off, low battery, entering or leaving zones, and even front button presses. Americaloc gives you the flexibility to configure and receive alerts on all events - not just on some of them -, so you can stay informed and take action when necessary. With Americaloc's alert system, you'll always know the status of your trackers and be able to respond quickly and effectively to any potential issue. Trust Americaloc for the ultimate in tracking performance and control. Americaloc's global coverage lets you track your assets with ease, no matter where they are in the world. Our devices work not only in the US, Canada, and Mexico, but also in over 180 other countries, giving you the peace of mind and flexibility to track your assets globally. Whether you're tracking shipments, monitoring equipment, or keeping an eye on a loved one's location, Americaloc has you covered. Trust our global coverage to provide reliable and accurate tracking data, so you can stay connected no matter where your assets are located. Americaloc's GPS tracking devices are built to operate on the advanced IoT networks available, ensuring the highest level of accuracy and reliability. This is the longest battery life version and runs on cutting-edge CAT-M1 technology, offering efficient and secure communication channels possible. These devices are built to commercial-grade standards, making them tough enough to withstand even the harshest environments and usage scenarios. With Americaloc, you're using an advanced and reliable GPS tracking technology available, so you can stay connected and in control at all times.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cf1ddbca-107d-4905-9a6b-345b2c428556.__CR0,0,5209,5209_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/37a736b8-c8fc-4e3b-b603-e7a8fa5f0138.__CR0,0,1251,1251_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/43975766-5691-4ee8-a75c-b5a4bc43a892.__CR0,0,3120,3120_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Tracking multiple units has never been easier with Americaloc. Whether you have one or many trackers, our user-friendly platform allows you to monitor and manage all of your units simultaneously. Keep a close eye on all of your assets and stay informed with real-time location updates and detailed reports, all in one convenient place. Trust Americaloc to provide you with the tools and technology you need to effectively manage and track all of your units, no matter how many you have. The Americaloc GL300MXW is a versatile and compact device designed to meet the diverse tracking needs of vehicles, trucks, assets, employees, and more. With its comprehensive tracking and monitoring capabilities, it offers real-time location updates and valuable insights for efficient management. Whether you're looking to optimize fleet management, protect valuable assets, or ensure the well-being of your employees, this multipurpose device is your all-in-one solution. At Americaloc, we believe in transparency and providing our customers with a hassle-free experience. That's why all of our features are included with no hidden fees or activation charges. We understand that circumstances can change, which is why we offer the flexibility to cancel your service at any time, without any cancellation fees or penalties. Americaloc, a straightforward and fair approach to GPS tracking.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28efb880-d021-48b9-88fe-0e1e15d7b203.__CR0,0,1251,1251_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/225ce9f7-d4be-4419-bf9e-3c33d0c0a87b.__CR0,0,5000,5000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/acc73371-e5d5-4636-8099-82d810d05111.__CR10,0,1497,1497_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Powerful tools. At Americaloc, we know that keeping track of your devices can be a challenge. That's why we offer a range of powerful tools to make it easier than ever to manage your GPS tracking data. With our platform, you can create and manage shareable device location links, making it simple to keep others informed of your location. Our smart visual reports highlight the most frequent places your device visits, so you can easily identify patterns in your activity. And with the ability to download these reports, you can analyze your data in-depth and make informed decisions based on your location history. But that's not all - we also offer a unique feature that allows you to watch your mobile device location alongside your tracker's location on the same screen. This is super useful for locating your car in a crowded parking lot, or keeping tabs on your fleet of vehicles. And with our easy-to-use interface, you can access all of these features with just a few clicks. At Americaloc, we're committed to providing you with the tools you need to stay informed and in control of your GPS tracking data.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e30a8ef-41b7-47ee-86c4-90902adbe492.__CR0,0,4043,2501_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "GPS tracking solutions for both individuals and companies, no matter the size.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64410b82-ad0b-4a59-8b27-6ab15f019de5.__CR0,0,4043,2501_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Americaloc GL300 MXW Series Portable GPS Tracker Americaloc ST4340 Wired GPS Tracker Americaloc ST4500 OBD GPS Tracker Americaloc ST4950 Long Term GPS Tracker Real Time GPS Tracker ✓ ✓ ✓ ✓ Power Source Rechargeable Battery Vehicle Powered Vehicle Powered Rechargeable Battery Installation Required Not needed. Portable. Optional hardwiring ✓ Plug into OBD port Not needed. Optional hardwiring Text and email alerts ✓ ✓ ✓ ✓ Harsh driving detection ✓ ✓ Ignition status detection ✓ ✓ Speed Monitoring ✓ ✓ ✓ Motion / Stop detection ✓ ✓ ✓ ✓ Web, Android APP and IOS APP ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/887508d4-fa1d-44fe-bff9-d63b23ea9c5b.__CR0,0,4043,2501_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cb0f798b-440d-4120-b5c4-6e829d8761c3.__CR2,0,5210,5210_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c8f3b51-cfe4-47ff-99cb-286c3a9ea69f.__CR0,0,1251,1251_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8222c62f-e508-4798-9ea5-764e4f348e3a.__CR0,0,1251,1251_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cf1ddbca-107d-4905-9a6b-345b2c428556.__CR0,0,5209,5209_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/37a736b8-c8fc-4e3b-b603-e7a8fa5f0138.__CR0,0,1251,1251_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/43975766-5691-4ee8-a75c-b5a4bc43a892.__CR0,0,3120,3120_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28efb880-d021-48b9-88fe-0e1e15d7b203.__CR0,0,1251,1251_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/225ce9f7-d4be-4419-bf9e-3c33d0c0a87b.__CR0,0,5000,5000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/acc73371-e5d5-4636-8099-82d810d05111.__CR10,0,1497,1497_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e30a8ef-41b7-47ee-86c4-90902adbe492.__CR0,0,4043,2501_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64410b82-ad0b-4a59-8b27-6ab15f019de5.__CR0,0,4043,2501_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08bac2e6-d237-4f70-bcfa-9a10b9ef9d03.__CR750,0,1500,3000_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e3068fc8-4d3a-4107-a291-76f36015d979.__CR750,0,1500,3000_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/810fc705-ffe8-4c03-83d4-f01aef2af428.__CR750,0,1500,3000_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e15a2bc6-f0e2-43d4-9ed6-566b2b7a4aec.__CR0,0,800,1600_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Julio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE345M7JUVCQUPNOCP7KEXQSONRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16POUPK32B08D?ASIN=B0197FV8YU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Location works great",
                "reviewText": "I bought one for my car, and now i'll get one for my motorcycle and other car. The monthly plan is a good price for what you get. The signal works great from inside the car and I haven't had any issues so far and the app is easy to use and reaponsive. Battery also lasts a long time on a charge.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGCNJKPPHIYX23NERW5QVYQLK5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VC75BH3C0YVN?ASIN=B0197FV8YU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Accurate and reliable; Great device!",
                "reviewText": "I knew nothing about these devices so I did my best to research. I tried this one, and I am glad I did! Using the device is super simple; charge it and locate it in whatever vessel you are seeking to have tracking access of. The app on your computer or phone is basically a map, and it shows you date, time, and movement of the device. You can determine yourself how often you want the device to send you location details, and obviously the more reports you have the device send, the shorter the battery life. But even having it send reports the max of every 10 seconds, for me, the battery still lasts 6 or 7 weeks! Customer service at this place is super responsive and helpful with any assistance, a great product and company overall.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DtraneDtrane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYFPY4RQDQGE7HK2MOX5VWVLCHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NJFL84V5KFK9?ASIN=B0197FV8YU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2018",
                "reviewTitle": "5.0 out of 5 stars Great, Reliable Product to Help You Keep Track of What is Important To YOU!!!",
                "reviewText": "I bought this product and one other to track my child who is visiting her mother who is currently in Texas for the holidays. We are currently in a custody case for our child who currently lives with me (the mother lives in Mexico). In an effort to insure that my child does not leave the country but still has the opportunity to see her mother, I am using this product to track my child's whereabouts using GPS location, GeoFencing, and email alerts for various situations. I placed this product in a pocket in her backpack, another similar product in the lining of her suitcase, and further a third (software) on her phone. I figured between the three at a minimum one would make it through any attempted abduction and give me ample opportunity to alert the authorities at the border.So first, the purchase, delivery and setup of the GL300W was very easy. I did the setup online and the purchasing of the plan was smooth. The device activated within about 10 min and was showing location in my home. I also setup the competing device and the cell phone at the same time. Similar experiences with those as well. I needed to run a trial prior to my child leaving for Christmas break with the other parent. So, I setup a geofence around my home and around the school property and set the distance of the fence at 0.1 mile. I put the unit in the school backpack. I setup the alerts that I wanted to receive in email for the events I needed. The trial lasted about 8 days. I was pleasantly surprised that I knew when my daughter left home and arrived at school in addition to seeing the exact route that was taken to school and then back home in the afternoon. This allowed me to verify on a daily basis that my daughter was where she was supposed to be when she was supposed to be there.I had a problem with the competing product at the beginning in that when my daughter returned home from school it was showing that it was still at school. This product (GL300W) worked flawlessly and did not have this glitch. The 8 day trial was successful.My child left for Christmas and the unit tracked perfectly from our home to the airport. It lost connection during the flight due to no cell service at altitude, but picked up signal again when it landed in Texas. It has now been a full two weeks and it has tracked without fail with approximately 30% battery life remaining. My daughter is due back tomorrow so I will see how it tracks back home from Texas. I emailed customer service about the ability to track into Mexico and was assured that the product will work internationally. Customer service has been awesome so far and very responsive getting back with me within a few hours. Their pricing is very reasonable for what I was looking for, there is no long term contract required, and I cannot put a cost on the safety of my child and my peace of mind relative to that goal.The product does what it says that it will do and does it well from what I see so far. I was skeptical initially, but those doubts have passed. This product is reliable. All transactions and tracking is done via a web browser. If I had one recommendation for improvement it would be to have a user friendly app for Android or IOS. I am fairly computer literate so I was able to figure out what I did not understand. There are also videos on Youtube which can help you out with questions.",
                "reviewVotes": "160 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/714tOrGJoxL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joel Felton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTVZCLQGXQ5N3SVAK46EP4UXMCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UDPY8R6KDNPU?ASIN=B0197FV8YU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2022",
                "reviewTitle": "4.0 out of 5 stars Great Performance - not so good web interface",
                "reviewText": "I purchased two different GPS's to compare, this one and Tracki. I ended up keeping the AmericaLOC because of its performance but I really wanted to like the Tracki because of the more modern web and app interfaces. Just its performance wasn't up to par compared to AmericaLOC. I used both for a month before I decided to keep AmericaLOC.My Use- I put the tracker in my son's book bag to see when his bus leaves/arrives at school. And when he is returning from school so I can time the bus drop off. Several times this year our bus has been 10 - 20 min early, and 15 - 20 late.PROs- Pricing was cheaper- I could get 10 second updates- Very accurate and would update fairly quick once the GPS started moving (Tracki was taking 20 min at times to initially update).- size was comparable to Tracki with extended battery pack and AmericaLOC picture with the coins accurately gives a size estimate.- Battery life is great. I get 2 to 3 weeks with my use, updates set at 10 seconds.- GPS seems to be solid, well made. It doesn't feel like it will fall apart.- Unlimited texts. I have it set up to receive a text when my son's bus leaves the school, and another when he enters our subdivision. Tracki you only get 30 texts per month unless you pay for more.CONs- The cell app and web interface seem like it was developed in the 1990's. I am not sure who uses boarders around their icons anymore, but they do.SUMMARYIf you can get past the ugliness of the web interface and phone app, this GPS seems to be perfect for what I use it for.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Lark",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 4, 2022",
                "reviewTitle": "A fabulous tool for tracking your luggage",
                "reviewText": "These trackers are the perfect way to track your luggage to your final destination. They are simple to use and provide accurate location information using GPS and by providing cell tower based locations when the device is buried under other luggage or is indoors. They were a huge help on a recent trip holiday to the Caribbean. The Americaloc technical staff are extremely helpful if you are having trouble getting location information, they are quick to respond and provide very helpful information. The trackers can operate for over a week with one charge and they provide information on location and speed when they are moving.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}