{
    "remaining_requests": 40036,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tracker-VyncsPro-Monthly-Included-Seconds/dp/B01MZCKUZR",
    "body": {
        "name": "GPS Tracker VyncsPro 4G No Monthly Fee OBD Car Tracker Real Time GPS 1 Year Data Plan Included 60 Seconds GPS, Live Map, Teen Unsafe Driving Alert, Car Health, Recall, Fuel Report (Grey)",
        "price": "$99.99$99.99",
        "originalPrice": "$119.99",
        "rawPrice": 99.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tracker-VyncsPro-Monthly-Included-Seconds/dp/B01MZCKUZR",
        "soldBy": {
            "sellerID": "A1MR0LC94VGQFE",
            "name": "Agnik",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1MR0LC94VGQFE&asin=B01MZCKUZR&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07D1K81SV"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51cYPKaXfqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51pOW5LN-XL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51y5fIWTNsS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51aNEvku YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RiCDo8ufL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517D03iLvkS.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Vyncs Store",
            "link": "https://www.amazon.com/stores/Vyncs/page/27937F66-7725-4E5E-92F5-DA6404026868?ref_=ast_bln"
        },
        "brand": "Vyncs",
        "merchantInfo": "Agnik",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 445,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 11 hrs 43 mins",
            "FREE pickup Sunday, February 18",
            "Or fastest pickup Thursday, February 15. Order within 21 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "No Monthly Fee. No Contract. $39.99 one-time network activation fee. 4G OBD-II Realtime Car GPS Tracker Device. SIM card, 1 year of data plan, and 1 year of service Included (One year starts from the delivery date)",
            "VyncsPro comes with 60 sec GPS update, Live Map refreshing map automatically as vehicle moves, Trip Replay, Ignition on notification, Real-time Geofence zone, OBD diagnostics, maintenance, recall, fuel economy, fuel level (if available) data. Curfew Hours notifications upgrade. Driver speeding/braking/rapid acceleration alerts by Push Notification/Email and SMS (upon request), trip history, driving score. Tamper alert sent once device is plugged back into OBD after it is removed.",
            "Web account and Android/iOS apps. Full service connected car product with Real Time GPS tracking, Live Map 60 seconds Real-time GPS with 30/15 seconds GPS update upgrades available. No battery needed. Draws power from OBD-II port. Goes to sleep after car ignition is off but wakes up once in every hour (when the car-ignition is off) to update location in your account and then goes back to sleep again. Get VyncsFleet for Commercial Fleet or for Tracking more than 5 vehicles.",
            "Wireless connection supported in 200+ countries including all 50 US States, Puerto Rico, Mexico, and Canada. SIM card included with 1 year data from the delivery date. Renewal required for second year onwards."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "‎2.33 ounces"
            },
            {
                "name": "Package Dimensions",
                "value": "‎2.91 x 2.01 x 0.98 inches"
            },
            {
                "name": "Item model number",
                "value": "‎6543857672"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B01MZCKUZR"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 445 ratings"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#27,433 in Electronics (See Top 100 in Electronics) #91 in GPS Trackers"
            },
            {
                "name": "Date First Available",
                "value": "October 23, 2016"
            },
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 2.91 x 2.01 x 0.98 inches; 2.33 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 6543857672"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 23, 2016"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Agnik"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B01MZCKUZR"
            },
            {
                "name": "Brand",
                "value": "Vyncs"
            },
            {
                "name": "Special Feature",
                "value": "Map Auto-Refresh, No Monthly Fee, Posted Speed Limits on MAP, 4G LTE Cat M1+Cat NB1+EGPRS OBD Wireless Global device, Mapping Technology: Google [Street & Satellite], Data Retention: Unlimited, Engine off Hourly Location, Every minute GPS See more"
            },
            {
                "name": "Connectivity Technology",
                "value": "Cellular"
            },
            {
                "name": "Supported Application",
                "value": "Alarm"
            },
            {
                "name": "Included Components",
                "value": "Battery"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Vyncs Pro is a Real-Time GPS tracking system that comes with all the bells and whistles of standard Vyncs Basic. In addition, Vyncs Pro comes with 60 seconds GPS update and Live Map Auto Refresh (map automatically refreshing as new GPS data comes in) . That means your map screen updates in real-time as the vehicle is driven and you do not need to refresh the page manually. Purchase cost and activation fee (to be paid during device registration) provide 1 4G LTE Vyncs Link device, 1 SIM card (works on AT&T/T-Mobile network in USA and 200+ countries (including Canada and Mexico) all over the world), and 1 year data plan. Check the Legal Disclaimer section on this page for the list of supported countries. There is no monthly fee. Why Vyncs? Vyncs Link is an ultra fast 4G LTE device.Vyncs Pro has no monthly fee.Worldwide coverage in 200+ countries.No battery is ever needed; powered by your car.Never worry about charging a battery. Vyncs does not need charging.Speeding alerts marked on the map along with true posted speed limits.Track loved ones even when not in a car using Vyncs Groups feature.On-demand location update for loved ones’ Android/iOS devices in Vyncs groups (included).Know your car’s health problems with this OBD Tracker.Know true idling for your car since it is based on car OBD data.Vyncs detects engine-on even if the car is not moving.Know true vehicle speed – Non-OBD Trackers provide estimated vehicle speeds only.Create geo-fence zones of any shape not just simple circular zones.Know your vehicle’s recalls well before you receive the notification from manufacturers.Know where your car is when engine is off, once an hour engine off location reporting.Know which gas station is giving you better fuel economy.Keep track of your fuel fill-ups automatically (when it is supported by your car's OBD).Tiny device size - 1.75 x 2 x 0.75 inches.Unlimited history for as long as you have a valid subscription.Vyncs Pro device is the least expensive but has the best quality (thousands of 5 star reviews).Easy to setup using our guided setup in the Vyncs app.2 minutes easy setup.",
                "media_link": []
            },
            {
                "media_text": "Vyncs Pro 4G OBD Car GPS Tracker -- Powerful but Affordable",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1MR0LC94VGQFE/36d77085-313c-40d6-b9c7-4933788bf1f9._CR0,193,4000,2474_PT0_SX970__.jpg"
                ]
            },
            {
                "media_text": "Real-Time Tracking, Geofences, and Driver Safety Vehicle Tracking While driving, Vyncs Pro processes data every second, analyzes that, and transfers the results every 60 seconds from the device to your account. GPS data update is sent every 60 seconds. (15/30 seconds upgrades available). Even if your car’s engine is off, Vyncs Pro wakes up every hour to update you. Vyncs Pro also reports real-time location and records all of the trips your vehicle has taken, including start and stop addresses. Unlimited trip history as long as you have a valid Vyncs Pro account. Offers real speed limits on map where it shows speeding alerts. Be in the Know Set up Geofences from your account for knowing when your vehicles enter and/or exit a certain area. Unlike other products, Vyncs Pro offers a more-powerful, any-shape geofence (not just a circular fence). If your device has been plugged back into your car’s OBD-II port after being removed, get tamper alerts (the device doesn’t have a battery for safety reasons). Get alerts when they drive during curfew hours. Get notifications on your Android/iOS devices and desktop/laptop. Know How They’re Driving View where your drivers’ rapid acceleration and harsh braking events occurred on a map. See how often your drivers speed with our speeding histogram, which shows you how much time the driver spends in certain speed ranges. Know how much your drivers are idling. Evaluate your drivers with the Vyncs Pro Driver Score, which Vyncs Pro calculates from how safe each trip your driver takes over time. Get unsafe driving alerts for speeding (above a custom threshold), rapid acceleration, harsh braking, and rough cornering.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/2dbd91c0-7835-460c-ade9-46fceafe44ba.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/8e9e180f-b65a-4088-8fee-1b0a42cd39a2.__CR0,0,800,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/45558a15-f83d-4d91-b387-8ea51b691f9d.__CR73,0,656,656_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Vehicle Health Monitoring, Fuel Reports, and Location Sharing Beyond the Car Solve Problems Before They Get Big Vyncs Pro collects all the vehicle trouble code data that is openly accessible through the OBD-II port; be the first to know exactly what’s happening with your car before it becomes a big issue. See all of the details within your account. Check engine lights and emission information are reported whenever available as well. Get maintenance reminders, any recall notices issued by your car’s manufacturer, and your car’s battery health condition. Smart Fuel, Smart Savings Know how much fuel is left in your vehicles (supported as long as the vehicle reports this data through the OBD-II port), track the fuel cost, and get personalized fuel savings tips. Vyncs Pro correlates fuel consumption with how the vehicle is being driven and reports the aspects of one's driving that is contributing towards increased fuel consumption. Vyncs Pro also allows you to monitor the gas mileage you get from a gas station and identify the ones that gives you better fuel performance. Track Beyond the Car Don’t be limited to the car! Track beyond the car with our optional and unique Android/iOS device location-sharing feature, Vyncs Groups. Keep track of your loved ones when they’re walking, biking, or on public transit. Create private groups and add anyone you want via a custom group code-- all they need is the Android/iOS app! You may turn off the feature at any time. Even use it to find your lost or stolen Android/iOS device easily. This is optional. Use it only if you need to.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/d40ad271-6ad3-4b90-930a-f9b56ceb834a.__CR74,0,656,656_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/25d2dbe1-41ca-4b26-a837-245e50a453a4.__CR0,0,800,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/341f194f-7715-4de3-aa1c-6136685245d2.__CR0,0,800,800_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "24/7 Roadside Assistance and Smart Devices 24/7 Roadside Assistance Be ready for anything with free roadside assistance in the United States, Canada, and Puerto Rico with Vyncs Premium or via upgrade. The program includes 24/7 roadside assistance, towing, winching, lost key/lock-out help, fuel delivery, and more. Some restrictions are applicable. The Vyncs Link Device and Vyncs Cables The Vyncs Link is a tiny but very powerful device. It has a dedicated accelerometer sensor for detecting 3-axis acceleration and braking events. Device does not need a battery. Dimension: 1.75 x 2 x 0.75 inches; Weight: 2.2 ounces. If you want to use an OBD-II extension cable (optional), use only the Vyncs OBD-II extension cable. Family of Smart Devices and Apps Vyncs has a rich developer forum. It is integrated with smartwatches, your smart home assistant, Alexa, and many other third party applications. That means you have access to many awesome additional features once you are part of our Vyncs family. In case you want to create your own application, just check us out.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/6fa035c9-b3d6-48e8-ab74-a98e1c40364b.__CR0,0,800,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/e2cb1de9-3d06-4a05-a5fc-60098bfe65ad.__CR0,0,800,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/c1a4d975-7318-4de3-aa83-cd53e55f684d.__CR0,0,800,800_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Vyncs Fleet and More Vyncs for Businesses & Fleets Vyncs Fleet: Vyncs with many additional features for commercial fleets including: (1) Allows unlimited vehicles per account. (2) Fleet dashboard. (3) Street address on trip table. (4) Downloadable data in Excel-friendly format. (5) Fuel cost tracking. (6) Creating custom maintenance tasks. (7) More scalable software and powerful infrastructure for fleets. (8) Stop time reporting on the map. (9) True idle time (vehicle not moving but engine running) reporting on the map. (10) Multiple sub-fleets with more than one managers and due access control. (11) Dispatch management on the map, (12) Many other features... Get Your Vyncs: The Right One Vyncs Basic: Our standard 3G real-time GPS tracker product for consumers described in this page.Vyncs Premium: Vyncs Basic along with one year roadside assistance (available only in USA, Canada, and Puerto Rico).Vyncs Pro: Vyncs Basic with 60 seconds GPS update and Live Map Auto Refresh (map automatically refreshing as new GPS data comes in).Vyncs Mo: Vyncs Basic plus 60 seconds GPS update, live map auto refresh, and 24/7 roadside assistance. Instead of yearly subscription, Vyncs Mo offers a flexible monthly payment plan. Vyncs OBD Extension Cable & Power Adapter Cable Vyncs OBD-II Extension Cable: Optional extension cable for connecting the Vyncs device with the OBD-II port. The only cable tested to work with Vyncs. Using any other cable is not recommended since it may not match the OBD-II pin-support requirement of the Vyncs device. Unauthorized cables that are not tested with Vyncs may also damage the device. Vyncs 12V Power Adapter: We also offer a 12V power adapter cable for installing the Vyncs device in non-OBD-compliant light or heavy duty vehicle. Note that the 12V power adapter cable is different from the OBD-II Extension Cable shown above.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/7de4c489-1b21-459b-9086-f86c27a2811b.__CR75,0,656,656_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/08f5ae0f-d933-4d62-bb55-0127d72aa92d.__CR0,0,3335,3335_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/5da610d8-6255-4be6-b31a-f306c2ccba36.__CR0,0,800,800_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/94a9bded-3182-48fc-8923-6235e11a0a81.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1MR0LC94VGQFE/36d77085-313c-40d6-b9c7-4933788bf1f9._CR0,193,4000,2474_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/2dbd91c0-7835-460c-ade9-46fceafe44ba.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/8e9e180f-b65a-4088-8fee-1b0a42cd39a2.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/45558a15-f83d-4d91-b387-8ea51b691f9d.__CR73,0,656,656_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/d40ad271-6ad3-4b90-930a-f9b56ceb834a.__CR74,0,656,656_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/25d2dbe1-41ca-4b26-a837-245e50a453a4.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/341f194f-7715-4de3-aa1c-6136685245d2.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/6fa035c9-b3d6-48e8-ab74-a98e1c40364b.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/e2cb1de9-3d06-4a05-a5fc-60098bfe65ad.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/c1a4d975-7318-4de3-aa83-cd53e55f684d.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/7de4c489-1b21-459b-9086-f86c27a2811b.__CR75,0,656,656_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/08f5ae0f-d933-4d62-bb55-0127d72aa92d.__CR0,0,3335,3335_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/5da610d8-6255-4be6-b31a-f306c2ccba36.__CR0,0,800,800_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SlammanDan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVJPPDDMFT2Q5KL2VI7DGQHJOKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJMALJ84ZKV9B?ASIN=B01MZCKUZR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2020",
                "reviewTitle": "5.0 out of 5 stars VYNCS PRO 4G+ Much Better!",
                "reviewText": "1/17/2021. Ok, changing to 5 stars after receiving tech support, returning and receiving a new device (4G Pro +). This thing has been working perfectly. It defenitley has the best user interface and most options of all the Trackers ive seen. Now I can recommend.12/19/2020. Missed trips in evening of 12/18 and showing current location as one of the locations I was at last night. It does not track real time. Will be returning.12/18/2020. After reset of unit and update by Vyncs, so far has captured everything. Lisa with customer service at Vyncs was great, she responded very quick and eager to help. Thank You Lisa! Moving rating to 5 stars. If anything changes I will update.Edit: Vyncs contacted me through Email right away, wanting me to try a reset. I will try this and update after. Was impressed that they contacted me so quickly, on their own.So far, not too happy with this tracker. It seriously misses more trips than it gets. Missed every 20 mile trip to work this week, not seeing any part of it. Then missed todays 41 mile trip. One more missed trip, i will be returning it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Louis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGSIWFFFIXJPCWVHU45VYC3W7GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ6MUPKDWIP4T?ASIN=B01MZCKUZR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2018",
                "reviewTitle": "5.0 out of 5 stars I LOVE THIS SO MUCH!",
                "reviewText": "UPDATE:After 6 months of use, I STILL LOVE THIS GEAR!!! :)The Android app works great. Notifies me every time to the alerts I have set. (It is set to alert me if the car goes over 70mph or if it enters or leaves any zones I program in: geofencing)In central Florida it has no problems at all with cellular reception or GPS reception.I LOVE how I can see fuel levels and the battery charge right from the website or the app!All of this gives me such piece of mind that I believe is well worth the price of this unit per year. Yes, you do have to pay annually, however, these 1 minute updates are well worth that cost to me.PS: It also alerted me to a vehicle recall about one week before I got the letter in the mail from my car dealer. :)I'm conclusion: I recommend this product to anyone even thinking of wanting something like this! This is the standard that others should aim for. If I had to say anything negative, the app and website could be designed better. However, they have never failed to function for me and they have made several improvements since I first purchased this 6 months ago. So, I have faith things will only get better.-------Original Review Below-------I bought the one that would give me minute by minute updates. I'm glad I did. It was very easy to set up, following the instructions. I am able to keep an eye on my elderly mother's trips and know that she is safe. And, if anything happens, I'll know exactly where she is too come help her on the side of the road.I use the web interface and the android app. Both work great.",
                "reviewVotes": "205 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John T.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3ELWQ7C7CJHDRB45KC2PDFRKQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGOXYBEGVU0C1?ASIN=B01MZCKUZR",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2019",
                "reviewTitle": "1.0 out of 5 stars Is this device a joke?",
                "reviewText": "There is a reason this has 30% one-star reviews as of this writing. First, I did know going in that while there was no monthly fee, there was a yearly fee....so basically, you pay 12 monthly fees in one \"handy\" installment.I received this device and registered/activated it, which was straight forward, although I did have to type in the MEID number three times during the process for some reason, which was annoying. Then, as instructed, I installed the device by plugging into the OBD-II port and went driving for 10 minutes or so. First, I was confused by the results, because rather than logging a \"trip\", which is defined as when you start the engine to when you shut off the engine, it merely showed the location of my car at various points during the trip. Under \"trips\", there was nothing listed. When back home, I looked at \"last known location\" and that was a little less than half a mile from my actual house.Not overly concerned, since some reviews had said it might take a bit to get all sync'ed up, I took four trips the next day. Only one of those trips was logged. What? What happened to the other three? I had set up a zone around my house so I would know when my kid was driving my car and had left home. I didn't get any notice when I left or entered that zone.Getting frustrated that this didn't seem to log much, I reset it as per the instructions that come with it.Over the next two days, NO trips at all were logged, only the \"last known location\" was logged. Now, this is supposed to wake up every hour and log it's location. It did that MAYBE once per day, not once per hour. I contacted support and they looked at the data and claimed my car had \"unusual electrical characteristics\" and said they may have to push an update to account for it. Note, this update was apparently going to disable most of the functionality aside from GPS. Things like mileage, check engine, and all that would be disabled. Since I bought this primarily for GPS, that wasn't too big a concern. They said it would be done within 24 hours. More than 24 hours later, I took the car out, again, nothing was logged.I did not use the car for a couple of days, and when I came out to start it, the battery was dead. How on earth can this tiny GPS/Cell Phone drain a relatively new battery in just a few days? I did see other people mention this as well. Also, I did pay extra for the 60-second updates, but it never worked well enough for me to see if I got that, since some people have complained they didn't get that when paying extra.So, since the device apparently did not work, AND it drained my battery, back it went. I will also say here that in addition to all of the above, the user interface on both the website and the app were horrible.I finally got a refund after two weeks, which is why I waited to make this review. It took two weeks, several emails, and finally contacting Amazon to get a refund. Interestingly, literally TEN MINUTES after Amazon opened a case with the seller, the refund was issued.By the way, I did go ahead and buy a Bouncie, which is $8 a month, so about the same yearly cost as this one. And, it flat out works like you want. Plug it in, and drive for a while, and everything is logged. Every single trip is logged, and the interface on both the app and website are intuitive and attractive. Save yourself some grief, and get that one.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Debs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW52AVVDESYP5KRZRS7C6LKG3UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ0OY8XD1OS9E?ASIN=B01MZCKUZR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "4.0 out of 5 stars Tracks well",
                "reviewText": "Tracks my teenage daughter so I make sure she is ok. Thank goodness for this tracker. It gives me piece of mind that. Know where she is.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LckyMom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOORNHQGHBERWNE52D4VWMHX2MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8NZMPJHT9TP4?ASIN=B01MZCKUZR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 7, 2021",
                "reviewTitle": "5.0 out of 5 stars I have had two for 2 years now...works great!",
                "reviewText": "I have had two for 2 years now...works great! Has been a pretty reliable way to keep track of two cars. I mounted the units high up, under the dash, using an OBD2 extension cable. Also, the antenna side of the module (with the logo) should face up, towards the sky, for the best GPS and cellular signal strength. (the antenna side of the module is opposite the side with the square decal/label with barcodes). The system works 99% of the time, but sometimes the App doesn't work correctly...and it can't find the current location, or has not updated the location in a while. I suspect this happens when the Vyncs server is down, or is being updated. This is the most cost effective way to track your cars.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stuart Chartrand",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 13, 2017",
                "reviewTitle": "Good value for the money and easy to use",
                "reviewText": "The information that the unit produces is very useful and the GPS function works very well. It's nice not having a complicated or technical installation, just plug it in, download the app and start using.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephen chapmanStephen chapman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 1, 2021",
                "reviewTitle": "Very disappointed",
                "reviewText": "Arrived like the package had been run over by a truck ,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1Yyh5Iz1qS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 29, 2018",
                "reviewTitle": "Best thing I ever bought",
                "reviewText": "This thing works amazing, I live in Canada Ontario works perfectly here. NO monthly fees at all. And NO stared up fees also. thinking of buying one more for my other car. Worth every penny I spend on it.. tells me everything I need to know about my vehicle and I mean everything love it... so happy with this product. This my 4th year now. Not one problem with it at all.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SPIZZERINCTUM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 7, 2017",
                "reviewTitle": "Vyncs Pro - Does not work on all cars properly & HORRIBLE Customer Service by Agnik",
                "reviewText": "Update 15-Jan-2018: Turns out the Vyncs tracker comes in one standard length (dimensions) which creates a problem on some cars. I can put the Vyncs on the Hyundai Accent OBD2 port discreetly to track the car discreetly. However, on a different car i.e. 2017 Hyundai Elantra GL, the Vyncs Tracker can't be put on discreetly. The OBD2 Port Cover cannot be put on (closed) with the Vyncs tracker applied on the port, the tracker sticks out & is clearly visible to the driver thus rendering this device useless for discreet tracking purposes. In addition, Vyncs customer service is terrible, horrible, and indifferent to customer concerns. I would give Vyncs an Oscar for terrible customer service.For the above reasons, I am going to give it only two stars.Vyncs needs to give serious consideration to miniaturizing this device to make it fit on all OBD2 ports discreetly.Update 17-Jan-2018: Wish I could give this item zero stars for arrogant & indifferent customer service. After I posted the 15-Jan-2018 negative review, the Seller Agnik locked-out my account on their website. Now, I cannot access my GPS trackers to know to track my vehicles, despite the fact that the seller Agnik is legally obligated to provide me with the 1-yr of in-built tracking service (already pre-paid) which is valid until 24-Aug-2017. I have never seen a business whose business philosophy is to cause permanent harm to customers & to scam them by not providing the service they are legally obligated to provide. The seller acts in an arbitrary & heavy-handed manner by locking-me out from my own account. I will not buy any items from Agnik again even if they are given away for free. Buyers Beware!___________________________________________________________________________________________________________This review is for the Vyncs Pro car GPS tracker.In one word....the product is AWESOME. It performs the way it is designed to perform and explained. It has met and exceeded my high expectations.I bought the Vyncs Pro as a peace of mind to know the whereabouts, location, speed, etc. for a new driver.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gustavo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 17, 2019",
                "reviewTitle": "Works,",
                "reviewText": "There’s some faults, bugs... but works",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}