{
    "remaining_requests": 40209,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Jiobit-Gen-Lightweight-Resistant-Longest-Lasting/dp/B0C46YNSDP",
    "body": {
        "name": "Jiobit Gen 3 - GPS Tracker for Kids, Adults, Elderly | Small, Lightweight, Water Resistant, Durable, Encrypted | Real-Time Location Sharing | Longest-Lasting Battery | Cellular, Bluetooth & WiFi (New)",
        "price": "$129.99$129.99",
        "originalPrice": "",
        "rawPrice": 129.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Jiobit-Gen-Lightweight-Resistant-Longest-Lasting/dp/B0C46YNSDP",
        "soldBy": {
            "sellerID": "A37XSEH8SONU63",
            "name": "Jiobit",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A37XSEH8SONU63&asin=B0C46YNSDP&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C9MZK76N"
        ],
        "asinVariationValues": [
            {
                "asin": "B07CWFBM5S",
                "variationName": "Model",
                "variationValue": "4188N8762W",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0C46YNSDP",
                "variationName": "Model",
                "variationValue": "Jiobit Gen 3",
                "price": "$129.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31EfkTSS8KL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41DXJbUlLNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xWhWMyjAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 UAtleEdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KxYJz8S1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Cx1zUcRYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31a27kMia-L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Jiobit Store",
            "link": "https://www.amazon.com/stores/Jiobit/page/F8B4560C-D09A-4FEA-931C-301C7B278E09?ref_=ast_bln"
        },
        "brand": "Jiobit",
        "merchantInfo": "Jiobit",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 2436,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 2 hrs 38 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Small, Lightweight and Durable: With our most powerful battery yet. Jiobit easily and discreetly attaches to clothing, shoes, backpacks, pet collars and more; ideal for those with sensitivity issues.",
            "Real-time GPS Location Sharing with Unlimited Nationwide Range: Our advanced, patented beacon technology leverages the combination of GPS, Wi-Fi and Bluetooth technologies to give you the best accuracy, range, and battery life to make sure you can stay connected when they’re on the go.",
            "Powerful Smart Alerts & Location History: Easily set up custom trusted places to be alerted when an area is entered or left. A location history timeline is also available so you can be notified of any unexpected detours.",
            "Safe & Secure: The first-of-its-kind Jiobit TrustChip delivers unmatched security, encryption, and privacy to ensure your loved one’s data is secure, protected, and tamper proof. Jiobit is proudly COPPA compliant",
            "Jiobit Subscription Plan: The Jiobit tracker requires a subscription data plan to stay connected. During activation in the free Jiobit app, choose between monthly and annual plans. No additional SIM or cellular plan needed. Compatible with Android and Apple devices.",
            "Warranty: Backed by our 1 year manufacturer limited warranty"
        ],
        "description": "Jiobit is a patented first of its kind gps tracker for kids, adults, seniors and pets. This complete location tracking platform which uses Bluetooth, Wi-Fi, Cellular, and GPS is the smallest and longest lasting real-time location tracker for your loved ones. Jiobit helps keep friends and family safe and brings caregivers peace of mind. It's a small, lightweight and durable device that clips discreetly to clothing, pets or wearables. Gen 3 boasts our most powerful battery yet, lasting up to 30 days on a single charge. Jiobit is paired with a caregiver's smartphone to deliver real-time location information that will track in any location at any distance.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1.96 x 1.45 x 0.47 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.8 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0C46YNSDP"
            },
            {
                "name": "Item model number",
                "value": "Jiobit Gen 3"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 2,436 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,379 in Electronics (See Top 100 in Electronics) #21 in GPS Trackers"
            },
            {
                "name": "Connectivity technologies",
                "value": "5G-Compatible (LPWA CatM1) Cellular"
            },
            {
                "name": "Special features",
                "value": "Lightweight, Water Resistant"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Cool Gray and White"
            },
            {
                "name": "Whats in the box",
                "value": "Battery"
            },
            {
                "name": "Manufacturer",
                "value": "Jiobit"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "June 27, 2023"
            },
            {
                "name": "Brand",
                "value": "Jiobit"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight, Water Resistant"
            },
            {
                "name": "Connectivity Technology",
                "value": "5G-Compatible (LPWA CatM1) Cellular"
            },
            {
                "name": "Supported Application",
                "value": "Alarm"
            },
            {
                "name": "Included Components",
                "value": "Battery"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Preben AndersenPreben Andersen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRT34YBQXT752EMJQW7LCZ2R2JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ONU5OVM1CN4Z?ASIN=B0C46YNSDP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 22, 2019",
                "reviewTitle": "5.0 out of 5 stars Brilliant tracker with long battery life if used correctly",
                "reviewText": "I bought this tracker to be able to track down my son, in case he should suddenly run away from us, when we are out.As the owner of a software company that develops software for transportation and data collection on the road, I know that small sized trackers are very difficult to make. On one side you need as a minimum a built in data cellphone module to be able to send frequent updated positions over the internet, and a built in gps receiver to be able to get the childs position from satellites.On the other side you want the tracker to be extremely small in size and light weight.We have used this tracker now for a month in 3 different countries with very good results and we have had a very long battery life between charges, at least a week. I am extremely impressed by the Jiobit, the free app and the battery life of the Jiobit.However, it is important to fully understand how this unnatural long battery life is achieved:- When the child is within proximity of your phone, the Jiobit switches to a power saving bluetooth technology. Obviously a small child like ours will be within our proximity most of the time. However in the app you can also invite other people into a \"Care Team\", for example grand parents, siblings etc. For bigger children the care team can even include the childs own cell phone. As long as the child is within proximity (30 meters or so) of a member of the care team, battery consumption is extremely low.If the child is suddenly missing in a crowded place, you can go to the app and remote activate a siren on the tracker, so you can hear where your child is. There is also an indicator in the app telling you how close you are to the child. This is efficient for indoor places where gps signals won't work and in also crowded places outdoor.If the child is to far away from you or any other member of the care team, the Jiobit automatically switches to the more power consuming cell phone data/gps system, where you can track the child all over the world, no matter how far away from the child you are. In this mode the Jiobit will work for about 1.5 to 2 days if no other power consuming settings have been made.However in the data cell phone/gps mode, there are also ways to save energy in the app:- You can mark Trusted Places on a map, so when the child is in kinder garden for example, it will save battery life until the child leaves the kinder garden area.- If the child is in the same spot for a longer period of time, Jiobit will inform the app, that it will stop sending updates until the child moves again to save battery.- You can teach your home wifi to Jiobit, so as long as Jiobit is within reach of your wifi, it will also save battery life.The tracker comes with a strong \"claw\" to put the tracker on clothes without it falling off. As an accessory you can buy a magnetic lock pin (a la shop theft tags on clothes), so the child won't be able to remove the tracker.All in all absolutely THE BEST small tracker on the market within the limits of todays technology.",
                "reviewVotes": "1,125 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71INGxgUljL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71ITgydsu7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71R8Yu3XnWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71rJZaI6boL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "B.B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAHAZNLGY2QS5H7JZUYHRNKYKZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VYRUFC1FKGH1?ASIN=B0C46YNSDP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Found wandering senior quickly",
                "reviewText": "Highly recommended if you need a simple low-montly-cost tracking tool for a senior who might wander.After a couple of wandering incidents, we got a jiobit for our senior family member with dementia. Ironically, he didn't wander again for a while. Then we changed to full-time supervision and I was thinking that the jiobit wasn't really necessary any more, but we kept using it since I had bought a 2-year service plan. Then recently a caregiver was busy loading laundry when the senior decided to go out for a walk by himself. The caregiver looked all around the house and outside, started to panic a bit, and then looked at the jiobit app. It does take a good minute for the app to get into \"live\" mode, which is the moment-by-moment tracking. In regular mode it seems to update every few minutes and in this instance it hadn't yet updated nor sent a notification that the senior had gone outside of the wi-fi range. (I've read that the newest jiobit updates every few seconds, so we must have a first generation model.) Once the caregiver started live mode, the caregiver could see that the senior had wandered off quite far and in an unexpected direction. Jiobit saved us from doing an extended search and proved its worth that day!We've had the charge last 7-10 days when the device doesn't leave the wi-fi range/geo-fence. The battery loses charge more quickly outside of the wi-fi range when it's accessing the cell/GPS network, and it really burns through battery power when running live mode. Just keep it charged so that it'll work when you really need it. You can turn on the bluetooth separation alarm if a caregiver will remain nearby (would have helped in the above situation :)I used to occasionally get a notification that jiobit had left the house when it really hadn't but that hasn't happened since we installed a wi-fi booster.It's quite small. We put it on our senior's keychain and he hasn't said anything about it. We just make sure that the keychain goes into his pocket every morning. It comes with clip-type attachments if needed.App is quite simple. In the app you can see a caregiver's icon when they are within bluetooth range of the jiobit-wearer. You can also use the 7-day history to see where the jiobit-wearer has been with or without their caregiver.You can make jiobit ring from the app. This helped us find it once when it was misplaced. It's also an easy way to check that it's still in our senior's pocket.I think this device is quite good for what it does in such a small package. You could use a cellphone to track someone but that is bulky, unnecessary and expensive for someone who is no longer capable of using a cellphone. There are other smaller tracking devices that allow voice communication through them but our senior is fairly deaf and wouldn't necessarily understand how to use them - and the jiobit monthly service plan is so much cheaper. There are also non-subscription devices like Tile and Air Tags but those are limited by the need to be in range of other people's cell phones.",
                "reviewVotes": "60 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}