{
    "remaining_requests": 40238,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Garmin-GLO-Bluetooth-Receiver-010-02184-01/dp/B07M9CZYTD",
    "body": {
        "name": "Garmin GLO 2 GPS and GLONASS Receiver for Precise Position Information on Mobile Devices, Black",
        "price": "$109.90",
        "originalPrice": "",
        "rawPrice": 109.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Garmin-GLO-Bluetooth-Receiver-010-02184-01/dp/B07M9CZYTD",
        "soldBy": {
            "sellerID": "A3V25H3S1O04O9",
            "name": "Top Sports",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3V25H3S1O04O9&asin=B07M9CZYTD&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09ZL57N8P"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31kOM65bAtL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31o6OtHbmnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31FQTzOGaDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31zEPe0kaCL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Garmin Store",
            "link": "https://www.amazon.com/stores/Garmin/page/675B188D-FBE3-4FF4-9DD0-E48E4A2C888D?ref_=ast_bln"
        },
        "brand": "Garmin",
        "merchantInfo": "Sold by Rub The Lamp and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1641,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 27 mins",
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 12 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Connects wirelessly to your mobile device: iPad, iPhone and other Bluetooth enabled smartphones, tablets and laptops to provide precise position information",
            "Combines GPS and GLONASS satellite receivers for precise location data with Bluetooth Wireless Technology",
            "It has up to 13 hours of battery life to keep your position on long trips",
            "Suitable for pilots, mariners, hiking, cycling and the automotive industry",
            "Charge Garmin Glo 2 easily with the included USB cable or optional 12/24 V vehicle power cable"
        ],
        "description": "Navigate with Garmin calibre GPS data on the mobile device of your choice. The GLO 2 receiver brings you the best of both worlds by combining GPS and GLONASS receivers with Bluetooth wireless technology so you can enjoy precise position information on your iPad, iPhone or Android device. The accuracy of GPS and GLONASS GLO 2 can receive position information from both the GPS and GLONASS satellite constellations, allowing it to connect to up to 24 more satellites than devices that rely on GPS alone. This allows GLO 2 to lock on to satellites approximately 20% faster and remain connected even at high speed. What's more, GLO 2 updates its position information at 10 times per second; that's up to 10 times more often than the GPS receivers in many mobile devices. Set it up and go Using Bluetooth technology, the GLO 2 receiver wirelessly pairs to your mobile device. Just set GLO 2 within range of your mobile device, and in moments you'll be receiving the GLO 2 receiver's position data. It has up to 13 hours of battery life to keep your position on long trips. Charging GLO 2 between uses is easy with the included USB cable or optional 12/24 V vehicle power cable. The optional friction mount keeps the receiver safe on your dashboard and in full view of satellites.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b?ie=UTF8&node=172526"
            },
            {
                "name": "Vehicle GPS",
                "link": "https://www.amazon.com/Vehicle-GPS-Units-Navigation/b?ie=UTF8&node=559938"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2.99 x 1.65 x 0.7 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.41 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07M9CZYTD"
            },
            {
                "name": "Item model number",
                "value": "010-02184-01"
            },
            {
                "name": "Batteries",
                "value": "1 LR44 batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,641 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2 in Vehicle GPS Units & Equipment #123 in GPS System Accessories"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "OS",
                "value": "Android"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Special features",
                "value": "Bluetooth"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Whats in the box",
                "value": "Glo 2,CLA Adapter"
            },
            {
                "name": "Manufacturer",
                "value": "Garmin"
            },
            {
                "name": "Date First Available",
                "value": "December 21, 2018"
            },
            {
                "name": "Brand",
                "value": "Garmin"
            },
            {
                "name": "Model Name",
                "value": "GLO 2"
            },
            {
                "name": "Vehicle Service Type",
                "value": "Car"
            },
            {
                "name": "Screen Size",
                "value": "2"
            },
            {
                "name": "Special Feature",
                "value": "Bluetooth"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Map Type",
                "value": "Worldwide"
            },
            {
                "name": "Sport",
                "value": "Cycling"
            },
            {
                "name": "Included Components",
                "value": "Glo 2,CLA Adapter"
            },
            {
                "name": "Audio Output Mode",
                "value": "Digital"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "tester",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGLK3H7MGCJ4DNTTAJ3OUV7ZTCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7I4E9G0ZOT4B?ASIN=B07M9CZYTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for updating Apple Tablet",
                "reviewText": "Apple is not clear that it doesn’t have a gps chipset in the non-cell tablets. It does have a remarkable WiFi work around that is reasonably accurate in urban areas. I use the tablet for off-road mapping and obviously WiFi won’t work, but this little gem works great.Very accurate. Small and connected immediately. As many have posted really needs a power charge status light/bar. Otherwise great.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNG3FXWTL4KAEX3IB3LN6GYLLHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJH9H8FJ6D0Q1?ASIN=B07M9CZYTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 11, 2019",
                "reviewTitle": "5.0 out of 5 stars It works with MotionX-GPS on an old iPad",
                "reviewText": "I bought the Garmin GLO2 for use with a six year old non-cellular iPad to provide navigation. I first thought Apple would allow the GPS signal from an iphone to be sent to a non-cellular iPad but of course they do not and there is no way of using the iphone GPS data that Apple is willing to disclose. After seeing a couple of other solutions I went for the Garmin because of their GPS history and experience.The instructions are not comprehensive. The unit pairs easily enough over Bluetooth. The blue LED goes from flashing to solid when it is paired.The flashing green LED took five minutes to find a satellite fix the first time I turned it on. When it had found the fix it turned to a solid green.On charging the amber light flashes until the battery is fully charged .If like me, you put the device on to charge and it's hunting for satellites then the green and amber lights flash alternatively. It's both charging and hunting for satellites. Makes sense. But the instructions say that green and amber flashing alternately means you either have a faulty battery or a system error. So there was five minutes of buyers remorse until the green light turned solid. Now there's a solid green and a flashing amber until fully charged.After pairing I brought up Motionx-GPS - surely the best navigation app on the market at the moment. I use it for navigating around on some of the nearby lakes. The app allows you to choose the method of location fixing: GPS, WIFI or manual. I turned off the WiFi and then I hit the GPS soft button and within a couple of seconds the signal strength for GPS appeared and fixed my position within 98 feet (the app said). I'm not sure where the accuracy number is coming from. However I have left the tracking function working on the app for 30 minutes and the app is showing movement of about 40 feet in a straight line even though the device is sitting on my desk.In terms of the specifications I would probably have given it 2 stars. Cold Start 60s - no - more like five minutes. Accuracy 3m - no - 30 minutes of use shows a track deviation of 40 feet and my app, however it is getting the accuracy data, says 98 feet.BTW turning on Wifi on the iPad improves the accuracy to 33 feet. I'll take the unit on road trip to see if that changes as soon as we are out of WiFi range and let you know the result.But for $99 i now have a working navigation system on a big screen and a new use for an old iPad. I'm happy enough it works with a non-garmin app.Edit on October 15th 2019 - I've used the GLO 2 for a few months now and it's performed well. For whatever reason the Motion-X app now shows the accuracy is 16 feet. I've written to Motion-X asking them how they calculate the accuracy but I've not received a reply. I agree with one of the other posts that it really needs an accurate battery level indicator. I would pay an extra $10 if the device had this. On another point I don't understand why Apple doesn't allow the export of the GPS location over Bluetooth - any clever people out there who could explain if this is achievable?",
                "reviewVotes": "55 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFD6ZKMXP6QCBQXRK7AB4MX6XFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IXMISU0B9W8P?ASIN=B07M9CZYTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great with ipad mini 6 wifi only",
                "reviewText": "After initial setup with ipad mini 6, this unit connects to it automatically via bluetooth. My ipad is wifi only (non-cellular). If you either a) download the map content that you need before taking the trip, or b) connect to your phone's hotspot, you're good to go! This automatically sends gps signal to google maps app. Super accurate too!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "anthony a.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEP3KEPLCFFJSU5SKXLT544L2DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKPKNWYL3RF3P?ASIN=B07M9CZYTD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 2, 2023",
                "reviewTitle": "4.0 out of 5 stars Does what it says",
                "reviewText": "Got it to use with my WIFI only iPad Mini for normal gps navigation on google maps. Worked fine out of the box",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "naser alotaibi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUFZOFF4GPCAZPLR7U5DLIKAYKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UL2GC04P1JXE?ASIN=B07M9CZYTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Good",
                "reviewText": "Small size, easy to connect",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jess",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZL23EBTDNGUQPJ2HMKXTGNNUGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T953FNE6WEW7?ASIN=B07M9CZYTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Love it so far (:",
                "reviewText": "The media could not be loaded. I’ve used this for two days and so far so good. I have a basic 2017 iPad that is WiFi ONLY so I bought this device to help out with accurate navigation to use in my car. Connects fast once you select it on your iPads Bluetooth list. Then mounted it with one of those CD player mounts, used a slanted style charging cable so it doesn’t stick out so much while plugged in, and then turned on my phones hotspot to connect to my iPad so it can run off of my phones data which is great because I love using my maps navigation and Spotify side by side in Split View kinda giving off a sort of CarPlay feel (but better). I then used small sticky cable holders to mount the rest of my iPads charging cable neatly so it doesn’t look like a mess. One thing I want to point out is using Apple Maps isn’t the best since I started using this garmin device. It showed my location more on the right side of the road like I was driving on the sidewalk which bummed me out so I decided to give GOOGLE MAPS a try before sending it back and everything worked SO MUCH BETTER!!!! I was never a google maps guy but now I am since I started using this with my iPad. Some people said you have to put your garmin on your dash or with sun practically hitting it and not to bury it in your car but for me it works fine leaving it on, charging and laying it in my center console in front of my cup holders without an issue. Just to be safe you should also download your daily routes/trips on your iPad & phone in OFFLINE mode on your google maps app incase your phone reception sucks ass and still wanna have an accurate route to take.I drive a 2012 Honda civic and it looks 100xs better now. Happy with this purchase.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/92457328-349a-4ef5-80eb-be4994a17385/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Arminder ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 26, 2023",
                "reviewTitle": "Excellent signal strength, acquires signal fast!",
                "reviewText": "This works really well with my wifi-only iPad, all I had to do was pair it via Bluetooth and it works! No settings or adjustments, it acquires a signal quickly, and it's accurate. Garmin is an excellent company and they provide exceptional service!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nahum Hernandez Cruz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 3, 2023",
                "reviewTitle": "Excelente",
                "reviewText": "La precisión de la ubicación es excelente, la duración de la batería es muy buena, en mi caso dura 2 dias trabajando alrededor de 8 horas diarias, el unico detalle es que no hay una app actual para enlazarlo al equipo android, la app Bluetooth GPS hay que buscarla en fuentes externas a play store, ya que ahi ya no esta.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonio DAlesio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 9, 2023",
                "reviewTitle": "Eccezionale",
                "reviewText": "Ottimo - Perfetto si aggancia ai satelliti immediatamente e aggancia IPad in tempo reale via Bluetooth.Antonio",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 7, 2023",
                "reviewTitle": "Rapide et efficace",
                "reviewText": "Acheté pour utiliser avec XcSoar afin de préserver la batterie de mon S21 et pour qu'il chauffe moins aussi vu qu'il fait chaud sous une verrière en plein été.Fait parfaitement le job !Il suffit d'appairer et de configurer l'interface dans XcSoar qui reconnaît de suite l'engin.Pour le faire fonctionner avec les applis de positionnement classique comme Maps, Waze ou autre il faut passer par une appli tierce (GPS connector ou mieux Bluetooth GPS qui n'est plus présente dans le Playstore mais qu'on peut facilement récupérer via le Web) et activer Mock GPS dans les options développeur. Une fois la manipulation faite il fait aussi activer la même fonction dans l'appli et dès lors toutes les applis embarquées utilisent le positionnement venant du Garmin.Effectivement le produit gagnerait à être modernisé pour recevoir toutes les constellations de satellites existantes mais franchement déjà là ça fonctionne parfaitement. J'ai une précision de moins de 2m en permanence ce qui est pour la plupart des usages amplement suffisant.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Отлично работает и держит заряд до месяца . Отлично работает и держит заряд до месяца . ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on November 4, 2023",
                "reviewTitle": "Супер",
                "reviewText": "",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81i6rUe-sRL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$104.99",
                "sellerName": "GPS City",
                "sellerRating": "4.5"
            }
        ]
    }
}