{
    "remaining_requests": 40121,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Garmin-2689LMT-6-1-Inch-Bluetooth-Navigator/dp/B00TIYNGBY",
    "body": {
        "name": "Garmin Nuvi 2689LMT 6.1-Inch Bluetooth GPS Navigator - (Renewed)(Black)",
        "price": "$174.99",
        "originalPrice": "",
        "rawPrice": 174.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Garmin-2689LMT-6-1-Inch-Bluetooth-Navigator/dp/B00TIYNGBY",
        "soldBy": {
            "sellerID": "A1BID9QNTQ7LGZ",
            "name": "New Life Deals",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1BID9QNTQ7LGZ&asin=B00TIYNGBY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41aymHtfFVL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51N7xEGqf7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BQgaK-8WL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lfAyf0BcL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "New Life Deals",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 550,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 19 hrs 41 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "FOURSQUARE - Search million of additional new and popular restaurants, shops and more with Foursquare",
            "Direct Access - Simplifies navigating to select complex destinations, like malls and airports",
            "LIFETIME MAP UPDATES - Businesses open and close. New roads are built. Be confident your routes reflect the latest map data available. LIFETIME TRAFFIC - Free lifetime traffic avoidance, no ads or subscription fees",
            "Bluetooth with Smartphone Link Capatibility and Voice Activated Navigation"
        ],
        "description": "Advanced GPS Car Navigation6-inch pinch-to-zoom, dual-orientation displayDetailed maps of North America with free lifetime¹ map updates and traffic avoidance²Find new and popular restaurants, shops and more with Foursquare®Bluetooth® technology for hands-free calling³Voice-activated navigation allows you to keep your hands on the wheel",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "Vehicle GPS",
                "link": "https://www.amazon.com/Vehicle-GPS-Units-Navigation/b/ref=dp_bc_aui_C_3?ie=UTF8&node=559938"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6.61 x 0.75 x 3.7 inches"
            },
            {
                "name": "Item Weight",
                "value": "268 Grams"
            },
            {
                "name": "ASIN",
                "value": "B00TIYNGBY"
            },
            {
                "name": "Item model number",
                "value": "010-01188-02"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 550 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#102,438 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #458 in Vehicle GPS Units & Equipment #5,596 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Special features",
                "value": "Bluetooth"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Scanner Resolution",
                "value": "480 x 272"
            },
            {
                "name": "Manufacturer",
                "value": "Garmin"
            },
            {
                "name": "Date First Available",
                "value": "February 12, 2015"
            },
            {
                "name": "Brand",
                "value": "Garmin"
            },
            {
                "name": "Vehicle Service Type",
                "value": "Car"
            },
            {
                "name": "Screen Size",
                "value": "6.1 Inches"
            },
            {
                "name": "Special Feature",
                "value": "Bluetooth"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Mounting Type",
                "value": "Dashboard Mount, found in image"
            },
            {
                "name": "Resolution",
                "value": "480 x 272"
            },
            {
                "name": "Year",
                "value": "2014"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jimmy Jamz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKPPF7LWHSJPP77RWXQVHSF526Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FCNMMBN9NCFS?ASIN=B00TIYNGBY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 2, 2016",
                "reviewTitle": "5.0 out of 5 stars Best GPS for price point on market.",
                "reviewText": "System purchased to replace Tomtom GOLIVE system that had built in 2g real traffic.I purchased this system to replace a very high end gps that had all the bells and whistles, and I must say, I should have bought Garmin first...Pro's:- YOU DO NOT need the special charge chord to get real traffic updates, weather updates etc, you can blutooth your phone via the smartphone link from android or itunes (you can also set blutooth just to pull the traffic data so you can still connect your headset or other items to your mobile device for calling or music.(the app doesnt pull hard on data)- You can use a multi port usb and connect via that instead of having to take up your entire 12v charger for the system and still get everything you need- Screen resolution is bar none, I was actually really surprised at the definition and size of this, please make not THIS IS A BIG GPS- The fact that it tells you which lane to be in (I drive in Chicago and the lanes here were made by a madman and this is a big time saver and very helpful- Nice features, really this is a pro and a con. The features are somewhat overkill, but you can turn them on and off as you choose.- You can throw out more money and get a lot of paripherals for this item, such as baby cam, and back up cam (I am not sure but with some of the other garmin devices you can also have a dash cam though it will not sync with this directly)- BEST CUSTOMER SERVICE! I am big into the outdoors so I have a lot of Garmin stuff, every time I call I get someone who is nice, understanding, and helpful, even when it comes to highly technical questions. AND THEY ARE BASED IN US! Sorry but I hate call centers that have been outsourced... its just well, frustrating.CONS: (all personsal preference)- It doenst have TRAFFIC CAMERA SPEED TRAP CAMERA INFO ON IT, this is a big deal in Chicago, but I am sure that I can find a app to connect it so that I can get these, just have to search- ITS HUGE, please make note this is one of those things you will have to take off your window or dash when you close down for the night if you live in a populated area. It has STEAL ME written all over it.- I dont like the original voice, going to change it for sure.- Traffic updates dont give you a linear line like tomtom that allows you too see where the congestion is and what the delay will be in said congestion, this would be nice.OVERALL: This device is easy to set up, it is easy to follow, it has everything a daily commuter would need and more. It has been a great experience so far moving to this device from my tomtom (which cost twice as much) I now have 8 Garmin Devices from my vivosmart to my cycling gear to my fishing gear. I would suggest this product to anyone who is looking for high quality that will last and will fit into a mid level budget.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DaytonaDan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMQR5AJXGFA7T6HRRDXOBZBQOJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KCAKR3Y5UQ8U?ASIN=B00TIYNGBY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2015",
                "reviewTitle": "4.0 out of 5 stars Best Nuvi in a while but not without problems",
                "reviewText": "I have been using Garmins since the first black and white automotive units went on sale and in many respects, this is one of the best models I have seen in some time. The big 6 inch hi-res glass screen in very easy to see (as long as there is not too much glare); the unit is powered by a very fast processor that reroutes almost instantly and does well with most voice commands if clearly spoken. I also really like the slide out options screen on the left side, which can display traffic, trip information or details about upcoming points of interest (gas stations, restaurants, etc). The new advanced lane guidance is a nice plus, as are the more natural voice directions, which will sometimes tell you to \"get into one of the two left lanes\" before a turn or tell you \"turn at the stop sign\" (or other landmark).Despite that, there are still some maddening problems that have been the hallmark of the Nuvi line for some time. The worst is that the guidance is simply not very good any more, which is ironic since that is the main reason for owning a GPS. Routing is always heavily tilted toward interstate highways and large multilane highways, regardless or whether that's actually faster or not (often it is not). I put this to the test on a recent cross state trek. As usual, the Nuvi wanted me to take the interstate through always congested and accident prone Orlando, which I always try to avoid. I opted for another route via lightly traveled backroads (which I discovered using a much earlier generation Garmin). I knew from experience this was almost as fast, or faster if you got stuck in an Orlando traffic jam. As usual, this unit spent the first 20 miles trying to get me to do a u-turn back to its preferred route or an alternate route back to traffic clogged I-4. All the while, the projected arrival time kept getting later and later. When it finally became clear I was not going to take that route, the Nuvi finally suggested my known route. Interestingly, the arrival time suddenly fell back to almost the same time as the recommended interstate route from home. Maddening but Nuvi routing has grown progressively worse over the years. It may get you to your destination but its doubtful it will be the fastest route.This unit has free traffic and I had a power cable from an earlier Nuvi that allowed me to upgrade to HD traffic (supposedly updates every 30 seconds in covered areas). If you can go that route, you get free current weather too, which is nice. No smartphone link required. Also improved... if there is traffic on your route, it tells you immediately on departure, even if many miles away. So you can plan an alternate route. But it failed to alert me to a serious traffic accident on the return trip (this time I did take the interstate) until I had already been at a dead stop for about five minutes. Traffic on the Nuvis has always seemed a mixed blessing, Works maybe half the time...Despite the shortcomings, this model provides good bang for the buck, especially if opting for the refurb unit (mine looked and functioned as new). Routing is black mark and the POI is always dated. If you live in a area with constant roadwork, you will find the maps, even the newest ones (you can update free four times a year for life), are often wrong. But no GPS is perfect. This is a pretty nice unit, far better than the one that came with my car and cost many many time more. In fact, this Nuvi cost less than a single year map update for my in-car unit.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ben C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZI4K5XIYM6OKELUMXXAEXKF7OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26IT5ETXPZ7RQ?ASIN=B00TIYNGBY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 24, 2016",
                "reviewTitle": "5.0 out of 5 stars Excellent product!",
                "reviewText": "Excellent product!Pros:- Very accurate mapping- Spoken directions are clear and concise- Voiced commands actually work!- Doesn't say \"RECALCULATING\"- Traffic function is very helpful in larger metropolition areas- Doesn't need separate reciever for Traffic function- Blue tooth is helpful for older vehicles without it already- Lifetime Map updates- Lifetime Traffic updates- 1 yr Manufacturer warranty- Its Huge!- PriceCons:- Voice command function takes a little bit of patience to learnOther thoughts:Purchased this for an vehicle which my GF drives. Took the Garmin with me on an out of town trip to a city I had never been. I have in-car nav that charges $250 for yearly updates that is pretty accurate. I thought it would be a good test drive or the Garmin without the likelyhood of getting lost somewhere along the line. Not once did the Garmin let me down. By the end of the \"test drive\" I was wondering how to install the Garmin where my Nav system currently resides. :-) Don't let the Refurbished label sway you from buying this fine multifunction navigation device. It is a steal for the price given its functionality. Buy this Garmin! Enjoy it then tell a friend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}