{
    "remaining_requests": 40017,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SinoTrack-4G-ST-901L-Waterproof-Motorcycle/dp/B09QYG17S8",
    "body": {
        "name": "SinoTrack 4G GPS Tracker for Vehicles, ST-901L LTE Mini GPS Tracker Waterproof Locator Real-Time Location Device for Car Motorcycle Truck Taxi with No Monthly Fee Tracking System",
        "price": "$49.99",
        "originalPrice": "",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SinoTrack-4G-ST-901L-Waterproof-Motorcycle/dp/B09QYG17S8",
        "soldBy": {
            "sellerID": "A1IF15T2AAE0JS",
            "name": "SinoTrack",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1IF15T2AAE0JS&asin=B09QYG17S8&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 7% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41 KVOtMzIL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51r2CYY2ZTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61CKV tOIrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519Ehs1shpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cS7u9jTqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51aucBiR-6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81DSftoOtKL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12bc5489-5b95-41f5-b9a1-3c18369641da/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1rE2kjzNtL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1rE2kjzNtL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the SinoTrack Store",
            "link": "https://www.amazon.com/stores/SinoTrack/page/9E862F0D-EF32-4B97-97AE-E59795800229?ref_=ast_bln"
        },
        "brand": "SinoTrack",
        "merchantInfo": "SinoTrack",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 208,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 11 hrs 57 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Cut Engine Remotely】4G gps tracker include relay, when you found your car was stolen, you can control your car remotely on your phone, cut the engine by sending SMS command, the vehicle will stop move until it received your SMS command “9400000”, prevent theft of your car on the parking lot.(the car running below to 20KM/h will stop within 10-20sec when it get sms command)",
            "【MAIN FUNCTION & 4G NETWORK】SinoTrack mini car gps tracker for Motorbike, Built-in WCDMA, GSM and GPS double antennas with ACC to detect ignition.(SIM Card Not Include). ST-901L 4G（2G+4G）GPS tracker for vehicles, very simple and easy to use for Motorcycle, Truck, Taxi, etc.Text message alerts for movement, speeding, leaving or entering areas, low battery,Shocking, driving reports historical data saved during service. Real time gps vehicle tracker built-in backup battery",
            "【SUPPORT TRACKING PLATFORM LIFETIME】Waterproof gps tracker for cars with online tracking service subscription. Buy a SIM card for the device (this GPS locator not include a SIM card, you need to buy another one), search sinotrackpro login or download Sinotrack Pro GPS APP from your tablet, pc or phone lifetime. Real-time tracking is available at no additional cost",
            "【REAL TIME TRACKING】Real-time car GPS tracker ST-901L 4g gps tracker for vehicles hidden Locator based on LTE, GSM , GPRS network and GPS satellites ,locating and monitoring remote targets with our own GPS tracking APP or web, which display of location information accurately ( Positioning accuracy up to 10 meters )",
            "【HISTORY MEMORY】Sinotrack 4g gps tracker for motorcycles,car,truck and taxi can save 2 years of tracking history. Sinotrack gps tracker no monthly fee with 2 time interval,You can view and play back your daily tracking history,and when the car goes to a place,you can make a clearer judgment.Attention Please:we recommend SpeedTalk SIM card,don't use T-mobile"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.54 x 2.04 x 0.66 inches"
            },
            {
                "name": "Item Weight",
                "value": "5.3 ounces"
            },
            {
                "name": "ASIN",
                "value": "B09QYG17S8"
            },
            {
                "name": "Item model number",
                "value": "ST-904L 4G gps tracker"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 208 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,946 in Electronics (See Top 100 in Electronics) #53 in GPS Trackers"
            },
            {
                "name": "Date First Available",
                "value": "January 22, 2022"
            },
            {
                "name": "Manufacturer",
                "value": "SinoTrack"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "SinoTrack"
            },
            {
                "name": "Special Feature",
                "value": "Waterproof,Cut Engine Off,Real Time Tracking, Alert Notification, Geo-Fence, History Route Playback, Rechargeabl See more"
            },
            {
                "name": "Connectivity Technology",
                "value": "Cellular"
            },
            {
                "name": "Supported Application",
                "value": "SinoTrackPRO"
            },
            {
                "name": "Specific Uses For Product",
                "value": "for gps tracker car,car alarms,car Anti Lost Alarm tracker"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "ACC function is used to detect the ON/OFF state of the car engine.If the ACC is not connected, it will not affect the normal use of the tracker",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97867f64-3a2d-4bd0-bda3-80a2a5446510.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Real-time Tracking Anywhere and Anytime With SinoTrack gps tracker device, easily to check your cars, teenagers, workers in real time. Connecting device to your car and know your cars real-time location, trip histories, driving habits, etc. The ST-901L 4g GPS location tracker use about 30MB data per month. It built-in 150 mAh backup battery, When the engine starts will charging. Or you can connect it to your car battery directly, it will always online no worry outage.The ST-901L 4g gps tracker is compatible with any Smartphone, tablet, computer, etc. You can login to your account and track the car on Google maps via our free tracking platform anytime and anywhere. Never worry where your car, teenager or loved ones are. It can monitor if they’re safe.Functions1.Build-in GPS Vehicles locator2.Support LTE-FDD B1/B2/B3/B4/B5/B7/B8/B28/B66 GSM 850/900/1800/1900MHz3.Support track the real time address by google link4.Built in battery 150 mAh5.Support Geo Fence Alarm6.Support single location7.Support Over Speed Alarm8.Support Low Power Alarm9.Waterproof10.With ACC to detect ignitionCut engine OFF function( Relay include and you need to connect it so that you can use this function)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/939db4af-7bf1-4f50-b134-91ccb2b46ec0.__CR0,41,1000,619_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "This ST-901L 4G gps tracker for vehicles is include relay, when you found your car was stolen, you can control your car remotely on your phone, cut the engine by sending SMS command, the vehicle will stop move until it received your SMS command “9400000”, prevent theft of your car on the parking lot.(The car will stop within 10-20sec when it get sms command)Recover command:9410000 Attention：Only the car running below to 20KM/h,your car can stop when it get text command within a few sec. If the car running more than 20km/h,then your engine can't cut off.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/228aed02-c362-469e-acc1-ec9bfb5c4999.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "More Details Easy to Install The ST-901L 4g GPS tracker include 2G and 4G networks.When you active your tracker,then you can connect to the car. Orange wire connect to ACC ( ACC Alarm,it can check the engine OFF/ON. If you don’t want connect, it does not affect the use of tracker); Black wire connect to power “-”; Red wire connect to power “+”.Yellow wire is connect to Relay. Waterproof GPS Tracker for Cars Waterproof material, added dense design and deeply waterproof, could prevent rain and dirt. It also prevent any bad environment. It is suitable for outdoor use.(Attention: Please don’t put into water directly) History Route Playback Using our sinotrackpro tracking platform provides history reports mapping all past locations, speed, addresses with dates and times via Web / App anytime and anywhere. Sinotrackpro gps tracking platform updates every 30 seconds gives you a real-time view of what happened for anytime. Know where your Loved ones Install it in your teen, daughter and loved one’s vehicle to monitor speeding and safe driving. You can login to our tracking platform to check where they are. If your father too far away from his home and into a potentially dangerous situation, you can find him immediatelyanytime and anywhere.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9bc7b348-e259-4cc4-9cce-e29c67e943d3.__CR0,0,1001,1001_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d815c2cf-4756-4565-b933-69e48ab31b56.__CR0,0,2800,2800_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/51b51a3e-7b75-4349-b03b-717554523de3.__CR0,0,1001,1001_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ae3c882c-f34e-467b-bec2-235dae7b3a8c.__CR0,0,600,600_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Multiple Devices in One Account If you’re a Fleet manager who needs to manage your many vehicles at the same time, please send your all ID numbers and tell us what’s username you want, we will help you create a group account, then you can see all cars on one APP/Web platform. You can check your car anywhere and monitor your workers are lazy, you don’t worry if your car safe and workman if working hard.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30b94df8-24cf-47fd-ab85-987b8a21dc02.__CR0,0,1001,1001_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Features Operating temperature -20℃to 55℃ Operating Humidity 5% to 95% Non-condensing Quad Band LTE-FDD B1/B2/B3/B4/B5/B7/B8/B28/B66 GSM 850/900/1800/1900MHz GPS Chip SIMCOM A7670SA GPS sensitively --162Db Location Accuracy 5-10 meters Time Accuracy 1 microsecond time synchronization of satellite time Operating voltage 9-80V Function1 Build-in GPS Vehicles locator Function2 Support track the real time address by google link Function3 Built in battery 150 mAh,when the engine starts will charge,no worry outage Function4 Support Geo Fence ,single location,Over Speed Alarm,etc Function5 With ACC to detect ignition Function6 Waterproof Function7 With Cut Engine OFF function Package include 901L gps tracker*1; Relay*1; Usermanual*1,double-sided sticker*1",
                "media_link": []
            },
            {
                "media_text": "HOW TO QUICKLY SETTING UP THE TRACKER? STEP 1. – Activate Sim Buy a local SIM card with 4G(LTE) network function and Install the new sim card into your mobile phone and activate the sim card and remove SIM card’s PIN code. Make sure it can make a call, send a text and has an internet connection. Once this is confirmed, insert SIM to your tracker. STEP 2. – Turn on the tracker Charge it about 1 hour first. The yellow and blue indicator lights will start flashing while it searches for a network and GPS. Please wait 5 minutes in a good reception area (by a window or outside) for both lights to come on constantly. It will continue to flash yellow if it can not find a network. Move it to another location. Please note, when the device has a GPS signal it will get a GPS location. If not it will get its location using LBS. STEP 3. - Setting APN for the tracker (1) You need to know your tracker’s SIM card's APN (You can ask your SIM card provider); (2) Please note the following operations need From another phone number send text messages command to the tracker’s sim card’s phone number to set tracker's APN. For example: APN is: everywhere APN username is: eesecure APN password is: secure (1) If your SIM card’s APN without username and password, then send text command(8030000+space+APN) to the tracker, it will reply “SET OK”. Text command is: 8030000 everywhere (2) If your APN with username and password: Then sned text Command(8030000+Space+ APN+space+ APN user+Space+ APN pass) to the tracker : 8030000 everywhere eesecure secure Please note: Different SIM card has difference APN. Please apply the above formula according to your actual APN to set up your machine STEP 4. - Setting GPRS mode Send text command to the device to set GPRS mode:7100000 Then wait about 30sec, both blue and orange light should stay ON which mean you can now login to sinotrackpro web or app to check if tracker active. (Username is your tracker’s ID number that write on the product, password: 123456) If you set ok of all, you can track it online. If it online but show China location, then take it to the outside which signal good place to get GPRS signal, when it get signal, will update your location. If the device is not online, please check device setting, send: RCONF to device, It will reply the setting you can check in reply: 1. The APN if is correct; 2. The IP and Port if is correct(IP and port are write in the usermanual,you can check if same as reply) 3. The device working model, (GPRS model)",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97867f64-3a2d-4bd0-bda3-80a2a5446510.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/939db4af-7bf1-4f50-b134-91ccb2b46ec0.__CR0,41,1000,619_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/228aed02-c362-469e-acc1-ec9bfb5c4999.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9bc7b348-e259-4cc4-9cce-e29c67e943d3.__CR0,0,1001,1001_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d815c2cf-4756-4565-b933-69e48ab31b56.__CR0,0,2800,2800_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/51b51a3e-7b75-4349-b03b-717554523de3.__CR0,0,1001,1001_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ae3c882c-f34e-467b-bec2-235dae7b3a8c.__CR0,0,600,600_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30b94df8-24cf-47fd-ab85-987b8a21dc02.__CR0,0,1001,1001_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "bronsonj",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFSLUNYKEPHLAEKJXLBNSKYSR3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1U1TNDPWOQ470?ASIN=B09QYG17S8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 22, 2023",
                "reviewTitle": "5.0 out of 5 stars NOT a 5 minute install but it works well",
                "reviewText": "I can do my own stereo, speaker and amp installations. I can R and R a transmission but not rebuild a transmission. So I'm plenty qualified to install this even though I'm not an ASE certified tech.Take a picture of the ID on your device! Activate your full size SIM card before inserting in the GPS!Once you get through the install process the unit works well. The description recommended the 'SpeedTalk' SIM card so that's the one I purchased. $5 a month so cheaper than the phone app and you can't turn off this GPS whereas you can turn it off on the phone.The instructions are clear enough. I was confused about the APN. The instructions say \"please check with your SIM card provider if you don't know it\". That's incorrect. The APN is the example APN that is shown in the instructions in step 6. I sent the short APN message. After that I sent the middle-length APN message in step 7. I did not send the optional APN message with the user ID and password at the end of step 6.Once I did this I logged into their website and nothing (initially)... Shows some location in California which I'm guessing is their HQ. I then looked at the instructions and in the Function section I did #4 to get a google link, no link was sent back. I then did item #1 in function to set control number. Again, the website doesn't work. So I put the app on my iPhone and it works great! Now it's day 3 and I tried the website again and it works fine and it is much easier to view than the app.The app is rated poorly. The app is 4 years old. The app works though. It is clunky and takes a minute to get used to. Don't be put off by the rating. They *should* update the app a little just to get better reviews if nothing else. Severalcomplaints were about 2G service which is no longer around and people were setting it up while 2G was going away. Now this device is 4G and everything I found says 4G will be here for another decade (until 2033) or more.I am using this on a golf cart and I wanted to keep it modular so I could easily move it to another vehicle if need be. To do that I connected the power (red) and accessory (orange) together to 12v positive. I connected the black to negative. I cut the end of the yellow so it couldn't make contact and I did not install the relay. It's another point of failure and so I wanted to avoid that in case I made a bad connection. I zip tied this to the cart frame. The only physical install issue I had was when I pulled the GPS apart to put in the full size SIM the wires unfold that are inside and it takes a little bit to get them all back in. I also dropped one of the screws which took some time to find so don't do this part in the driveway like I did, put the activated SIM in the GPS while at the kitchen table.The replay function defaults to the current day, but you can click on it and pick any begin/end date/time. The speed shown on the reply is accurate enough. My golf cart is limited to about 20.5 mph. On the first trip it showed a top speed of 33kph which is exactly 20.5mph but I know I was doing 20 for longer than the app showed. On the second trip it showed 35kph which is a little faster than I went but still pretty close. Also, I have been unable to figure out how to switch to MPH.If I need to switch this device to another vehicle I just pull off the two spade terminals and mount it in the next vehicle. Because I didn't use the cutoff relay it's as simple as using a zip tie to mount it and connecting the + and -. If you use the relay it will be harder to move.I'm paying $12.99 a month now for an app that tracks stuff, but now I'm going to cancel that and just pay the $5 a month SIM card. I'm very happy with this purchase even though the activation took 30 minutes for the SIM activation and the GPS activation/configuration. Physical install took less than 10 minutes.Absolutely recommended.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDQK5MWUSUK6ZV5RHR4ZR2BHC7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26QP248D2GYUU?ASIN=B09QYG17S8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2022",
                "reviewTitle": "5.0 out of 5 stars Nice unit",
                "reviewText": "I have 1 on both my bikes. I had there older model 3G but do to no more 3g cell phone tower in the USA they no longer worked. I bought this 5g one and it works great. This model now includes that not in the description they actually include the relay. Under this GPS tracker there is an option to turn off the fuel pump or you could wire it to your ignition coil. But the older models never came with a relay or whatever you needed to actually make that work. It was an actual surprise when I opened up the box for this one and it actually included to the relay to actually make that option work. So if you wired it to your fuel pump or your ignition coil if someone stole the bike or car you could actually kill either or and the bike or car with no longer run. I tested the wire that would go to a relay because there is actually no instructions on how to wire this relay to the GPS unit. When I tested the GPS tracker wire when you activate or deactivate it it only sends out if I remember correctly .5 Volts to one volt. So I am guessing that you would actually tie that to the ground on the relay. .5 to 1 V would not be enough to actually operate a 12 V relay to activate it. So I think they are activating it through a ground system. So the relay would have constant power and once you activated the ground it would activate the relay.I’m giving it five stars due to I did not expect to get the free relay that I actually need to use that option / Feature in the GPS tracker. I am torn by maybe should I give it four stars because there’s no instructions on how to wire this relay to the tracker. 🤷🏻‍♂️",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teddy Lew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2WBFBVQBBJAKTOBRVEZNYXTOXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16LT3HYL0HSZ3?ASIN=B09QYG17S8",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "1.0 out of 5 stars Work only does 30 days",
                "reviewText": "This GPS is no good, there's no way to get to technical support.Works good in the beginning and start acting up",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karlectron",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGC2CLYFQ3LLY3KEC7BSCEKKPPUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HY96XRF945KP?ASIN=B09QYG17S8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Would order another. Pretty straight forward.",
                "reviewText": "Received my ST-901 (4G) from Amazon. Bought the Speedtalk SIM. $5 per month with credit card auto pay. Downloaded SinotrackPro app. Visited website. App gives me more functionality than the webpage. Easier for me to send SMS commands to device phone number to program. Many app buttons are incompatible for my device. Got Geofence and sms alarm to cell programmed. That’s enough for now.I emailed SinoTrack with a question. No reply in 4 days. So I can’t rate the customer service at this time. They sent a reply after 6 days.Question: how to add additional gps trackers in the app?Question: how to recover a lost password on another ST-901? One was installed in the used car I bought. Dealership said it wasn’t theirs. So now it’s mine I guess. :)I like this unit so far after one week. Putting into my trailer since my friend got his rig stolen. A little piece of mind.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AAG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMSHOMCDN2ZB64TPHTRQFFLJOHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1076IHOAO0OPY?ASIN=B09QYG17S8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 16, 2023",
                "reviewTitle": "5.0 out of 5 stars It works great. It has many features and the platform is free.",
                "reviewText": "Hello, These are very good GPS's with many featutres and best of all the platform is free. You only need a $5/month sim card with 100MB data and SMS. I have installed over 100 of this GPS units for my customers without a problem. Occasionally one is defective but that is uncommon.I alsoi want to let the seller know that A few days ago I placed an order for 12 pcs ST901 GPS. After I received them I had 2 pcs that did not work. My intention was to return 2 pcs for replacement but by mistake I marked all 12 pcs for replacement. So I am returning 12 pcs but only 2 pcs are bad and the other 10pcs are good. I am sorry for the confusion. Please accept my apologies. Thx for your understanding and have a great day.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}