{
    "remaining_requests": 40033,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/IZZO-Golf-Swami-Handheld-Unit/dp/B0C7JH3GV5",
    "body": {
        "name": "IZZO Golf Swami Max Handheld GPS Unit - Rangefinder Golf GPS with Oversized Large Color Screen for Measuring Golf Distances",
        "price": "$170.22$170.22",
        "originalPrice": "$179.99",
        "rawPrice": 170.22,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/IZZO-Golf-Swami-Handheld-Unit/dp/B0C7JH3GV5",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/414Im mqFTL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ZDtvt-6yL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41CsyTwfhNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tKz7 FEyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51avhQ2wS8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vlM4IqhYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lwIMqRyfL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24076092-fb3d-4b0c-8097-4e0f8ae9d6fc/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Izzo Store",
            "link": "https://www.amazon.com/stores/IZZOGolf/page/C83956B6-8B99-4A40-ADF0-402FBB874992?ref_=ast_bln"
        },
        "brand": "IZZOGolf",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 17,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 9 hrs 28 mins",
            "FREE pickup Sunday, February 18",
            "Or fastest pickup Tomorrow, February 14. Order within 19 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fast and Accurate: the gps unit provides fast accurate distances to hazards and the front, center and back of the greens which are accurate within */- 6 yards",
            "Hands Free Use: the gps unit comes with integrated magnets so you can securely stick it to the metal cart frame for easier use.",
            "Rechargeable Battery: this golf gps unit features a rechargeable lithium ion battery that lasts up to 16 hours on a full charge",
            "Easy to Use: the gps comes preloaded with over 38,000 courses worldwide and features shot distance measurement, a digital scorecard and auto-hole advance",
            "Durability: the Swami Max golf gps is completely water and fog resistant so it is safe to use on rainy days or foggy mornings"
        ],
        "description": "Introducing the Swami Max Golf GPS Handheld Rangefinder. The Swami Max Golf GPS features a large lcd color screen that can be affixed vertically or horizontally to meet your visual preference. It also features integrated magnets so you can securely adhere the GPS unit to the metal cart frame so you can quickly get accurate yardages, accurate to within +/- 6 yards. The device will provide accurate yardages to the hazards as well as the front, center and back of the green. The Swami Max will remove some stress on the golf course as you never have to worry about advancing it to the next hole with auto-advance technology. The handheld GPS device features a rechargeable lithium ion battery that lasts up to 16 hours on a full charge and can be charged using a USB charging port. The golf GPS comes equipped with more than 38,000 preloaded golf courses worldwide and is water/fog resistant.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "Sports & Handheld GPS",
                "link": "https://www.amazon.com/GPS-Units/b/ref=dp_bc_aui_C_3?ie=UTF8&node=219536011"
            },
            {
                "name": "Golf Course GPS Units",
                "link": "https://www.amazon.com/Golf-Course-GPS-Units/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3411001"
            }
        ],
        "productInformation": [
            {
                "name": "Item Package Dimensions L x W x H",
                "value": "‎5.71 x 5.59 x 1.73 inches"
            },
            {
                "name": "Package Weight",
                "value": "‎0.29 Kilograms"
            },
            {
                "name": "Brand Name",
                "value": "‎Izzo"
            },
            {
                "name": "Warranty Description",
                "value": "‎1 Year"
            },
            {
                "name": "Model Name",
                "value": "Swami Max GPS"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Material",
                "value": "‎Plastic"
            },
            {
                "name": "Suggested Users",
                "value": "‎Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "‎IZZO"
            },
            {
                "name": "Part Number",
                "value": "‎Does Not Apply"
            },
            {
                "name": "Included Components",
                "value": "[1] Swami Max GPS"
            },
            {
                "name": "ASIN",
                "value": "B0C7JH3GV5"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 17 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#259,950 in Sports & Outdoors (See Top 100 in Sports & Outdoors) #136 in Golf Course GPS Units #1,475 in Electronics & Gadgets"
            },
            {
                "name": "Date First Available",
                "value": "November 3, 2023"
            },
            {
                "name": "Brand",
                "value": "Izzo"
            },
            {
                "name": "Screen Size",
                "value": "2 Inches"
            },
            {
                "name": "Special Feature",
                "value": "Touchscreen"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Map Type",
                "value": "Worldwide"
            },
            {
                "name": "Battery Life",
                "value": "16 Hours"
            },
            {
                "name": "Resolution",
                "value": "480 x 272"
            },
            {
                "name": "Display Type",
                "value": "LCD"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Swami Max Golf GPS Rangefinder",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2909dced-3e50-4fb2-8e90-0477bf70b0ad.__CR0,2,980,606_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "All The Features You Want From A Golf GPS Max Visibility Elevate your golf experience with the Swami Max Golf GPS Rangefinder, a game-changer designed for the discerning golfer who seeks convenience without compromise. Say goodbye to the days of squinting under the sun's glare thanks to its unrivaled industry-leading 3.5-inch color display, delivering unparalleled clarity and legibility. Whether you're an amateur or a seasoned golfer, the Swami Max is your ace on the course. With just a flip, engage its unique landscape mode for an instant enlargement of yardage numbers, ensuring critical game information is always available at a comfortable glance. Golfers, amplify your game with the Swami Max—where superior visibility meets cutting-edge technology. This handheld golf GPS rangefinder is a must-have for any golfer looking to shave strokes off their game with confident, informed decisions from tee to green. Hands Free Use Experience the convenience of the Swami Golf GPS Rangefinder, your ultimate caddy for an enhanced golfing experience. Embedded with powerful magnets, this handheld device easily secures itself to the metallic expanse of your golf cart, providing effortless access as you maneuver through each course. The magnet strength is perfectly balanced, ensuring that your GPS rangefinder stays put over bumpy terrain yet can be detached without a hassle when needed. Crafted with the discerning golfer in mind, the Swami Golf GPS Rangefinder is designed to eclipse conventional handheld units. Say farewell to the days of juggling devices and focus solely on perfecting your swing. This innovative rangefinder promises to enrich your game, allowing more time to plan your next shot and less time fiddling with equipment. Landscape Mode Experience precision on the links like never before with the Swami Max Golf GPS Rangefinder! Crafted with clarity in mind, this handheld marvel banishes the strain on your eyes, usually associated with smaller screens. Flip it horizontally for an expansive landscape view that brings yardages into sharp relief, making them a breeze to read at a glance. Golf enthusiasts will recognize how crucial quick and unambiguous distance readings are for those critical shots. The Swami Max doesn't just deliver accuracy; it presents it on a layout that's intuitive for the golfer in action. Stroll confidently across the course, armed with technology that's built to enhance your game. Invest in your golfing prowess with this essential tool, available now for avid golfers and discerning Amazon shoppers alike. Don't let a good game get away—ensure that every swing counts with the Swami Max Golf GPS Rangefinder, your handheld companion for hitting that perfect shot. Loaded With Courses Explore a world of golf like never before with the Swami Max Golf GPS Rangefinder—your ultimate caddy preloaded with over 38,000 courses across the globe. Designed for the most discerning of golfers shopping on Amazon, this handheld marvel requires no extra fees for course updates or subscriptions. Frustrated because your favorite course isn't listed? Worry not! Simply visit our website, drop us a quick message, and we'll chart it out for you without charge. With the Swami Max, you're not just purchasing a rangefinder; you're unlocking the possibility to download new courses from the comfort of your own home at no additional cost. Crafted for golf lovers seeking precision and convenience, this state-of-the-art golf GPS rangefinder offers an unparalleled golfing experience.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca55dd1b-3576-4069-863f-fab98969ea01.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0de2bc0-b211-4c60-8832-930bd6474642.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1bb3a2e-020d-4b9d-8431-d94c7a6a2160.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64a9da66-0f83-4c80-8e08-3424a1395591.__CR0,0,220,220_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Handheld Golf GPS Rangefinder Maximize your golf game performance with the Swami Max Golf GPS Rangefinder, meticulously designed to be the ultimate companion on the green. At an ergonomic 4.25 inches high by 2.75 inches wide, it's the quintessential handheld device, providing an exquisite balance of comfort and accessibility. Its compactness ensures it rests in your hand like a natural extension of yourself, rendering the days of unwieldy and large rangefinders a distant memory. The Swami Max isn't just about size; it's crafted for the golfer who knows the value of efficient practice. With its integrated magnets, the convenience is unmatched—securely attach it to your metal golf cart, and transition to a hands-free experience as you navigate the course. Whether you're an enthusiast improving your handicap or a competitive golfer seeking precision, this petite powerhouse holds the potential to redefine your game.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7a380ed-fc83-452b-b079-de9e5224536d.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Sleek Design Crafted for the discerning golfer, the Swami Max Golf GPS Rangefinder is the epitome of sophistication and functionality. With its ultra-slim profile, measuring under an inch in thickness, it epitomizes the perfect blend of comfort and sleekness in handheld golf tech. As you maneuver through the fairways with precision, this handheld golf GPS fits naturally and effortlessly in the palm of your hand, ensuring that your focus remains unbroken as you prepare for your next masterstroke. Among its signature features, the Swami Max solidifies its status as an indispensable golf accessory with built-in magnets. These magnets prove to be extraordinarily convenient, seamlessly attaching the device to any golf cart as though it were a natural extension of it, ready at your beck and call.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36b046e8-b744-488d-b3af-094e598dd5e5.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2909dced-3e50-4fb2-8e90-0477bf70b0ad.__CR0,2,980,606_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca55dd1b-3576-4069-863f-fab98969ea01.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0de2bc0-b211-4c60-8832-930bd6474642.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1bb3a2e-020d-4b9d-8431-d94c7a6a2160.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64a9da66-0f83-4c80-8e08-3424a1395591.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7a380ed-fc83-452b-b079-de9e5224536d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36b046e8-b744-488d-b3af-094e598dd5e5.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Matt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5KSSRPRUOYFKANZVOKXCA2PAEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MR93K1VYHPAY?ASIN=B0C7JH3GV5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy to use",
                "reviewText": "So much better than my range finder. Tired of taking the time to shoot every flag. No subscriptions needed. Strong magnetic so it holds tight to cart. Small enough to fit in pocket if it's cart path only. MUST have for every golfer!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Will PWill P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSFIQXWLW25N5UDQBC4TLSJQMHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AKFFL7PP47IV?ASIN=B0C7JH3GV5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "4.0 out of 5 stars Different approach to your golf range options while on the course!",
                "reviewText": "First.. comes with USB A to USB Micro charging cable. Charge it up before first use.I've tried to give some pictures with it out in very bright sunlight. Sorry, too cold right now to get an actual usage on the golf course.First off. It takes a few mins to find the satellites and pull up the courses the first time, so please fire it up while outdoors early. Seemed to come up faster on later 'power ons'.It's got a few different display options, but the default I like the best.Display 1: Center (largest number), front and backDisplay 2: Displays center yardage and you hit 'ok' to see the other two.Has both portrait and landscape modes for each display.Has a very nice magnet on the back, pretty strong. I've yet to see how well it handles bouncing on a golf cart yet - will report back after I take it for a spin and some bounces.Has a scorecard option you can turn on. You have to turn it on in the settings.Also, a nice feature is that you can hit the 'ok' button to see how far you hit it. Btw, have to turn this on in the settings too.It does have distances to hazards.So once you click on Play Golf. It's going to sort the courses from closest to furthest away. And for some reason, the font size on the display will not show the full course name. Would have been nice to shrink or let me shrink to see more. Then click on an option to get more details on the course - but it does not have this. So you'll end up seeing two of the same line but that's for the 1st and 2nd course. You won't know which one until you get to the course and trust the top option to be the course you're about to do. Not knocking this, but just a different experience I'm used to with my Garmin.Overall, I really like the concept since it's got such a large display to help out your cart mate vs. the smaller clip on your belt option. So if you play on older courses that the golf cart does not have this yardage features built in, definitely consider this as an option. And the courses are already in there.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71G6Qh3jGEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Unz8bGALL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71VGN3wpIWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Og-3717AL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81dMVwb9SyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEU36YQ3ODZXRPJTPOL6JSY7B3QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FVY6GMMC7LH3?ASIN=B0C7JH3GV5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Very accurate to hit.",
                "reviewText": "I've utilized Golfbuddy smaller than expected golf GPS's previously and albeit truly reduced, they are difficult to peruse and track down courses. This Izzo is obviously two times the size however it's still generally little and lightweight. I can't as effectively stuff it in my pocket however the magnet makes a difference. I can take advantage of the truck or I could get one of those attractive golf pack cuts. I like how the screen pivots albeit vertical feels significantly improved in the hand and is typically the way that I'm seeing it. Battery duration is all that could possibly be needed for an end of the week outing. I've attempted to give a few pictures with it out in exceptionally brilliant daylight. Apologies, too chilly right now to get a genuine utilization on the fairway. However, i truly do wish it had some additional usefulness at the cost they're requesting it. The sticker cost contends with a portion of the major, notable units out there, and they have additional capabilities like a guide of the opening and a more hearty scorecard that can be traded to different frameworks. While this has a scoring usefulness, it must be turned on, and it's restricted in nature. The GPS is yardage just, with no course includes, however there aren't any expenses so that is an or more.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVVVGVVCT6ZAQGNFXE3CK4OEJMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7BBNJ1N99ZJ9?ASIN=B0C7JH3GV5",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "3.0 out of 5 stars Accurate, but a bit pricey for the limited functions offered",
                "reviewText": "On one hand I like the simplicity of this GPS unit, it displays yardage accurately but doesn't really offer much more than that so I feel it is over-priced for this reason. Also I don't see any way to update the database if you wanted to add more courses in the future. Compared to some free phone apps that I've used in the past, this doesn't really offer much in my opinion. With that being said, if all you want is just basic information that is easy to read, then this might be perfect for you. Just be aware that it charges via an outdated micro USB plug (which is included) so be sure to keep it in your bag for when needed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EcoJon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZHKNLTKSURQSISW32BJD6COPQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXL5B47400NU1?ASIN=B0C7JH3GV5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Another tool for your golf bag",
                "reviewText": "I need this to help me figure out how far off the fairways into the trees I am!I like the fact it isn't another subscription.I like the display is easy to read with large numbers.I feel like if I loan this to my boys they will give the magnet a proper test driving the cart over any and everything.It can keep score if you actually do that while playing.Not sure if I will lose any less balls in the woods thinking I'm going to put it right on the green with this, but I'll test extensively come spring!I'd get this all over again and encourage you to get one as well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tyler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDZSRXMUQYVSU2RPMK4RJ622FPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4MOXEDF2ZI39?ASIN=B0C7JH3GV5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Big Display, Simple Features",
                "reviewText": "First the good, the Swami Max GPS unit from IZZO feels high quality, and functions well as a GPS unit. I have had the pleasure of owning several Izzo golf accessories and all of them feel well made and get put to use on the course for me. This is no exception. The display is bright enough that I can see it on the cart on a sunny day, and the magnetic on the back firms sticks to the cart rails even over bumps and dips. The GPS seems accurate, and had all of the courses I play already mapped.I do wish it had some extra functionality for the price they're asking for it though. The price point competes with some of the major, well known units out there, and they have extra functions like a map of the hole and a more robust scorecard that can be exported to other systems. While this does have a scoring functionality, it has to be turned on, and it's limited in nature. The GPS is yardage only, with no course features, but there aren't any fees so that's a plus.Overall I'm happy with this, the large display is great for double checking distances from several feet away, but be sure to know what you're getting with this. Oh and it is micro-usb. At this point going into 2024, I feel like usb-c should be the standard.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}