{
    "remaining_requests": 39993,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/VYNCS-Premium-Monthly-Tracking-VPOBDGPS1/dp/B01KD2E9H4",
    "body": {
        "name": "VYNCS Premium: No Monthly Fees GPS Tracker OBD 4G LTE Tracking Device for Cars Vehicle Trips Teen Driver Safety Roadside Assistance VPOBDGPS1",
        "price": "$89.99",
        "originalPrice": "",
        "rawPrice": 89.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/VYNCS-Premium-Monthly-Tracking-VPOBDGPS1/dp/B01KD2E9H4",
        "soldBy": {
            "sellerID": "A1MR0LC94VGQFE",
            "name": "Agnik",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1MR0LC94VGQFE&asin=B01KD2E9H4&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ZB3lNJ4lL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/618pkpyZWCS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SehDmntqS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51IeDhxPMjS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cMsRRGu6S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41C3NTRf3UL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Vyncs Store",
            "link": "https://www.amazon.com/stores/Vyncs/page/27937F66-7725-4E5E-92F5-DA6404026868?ref_=ast_bln"
        },
        "brand": "Vyncs",
        "merchantInfo": "Agnik",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 346,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 5 hrs 38 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "No monthly fees, USD 85.99 for renewal in the second year, $39.99 one-time activation fee (refunded if cancelled in 30 days) during signup",
            "Logs trips, 4G car gps tracking, review routes on map, set zones around school house for teens",
            "Get zone enter-exit zone notifications, driving score, real-time tracking, 1 year roadside assistance",
            "Web account, iphone/android apps, fuel, emission, battery voltage, trip score, obd diagnostics",
            "Monitor vehicle activity (location, vehicle health, direction, speed) with a 3G/2G car gps tracker"
        ],
        "description": "Vyncs gps tracker makes owning and driving a car safer, smarter, and a lot less expensive. Plug this CERTIFIED 3G wireless Vyncs Link (SIM card included into the OBD-II port of your car (post 1996), create an account, and you are good to go. BUY ONLY FROM AGNIK (MANUFACTURER) FOR VALID COVERAGE. NO MONTHLY FEE. Price includes device, 1 year of service & data. USD 39.99 one-time activation fee. USD 85.99 renewal fee for the second year. 1 year 24/7 Service and data plan throughout North America. REALTIME GPS tracking. Every 3 minutes GPS update included. Upgrades: 60 sec (USD30/year), 30 sec (USD80/year), 15 sec (USD129/year),1 year data history. Also check out VyncsPro ( Vyncs + 60 seconds GPS + live map), VyncsFleet (for more than 5 vehicles + many fleet features) on Amazon Car OBD tracker. Device size: 2.2 x 1.7 x 0.7 inch. GEOFENCE Zone departure/arrival notifications. Roadside Assistance (towing and a lot more included) in USA. Assistance for stolen vehicle recovery. OBD-II diagnostics. Fault code, check engine light, battery health. Fuel economy, fuel level reporting. Check if fail/pass emission test. Vehicle maintenance reminders. Recall notifications. Driver speeding/braking/rapid acceleration and safety scoring. Feedback about unsafe driving. Keep teen drivers safe. Web Account. Android/iOS apps to browse data from phones on any wireless carrier (e.g. AT&T, Verizon, Sprint, T-Mobile). Powered by Agnik's patented connected car technology. Winner of: 2016 Fleet Logistics Tech Outlook Top-10 Fleet Management Solution Provider, CIO Review 2015 20 Most Promising Automotive Tech. Providers, 2010 Frost and Sullivan Enabling Technology of the Year Award.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "0.94\"L x 1.7\"W x 2.56\"H"
            },
            {
                "name": "Item Weight",
                "value": "0.14 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B01KD2E9H4"
            },
            {
                "name": "Item model number",
                "value": "VPOBDGPS1"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 346 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#86,736 in Electronics (See Top 100 in Electronics) #257 in GPS Trackers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Connectivity technologies",
                "value": "Cellular"
            },
            {
                "name": "Special features",
                "value": "No Monthly Fee, Posted Speed Limits on MAP, 4G LTE Cat M1+Cat NB1+EGPRS OBD Wireless Global device, Mapping Technology: Google [Street & Satellite], 24/7 Roadside Assistance: Included, Data Retention: Unlimited, Engine off Hourly Location"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Human Interface Input",
                "value": "Buttons"
            },
            {
                "name": "Whats in the box",
                "value": "Battery"
            },
            {
                "name": "Manufacturer",
                "value": "Agnik"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Date First Available",
                "value": "August 13, 2016"
            },
            {
                "name": "Brand",
                "value": "Vyncs"
            },
            {
                "name": "Vehicle Service Type",
                "value": "Car"
            },
            {
                "name": "Special Feature",
                "value": "No Monthly Fee, Posted Speed Limits on MAP, 4G LTE Cat M1+Cat NB1+EGPRS OBD Wireless Global device, Mapping Technology: Google [Street & Satellite], 24/7 Roadside Assistance: Included, Data Retention: Unlimited, Engine off Hourly Location See more"
            },
            {
                "name": "Connectivity Technology",
                "value": "Cellular"
            },
            {
                "name": "Map Type",
                "value": "North America"
            },
            {
                "name": "Included Components",
                "value": "Battery"
            },
            {
                "name": "Compatible Devices",
                "value": "Desktop, Laptops, and Any Smart phone with internet access."
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Agnik is a connected car software company that powers many successful connected car products in the market today. Agnik has won several awards for its technology, including 2016 Fleet Logistics Tech Outlook Top-10 Fleet Management Solution Provider for smartphone-based telematics product, CIO Review 2015 20 Most Promising Automotive Technology Solution Providers, and 2010 Frost & Sullivan North American Enabling Technology of the Year Award in Commercial Vehicle Telematics. Vyncs Services Vyncs is a full service connected car solution that uses 3G wireless networks to transmit your vehicle’s data to your account—accessible from your computer and smartphone. It shows users everything from their vehicle’s health and fuel economy to their driving behavior and GPS location— keeping teens safe as well. Vyncs keeps an eye on your car's subsystems so that you know as soon as there is trouble brewing. It also reports fault codes and lets you know if your vehicle has any factory recall notifications. It is integrated with an optional remote start/lock accessory toolkit. No monthly fee 3G GPS tracking Teen driver coaching Vehicle diagnostic maintenance",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/f9e115f8-9c30-4d4a-a4d4-e4c051de8180._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/cfdf6de8-899b-4e6e-9e47-809c653493c9._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "Vyncs Features Safety Keep the teens at home safe by monitoring them and improving their driving with tips based on their driving behavior. Vyncs also offers roadside assistance for those stressful situations on the side of the road. Location Vyncs tracks every trip automatically using GPS technology. Get alerted when family members come and go from places like school, home, and work. If your vehicle is stolen or towed away, locate it with the Vyncs vehicle tracking feature. Maintenance Based on actual mileage and recommended service intervals, Vyncs triggers reminders for oil change, tire rotation, brake pads, and other maintenance needs. Monitor your vehicle’s battery condition.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/c9c67acb-b725-4542-ab14-e1b9256cc86f._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/b97647af-18f2-4f66-aa05-f9a16073bd2d._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/bf7c6b46-b24a-4f5e-937a-bd2279e6a699._SL300__.jpg"
                ]
            },
            {
                "media_text": "Savings from Vyncs Vyncs can help you save money in several ways including fuel economy tips to help you save on fuel and monitoring your mileage. This allows you to identify whether you were driving for work or personal reasons and earn tax benefits. Vyncs also offers savings through its insurance program for drivers with good driving scores.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/d0da7d2e-cd41-4f77-9400-2039a6759f18._SR300,300_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/f93b8b34-e87b-444e-9535-d07f3e3b8513._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/f9e115f8-9c30-4d4a-a4d4-e4c051de8180._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/cfdf6de8-899b-4e6e-9e47-809c653493c9._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/c9c67acb-b725-4542-ab14-e1b9256cc86f._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/b97647af-18f2-4f66-aa05-f9a16073bd2d._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/bf7c6b46-b24a-4f5e-937a-bd2279e6a699._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/d0da7d2e-cd41-4f77-9400-2039a6759f18._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Art Sosa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQZCANRLP5BROPXY6IBODC3H6TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15G2RXRYEI98F?ASIN=B01KD2E9H4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2022",
                "reviewTitle": "5.0 out of 5 stars Excellent Tracker for the point value",
                "reviewText": "I have tried several trackers and found them expensive for the limited options provided.The Vyncs tracker has always been on point. I also added the faster refresh option which works perfectly.The geofencing is easy to use and alerts as stated. Auto maintenance, recalls and fuel level is also an excellent feature.I had this product in my car for a few years now and I love the accuracy, reliability and peace of mind it brings.And let’s not forget the excellent support. Every time I am reached out with question Lisa M. has replied within minutes.Thank you Vyncs for the great product, excellent service and the outstanding support.ArtMiami Lakes, Fl",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "joe smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE27B64JDJXIPGJ6COOUDNCB5KKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGGC5TW25DVBG?ASIN=B01KD2E9H4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Vyncs is a low cost tracking device and app",
                "reviewText": "Have used Vyncs consumer tracker for 3+ years. Accuracy is good, with and occasional glitch here and there.. have the 60 second update which works well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joel Perry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7QLMAF3RSAA53OF6WWY7BI54UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IDSFV85RKA7Z?ASIN=B01KD2E9H4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2018",
                "reviewTitle": "4.0 out of 5 stars Working great, if you don't have a hybrid.",
                "reviewText": "So far everything is working great (one issue noted below), I could wish for better Trip functionality from the tracking screen though (explained below). Also note, this device does everything all of the other ones do, you just have to \"upgrade\" your account for an additional annual fee for each extra feature you add. (Compared to the device my co-worker uses, it still comes out cheaper to use this product, even with the \"extra\" costs added!)As such, I highly recommend adding the GPS 1 minute updates, 3min updates is only good if you are tracking a vehicle that constantly travels on interstates only. once the vehicle gets in to a town area, it is possible to completely miss a stop.My issue with the Trip screen, and only real problem is that my car is a hybrid, and when the electric engine takes over for an extended timeframe it causes the tracker to think the car is turned off. this stops a trip and then starts a new \"trip\" once the electric engine turns back on. As for what constitutes \"an extended timeframe\" I \"believe\" this is anytime the car is in electric mode DURING a GPS pole. So if the car slips to electric, then hops back to gas before the GPS updates, it does not break the trip up. This problem occasionally causes my vehicle to show 15+ trips in a day (in the worst case, and 4 or 5 trips on the good end) when it was only driven to work and then home without stops.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTSKADQBKDT7FEYU34RPMBQWTPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J83T36XQHMSX?ASIN=B01KD2E9H4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2016",
                "reviewTitle": "5.0 out of 5 stars Great value for a good product.",
                "reviewText": "Just added this to my BMW to replace some of the functionality of BMW Assist. The critical functionality are location, road side assistance, and maintenance support, and remote door unlock. This device supports all but the door unlock (no devices support this for BMW yet). Review is on basically the functions I use.Setup: Very simple. Get account, enable device in account, get e-mail to confirm. You then plug the device into the OBD port, start the car, wait five minutes, check the function LEDs for indication of cell connect and GPS sync. VERY EASY.Tech Support. Unfortunately, the system was not updating my location on the first full trip I took. I submitted a ticket to Tech Support by e-mail. The response time was very rapid (less than one hour) and updates started.Based on a limited experience, below are my comments. These will be updated if my experience changes the results.Pros:a. Low cost solution with remote monitoring and no fee.b. Easy setup.c. Great tech support.d. Can get a more frequent location reporting for a rather minimal fee.Cons:a. The system generates a lot of alerts within the application. I would prefer being able to select the alerts I receive to reduce the clutter.b. No door lock/unlock capability for BMW (same is true for other products).",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLN6J64YSRO26UZUOP725H5ULNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YHEQRR1CHB3Q?ASIN=B01KD2E9H4",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2018",
                "reviewTitle": "1.0 out of 5 stars UNIT WORKED A FEW TIMES - RETURNED TO AMAZON",
                "reviewText": "UPDATE 11/22/18After contacting customer service 10 plus times and getting nowhere, I returned this unit to Amazon and will dispute any $30 activation fee with my credit card company.I purchased a \"Spectrum Smart\" unit and it works perfectly in both of my vehicles.UPDATE 11/9/18I am definitely returning. After being installed in 2 different vehicles (one being a 2018 Chevy), this unit has yet to work properly for an entire day. As of this very moment, the unit shows that I turned off my motor (at highway speed) and that the \"last known\" location is 40.8 miles away from my home.I have been updating the tech support numerous times only to be told that my 2018 Chevy \"OBD-II port has somewhat unusual voltage characteristics\"This does not explain why it also did not work in my child's 1999 Subaru.INITIAL REVIEW:Quite disappointed in this unit.Will likely return unit and fight to get my activation fee back from VYNCS.I followed printed directions step by step.Paid the $30 activation fee, etc.The vehicle was driven for 2 days and NEVER updated a single time.Power cycled as per instructions. After power on, vehicle showed \"not moving\" in my driveway. Drove vehicle again for 15 minutes (as per instructions). Unit NEVER updated.Tried the unit in another vehicle (2018 Chevy). Did NOT update location.Customer service does not have a phone number listed.You must \"login\" to your account and open a ticket.Support claims they will respond within 48 hours.",
                "reviewVotes": "87 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 21, 2023",
                "reviewTitle": "VERY GOOD AND EASY TO USE",
                "reviewText": "VERY GOOD AND EASY TO USE",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Collogan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 30, 2020",
                "reviewTitle": "Vyncs GPS is a scam",
                "reviewText": "This product is a scam. It does not work. Support is a joke. They just don’t care.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wayne ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 12, 2023",
                "reviewTitle": "I KNOW WHERE MY CAR IS",
                "reviewText": "I AM USING MY TRACKER IN LIMA, PERU. I WANT TO, AND KNOW WHERE MY CAR IS ALL THE TIME. IT GIVES ME A SENCE OF SECURITY THAT I CAN FIND MY CARE QUICKLY IF ANYTHING HAPPENS.THANKS FOR THE GREAT TRACKER.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin Shad",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 12, 2020",
                "reviewTitle": "Killed my car battery. DON'T BUY THIS !",
                "reviewText": "At least the device I bought was faulty, if not the product itself. It drained the car battery dead in hust 2 days. My wife's Mazda 3 GT started having all sorts of electrical problems, parked or while driving.Also the GPS reading was horrible. Why would a parked car constantly be triggering zone entry and exit alerts?! And if you hope to get a diagnostics reading care of this device, you are not going to have much data to analyze.Although I had chosen to have the route shown on app and browser, I only showed GPS breadcrumbs (and horribly inaccurate).Anyways I had no choice but to opt for a return and reimbursement. Thanks to Amazon, not Vyncs!Hope Vyncs reimburses my $40 activation charge too (which was paid directly), as was guaranteed if the device is returned in 30 days.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 5, 2020",
                "reviewTitle": "Bon produit",
                "reviewText": "Donne l'emplacement de la voiture avec assez de précision, rapporte les lectures de code de l'ordinateur (pas avec autant de précision qu'un ODB2 BlueDriver mais quand même plus facile à lire). Le seul hic, c'est le refresh mais c'est \"tel qu'annoncé\" (refresh aux 3 minutes). Au niveau de l'interface, le seul problème que j'ai vu c'est qu'il indique souvent que le véhicule est en marche à tel endroit, alors qu'en réalité il est arrêté.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}