{
    "remaining_requests": 40142,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Vehicles-Tracker-Waterproof-Tracking-Motorcycle/dp/B01N6H70C9",
    "body": {
        "name": "TKSTAR GPS Tracker,GPS Tracker for Vehicles Waterproof Real Time Car GPS Tracker Strong Magnet Tracking Device For Motorcycle Trucks Anti Theft Alarm TK905",
        "price": "$64.98",
        "originalPrice": "",
        "rawPrice": 64.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Vehicles-Tracker-Waterproof-Tracking-Motorcycle/dp/B01N6H70C9",
        "soldBy": {
            "sellerID": "A3QS0HCNNICI2E",
            "name": "Zeerkeers",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3QS0HCNNICI2E&asin=B01N6H70C9&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41FAd9 ulBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51mdFbEkwdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zbPE9oyuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61ceh3a oYS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51j3QPmVinS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hHaAMfd9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rEFQfaLCL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Winnes",
            "link": "https://www.amazon.com/Winnes/b/ref=bl_dp_s_web_19429474011?ie=UTF8&node=19429474011&field-lbr_brands_browse-bin=Winnes"
        },
        "brand": "Winnes",
        "merchantInfo": "Zeerkeers",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 1449,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 11 hrs 29 mins",
            "FREE pickup Sunday, February 18",
            "Or fastest pickup Tomorrow, February 14. Order within 4 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SIM Card Not Included】: Just like a mobile phone, our car tracker requires a SIM card to work. Works with 4G & 2G network, please buy a 4G/2G SIM card and insert it into our tracker device. Then you can real-time track through SMS, APP and website on mobile phone, tablet or PC. If worked with SpeedTalk SIM whose monthly fee is $5 in the US.",
            "Precise Positioning】: GPS+LBS dual mode positioning provides you peace of mind. If the GPS signal is good, the vehicle tracker will be positioned through the GPS satellite(the accuracy is 16ft-32ft/5-10m); otherwise, vehicle tracker will be positioned through the LBS(the accuracy is 320-3200ft)!",
            "Anti Theft Functions】: Shake alarm | Geofencing | Overspeed alert | Historical playback. Whether it's commercial fleet management or tracking the safety issues of the people you care about when they drive, our tkstar tracker is a perfect choice.",
            "Strong Magnetic & Easy to Install 】: Built-in 5pcs strong magnets, gps locator can easily attach the device to any iron surface, easy to install and hidden. IP65 waterproof, no need to worry on rainy days.",
            "Free APP and Platform for Unlimited Tracking】: We provide a 12-month warranty and lifetime technical support for our GPS trackers, please feel free to contact us whenever you need help. We will respond within 12 hours!"
        ],
        "description": "We have excellent customer service and professional tech support. If you have any questions, PLEASE DON'T HESITATE TO CONTACT US.【Whatsapp: +8615581010480】 TKSTAR GPS tracker is perfect for vehicle fleet management, cars, truck or anything else you'd like to track.【3 Month Extra-Long Standby】:5000mA ultra large capacity rechargeable battery, can standby for 90days Maximum after fully charged(Without using the device at all). Normal Working time:1-3 week.(Battery life depends on how often the device is used. The higher the frequency, the shorter the battery time. The lower the frequency, the longer the battery time) If it shows \"Not enabled\" on the APP, we need to set APN first. Firstly, Need to ask the carrier about the APN informtaion of the SIM card in tracker .( APN name, APN username and APN password) Then send those command: 1. gprs123456 2. apn123456 \"APN name\" 3. apnuser123456 \"APN username\" (no need to set if without apnuser) 4. apnpasswd123456 \"password\" (no need to set if without password) Have a space after 123456 , don’t need to send last two commands if sim card don’t have username and password For example For Speedtalk APN name：mobilenet APN username：（none） APN password（none） Then send 2 commands: 1.gprs123456 2. apn123456 mobilenet If u do not know how to set APN, you can email us via Amazon, we can set apn for you, it's the easiest way. Specifications: Network: GSM/GPRS(2G) GPS accuracy: 16-32 ft LBS accuracy: 328-3280ft Working Time: 3 Weeks Standby Time: about 90 days Size: 90 x 72 x 22mm(3.54\"-2.83\"-0.87\") Package: 1*gps tracker(SIM not include) 1*instruction",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.54 x 2.83 x 0.87 inches"
            },
            {
                "name": "Item Weight",
                "value": "10.5 ounces"
            },
            {
                "name": "ASIN",
                "value": "B01N6H70C9"
            },
            {
                "name": "Item model number",
                "value": "4330271730"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 1,449 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#128,382 in Electronics (See Top 100 in Electronics) #353 in GPS Trackers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "December 15, 2016"
            },
            {
                "name": "Manufacturer",
                "value": "TKSTAR"
            },
            {
                "name": "Brand",
                "value": "Winnes"
            },
            {
                "name": "Special Feature",
                "value": "Waterproof"
            },
            {
                "name": "Connectivity Technology",
                "value": "Cellular"
            },
            {
                "name": "Supported Application",
                "value": "GPS"
            },
            {
                "name": "Included Components",
                "value": "User Manual, Battery"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "sultan laramsultan laram",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5HC5JQODIGQSEVWCNMHOHQLHCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I60JDMEZYUOZ?ASIN=B01N6H70C9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2019",
                "reviewTitle": "5.0 out of 5 stars One of the best",
                "reviewText": "Easy to be use and The battery lasts for 2 weeksAnd real time is very accurateI take a little more time for this review, because I almost had the device as \"disabled\" sent back, as well as others have already done. Now I know, not the device or the app have problems, but I need to set apn for the device. It is worthwhile to deal with it.My opinion:The device is valuable, works flawlessly and is simply a force for this price.The app works flawlessly and can even be extended for multiple trackers.The service from China is outstanding!In detail:The device arrived as usual fast (Prime) and perfectly packed. The scope of delivery includes a charging cable, a transport bag and various SIM card adapters as well as a user manual, which is admittedly incomplete(You can email the seller for help!)The setup of the tracker was fast in a few minutes and the communication with the device via SMS worked immediately flawlessly, the tracker sends back a Google Maps link with its current location. The accuracy is outstanding. Then it became tricky: The download of the app and the installation were still uncomplicated, unfortunately, the app did not work at all. The app always showed that the tracker was offline. After several attempts to change the settings, I wanted to give up and send the device back, because the app is crucial for me. As a last attempt, I contacted the Chinese service via email and shared my phone number for a whatsapp contact. To my surprise, after only a few minutes, I got an answer and a friendly employee of the seller went through all the settings with me via whatsapp. An outstanding service, where so many companies have to be measured! The communication was in English. Problem found and solved!1. GPS Offline means (you can guess): the device does not have GPS/2G reception. So get out on the balcony and test there.2. Device is offline means that there is no internet connection. In the vast majority of cases, including me, it is due to missing or incorrect APN entries. This one gets from the network provider of the sim card, which is in the tracker. My mobile APN information I have also found on the web. I had simply entered the wrong APN name. Immediately after the change to the right value, the tracking also worked perfectly with the app and still does it today. It's great what this little device does.Important:The Tracker SIM card must have data volumesThe APN information must be entered correctlyGPS works (of course) only outsideSuper Feature: The app lets (apparently) only track one device. On demand, I learned from the service, that if you want to monitor several trackers in the app at the same time, they will create a special account, so it is perfect for vehicle rental, etc.Conclusion: do not be frustrated, this is where EVERYTHING works! If not, it's probably not on the tracker or the app. Great product, excellent service!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51+0t-M00DL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerardo Ferguson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRGFHIREKWUCZIFIBGWSCTQKVGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DCZXU2PWXSTK?ASIN=B01N6H70C9",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2019",
                "reviewTitle": "1.0 out of 5 stars Customer service the sellers of this GPS needs to do look this review",
                "reviewText": "I haven't been able to get GPS to tell me anything or even show up on the app that it tells you to download. I bought it and a sim card that was recommended for it says the yellow light will flash when is on, mine doesn't flashes I try to call the number to activate the GPS with sim card is either busy and the wanted me to give them credit card number to when sims card runs out I can get one with no interruption. GPS and sims card. if you purchase the GPS you have to have the Sims card you can't just buy the GPS and expected to work by itself.You Can't purchase the GPS expected to work, It needs the Sims card & Charge on GPS lasted one day! I have not responded from anyone and if you look at the order I bought two sim cards because the first one did not make some reason it got lost or damaged. my GPS still not working and its been almost a year. What do I need to do Keep on added to this review? I believe you people will need to replace this PGS and Free service two years plan but I going to need three GPS now.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Examar_Lopez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4MO4YBRVMEJLUAAN7RB2ITWQSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BH3M54Y77IPR?ASIN=B01N6H70C9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2019",
                "reviewTitle": "5.0 out of 5 stars GOOD APP TO USE ALONE WITH IT!",
                "reviewText": "This is actually my first gps tracker that I have purchased. I had difficulty setting it up. It took about 3 tries to get it starting. This product comes with a GPS tracker, USB port without the head to charge, a tiny bag where I put the USB port meanwhile the gps is already in use, & a manual. I bought the recommended SIM CARD because it was not included. I purchased the $5 monthly subscription to try it out.So far I like: the battery life has lasted a week. It’s at 90%, I changed it to 12 hour mode stand by. I think it turns on every time the car moves. Which I believe should save some battery life. I chose this product mainly for the app. It took me about a week to decided what I was looking for. I read through these reviews and I was happy to read most of them. The bad reviews, I believe they expect it to work as a $500 dollar product. I paid about $60 all together & it works great. It has magnets so it’s a plus. They work really well. Just have to find a good area so it doesn’t fall. Thus far, I like the product mainly for the app. It is easy to navigate once you get it started.I disliked: that it was a bit hard to get it starting. Just follow the instructions and you’ll get it. Yes, that’s what I thought. I would msg the command and after the 5th command it wouldn’t reply. I was frustrated and would put it away. I emailed them and I got no response. I still have not gotten a response back from them. So if you get an email, keep it. I believe it had a number on it. I accidentally deleted it, & regret I did.My 3rd attempt Setup:1.) Get your SIM CARD number ( it doesn’t say in the instructions) by logging in their carrier website.2. ) insert SIM CARD & charge the GPS tracker.3.) follow manual instructions.4.) I commanded for GPS to turn on5.) I commanded for GPRS to turn on6.) check for blue & yellow lights blinking.7.) then I connected to the APP & it worked8.) i changed every other commands through the app once I was able to connect the app with the gps tracker.9.) now it’s being used and I only use the app to locate the tracker.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randy H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6QFP6I7QWW2RKJZOJ6LTRNRD5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OUKTXKN8S06R?ASIN=B01N6H70C9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "5.0 out of 5 stars When used with the TKStar app this device is very good at tracking",
                "reviewText": "I use this on my partners vehicle because she is awful at directions and gets lost easily. She was afraid to leave the block alone in her car until I installed this. Now she feels far more confident and gets about on her own. If she gets lost she just calls, I use the app to see where she is and get her back on track.The app is really nice. I'm glad I bought this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 1, 2022",
                "reviewTitle": "Gps tracking",
                "reviewText": "Very Acurate !The price should be raised ... Its worth more then what i paid !The only thing not as good ,is the magnets are not as strong as i tought !Because of that , it fell from my motorcycle and lost it ...So i put it to test ,and sent a signal to see where could ive lost itTo my suprise ,i went to the location ,a store . Went inside and it was pointing to a person ,wich there was many in the store .. Asked did you found a black box ,the answer was YES,and handed it to meI recommend it no questions asked !! :)",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KLEIN Eléonore",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 28, 2022",
                "reviewTitle": "Parfait",
                "reviewText": "Durée de la batterie en veille de 3 mois. Preci, facile à localiser avec 1 sms envoyé. Toutes les fonctions sont accessibles.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Loris Landi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 9, 2022",
                "reviewTitle": "Funziona bene, assistenza ottima",
                "reviewText": "Non è molto intuitivo nel settaggio, ma una volta in funzione fa molto bene il suo dovere. Ho avuto un problema con la ricarica ma l'assistenza è molto puntuale e gentile e me ne invieranno un altro in sostituzione. La batteria dura circa un mese. Rapporto qualità prezzo secondo me ottimo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 3, 2021",
                "reviewTitle": "Funciona correctamente",
                "reviewText": "Buen producto, pero a ver qué pasará cuando ya no exista GSM o 2G porque va a desaparecer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 5, 2023",
                "reviewTitle": "pas capable utilise",
                "reviewText": "pas capable utilise",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}