{
    "remaining_requests": 40115,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Garmin-770LMTHD-7-Inch-Navigator-Renewed/dp/B010RE9GDK",
    "body": {
        "name": "Garmin dezl 770LMTHD 7-Inch GPS Navigator-(Renewed)",
        "price": "$419.99",
        "originalPrice": "",
        "rawPrice": 419.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Garmin-770LMTHD-7-Inch-Navigator-Renewed/dp/B010RE9GDK",
        "soldBy": {
            "sellerID": "A1BID9QNTQ7LGZ",
            "name": "New Life Deals",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1BID9QNTQ7LGZ&asin=B010RE9GDK&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "Only 3 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31MIHpZhBnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31XpXFjHS-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41e4BUiN1YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MxgaF41cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31rA1QLDTML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418hq37kOaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31ZzGbjeYkL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon Renewed",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "New Life Deals",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 351,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Saturday, February 17. Order within 3 hrs 25 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "This Certified Refurbished product is tested and certified to look and work like new. The refurbishing process includes functionality testing, basic cleaning, inspection, and repackaging. The product ships with all relevant accessories, a minimum 90-day warranty, and may arrive in a generic box. Only select sellers who maintain a high performance bar may offer Certified Refurbished products on Amazon.com",
            "Bluetooth Enabled: Bluetooth wireless technology and built-in microphone enable you to make calls using your Bluetooth- enabled mobile phone.",
            "FREE Lifetime Maps & FM Traffic Included:With free Lifetime Map and Traffic updates, you always have the most up-to-date maps, points of interest and navigation information available at your fingertips",
            "Preloaded maps: Your GPS system is equipped with a great selection of preloaded maps, which will help you better navigate roads in the US, Canada and Puerto Rico. With this feature you do not have to worry about loading compatible maps on your own, simply turn on the device and enjoy detailed maps of future destinations.",
            "Speed Limit Indicator: This tool gives you up to date information on the speed limit posted on most major highways, freeways and neighborhood roads. With this tool you do not have to worry about receiving a speeding ticket, you will always know what the limit is and if you are obeying the law."
        ],
        "description": "Speed Limit Indicator, This tool gives you up to date information on the speed limit posted on most major highways, freeways and neighborhood roads. With this tool you do not have to worry about receiving a speeding ticket, you will always know what the limit is and if you are obeying the law.",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1.1 x 7.8 x 4.8 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.9 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B010RE9GDK"
            },
            {
                "name": "Item model number",
                "value": "4330261682"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 351 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#257,202 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #8,536 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Special features",
                "value": "Bluetooth"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Human Interface Input",
                "value": "Microphone"
            },
            {
                "name": "Scanner Resolution",
                "value": "480 x 272"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Manufacturer",
                "value": "Garmin"
            },
            {
                "name": "Date First Available",
                "value": "July 1, 2015"
            },
            {
                "name": "Brand",
                "value": "Garmin"
            },
            {
                "name": "Screen Size",
                "value": "7 Inches"
            },
            {
                "name": "Special Feature",
                "value": "Bluetooth"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Map Type",
                "value": "North America"
            },
            {
                "name": "Mounting Type",
                "value": "Windshield Mount, found in image"
            },
            {
                "name": "Resolution",
                "value": "480 x 272"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jamie Christenson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUBTEU4UAL7E5X6TD6I6QIXJMRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3054A14XKRXK7?ASIN=B010RE9GDK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2016",
                "reviewTitle": "5.0 out of 5 stars I love the 7 inch screen",
                "reviewText": "I have been drooling over this item since it was released. Prior to that, I was drooling over its predecessor, the 760. However, the price was a bit more than I could justify. When I spotted the refurbished unit, I didn't hesitate.This GPS is everything I expected, and more. I have a Nuvi in my car, so I am used to the Voice Command feature. This feature alone is why I'm staying with Garmin. Add a stop at the next Love's along my route, without having to take my hands off the wheel? Yes, please.I love the 7 inch screen. I wouldn't want a screen this big in my car, but in a semi, it works well. It's readable in direct sunlight, and if needed, I can set the brightness level via the aforementioned Voice Command. There is also plenty of volume. I have mine set at 60%, and I hear it clearly.One thing that I didn't expect was the ability to save different configurations of my truck. Currently, I have three; loaded, empty trailer, and bobtail. I select the proper one, and it routes me appropriately.The 770 isn't perfect. Occasionally, the routing leaves me scratching my head. Normally, this comes from some glitch in the map data (which all GPS makers use), where two roads don't quite join. A little common sense comes in handy in these cases.The bottom line: It's a great unit at a great price. I heartily recommend the 770.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wiley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUYUHX5ZPHWFDQHI4CJ4AIBLRDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UQJG0OW60X6J?ASIN=B010RE9GDK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2017",
                "reviewTitle": "5.0 out of 5 stars Designed for trucks but works well for RVs",
                "reviewText": "I have not been impressed with GPS units designed specifically for RVs, so I thought I would try this model. I recently used this to navigate a Class A motor home on a 2500 mile trip. It allowed me to put in the size and weight of the RV (as a box truck) and kept me out of problem roads and toll roads. I like that it is easy to use and you can readily identify preferred gas stations along the route. The GPS will navigate you to the stations without the need to disrupt your planned route. The same applies to other POIs along the way.While this is designed for trucks, it is a great solution for RVs. It can also be set to function for cars as well. The manual has to be downloaded and was not included in the box. It is pretty easy to use intuitively.That said, while I had the latest map, it is not perfect. It falsely identified a station as a Pilot, when it was not, and the directions to it did not correctly identify the exit. This was a minor annoyance and not a major issue......and it was the only issue that I had with it.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Bartholdi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUE45JTLFOIESJMA5NUFYZDA5BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WWPZPSGZMK8O?ASIN=B010RE9GDK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2018",
                "reviewTitle": "5.0 out of 5 stars Refurbished price is great. Fast shipping.",
                "reviewText": "Nice big screen. Very inaccurate in the WV countryside. Kept trying to put me on loops and side roads instead of main highways. The way it routes you in Ohio is questionable also. Even tried to get me to cross the Ohio river in Sisterville WV. Pretty happy with other features. I'm going to try it again this week on my trips to Lancaster Pa, Hampton VA and Newport News VA. I changed some of the settings and made sure its in truck mode which it is. Hope it does better this week or its getting returned. Staying hopeful after reading a lot of good reviews. Will update this one in a week. Don't think it makes a difference but I bought this certified refurbished through Amazon.Update. Changing some of the settings made a big difference. Definitely a keeper. Working great. No regrets.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXTQ7J3ZLK7SM374N6WPXVMNN7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T73SWOUIHSWI?ASIN=B010RE9GDK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2020",
                "reviewTitle": "4.0 out of 5 stars The best Truck routing GPS on the market.",
                "reviewText": "I bought this unit in May of 2016 when I was a regional driver. It is now July 2020 and I'm happy to say the unit is still working great. I have become a full OTR driver and have really began to see the pros and cons of this device and thought it would be nice to share them with everyone. While I think this device is great on route to your destination (for the most part), I use Google maps to take me in to the final destination because this unit is constantly off on addresses. Google maps is usually right on and you can look at a satellite view to find the exact truck entrance. OK, so here we go:Cons:Unit is constantly off on speed limits.Unit will route around a road if a truck restricted road crosses it, adding huge amounts of time bypassing a road you are legal to be on. This happens especially in Texas but I have had it happen in New Jersey as well.There is a change route button that seems all but useless.After time, this heavy unit will begin to sag on its mount as it wears down the plastic ball that holds it up. There is an easy fix. Cut the corner of a sandwich bag off and slide that piece over the ball. Stack them until your unit has a tight fit again.Under the \"Truck Stops\" voice command, only huge truck stops like Love's, Pilot Flying J, Petro, and TA are listed. There are a few exceptions. I recommend Truckers Path or another similar app for a full array of stops and parking.Unit will randomly blurt out commands like \"EXIT RIGHT\" which can be confusing or stressful until you learn to disregard.Some updates are great and others seem to completely mess everything up. I wish there was an easy way to contact Garmin with corrections like you can do with Google. Honestly, I wish Google and Garmin would team up to create one hell of a Truck GPSUnit will sometimes fail and restart when adding a stop, so keep this in mind when you will be changing roads soon or are in a large stressful city. Also good to have Google maps as a back up here.PROS:This unit is voice activated! You can ask it where truck stops and rest areas are while driving and it will tell you. This feature has proven invaluable to me.You can customize a tab with key things you would like to see like distance to destination, elevation, direction, and speed, as well as many others.The large screen makes viewing and reading easy.It tells you when there will be tolls.If there is a road closure, it will usually automatically route you around it (if you have the traffic sensor on your power cord), unless it happened very recently. This has been another invaluable tool that has saved me time.It tells you when you are going into school zones, getting ready to go down a grade, or coming up on a weigh station. Sometimes it is wrong and other times it misses some so you obviously still need to pay attention. It also tells you when you are coming up on a state line or coming into an area known for dangerous lateral winds.Overall, this is a very good unit. There is plenty of room for improvement, but I highly recommend it. Just remember to use common sense. Roads change all the time and Garmin can't keep up with them.Also, use your turn signal. You're a professional. Act like it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQG5NBIDEBVCISYQHPWZISGB4DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NW6LGVF7ZWQS?ASIN=B010RE9GDK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2018",
                "reviewTitle": "5.0 out of 5 stars A Great Buy For A Great Product !",
                "reviewText": "Awesome device it's better then my Rand McNally was an the Bluetooth works great.This my update!I bought this garmin gps 3 weeks ago.it's everything I expected an more .For those of you who are upset about not holding a charge,don't be my rand mc nally didn't either ,as I keep mine plugged in all the time and eventually it quit as well,the graphics are great an everything about this gps are great!you have to use some common sense out there an use old faithful once in awhile.in case some of you who don't know who or what that is .It's your atlas! I've been out here almost 20 years an things have changed quite a bit ,but yep this gps is great product !I also purchased the hard case for it as well for about 8.95 I think an they me 2 an it works great as well! So quit your whining an get yourself one an get-r-done! Happy trails out there!Be safe an God Bless You All!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}