{
    "remaining_requests": 40252,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Trak-4-Mobile-Tracker-Tracking-Vehicles/dp/B0753LC2DQ",
    "body": {
        "name": "Trak-4 GPS Tracker for Tracking Assets, Equipment, and Vehicles. Email & Text Alerts. Subscription Required.",
        "price": "$29.80",
        "originalPrice": "$48.80",
        "rawPrice": 29.8,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Trak-4-Mobile-Tracker-Tracking-Vehicles/dp/B0753LC2DQ",
        "soldBy": {
            "sellerID": "A36O4WNXU13UF7",
            "name": "Trak-4, Incorporated",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A36O4WNXU13UF7&asin=B0753LC2DQ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41BiksLr3lL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41GYIdkSk8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31O2UrFAg8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/312olrQ0lxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NrNjosnwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31GcNVc3oaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/710JKhv3-DL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/759046e3-df6d-4351-9e96-591e9eb1c1b5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1a212bdf-b598-437d-bd5d-36b16aee489c/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Trak-4 Store",
            "link": "https://www.amazon.com/stores/Trak-4/page/705032FD-DC8D-4B75-A5F2-186110B21197?ref_=ast_bln"
        },
        "brand": "Trak-4",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 3282,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 10 hrs 59 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Simple to use - start tracking in minutes | Email & text alerts | Geofencing",
            "Subscription Required. $6.99 a month (prepaid annual) or $12.99 a month (paid monthly) for hourly pings with options for 10-min and 1-min",
            "REST API | Webhooks | Unlimited cellular data | No contract | No activation or cancellation fees | SIM included",
            "Computer, Phone, or Tablet | Great for GPS tracking of assets, inventory, and vehicles | Compact Size",
            "Up to 18 months on a single charge | Change your ping rate to manage battery life | Rechargeable with a cell charger or USB cable"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.25 x 1.75 x 1.25 inches"
            },
            {
                "name": "Item Weight",
                "value": "5 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0753LC2DQ"
            },
            {
                "name": "Item model number",
                "value": "Trak4"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 3,282 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,184 in Electronics (See Top 100 in Electronics) #20 in GPS Trackers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Wireless communication technologies",
                "value": "4G"
            },
            {
                "name": "Connectivity technologies",
                "value": "Cellular"
            },
            {
                "name": "Special features",
                "value": "online-sharing"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Gray"
            },
            {
                "name": "Whats in the box",
                "value": "Cable, Battery, SIM Card"
            },
            {
                "name": "Manufacturer",
                "value": "Trak4 Inc."
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Date First Available",
                "value": "August 16, 2017"
            },
            {
                "name": "Brand",
                "value": "Trak-4"
            },
            {
                "name": "Special Feature",
                "value": "online-sharing"
            },
            {
                "name": "Connectivity Technology",
                "value": "Cellular"
            },
            {
                "name": "Supported Application",
                "value": "GPS"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Equipment, Tools, Assets, Trucks, Vehicles, Trailers, RVs, Boats"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Track Anything Locate - Vehicles, assets, equipment, trailers, loved ones, etc. Easy to use - Anyone can sign in and start using in minutes. Attach to asset and go. Email & text alerts - Get a text or email alert when your device leaves or enters a selected area. Also receive an alert when the battery gets low.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1683c42b-3e3b-48da-9fd0-269fd5a85ae9.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Commercial Reliability Extended battery life - Rechargeable internal battery lasts 12-18 months on a single charge with daily reporting.Attach to anything - Mount to your vehicle/trailer/equipment or simply place inside a pocket or compartment.Weatherproof made for indoor/outdoor use - Rugged commercial housing, but still small and handy.Optimized for USA - Works within the USA and features top-tier cell-network coverage.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A36O4WNXU13UF7/21bc0129-2a4b-4971-844b-8354bd2ca9a9._CR0,0,300,300_PT0_SX300__.png"
                ]
            },
            {
                "media_text": "Powerful Features Ping Rates - Choose in-motion ping rates from 1-minute to 1-hour. Daily Check-in - Your Trak-4 will check-in once daily even when not moving.Expert Mapping - Track multiple units on the same map.Map History - Animated ant-trails indicate the direction of travel of your Trak-4 over time.Unlimited Sharing - Share your device location in real-time with family, friends, and business associates.No GPS? No problem - Trak-4 will use WIFI and Cell geolocation when a GPS signal is blocked (inside garages, buildings, etc). WIFI geolocation provides great positional accuracy in populated areas.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49e3f632-07aa-4efc-880f-d766ad86a8f2.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Business Class Features REST API for GPS Reports - Use the Trak-4 service as your asset location database - very developer friendly. Full source code examples and excellent documentation are available - save time on your projects. REST API includes Webhooks for GPS Reports - Receive GPS reports in your system immediately.Organization-wide geozones.Bulk device management.Streamlined billing.Advanced user management.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83c3ad80-80af-43aa-a11b-862b4a0d2a0a.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Trak-4 USB Trak-4 Solar Trak-4 12-Volt 4G/LTE ✓ ✓ ✓ Email & Text Alerts ✓ ✓ ✓ USB-chargeable ✓ Self-charging ✓ Integrate with 12v power system ✓ High-capacity internal rechargeable battery ✓ ✓ ✓ Compatible with Trak-4 Adhesive Mag Kit ✓ ✓ ✓ REST API ✓ ✓ ✓ API Webhooks ✓ ✓ ✓ Unlimited Data ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A36O4WNXU13UF7/a9988ac5-a734-4079-98b1-ccf4bbbe8033._CR0,0,600,180_PT0_SX600__.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bcc51187-814d-4e56-bbc1-de2d31341670.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1683c42b-3e3b-48da-9fd0-269fd5a85ae9.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A36O4WNXU13UF7/21bc0129-2a4b-4971-844b-8354bd2ca9a9._CR0,0,300,300_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49e3f632-07aa-4efc-880f-d766ad86a8f2.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83c3ad80-80af-43aa-a11b-862b4a0d2a0a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f84258c-0f2d-4ac1-a960-f88e7faf2a69.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ebb851fc-7854-429f-a547-2bef739f3f22.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8cc1c6a2-640c-4817-b7a7-eec612b9799a.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ken Lee Clay Ton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVVL6JGSRLE2HVUCEGIO46UY3AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R7V5XO0KCEVL?ASIN=B0753LC2DQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Great GPS tracker",
                "reviewText": "Worked perfect for what I needed it to and and I actually bought two simply because it was two vehicles that the person I needed to track could use. Worked perfectly on both vehicles and that was during the winter with very cold nights and rainy days that lasted sometime for a week. The battery life was great and it lasted as long as i needed to use them without me having to ever remove and let charge and put them back on. One survived a train track inspection truck impact. Hit the car on the back passenger side and where it was mounted right in that area i don't see how it survived. See the water tight box I had purchased with it the GPS locator would not fit in it. So i removed the magnets from the box and using some wrap around velcro combined with JB Weld Steel Reinforced Epoxy I managed to attach the magnets directly to the transmitter. Doing this i had to tape over the charge port and make sure that a plug could plug into the port before it cured. Now i'm sure this avoids the manufactures warranty but I really wasn't worried about that. If that would have come up I would have just purchased another one and went from their. Sometimes time is more valuable than the cost of things and time wasn't on my side so to worry about anything like that was comical to me. I'm about to put service back on one because i have to monitor something else that I need to always know where its at 24/7 if I when I need to know it. Remember installing GPS transmitters on any persons car that's not titled in your name is against federal law. Remove anything that's located on the tracker like stickers or barcodes and keep them in a safe secure place always. So keep that in mind if that's what your thinking about and if you decide it's worth the risk then make sure you keep your mouth shut and install it in a place that's not noticeable even if someone takes it to a mechanic for a break job where it's raised up and could easily be spotted from underground the car.These are lesson learned the hard way.I say that because one of the vehicles had to have a break job and to find the device still would have been hard. I'll say a little more and then that's it. What ever and who ever your going to track write down the tag number and put that in your wallet simply because if you think it's only one silver toyota Camry in your town, well it may be only one in a small town but in the city and say Walmarts parking lot it will be so many that guessing only ends up making you do even more undercover shady crap because you will have to remove it from someone's car that you have no clue who it belongs to.Retrieving one like this always be prepared for guard dogs and take along something that most dogs love. Like bologna, ham lunch meat and if it's a very large dog t-bone steak filet mignon will always work great for these breads. More things to remember : put the clear stickers over the charging port simply to keep the port from getting water damaged because it's not made out of plastic or food grade stainless steel. I preferred to used 3m Super 33+ electrical tape because it's black and once it's attached to something like this it has good waterproof ability and if I ever need more it comes on a roll that around 60 inches long. Still the manufacturers port protection stickers i'm sure work and if I didn't have any of the 3m I would have used those instead.Good battery life and you can't ask for more, support was always good to answer any questions that I had. works in extreme conditions 15 degrees to 105 it never stops from doing its job. holds up to impacts from train track inspection trucks, signal strength is always good even after a impact like that, the price for the service isn't that bad at all. The top of the line fastest update time was 22.00 and some change a month. Can't ask for any better tracker than what you get with the TRAK-4 GPS Tracker 5***** and an A+++ it gets from me. Thanks Kenny",
                "reviewVotes": "39 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Knownasjim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6P2PQHY2QCQ2CFRRXH23ELPM3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJZCPCZFQ6ZGR?ASIN=B0753LC2DQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 31, 2021",
                "reviewTitle": "5.0 out of 5 stars Finally have peace of mind about storing my RV in a paid lot.",
                "reviewText": "One day, I saw a post on FB about a camper being stolen off the lot. It totally freaked me out because it was MY LOT and my camper was actually in the picture behind the one being stolen. I immediately started looking for a tracking device to add to my arsenal of security measures. The Trak-4 was affordable and seemed to have a long enough lasting battery to meet my needs. I read all the reviews. Then I did searches on all the RV-related groups on FB. I actually communicated with some other customers who were very happily using them to secure their trailers. I had a few issues getting mine going do to my own limited understanding of the process. In the first 24 hours that I had it, I contacted customer support several times. Each time, they responded to my messages within fifteen minutes and either explained what I was doing wrong or helped me with my set up. I had a problem finding a good hidy hole to put it in that would let it reach the satellites. They set my device to check in every 15 minutes regardless of motion so that I could try a spot and know quickly if it worked. I have it all working great right now. When it checks in, it shows my trailer sitting EXACTLY where it is, although the satellite image is older and a different trailer is actually in that spot. When I was taking the device from my home to the lot, I got a text message telling me that it was no longer at my home about thirty seconds after I crossed the lines of the \"geo zone\" I had created around my house. I think this is an amazing device. It does everything I want it to do for a price I can afford.UPDATE: I went on a camping trip recently and discovered, that although my device tracked my movement, it was not using GPS. I sent an email to the company. An hour later, they told me a replacement was on the way. It was at my home when I got back from my trip.I am happy to say that the replacement device is working perfectly. I am a little bit compulsive obsessive. I have an alarm on my phone that rings every day at the time it checks in. I always look to see that my trailer is safe and to check what the battery level is. I love it! You can not imagine the peace of mind I get from this.SECOND UPDATE: The device stopped checking in daily. It sent me an email whenever it left a Geo zone and also gave me my 10 minute travel check-in‘s. It just wouldn’t do the daily check in. I contacted the helpdesk and they helped me work through the problem. Bottom line: I am all set to go again and totally 100% protected. I am telling you- you cannot beat the customer service from this business! They are awesome. Emails are answered almost within the hour. They don’t give up until your problem is solved.ANOTHER UPDATE (01-30-2022) I have nothing but respect for this company. Once again, my device stopped working. I sent an email and about ten minutes later they replied to tell me that they had checked it out and learned that my device was part of a batch that had a defective modem. 3 days later, I had a replacement device in my hands. This time, I expect the replacement device to perform as expected and for the duration. But, I know that the company will take care of me, if there is a problem. I have never dealt with any company that was so responsive, so quick to be responsive, and so willing to give total support to a customer. The Trak4 makes me 100% secure about storing my camper in a storage lot. The minor glitches to that service could have been annoying, had the company not been to fantastic with their approach to consumer relations.",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}