{
    "remaining_requests": 40236,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GPS-Tracker-Vehicles-Vyncs-USA-Developed/dp/B01HSODG10",
    "body": {
        "name": "Vyncs - GPS Tracker for Vehicles, [No Monthly Fee], 4G LTE, Vehicle Location, Trip History, Driving Alerts, GeoFence, Fuel Economy, OBD Fault Codes, USA-Developed, Family or Fleets",
        "price": "$79.99",
        "originalPrice": "$89.99",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/GPS-Tracker-Vehicles-Vyncs-USA-Developed/dp/B01HSODG10",
        "soldBy": {
            "sellerID": "A1MR0LC94VGQFE",
            "name": "Agnik",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1MR0LC94VGQFE&asin=B01HSODG10&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41iQRJO vdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/514OXy4xldL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vYAvtkvsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qjUgh833L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51tJ UGhpVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DT-L-WJbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81GpKWTf sL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/18c4596b-5250-5c2f-b5bb-8e5775d9bd20/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3b572f15-4a83-436b-af58-079204db3ecb/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/948e989c-dda9-42da-9010-eb3e759eb3ad/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Vyncs Store",
            "link": "https://www.amazon.com/stores/Vyncs/page/27937F66-7725-4E5E-92F5-DA6404026868?ref_=ast_bln"
        },
        "brand": "Vyncs",
        "merchantInfo": "Agnik",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 7081,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Thursday, February 15. Order within 6 hrs 41 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "GPS Tracker For Vehicles. 4G LTE Device No Monthly Fee, One-time Activation fee: $39.99 (full refund if returned and account cancelled within 30 days). 1 year Service included. Renewal (USD 78.93) in 2nd year (no activation fee). Real Time Tracking: USA (AT&T , T-Mobile) and International coverage. SIM card included. Track Cars, Trucks, Small Fleets, Seniors, Teenagers. Plug into the OBD-II port of vehicle or hide using Vyncs OBD Extension Cable. Real-time whereabouts via iPhone, Android, Web",
            "Vyncs Advantages. No Battery needed, powered by OBD. Vehicle DTC Codes, Fuel Economy, Fuel Level (if available), True Idling, Engine RPM, Vehicle Speed, Manufacturer Recall, Vehicle Maintenance. World SIM, replacement if Vyncs stops working. Groups Feature that no one else has: Indoor/Outdoor – Locate Loved ones’ phones instantly when they’re walking, biking, or on public transit. All they need is the Vyncs app on their Android/iOS phones. Even use it to find your lost or stolen phone",
            "Real Time Location Tracking and Trips. Collects data every second, analyzes, and sends 20 seconds update to the server every minute. Other upgrades available. Unlimited trip history on map. No battery needed. Draws very little power from OBD-II port. Goes to sleep while ignition-off saving battery power and wakes up once in every hour to update location. Shared accounts for car tracking device. Live customer support avalable 7 days a week.",
            "View trips, review routes on map, set zones around any area, get zone enter-exit notifications. Driver and Vehicle Alerts. Geofence zones, street address for start/stop points on the map. Driver speeding/braking/rapid acceleration alerts by Push Notification/Email, trip history on map. Vehicle OBD diagnostics, fault codes, maintenance, car battery voltage, vehicle recall, fuel economy and fuel level (if available). Tamper alert once device is plugged back in the OBD port.",
            "Why Vyncs. Ultra Fast, 4G LTE Device. Highly: 5000+ great reviews and near 100% 5 star seller feedback. Check out Vyncs video on the slider. Has all the features you want plus a lot more. Get Vyncs Fleet for advanced fleet monitoring features for fleets with 5+ vehicles. Global Support: Supported in 200+ countries. Check with us for the details."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2.4 x 1.9 x 0.9 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.33 ounces"
            },
            {
                "name": "ASIN",
                "value": "B01HSODG10"
            },
            {
                "name": "Item model number",
                "value": "VYNCSLINK-001"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 7,081 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,752 in Electronics (See Top 100 in Electronics) #23 in GPS Trackers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Wireless communication technologies",
                "value": "4G"
            },
            {
                "name": "Special features",
                "value": "No Monthly Fee, Posted Speed Limits on Map, 4G LTE Cat M1+Cat NB1+EGPRS OBD Wireless Global device, 24/7 Roadside Assistance: Optional, Mapping Technology: Google [Street & Satellite], Data Retention: Unlimited, Engine off Hourly Location"
            },
            {
                "name": "Display size",
                "value": "0.9 inches"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Whats in the box",
                "value": "SIM Card"
            },
            {
                "name": "Manufacturer",
                "value": "Agnik"
            },
            {
                "name": "Date First Available",
                "value": "June 30, 2016"
            },
            {
                "name": "Brand",
                "value": "Vyncs"
            },
            {
                "name": "Special Feature",
                "value": "No Monthly Fee, Posted Speed Limits on Map, 4G LTE Cat M1+Cat NB1+EGPRS OBD Wireless Global device, 24/7 Roadside Assistance: Optional, Mapping Technology: Google [Street & Satellite], Data Retention: Unlimited, Engine off Hourly Location See more"
            },
            {
                "name": "Supported Application",
                "value": "Find my Car"
            },
            {
                "name": "Included Components",
                "value": "SIM Card"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "2.4 x 1.9 x 0.9 inches"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Everything You Need, All in One. Vyncs takes your cars online and into the connected world. Plug in the ultra fast 4G LTE Vyncs Link device and know your cars’ real-time location, unlimited trip histories, geo-fence alerts, speeding alerts, accident/impact alerts, vehicle health condition, fuel/emissions performance, maintenance reminders, driver location outside the car, and way more. Purchase cost + activation fee (see second product image) include 1 Vyncs Link device, 1 year of service, 1 global SIM card, 1 year of data plan on AT&T and T-Mobile network in USA (nothing to do with your Android/iOS device's data plan). You can view your Vyncs account on any computer or Android/iOS device. 30 day trial period. Vyncs Has Your Back, Anytime and Anywhere. Stay connected to your vehicles and drivers using our Android/iOS apps, web-account in your computer, smartwatch app, or even your smart home assistant, Alexa! The 4G Vyncs Link device comes with a built-in SIM card that currently works in 200+ different countries including USA, Canada, Puerto Rico, and Mexico-- you can track from anywhere! Check the Legal Disclaimer section on this page for the list of supported countries. NO MONTHLY FEE is required. Vyncs Basic, Vyncs Premium, Vyncs Pro, Vyncs Fleet come with a SIM card and do not require any MONTHLY FEE for the data connection. You pay the yearly fee and a one-time activation fee in the first year. Why Vyncs? Vyncs Link is a fast 4G LTE device. Vyncs has no monthly fee. Worldwide coverage in 200+ countries. No battery is ever needed; powered by your car. Vyncs does not need battery charging.Speeding alerts marked on the map along with true posted speed limits. Accident/impact detection alert.Know where your car is when engine is off, once an hour engine off location reporting.Track loved ones even when not in a car using Vyncs Groups feature.On-demand location update for loved ones’ Android/iOS devices in Vyncs groups.Know your car’s health problems including generic fault codes.Know true idling for your car since it is based on car OBD data.Vyncs detects engine-on even if the car is not moving.Know true vehicle speed – Non-OBD Trackers provide estimated vehicle speeds only.Create geo-fence zones of any shape not just simple circular zones.Know your vehicle’s recalls well before you receive the notification from manufacturers.Know which gas station is giving you better fuel economy.Keep track of your fuel fill-ups automatically (when it is supported by your car's OBD).Tiny device size - 1.75 x 2 x 0.75 inches. Unlimited history for as long as you have a valid subscription.Lifetime device performance when you have a valid plan.2 minutes easy setup using our guided setup in the Vyncs app.",
                "media_link": []
            },
            {
                "media_text": "Vyncs 4G LTE GPS Tracker Connected Car Solution",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/19d03918-fe91-48ce-9b36-d3f5df07525f.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Real-Time Tracking, Geofences, and Driver Safety Vehicle Tracking While driving, Vyncs Basic collects data every second, analyzes that, and transfers the data every 3 minutes from the device to our servers (15/30/60 second upgrades available). Even if your car’s engine is off, Vyncs wakes up every hour to update you. Compare this important feature with other products. Vyncs also reports real-time location and records all of the trips your vehicle has taken, including start and stop addresses. Offers real speed limits on map. Be in the Know Set up Geofences from your account for knowing when your vehicles enter and/or exit a certain area. Unlike other products, Vyncs offers a more-powerful, any-shape geofence (not just a circular fence which often does not work in many locations). If your device has been plugged back into your car’s OBD-II port after being removed, get tamper alerts (the device doesn’t have a battery for safety reasons). Get alerts when they drive during curfew hours. Get notifications on your Android/iOS devices and desktop/laptop. Know How They’re Driving View where your drivers’ rapid acceleration and harsh braking events occur on a map. See how often your drivers speed with our speeding histogram, which shows you how much time the driver spends in certain speed ranges. Know how much your drivers are idling. Evaluate your drivers with the Vyncs Driver Score, which Vyncs calculates from how safe each trip your driver takes over time. Get unsafe driving alerts for speeding (above a custom threshold), rapid acceleration, harsh braking, and rough cornering.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/7ca03bc0-bd1c-41cb-bce8-c96419df77d4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/2ed5741d-c2c8-4d1e-b3b7-bb35202031fc.__CR0,0,800,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/fca528c7-f7d3-40f4-b820-38ab47ed58f3.__CR0,0,800,800_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Vehicle Health Monitoring, Fuel Reports, and Location Sharing Beyond the Car Solve Problems Before They Get Big Vyncs collects all the generic vehicle trouble code data that’s only accessible through the OBD-II port, a.k.a be the first to know exactly what’s happening with your car before it becomes a big issue. See all of the details within your account. Check engine lights and emission information are reported whenever available as well. Get maintenance reminders, recall notices (compare these feature with other products) issued by your car’s manufacturer, and your car’s battery health condition. Smart Fuel, Smart Savings Know how much fuel is left in your vehicles (supported as long as the vehicle reports this data through the OBD-II port), track the fuel cost with VyncsFleet, and get personalized fuel savings tips. Vyncs correlates fuel consumption with how the vehicle is being driven and reports the aspects of one's driving that is contributing towards increased fuel consumption. Track Beyond the Car Don’t be limited to the car! Track beyond the car with our optional and unique Android/iOS device location-sharing feature, Vyncs Groups at no extra cost (compare this with other products). Keep track of your loved ones when they’re walking, biking, or on public transit. Create private groups and add anyone you want via a custom group code-- all they need is the Android/iOS app! You may turn off the feature at any time. Even use it to find your lost or stolen Android/iOS device easily. This is optional. Use it only if you need to.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/f7dfc42d-e4f1-4cee-9936-180c008eabc5.__CR0,0,524,524_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/a32b343c-8ca0-404f-b645-bf812eeada76.__CR0,0,800,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/66e38654-3f81-4254-b4df-9f3f2f99e9ae.__CR0,0,800,800_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "24/7 Roadside Assistance and Smart Devices 24/7 Roadside Services Be ready for anything with free roadside services in the United States, Canada, and Puerto Rico with Vyncs Premium or via upgrade. The program includes 24/7 roadside assistance, towing, winching, lost key/lock-out help, fuel delivery, and more. Some restrictions are applicable. The Vyncs Link Device and Vyncs Cables The Vyncs Link is a tiny but very powerful device. It has a dedicated accelerometer for detecting 3-axis acceleration and braking events. Device does not need a battery. Dimension: 1.75 x 2 x 0.75 inches; Weight: 2.2 ounces. If you want to use an OBD-II extension cable (optional), use only the Vyncs OBD-II extension cable for safety. You can also use our 12V power adapter cable for using Vyncs in heavy duty and non-OBD-II compliant vehicles. Family of Smart Devices and Apps Vyncs has a rich developer forum. It is integrated with smartwatches, your smart home assistant, Alexa, and many other third party applications. That means you have access to many awesome additional features once you are part of our Vyncs family. In case you want to create your own application, just check us out.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/aa3c8a97-a0d9-4ebc-b525-58c72f1eb3d5.__CR0,0,800,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/a0e4afc4-3cc4-4fad-9830-f2e1e36c9f4b.__CR0,0,524,524_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/5c650eb2-2a32-4cfc-8d39-758ca6baba57.__CR0,0,800,800_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Vyncs Fleet and More Vyncs for Businesses & Fleets Vyncs Fleet: Vyncs with many additional features for commercial fleet management including: (1) Allows unlimited number of vehicles per account. (2) Fleet dashboard. (3) Street address on trip table. (4) Downloadable data in Excel-friendly format. (5) Fuel cost tracking. (6) Creating custom maintenance tasks. (7) More scalable software and powerful infrastructure for fleets. (8) Stop time reporting on the map. (9) True idle time (vehicle not moving but engine running) reporting on the map. (10) Multiple sub-fleets with more than one managers and due access control. (11) Dispatch management on the map, (12) Many other features... Get Your Vyncs: The Right One Vyncs Basic: Our standard 4G LTE real-time GPS tracker product for consumers described in this page.Vyncs Premium: Vyncs Basic along with one year roadside services (available only in USA, Canada, and Puerto Rico).Vyncs Pro: Vyncs Basic with 60 seconds GPS update and Live Map Auto Refresh (map automatically refreshing as new GPS data comes in).Vyncs Fleet: Designed for commercial fleet vehicles. Vyncs OBD Extension Cable & Power Adapter Cable Vyncs OBD-II Extension Cable: Optional extension cable for connecting the Vyncs device with the OBD-II port. The only cable tested to work with Vyncs. Using any other cable is not recommended since it may not match the OBD-II pin-support requirement of the Vyncs device. Unauthorized cables that are not tested with Vyncs may also damage the device. Vyncs 12V Power Adapter: We also offer a 12V power adapter cable for installing the Vyncs device in non-OBD-compliant light or heavy duty vehicle. Note that the 12V power adapter cable is different from the OBD-II Extension Cable shown above.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/465dff52-4a4c-4c8e-8226-de61d0f286df.__CR0,0,800,800_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/22b43a2f-3522-45f8-a11f-f76bbf8be2d2.__CR0,0,3335,3335_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/c2ddb88b-5deb-441c-847a-ea816a67654e.__CR0,0,800,800_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fcd653cc-1d85-46fe-a7e3-62e887803076.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/19d03918-fe91-48ce-9b36-d3f5df07525f.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/7ca03bc0-bd1c-41cb-bce8-c96419df77d4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/2ed5741d-c2c8-4d1e-b3b7-bb35202031fc.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/fca528c7-f7d3-40f4-b820-38ab47ed58f3.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/f7dfc42d-e4f1-4cee-9936-180c008eabc5.__CR0,0,524,524_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/a32b343c-8ca0-404f-b645-bf812eeada76.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/66e38654-3f81-4254-b4df-9f3f2f99e9ae.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/aa3c8a97-a0d9-4ebc-b525-58c72f1eb3d5.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/a0e4afc4-3cc4-4fad-9830-f2e1e36c9f4b.__CR0,0,524,524_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/5c650eb2-2a32-4cfc-8d39-758ca6baba57.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/465dff52-4a4c-4c8e-8226-de61d0f286df.__CR0,0,800,800_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/22b43a2f-3522-45f8-a11f-f76bbf8be2d2.__CR0,0,3335,3335_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/c2ddb88b-5deb-441c-847a-ea816a67654e.__CR0,0,800,800_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXBAJLO7IT5VBMEIII6FKOL3A4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27Z2W1WD2NIE2?ASIN=B01HSODG10",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Subscription Needed to Work",
                "reviewText": "I have been using Vyncs' tracker for a little over a year now and it is WELL worth the investment. The subscription was $80 for a year so I just renewed it when I was surprised with a premium version of the plan (which includes more features) for free! As for the actual product, its really easy to install and use on the web browser and app- I never had to call in for additional instructions, just plug, pay and play. I also really appreciate that the company won't send me weekly ads via email, I just bought the subscription and that was it. I only found out that it was time for renewal once I logged into the app to check some diagnostics on my car and then I had the notification in-app. Overall it's a great product that works fast to provide details about car diagnostics (which has helped me fix problems in the car without a mechanic and saved literally hundreds of dollars) and track the car's position while being installed in a discrete spot. This has come in handy sometimes when I forget where I parked, but I really got that just in case my car ever gets stolen.Overall, after one year with Vyncs I have been very pleased with the product and the ease of use.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna Humphreys",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTVOIEB7MAEVL3NAUR2DIEJJLUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS3E5QPF44WAS?ASIN=B01HSODG10",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2019",
                "reviewTitle": "5.0 out of 5 stars Keeping your teenager safe",
                "reviewText": "This device is the very best decision I have ever made.I am a single parent with a licenced teenage driver with a job. This is our third device and I have been using Vyncs for 6 years. The devices are in older model cars and work fabulously.Our older model cars are not equipped with any kind of anti-theft device, GPS, or location services.A friend recommended Vyncs. I researched it and decided it was a good fit for my family circumstance. I had the devices installed at my local auto repair shop and it has proven itself useful nearly everyday. I now know where the cars are at any given time of the day. The app shows a detailed description of the route the car took, the speed, the driving behavior of the operator, the mechanical functioning of the vehicle, and it sends notifications if something is not as it should. For example, I got a notification there was a mechanical malfunction with the car. Two minutes later I received a call my young driver from the side of the road. They told me the check engine light was on. As it turned out, the engine oil was low. Vyncs saved the engine!It's great for people who travel a long distance for work or school. While coming home during the recent snow storm, it took my driver twice the amount of time it usually does. I checked the app and could their travel progress. I could see where the car was on the highway, how fast it was driving, the driving behavior for that trip, the mechanical status of the car and all in real time.On a different occasion the Vyncs device notified me of an impact. Again two minutes later I recieved a call to report a fender bender in a parking lot and all was ok.I was able to see where the impact occured and the plot points where the cars impacted and where the car had moved off the road.The vehicles were registered and insured in my name. I get an insurance discount for having it.It's also a great deterant to foolishness. My driver is aware the device is in the car and this information discourages friends from using the car to skip school, or joy riding. \"I can't take the car there. My mom will know where we are.\" It gives a kid another option to use as a way out of doing something they don't want to do. It keeps them honest. It keeps me informed, and everyone safe.The car was stolen twice since having the device in the car.. The police were able to retrieve the car quickly based on the accuracy of the GPS. The device also documents vehicle speed, driving behavior (harsh turning, excessive breaking, G force limits, abrupt stopping, excessive idle time 40 minutes, etc) This information was valuable to the police and helped retrieve the car more quickly.I would recommend this device for any parent who is truely motivated to keep a young driver in the correct lane. It does wonders for a parents state of mind. My insurance premiums were also lowered due to the accuracy, functionality, and quality of the device.The benefits of having a device in your car outweigh the price of the device by a million times.I highly recommend this product!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMB6DL2HE3JTAVZS6UAYY46YNRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SM2ULLGIJAT5?ASIN=B01HSODG10",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2018",
                "reviewTitle": "1.0 out of 5 stars STEER CLEAR OF THIS DEVICE UNLESS YOU LIKE CRAPPY CUSTOMER SERVICE.",
                "reviewText": "This device is ok if you want to monitor your vehicle's location (as long as it's NOT a 2020 Honda). My son likes it because we live in a high-theft area and if it disappears, we can track it. Not so good for monitoring battery and engine issues (more below).UPDATE #1: It's been over a year now, and the device has not only delivered great results, but it has delivered piece of mind. My son's 1997 Tahoe had an issue with the 02 oxygen sensors and the device notified us of early detection. While not a serious issue, fuel consumption can be troublesome with a truck, especially when it's not functioning properly. Vyncs saved us some $! In addition, the GPS tracker and the trip features are worth every penny. I just hope we never have to use it to track the truck if it's stolen.UPDATE#2: This device was moved from a 1997 Chevrolet Tahoe to a 2020 Honda Civic Sedan. It is NOT compatible with the Honda (regarding MPG data) and here's the response I received directly from VYNCS:Most manufacturers have about 3 generic parameters that give fuel level. These are generic parameters but not mandatory and available only for the light-duty vehicles. Because it is not mandatory, some manufacturers will not provide the parameters and if they do not, the fuel level page will be blank. Every Honda Civic since MY 2011 have not provided sufficient parameters through the OBDII system. Until Honda changes their OBDII protocol for a future generation this information will not be available in any 2011+ Honda vehicles.UPDATE #3: STEER CLEAR OF THIS DEVICE UNLESS YOU LIKE CRAPPY CUSTOMER SERVICE.On Feb. 22, 2022, the GPS failed to function. I wrote customer service through the ONLY outlet they have on the website and notified them of such. I was told that the device had expired and that I was not only required to buy a NEW 4G device, but that I also had to pay another activation fee!!!!First off, you can't speak with ANYONE at this company. EVER. Email is not answered. You can only go through their tech support link and the responses are sketchy at best. Aside from the wordy explanation they gave me (above) for the fact that a 2020 Honda Accord isn't compatible, they've NEVER answered my queries in detail -- it's as though you're dealing with the Chinese all over again. A detailed description, such as what I'm writing now, deserves a detailed response. NOT POSSIBLE with Vyncs. You can ask a specific question and they send back some \"form letter\" response that may or may not have anything to do with the issue you are concerned with. I am VERY disappointed with this company.Things started out okay with the device working in a 1997 Chevrolet Tahoe, but when it was moved to a 2020 Honda Accord, EVERYTHING except the GPS function went south. It even gave false battery charge level readings. When I contacted the company, they would respond sometimes within 24 hours, mostly within 48 hours and you can FORGET ABOUT RESPONSES ON WEEKENDS. Do yourself a favor (if you are an individual looking for some accurate information) and look elsewhere -- regardless of the \"no monthly fee\" claim. They don't provide a good enough service to warrant one!These people talk a good sales game, but when presented with a serious query that requires problem-solving skills, they have nothing to offer. Save your money or shop a competitor!!!!",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mandrew54",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP3HUJUNCDCWKKIS5YZPFFIRYAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I9H1K6AV2CLB?ASIN=B01HSODG10",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Works as advertised",
                "reviewText": "Works ok...just have to get used to the lag time. It is worth the money IMO.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tim Champlin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWHLWINSKYQUFTLAWK3J7DDBBMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15Z746JGJK5P6?ASIN=B01HSODG10",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy and accurate",
                "reviewText": "Simple interface, accurate and easy to use. The app is laid out very well and the plug and play module maks it supr simple to use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristen R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKXSDQDJTU3KSYCQZWARCXBPDZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZTTDS9IJ7SIJ?ASIN=B01HSODG10",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars 100% reliable!",
                "reviewText": "HUGE relief to know my dtr’s location while away at college. Even if the “find my friends” isn’t on, I still can see her location, gas level and any problems with her car with just a tap from my phone. I can even see what time she leaves for class and how fast she is driving to get there! Yes, I recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel St-JeanDaniel St-Jean",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 5, 2023",
                "reviewTitle": "nice",
                "reviewText": "satisfaid about the item",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/31z0975e+gL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manuel E. de la Torre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 5, 2019",
                "reviewTitle": "Funciona en México",
                "reviewText": "El equipo funciona correctamente en México, solo algunas características no están funcionales.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laurent",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 25, 2019",
                "reviewTitle": "Très satisfait - quelques petits détails pouvant être gênant (rien de méchant)",
                "reviewText": "Je viens de recevoir le tracker.L'installation est très facile. Après avoir créé un compte sur le site (ou via l'app) de Vyncs, ajouté un véhicule, un conducteur et activé le tracker (10$ de frais d'activation), j'ai l'ai pluggé dans le port OBD2 de ma voiture. Je l'ai installé via un câble de rallonge OBD2 et cela fonctionne parfaitement.Il s'est immédiatement mis en fonction et j'ai démarré le moteur. Les premières informations ont directement été transmises vers mon compte pour consultation.Les données sont uploadées toutes les 3 minutes et le tracker enregistre un très grand nombre d'événements (allumage et extinction du moteur, positionnement GPS, vitesse, consommation de carburant, etc...). Tout semble donc fonctionner à merveille et à vérifier à l'usage dans le temps.Le seul bémol, c'est que tout leur site internet et l'app sont en anglais, ce qui n'est pas un soucis pour moi mais qui peut gêner certaines personnes. Autre petite chose constatée, le prix moyen du carburant doit être mentionné en US dollar...J'ai configuré des zones de geofencing, et pour l'instant, malgré le passage au travers d'elles, je n'ai pas reçu de notifications (peut-être un détail de configuration qui m'a échappé).J'avais au départ commandé un tracker Invoxia, qui fonctionnait très mal et qui n'était absolument pas fiable dans les données transmises.Pour l'instant, très satisfait de mon nouvel achat. Si mon expérience devait changer, je ne manquerai pas de modifier mon commentaire.UPDATE : Le Geofencing fonctionne maintenant. Je reçois des mails et des notifications push via l'app lorsque l'on entre ou sort des zones que j'ai définies. --> +1 étoile",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melvin Cucciardi Melvin Cucciardi ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 21, 2019",
                "reviewTitle": "The best gps",
                "reviewText": "Best product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/11KwEKjE1SL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "JT",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 31, 2023",
                "reviewTitle": "Device doesn't work in Australia",
                "reviewText": "Despite that Australia is included in the 200 countries listed where this device is supposed to work, it doesn't.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}