{
    "remaining_requests": 40074,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bracketron-Universal-Windshield-Smartphones-UFM-100-BL/dp/B000U5TUWE",
    "body": {
        "name": "Bracketron Nav-Mat Portable GPS Dash Pad, Converts Windshield GPS Mount into Dashboard Mount, Weighted Beanbag and Friction Base",
        "price": "$20.99",
        "originalPrice": "",
        "rawPrice": 20.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bracketron-Universal-Windshield-Smartphones-UFM-100-BL/dp/B000U5TUWE",
        "soldBy": {
            "sellerID": "A20HYQI2WKS67C",
            "name": "Bracketron",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A20HYQI2WKS67C&asin=B000U5TUWE&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B002XQ1R7Y"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "29",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/513fCZR223L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/518lx -z1pL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41m9of8lOIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rQm-rUQ5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ce4yyNeDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F6ie-Ux8L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c2c7a38d-1272-4a40-af18-baf7f03a303b/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Bracketron Store",
            "link": "https://www.amazon.com/stores/Bracketron/page/EB042328-7D1E-42A3-8035-368E3BACFD5C?ref_=ast_bln"
        },
        "brand": "Bracketron",
        "merchantInfo": "Bracketron",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2637,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 14. Order within 7 hrs 3 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 14. Order within 15 hrs 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "WEIGHTED GPS DASH MOUNT: The Nav-Mat provides a solid mounting base to convert your windshield-mounted device into a dash-mounted device. Transfer to other vehicles and use it to secure your car GPS holder or other device mount, hands- and hassle-free. The disc diameter is 3.5",
            "BEANBAG BODY & ANTI-SKID BASE: The pad’s body contours to your dashboard, even on uneven or textured surfaces, and the anti-skid underside prevents device sliding, even during sharp turns. It is compatible with the factory mounts sold with most smartphone and GPS units, and the pad can hold devices weighing up to 1 lb.",
            "PORTABLE CAR ACCESSORY: Easily take this device from vehicle to vehicle, whether you need it during a professional truck-driving route or on an extended road trip. It’s simple to remove and stow away when you’re done, which helps prevent passersby from noticing your electronics.",
            "EASY INSTALLATION: All you have to do is wipe down the surface of your dashboard to create a clean place for the Nav-Mat—no tools or extra pieces needed. Nothing will get in the way of your windshield view. It’s a great accessory to pair with other Bracketron mounting devices.",
            "STAY SAFE & CONNECTED: Our mounts and accessories are designed to keep professional drivers and casual commuters safely connected on the road. We offer a variety of products that are flexible, functional, and easy to use, no matter what kind of device you use for travel.",
            "Works with Most Stock Windshield Mounts included with GPS/mobile devices",
            "Weighted, anti-skid base conforms to your dash and holds up to several pounds",
            "A portable, stow-able, anti-theft mounting solution--keep your device out of view",
            "Easily view your GPS while driving",
            "One-year warranty"
        ],
        "description": "Product Description The Nav-Mat is an extremely convenient accessory to use with a windshield-mounting device. Using the weight distribution and high-tech anti-skid materials, it creates a solid mounting base to turn your windshield-mounted GPS into a dash-mounted GPS. It conforms to the contours of your dashboard, so it works on uneven or textured surfaces, and the underside material keeps the device from sliding. Designed to work with the factory windshield suction mounts sold with most popular GPS units, the Nav-Mat requires no tools for installation and can easily be transferred to different vehicles or safely stowed out of sight. This accessory works well with other Bracketron windshield mounts for devices such as satellite radios and cell phones. It can hold devices weighing up to 1 lb., and the disc diameter is 3.5\". We provide heavy-duty mounts and accessories for all types of drivers and their devices. Founded in 2001, Bracketron is focused on becoming your first choice for user-friendly mounting solutions. If you need a holder for a smartphone, tablet, GPS, or camera, our range of products will always be there to help you stay safe and connected while on the go. Amazon.com The Nav-Mat is an extremely convenient mounting accessory for your portable GPS. Using the physics of weight distribution along with high tech anti-skid materials, it creates a solid mounting base to turn your windshield-mounted GPS into a dash-mounted GPS. The Nav-Mat conforms to the contours of your dashboard, allowing it to work on uneven or textured surfaces while the anti-skid underside keeps the device from sliding. Designed to work with devices up to several pounds using the stock windshield suction mount sold with most popular GPS units, the Nav-Mat requires no tools for installation and can easily be moved from vehicle to vehicle or put out of sight when leaving the vehicle. Also works well with other Bracketron Windshield Mounts for mounting devices such as Satellite Radio, Cell Phones and MP3 Players. What's in the Box Bracketron UFM-100BL Nav-Mat GPS Friction Dash Pad, User's Manual",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "GPS System Accessories",
                "link": "https://www.amazon.com/GPS-System-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=559942"
            },
            {
                "name": "Vehicle Mounts",
                "link": "https://www.amazon.com/GPS-Vehicle-Mounts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=764574"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "13 x 2 x 9.5 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.03 pounds"
            },
            {
                "name": "ASIN",
                "value": "B000U5TUWE"
            },
            {
                "name": "Item model number",
                "value": "UFM-100-BL"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,637 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#30 in GPS Vehicle Mounts"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "Yes"
            },
            {
                "name": "Special features",
                "value": "Travel, Heavy Duty Protection, Universal, Hand Free, Adjustable"
            },
            {
                "name": "Other display features",
                "value": "CE"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Whats in the box",
                "value": "Bracketron UFM-100BL Nav-Mat GPS Friction Dash Pad"
            },
            {
                "name": "Department",
                "value": "Womens"
            },
            {
                "name": "Manufacturer",
                "value": "Bracketron"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "November 11, 2006"
            },
            {
                "name": "Brand",
                "value": "Bracketron"
            },
            {
                "name": "Compatible Devices",
                "value": "Cell Phones, GPS Devices, Tablets"
            },
            {
                "name": "Compatible Phone Models",
                "value": "Universal/GPS"
            },
            {
                "name": "Mounting Type",
                "value": "Dashboard"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Convert your windshield mount into a dash mount The Nav-Mat Portable GPS Dash Mount provides a solid mounting base that enables you to convert your windshield mounted device into a dash mounted device. Designed to work with the factory windshield mount sold with most smartphone or GPS units, the Nav-Mat requires no tools for installation and can easily be moved from vehicle to vehicle, or put out of sight when exiting the vehicle.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f43d4797-82a0-4676-b118-5e18b6844969._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Features high tech anti-skid material The Nav-Mat's bean bag like body conforms to the contours of your dashboard, allowing it to work on uneven or textured surfaces while the anti-skid underside keeps the device from sliding.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/96f8c77e-40fa-465e-95bb-01b83710dd41._SR300,300_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/612884c8-61f4-46f6-95c1-e5ab583b514a._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f43d4797-82a0-4676-b118-5e18b6844969._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/96f8c77e-40fa-465e-95bb-01b83710dd41._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Leah W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMLPKWSJVAYBBJJ7BGMZ4WGGOVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KG2VAAYVX6UZ?ASIN=B000U5TUWE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2012",
                "reviewTitle": "5.0 out of 5 stars Shockingly freakishly good dash mount: HOW DOES THIS EVEN WORK???",
                "reviewText": "This is the most amazing usable inexpensive simple wonderous dash-mount ever invented by any culture in any age.I'm being 100% sincere.I have the oddly heavy TomTom XXL 540TM 5-Inch Widescreen Portable GPS Navigator, a Toyota Highlander with their signature misshapen and oddly textured dashboard and I am a shockingly terrible driver. I'm not proud of this fact, but I feel that you need to understand how truly bad a driver I actually am to appreciate how truly superior and ingenious this dash mount is.Allow me to explain.I gun my car violently when the light changes because, one, it makes me feel like a super bad race-car driver, (woo woo!) and two, because I don't want to lose to the guy in the '91 Honda with the bumper duct-taped on in the lane next to me. (Can I get a shout out from other people who know this feeling?? I'M NOT LOSING TO YOU 18 YEAR OLD TAPED CAR DRIVER!!)As an added bonus, this rocket-like propulsion ensures that I will get the worst possible gas mileage possible. I'm close to Hummer territory here and I drive a flipping Toyota. That bad.It is said that the brakes on my car are very good so I take every opportunity possible to make sure I test them by using them suddenly and often randomly when I think I see a mammal or leaf or bag or shadow crossing the road.I tend to steer in the direction in which my eyes go so help all or any passengers if there's anything interesting to either side of me. Lots of interesting stuff to see on the roads here in Los Angeles; shops, the ocean, sofas and settees fallen from trucks on the freeway.I could go on, but it's getting to the point where a local chapter of feminists have petitioned me to undergo a gender reassignment so I'll stop reenforcing stereotypes about terrible women drivers.****Only this part is untrue. This is Los Angeles, feminists don't live here, they all live in San Francisco and judge my terrible driving from afar.My husband will deny all claims besmirching his driving prowess, but his testing of this mount is equally strict and frequent as he tends to see curbs as challenges rather than impediments.For the sake of nuptial bliss, I will refrain from further comment on that topic, a subject he vehemently and yet unconvincingly denies and get on with my review.I had used a stick-to-the-dash type of holder before with no big issue until the sticky wore off rendering it useless and I had to look for a new dash holder. The old type of mount left the sticky residue on my bumpy dash after it fell off.Tres unchic, and as you surely can infer from my driving a mid-size Toyota, I am ALL ABOUT the chic and visual aesthetics are a foremost concern. Speaking of aesthetics I would be remiss if I didn't mention that this mount resembles a black beanbag chair you might find in the apartment of a very midcentury modern guinea pig. This in no way is to be taken as a slight.It is what it is.I came across this dash mount here on Amazon and couldn't understand just from what was written how this actually \"stuck\" to the dash (what is this \"friction magic\" of which you speak??) and had even less faith it would work with my stupid heavy Tomtom, my slalom rapid-fire kamikaze driving and my odd misshapen dash.Even after using this mount for over half a year, I cannot tell you what mysterious sorcery keeps the sand-sackesque mount on my dash, but it really truly actually works.It has yet to fall off ever. Seriously. Even with all my unnecessarily sharp lane changes, my dime stops, and my F1-like squealing starts; this miracle mount stays on.And then you can just lift it off when you arrive at your destination leaving no sticky residue, absolutely no hassle, and no people targeting your sweet ride because of your mad hardware.(You fellow Toyota owners will understand this fear of being targeted for the sweetness of your ride and hardware.)I will only ever use this type of dash-mount again, but since there are no breakable parts, I will never ever need to replace it ever for anything. I want to buy these for everybody everywhere. More Surperlatives!I did also buy a separate arm mount to use with this because other reviewers pointed out a lack of depth in this mount with their unit.Using this, ARKON TTEP115 TomTom EasyPort Windshield / Dash Mount the Tomtom peeks over the end of this mystical magic mount and the combination works perfectly.",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr. J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXEI6OEPJCVEPUT2GEWN4J3LZPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2API64DET64IV?ASIN=B000U5TUWE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Stays put",
                "reviewText": "We had tried vent holders but the phone either got too hot or cold. Sticking a holder on the window didn’t work either. This has worked great. Stays in place. Easy to use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "2morrow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVGQNFWYL2XGS2C2OSIZD7BSHVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35RT0QRK03L46?ASIN=B000U5TUWE",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Good GPS mount alternative",
                "reviewText": "I have a Furrion backup camera monitor for our RV that kept falling off of the windshield. When looking for mount alternatives, I purchased both the clam shell style holder and the Bracketron Nav-Mat Portable GPS Dash Pad to try. Since our pickup dashboard had a small storage area on the center of it, I needed an item that would fit in the space, or was flexible enough to sit in the area without wobbling. The Bracketron Nav-Mat Portable GPS Dash Pad conforms well to the dashboard storage area, stays in place, and the suction platform works great. My only wish is that the dash pad was a bit smaller in circumference, but overall it fits the bill. 2morrow approved!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Turner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKTF5CZWRJMEVUDPWIVWCIZCJSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IXG7KJ5CI20Y?ASIN=B000U5TUWE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Good for the money",
                "reviewText": "Worked exactly as needed for my Garmin GPS.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5VWMADMM7LKUZD6FH4Z7S735FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I8ZG62X4JCFU?ASIN=B000U5TUWE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Recommended",
                "reviewText": "Works as advertised. Very stable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "joe seals",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOYGIXAMOJ3ZZ5MV6BWY45HPPXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GI1QC7LKMH7Q?ASIN=B000U5TUWE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice and heavy!",
                "reviewText": "Perfect for my Garmin 1450! Great buy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. G. SchneiderK. G. Schneider",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3SXLQ4FULVOGUAVW5VW4CL5OAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUZJU7TG7GTD3?ASIN=B000U5TUWE",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2008",
                "reviewTitle": "3.0 out of 5 stars Tight fit for the Nuvi 760",
                "reviewText": "For $11.50 (and no shipping, due to our Prime account) this is a very decent purchase. I drive a Civic Hybrid, and the larger friction mats are just too big for where I want to place the GPS. I was tired of attaching the suction mount to the windshield and dealing with the tell-tale suction marks.The mat will not budge, the suction stays sucked, and the mat is a great size for the dash. It's hefty but not overwhelming, and it feels well-made.So why three stars? The suction mount for the Garmin 760 isn't tall enough to let the GPS clear the \"donut\" portion of this mat. That means even after pushing the GPS (as much as I dare push an expensive little electronic device) the GPS sits tilted up, toward the sun, and attracts glare. (I uploaded a picture I took with my Blackberry.)Still, for long drives, and I do take a lot of them, I can put up with the nuisance of not seeing the screen as well as I'd like and being able to quickly disconnect the GPS and put it in the purse and throw the mat in the glovebox while I run into a gas station market. A taller GPS mount would cure this, obviously.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/417RYYp5QaL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGATYGGNTPKBGIA5ZGBTZUPYN3OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YOYW93I2J0QB?ASIN=B000U5TUWE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Great item",
                "reviewText": "This was the exact answer to my problems. My rear camera screen wouldn’t stay attached to my windshield and then would fall off and cause chaos. This has solved that issue. It stays put because of the grippy fabric on the bottom, plus it’s prettier weighty. Hasn’t moved any on my dash yet. Plus you can just grab it and hide it when you don’t want people knowing what tech you have in the car. Wish I had found it sooner!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "hublado",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 1, 2021",
                "reviewTitle": "Works Great !!!",
                "reviewText": "It doesn't move at all on the dashof my old Mustang convertible & when I'm parked I can easily hide it in the trunk. Best thing I've bought in years !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 2, 2019",
                "reviewTitle": "Brilliant product!",
                "reviewText": "Absolutely brilliant!!! Our new sat nav is bigger than our last one, and the mount is taller, making it top-heavy. The dashboard mat, which worked like a dream with our old sat nav, simply couldn't do the job. The new sat nav 'took off' at the first hill combined with a bend - complete with firmly attached mat! Having read hundreds of reviews for all sorts of designs - majority saying dash must be totally flat, which ours isn't - this one sounded hopeful. It is superb! Sat nav sits securely on its nest. Doesn't even wobble, let alone move! One tip - to attach sat nav mount to the centre disc, it needs to be on a firm, flat surface (did mine on kitchen worktop) - or it will come off. Once properly attached, it is incredibly secure - no danger of them parting company (and can be stored as a pair, ready for next time) and the really weighty base ensures it sits like a rock, exactly where it's put. Really prompt delivery and excellent value for money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexandre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on April 19, 2012",
                "reviewTitle": "très bon porte-gps",
                "reviewText": "En un mot : nickel.Le gps (Viamichelin x980-t) s'accroche très facilement sur la base universelle. Ce gps très lourd, avait une tendance facheuse à se décrocher très régulièrement du pare brise. Ici, de par le fait qu'il soit fixé de manière verticale, aucun décrochage. De plus, le gps peut rester fixer en permanence a sa base, ce qui évite des manipulations à chaque fois qu'on souhaite l'utiliser. Lorsqu'il est inutilisé, je range la base telle quelle dans mon coffre. IL ne rete plus alors qu'à reclipser le gps dessus.Le poids du support et le caoutchouc adhérent sous le support sont suffisants pour que l'appareil ne bouge pas, même avec des virages serrés.De plus, il rentre exactement dans l'espace devant l'afficheur électronique d'une peugeot 207, ce qui est très pratique pour moi.Seul bémol : une finition à l'aspect imparfait (assez anguleux)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 19, 2022",
                "reviewTitle": "Great product!",
                "reviewText": "It holds my gps very well. It is secure on my dashboard.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Revell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 2, 2008",
                "reviewTitle": "Highly Recommended",
                "reviewText": "Wanted something stable to attach Tom Tom 720 to that was quick and easy to use, without the messing about sticking the mount to the windscreen, only to have it come unstuck.This fits the bill excellently. However, the problem with the Tom Tom 720 is that the mount is small and doesn't work when trying to mount in a horizontal position (as opposed to vertical). So before I could use the Nav Mat I needed to get an \"Arkon suction mount arm\" (available from Morpeth Mobiles). This arm is great, is easier to attach /detach than the standard mount and has much better suction.The combination of these two bits of kit mean that it is a very stable (no slipping about whatsoever) mount for the Tom Tom and vibration free. When not in use is quickly & easily stored in the glovebox (with mount still attached to mat), leaving no telltale marks on the windscreen. Other Satnavs (that can be mounted horizontally on the dash) would obviously not need the extra Arkon mount.",
                "reviewVotes": "89 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$22.61",
                "sellerName": "Ordinary Outdoor Store",
                "sellerRating": "4.5"
            },
            {
                "price": "$22.82",
                "sellerName": "Less Is Always More ✱AUTHORIZED SELLER✱",
                "sellerRating": "4.5"
            },
            {
                "price": "$23.07",
                "sellerName": "Willy Goodprice [AUTHORIZED DEALER]✅",
                "sellerRating": "4"
            }
        ]
    }
}