{
    "remaining_requests": 40140,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Garmin-010-01772-00-Foretrex-601-inches/dp/B073NXKWYN",
    "body": {
        "name": "Garmin 010-01772-00 Foretrex 601, 2 inches",
        "price": "$199.99",
        "originalPrice": "",
        "rawPrice": 199.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Garmin-010-01772-00-Foretrex-601-inches/dp/B073NXKWYN",
        "soldBy": {
            "sellerID": "A3V25H3S1O04O9",
            "name": "Top Sports",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3V25H3S1O04O9&asin=B073NXKWYN&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08DJFMZ3M"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41drNvMhQPL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41UCTbubOQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Xn 1CJSUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31ow68tR1JL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31hFNdUyiXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 G8i1mQyL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/b9d94944-985a-5d38-8358-dd7777b3f8d0/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1bc773f-1d97-4381-9eb7-e7ea0e93daf8/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1ehl6015oL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1ehl6015oL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Garmin Store",
            "link": "https://www.amazon.com/stores/Garmin/page/675B188D-FBE3-4FF4-9DD0-E48E4A2C888D?ref_=ast_bln"
        },
        "brand": "Garmin",
        "merchantInfo": "Top Sports",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1592,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 10 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Durable, constructed to military standards (MIL STD 810G); night vision goggle compatible.Control Method:Voice.Special Feature:Bluetooth.",
            "Works with GPS, GLONASS and galileo satellite systems to provide accurate positioning",
            "Know where you are with navigation sensors, including 3 axis Accelerometer, 3 axis compass and a Barometric altimeter; smart notifications¹ allow your Device to receive emails, texts and alerts",
            "Battery life exceeds 48 hours in navigation mode, up to 1 week in UltraTrac mode and up to 1 month in watch mode",
            "NOTE:Kindly refer to the user manual provided as a PDF manual in the product description sectio"
        ],
        "description": "Explore the world hands free with the durable Foretrex 601 wrist-mounted GPS navigator built to military standards (MIL-STD-810G). Keep your bearings nearly anywhere with GPS, GLONASS and Galileo satellite systems, which provide accurate positioning. Includes built-in 3-axis accelerometer, 3-axis compass and a barometric altimeter. Explore longer -battery life in navigation mode exceeds 48 hours and lasts up to 1 week in UltraTrac mode. Stay connected with smart notifications -such as texts, emails and alerts -that appear right on your wrist. Other connected features include automatic uploads to the Garmin Connect online fitness community.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "Sports & Handheld GPS",
                "link": "https://www.amazon.com/GPS-Units/b/ref=dp_bc_aui_C_3?ie=UTF8&node=219536011"
            },
            {
                "name": "Handheld GPS Units",
                "link": "https://www.amazon.com/Handheld-GPS-Units/b/ref=dp_bc_aui_C_4?ie=UTF8&node=319582011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "0.9 x 2.9 x 1.7 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B073NXKWYN"
            },
            {
                "name": "Item model number",
                "value": "010-01772-00"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,592 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#27,332 in Electronics (See Top 100 in Electronics) #60 in Handheld GPS Units"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Connectivity technologies",
                "value": "USB"
            },
            {
                "name": "Special features",
                "value": "Bluetooth"
            },
            {
                "name": "Display technology",
                "value": "200 x 128 pixels"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Scanner Resolution",
                "value": "200 x 128 pixels"
            },
            {
                "name": "Whats in the box",
                "value": "USB cable, Foretrex 601, documentation, hook and loop wrist strap, strap extender"
            },
            {
                "name": "Department",
                "value": "unisex-adult"
            },
            {
                "name": "Manufacturer",
                "value": "Garmin"
            },
            {
                "name": "Date First Available",
                "value": "July 6, 2017"
            },
            {
                "name": "Brand",
                "value": "Garmin"
            },
            {
                "name": "Screen Size",
                "value": "2 Inches"
            },
            {
                "name": "Special Feature",
                "value": "Bluetooth"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Map Type",
                "value": "Africa"
            },
            {
                "name": "Sport",
                "value": "Hunting"
            },
            {
                "name": "Included Components",
                "value": "USB cable, Foretrex 601, documentation, hook and loop wrist strap, strap extender"
            },
            {
                "name": "Audio Output Mode",
                "value": "Digital"
            },
            {
                "name": "Battery Life",
                "value": "48 Hours"
            },
            {
                "name": "Mounting Type",
                "value": "Wrist Mount"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Durable, night vision goggle compatibleWorks with GPS, GLONASS and Galileo satellite systems to provide accurate positioningKnow where you are with navigation sensors, including 3-axis accelerometer, 3-axis compass and a barometric altimeter; smart notifications allow your device to receive emails, texts and alertsForetrex 701 adds Applied Ballistics Elite software that calculates aiming solutions for long-range shootingBattery life exceeds 48 hours in navigation mode, up to 1 week in UltraTrac mode and up to 1 month in watch mode OVERVIEW Navigate the World Hands-free Navigate the world hands-free with Foretrex 601 and Foretrex 701 with AB Elite software — the durable, wrist-mounted GPS navigators built to military standards. Keep your bearings nearly anywhere with GPS, GLONASS and Galileo satellite systems. Tougher Than It Needs to Be Foretrex 601 and 701 navigators are beyond durable. They’re built to military standards for thermal, shock and water performance (MIL-STD-810G). They also include tactical features such as compatibility with night vision goggles and Jumpmaster mode.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/19357748-7c2d-46b0-b25d-473ff365368b.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Multi-GNSS Navigation Includes Galileo Both Foretrex 601 and 701 work with 3 satellite navigation reception networks, including GPS, GLONASS and Galileo, to track your position in more challenging environments than GPS alone. Explore longer — battery life exceeds 48 hours in navigation mode and lasts up to 1 week in UltraTrac mode. Navigation Sensors Keep You on Track To guide you on and off the beaten path, Foretrex 601 and 701 provide comprehensive navigation and tracking using GPS plus ABC (altimeter, barometer and compass) sensor capabilities. The built-in altimeter provides elevation data to accurately monitor ascent and descent, while the barometer can be used to predict weather changes by showing short-term trends in air pressure. The 3-axis electronic compass keeps your bearings, whether you’re moving or not. The Most Accurate Ballistic Solver Available Foretrex 701 with AB Elite software is an excellent aid for hunters and target shooters. It comes equipped with Applied Ballistics Elite software to calculate aiming solutions for long-range shooting. Stay Connected Smart notifications — available on both devices — let you receive emails, texts and alerts from your mobile device right on your wrist. Use the Garmin Connect Mobile app to initiate the LiveTrack feature to allow others to follow your journey (within cellular coverage). Other connected features include automatic uploads to our Garmin Connect online fitness community and automatic software updates when paired to a mobile device.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/3043378d-914a-4e2d-b3e8-201c82dde9de.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/2f8e6bc1-16cb-474b-89ca-a410602e6f6d.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/3fa37c6b-cfb8-4fd4-904d-758b678807ea.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/4f3f3539-6bf1-4d52-9da8-d00b83cdc655.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/19357748-7c2d-46b0-b25d-473ff365368b.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/3043378d-914a-4e2d-b3e8-201c82dde9de.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/2f8e6bc1-16cb-474b-89ca-a410602e6f6d.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/3fa37c6b-cfb8-4fd4-904d-758b678807ea.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/4f3f3539-6bf1-4d52-9da8-d00b83cdc655.__CR0,0,600,600_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "paul",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF62BR6AHB4Z4Q7IYSUK4QNVF6QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TB66WO3XG06B?ASIN=B073NXKWYN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 26, 2020",
                "reviewTitle": "5.0 out of 5 stars Great GPS",
                "reviewText": "I have used this in the Army for over a year now and I love it. Before this I had a Fortrex 401 and loved it. There was some issues with the 401 that this solves. I will do a comparison of the 401 to to the 601.So the biggest upgrades from the 401 to the 601 are as follows.1. Battery Life- Like this is enough of an upgrade alone to justify it, if you are using these in the Military, or just use them often. I went from having to change my batteries every mission, to changing them every 3-4 days of heavy use.2. Built in Watch- Having the ability to now tell time is great, its saves you from having to carry another thing around your wrist, and works well. The watch only mode allows you to use this without taking much battery life at all, so you wont have to worry about it draining your battery supply for a watch.3. Back Light- The back light on this is way better than the 401's orange light. It has the ability to be super bright if you need a quick flashlight type ability, and on the other end of the spectrum, it has a night vision mode that is very dim and even on the darkest nights, cannot be seen past 10-15 meters.4. Screen- It has a much better resolution and slightly bigger screen on it, allowing you to more easily see everything displayed.5. GPS- The GPS seems like it connects a little faster than the 401 and is slightly more accurate at the single digit meter level, But that aspect is not a huge difference from the 401.Overall- If you are in the military or use GPS's a lot, this thing is amazing. It is small, doesn't kill your batteries and works extremely well.If you have a 401 already...trust me when i say the battery life alone makes this worth the upgrade.",
                "reviewVotes": "62 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gideon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7V3AWUXDQNQYQW2PTH3ZPTEW7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWASLI5C12JZC?ASIN=B073NXKWYN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "5.0 out of 5 stars More features to it than I thought",
                "reviewText": "There are more features to it than I thought. I bought this for map reading and positioning as I spend lots of time in nature. It meets all the requirements that I had and has other features such as averages and plenty of customizable User Interface options. I am happy with my purchase.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWMOCRLJ6P3SDOE7JBROOYL4OTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW8KXPI93UABS?ASIN=B073NXKWYN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2019",
                "reviewTitle": "5.0 out of 5 stars Mgrs",
                "reviewText": "This is a pretty good GPS. It is hard for me to say it's great due to the constant loss of connection with the satellite. This happened and happens even if I'm in a clearing between an area of thicker vegetation with slight overcast skies. Using it to get accurate azimuths is a little tricky you kind of have to average the readings.... not too difficult more like an easy educated guess. I was able to use this in Louisiana and New York and it has done what I needed it to do. Take me from point A and get me to point B or C or D and back. Batteries could last a little longer if you use lithiums but as for just regular triple a batteries three will last about 2 1/2 days. Depends on duration of use how good of a satellite connection and so forth. Over all a good fairly easy to use system.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric Wasson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYQPOVFSGMLZNUXBNQC2Z3UUDFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q04GX4OF37VM?ASIN=B073NXKWYN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2020",
                "reviewTitle": "5.0 out of 5 stars Used for hiking. PERFECT. Exceeded needs and expectations!",
                "reviewText": "Oky, the forst day I could not get it to work. ANGRY. The second day, I did a factory reset, and updated the firmware. SUCCESS. Around the neighborhood, I was pleased but underwhelmed, bored, non-plussed.Then I took it on a hike out in the woods. It is Wonderful. I effortlessy added important waypoints on the way into the hike, durng the hike, and used th GPS to track where I was at all times. I can track back on my reverse route, and can directly navigate to any waypoint. The barometer and altimeter are accurate, the compass (once calibrated) was on the money. The interface took a little time to learn, and then it was like second nature. There is a phone app you can use to offload your hike to the mobile phone (Android/Apple), and this feature is also great (bluetooth).My wife has a phone app that claims to do what this 601 can do, however it had notable limitations, and of course, some functions on the phone only woked with 4G connection. This is better thana mobile phone especially when 4G is spotty. -The 601 is water, dust, and shock resistant. I love it.The velcro strap (to me) i garbage, I bought a replacement silicon strap for the 601 from amazon, and it is awesome. HIGHLY RECOMMEND ths device and the upgrade strap. Link to strap: https://www.amazon.com/gp/product/B08BRXNX78/ref=ppx_yo_dt_b_asin_title_o02_s00?ie=UTF8&psc=1",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nate",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFATNWMBM66CZRJE2TV44UTBAUOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31CZ1K7WRHNT2?ASIN=B073NXKWYN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2023",
                "reviewTitle": "4.0 out of 5 stars GPS works",
                "reviewText": "Good value for money. I haven’t managed to get lost yet while hiking thanks to the Garmin. However there have been some reliability issues with connection to satellites.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 28, 2023",
                "reviewTitle": "Small, light, and accurate",
                "reviewText": "Used it Hunting. For the price, it is what it is: Reliable, tough, good battery life. Downside is it does it have maps-- but it's not really for that; this is to be used in conjunction with paper maps. If you are using it in this application it's great. For me, it was nice to mark blinds and find them at dawn.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kym",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 16, 2022",
                "reviewTitle": "Really good buy,",
                "reviewText": "This has been the best Garmin I’ve owned to date, I’ve owned a 301, 401 and yellow hand held one which I can’t remember the series of, but this one has really shone, it’s easy to use, very military friendly, robust, functional and sleek looking, a must have for an infanteer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GM J",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 29, 2020",
                "reviewTitle": "Excelente asistencia para navegar",
                "reviewText": "Este es el primer producto que adquiero de la marca Garmin y he quedado sorprendido por lo fácil que resulta configurarlo y usarlo. Por comentarios de personas que tienen más conocimiento que yo los GPS de Garmin son buenos y cumplen su función con precisión, el Foretrex 601 contribuye a esa opinión ya que tarda poco en recibir señal y muestra buen detalle de la zona en que te encuentres. Recomiendo que el Foretrex 601 se use en conjunción de un buen mapa de la zona en la que se utilice para confirmar la ruta. El Foretrex 601 es ligero y puede ser utilizado en el brazo o en puntos de sujeción de cualquier equipo destinado para este tipo de navegadores. Por último, sugiero que se lleven baterías extras ya que el consumo de energía del puede ser alto independientemente del modo en el que se use, además de que las baterías pueden llevar mucho tiempo en anaquel y tengan mediana o baja carga aunque se compren en el momento.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lalou",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on June 1, 2022",
                "reviewTitle": "Nickel",
                "reviewText": "Nickel",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maulesel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 18, 2020",
                "reviewTitle": "Schnell, genau und immer zur Hand",
                "reviewText": "Ich habe mir das Foretrex als Ersatz für mein altes gelbes Etrex der ersten Generation gekauft.Da ich viel mit meiner Mauleselin (als Packtier) in unwegsamen Gelände unterwegs bin, brauche ich ein kleines robustes und wasserdichtes GPS, dass mir die Richtung zum nächsten gespeicherten Routenpunkt sicher anzeigt. Der eingebaute elektronische Kompass dreht mir die Windrose genau so wie ich es mir vorstelle, ich muss mich dazu nicht mehr bewegen, wie es mit dem alten Etrex ohne Kompass notwendig war. Der nächste Routenpunkt wird als Pfeil im Display angezeigt! Datenfelder für Distanz und die eigene Geschwindigkeite können zusätzlich zur Kompassrose ausgewählt werden.Der Empfang vom GPS ist überragend gut und ich habe selbst in dichten Wäldern keine Datenverluste auf den Tracks. Dem Gerät ist es egal, ob ich noch einen Ärmel drüber ziehe oder eine Jacke anhabe, es empfängt immer und zu jeder Zeit. Sollte das Gerät einmal längere Zeit ausgeschaltet sein - der erste Fix ist in ein paar Sekunden da!Falls ich mich mal verlaufe, sollte es mich auf der gleichen Strecke zurück führen können. Dazu müssen die Tracks sehr genau sein - mit 10.000 Punkten können bei einem Abstand von 10 Metern zwischen den Punkten 100 Kilometer aufgezeichnet werden. Das ist weiter als meine längste geplantete Tagestour mit dem Tier. Lange Akkulaufzeit und die Verwendung von handelsüblichen Batterien waren auch mir wichtig - beides wird vom Gerät erfüllt. Wenn die Batterien schnell genug gewechselt werden, bleibt sogar das Gedächtnis erhalten :-)Je nachdem, welche Karten auf Papier ich nutze, kann das enstprechende Koordinatensystem zur direkten Anzeige gewählt werden, ein mühsames manuelles Umrechnen entfällt.Der einzige Kritikpunkt, den ich aufführen kann ist das miese Armband. Auch andere Armbänder aus dem Programm von Garmin sind für dieses Gerät nicht empfehlenswert. Ich habe mir ein Zulu-Nato-Strap mit 28mm Breite geholt und das GPS sitzt wie eine Uhr bombenfest. Zusätzlich gibt es noch Pouches, mit denen das Garmin abgedeckt und geschützt werden kann.Updates und Datenaustausch sind über ein USB-Kabel mittel BaseCamp, MapSource und Garmin Express leicht möglich. Das Andriod-Handy wird über die Garmin-Connect-App an die Garmin-Dienste angebunden - brauche ich nicht, aber es scheint ganz nett zu funktionieren.Das Backlight ist genial hell, kann aber im Menü abgedunkelt werden! Das Display ist sehr kontrastreich und gestochen scharf. Die Oberfläche soll sehr kratzfest sein. Ich habe aber eine Schutzfolie drauf gemacht - sicher ist sicher!Alles in allem ein nettes aber teures Spielzeug, dessen Funktion auf das Mindestmass beschränkt wurde. Es kann alles was ich brauche und wenn es wieder solange wie mein altes Etrex hält, ist es jeden Cent wert!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}