{
    "remaining_requests": 40020,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Amcrest-GPS-Tracker-Vehicles-Geofencing/dp/B09C7GCQD3",
    "body": {
        "name": "Amcrest GPS Tracker for Vehicles - No Contracts - Real Time Tracking, Geofencing, 1-Year OBD Data, Easy Plug & Play Install, Instant Alerts & Reports, Track Vehicles & Loved Ones, Activation Required",
        "price": "$19.99",
        "originalPrice": "",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Amcrest-GPS-Tracker-Vehicles-Geofencing/dp/B09C7GCQD3",
        "soldBy": {
            "sellerID": "AM1AKWRN957PC",
            "name": "Amcrest Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AM1AKWRN957PC&asin=B09C7GCQD3&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41FHCkxLU7L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Jc8kW6LdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Zl4XnEKrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41GlwDSwkXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51otl EYOuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41A7rKEyfdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517xpnCe0kL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5fa37c44-2be5-470c-8c69-0fa477e8d320/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/27c310ac-f6e8-405f-b47f-c2b6d3ccabdf/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1UzXFcp9TL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71E9ENNiDQL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Amcrest Store",
            "link": "https://www.amazon.com/stores/Amcrest/page/2404E471-79FC-4D18-B767-8777D048264F?ref_=ast_bln"
        },
        "brand": "Amcrest",
        "merchantInfo": "Amcrest Direct",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 57,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "OBD & GPS Tracker for Vehicles - The Amcrest OBD GPS Tracker plugs directly into your vehicle's OBD-II port and provides 30sec updates to the server, with optional upgrades available (15sec, 5sec, 1sec). Because the discreet 4G GPS tracker draws power directly from the OBD port, you will never have to worry about running out of battery. Add multiple devices to one account to track multiple vehicles (Seperate subscription required).",
            "Real Time Tracking & Geo-Fencing - The Amcrest GPS tracker for vehicles provides you with real-time tracking and allows you to create custom Geofence zones that will alert you of anytime someone enters/leaves the zone. Track your trucks, cars, fleet vehicles, seniors, teenagers or spouse directly from the Amcrest GPS Fleet app, available on the App Store and Google Play.",
            "Smartphone Alerts and Reports - Receive instant push notifications, sms or email alerts for no-go zones, speeding, address start and stop points, speeding, braking, rapid acceleration. The vehicle OBD also provides fault codes, maintenance notification, battery voltage, fuel economy, idling and more!",
            "The Amcrest Advantage, No Contracts - Amcrest offers flexible pricing plans for the OBD tracker. $12.95 - 30 second update, $19.95 - 15 second update, $24.95 - 5 second update, $29.95 - 1 second update. 6 Month & Yearly Plans are Available. Cancel anytime with Amcrest hassle free no contract plans.",
            "Lifetime Warranty - At Amcrest, we want to ensure the safety of our customers, their loved ones, homes and businesses. You’ll receive a Lifetime US Warranty and Lifetime Support provided directly from Amcrest. If you're not happy for any reason please feel free to reach out to us within 30-days and we will do everything in our power to make things right."
        ],
        "description": "AMCREST MODEL: AM-GV500 Monthly GPS Subscription Plans: $12.95 for 30-sec updates $19.95 for 15-sec updates $24.95 for 5-sec updates $29.99 for a 1 second updateOBD GPS FEATURES: OBD GPS FEATURES: Bluetooth: BTE 4.2 GNSS Type: u-blox All in One GNSS Receiver Position Accuracy (CEP) Autonomous: <2.5m The Amcrest OBD GPS Tracker plugs directly into your vehicle's OBD-II port, the discreet 4G GPS tracker draws power directly from the OBD port, you will never have to worry about running out of battery GPS Tracker is limited to 4G and will only work in areas where there is 4G coverage Operating Temperature: -22°F ~ +176°F (-30°C ~ +80°C) GPS Dimensions: 1.95 x 1.91 x 0.86 inches GPS Weight: 0.12 lbs IMPORTANT - This device is configured to work in the US, Canada and Mexico only. We stand by our products and offer a lifetime warranty and unlimited support. In the event that your device produces undesirable results, we'll gladly refund 100% of your hardware and subscription charges. IMPORTANT - This device is configured to work in the US, Canada and Mexico only. We stand by our products and offer a lifetime warranty and unlimited support. In the event that your device produces undesirable results, we'll gladly refund 100% of your hardware and subscription charges. UPC: 857627006461 SKU: AM-GV500 OBD & GPS Tracker for Vehicles The Amcrest OBD GPS Tracker plugs directly into your vehicle's OBD-II port and provides 1-minute updates to the server, with optional upgrades available (15sec, 30sec). Because the discreet 4G GPS tracker draws power directly from the OBD port, you will never have to worry about running out of battery. Add multiple devices to one account to track multiple vehicles (Separate subscription required). Real Time Tracking & Geo-Fencing The Amcrest GPS tracker for vehicles provides you with real-time tracking and allows you to create custom Geofence zones that will alert you of anytime someone enters/leaves the zone. Track your trucks, cars, fleet vehicles, seniors, teenagers or spouse directly from the Amcrest GPS Fleet app, available on the App Store and Google Play. Smartphone Alerts and Reports Receive instant push notifications, sms or email alerts for no-go zones, speeding, address start and stop points, speeding, braking, rapid acceleration. The vehicle OBD also provides fault codes, maintenance notification, battery voltage, fuel economy, idling and more! The Amcrest Advantage, No Contracts Amcrest offers flexible pricing plans for the OBD tracker. $12.95 - 30 second update, $19.95 - 15 second update, $24.95 - 5 second update, 1 second update, $29.99. Cancel anytime with Amcrest hassle-free no contract plans. Shipping, Warranty, & Support When you purchase directly from Amcrest you are not only purchasing a product, but also the value-added service of same-day shipping from our US based warehouse. We have a 30-day money back return policy and a warranty replacement process all based out of the US. If you need help, click our Support Tab to gain access to step-by-step guides, video tutorials, and our community support forums. And if you still need additional assistance, feel free to call or email our technical support team. We’re happy when you’re happy! Color Black Night Vision 32 feet / 10 meters Model AM-GV500 Text Above Add to cart Button 0 Try Amcrest Cloud 1 Request Info Button 0 Hide Price 0 Warranty No Amazon Checkout Url https://www.amazon.com/dp/B09C7GCQD3?ref=myi_title_dp 1 x Amcrest 4G OBD GPS Tracker (AM-GV500) Quick Start Guide.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "4.92 x 4.17 x 1.42 inches"
            },
            {
                "name": "Item Weight",
                "value": "5 ounces"
            },
            {
                "name": "ASIN",
                "value": "B09C7GCQD3"
            },
            {
                "name": "Item model number",
                "value": "AM-GV500"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 57 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#114,876 in Electronics (See Top 100 in Electronics) #328 in GPS Trackers"
            },
            {
                "name": "Connectivity technologies",
                "value": "Cellular"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Whats in the box",
                "value": "Battery"
            },
            {
                "name": "Manufacturer",
                "value": "Amcrest"
            },
            {
                "name": "Date First Available",
                "value": "August 9, 2021"
            },
            {
                "name": "Brand",
                "value": "Amcrest"
            },
            {
                "name": "Connectivity Technology",
                "value": "Cellular"
            },
            {
                "name": "Supported Application",
                "value": "Alarm"
            },
            {
                "name": "Included Components",
                "value": "Battery"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LschemLschem",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMK4BARJRMVFWSIKPD6HHGBP7TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RRTUU5N4UZFT?ASIN=B09C7GCQD3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2021",
                "reviewTitle": "5.0 out of 5 stars Great tracker for the money",
                "reviewText": "This GPS tracker seemed like a great product at the price it's selling for, and I have to say I am very satisfied with it. I had some concerns when I first ordered it that it might stick out a little too far when it's plugged into the OBD-II port, because I have an OBD-II Bluetooth scanner that will get in the way when it's plugged in. After unboxing it and plugging it in though, it is shorter than the OBD-II scanner and has not caused me any issues at all. The LED status lights on it are a little on the bright side, so when I'm driving at night I can see them flashing near my feet, but not so much to be a distraction. There are OBD-II extension cables available that would allow the tracker to be moved to somewhere under the dash if necessary. Some vehicles have a door or hatch that covers the OBD-II port, and it would be inconvenient to keep that door open all the time to accommodate this tracker. If a cable can be found that's slim enough, maybe it would allow for the OBD-II door to stay closed while it's in use.The tracker powered on and was activated very quickly and easily, and I was able to begin configuring settings in the Amcrest GPS Fleet app right away. There are a very large number of options beyond the simple tracking, including zones, zone groups, reports, and alerts. It took some tinkering to figure out the flow of setting up a zone for alerts, but once I figured out all the pieces it was much easier to set it all up. The alerts for entering/exiting a zone are sent out very quickly via email, SMS, or push notification through the app, or any combination of these. There is also a secondary contact for notifications to send them to another phone number or email address. I can see this being very useful for a business or fleet manager in order to send alerts to the manager of an assigned vehicle.I have not been able to receive any of the speed/engine/harsh driving type alerts with my vehicle, but it is a 2004. When I plugged into another vehicle, which is a 2017, those alerts started working. I am assuming the problem is my truck is just too old, and I will be asking Amcrest support if this is indeed the case. The tracking icon on the map shows accurate information regarding the ignition status and vehicle movement though, so it's possible that I've missed a setting somewhere. There is a manual on Amcrest's support page that mentions a procedure to synchronize the OBD-II protocol using some software provided by them, so I will be looking for that software next.There is also a web interface for tracking, which makes things easier to navigate if the app is not to your liking. That also provides a very interesting feature; the ability to share a link with another person that lets them track a device in a web browser. When the link is generated it says it's valid for three days, so after that time period a new link will have to be sent. I've looked around to see if it's possible to permanently share a device with another user, but I haven't come across any settings like that yet.The 4G reception has been excellent, though there is excellent coverage in my area. I have not been outside my area very far, so I can't say exactly how good the coverage really is anywhere else.I've been testing this out for about three weeks now, and I am extremely happy with it. I'm not running a fleet of vehicles or anything, but I could see this being very beneficial to a business to track the whereabouts of their fleet.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/810XZMYD+EL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shinam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUX7PLWJ3TIWW565EI3GBNA6PLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G0KVK1VMT7LN?ASIN=B09C7GCQD3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars good product",
                "reviewText": "good service and app, I am able to track all my cars as they go out for rent.Great product. I don't have to worry about keeping it charged. Plugging it directly into OBD ports helps a lot.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AidanToreador",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRCDKH6Q2WNRCGIQPWFYOK2I2GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROLLR2VA96V9L?ASIN=B09C7GCQD3",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2021",
                "reviewTitle": "1.0 out of 5 stars DO NOT BUY",
                "reviewText": "I have typed up this review multiple times and it keeps disappearing. The gps worked great for the first two weeks and then it stopped reporting. I contacted tech support after attempting to reboot multiple times and they refused to help me w/o a ticket number which is supposedly emailed when you request tech support through the app. I never received an email in response to my THREE requests so long story short I returned it and got a full refund.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason Schneider",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF55JSOZC4X4OREOYK4UFZ3QDVPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1L6C7JO7I5QZ6?ASIN=B09C7GCQD3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "4.0 out of 5 stars Great GPS unit for teen drivers",
                "reviewText": "The Amcrest GPS unit has been great for keeping track of my teen driver. The only issue I've had is the alerts occasionally don't get sent to my phone. But overall I love the product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ellen Hooper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBXHKUVNM3OFYSB3ZKPS3FN2HEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V7GRDFK3MPH6?ASIN=B09C7GCQD3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Works as described",
                "reviewText": "Sometimes the unit reports it is being \"towed\" when it is not. Other than that, we have found this to be very effective and we like it a lot. We also appreciate the low subscription cost and the ability to pay for the year or by the month. If you need exact addresses for location this is not the unit for you, but overall we would suggest this option for a small business that needs tracking and does not meet the minimum unit requirements that the larger tracking companies have.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Willie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5FQWEI4ZTFMRAIO3KPU57PLTLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KTOLCK234WD2?ASIN=B09C7GCQD3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Telematics at an affordable cost",
                "reviewText": "Let me start by saying that I work with telematics for a living and this little device is great for personal use with some more tweeting it can be even better for commercial use. The web interface is very user friendly, it can display trip reports with engine on and engine off alerts. It provides a wide variety of alerts but I found the best feature if the zone setup, you can track when a vehicle reaches a location, how often it's there, etc. This is also great for tracking your elderly parents.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James H. Rorie, Jr.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVNJAOYVI4EQTMIIV22TLC4BT5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI762O1V51UWM?ASIN=B09C7GCQD3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2022",
                "reviewTitle": "5.0 out of 5 stars The best GPS Tracking Device I Have Ever Used",
                "reviewText": "I am a licesend private investigator in North Carolina of which we are legaly authorized to utilize tracking devices on our cases. I have been using tracking devices since they became available and switched to Amcrest several years aog because I was very unhappy with the service I was getting from another company. Since then, I have more than pleased with the accuracy and the mapping software that comes with the Amcrest devices. I recently purchased this particular device for my own vehicle to keep up with my mileage and location to help with the details of an investigation. The best part of the Amcrest is the customer and tech support. I have had special request and a few minor issues that were acted on immediately and never once was it handled anyway but professional and with amazing speed which this day and time is un heard of. If you are in need of a tracking device be it personal or in a professional setting....... I can highly recomend Amcrest!!J. Rorie",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marilyn Gale",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJSP5NPOAOTFT7UDNCDJ6LZ3K2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3WSFTN51W7EG?ASIN=B09C7GCQD3",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "1.0 out of 5 stars Gps",
                "reviewText": "I have emailed and called with no response to the defective tracker. I have paid the $145.00 yearly membership and this product does not work! I would like a refund for both membership and tracker.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}