{
    "remaining_requests": 40123,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/MoniMoto-Motorcycle-Tracker-Installation-Required/dp/B09Q69N4VT",
    "body": {
        "name": "MoniMoto 7 (2022) Plus 3 Edition Motorcycle Tracker and Alarm with DIY Installation, No Wiring Required - Smart Motorcycle GPS Tracker - GPS Tracker for Vehicles, Scooters, Quad Bike ATVs",
        "price": "$149.00",
        "originalPrice": "",
        "rawPrice": 149.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/MoniMoto-Motorcycle-Tracker-Installation-Required/dp/B09Q69N4VT",
        "soldBy": {
            "sellerID": "A300KF2G7GT8EQ",
            "name": "MoniMoto USA",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A300KF2G7GT8EQ&asin=B09Q69N4VT&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41AdSaG1E5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/410KeQV6pUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LALIfWcjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517FMpYyWML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5175OHkT8bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oY52-kA L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BO9TyH-sL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d59e205-71d1-49d2-b2c3-9293988de56e/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: IIIONI IIIOTO",
            "link": "https://www.amazon.com/IIIONI-IIIOTO/b/ref=bl_dp_s_web_19263200011?ie=UTF8&node=19263200011&field-lbr_brands_browse-bin=IIIONI+IIIOTO"
        },
        "brand": "IIIONI IIIOTO",
        "merchantInfo": "MoniMoto USA",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 488,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 9 hrs 41 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "EASY INSTALLATION - Monimoto GPS tracker for motorcycles is wireless and battery powered for quick and easy installation, whilst also offering more options to hide the tracker or move from one ride to another. Wired anti-theft devices are easy to remove and drain your bike’s battery life. Your wireless tracker’s batteries can last up to one year or more.",
            "JOIN US - This GPS tracker for vehicles no monthly fee for 3 months comes with an embedded international e-SIM card and works in most parts of the world. 49$ payment will be needed after a free period of 3 months. E-SIM card will then be activated for 12 months.",
            "STAY ALERT - Our GPS tracking device for cars and motorcycles calls your phone in less than 1 minute if movement is detected and there is no paired Key Fob nearby. Our automotive tracking devices' phone call is more effective in attracting the owner's attention than just a push notification or text message.",
            "WORLD CLASS SUPPORT - Enjoy direct support with every tracker device for vehicles purchase. Our motorcycle and car tracker device is built with user convenience in mind, but we're here for you if you need us! All after sales support is done directly through the App. Just download the App and follow the wizard!",
            "USER FRIENDLY DIY - This motorcycle and car tracker device hidden comes with releasable plastic zip ties so it can be easily attached to a motorcycle frame or other stable part. No need for complex installation manuals - you can do everything by yourself even if you don't have any technical knowledge."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2.36 x 0.79 x 3.94 inches"
            },
            {
                "name": "Item Weight",
                "value": "6.4 ounces"
            },
            {
                "name": "ASIN",
                "value": "B09Q69N4VT"
            },
            {
                "name": "Item model number",
                "value": "MM7E1A"
            },
            {
                "name": "Batteries",
                "value": "2 AA batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 488 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,119 in Electronics (See Top 100 in Electronics) #45 in GPS Trackers"
            },
            {
                "name": "Connectivity technologies",
                "value": "Cellular"
            },
            {
                "name": "Special features",
                "value": "Wireless"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Whats in the box",
                "value": "Battery"
            },
            {
                "name": "Manufacturer",
                "value": "MoniMoto"
            },
            {
                "name": "Date First Available",
                "value": "January 11, 2022"
            },
            {
                "name": "Brand",
                "value": "IIIONI IIIOTO"
            },
            {
                "name": "Special Feature",
                "value": "Wireless"
            },
            {
                "name": "Connectivity Technology",
                "value": "Cellular"
            },
            {
                "name": "Supported Application",
                "value": "GPS"
            },
            {
                "name": "Included Components",
                "value": "Battery"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "WHAT‘S IN THE BOX? 1 x Monimoto 7 Plus 3 Edition GPS tracking device – 3.7 x 2.4 x 0.75 in1 x Monimoto Key Fob – 1.7 x 1.1 x 0.4 in2 x Releasable zip ties2 x Lithium AA 1.5V batteries for Monimoto 7 Plus 3 Edition device1 x CR2032 battery for Monimoto Key Fob1 x Integrated international eSIM card with 3 months free subscription",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/16038778-78cf-4d8b-954b-457c79c532fb.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "THE TRACKER This small and easy-to-hide GPS tracking device is the heart of the Monimoto anti theft motorcycle alarm system. The waterproof casing is packed with a motion detector, a GPS tracker, and the hardware to notify you if your bike is being messed with or moved. The better you hide it on your bike, the safer your bike will be. Within a minute after detecting movement and not detecting your Key Fob, the Monimoto tracker calls you on your phone. THE KEY FOB All you need to do is have the Key Fob with you - no buttons. We suggest carrying it somewhere in your riding gear separately from your keys so you do not lose it. As soon as you (and your Monimoto Key Fob) leave your motorcycle behind, the tracker will not be able to detect your Key Fob anymore. When that happens, the tracker arms itself and its motion detector. If anyone - from thieves to rowdy kids - handles your bike, it will know. THE MOBILE APP The App will notify you if your Monimoto GPS tracker detects movement. If your bike is stolen, your App will reveal its location so your precious ride can be recovered as soon as possible. When you ride your motorcycle, the Key Fob disarms the tracker. But when you are away and the tracker detects movement, it will notify you and activate its GPS tracker if it starts moving. From that point on, you will get constant updates on its location.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8dcaa3b7-adb4-495e-b5db-18efb1b726a4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1bbf995c-321f-4433-bcfd-6aace8c37466.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/865f144b-afbd-41ce-91e5-1d175d4567b1.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "TECHNICAL PARAMETERS PROTECTION RATING: Monimoto and the Key Fob both meet IP65 standard, meaning they are protected from dust and against low-pressure water jets, such as a faucet E-SIM CARD COVERAGE: Embedded international e-SIM card. Works globally in mosts parts of the world. Payment will be needed after a free period of 3 months. E-SIM card will then be activated for 12 months 2G (GSM) FREQUENCIES (BANDS): B2, B3, B5, B8 LTE Cat-M1: B1, B2, B3, B4, B5, B8, B12, B13, B18, B19, B20, B25, B26, B27, B28, B66, B71, B85 POSITIONING: GPS, GLONASS + Telit IoT LOCATE ADVANCED POSITIONING: 2G and LTE-M (LTE Cat-M1) cellular towers DEVICE WEIGHT: 95 g / 3.35 oz DEVICE DIMENSIONS: 94 x 61 x 19 mm / 3.7 x 2.4 x 0.75 in BLUETOOTH: Bluetooth Low Energy (BLE). Your smartphone needs to have Bluetooth 4.0, Bluetooth Low Energy or later in order to work with Monimoto motorcycle theft tracker MONIMOTO APP: Apps for iOS and Android available. Minimum OS requirements: iOS 9.0 and Android 5.0. Monimoto does not work with Android 6.0 DEVICE BATTERIES: Monimoto Device is powered by 2 Lithium AA 1,5V 3000mAh FR6 that can last up to 12 months. Operating temperatures -15°C to 60°C (-40°F to 140°F) KEY BATTERIES: Monimoto Key Fob is powered by a 3V Lithium CR2032 (1 battery) that can last up to 3 years. Operating temperatures -15 to +55°C (-4 to 131°F)",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d100e8a4-162c-418c-ac3f-0b0891bfe7d5.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/229ba628-5552-4699-9fdf-2535e58f59df.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/16038778-78cf-4d8b-954b-457c79c532fb.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dae16e6f-de25-4efb-8b5c-2b0a6fa4ecd4.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8dcaa3b7-adb4-495e-b5db-18efb1b726a4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1bbf995c-321f-4433-bcfd-6aace8c37466.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/865f144b-afbd-41ce-91e5-1d175d4567b1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f39f28d3-e672-4433-8a38-f544a954c514.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Quinn S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2R2HKDASH257DHTGAFY6WDYSKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRWVZSFT8G717?ASIN=B09Q69N4VT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Effective and worth my trust.",
                "reviewText": "The Monimoto is a real theft prevention product, unlike the various scammy GPS trackers on the market that are just trying to screw you into a monthly payment and charge you more money to get get more frequent location pings (absolute 🐕💩).The times I have gone out and forggoten the fab I was immediately called on my phone. This is an important feature. I should not have to rely on or screw around with an app in the event my bike is attempted to be stolen. There is an app included with the tracker, and it seems to be effective, though I've never had to use it much.You will pay a small yearly fee for the sim card on the Monimoto. This is fair, as you are just paying for what you are actually using. Once again, there are many GPS trackers out there that are trying to charge you arbitrarily high prices and insane monthly subscriptions just to use their service, which are generally just providing the illusion of security. This is a one time purchace with a small ocasional fee. I hope more motorists find this product as it is one of the only one's that is actually protecting your vehicle from theft whilst not robbing you every 30 days in the process.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Byo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCIQCUCRP5MLBHOXGSTC7NSJWRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R116OYIPN9KEC1?ASIN=B09Q69N4VT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Must have",
                "reviewText": "I was able to set fob and sensor distance. When I was working on my machine, the fob was away in my bedroom and the sensor detected the movement. This was about 15 feet.I like this came with 2months trial to test the sensitivity and function. Also the yearly subscription is way cheaper the any in the market now.My residence always had low signal strength but this had no trouble warning me of movement.Initially, map and GPS location does not show. They shows after it is triggered and the location has good accuracy even after the sensor was placed under the fairing.The app seems simple but it shows all the necessary info, such as fob and sensor battery levels.Thus came with 2 zip ties and sensors has slits to secure unto any available spots.This is must have for any riders and gives you a peace of mind.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDJE6DDOD5Z7XL7PI6HPLO4UYMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GDEM4M2WDIWI?ASIN=B09Q69N4VT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great so far",
                "reviewText": "I’ve been using it for about 5 months and it’s been working well most of the time. Once in a while, it doesn’t connect or receive signal on its daily check in but finds it the next day even if I don’t go near my bike. It’s quite sensitive too, my neighbor backed into my bike and knocked it into the wall. It barely toppled over but I got a phone call right away. So far so good, I’m happy with this purchase. It does it’s job.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PDA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETZ77TEMET7K2OVOXU6QER3H3IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17TRN2RFH7RSE?ASIN=B09Q69N4VT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 2, 2023",
                "reviewTitle": "4.0 out of 5 stars Good but not easy to set up",
                "reviewText": "i cannot set 5 stars as it wasn't working out of the box and i had to contact customer service who make me install another app on my phone.does what it said",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF3MCYXTQIEJVZFAVPLLGXTJ2IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IXF7JYQE20OY?ASIN=B09Q69N4VT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2022",
                "reviewTitle": "5.0 out of 5 stars Great product and great support",
                "reviewText": "To start with I have two of these the first one has been working flawlessly for past 2 years. The second developed a problem regarding the battery sensor. Other than that it was working fine. I was out in contact with customer service via the app and they have been supper helpful. While they couldn’t fix the problem they sent me a new one and transferred the balance of my SIM card to the new unit. While the unit operated as stated I can’t say how mush I respect a company that stands by what they sell. I know nothing last forever but when things go south it’s refreshing to deal with customer service that tries to do the right thing and makes the process as painless as possible . The accompanying app is easy to use and setup of unit is painless. If you have a motorcycle or car this device is well worth the piece of mind for the reasonable cost.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stefan M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZ7LXE74DISBJBNSVCURPF7WDCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14Y2864BBWK1?ASIN=B09Q69N4VT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Worke in more countries than they say",
                "reviewText": "Works like a charm also in Morocco, Senegal, Gambia and Ivory Coast (and for more than a month in the latter).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TotoroTiger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4DLRXSIFOX325ZXBZFZJO4NTWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MBOAQZFIW8RZ?ASIN=B09Q69N4VT",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 28, 2023",
                "reviewTitle": "1.0 out of 5 stars Don't Trust",
                "reviewText": "Took forever to get through the set up because it refused to recognize the tracker despite following the very brief and not very helpful troubleshooting instructions. I never actually got completely through the set up at that, I was only able to get it to connect to the bluetooth eventually and that took forever. It refused to connect to the network and continually said GSM error. I live in a populated area, and tried it in various places. It says it takes 2 minutes to check, it took at least 8 each time it did the process and I spent almost 2 hours trying to get this to work. I went outside, still didn't work. Went across town, still didn't work. Held it up high, no dice, etc., etc. Well, if I cannot even get it to recognize the network in a populated area where all GSM networks have complete coverage, how can I trust this to give me an update if something were to happen to my bike? I was excited for this because it has an awesome battery life, doesn't require constant power with the possibility of draining the bike's battery, is pretty easy to conceal, etc., but nope. Had to return because it refuses to connect to the network and I refuse to pay a subscription fee for a product that may or may not work when I actually need it to.Edit: I used another tracker that uses the same network and it worked right away. No idea why this didn't.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4GAPSHWBDLJH7JJ5KKQJ56IYNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MSMQ17BDKCE5?ASIN=B09Q69N4VT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars tracker for my 2020 suzuki gsxr 750",
                "reviewText": "this works amazing, i feel really safe that my bike would get found if it was stolen. i tested it and it called me just like it said it would and i could also track the bike",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Roode",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 21, 2023",
                "reviewTitle": "Werkt goed, precieze info waar de motor zich bevindt.",
                "reviewText": "Na 10 maand te gebruiken. Werkt perfect. Netjes iedere dag een melding. Precieze info waar de motor zich bevindt. Klant contact perfect .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frank",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 20, 2023",
                "reviewTitle": "Fait le job",
                "reviewText": "Pas de difficulté à le mettre en service, petit test concluant, appel sur le téléphone immédiat, et localisation précise de ce que j'ai pu voir....application basique mais bien pensée.Moto garée en sous sol, capte le signal.En espérant ne pas avoir à s'en servir!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Renzo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on October 26, 2023",
                "reviewTitle": "Molto meglio di quanto mi aspettassi",
                "reviewText": "Il sensore di movimento è davvero accurato,Prende praticamente ovunque e la app è fatta abbastanza bene anche se migliorabile",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarge8610",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 16, 2023",
                "reviewTitle": "Well worth the money",
                "reviewText": "I've always been out off buying a tracker because of the price and the hassle of getting it wired into the electrics, then i saw the Monimoto 7,it's battery operated, so that's a result.The reviews were all excellent, and the 7 is the third and latest model, it's a lot smaller then the 'wand' type tracker in the previous models.This is about a cigarette packet size unit, you can attack it to your bike using the provided zip ties or like I've done use some velcro.The tracker is VERY simple to set up, first thing you need to do is download the app and follow the instructions, it'll be ready to test in a couple of minutes.Once fitted to the bike you need to place the key fob that comes with it approx 50m away, then you just shake the bike or move it a couple of feet, make sure you do this outside and not inside a garage.You will then receive a message in the app saying the tracker has been alarmed, it will also give you the exact location of the bike.The first three months are free to use it, then it's £3 per month, well worth it for peace of mind, once the tracker is set up you can go into settings and manually turn the option on to recieve a phone call, I've done this as it'll be easier to hear at night when I'm asleep.With the amount of scumbags out there these days the monimoto 7 is just another level of protection to go with your ground anchor, chains, locks and disclocks, you'll never need to worry about the battery running out as it will warn you when to replace them, if you decide to buy this i promise you won't be disappointed, it really is an excellent buy of kit.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raul",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on May 13, 2023",
                "reviewTitle": "Cumple con lo esperado.",
                "reviewText": "La sincronización entre llave y dispositivo es muy sencilla e intuitiva. El seguimiento GPS funciona correctamente y el aviso al móvil en torno a un minuto. Al ser el tamaño bastante reducido se puede ocultar bien en la moto. Muy recomendable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}