{
    "remaining_requests": 40179,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GPS-Tracker-Vehicles-Anti-Theft-Motorcycles/dp/B09TB52BSG",
    "body": {
        "name": "4G GPS Tracker for Vehicles - Real Time Location Monitor, Anti-Theft/Tamper Alerts, Long Standby Time, Magnetic Mount, Free Tracking Platform - Ideal for Cars, Motorcycles, Boats.",
        "price": "$30.99",
        "originalPrice": "$48.99",
        "rawPrice": 30.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/GPS-Tracker-Vehicles-Anti-Theft-Motorcycles/dp/B09TB52BSG",
        "soldBy": {
            "sellerID": "A17USOFNY5O4YJ",
            "name": "Yangtongjixies",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A17USOFNY5O4YJ&asin=B09TB52BSG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C9H2BV66"
        ],
        "asinVariationValues": [
            {
                "asin": "B09TB52BSG",
                "variationName": "Model",
                "variationValue": "4G LM002AB",
                "price": "$30.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CJVPSPYN",
                "variationName": "Model",
                "variationValue": "GT06N",
                "price": "$33.99",
                "variationImageURL": ""
            },
            {
                "asin": "B077695W5K",
                "variationName": "Model",
                "variationValue": "GT06N-4G",
                "price": "$29.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41d4AAalUJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51xp4ORJshL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5129Q4NtX9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VEC8myi8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aC2DAiqzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WX67cjZXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FrzcJRQAL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/72649a41-7adc-4435-9ac3-f8bbfd591b1b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b65ec2a3-1ce3-40e0-aaa6-ef4a1258fd2e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cfb81a90-e7a7-4592-b979-3bb58c8d84fb/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/837e2c69-e6d0-4a67-85db-834d12079960/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8fba878-be61-46df-a4eb-184c8db6e85f/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c75d51df-8e87-44a9-a9b5-4d214501c226/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81ISUBoc0ZL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1vWqYCR6hL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the YangDiana Store",
            "link": "https://www.amazon.com/stores/YangDiana/page/766BE984-1D68-4BCB-BB89-049914A33D7E?ref_=ast_bln"
        },
        "brand": "YangDiana",
        "merchantInfo": "Yangtongjixies",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 272,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 12 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✈️High-performance tracker: This GPS tracker utilizes the latest GSM/GPRS network and GPS satellite positioning technology, providing comprehensive security, real-time tracking, and emergency alarms. Ideal voltage range: 9V - 95V. Suitable for vehicles, trailers, and fleet management.",
            "✈️Easy operation: Easy authorization process with support for up to 4 authorized numbers. Simply send an SMS to the device to authorize. Free PC software and Google Maps integration for easy tracking. Can also receive detailed location address via SMS.",
            "✈️Versatile application: Perfect for vehicle leasing, fleet management, anti-theft for motorcycles, scooters, and bikes, and real-time tracking for personnel management. Great for a wide range of vehicles and asset tracking.",
            "✈️SIM card support: Requires a SIM card for unlimited data coverage. Compatible with 2G/3G/4G SIM cards, such as SpeedTalk and T-mobile in the US. No contracts or activation fees, with a subscription plan of at least 30M monthly data.",
            "✈️Global GPS tracking: Works based on GPS + LBS + GSM technology, allowing for worldwide tracking via SMS, calling, App, and Web. Suitable for vehicles and assets in any location with GPS signal coverage."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2.83 x 1.81 x 0.87 inches"
            },
            {
                "name": "Item Weight",
                "value": "5.9 ounces"
            },
            {
                "name": "ASIN",
                "value": "B09TB52BSG"
            },
            {
                "name": "Item model number",
                "value": "4G LM002AB"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 272 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#125,379 in Electronics (See Top 100 in Electronics) #347 in GPS Trackers"
            },
            {
                "name": "Connectivity technologies",
                "value": "Cellular"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Whats in the box",
                "value": "Cable, User Manual, Battery"
            },
            {
                "name": "Manufacturer",
                "value": "Yangtongjixies"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "March 1, 2023"
            },
            {
                "name": "Brand",
                "value": "YangDiana"
            },
            {
                "name": "Connectivity Technology",
                "value": "Cellular"
            },
            {
                "name": "Supported Application",
                "value": "Alarm"
            },
            {
                "name": "Included Components",
                "value": "Cable, User Manual, Battery"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "2.83 x 1.81 x 0.87 inches"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "GPS fleet management system is a fleet management system based on global positioning system technology, which aims to realize real-time monitoring, scheduling and management of fleets. The system can obtain information such as vehicle position and speed in real time through GPS equipment, realize real-time monitoring and management of the fleet, and can perform vehicle scheduling and route planning according to factors such as road conditions and vehicle status. GPS fleet management system can help enterprises achieve the following goals: 1. Improve the work efficiency of the fleet: By monitoring the location and status of vehicles in real time, managers can arrange the optimal route and dispatch vehicles according to the actual situation, avoid congestion and route conflicts, and improve the work efficiency of the fleet. 2. Reduce enterprise costs: Through real-time tracking and management of vehicles, it can effectively reduce vehicle maintenance costs, fuel consumption costs, and labor costs. 3. Improve customer efficiency: Through the GPS fleet management system, enterprises can understand the location and operation status of vehicles in real time, handle customer complaints and abnormal situations in a timely manner, and improve customer efficiency. In short, GPS fleet management system is an efficient and accurate fleet management tool that can help enterprises reduce costs, improve efficiency , and is an indispensable and important tool for modern enterprises.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/65c63ed1-43e5-48c4-a82d-b116c84ab446.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "GPS locators can be used for the elderly, children, logistics and cars. 1. For the elderly and children, GPS trackers can help guardians keep track of their location information and ensure their safety. Especially for the elderly with dementia and other diseases, the GPS tracker can remind family members or nursing staff in time. 2. For logistics, GPS locators can help companies track the status of cargo transportation in real time, improve logistics efficiency, and reduce logistics costs. 3. For cars, GPS trackers can realize remote monitoring of vehicles, including vehicle driving routes, historical tracks, vehicle status and other information, which is helpful for vehicle maintenance and safety management, and can also help car owners avoid vehicle theft or track vehicle location.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bc6a11a-d4ff-4473-a5c5-8e8e00e2dc29.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "4G GPS TRACKER HOW TO QUICKLY SETTING UP THE TRACKER? STEP 1. – Activate Sim Buy a local SIM card with 4G(LTE) network function and Install the new sim card into your mobile phone and activate the sim card and remove SIM card’s PIN code. Make sure it can make a call, send a text and has an internet connection. Once this is confirmed, insert SIM to your tracker. STEP 2. – Turn on the tracker Charge it about 6 hour first.The yellow and blue indicator lights will start flashing while it searches for a network and GPS. Please wait 5 minutes in a good reception area (by a window or outside) for both lights to come on constantly. It will continue to be Always on yellow if it can not find a network. Move it to another location. Please note, when the device has a GPS signal it will get a GPS location. If not it will get its location using LBS. STEP 3. - Setting APN for the tracker (1) You need to know your tracker’s SIM card's APN (You can ask your SIM card provider); (2) Please note the following operations need From another phone number send text messages command to the tracker’s sim card’s phone number to set tracker's APN. For example: APN is: mobilenet ,APN username is: -- ;APN password is: -- (1) If your SIM card’s APN without username and password, then send text command(APN123456+space+APN) to the tracker, it will reply “SET OK”. Text command is: APN123456 MOBILENET -- -- (2) If your APN with username and password: Then sned text Command(APN123456+Space+ APN+space+ APN user+Space+ APN pass) to the tracker : APN123456 MOBILENET Please note: Different SIM card has difference APN. Please apply the above formula according to your actual APN to set up your machine",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/969c1328-8af1-46e8-bd82-f8f7d04417a8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Fence alarm Set up a geofence for the tracker to restrict its movements within a district.the unit will give you an alarm when you enter or leave the district. You can set this geofence where you park your vehicle frequently, add the electronic fence and choose the radius you want. You can choose the radius of this area,100 m-500 m You can confirm that the center location of the geofence set is correct. After setting up the electronic fence, you clicked Save. Starker Magnet und einfache Installation Strong Magnetic makes it easy to install the device in anything metal. History Route Playback Using our tracking platform provides history reports mapping all past locations, speed, addresses with dates and times via Web / App anytime and anywhere. gps tracking platform updates every 30 seconds gives you a real-time view of what happened for anytime",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6bc83a6-4d9a-471c-8fae-5155b293193a.__CR11,0,978,978_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90b2e352-afef-45d5-9bfb-abe3ccb7dea1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4c0e0343-94fd-4783-a4dd-1aeffe06c8aa.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Powerful App You will love our App. It is simple and reliable. Our GPS Tracking App is super easy to use. It is straight forward and no nonsense. Customize your alerts and notifications Create Alerts, Geofences (when the tracker leaves or enters a pre-defined area) and Driving Reports all from within the App itself. Available for IPhone and Android Phones. Remotely voice Monitor If you are concerned about the safety of yourself or your family, it is recommended that you seek legal solutions. For example, install security equipment, buy a GPS TRACKER, strengthen personal protection, and so on. 30 days Battery Life The tracker battery life is expected to last up to 20days when reporting frequency is set to 5 minute. If the reporting frequency is lowered, the battery will not last as long. If the reporting frequency is raised, the battery life will last longer. The tracker will send you a low battery alert giving you plenty of time to retrieve the tracker and charge it back to 100%.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d24b7bbc-dc08-4e0f-a4c6-ad659d370383.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/53e5afb4-1ed7-4259-91f3-246bc3a45f69.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a0b9c60a-0d84-4bfd-bd63-5e5bbea64b5b.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "STEP 4. - Setting GPRS mode Send text command to the device to set GPRS mode: gprs123456 Then wait about 30sec, both blue and orange light should stay ON which mean you can now login to web or app to check if tracker active. (Username is your tracker’s ID number that write on the product, password: 123456) If you set ok of all, you can track it online. If it online but show China location, then take it to the outside which signal good place to get GPRS signal, when it get signal, will update your location. If the device is not online, please check device setting, send: check123456 to device, It will reply the setting you can check in reply: 1. The APN if is correct; 2. The IP and Port if is correct(IP and port are write in the usermanual,you can check if same as reply) 3. The device working model, (GPRS model)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/265c4cb8-f961-4461-8f75-6bddf8d029e9.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Strong magnetic installation free strong magnet The strong magnetic GPS tracker without installation has unique advantages and is more convenient to use and store. These products are usually equipped with a strong magnetic back clip, which can be attached to any metal corner in the car, no installation required, can be used and stored anytime, anywhere. This can not only bring users more convenience, but also effectively protect the car from damage. Therefore, highly magnetic, built-in free products are gaining popularity among consumers in the automotive market.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8f06d63b-3729-4524-9a5b-9f6460f96727.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/65c63ed1-43e5-48c4-a82d-b116c84ab446.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bc6a11a-d4ff-4473-a5c5-8e8e00e2dc29.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/969c1328-8af1-46e8-bd82-f8f7d04417a8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6bc83a6-4d9a-471c-8fae-5155b293193a.__CR11,0,978,978_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90b2e352-afef-45d5-9bfb-abe3ccb7dea1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4c0e0343-94fd-4783-a4dd-1aeffe06c8aa.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d24b7bbc-dc08-4e0f-a4c6-ad659d370383.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/53e5afb4-1ed7-4259-91f3-246bc3a45f69.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a0b9c60a-0d84-4bfd-bd63-5e5bbea64b5b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/265c4cb8-f961-4461-8f75-6bddf8d029e9.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8f06d63b-3729-4524-9a5b-9f6460f96727.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "jackson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKUER7MX7LYATUBIDD3TIGFDWLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G89434XA1CNE?ASIN=B09TB52BSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Useful and valuable",
                "reviewText": "I used the GPS tracker for locate my car in large parking lot. Very convenient and useful. I also put it in my kid's Jacket when on travel. The phone can track it alive",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Garth hamnerGarth hamner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2AIKXO6KR3XTDLD3IUPX222NNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28JN8H2VU2Y2F?ASIN=B09TB52BSG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "4.0 out of 5 stars It actually works",
                "reviewText": "Setup wasn't as difficult as other reviews would have you believe. I ended up with a spare SIM card from T-Mobile because the phone was free if I opened an additional line, so I wanted to make use of it. I give it 4 stars because it doesn't keep up live, but it accurately shows the final destination. Plus you can call the associated number and listen in, which would be a useful spying tool. Kinda creepy, but cool. Totally worth the money",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61dOFva6q8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "The best wig I ever purchased ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEN4WPYBDYMXLRTISY4UXBPAV73A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TJ9VML44QE90?ASIN=B09TB52BSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars I really like this item last long",
                "reviewText": "Like it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sincho",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIGQVTDNYAUBAFC3N3MTYNNIRMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IJX5G4HQYJ8U?ASIN=B09TB52BSG",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "1.0 out of 5 stars Works, bad software and crap app",
                "reviewText": "Easy to install big problems for find a SIM card. It will kill the battery if the car is not used for a while (8 days for me) it need battery power always or does not work and you can lose the car",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob A",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG326SX3L5KCDFLAC5I2MQQ2REEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38CK58MNILC5E?ASIN=B09TB52BSG",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "3.0 out of 5 stars Directions are awful",
                "reviewText": "Tracker works but getting to connect to phone sucks,have a tech trying solve problem",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lasnada",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4HMX5BPN4MBD4EMX45UEGYEOMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE4AXZ4KDHVFE?ASIN=B09TB52BSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2019",
                "reviewTitle": "5.0 out of 5 stars Just WOW! You get the basics and a little extra",
                "reviewText": "This is not a plug and play device. Intermediate electrical skills required. If you have such skill, and more time than money, this is the device to get. Took me an hour to connect power and mount unit. Spend another hour if you want to attach to shift lock solenoid. You have to figure out how to connect wires to your car on your own. I was able to find power with an ice pick test light. The manual suggests interfering with your oil pump to disable car. I recommend connecting the normally closed relay to shift lock solenoid. That way when Tracker sends shutoff command, the shift lock solenoid does not have power and car can not be put in to gear. Safest way to disable a car is when it's parked. You can do it their way and disable car when it stops at red light if you want. You won't be so happy to recover your car when another driver rear ends your remotely disabled car. The instruction manual is not detailed at all and tiny. The images are useless. You have to read and think. Study up on SMS, GPRS and GMS. I recommend US Mobile as a cheap carrier. On two of my cars all the wires I needed were behind the radio. I mounted the unit above the radio and attached to my center air vent. That way it gets less hot in summer by not being so close to top of dash and gets a little heat in the winter so it doesn't condensate and corrode. one last thought, you could also intercept the brake light switch. That would prevent car from shifting in to gear. You do risk a careless driver rear ending your car but gain a police officer noticing and arresting thief. Your call.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daine H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEDMGRBISC4CSEEU4JFQQFYX5MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PDOF9MU0LC9N?ASIN=B09TB52BSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Great product to buy",
                "reviewText": "This trackers is more upgraded from the others I use before it comes with an app you can review millage and location vehicle do for days you can see every stop it makes its a great product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DJ Eric",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM2EEEPSGSSOYK2NTUYHXJRMCIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJKQTD5QOCGWD?ASIN=B09TB52BSG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Works well....but.....",
                "reviewText": "I use this tracker on one of my vehicles.What I like is that it works and the app works well also.What I don't like is the fact that the user manual doesn't explain the various alarms so that I can know the ones to keep on. I keep getting alarm notifications and don't know what they are for.That is the reason I didn't give a higher rating",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "johan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on September 17, 2022",
                "reviewTitle": "pas op met deze verkoper",
                "reviewText": "product kwam defect bij mij aan nu doet de verkoper er alles aan om de schuld bij mij te leggendit is geen manier hoe je met klanten om gaatheel frustrerend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$30.99",
                "sellerName": "Yangtongjixies",
                "sellerRating": "5"
            }
        ]
    }
}