{
    "remaining_requests": 40162,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ATUVOS-Bluetooth-Waterproof-Replaceable-Protection/dp/B0C2ZL46QC",
    "body": {
        "name": "ATUVOS Key Finder, Bluetooth Tracker Works with Apple Find My (iOS only), IP67 Waterproof, Replaceable Battery,Privacy Protection, Lost Mode,Item Locator for Bags, and More 4 Pack Black",
        "price": "$49.99",
        "originalPrice": "",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ATUVOS-Bluetooth-Waterproof-Replaceable-Protection/dp/B0C2ZL46QC",
        "soldBy": {
            "sellerID": "A2FX9GQ0LVKBPE",
            "name": "FreshVoco",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2FX9GQ0LVKBPE&asin=B0C2ZL46QC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CGPNTLVG"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $8 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/317UHcgOThL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41E-eE-8mRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415uBqdgfvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413bZqQVgTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tIEPNc3qL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BVhA3CATL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YOYUNqqOL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the ATUVOS Store",
            "link": "https://www.amazon.com/stores/ATUVOS/page/DF0F6E92-EFCD-4E15-80B7-13331C77FAC5?ref_=ast_bln"
        },
        "brand": "ATUVOS",
        "merchantInfo": "FreshVoco",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 639,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 6 hrs 1 min",
            "FREE pickup Tuesday, February 20",
            "Or fastest pickup Tomorrow, February 14. Order within 12 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Find Nearby: Never lose your valuables again with ATUVOS Tag, the revolutionary device that allows you to easily track and locate your items using the Find My app. Whether it's your luggage, keys, backpack, or any other essential item, ATUVOS Tag ensures you never have to experience the stress of losing them.",
            "Left Behind Remind: if your tag ever disconnects from your Apple device's Bluetooth connection, you'll receive instant notifications. Whether you accidentally leave your bag at the gym or forget your keys at the office, our \"Left Behind Remind\" will be your prompt reminder to retrieve your items.",
            "Lost Mode: Our innovative NFC technology allows anyone who finds your lost tag to easily access your contact information by tapping their NFC-enabled device against it.(Please note that it is necessary for you to input your contact information into the device in advance.)",
            "Protecting Your Privacy: When using ATUVOS key tracker, only you have knowledge of your item's whereabouts. Our advanced technology guarantees that your location data is encrypted and inaccessible to anyone else, not even the manufacturer has access to this information.",
            "Instantly Locate: ATUVOS bluetooth tracker tag allows you to view the location in real-time. When the distance is less than 200 feet, you can use the \"Find My\" app to play a sound and locate the position. When the distance is greater than 200 feet, you can use the map navigation feature in the \"Find My\" app to find the location of your ATUVOS Tag.",
            "IP67 Water-resistant & Replaceable Battery: With its impressive P67 waterproof rating, this device is designed to withstand water splashes, rain, and even brief submersion. ATUVOS Tag comes with a replaceable battery that lasts an impressive year. You can rely on our device to keep safeguarding your belongings without the hassle of frequent battery changes.",
            "Cost-effective: What sets ATUVOS Tag apart from other tracking devices is its affordability. Unlike many alternatives on the market, ATUVOS Tag doesn't require any monthly fees or subscriptions. Once you purchase an ATUVOS Tag, it's yours to use indefinitely without any additional costs, saving you both time and money."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "Item Finders",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18022313011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "4.29 x 4.25 x 0.59 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.76 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0C2ZL46QC"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Metal batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 639 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,868 in Electronics (See Top 100 in Electronics) #43 in Item Finders"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Manufacturer",
                "value": "ATUVOS"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "April 19, 2023"
            },
            {
                "name": "Brand",
                "value": "ATUVOS"
            },
            {
                "name": "Are Batteries Included",
                "value": "Yes"
            },
            {
                "name": "Number of Batteries",
                "value": "1 Lithium Metal batteries required. (included)"
            },
            {
                "name": "Compatible Devices",
                "value": "apple find my"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "ATUVOS Bluetooth Tracker for important things",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2356c7cf-efd2-4934-b411-026704dc2191.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Previous page Use Find My app to ring ATUVOS Phone and Keys Tracker when it's within Bluetooth range. Use Find My app to view your ATUVOS Tag recent location when it's outside of Bluetooth range. With over 3000 tests, it is sweat, water and rain resistant. Next page 1 Find nearby 2 Find items further away 3 Privacy Protection 4 IP67 Water Resistant 5 Battery Replacement",
                "media_link": []
            },
            {
                "media_text": "Left-behind Reminder Please turn on forgotten notifications on Apple's Find My App. You will get notifications if your item is left behind. ( Without additional fees ) Learn More Built-in NFC function Please remember to add personal information on ATUVOS Keychain Tracker. When others pick up your tag tracking, they can obtain your personal information through NFC. Learn More Ringing loud up to 100 dB Atuvos Key Locator Key Finder is so loud, you'll hear it even when you're in another room. Learn More Replaceable & Long-lasting battery ATUVOS luggage tracker contains a replaceable battery, whose type is CR2032 coin cell.The coin battery lasts up to 1 year. Learn More",
                "media_link": []
            },
            {
                "media_text": "Is ATUVOS Luggage Tracker Tag certified by Apple? Yes, ATUVOS is certified and is perfectly compatible with the Find My app and network. What is the Apple Find My Network? It allows you to locate your ATUVOS through the Find My network, a network of hundreds of millions of Apple devices that detects a missing device or item nearby and reports its location. Through FIND MY, more than 500,000 items are found every day. Does ATUVOS Key Finder have GPS? ATUVOS doesn't have GPS. It reports its location through Apple's Find My network. Hundreds of millions of Apple devices around the world help you locate it. Can Android users use ATUVOS Wallet Tracker Tag? No, ATUVOS Tag only supports Apple devices. Is the battery removable? Yes, when the battery is low, ATUVOS tracking device will notify you to replace the battery which type is CR2032 coin cell.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2356c7cf-efd2-4934-b411-026704dc2191.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3f4b3fc-d40b-4838-8057-c8c9622c4753.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed984eec-6d31-4eba-93ee-2a80e043feae.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/50bbce86-7ea1-4741-82b2-334f3b6f9538.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6cf6b9a0-9693-45a9-a8ab-7f4a47118880.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/22473df4-b3ff-4fbc-ba04-d5770923c8f2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5e0fa5c1-b421-43b9-bab8-94dcdf134b88.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ced9047f-a1b6-4b95-914a-f445ca42d274.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6ed3a0b-2b87-43b8-8d2e-6213642928b0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6f389422-62f5-4346-8ce1-bb6bb2c7576b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb173cb2-3d0b-48dd-b51f-49580d5a812b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a753a64b-3058-40a0-82cc-2989d6544d27.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stephen D Pearl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2RKQ66LW6FEWVPQNVLECX35ZRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NGJH1SM22H7I?ASIN=B0C2ZL46QC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars A solid, reliable alternative to Apple AirTags.",
                "reviewText": "As a lot of other reviewers have noted, the Atuvos trackers are a strong alternative to Apple AirTags. I found this out first-hand during a recent trip to Europe. I hadn't flown since before the pandemic hit, and I had heard horror stories about the increase in lost luggage. So I bought two 4-packs of the Atuvos tags, as well as a $6 bulk pack of low-cost, \"S\" style carabiners and I added them to every piece of luggage, my wife's and my carryons, my wife's purse, even my AirPods Pro.Adding them to the \"FindMy\" app on my iPhone 14 Pro was a breeze. Simply turn on the tag - that's right, they have a handy power on/off, reset button on the device - and add it to FindMy. It pops right up.Then the fun began. I started testing the tags to see whether they really would let me track my bags just about everywhere. As soon as my wife and I arrived at long-term parking at the airport, I started obsessing about FindMy and watching my bags move around with is.At the terminal, I watched as checked luggage hopped from here to there around the airport until it finally showed up on the baggage trolley next to our first flight. When we reached cruising altitude, I took a walk back from our seats near the front of the plane and suddenly all our luggage popped up right beneath me!When we got to our transfer in Amsterdam, I watched as our bags hopped off the plane, meandered there way over to our next gate, and finally showed up in the belly of our next flight.That's the way it went throughout our trip. The Atuvos trackers worked perfectly. The range is long, the beep is loud, and it gave me the confidence that if a bag really had gone missing I would have found it, or at least found the last place it had been before someone turned off the tracker.And that's the pro/con of these devices. They won't just turn off on their own. The button takes a good firm press, so it won't simply turn off with a bounce or jostle. But unlike AirTags they *can* be turned off. If someone finds one attached to your bag, it's a simple button press to disable the tracker and make your bag go \"off the grid.\"But for what they are, they're a GREAT value. They're sturdy, the clip hole is something Apple should have incorporated into AirTags, and their range is super-long, a claimed 400'.Highly recommended!",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janet W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCXFAFBADSQEUK2RXTJCIKQOXYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DH95GU5KTE5U?ASIN=B0C2ZL46QC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Know where your important items are.",
                "reviewText": "If you don’t have to have the brand that starts with an “I”, you will love the cost and effectiveness of this product. I bought these for a cruise I was taking and wanted to be able to track my backpack and suitcases and also know that my truck back at home didn’t leave the driveway. I was easily able to pair and name these devices on my phone. I attached them to the zipper inside my suitcases, backpack and truck with the little keychain o-rings you can buy. Anytime you walk away from any of these items, your phone alerts you. You can pull up a map and see where your items are. Best, most practical purchase I’ve made in a while. When you’re not using them, I.e., my suitcases, take the batteries out and tape them to the outside. This way they last longer and you don’t get corrosion inside the device. I hope you are as happy with them as I am. Even though they aren’t the “I” ones, they paired easily with my IPhone.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PeeJay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXB7MKKZZUCDIVVNFCHDYZMWCIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VP2UIMYI79VY?ASIN=B0C2ZL46QC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Works perfect",
                "reviewText": "The 4 devices work as expected. Unfortunately I have had to change the batteries cause the chips were not working. It's a pity they are only for iOS.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Geoffrey Easom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGFYKQZ54TW6PN5CGDFTKTDKFEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RI4TN4MWUTJE?ASIN=B0C2ZL46QC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Outstandingly Great Device",
                "reviewText": "I travel through many airports around the world. This device is OUTSTANDING. The Bluetooth linkage with my iPhone is stellar. I place one device in each of my travel bags. I watch their location in the airport and as they approach the baggage carousel. In airports where porters pull baggage off the carousel, these tags assist locating my bags. This device is EASY to install. I use colored heart icons ❤️💙🖤🩶💚💛 to designate each bag. The “Find Me” app on my iPhone always shows their location, or their last known location when beyond Bluetooth range. I also gave a device to my wife for her key ring. Now, no more misplaced keys.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Snag",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4KXFLEY2OQNURQH7CNC3AHG3WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19FKNS24C8SW3?ASIN=B0C2ZL46QC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Love these things",
                "reviewText": "There are plenty of uses for theses little guys. Mainly bought it for traveling to see where my luggage’s were. Works well. I use them in keys and have one in my car at all times. I’ve had these for months and the batteries are still full bar. I do wish they can beep a little louder when trying to locate but other than that it works great. Excellent buy.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Slider",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAJJT53IC2AE6EAXJIO6YM6SBAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ABESPZUAYE7P?ASIN=B0C2ZL46QC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy install and works fine",
                "reviewText": "Misplaced keys have been a long standing problem in my home so we thought we would try a 21st century solution. The product arrived well packaged and intact. Having four of these trackers was just the right number for us. The setup was fairly simple and went according to instructions. The Find My App on the iPhones picked up the devices immediately and allowed us to give each a name. Tracking was great! Open the app, click the tracker name and there it is on the map. Even if it is in the house it's good to know that the keys are there and not out in the world. You can activate the beeper to find a nearby tracker.I'm sure that there are many other tracking uses aside from keys for these cool little devices. In the meantime those long extended key searches have ended.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWG74PTHTR6HCLHWHZ2WZGWR4JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PDX9YFWOXJP3?ASIN=B0C2ZL46QC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 28, 2023",
                "reviewTitle": "5.0 out of 5 stars A less expensive alternative",
                "reviewText": "Found these as a less expensive option which would work on Apple devices. The items arrived when expected. The instructions were clearly written. However I did a Google search and read through/watched for additional tips for adding a non-Apple product. My I-Phone did not recognize these trackers on the first attempt. Started over and then it connected. Successfully named and added the first tracker. Had a similar issue when I attempted to add the second tracking device the next day. Third tracking device loaded without a problem. I added my tracking device to my keys and placed them inside a far corner of my home to test the find function. Beeping worked and could be heard inside the house. My phone showed a general outline of my house footprint and reflected the tracking device was in the corner. When I asked for directections on my phone I received a message the item was with me. I was still about 25 feet from the tracking device. Not sure if the lack of more precise directions is due to the age of my phone or maybe my expectations were too high. Having said that, my spouse found the keys based on the beeping as they were hidden from view. I'm satisfied with the product for my intended use.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Don & Jaime",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 19, 2024",
                "reviewTitle": "Perfect",
                "reviewText": "Got these for my mom to use on her cruise. To put in her luggage, and carry on bag. They were easy to set up and a great value for the cost. So far they are working good.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nilo ManaloNilo Manalo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 31, 2023",
                "reviewTitle": "A cheaper but good alternative to airtag",
                "reviewText": "Likes:Price - almost half the price of airtagFunction - works the same way as AirTag. No need to install app. Integrates well with Find My AppleQuality - build is made of plastic but it feels solid.Dislikes:A bit thicker than AirTag.Not a lot of cases available to make it waterproof or discreet when you want it to put it in your bike.Buy a key ring if you don’t have one yet.Precise location is not available in Find My AppleI really love that this device works with Find My Apple. The functionality is the same with AirTag so highly recommended if you’re looking for an affordable alternative to AirTag.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61F1H0maYqL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61iNoIf5LzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pedro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 15, 2023",
                "reviewTitle": "Remplace aisément le produit apple",
                "reviewText": "Acheté pour remplacer un produit Apple du même genre. Il le remplace totalement est détecté par le smarphone. Le son d alerte est bien plus audible et garde les mêmes fonctions. Je recommande",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Prairieboy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 19, 2024",
                "reviewTitle": "ATUVOS Smart tag trackers for musch less than Airtags",
                "reviewText": "For anyone not expecting the fine tracking (which requires Apple's ultrawide band technology), these are great and, priced way nicer!Works well for locating where the tags are located (general vicinity) and uses sound to locate to a precise location.Very happy with these!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheryl Hazenberg",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 5, 2024",
                "reviewTitle": "Work very well",
                "reviewText": "They are absolutely amazing, easy to set up and track",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}