{
    "remaining_requests": 40011,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Detection-Recovery-Subscription-Anti-Theft-belongings/dp/B0BRNRNG87",
    "body": {
        "name": "Instant Motion Detector with GPS Tracking with Lock Loops | 1-Month Free Subscription | Instant Anti-Theft Alerts | Works 24/7 | If It Moves - You Will Know | Long Battery Life",
        "price": "$24.99",
        "originalPrice": "$34.99",
        "rawPrice": 24.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Detection-Recovery-Subscription-Anti-Theft-belongings/dp/B0BRNRNG87",
        "soldBy": {
            "sellerID": "AZCC9YF9Z5C01",
            "name": "Gun Alert",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AZCC9YF9Z5C01&asin=B0BRNRNG87&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41DPk07e2bL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41YB1X9ZEnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BLT7fRPHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41D6bLu2wnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517A9UK-v6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31bTjVej4qL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the IF IT MOVES... Store",
            "link": "https://www.amazon.com/stores/IFITMOVES/page/F437505D-C748-4A67-95A8-B47A0CA69C34?ref_=ast_bln"
        },
        "brand": "IFITMOVES",
        "merchantInfo": "Gun Alert",
        "customerReview": "5.0 out of 5 stars",
        "customerReviewCount": 1,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 19 hrs 26 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 19 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "PROTECT AND MONITOR YOUR VALUABLES 24/7: IF IT MOVES COMBINES GPS WITH MOTION DETECTION. Unlike a simple GPS tracker this device will give you a motion detection alert to your phone. Not only can you track where it is, you’ll know if it even moves an inch, notifying you before your belongings are gone.",
            "ULTRA-SENSITIVE MOTION DETECTION WITH GPS TRACKING THAT YOU CAN LOCK TO YOUR VALUABLES: IF IT MOVES offers two secure metal loops that you can lock to your belongings. When unauthorized movement is detected, the device alerts you with push notifications to your smart phone and can email you whenever unwanted movement is detected.",
            "REAL TIME MONITORING WITH YOUR MOBILE DEVICE: Tracking device for almost anything. In case your belongings are moved without your permission, alerts immediately. Thus, the ideal anti theft device that monitors in real time.",
            "SECURE SYSTEM: YOUR DATA IS STORED ONLY ON YOUR PHONE, NOT IN THE CLOUD. The If It Moves device uses a VPN to transfer data to your phone alerting you of the movement of your valuables like, cars, motorcycles, camera bags, bicycles, RV, ATV, guns, equipment, etc.",
            "LONG BATTERY LIFE | 10-14 DAYS STANDBY TIME with low battery alerts sent to your device. If It Moves motion detection device is smaller than a deck of cards and is EASY TO USE RECHARABLE MOTION DETECTION AND GPS TRACKER.",
            "Flexible subscription: INITIAL 1-MONTH SUBSCRIPTION IS FREE. After the first month different renewal subscription levels are available to fit your needs. Don't pay for services you don't require. Why pay more than $20 per month? OUR PLANS START AT JUST $11.66 PER MONTH WITH A 1-YEAR PREPAY. NO CONTRACTS REQUIRED. COMPATIBLITY: Requires iOS 15 or higher for iPhone users and Android 11 or higher for Android users. Subscription Requirement: Monitoring service necessitates a subscription"
        ],
        "description": "REAL TIME MONITORING WITH YOUR MOBILE DEVICE EASY TO USE DEVICE with instant movement alerts Tracking device for almost anything. In case your belongings are moved without your permission, alerts immediately. Thus, the ideal anti theft device that monitors in real time. SECURE VPN PRIVACY: If it moves data is only stored on your device With IF IT MOVES, you are in control of your data. Nothing is stored on the cloud or on our servers. The device uses a VPN to tunnel the data from the monitoring device to your phone or smart device.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "6.22 x 3.94 x 1.65 inches"
            },
            {
                "name": "Item Weight",
                "value": "9.9 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0BRNRNG87"
            },
            {
                "name": "Customer Reviews",
                "value": "5.0 5.0 out of 5 stars 1 rating 5.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#226,056 in Electronics (See Top 100 in Electronics) #557 in GPS Trackers"
            },
            {
                "name": "Connectivity technologies",
                "value": "Cellular"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Whats in the box",
                "value": "Charging cable, Quick start guide, Monitoring device, Six months unlimited subscription"
            },
            {
                "name": "Manufacturer",
                "value": "Quecklink"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "February 7, 2023"
            },
            {
                "name": "Brand",
                "value": "IF IT MOVES..."
            },
            {
                "name": "Connectivity Technology",
                "value": "Cellular"
            },
            {
                "name": "Supported Application",
                "value": "GPS"
            },
            {
                "name": "Specific Uses For Product",
                "value": "GPS Tracking Device, Luggage, Vehicles, Bikes, Equipment"
            },
            {
                "name": "Included Components",
                "value": "Charging cable, Quick start guide, Monitoring device, Six months unlimited subscription"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "PROTECT AND MONITOR 24/7 With Two Metal Locking Loops The If It Moves device combines GPS monitoring and motion detection technologies to assist you protect your belongings. If your belongings move in the slightest way you will receive an alert to your smart device. Get an alert before your belongings leave without your knowledge instantly.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45952f67-4f90-4130-9fe1-f09d01b1e7ea.__CR0,0,970,300_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "REAL TIME MONITORING WITH YOUR MOBILE DEVICE EASY TO USE DEVICE with instant movement alerts Tracking device for almost anything. In case your belongings are moved without your permission, alerts immediately. Thus, the ideal anti theft device that monitors in real time. SECURE VPN PRIVACY: If it moves data is only stored on your device With IF IT MOVES, you are in control of your data. Nothing is stored on the cloud or on our servers. The device uses a VPN to tunnel the data from the monitoring device to your phone or smart device. Flexible subscription plans | Low monthly cost plans after included first month INITIAL 1-MONTH SUBSCRIPTION IS INCLUDED OUR SERVICE PLANS ARE YOUR CHOICE OF MONTLY, 6 MONTHS, AND YEARLY NO CONTRACTS REQUIRED. LONG-LIFE RECHARGABLE BATTERY. 10 to 14 day standby time with low battery alerts sent to your device Compatibility: Requires iOS 15 or higher for iPhone users and Android 11 or higher for Android users Subscription Requirement: Monitoring service necessitates a subscription",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9d29618f-1c9a-41ca-b8f2-863fd47374d4.__CR0,0,1080,1080_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Affordable and no contract required for subscription plans. Cancel or Restart at any time. Get instant movement notifications. If It Moves you will know. This lockable GPS Tracker will notify you the instant an item is moved so you can stop a theft before it happens. Low month service starting after the first month.Discounted 6 month service plan of $79.99.Discounted 1 year service plan of $139.99.No contracts required.You not only will be able to track your belongings but you will get a notification if the move, instantly.Track your items from your smart phone with our app. Compatibility: Requires iOS 15 or higher for iPhone users and Android 11 or higher for Android users.Subscription Requirement: Monitoring service necessitates a subscription",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b28c834-b844-45c7-8fff-d92e46fb0ede.__CR67,0,1746,1080_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "ULTRA-SENSITIVE MOTION DETECTION WITH GPS TRACKING This Security device uses motion detection to sense the unauthorized movement and alerts you with push notifications to your smart phone and emails whenever unwanted movement is detected. Lock device to your belongings.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fc8619d0-d62b-451d-8231-d012c825c363.__CR0,0,970,300_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b0fe6a7-0d96-4e7e-b4b1-e0238402de46.__CR0,48,1110,333_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45952f67-4f90-4130-9fe1-f09d01b1e7ea.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9d29618f-1c9a-41ca-b8f2-863fd47374d4.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b28c834-b844-45c7-8fff-d92e46fb0ede.__CR67,0,1746,1080_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fc8619d0-d62b-451d-8231-d012c825c363.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "klarueklarue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTS6QKS5I26UETFNYEO2PI5C6BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR2SI38IZN5VN?ASIN=B0BRNRNG87",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Beefy Theft Deterrent + Superior Tracking GPS Device with low monthly cost",
                "reviewText": "As a photographer, traveler and motorcyclist, I'm always concerned about someone ripping me off! Which led me to look into GPS tracking devices. I looked at the Airtags and some others, but specifically wanted a unit that utilized cellular communications (instead of relying on a walled-garden like Apple's \"Find My\").The \"If It Moves...\" product fits the bill nicely. Although you do need to fully charge it out of the box, it comes with a pre-installed SIM card, an easy-to-use mobile app for iOS and Android (I use an iPhone), and a decent quick-start guide. Once the app is linked to the device and you've clicked one button to put it in Secure mode, you get notifications if it moves, and can see the device on a live map.Physically, this thing is a beast - and that's a good thing! The integrated metal loops let me easily lock it to things I care about. It's small enough to hide, but I think it also doubles as a Theft Deterrent. The blinking lights send the message that it's ACTIVELY in protection mode.I've had it for less than a week, but am pretty pleased with the purchase and the six-month free subscription is a nice bonus - the other ones I was looking at were like 20 bucks a month! This unit cost more upfront, but I’ll be saving money by the time the free subscription ends. Recommended.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71v-Gkf1XzL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}