{
    "remaining_requests": 40219,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Linxup-Monitoring-Real-Time-Businesses-Professionals/dp/B006TZGJDC",
    "body": {
        "name": "Linxup Fleet GPS Tracker and Monitoring System: Real-Time Location Company Vehicle Tracking, Monitoring, and Alerts for Professional Vehicles and Fleets",
        "price": "$29.99",
        "originalPrice": "",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Linxup-Monitoring-Real-Time-Businesses-Professionals/dp/B006TZGJDC",
        "soldBy": {
            "sellerID": "A1M6CGSN3EXJ29",
            "name": "Linxup",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1M6CGSN3EXJ29&asin=B006TZGJDC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41XAFJGt6GL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51t5N8992UL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51PkqqG0QPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wTBAzJ0DL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LtuiPEDBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cVefQfdhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61xfIXL4vWL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/b1cc0547-84b5-54d2-a3a1-9f496bf5b093/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/cc5be2d5-5897-54c5-9da9-234769e1a2dc/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91rWJtvCriL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91rWJtvCriL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Linxup Store",
            "link": "https://www.amazon.com/stores/Linxup+GPS+Tracking/page/5F90A4BC-B396-4603-99AE-ACCE142F4C4F?ref_=ast_bln"
        },
        "brand": "Linxup GPS Tracking",
        "merchantInfo": "Linxup",
        "customerReview": "3.5 out of 5 stars",
        "customerReviewCount": 743,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 12 hrs 54 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The Linxup GPS Fleet Tracker & Monitoring Solution is a real-time location fleet vehicle tracking device that allows for easy monitoring of company vehicles and fleets.",
            "Schedulers and fleet managers can view location and performance metrics from anywhere in the world and receive updates in real-time through their phone, tablet or computer.",
            "The Linxup fleet location tracker for vehicles utilizes leading GPS technology, which provides long battery life and optimal accuracy with reporting options to monitor vehicles day or night.",
            "Linxup’s software monitors and displays location, speed, tampering, which help optimize routes to make vehicle and fleet management cost-efficient and goods transportation safer.",
            "Company truck tracker system allows users to easily manage vehicles and fleets for $25 a month per device without contracts; Limited lifetime warranty on GPS tracking device."
        ],
        "description": "Same Linxup Features - On your Phone From real-time safety alerts and detailed data capturing by vehicles and assets, you can get all of the critical information you need about you driver and fleet performance in an instant. Help your fleet's vehicles stay in top shape by tracking scheduled maintenance. With Geofencing capabilities, know when a vehicle or asset has left an authorized area, such as a jobsite. Improve fleet performance by quickly locating your vehicles with GPS technology. Deliver better service by responding to customers faster and optimizing driver’s routes. Monitor unsafe behaviors to increase driver safety and reduce liability risk. Monitor alerts, maintenance to reduce fuel usage and idling times. Available only in the United States.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2 x 1.8 x 1 inches"
            },
            {
                "name": "Item Weight",
                "value": "2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B006TZGJDC"
            },
            {
                "name": "Item model number",
                "value": "LPVAS1"
            },
            {
                "name": "Customer Reviews",
                "value": "3.5 3.5 out of 5 stars 743 ratings 3.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#30,550 in Electronics (See Top 100 in Electronics) #98 in GPS Trackers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "OS",
                "value": "Android and iOS"
            },
            {
                "name": "Connectivity technologies",
                "value": "Wireless"
            },
            {
                "name": "Special features",
                "value": "US, Canada, and Mexico tracking only"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "OBD Install"
            },
            {
                "name": "Whats in the box",
                "value": "Linxup OBD GPS Tracker with installation and activation instructions for 4G cellular data"
            },
            {
                "name": "Manufacturer",
                "value": "Linxup"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Date First Available",
                "value": "January 5, 2012"
            },
            {
                "name": "Brand",
                "value": "Linxup"
            },
            {
                "name": "Special Feature",
                "value": "US, Canada, and Mexico tracking only"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Supported Application",
                "value": "Alarm"
            },
            {
                "name": "Included Components",
                "value": "Linxup OBD GPS Tracker with installation and activation instructions for 4G cellular data"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Free Mobile APP Linxup's free mobile app gives real-time updates on where your car is at all times. Get alerts straight to your mobile device. The mobile app is free on both the iOS and Android platform. Same Linxup Features - On your Phone From real-time safety alerts and detailed data capturing by vehicles and assets, you can get all of the critical information you need about you driver and fleet performance in an instant. Help your fleet's vehicles stay in top shape by tracking scheduled maintenance. With Geofencing capabilities, know when a vehicle or asset has left an authorized area, such as a jobsite. Improve fleet performance by quickly locating your vehicles with GPS technology. Deliver better service by responding to customers faster and optimizing driver’s routes. Monitor unsafe behaviors to increase driver safety and reduce liability risk. Monitor alerts, maintenance to reduce fuel usage and idling times. Available only in the United States.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4bb4c787-d3b2-41b2-b5c0-28c465b8d2e4.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/60d34df9-9a5e-4577-b1da-d17502d2ae49.__CR12,0,1138,569_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Landscaping Whether for residential, commercial, golf courses, or lawn & landscaping sectors, Linxup has solutions that help your company save on fuel, labor, and maintenance costs. Track your vehicles, trailers, and equipment. Edge out your competition. Know quickly where your crews have been and where they are in real time. Know what work has been done at each location and how long they’ve spent on site. Plus, with our landscaping crew tracking software and alerts, all this information is at your fingertips for job planning, cost reduction, and proof of service to customers. That's more than tracking and visibility. That's information that improves your bottom line. Farming & Agriculture For Industrial sized commercial farming down to the small family owned farm, farming equipment is crucial to getting the job done. Asset tracking and utilization is a game changer. Track combines, spreaders, sprayers, tractors, bailers, irrigation units, and more - even if those assets are in remote areas of your farm. Tracking maintenance schedules, to ensure assets are always operational, help your farm's uptime at critical times. Monitor equipment operation hours and idle times. Protect your farm assets whether in use or not, with geofencing, by monitoring and being alerted to when an asset leaves an authorized area. Track your agricultural goods deliveries too. Monitor your trucking fleet with the same safety, maintenance schedule alerts and efficiency in mind. Pest Control Services It's not just pests that hide. With employees in the field all day, it used to be tough for pest control companies to identify hidden expenses such as unnecessary fuel costs and employees running errands on company time. Now, Linxup makes it simple. Our GPS Tracking Solutions provide real-time insights into vehicle idle time, driver behavior, routes, stops, and the amount of time at a job. Waste Management Industry From dumpsters and trucks to other larger assets, Linxup is the vital tool your fleet needs for better all around service. Improve your fleet performance, productivity, and driver safety. Monitor your drivers routes in the field with our interactive Google Maps interface and animated route replay feature that keep your fleet managers informed about driver behavior in real time. Track every asset your company deems critical to your profitability. Know where it is at all times and with our geofencing capabilities - know if the asset has left an authorized area.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9138c3a-bae4-4797-a201-9e9e4634920b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bba514e-798e-4cde-9547-b761add1392a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9573c503-5eb1-4aa9-84bc-d0fd617051ba.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/63088424-e7d5-463b-ac3c-571979471e76.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fab61a7a-f7da-4de3-bc1a-c26cc44247d5.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0d4694c-835f-4bfb-916f-c5123f152bba.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4bb4c787-d3b2-41b2-b5c0-28c465b8d2e4.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/60d34df9-9a5e-4577-b1da-d17502d2ae49.__CR12,0,1138,569_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e98bdfa3-d46c-464d-8efe-8cc73e53a709.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9138c3a-bae4-4797-a201-9e9e4634920b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bba514e-798e-4cde-9547-b761add1392a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9573c503-5eb1-4aa9-84bc-d0fd617051ba.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/63088424-e7d5-463b-ac3c-571979471e76.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Astonishing",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVCXWPP34YW3VWG6JR7WU42NKRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CU5RUPJRHNLX?ASIN=B006TZGJDC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2014",
                "reviewTitle": "5.0 out of 5 stars Peace of Mind!",
                "reviewText": "I use this device to keep track of my aging father. His driving skills are still good, but he gets lost sometimes and can't figure out how to find his way home on a map, so I use this device to make sure my dad is not travelling away from his usual routes and to help him get back on track if he gets lost. When dad gets lost, I give him some time to get back on track, but if doesn't get back on track after a while, I call his cell and get him back on track (if he doesn't call me first).I've been using this device for a couple of months and so far it works as advertised. This device has tracked accurately in rural and suburban areas between Houston and Austin and within both those large cities. Tracking is slightly delayed or slightly inaccurate alongside or under elevated freeways, in parking garages, etc. Otherwise, location accuracy is very good--usually within twenty feet and always close enough for the purpose. (When dad goes to WalMart, I can tell he's parked in the handicapped spaces close to the front doors.) Email and text alerts have arrived instantly in real time, except for one brief period when they were delayed by about twenty minutes. On that one occasion, which lasted only for about half an hour, although the text and emails alerts were delayed, the online data was still up to the minute.The iPhone app is adequate, but doesn't display as much data as the online page. The calendar date on the app does not update automatically. Instead, to display up-to-date data of routes traveled, you have to be sure to manually change the date on the iPhone app every day or the display of routes traveled will show you old data. However, even if you forget to update the date manually, text and email alerts still get sent out in real time.This device updates once a minute when the vehicle engine is running, and every hour when the vehicle engine is not running. Linxup does NOT alert you immediately if the device has been removed, but if an hour or two goes by without a data update, you could probably assume the device has been removed or is not working. Also, if twelve hours go by without an update, Linxup will send you an alert. The device cannot work if it's not plugged in because it has no internal power source. However, it does not drain the car battery significantly because when the engine is stopped, alerts are reduced to once an hour.Both the web page display and the iPhone app are \"static\" in the sense that they do not show \"actually live movement\" but only the vehicle's past location at a series of one minute intervals when the car is moving. To display the most recent location data from the most recent update, you have to click the update button. Although \"actual live movement\" would be nice, clicking the update button to receive the most recent location data is perfectly adequate way to track up to the minute movement.If you are reasonably tech savvy, it's easy to set up \"fences\" and alerts on the user friendly Linxup web page. The web page also has instructional step by step videos to show you how to set up fences and alerts. I created a lot of fences of various shapes and sizes to track my dad's progress on his usual routes (i.e., frequent trips to WalMart, trips to church on Sunday, trips to Wendy's for a baked potato, trips to my sister's house, etc.). I get a text alert when he leaves his house, and at various points along his usual routes where I have created \"fences,\" so I can tell where he's going and whether he's strayed off track.One little trick I use: Some people have noted that the device does not automatically send an alert when the vehicle's engine starts. Well, I figured out a way to get around that. There is a setting that allows you to set specific hours when the vehicle is \"authorized\" to be used. For example, an employer might set the \"authorized\" use time as 7:30 am to 6:30 pm for a delivery truck, Then the employer would set up an email or text alert to be sent if the vehicle's engine is started during an \"unauthorized\" period. So I set the \"authorized\" use for my dad's car as 3:00 a.m. to 4:00 am on Tuesday morning. The effect of this is that whenever my dad starts his car (unless it's between 3 am and 4 am on Tuesday), I get an alert for an \"unauthorized\" use.Another little trick I use: I set up a separate email account to receive Linxup alerts and then set my iPhone to give that email account a special tone. I do not use that email account for anything else. So now, whenever I hear that special email tone, I know without even looking at my phone that \"dad is on the move.\" A quick glance at my phone tells me which \"fence\" dad has crossed and that gives me a good idea of where he's heading. I set up fences around my dad's usual destinations, which alert me when dad arrives at this usual haunts and when he leaves them to go home.You must designate the alerts you want to receive and who should receive them. It's easy to do. You can set alerts to go to multiple different email or text accounts. You can authorize multiple persons to have access to track a device, and you can authorize more than one person to have the ability (administrative rights) to change alerts and fence settings. Setting up alerts and creating fences is quite easy. My sister and I both have access to the Linxup account for my dad. We both are able to create fences and designate the alerts we want to receive. I'm more nervous about my dad's adventures, so I have set things up to alert me every time he moves. My sister is less nervous, so she has set things up to receive alerts only if my dad goes waaaay off track. There's no extra charge for allowing multiple people to monitor the account, and you can monitor multiple devices on one account; however, there is a separate monthly charge for each device.This is a wonderful device. The monthly charge is well worth the peace of mind.",
                "reviewVotes": "72 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kaiju35",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEVLD6JOLYE6ZJVMLE7AQSZ6XGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YPRP5LNCBTJV?ASIN=B006TZGJDC",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2014",
                "reviewTitle": "1.0 out of 5 stars Easy To Install But Does Not Work As It Should",
                "reviewText": "Pros:Quick and easy to install simply plug it into the obd-ii port.Cons:Where to even start. I installed this on a 2013 Kia Soul. The first issue was when I went to activate it. The online registration kept telling me I already had a account when I knew i did not and it would not go to the end of the registration. I just decided to check my email and low and behold it said i was registered and I could log in to add the devise.Registering the devise was quick and easy. Next off first test run!!Drove from in town to my warehouse. Came inside and logged on the the webmin using my pc and it showed the address perfect. I was pretty excited to say the least. Then i drove to the house and went in and again checked the webmin using my pc, again perfect address. The first \"downer\" was it does not show a actual path that was driven but it was a straight line like i went threw peoples houses and fields to get to my house. Was a bit of a let down but it could live with it. Loaded the app on my android and it only showed a google maps view of the cars location and noting else. There are no other features on the app. That to me makes it useless if it will not even tell you a address the car is at.The next day i log back into the webmin and look at the generated history reports. Every location that i stopped at had a 100% inaccurate address. This was a final blow for me as what is the point of the gps if it cannot log the proper stops a vehicle makes. Kind of defeats the purpurse.Logged into live chat to ask abot the issues, was told they only offer support threw phone not threw live chat. Guess live chat is only their to sell you something. No problem, I bought this from Amazon i will just return it and get a different model as i have already had too many issues to even deal with this thing any more. Get back in with live chat and ask how i cancel my plan so it does not auto bill be on the 1st and yep you guessed it, you have to call support. You cannot make any modifications to your billing on line, you have to call.Called in and got support. My first phone call was a total of 28 minutes. I spoke with support and was told that Linxup was haing \"server issues\" which was causing the issues with the incorrect address being placed in the reports and that I should give it a bit more time to try it. I took that hard sale and said sure, i had 2 more days before the auto rebill to call back and cancel. While i had them on the phone I asked about the phone app and was told that it should show a address and they asked me what phone. I advised them it was a android. She put me on hold and came back and said she was mistaken that it would only show a google map image of where the vehicle is not a actual address. I was like um ok no biggie my wife has a Iphone, she then assured me it would work on Iphone with no issues. Phone call one is done.About 30 minutes later i get a email saying that they have set me up with a RMA and the reason was I ordered the wrong devise. I did not order the wrong one nor request the RMA. So I replied threw email that they sent that to the incorrect person. A bit later I logged back into my webmin and my entire account was bare and it did not show any devises. I was like wth. Phone call #2 which took about 15 minutes total. Informed the support staff what happened and was put on hold. Came back shortly and everything was back tonormal again.Fast forward to lunch i meet with my wife and load the app on her Iphone. It is the exact same as on the android it does not show a single address only a google maps image of where the vehicle is with no other data. Basically the app is useless. If you are buying it for that save yourself some time and get something else. Now the killer blow the unit has not updated in the last 6 hours. Car has been all over and it does not show to have even moved a inch. So much for \"real time\". Not sure when this thing will actually update but it will be out of my car tonight and back to Amazon tomorrow. Total waste of time and energy. Makes me wonder how a product as bad as this gets so many \"5 star\" ratings. Inquiring minds want to know!",
                "reviewVotes": "70 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Don",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV2JN7NGCL2MAOMVEURIQEB4M5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GT2WANQODQOI?ASIN=B006TZGJDC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Works well",
                "reviewText": "Great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ken Morgan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEL37M7LGWXWS5ZCNO5NDF7DVLMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PNWSKAA9BQ2Q?ASIN=B006TZGJDC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2017",
                "reviewTitle": "3.0 out of 5 stars Poor customer service / technical support",
                "reviewText": "Product update, all units came online within 24 hours, tech support returned my call the following day and was very helpful. Product works as described. Purchased five GPS Units, four plug in & one hardwired. The only good thing so far is that they arrived promptly, after that it has been all down hill. I attempted to register 1st device online, was prompted to agree to terms & conditions when I attempted to select and read terms & conditions, \"404 page not found\" kept popping up. When I called in to tech. Support, because they could not help me online, I spoke with a young lady that seemed annoyed with my call, after some time the first device was supposed to be registered, monthly fee was taken from my account imediately. I have yet to get the device to come online, tried 2nd device with same results. I have made several attempts to reach tech. Support with no success. If I do not get results soon I will be returning all units.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mathieu Menard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 20, 2019",
                "reviewTitle": "Could not evaluate the product",
                "reviewText": "Not Canadian compatible. Did not read the fine prints",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Vizuet",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 25, 2017",
                "reviewTitle": "La caja dice que solo Funciona en Estados Unidos",
                "reviewText": "Cuando compre este producto lo hice porque en la descripcion dice – Sin contratos, OBDY resulta que tengo que pagar por un servicio y ademas la caja dice que solo funciona en los Estados Unidos y el proveedor no me contesta",
                "reviewVotes": "86 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2022",
                "reviewTitle": "Not worth the money",
                "reviewText": "Not worth the money",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monique l.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2020",
                "reviewTitle": "Waste of money again",
                "reviewText": "Im seding this back too still in box...no hood for me",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Craig",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 14, 2019",
                "reviewTitle": "Doesn't work",
                "reviewText": "Does not work in Canada.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}