{
    "remaining_requests": 40270,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tracki-Magnetic-Required-Worldwide-Motorcycles/dp/B07N4DHFZM",
    "body": {
        "name": "Tracki GPS Tracker for Vehicles, Car, Kids, Assets. Subscription Needed 4G LTE GPS Tracking Device. Unlimited Distance, US & Worldwide. Small Portable Real time Mini Magnetic",
        "price": "$9.88",
        "originalPrice": "$18.88",
        "rawPrice": 9.88,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tracki-Magnetic-Required-Worldwide-Motorcycles/dp/B07N4DHFZM",
        "soldBy": {
            "sellerID": "A1GH8M6E4YE1R9",
            "name": "Tracki",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1GH8M6E4YE1R9&asin=B07N4DHFZM&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41mui0Jc8fL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Rx07JzXIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51YpuH0VNIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/516BB4L94tL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517utDo2W6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513eXNBx pL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71Y4Fs-WErL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9d5f127b-4d62-4beb-a8d1-6630f0499b9f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0b137c8d-2710-4066-8561-5ce5f73695d9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63d2694e-d22f-4228-bf64-bc035595bc76/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/338ccbc7-4060-4bbe-bfb9-52a24b176808/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5b909ae-2d1c-40d4-8ffa-658634c54e71/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b10c1023-f6ae-456e-a7d1-a292843a7038/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/601a94fa-b564-4607-b6d7-b4c9b38d5dab/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b0de2950-aedf-42e5-9a0d-67c4fe347319/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2f6f4aa7-3fbd-40bc-a186-db09083a9125/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 9,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Tracki Store",
            "link": "https://www.amazon.com/stores/Tracki/page/D51F75BA-667B-4B4D-85E8-281CF2DDE435?ref_=ast_bln"
        },
        "brand": "Tracki",
        "merchantInfo": "Tracki",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 44372,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 11 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Subscription required for each device. #1 Best Selling for 3 years. Unlimited distance real time tracking 4G LTE +3 Bands. Full USA & worldwide coverage. International SIM card included. USA based company focused in GPS tracking. Our competition are just white label resellers. Our clients to name a few, are cellular Giant Vodafone & UPS. Track Vehicles, Cars, trucks, Children, ATV, assets. For each device a monthly fee of 19.95USD is required or as low as 9.95USD for long term plan",
            "Smallest & lightest 1.8x1.6x 0.7in & only 1.26 oz. Combined 4G+3G+2G technology, best coverage as opposed to trackers with only 4G connection. In USA requires AT&T or T-Mobile coverage. Includes: Strong Magnet, Waterproof Silicone Cover, Belt Clip, Key Ring & Lanyard Use as gps tracker for trailers, luggage GPS tracker, key tracker, car tracker devices. The tracker features up to 5-years location history We believe the customer is king and offer live customer support 24/7 phone and chat.",
            "Rechargeable battery lasts up to 2-5 days (depending on tracking mode) with real time tracking updates at 1-5min intervals and up to 60 days with 1-3 tracking updates p/day (battery saver mode). Optional 3,500mAh battery+magnetic waterproof box available providing x6 longer battery life: 3-4 weeks at 1min update and up to 10 months in battery saver mode (Search item B07YVNV82V). Use as GPS tracker for luggage, GPS tracker for kids, asset GPS tracker, vehicle tracker.",
            "Tracking technology uses GPS primarily and Wi-Fi & GSM as a secondary backup. Tracki scans for nearby WiFi routers for accurate location when GPS is unavailable. View live tracking on the map, set real-time alerts when device crosses a geo-fence zone you preset when used as gps tracking device for car, tracking device for children or valuables. Receive SOS, low-battery, speed & movement alerts via push notification, SMS or email. Use as a cars tracker, GPS tracker for vehicles, kids GPS tracker",
            "Our lifetime warranty covers lost or damaged devices. Tracki is cutting-edge, easy to set up and works right out-of-the-box within minutes without meddling with car & vehicle electronics. Use as a tracking device for cars, boat GPS tracker, bike tracker and more. Tracki's highly-rated dedicated mobile and web app is compatible with: Android, iOS and all web browsers (IOS 13 and up, Android 6 and up). Includes magnet attachment for GPS tracker car and waterproof silicone cover. gps para carros escondidos"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b?ie=UTF8&node=172526"
            },
            {
                "name": "GPS Trackers",
                "link": "https://www.amazon.com/GPS-Trackers/b?ie=UTF8&node=617650011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1.74 x 1.5 x 0.58 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.26 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07N4DHFZM"
            },
            {
                "name": "Item model number",
                "value": "TRKM010B"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 44,372 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#226 in Electronics (See Top 100 in Electronics) #1 in GPS Trackers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "January 25, 2019"
            },
            {
                "name": "Manufacturer",
                "value": "Tracki"
            },
            {
                "name": "Brand",
                "value": "Tracki"
            },
            {
                "name": "Special Feature",
                "value": "Push, SMS, Email Alerts for Speed, Fence, Movement, Lifetime Warranty, Smallest GPS Tracker, Full USA & Worldwide Coverage, Advanced Battery saving modes See more"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wifi, GPS, Bluetooth, LTE, GSM"
            },
            {
                "name": "Supported Application",
                "value": "IOS, Android, Web App, Alexa"
            },
            {
                "name": "Included Components",
                "value": "Lock Clip, Magnet Mount, Battery, SIM Card, USB Cable"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Versitile and powerful GPS tracker Why Tracki is a great choice Prevent theft, loss & know where your precious things are. Monthly fee is required (fee details can be found elsewhere on this listing). Our trackers are used by top companies like UPS & Vodafone. Lost, stolen or damaged device insurance included. Revolutionary LTE 4G, 3G & 2G combined, works everywhere with any network old or new for best coverage. The Tracki device is the smallest and lightest you can find and therefore contains a small rechargeable battery that usually lasts 3-10 days in real-time tracking & up to 3 months in battery save mode tracking once a day. . . . Rechargeable battery last 2 weeks in real-time tracking with Tracki's optional 6 times larger 3,500mAh battery that comes included with magnetic waterproof box, (search: Tracki waterproof box, box is not included with basic device). The smaller 600mAh supplied internal battery lasts 2-6 days for real-time tracking depending on signal strength in your area, the frequency of your tracking, device movements and settings. . . . Track in real-time on your smartphone with our state-of-the-art smart phone App, with full reporting, alerts + screen navigation size & color customization + Real-time tracking on the map and panoramic Google street view . . . Use it as anti-theft and pinpoint recovery of anything lost. Alerts: SOS, speeding, start moving, enter/leave Geo-fence & low battery. Place in a car, pocket, backpack, luggage, shipment or under a car with the supplied strong magnetic attachment. Attach it to any pet or dog collar with the included waterproof silicone cover attachment. Unlimited distance real time infinite range tracking in USA & 98% of countries. International SIM card is embedded inside the tracker. Easy setup works out-of-the-box. 2 tracking modes GPS for outdoors + Wi-Fi for indoors . . . Just like a cellphone your tracker needs a paid data connection using the cellular network for unlimited distance tracking worldwide. Monthly subscription fee is required for the device's internet connectivity + the use of our vast servers platform, R&D and live nonstop system maintenance . . . For us ‘Customer is King’, we will always go the extra mile. Compatible with Android, iPhone, Google maps, Alexa and Google Assistant. Tracki's Advantages 1. One third of the Size - 1.75x1.5x0.55in - not bulky 2. One third of the Weight - 1.26 ounces - not heavy 3. Worldwide coverage - and not only in USA and/or Canada. 4. Tracki is US based company, our clients: UPS, Nissan & Vodafone 5. We manufacture & develop GPS trackers - we are not resellers. 6. Our android & iOS APPs shows panoramic Google street view. 7. Unlimited range smartphone locator by pressing the right key. 8. Lost, stolen or damaged device insurance included. 9. 2 tracking modes: GPS for outdoors + Wi-Fi indoors 10. 5 attachments: clip, magnet, key-chain, lanyard, waterproof cover. 11. Has SOS panic button + 2 more functions buttons. 12. Locate device by sending a beep to tracker (not beeper-less) 13. Replicable rechargeable battery & not when battery dies, tracker dies",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/76172609-5920-46b6-89b5-27ecc3de9b1d.__CR0,0,971,601_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "LTE 4G + added 3G & 2G works with all networks for best coverage Super small - 1.74 x 1.5 x 0.6 inches - size is 30% of a bulky tracker. Super Light weight 1.26oz - weight 30% of a heavy tracker. That size & weight gives unique flexibility. Can be placed under or in a car, bag or carried in the pocket or belt of your child and elderly or attach it to a dog. 2 redounded tracking modes works indoors & outdoors. GPS satellites for outdoors. When indoors & GPS signal is lost, Tracki will listen to nearby Wi-Fi routers MAC ID (without needing to connect to Wi-Fi routers), matching Wi-Fi ID to our worldwide Wi-Fi database for accurate indoors location tracking. FULL Worldwide coverage & unlimited distance. USA + 188 countries. International SIM card included. Use Tracki when you travel abroad to safeguard your suitcase or track your family members in a foreign location. LTE 4G + added 3G & 2G, works everywhere with old or new networks for best coverage.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4e2f8b7-dc28-4d77-8a79-b1d3ae27056f.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4307ec51-f149-4ec3-9879-1bdc7392cb19.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dd8544e0-169e-4744-8192-e06350fffe2b.__CR0,0,1921,1921_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Many uses and ways to attach Track cars, Vehicles, trucks, kids, teen drivers, spouses, pets, wallet, luggage, elderly, seniors, Alzheimer, Autistic, equipment, tools, employees, business assets, motorcycles, ATV, fleets and valuable belongings. boats, drones Tracki GPS tracker comes with belt-clip, magnet, lanyard, key-chain, Velcro and waterproof dog attachments gives you the flexibility to be ready to adopt to any tracking situation. Tracki tracking device can be mounted quickly, and it stays stable. With Tracki’s versatile attachments collection: belt-clip, magnet, lanyard, key-chain & Velcro, you can attach it to dog collar with a waterproof silicone cover, person’s belt, pocket, hang on the neck, key-chain, handbag, drone or luggage.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ab769bd-ca22-420b-aabb-d5c06fb65324.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/59fe819f-5de6-438a-9a60-5cef41c2a1ae.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/39fed072-f2b0-4b43-bfc4-67b7d74077a1.__CR0,0,1921,1921_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "The type of clients we got & our commitment to excellence We are USA based company focused in GPS tracking innovation. Tracki & its software is developed & made by us. We are not just a white label resellers. Our main client is Vodafone a top worldwide cellular company. Tracki research & development constantly is a leading edge technology. Our GPS tracker is designed in the USA and we are focused in GPS tracking innovation. On line instructional video library is available to help you set up. Peace - Safety - Security Tracki works for unlimited range & using state of the art apps compatible with iOS & Android smart phone, Google Maps, Alexa, Google assistant, Google Panoramic street view, iPhone & Android.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de41388d-a22f-44e2-bcce-0c18a440e1d8.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7508702-1d6e-4ec6-9d73-8376dbc6e145.__CR0,0,4003,4003_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ea63d95b-cfa6-4c94-be18-3c3ff5fb3f9f.__CR0,0,1921,1921_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Powerful Android and iPhone apps Pull detailed reports for any time frame you choose. You can generate history, trip, battery, speed and alert reports for any of your trackers. History report will show you the points on the map your device was while it was moving. Get summaries and averages of speed, time and distance traveled. Get Push Notifications, SMS or Emails when the following events are triggered: 1. Tracker Starts Moving. 2. Speeding. 3. Low Battery. 4. SOS Button pressed. 5. Left key + Right key (I arrived etc.) 6. Vibration alert - Anti theft. 7. Geo-fence (When the tracker leaves or enters a pre-defined area. Enjoy the peace of mind and know where your things are at any moment. Get panoramic street view of real time or historical location of where the tracker is. Get full address real time or historical. Straight from the app contact our team via voice or chat. Access how-to videos and user manual. Customize themes: colors, map types, background types, navigation size, languages, device name, upload device custom picture, add many people to get alerts, can share links to a map showing live movement of the tracker. Hook up to 99 Trackers per account, each tracker requires its own fee",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/6f20572e-f28e-4d4d-b003-3f87decbbbaa.__CR0,0,1921,1921_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/a350f69a-a9f9-48be-a4dc-bf9779dc9149.__CR0,0,1921,1921_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/9071d47f-6e2b-45bd-a6b3-d2e3f408b8d5.__CR0,0,1921,1921_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/7f6ab649-9a2b-4f97-b042-7fc3d9dc6d0d.__CR0,0,1921,1921_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/21d7f663-1575-4bce-be10-ec74e00c0830.__CR0,1,600,180_PT0_SX600_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/76172609-5920-46b6-89b5-27ecc3de9b1d.__CR0,0,971,601_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4e2f8b7-dc28-4d77-8a79-b1d3ae27056f.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4307ec51-f149-4ec3-9879-1bdc7392cb19.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dd8544e0-169e-4744-8192-e06350fffe2b.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ab769bd-ca22-420b-aabb-d5c06fb65324.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/59fe819f-5de6-438a-9a60-5cef41c2a1ae.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/39fed072-f2b0-4b43-bfc4-67b7d74077a1.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de41388d-a22f-44e2-bcce-0c18a440e1d8.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7508702-1d6e-4ec6-9d73-8376dbc6e145.__CR0,0,4003,4003_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ea63d95b-cfa6-4c94-be18-3c3ff5fb3f9f.__CR0,0,1921,1921_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/6f20572e-f28e-4d4d-b003-3f87decbbbaa.__CR0,0,1921,1921_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/a350f69a-a9f9-48be-a4dc-bf9779dc9149.__CR0,0,1921,1921_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9071d47f-6e2b-45bd-a6b3-d2e3f408b8d5.__CR0,0,1921,1921_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/7f6ab649-9a2b-4f97-b042-7fc3d9dc6d0d.__CR0,0,1921,1921_PT0_SX220_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sebastian Castells",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUYNABPOHHIYS5ZGLY3UZJW6Q6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12B4K0UCAGKSE?ASIN=B07N4DHFZM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Unbeatable Value, Outstanding Customer Service, and Affordable Prices",
                "reviewText": "I recently purchased five (5) Tracki GPS Trackers, and I am delighted to share my exceptional experience with both their remarkable devices, unbeatable customer service, and their incredible product and subscription prices. Tracki has truly set the bar high, providing a reliable and feature-rich GPS tracking solution that not only meets but exceeds my expectations in every aspect.First and foremost, the Tracki GPS Trackers offer an impressive array of features at a price that is hard to beat. Their devices are compact, lightweight, and easy to use, making them ideal for tracking valuable possessions, loved ones, or even pets. The tracking accuracy is remarkable, providing real-time location updates with precision. Additionally, the battery life is impressive, ensuring uninterrupted tracking for extended periods without the need for frequent recharging.What truly stands out about Tracki is their commitment to offering exceptional value to their customers. The product prices are highly competitive, making Tracki GPS Trackers an affordable choice for individuals and businesses alike. Despite the affordable pricing, there is no compromise on quality or functionality. Tracki's devices are built to last and perform at the highest level, giving users peace of mind and confidence in their investment. To top that off, if purchased here on Amazon, you will get a lifetime warranty on each device purchased. Just provide the Amazon order number to their amazing customer service team via chat on their website or with phone call to their team.Moreover, Tracki's subscription prices further contribute to their outstanding value proposition. They smash the competition in pricing. Their subscription plans are superbly priced, providing access to a comprehensive set of features and services that enhance the overall tracking experience. Whether it's geofencing, historical route tracking, or custom alerts, Tracki offers flexible subscription options that cater to different needs and budgets. The subscription plans are transparently priced, without any hidden fees or surprises, making it easy to choose the plan that best suits individual requirements.The support team is highly knowledgeable, responsive, and dedicated to ensuring customer satisfaction. From the moment I reached out with inquiries about their products, their representatives went above and beyond to provide me with detailed information, personalized recommendations, and assistance throughout the entire process. Any questions or concerns I had were addressed promptly and with utmost professionalism. If you reach out to the customer service team to activate them via chat, you may get the 30% discount I received by doing so instead of just purchasing online and submitting a ticket to activate them within 24 hours. My trackers were activated with a discount on subscription pricing within minutes.To top it all off, Tracki actively seeks customer feedback and continually works on improving their products and services. This commitment to listening to their customers and implementing valuable suggestions truly sets them apart from the competition.In conclusion, Tracki GPS Trackers not only offers an exceptional tracking solution with advanced features and reliable performance, but they also provide unbeatable value through their affordable product and subscription prices. Their commitment to outstanding customer service further enhances the overall experience, ensuring that users receive the support they need every step of the way. If you're looking for a GPS tracking solution that combines top-quality devices, competitive prices, and excellent customer service, Tracki is the clear choice.",
                "reviewVotes": "56 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie R",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV4TBIFYHVDC5RJMJNHUWX6OPGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P9BFNB4H9J0B?ASIN=B07N4DHFZM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2019",
                "reviewTitle": "5.0 out of 5 stars Great device, app, and customer support",
                "reviewText": "We initially got a GPS tracking device to be able to track our special needs son in the event he would go missing. We pin it to his pocket when he goes to school, when we are out and about on the weekends, and when we go out of town or on vacation. Our biggest fear is that one day he will go missing and he won't be able to communicate to someone who he is, where he lives, what the home number is, etc. With this device and the phone app, we have piece of mind that if he ever goes missing, we will be able to find where he is at. We love the comfort of knowing where he is at that we go one for our other child who is not special needs, just in case.We used to have another GPS tracking device that we used for a number of years, but that (as many of the older GPS tracking devices do) worked on the G2 network which is slowly being phased out. Over the last few years we've seen a lot of the functionality on that other GPS tracker go away. The thought of not being able to track our son was heartbreaking for us and finding a replacement GPS tracker was difficult to do because they all were using the 2G network. We finally found this Tracki device and per the specs it runs on the 3G network. I was so excited when we found this we immediately ordered a set of them. I will have to say I was skeptic at first because it seemed like such a new product (we ordered ours in August and all the reviews we were able to find anywhere were only from a few months ago) but we figured we had nothing to loose, if we weren't happy, we could cancel service. I will have to say that this device and the company have far exceeded my expectations and my experience with other devices.The price of the device is extremely reasonable. The plans are great. Right now, since we've been trying it out we went with the month to month plan, but at some point we will switch to one of their yearly plans, which will save us money.The app is still relatively new. It was released in March 2019 and they are at version 2.3. I can say that it has greatly improved and they are constantly making improvements and releasing updates. The app will get a notification for any of the triggers you setup (such as enter or leave a zone you define). If you want other people to get notified of activities, they don't need to have the app, you can setup the app to send text messages to specific mobile numbers and you can also set it up to send e-mail to specific e-mail address. It will show you the batter life that remains for the device, and you can set it to notify you if the device hits a percent battery life so that you know it's time to recharge the battery. The batter life is great, we go a few days without having to charge it. You can set it up to refresh location every 1, 2, 5, 10, 30 minutes or even 1, 2, or 4 hours. The app will even let you \"ping\" the device so that it will beep. We've used this option a few times when the kids didn't remember exactly where in the house they put their device. This is a great feature!! It will also let you see past history of the device movement, this might come in handy at some point if anyone goes missing.The device has some nice features as well. It has a power button so you can turn the device off at night. Other's don't have this. We power them down when the kids come home, that saves batter life. It has 3 buttons, one is an SOS button in case your child runs into problems, it will notify the app on the phone and let you know the SOS button was pressed. It has 2 other buttons as well that you can use for whatever you want to be notified for. It comes with a clip that you can put on, so a child can clip it to their pants. It has a little ring loop that you can put a key ring on. We put a small cable tie with a safety pin so that we could pin it to our sons pockets to make it harder to take off.You may see comments that say that the device is not accurate. I will say, based on experience on trying several GPS tracking devices, they are all like that. It might not update the second you look at the app, but it will update, just give it time.I've called customer support twice for help on two different items, and they were VERY accommodating and EXTREMELY helpful. In the \"Help - Contact Support\" section of the app, it has a button to \"Call Support\", so they make it easy to get a hold of them when you need to.",
                "reviewVotes": "1,257 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ROXSTAR95 ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6TIYRA5KRXXDI6QEGEJUGI4RIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FQNX4SAAVT1T?ASIN=B07N4DHFZM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Very accurate. Having peace of mind is priceless. Highly recommend it",
                "reviewText": "This is my second item that I purchased. And having peace of mind is priceless. I really highly appreciate Lara's customer service, praising the outstanding performance, user-friendly interface, and compact size of the location tracker. They commend its seamless setup, easy operation, and the app's overall convenience. Users find it adaptable to various spaces and express satisfaction with its tracking capabilities. While these positive aspects shine, some customers offer constructive feedback on areas such as accuracy, perceived value, and battery life, indicating potential areas for improvement. I actually lose my tracker and they were nice enough to replace it. Thank you Lara.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 20, 2024",
                "reviewTitle": "Perfecto",
                "reviewText": "El segundo que pedi tardo en conectarse pero funciona bien, el servicio al cliente es rapido pero no siempre entienden tu problema",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vincent Tremblay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 5, 2024",
                "reviewTitle": "Great product, customer and solution services..!",
                "reviewText": "Easy to program, to use and to track what ever devices you wish to track. reommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexei Batista Costa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 24, 2023",
                "reviewTitle": "Muito preciso",
                "reviewText": "Embora tenha tido uma falha de informações sobre a chegada do produto, deu tudo certo, chegou antes do prazo e me impressionou pela qualidade do rastreamento. Lembrando que tem que pagar o plano em dólar a parte",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yvonne Demming",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 23, 2023",
                "reviewTitle": "Immer sein Auto finden",
                "reviewText": "Einfach und übersichtlich",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GUILLAUME 70",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 4, 2023",
                "reviewTitle": "Une Révélation parmi les Traqueurs de Localisation",
                "reviewText": "Après avoir testé plusieurs traqueurs par le passé, ce produit est une véritable révélation pour moi. Non seulement il est intuitif, mais il est également fourni avec une carte SIM, un détail souvent négligé par d'autres fabricants. Certains pourraient hésiter à cause de l'abonnement mensuel, mais pour un montant allant de 14 € à 18 €, il offre un service mondial illimité, ce qui est inestimable lors de mes déplacements internationaux.La précision de la localisation est impressionnante, me permettant de localiser mes biens précieux à environ 2 mètres près, ce qui est rassurant lorsque je voyage avec des équipements coûteux. L'abonnement peut être annulé à tout moment, ce qui offre une grande flexibilité. Le prix de lancement sur Amazon, à seulement 19 €, est incroyablement compétitif ; à mon avis, ce traqueur pourrait facilement coûter le triple.L'utiliser avec mon chien lors de nos sorties à la plage a également été une bénédiction. La plage étant un espace vaste, il est rassurant de savoir que je peux le localiser en cas de besoin. En paramétrant le traqueur en temps réel pour mon chien, la batterie tient tout de même 2 à 3 jours, ce qui est largement suffisant pour le retrouver en cas de perte pendant nos sorties.L'application est non seulement user-friendly, mais aussi extrêmement complète. Le service client est aussi digne de mention pour son efficacité. Un mot sur la batterie : sa durée de vie est impressionnante si vous ajustez correctement les paramètres. Il est inutile d'avoir une mise à jour de la localisation toutes les minutes. Pour mon utilisation personnelle, un rafraîchissement toutes les 2 à 3 heures suffit amplement, permettant à la batterie de durer jusqu'à trois mois. C'est tout simplement incroyable.En somme, ce produit offre un excellent rapport qualité-prix et je le recommande vivement à tous ceux qui cherchent un traqueur fiable. C'est sans aucun doute un produit 5 étoiles pour moi.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}