{
    "remaining_requests": 40141,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/GPS-MIT-Press-Essential-Knowledge/dp/0262535955",
    "body": {
        "name": "GPS (The MIT Press Essential Knowledge series)",
        "price": "$13.11$13.11",
        "originalPrice": "",
        "rawPrice": 13.11,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/GPS-MIT-Press-Essential-Knowledge/dp/0262535955",
        "soldBy": {
            "sellerID": "A2XC0MWHATRGRL",
            "name": "Woodcastle Books",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2XC0MWHATRGRL&asin=0262535955&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "Only 4 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61wLuaugcWL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Paul E. Ceruzzi",
            "link": "https://www.amazon.com/Paul-E-Ceruzzi/e/B001H6NUTY/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ThriftBooks-Phoenix",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 15,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review ...a compelling narrative about how global technological systems came to exist.—Nature Electronics— About the Author Paul E. Ceruzzi is Curator at the National Air and Space Museum at the Smithsonian Institution. He is the author of Computing: A Concise History, A History of Modern Computing, and Internet Alley: High Technology in Tysons Corner, 1945–2005, all published by the MIT Press, and other books."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 29.",
            "FREE delivery February 22 - 28.",
            "Or fastest delivery February 15 - 20."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A concise history of GPS, from its military origins to its commercial applications and ubiquity in everyday life.GPS is ubiquitous in everyday life. GPS mapping is standard equipment in many new cars and geolocation services are embedded in smart phones. GPS makes Uber and Lyft possible; driverless cars won't be able to drive without it. In this volume in the MIT Press Essential Knowledge series, Paul Ceruzzi offers a concise history of GPS, explaining how a once-obscure space technology became an invisible piece of our infrastructure, as essential to modern life as electric power or clean water. GPS relays precise time and positioning information from orbiting satellites to receivers on the ground, at sea, and in the air. It operates worldwide, and its basic signals are free, although private companies can commodify the data provided. Ceruzzi recounts the origins of GPS and its predecessor technologies, including early aircraft navigation systems and satellites. He describes the invention of GPS as a space technology in the post-Apollo, pre-Space Shuttle years and its first military and commercial uses. Ceruzzi explains how the convergence of three major technological developments—the microprocessor, the Internet, and cellular telephony—enabled the development and application of GPS technology. Recognizing the importance of satellite positioning systems in a shifting geopolitical landscape—and perhaps doubting U.S. assurances of perpetual GPS availability—other countries are now building or have already developed their own systems, and Ceruzzi reports on these efforts in the European Union, Russia, India, China, and Japan. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Engineering & Transportation",
                "link": "https://www.amazon.com/Engineering-Transportation-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=173507"
            },
            {
                "name": "Engineering",
                "link": "https://www.amazon.com/Engineering-Professional-Technical-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=173515"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ The MIT Press (November 6, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 228 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0262535955"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0262535953"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.06 x 0.58 x 7 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,131,561 in Books (See Top 100 in Books) #496 in History of Engineering & Technology #1,133 in History of Technology #38,121 in Travel (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 15 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Iver",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKGOTVPT5EJRFFG2XOGAB5V5DKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RPONUUD1XERC?ASIN=0262535955",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 8, 2020",
                "reviewTitle": "4.0 out of 5 stars Good History of GPS and Related Technologies",
                "reviewText": "I started this book looking to learn more about GPS worked, particularly with smartphones. I got more history and less technology than I was looking for, but the book was still well worth reading. It clearly explains GPS development in the context of the development of the microprocessor, the Internet, satellites, cellular communications and the smartphone. The book also places the development of GPS and other satellite positioning systems such as the Russian Glonass in the context of historical events such as the downing of Korean Airlines Flight 007 and the first and second Gulf Wars.All in all, a good quick read and a solid foundation for more technical reading.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Craig Rowland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIGTLL5GIAAWSJEYMQZ7I66U2HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7S4ADKUZKYAM?ASIN=0262535955",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 16, 2019",
                "reviewTitle": "3.0 out of 5 stars If you are not a techy, this book is not for you. A miracle I did not fall asleep while reading it.",
                "reviewText": "I picked up GPS by Paul E. Ceruzzi because I thought it would be interesting to learn about the subject matter. My commendation to the author for managing to keep me interested enough over its 205 pages, where I understood hardly anything at all, yet not once did I fall asleep during my read (not even on the bus). I find it a miracle I got through this in only four days. It was a chore to get through the first 72 pages, wherein the author talked about early navigation systems. Not until one third of the book was over did we learn about the birth of GPS.Ceruzzi implied that GPS technology makes maps obsolete. I do not rely on GPS for anything, so maps are what I turn to. I wouldn't dismiss foldout maps so flippantly. One should also never rely solely on technology to get oneself to a destination. If you do not have a backup plan with a map or an atlas, you are just as lost as not having a phone number memorized should your cellphone power source fail you.I did learn about satellite systems around the world (GPS is not a monopoly) and how they worked--in name only. The foreword states that this MIT Press Essential Knowledge Series aims to make its subject matter \"accessible\", but that presumes the reader has a highly technological background. I just had to accept whatever the author was writing about GPS as I read along.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$13.98",
                "sellerName": "WhitePaper Books",
                "sellerRating": "4.5"
            },
            {
                "price": "$14.35",
                "sellerName": "Follow Books",
                "sellerRating": "4.5"
            },
            {
                "price": "$15.94",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}