{
    "remaining_requests": 40207,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Garmin-Instinct-Features-Monitoring-Graphite/dp/B07HYX9P88",
    "body": {
        "name": "Garmin Instinct, Rugged Outdoor Watch with GPS, Features Glonass and Galileo, Heart Rate Monitoring and 3-Axis Compass, Graphite",
        "price": "$169.99",
        "originalPrice": "$249.99",
        "rawPrice": 169.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Garmin-Instinct-Features-Monitoring-Graphite/dp/B07HYX9P88",
        "soldBy": {
            "sellerID": "A6E8EL16BO37C",
            "name": "SL Deals",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A6E8EL16BO37C&asin=B07HYX9P88&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09S17DYG2"
        ],
        "asinVariationValues": [
            {
                "asin": "B07HYX9P88",
                "variationName": "Color",
                "variationValue": "Graphite",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/418alsl0odL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Tundra",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31M6Fqs-BfL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "black lava",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41-UTwWd5DL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41OFoPOc27L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31yT1M0PxsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31 j5EtYjKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31JksPjNLzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31wd Rvx72L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rXt1gCvWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51YysP-Y5rL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/bf57e7fc-c32a-5a95-bb5d-3f8e627513c0/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ab3a37c-aa17-41b3-8302-3af71df703c1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a06bc002-26b3-48aa-9ab5-ef4d1a27c028/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7601a59a-4ee6-4374-8ad0-7e7d9f74d0ee/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/957077ca-4693-4ea9-8dab-5db4dc89b2e3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9ce90aae-d3b6-444d-8822-7bec6308b7b7/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1BWXYvHKDS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1kheKJOi9L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Garmin Store",
            "link": "https://www.amazon.com/stores/Garmin/page/675B188D-FBE3-4FF4-9DD0-E48E4A2C888D?ref_=ast_bln"
        },
        "brand": "Garmin",
        "merchantInfo": "Sold by NE Solutions and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 23896,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 18 hrs 52 mins",
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 3 hrs 37 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Rugged GPS watch built to withstand the toughest environments.Supported Application:Phone. . Wireless comm standard:Bluetooth",
            "Constructed to U.S. Military standard 810G for thermal, shock and water resistance (rated to 100 meters)",
            "Built in 3 axis compass and barometric altimeter, plus multiple global navigation satellite systems (GPS, Glonass and Galileo) support helps track in more challenging environments than GPS alone",
            "Monitor your estimated heart rate, activity and stress; Train with preloaded activity profiles. Strap material: Silicone",
            "Stay connected with smart notifications (with a compatible smartphone) and automatic data uploads to the Garmin connect online fitness community",
            "Use the trackback feature to navigate the same route back to your starting point; Use the Garmin explore website and app to plan your trips in advance",
            "Battery life: Up to 14 days in smartwatch mode, up to 16 hours in GPS mode, up to 40 hours in Ultratrac battery saver mode"
        ],
        "description": "When you can rely on Instinct, the world can rely on you. This rugged, reliable outdoor GPS watch is built for the U. S. Military standard 810G for thermal, shock and water resistance (Rated to 100 meters). The fiber-reinforced polymer case adds strength and durability, and the chemically-strengthened, scratch-resistant display is high-contrast enough to read in bright sunlight, so you can take it with you into the extremes you face every day. Plus, the fully vented silicone bands include two independent, removable keeper loops to ensure a secure fit and to keep you from getting caught on things. Water rating: 10 ATM.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "Sports & Handheld GPS",
                "link": "https://www.amazon.com/GPS-Units/b/ref=dp_bc_aui_C_3?ie=UTF8&node=219536011"
            },
            {
                "name": "Handheld GPS Units",
                "link": "https://www.amazon.com/Handheld-GPS-Units/b/ref=dp_bc_aui_C_4?ie=UTF8&node=319582011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1.8 x 0.6 x 1.8 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.76 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07HYX9P88"
            },
            {
                "name": "Item model number",
                "value": "010-02064-00"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Metal batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 23,896 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 11, 2018"
            },
            {
                "name": "Department",
                "value": "mens"
            },
            {
                "name": "Manufacturer",
                "value": "Garmin"
            },
            {
                "name": "Brand",
                "value": "Garmin"
            },
            {
                "name": "Model Name",
                "value": "Instinct"
            },
            {
                "name": "Screen Size",
                "value": "1.27 Inches"
            },
            {
                "name": "Special Feature",
                "value": "Heart Rate Monitoring, Shock Resistant, Barometric Altimete, Activity Tracker, GPS, Water Resistant"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Map Type",
                "value": "Worldwide"
            },
            {
                "name": "Sport",
                "value": "running;hiking;cycling;swimming"
            },
            {
                "name": "Included Components",
                "value": "Documentation, Instinct, charging/data cable"
            },
            {
                "name": "Battery Life",
                "value": "40 Hours"
            },
            {
                "name": "Resolution",
                "value": "128 x 128"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Garmin Instinct",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/240f295c-e5e9-486b-b2ce-c4bcd11be833._CR0,246,2788,862_PT0_SX970__.jpg"
                ]
            },
            {
                "media_text": "Built to Endure Like You When you can rely on Instinct, the world can rely on you. This rugged, reliable outdoor GPS watch is built to the U.S. military standard 810G for thermal, shock and water resistance (rated to 100 meters). The fiber-reinforced polymer case adds strength and durability, and the chemically-strengthened, scratch-resistant display is high-contrast enough to read in bright sunlight, so you can take it with you into the extremes you face every day. Rugged GPS Watch Built to Withstand the Toughest Environments Constructed to U.S. military standard 810G for thermal, shock and water resistance (up to 100 meters) Built-in 3-axis compass and barometric altimeter plus multiple global navigation satellite systems (GPS, GLONASS and Galileo) support helps track in more challenging environments than GPS alone Monitor your estimated heart rate, activity and stress; train with preloaded activity profiles Stay connected with smart notifications (with a compatible smartphone) and automatic data uploads to the Garmin Connect™ online fitness community Use the TracBack feature to navigate the same route back to your starting point; use the Garmin Explore website and app to plan your trips in advance Battery life: up to 14 days in smartwatch mode, up to 16 hours in GPS mode, up to 40 hours in UltraTrac battery saver mode",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4c2fdf25-5f51-4413-91da-ee1ae25bc95c._CR125,0,750,1000_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3f681f4b-e2b9-4b1d-aaae-a67eca9fe25e._CR0,213,1572,786_PT0_SX350__.jpg"
                ]
            },
            {
                "media_text": "Garmin Instinct GPS You Can Count On You’ve never been one to follow the beaten path — that’s where Instinct comes in. GPS, GLONASS and Galileo satellite network capability tracks in more challenging environments than GPS alone. The built-in 3-axis compass and barometric altimeter help you keep your bearings. Take the guesswork out of your return journey by using the TracBack feature to navigate the same route back to start. Monitor and Train The Instinct GPS watch estimates your heart rate, activity and stress throughout the day, so you know how much you do — and how hard you’re working to do it. When you’re ready to train, we’ve got you covered with preloaded activity profiles for running, biking, swimming and more. Stay Connected Smart notifications let you leave your phone in your pocket. Pair your phone with Instinct and our Garmin Connect online fitness community for automatic uploads, live tracking and the GroupTrack feature. Or, pair with the Garmin Explore website and app to plan adventures before you head out.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/64d46cec-1c6e-4efb-940d-2c02d2b0e4be._CR0,0,873,873_PT0_SX300__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/50c6e0a4-74de-4cdb-b0a4-026feea41068._CR0,0,877,877_PT0_SX300__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/db2b0d17-7290-46c1-85a8-fbf032c2e5de._CR0,0,877,877_PT0_SX300__.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/240f295c-e5e9-486b-b2ce-c4bcd11be833._CR0,246,2788,862_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4c2fdf25-5f51-4413-91da-ee1ae25bc95c._CR125,0,750,1000_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3f681f4b-e2b9-4b1d-aaae-a67eca9fe25e._CR0,213,1572,786_PT0_SX350__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/52bd69f2-bab9-482f-b051-aa1c6d490615._CR0,92,1008,312_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/64d46cec-1c6e-4efb-940d-2c02d2b0e4be._CR0,0,873,873_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/50c6e0a4-74de-4cdb-b0a4-026feea41068._CR0,0,877,877_PT0_SX300__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/db2b0d17-7290-46c1-85a8-fbf032c2e5de._CR0,0,877,877_PT0_SX300__.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOBTTUXBW2CABZ2DHX2TBZG2QEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R143CLZUV6DNGJ?ASIN=B07HYX9P88",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent field watch, disappointed in Garmin Concur App",
                "reviewText": "I purchased this watch for use in geologic field work, and it has been an excellent choice. It is light weight, has excellent battery life of over 2 weeks when paired to the phone, but not using the GPS, and even longer when you turn off phone pairing. I have not used it extensively in GPS mode for tracking courses, but I have a dedicated GPS for that. I use the GPS on the watch for the occasional location.The biggest selling point for me was the battery life, heart rate monitor, and smart watch phone pairing.My recent use case was ~3 weeks in remote Greenland at 76 North. The GPS coverage that far north was spotty on this watch, but that is not a major fault in my opinion. The watch was excellent for use in the field with the timer, alarms, and stop watch. I found I utilized the barometer a lot when planning weather related activities. The altimeter is based on the barometric pressure and was reasonably precise with elevation change, but needs to be calibrated to be accurate. I was not able to test if the altimeter could be calibrated on the GPS fix though, and I don't believe that it is. The temperature sensor is too close to skin and was effected by layers, so I did not rely on the temperature. The compass worked pretty well.The heart rate monitor worked well for me, but I don't have anything to compare it to for accuracy. I found it worked well with both tight and loose wrist band settings.The user interface was fairly straight forward to learn.I have found since getting this watch that I have been more active to see how to get better numbers. The Garmin Connect app is interesting and helpful, but my biggest announce is the app requires an internet connection in order to sync data from the watch to the app. While in remote areas without internet, I was unable to look at the trends in data I was hoping for. That is a problem with the app and not the watch, however, and I have confirmed that with Garmin.I elected to get the older version of the watch rather than the newer Instinct 2 because of the cost difference. I have been happy with it so far, and for my purposes the Instinct has fit my needs well.",
                "reviewVotes": "43 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ClaytonClayton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE5SLQ5JERX32FLONQKB72MLMHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5IEWH7JHODO7?ASIN=B07HYX9P88",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2018",
                "reviewTitle": "5.0 out of 5 stars Tried Them All, This Is The Best",
                "reviewText": "LATEST UPDATE AT BOTTOM (5/11/2020)What a frustrating activity tracker/smart watch journey I have been on. Nothing seemed quite right for what I was looking for. I am an avid outdoorsman who likes to hunt, backpack, hike, bike, and occasionally run. Things that are extremely important to me are an accurate altimeter, barometer, and GPS.I first purchased the Fenix 3 HR. The watch was impressive in the beginning and I thought I had found the one. The issue turned out to be the altimeter. It was not accurate at all. I then waited for the Fenix 5. Same damn issue. Altimeter was worse than the 3. When I contacted Garmin, they told me to put the watch in warm soapy water. While this did seem to temporarily reset it back to normal, I continued to experience the same issue. As much as I would like to put my watch in a warm glass of soapy water every night, I decided to pass. The 5 plus eventually came out and appeared to solve these issues. But then.....Garmin realeased the Instinct.This watch (so far) has really impressed me. It is so light weight and comfortable. The Fenix watches, while premium, are a bit large and heavy to wear. You truly forget you are wearing this watch. The features are great. It has absolutely everything I need. I’m not a triathlete and could care less about some of the measurements the Fenix gives you. Some have commented on the grainy display. I completely disagree. I would liken it to E Ink from a kindle. It truly is a pleasure to look at and is extremely clear and readable. I love that it is black and white.The keys and apps are very responsive. The menus are so much faster than the Fenix. You can really whip through the widgets and settings to get where you want. The buttons are excellent and I have yet to accidentally press one while bending my wrist.I am still testing the accuracy of the GPS tracking and ABC sensors but so far it is looking great. I really can’t say enough about this watch. Knock on wood, it seems like a great model from Garmin that will feel a niche hunting/outdoors market. I will provide an update in a month after more usage.-UPDATE-I've now had this watch for a few weeks and have taken it on several hunting trips. I am truly impressed with this watch. I cannot emphasize enough how comfortable and light this watch is. Owning and wearing heavier watches over the years, I think I forgot how nice it is to wear a watch that you forget is attached to your wrist. I hated wearing my Fenix watches to bed. Too bulky and would dig into my wrist. Tracking appears to be very accurate. Attitude has been accurate for daily use and when you are tracking an activity.What I Love About This Watch:-Comfortable & Lightweight-Responsive Menus-Screen Visibility is Exceptional-Accurate ABC Sensors and Tracking-Recessed Buttons Avoid Accidental Presses-Battery Life Has Been GreatI really only have a couple complaints or rather suggestions to improve the watch. When you lock the keys (which you don't have to too often because of recessed buttons), in order to unlock the watch, you hold any button for a short period. I wish Garmin would lengthen the amount of time it takes to hold the button. It takes about .5 seconds to unlock currently and that can be accidentally done pretty easily. This is really a minor complaint though. The screen is an unknown material or proprietary to Garmin. I do wish it was a Sapphire display but I put a screen protector on it and you truly cant tell there is one on the face. My last suggestion is I wish the battery indicator showed a percentage as opposed to the 5 bars in a battery indicator. Again, its a minor gripe but it would be nice if they changed that.Please ask me questions. Id be happy to answer. I've done a disturbing amount of research on these watches over the years and believe I have finally found the perfect watch for my needs. I've used all Fenix watches and a Suunto Traverse Alpha. This watch is my favorite.UPDATE 5/11/2020Still an absolutely great watch. This watch is on my wrist every single day. It is still extremely comfortable. I have had a couple issues that I will address:-My \"Back\" button started to give out on me around July 2019. It is a very commonly pressed button on the watch. Luckily the watch was still under warranty. Garmin replaced the watch no questions asked and quickly. A+ to them on their customer service. If it had gone out after the warranty period though, I would most likely be SOL. I believe it is a one year warranty.With that being said, I do use this watch heavily. It is worn 24/7-365. All things considered it has held up extremely well. At the new price point, I still think it is an amazing watch for the price.-My other issue, and I stated it earlier in the review is the lock feature on the watch. Its great that you can lock the screen but it is extremely easy to unlock simply by bending your wrist and hitting a button. This could be a simple software fix. They just need to extend the amount of time required to press a button to unlock. It doesn't happen that often but if it does during an activity, it can be extremely frustrating.This will be my last update for the watch. It has been an amazing watch well worth the price for me and I will buy another whenever this one dies. I hope Garmin continues to offer and improve this watch. It checks all the boxes for my needs.",
                "reviewVotes": "3,698 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/714kIYISIFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71jtMC224QL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "jose ramon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 10, 2023",
                "reviewTitle": "Excelente",
                "reviewText": "El mejor reloj para deporte , su precio es accesible supongo por la pantalla monocromática, pero buenas funciones",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thiago Zimmermann",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on April 25, 2023",
                "reviewTitle": "Leve, robusto, operacional e preciso",
                "reviewText": "A quantidade de funcionalidades é bem grande, com sensores precisos. Pulseira confortável, construção geral bastante robusta mas ainda assim muito leve. Bateria dura mais de 30 dias no modo smartwatch. Aplicativo fácil de usar e intuitivo. Muito feliz com a compra, recomendo.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Miller",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2022",
                "reviewTitle": "Perfect watch for the health-conscious outdoors person",
                "reviewText": "I've always used G-Shock watches in the past so it's no surprise I like the style of this one. The Garmin Instinct is like a smart g-shock. If that appeals to you, then this is your watch.Due to the more traditional \"digital watch\" style of screen you get outstanding battery life -- up to 2 weeks without using GPS. Using GPS drains more battery so your total life will really depend how much you use that function. Speaking of the GPS, it works great. You can either use it with tracking an activity (like walking, hiking, running, biking, rowing, swimming, etc.) or simply tell it to track you. Once you're done you will get a basic map on the screen showing where you went, and if you load up the Garmin Connect app for your phone you get the detailed map and history of where you went including your speed and steps.One of the coolest GPS features is the track back, which takes you back to your starting point. It has you retrace your steps exactly rather than just pointing you in the general direction. Pretty handy if you're in the wilderness.The heart rate monitor is accurate and always keeps track of your maximum and resting heart rates, and gives you a long term history of it in the app. It's always recording this in the background, and you can also have it constantly shown on the main screen.The compass is handy and also accurate (much more than the compass in my old g-shock). The barometric pressure sensor also seems consistent. It can even warn you of potential storms due to sudden pressure changes. The temperature sensor is less useful because it is affected by your body temperature.One feature I really liked was the easy access to sunrise/sunset times and the current moon phase and rise/set times. You can even have the watch warn you if sunset is approaching.It keeps track of your steps and floors climbed at all times and dynamically updates your daily goal based on your activity.In terms of smart features, they are very basic but they get the job done with no extra fluff. Once paired with your phone, you can show notifications on the watch (it can also vibrate). You can ignore notifications from certain apps if you want, or turn them off entirely. The Garmin Connect app is easy to use and your watch stays synced without you having to open the app. I've had no bluetooth issues. You can also have the current weather and forecast on the watch.Another smart feature I appreciated was how Garmin Connect can interface with MyFitnessPal which is the app I use to track calories and my weight. It can automatically add your steps and calories burned to the MyFitnessPal app, and other things like your current weight will be transferred back to the Garmin app. My only complaint there is it seems Garmin is a bit too generous with the extra calories (even if your activity level in the MyFitnessPal app is set to sedentary).There was 6 different watch faces, with dark and light versions for each. I preferred the default one. You can completely customize the watch face and choose what you want to display on it. Date, heart rate, steps, sunrise/sunset, battery level, barometric pressure, etc. I am impressed how much useful data you can get displayed on one screen at a glance. The backlight has adjustable brightness and you can also set it to automatically turn on when you raise your wrist.The band is comfortable and fits any size wrist, even very large ones. Overall I am thrilled with this watch and wish I got one years ago when they first launched. This is the smart/fitness watch for someone who doesn't want a smart watch.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ray",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 10, 2023",
                "reviewTitle": "Indistruttibile",
                "reviewText": "Questo non è un orologio ma uno strumento. Comodo, leggero, robustissimo. Usato in uscite complicate, fa egregiamente quello che deve. Due parole riguardo le tarature alti e baro: Vanno fatte bene, secondo le indicazioni della casa produttrice. Se pensate di accenderlo e avere misurazioni straprecise iniziate male. Non è semplice tararlo, come per tutti questi strumenti, ma va fatto e una volta fatto è molto preciso.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "spacyxvspacyxv",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 3, 2019",
                "reviewTitle": "Better than Apple Watch",
                "reviewText": "I used to have apple watches series 1 and 4. I am using this Garmin for one month now and I am very amazed by the quality products.It has all the cool stuff I used to like with Apple Watch and which are really useful:- watsapp messages, all notifications mirrored from an iPhone- call and ID notification, though you cannot speak through the watch (which honestly I hardly never used)- music control from the watch (any app, Spotify, Deezer, music app) so you can change a song and control the volume in a shower or from your sofaIn addition it is better:- battery life, this is really great not to charge it for 8 to 10 days in my experience and usage, especially if you travel for 2 / 3 days, no need to bother for a charger,- stronger, no worries if any shock while doing outside activities,- time is always on display (no need to lift the harm),- water and shockproof, can go deep and in the sea,- strong / rugged design- internal sensors (temperature, altimeter).Of course it has no coloured / touch screen, so you have to do everything with the buttons but honestly it is less fragile / sensitive and i prefer it like this. It sometimes loses Bluetooth connection, but I restart it and it is fine. It restart very fast anyways (20s).",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71kEsLHCNoL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$179.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            },
            {
                "price": "$179.99",
                "sellerName": "universal goods",
                "sellerRating": "5"
            }
        ]
    }
}