{
    "remaining_requests": 40217,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bluetooth-Waterproof-Protection-Suitable-Children/dp/B0CN2VLQ4X",
    "body": {
        "name": "Utag Hidden GPS Tracker for Kids 2 Pack, Bluetooth Tracker Works with Apple Find My (iOS only), IP67 Waterproof, Privacy Protection, Lost Mode, Suitable for Children, Elderly, Pets, Backpack(Black)",
        "price": "$26.99",
        "originalPrice": "",
        "rawPrice": 26.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bluetooth-Waterproof-Protection-Suitable-Children/dp/B0CN2VLQ4X",
        "soldBy": {
            "sellerID": "AALDCWIAWR4QP",
            "name": "FunMiu Tech",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AALDCWIAWR4QP&asin=B0CN2VLQ4X&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41vof4egraL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51NlP-OJZwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nIdWxIm7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61FBd3TbYPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dzNfPxJWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ORn1Jo1PL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QTo0p0P3L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/08afd427-7a36-48ea-aab6-24d27f64cbf9/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the lulaven Store",
            "link": "https://www.amazon.com/stores/lulaven/page/FBEE7C79-1192-4908-AE5B-D18166850F8B?ref_=ast_bln"
        },
        "brand": "lulaven",
        "merchantInfo": "FunMiu Tech",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 32,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 38 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Works with Apple Find My: Keep track of and find your kids alongside family and devices in the Find My app.Simple one-tap setup instantly connects UTag with your iPhone or iPad.You can then locate it anywhere in the world using Apple's network of millions of devices. Note: Apple Find My features only work if used with an iOS, iPadOS, or macOS device.",
            "Free Left Behind Remind: if your Utag ever disconnects from your Apple device's Bluetooth connection, you'll receive instant notifications. Whether the kids, teens, or pets run out of sight in busy areas, parks, airports, shopping malls and outside your home, or accidentally leave your bag at the gym, our \"Left Behind Remind\" will be your prompt reminder,avoiding losing your belongings in the first place with instant left-behind alerts via the Apple Find My app—with no added fee.",
            "Instantly Locate: UTag bluetooth tracker allows you to view the location in real-time. When the distance is less than 200 ft, you can use the \"Find My\" app to play a sound and locate the position. When the distance is greater than 200 ft, you can use the map navigation feature in the \"Find My\" app to find the location of your UTag.",
            "IP67 Water-resistant & Replaceable Battery: With its impressive P67 waterproof rating, this device is designed to withstand water splashes, rain, and even brief submersion. UTag comes with a replaceable battery that lasts an impressive year. You can rely on our device to keep safeguarding your loved ones without the hassle of frequent battery changes.",
            "Hidden design: This Hidden GPS tracker for kids is different from other visible bracelets, necklaces, keychain, and GPS watches for kids which is exposed and easily removed.Utag is designed to be easily worn by kids and comes with non-removable fastener that can secure to clothing, bags, jackets, and could be only removed by the magnetic unlocker(included).The Utag gives parents peace of mind."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "GPS, Finders & Accessories",
                "link": "https://www.amazon.com/GPS-Navigation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172526"
            },
            {
                "name": "Item Finders",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18022313011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "4.76 x 3.98 x 0.87 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CN2VLQ4X"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Metal batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 32 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#20,504 in Electronics (See Top 100 in Electronics) #203 in Item Finders"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth"
            },
            {
                "name": "Special features",
                "value": "Waterproof"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Whats in the box",
                "value": "Battery"
            },
            {
                "name": "Manufacturer",
                "value": "Funmiu"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "November 9, 2023"
            },
            {
                "name": "Brand",
                "value": "lulaven"
            },
            {
                "name": "Special Feature",
                "value": "Waterproof"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Included Components",
                "value": "Battery"
            },
            {
                "name": "Compatible Devices",
                "value": "Smartphone"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About US lulaven, established in 2020, is a brand that offers high-quality handy accessories to improve people's lives and make their routines easier. Our young and passionate team is committed to delivering the best products and service to our customers. We use only the highest quality materials to create durable and stylish accessories that are not only functional, but also aesthetically pleasing. Our products have received countless positive reviews from satisfied customers, and we are continuously striving to innovate and improve our product line to meet their changing needs. At lulaven, we are a community of technology enthusiasts dedicated to making your life easier.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2fdfd678-7676-45d1-bb9a-71b688421c1c.__CR1,0,1599,989_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2fdfd678-7676-45d1-bb9a-71b688421c1c.__CR1,0,1599,989_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f190292c-2da5-4243-a089-9e4d147e8a49.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8939481e-e714-424e-9b06-d6b9c107e9e3.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f850cad1-568c-4e5b-bda1-fc7de0fb381b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3c84b350-c98f-43ac-aa1e-0feec85214f5.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6PLL2ZJ4CL5IJW4D4I6N463DVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RTZSMVVQRMXO?ASIN=B0CN2VLQ4X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Low-Cost AirTag Alternative",
                "reviewText": "I ordered this set of AirTag/Find My compatible trackers to attach to my daughters backpack. She's lost it a few times at school (how exactly you loose an entire bookbag is beyond me), so it was a matter of finding a way to keep her stuff together. It came as a two-pack with easy-to-follow instructions (I read them after I did the first one... oops?)So here's my rundown:- Battery life is good so far. I've tested them both on different items (one on the bookbag, one on her jacket)- I love and hate the application options- It does the same thing as the AirTag, at least from what I can tellSo to clarify - I've had these for just over a month. I've not had any issues with battery life so far. If I see it's an issue, I'll come back and update this posting. Everything I've tested from an AirTag (I have one of those as well) to the UTag is the same. Tracking down to ~ 3 ft is perfect. I usually see what I'm looking for by then. Sounds are decent.My love and hate... the application. So I love that I can attach it to an article of clothing (i.e. her jacket) and not worry about it being accidentally removed. I hate that it has to puncture through it. I love that I can put it in her bag without doing that. I hate the extra bulk that comes with the port for the applicator pin. I love that it comes with a magnet to release/remove. I'm not sure how well that'll work if someone else has a magnet.Overall, I'm really happy with how well these have been working out. My love/hate relationship with the ways it can be attached aside, these are awesome. And I'm not going to knock off points for something that I both love and hate. So, 5 Stars, and I would get them again.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "theTXbuys",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6XKAYPDQBBFV6UR4XMUU6RULVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EFOY8QYV6A8J?ASIN=B0CN2VLQ4X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "4.0 out of 5 stars Nice GPS tracker set at a great price",
                "reviewText": "REVIEW FOR: lulaven Utag 2 pack GPS tracker setPRICE WHEN ORDERED: $27INCLUDED WITH ORDER: 2 GPS devices, 4 attachment pins, 1 magnetic pin removerMY REVIEW STANDARD: Excellent (5 star), Good/Very Good (4 star), Average (3 star), Below Average (2 star), Avoid (1 star)VERDICT: Very GoodPROS: These GPS trackers are relatively small and look nice. Once you figure out how to sync with the FindMy app they connect quickly and appear to be working well. I tested it by putting one in a car and having a family member drive to a shopping center 10 miles away. The FindMy app showed it’s location more precisely and with less drift than the GPS unit in an iphone 13. I haven’t had a chance to test it at further distances or more remote areas yet, but the listing claims it works globally on Apple’s network, so it seems very promising. The magnetic pin attachment feature is handy for connecting it to soft material where it won’t be readily noticed and easily removed. They come with a button battery preinstalled and claim a 1 year battery life. Mine show to have arrived fully charged. Very attractive pricepoint.CONS: Although these devices aren’t particularly large, they are big enough that they would be quite noticeable and uncomfortable if attached to clothing, especially for a child. Their size and weight has a similar feel as a medium size anti-theft devices you see attached to clothing at a retail store. So, probably not something anyone would want to wear on their clothing for very long, even if concealed. The battery door is also hard to open/close and feels like the plastic notch could fail with repeated use. Fingers crossed the battery really lasts 1 year as advertised. The instructions could also be clearer. There is a button on the device you have to push for the FindMy app to detect this but the instructions don’t show the button.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CalvinCalvin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFOEERM6IXHT7T2CW3BTJMLP2DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28M9E8KLDNHMZ?ASIN=B0CN2VLQ4X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Pin it to track it…",
                "reviewText": "I often wear a light jacket to restaurants then remove it while there, only to forget it when I leave. I’ve lost several that way. These trackers help prevent that. The FindMy app notifies when items are left behind.These Apple FindMy compatible trackers use a unique way to attach to items. They have a metal pin that can attach to any cloth or strap, etc. (see pic) Once attached, the tag will not release from the pin unless it is released with the included strong magnet. These trackers attach in a similar way as inventory control tags found in clothing stores.They are a great value. The price is roughly half as much as AirTags, you get two of these for about the same price.These trackers are IP67 waterproof, so rain or accidental swimming or washing should not be an issue.They connected easily to the FindMy app on my iPhone. Just follow the instructions in the user guide. Be aware that FindMy and these trackers only work with Apple products.The tags have a solid heavy feel to their construction. They are larger and heavier than AirTag and will not fit holders made for AirTag. Of course you can easily place these in a suitcase pocket or other location without using the attachment pin.The box included the two trackers with installed batteries, four attachment pins, a magnet with holder to release the pins as mentioned and a well-written user guide. (See pic)The only minor negative for me is the locating sound they play isn’t as loud as an AirTag. I seldom use the Play Sound function.I’m attaching one to my jacket now so I don’t leave it behind again. I hope this information has been helpful.——-This review is for:Utag Hidden GPS Tracker for Kids 2 Pack, Bluetooth Tracker Works with Apple Find My (iOS only), IP67 Waterproof, Privacy Protection, Lost Mode, Suitable for Children, Elderly, Pets, Backpack(Black)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61c2oGbWcCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71asw4aLawL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71drvr9mZvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melvis J. Vaz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCFJOWWCLEPEZWWFIF7QB7XBCWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ENAP9ZN2OWFC?ASIN=B0CN2VLQ4X",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "2.0 out of 5 stars Do not track real-time",
                "reviewText": "The product description is misleading. This product does not track real-time. It updates after 1 hr or so",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Hope",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 15, 2024",
                "reviewTitle": "GPS Tracker for Kids",
                "reviewText": "Cheaper version of apple i tags. Useful to track belongings or using to track your children or family members.Instructions are included to help set up the tags. Included in the Box are two trackers with installed batteries that are replaceable.The tags are also water resistant. Fair value for money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ErnestinaErnestina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 13, 2024",
                "reviewTitle": "Strong, uses a secure pin through system",
                "reviewText": "These are to add to our 'find my' collection to help with finding various keys, coats, bags etc.They are rather like key fobs to look at but they arent, as they have no hanging holes.You could fix one through a thin leather key fob to make them hangable but no loop or hole of their own.Instead you pin them to clothing or anything the pin can penetrate.You get 4 pins (2 are spares)Push the pin through the material and it will lock to the tag.To remove it, you use the remover gadget by holding it behind the tag which allows the pin to be pulled back out.You cant pull the pin out WITH the gadget.Use the FIND MY app on your phone to add the tag.Next time you cant find your bag, look on the phone.You can set 'left behind' mode to alert if you are going to leave the tagged itemLost modeThe tag will emit a sound if it is moving but you arent with your phone so that another person cant track you secretly.There is an on/off button on the front which is rubberised so hopefully damp cant get in for example if you have it tagging your sports bag.I would suggest that this is always on unless you are changing the battery.I found the battery cover slot very annoying because nothing I have would fit the slot (its narrow and seems like it is curved to use a disc but its too thin for any of our coins)and I scratched one of the covers trying to open it.Really if they are going to make such a specialised size of slot, there needs to be an opening tool but anyway.This will work on soft materials and leathers as the security pins are a kind of robust drawing pin style . They should NOT cause a stabbing hazard as they will be locked into the tag when being used.This set is very good quality, not flimsy cheap plastic.It works rather like the security tags in clothing stores but on a small scale",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ogSt0Q0HL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ZxvQG1i4L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Honest and fair reviewsHonest and fair reviews",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 14, 2024",
                "reviewTitle": "Good price and works well.",
                "reviewText": "For the price, roughly half that if Apple air tags, these are brilliant.They attach security to clothing or bags and can only be removed with the magnet. They attach with a little silver pin, either the pin or the tracker could be in show, my preference is to have the tag on the inside.The tag is quite plain, black and won’t look out of place.You’ll need to download the Apple app and it then works exactly the same way as Apple air tags.I’m really pleased with them and will be using with grandchildren when on holiday.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61CNvwXAfBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71t1ybI6NtL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr K",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 15, 2024",
                "reviewTitle": "Not too bad, but could be better",
                "reviewText": "These are slightly heavier than the tags I’ve previously owned, but I prefer a bit of weight to things that I buy. Unlike others, these make changing the battery very easy. Rather than trying to split the case open, there is a convenient round panel on one side that can be twisted to reveal the battery. Apparently, the battery will last for up to one year. I guess only time will tell about that claim.The method employed to attach to items, such as clothing and straps, seems a little too aggressive for me. I tried this on a shirt and it left a noticeable hole in the fabric. I can’t help but feel that, over time, the edges will fray and the hole will become larger. Bag straps, perhaps, but as for clothing, it’s not going to be my preference.These perform as well as any other generic tag I’ve tried. The lack of an ultra-wide band chip means they can't be located with pinpoint accuracy. Having said that, most of the time you can just enable the built-in sounder to help you track the item once in the general vicinity. However, the sound emitted by these tags is not very loud, so if you were to rely on this, you could have a problem.Other than the ease of battery replacement, I find these perform just like any of the other Apple AirTag alternatives.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Russell hares",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "Not very accurate",
                "reviewText": "Lost tag of my pet collar, found it completely by accident over a hundred meters away from the point where my phone said it was , not impressed",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}