{
    "remaining_requests": 37434,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Handheld-Stainless-Bathroom-Attachment-Accessories/dp/B0C3GR8B47",
    "body": {
        "name": "Luxury Handheld Bidet Toilet Sprayer, Premium SUS304 Stainless Steel Bathroom Bidet Sprayer Attachment Set, Baby Cloth Diaper Sprayer with Superior Complete Accessories, Support Wall or Toilet Mount",
        "price": "$19.99",
        "originalPrice": "$20.99",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Handheld-Stainless-Bathroom-Attachment-Accessories/dp/B0C3GR8B47",
        "soldBy": {
            "sellerID": "ADAHZ76687HOR",
            "name": "BLIGHT-US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ADAHZ76687HOR&asin=B0C3GR8B47&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CCVKBW7K"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C3GR8B47",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$19.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51ibK+JgggL._SS36_.jpg"
            },
            {
                "asin": "B085WW6B1X",
                "variationName": "Color",
                "variationValue": "Brushed Nickel",
                "price": "$25.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51F3TiSZg8L._SS36_.jpg"
            },
            {
                "asin": "B0C5DLRQV8",
                "variationName": "Color",
                "variationValue": "Matte Black",
                "price": "$19.97",
                "variationImageURL": "https://m.media-amazon.com/images/I/41UZWN7DjCL._SS36_.jpg"
            },
            {
                "asin": "B088JZZVS1",
                "variationName": "Color",
                "variationValue": "Metal Black",
                "price": "$30.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51zi9MaGJwL._SS36_.jpg"
            },
            {
                "asin": "B0BX3N6G26",
                "variationName": "Color",
                "variationValue": "Sink Faucet Sprayer",
                "price": "$29.98",
                "variationImageURL": "https://m.media-amazon.com/images/I/41vOVFiaFlL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ibK JgggL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51H83Jo938L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KQSh0ItsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KBBpWxYqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512tZssFE3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mcxFVHjFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XVwnw2HvL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the GASLIKE Store",
            "link": "https://www.amazon.com/stores/GASLIKE/page/91B6C99B-7DD6-48F0-BF7F-0D7EE50338DD?ref_=ast_bln"
        },
        "brand": "GASLIKE",
        "merchantInfo": "BLIGHT-US",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1633,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✅【NEW LEAK FREE DESIGN】The new version Nylon T-valve for a perfect match, a brass valve for leakage-free, anti-burst hose for enhanced durability, oxidation, a cone washer for sealing well. Each of the designs of your handheld bidet sprayer for toilet is to prevent leakage,it can also avoid the risk of flooding your home, so you can buy it at ease and use it comfortably. In order to ensure your satisfaction, if there is any damage to the bidet sprayer for toilet, you can get a replacement",
            "✅【MULTIPLE USES MEET YOUR NEED】This handheld bidet sprayer is great suitable for the whole family, especially for anyone with limited mobility due to surgery, arthritis, postpartum or injuries, ideal for elderly adults, also perfect as a cloth diaper sprayer, bathroom cleaning, pet shower, car wash gun, flowers sprayer, baby bathing shower, toilet sprayer washer, hygienic sprayer, meet all kinds of your need. A great cleaning jet sprayer for toilet for a whole family",
            "✅【ADJUSTABLE WATER PRESSURE DESIGN】The water pressure can be adjusted by the handheld bidet sprayer lever, it will meets multiple uses by adjusting the water pressure of bidet sprayer from gentle spray to jet spray. Press lever gently to get soft spray to do personal cleaning, especially an ideal choice for women during pregnancy and menstrual cycles. Press lever deepest to get jet spray to wash baby cloth diaper or clean your toilet, help improve your family cleaning quality",
            "✅【EASY INSTALLATION & DIY FRIENDLY 】Connect your hand held bidet set with no need for wrenches, other tools,or professional plumbing help. The toilet bidet sprayer can be installed less than 10 minutes without any professional help. You will surprise for the easy and convenience for our hand held bidet sprayer set and can't help loving it. All parts are included, also with detailed instructions. If there is any problem during the installation, please contact us and we will help you relove it",
            "✅【COMPLETE AFTER SALES SUPPORT】 If you have any questions, please contact us through Amazon Supports.We will solve the problem for you within 24 hours"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b/ref=dp_bc_aui_C_3?ie=UTF8&node=680350011"
            },
            {
                "name": "Bidet & Bidet Parts",
                "link": "https://www.amazon.com/Bidet-Bidet-Parts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6810562011"
            },
            {
                "name": "Bidet Attachments",
                "link": "https://www.amazon.com/Bidet-Attachments/b/ref=dp_bc_aui_C_5?ie=UTF8&node=6810564011"
            }
        ],
        "productInformation": [
            {
                "name": "Recommended Uses For Product",
                "value": "Bathroom"
            },
            {
                "name": "Mounting Type",
                "value": "Toilet Tank Mounted / Wall Mounted"
            },
            {
                "name": "Number of Handles",
                "value": "1"
            },
            {
                "name": "Special Feature",
                "value": "Water Saving System"
            },
            {
                "name": "Handle Type",
                "value": "Lever"
            },
            {
                "name": "Installation Method",
                "value": "Single Hole"
            },
            {
                "name": "Finish Type",
                "value": "Brushed"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Handle Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,633 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#26,935 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #64 in Bidet Attachments"
            },
            {
                "name": "Brand",
                "value": "GASLIKE"
            },
            {
                "name": "Included Components",
                "value": "sprayer, T-valve, installation group components, hose, handle"
            },
            {
                "name": "Model Name",
                "value": "‎TOLT SPR"
            },
            {
                "name": "Model Number",
                "value": "TOLT SPR"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "1 x 1 x 1 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.7 Kilograms"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Why is the use of handheld bidet sprayer always advocated? More and more people pay attention to health, and everyone's personal hygiene starts with the bathroom. Start improving your healthy life with a small handheld bidet sprayer. What can handheld bidet sprayer bring you? *Ensure good daily hygiene. *Women are clean during menstruation. *Hemorrhoids patients are easy to use and reduce infection. *Friendly to children and old people. *The best way to wash baby diapers. *Cleaning hard to reach areas in your shower and bathtub We are sure you’ll find plenty more ways to use this handy handheld bidet sprayer!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7428b0c4-2530-44f3-a5da-4f338e0365bd.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Two modes for multiple uses Design with adjustable water pressure, it can be changed from jet spray to soft spray to meet multiple use by adjusting the water pressure of the bathroom water spray. Jet strong water pressure used for rinsing stubborn stains such as cleaning floor,carpets or baby cloth diapers. Soft low water pressure for personal hygiene, baby bath or pet washing. All the housework will become very simple!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6e77065f-46d7-429f-bcd2-69c01c07f190.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "All needed accessories are included All installation kits for bidet sprayer are included, just make sure the water inlet diameter of your toilet tank is 7 / 8 inch. This hand held toilet bidet sprayer can be installed in 5 minutes without any professional help",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8cc2e51d-26ed-44f4-9e76-b38bdacb4c43.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e549cb67-9ce9-4e58-85c0-ac800b58d067.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7428b0c4-2530-44f3-a5da-4f338e0365bd.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6e77065f-46d7-429f-bcd2-69c01c07f190.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8cc2e51d-26ed-44f4-9e76-b38bdacb4c43.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa3711ed-3dd4-4ec2-baf1-3fc4e2c11c60.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cd78909e-20b0-4775-8a4b-f42ffea2eee8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c1a16cb-ae98-4b36-989c-143b78c4581d.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Steven P. Spinella",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQ2MS26JOAST5F6PKIZ5FE2NKUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE9ITSJ6OKGC3?ASIN=B0C3GR8B47",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2020",
                "reviewTitle": "5.0 out of 5 stars I found this to be a thoroughly cleansing experience, including installation",
                "reviewText": "No pictures. Why, do you want to see me laying down next to the toilet, or what else were you thinking?! Seriously, from opening the package, to using the product, I was all but blown away.Everything was packed meticulously, including simple, clear, and accurate instructions in standard English. Note to self: the compression washers for the fitting were under the teflon tape for wrapping the threads on the compression fittings and the (optional) screws for mounting the hanger on the wall. The stainless steel finish is a bit more impressive than the toilet on which I have it installed, but maybe your toilet is more impressive than mine.INSTALLATION: It installs directly under the toilet bowl.1) Turn off the water supply. Usually there is a valve near the floor or the wall just below the toilet, but if not you need to find a valve somewhere else and turn off the water. Then detach the supply line from the threads protruding from the bottom right (left as you face the wall) of the toilet bowl. (This is typically just below the level at which you sit on the toilet and usually directly under the tank, if you have a modern, American toilet.)2) I suggest wrapping the threads (plastic on my toilet, maybe brass on yours) with the included teflon tape, three complete revolutions is standard. Then take the fancy looking valve and insert the rubber washer into the female side (mates with the toilet side threads) and screw it in, making sure the connection for the hose (smaller) points out toward the front of the toilet, meaning the shutoff valve will point toward the wall. (You will not succeed if you try to install it without the rubber washer, don't ask me how I know this.)3) Once this is tightly attached (hand tight, that is), compressing the rubber washer somewhat, attach the connection that went from the toilet to the water supply to the bottom of the valve--note this will make the connection about two inches closer to the floor, so this may require either more bend in the flexible hose or some other adjustment in the water supply line. (The kit provides a second compression washer, but my (plastic) fitting was slightly different. You will not require this second washer unless you remove a similar washer from your existing fitting. Remember to do the three wraps of teflon tape for the smoothest connection.) Again, you are making a compression fitting, so it needs to be firmly tight, but not torqued--e.g., what is known as hand tight.) The connection for the spray hose should remain facing toward the front of the toilet.4) Attach the spray nozzle to the hose on the end that looks fancy. (You will have to remove the blue plastic inserts that were on the ends of the hose for shipping. You will note that the steel sheath is actually separate from the hose inside, which comes with compression washers fitted to the ends. Again, best practice is to wrap the threads three times with the teflon tape. It will look best if you are careful to keep the teflon tape on the threads, but not covering the end that will seal with the compression washer or sticking out past what will be covered when you (hand) tighten the hose onto the nozzle.)5) Attach the hose to the valve under the toilet bowl. (Three wraps teflon tape, firmly \"hand\" tight, placing the spray nozzle in the right orientation for use, since there will be no free swivel once connected.)6) Turn on the water supply, check for leaks. Turn on the valve for the spray nozzle, check for leaks. Spray into the toilet, so you get the feel for how to modulate the intensity of the flow by how far you depress the lever.7) Hang the spray nozzle hanger either on the toilet etc or remove the hanger bracket and mount the holder/holster to a convenient wall.USE: There are three common uses, yeah, even four. The fourth is cleaning dirty cloth diapers.WATER: It turns out that because these parts of the body stay so warm, and the water can be applied so gradually if you just barely press the lever, that even though we live in the mountains with cold water, we really feel no need to use warm water. This surprised me, as I have in the past only used this tool in places that are generally warmer. In the world as a whole, this is perhaps the preferred method for cleaning in the (not exactly mentioned) situations. This spray nozzle is a great improvement over the typical plastic nozzles I generally encounter around the world, because it is so much more adjustable--and did I mention, it looks too good to sell for what I paid for it. Perhaps they will raise the price if/when it catches on. When I wrote this, it was still cheaper than competing products, but has better specs. Surely this is too good to be true.In response to other reviews: I found the pressure to be easily and fully adjustable, but then I practiced with it pointed into the toilet bowl before I pointed it at...myself.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abdurrahman ULU",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGAMNGWAFLHTZ5QDHOEVTG7ZXDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P48K5DTMNGA8?ASIN=B0C3GR8B47",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Very usable and helpful for hygiene",
                "reviewText": "I absolutely suggest this bidet for all life places, it is very usable and brings more hygiene for my family and guests. Materials are in good quality and easily installed. Thank you for this wonderful hygiene product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ahmad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFS3OHWOBUQ433JUKOLPKS266HPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B2JX5KFCMJJQ?ASIN=B0C3GR8B47",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars You need this!!",
                "reviewText": "So easy to install I let the kids hook it up. So convenient.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bbqeen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPPAU4BFOHHIRFCJNU7UM2FANTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1B69GU8F25Q5G?ASIN=B0C3GR8B47",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Squeaky Clean!",
                "reviewText": "Installation was easy, comes with clear directions with pictures. Took 10 mins tops. I initially had an issue with water running from between the sprayer and hose. Followed directions to remove snozzle and tighten screw but still found it leaked. Fixed the leak by applying plumber's tape and havent had an issue since. If you are using this for hygiene reasons, would definitely recommend some test sprays with the sprayer and make sure you have the right water pressure before cleaning. The water pressure is very strong on full blast. I have also found the included hanger to be pretty ineffective. The sprayer just barely balances on top of the hanger and doesn't hold it securely enough in my opinion. Other than that, I have had no issues.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "c'est la vie🎉😘c'est la vie🎉😘",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIOHAAJI7BOBSJGV2YIYRCZ3CCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1B1V6IK27FO6Q?ASIN=B0C3GR8B47",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2022",
                "reviewTitle": "5.0 out of 5 stars Easy to install and use, great quality and value handheld bidet sprayer",
                "reviewText": "The media could not be loaded. First of all, it was important to me that the device be stainless steel and not plastic, and it is indeed steel and feels very sturdy. The installation process was very simple and straightforward and only took about 10 minutes.Finally, the device works very well and is simple to use. I have no issues with the hose or faucet leaking, and it produces a strong spray of water.This is a beautifully made and carefully packaged product. I just installed one of these on one of my toilets that cannot accommodate a bidet seat and is located by itself in a toilet room with no electrical outlet or hot water. I admit I was hesitant to order something that used only cold water but it's absolutely fine.I found this easy to install and easy to use. Came with all attachments and fittings. Great quality.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/613+mHs5qLL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61dTbtX0NBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717VicKFT-L.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a050bdea-227a-4bbe-9d1b-35bb190cf30d/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Stephanie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI2J4EYH7S5DDUHACFJQDVK4U5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQRP29H813CJF?ASIN=B0C3GR8B47",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "1.0 out of 5 stars Leaks all over floor",
                "reviewText": "Purchased this product for our master bathroom. It was fairly easy to install and seemed nice enough for the price. I thought it was a great deal. Fast forward about an hour later....we go to use the bathroom and see that there's a massive puddle of water extending from the toilet room all the way out to almost the sinks and shower. There was an INSANE amount of water that was just leaking from the nozzle. We had not used it, and when we walked away after installing it was not leaking. The nozzle screw needs to be constantly tightened after every 2 or 3 uses, if not it leaks water again. If this continues I will un-install it and purchase from a different shop.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sunrise CircleSunrise Circle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETGSOE6YE5FT4H4FQHYEMUEJ4NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E0G4FRTL7HVM?ASIN=B0C3GR8B47",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2022",
                "reviewTitle": "5.0 out of 5 stars Solid and high end - easy install",
                "reviewText": "Transform your toilet habits instantly buy installing this bidet to your existing toilet. The holding clip sits neatly on the side of the tank for easy access. It hose has 2 spray pressures. I promise you that after using this for a week and experiencing this level of clean, you’ll not want to live without it. Bidets allow you to essentially wash your privares after each visit. You feel incredibly fresh afterwards! I would recommend for folks that live in hot climates like the South and MidWest USA where sweating is a daily activity and showers can’t be slipped. There’s also a wall mount option, but I like the toilet better. Don’t think twice about being clean, just get it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Tg--WbrfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71nMXGvQd8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71xtfZhFbzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 28, 2021",
                "reviewTitle": "Waist of money and time",
                "reviewText": "Waist of my money and time. I took so much time to install it as it came without any instructions. I have no idea why it is not pushing water up to my toilet tank. The T-valve probably is defected because it is leaking like a water fountain even after making it tight. I checked You tube videos as well to see if I am doing anything wrong, but guess what it is the product which is defected. Now I am not sure should I return it or buy a separate T- valve. I am probably returning it, unless i got any solution from the seller or any body who knows the problem.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zeeshan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 1, 2022",
                "reviewTitle": "Works as expected",
                "reviewText": "East to install and meets expectations.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hoda Yavari",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 6, 2021",
                "reviewTitle": "Usefull",
                "reviewText": "The media could not be loaded. Easy to use. But 3 way valve is different in Australian piping.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/C1AwD1gTHDS.mp4"
                }
            },
            {
                "reviewerName": "DS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 10, 2023",
                "reviewTitle": "The pipe leaks",
                "reviewText": "The pipe leaks even after adding washers, the pipe broke and there was water all over the house. very poor quality and wouldn't recommend at all.couldn't return it before the return window closed, the seller didn't reply when I sent a message either.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 13, 2022",
                "reviewTitle": "Very comfortable.-",
                "reviewText": "Very comfortable.-",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}