{
    "remaining_requests": 37437,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LUXE-Bidet-Plus-Next-Generation-Self-Cleaning/dp/B0B1GWXDXG",
    "body": {
        "name": "LUXE Bidet NEO 320 Plus - Only Patented Bidet Attachment for Toilet Seat, Innovative Hinges Clean, Slide-in Easy Install, Advanced 360° Self-Clean, Warm, Dual Nozzles, Feminine & Rear Wash (Rose Gold)",
        "price": "$62.99",
        "originalPrice": "$62.99",
        "rawPrice": 62.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LUXE-Bidet-Plus-Next-Generation-Self-Cleaning/dp/B0B1GWXDXG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B1S3DMPG"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B1H3YKSN",
                "variationName": "Color",
                "variationValue": "Chrome",
                "price": "$62.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31hv-wOcrfL._SS36_.jpg"
            },
            {
                "asin": "B0B1GWXDXG",
                "variationName": "Color",
                "variationValue": "Rose Gold",
                "price": "$49.91",
                "variationImageURL": "https://m.media-amazon.com/images/I/31g5j8QuiTL._SS36_.jpg"
            },
            {
                "asin": "B0B1H1B66M",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$60.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31poQ2zfmSL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31g5j8QuiTL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41DkBWB54aL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aYA3PzzgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fltA6pVCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EuY KmhtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31x Dqo9p4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/817RmzHwPhL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the LUXE Bidet Store",
            "link": "https://www.amazon.com/stores/LUXEBidet/page/4FDE87B6-8205-49FA-B7DA-22AAB032E84E?ref_=ast_bln"
        },
        "brand": "LUXEBidet",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1058,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 5 hrs 42 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "NEVER-BEFORE-SEEN INNOVATION – The only bidet that flips up and out of the way for easy cleaning of hard-to-reach spots. Activate the 360° Self-Cleaning mode for panoramic cleaning of both the guard gate and nozzles.",
            "FASTEST, EASIEST INSTALLATION – Patented, U-shaped adjustment plates allow for quick and easy installation without removing the entire toilet seat. Stainless steel hinges allow for adjustments even after installation. Compatible with LUXE Toilet Seat.",
            "COMFORTABLE MODES – Experience the luxury of warm water temperature adjustments and dual nozzles for rear and frontal wash, perfect for monthly cycles and expecting mothers.",
            "SLEEKER, MODERN LOOK – New low-profile, compact design comes in three premium finishes: White, Rose Gold, and Chrome. Features ergonomic knobs and improved water pressure control.",
            "WARRANTY & SERVICE – All LUXE Bidet NEO Plus bidets include an 18-month manufacturer’s warranty that can be extended to 2 years by registering your product on the LUXE Bidet website."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b/ref=dp_bc_aui_C_3?ie=UTF8&node=680350011"
            },
            {
                "name": "Bidet & Bidet Parts",
                "link": "https://www.amazon.com/Bidet-Bidet-Parts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6810562011"
            },
            {
                "name": "Bidet Attachments",
                "link": "https://www.amazon.com/Bidet-Attachments/b/ref=dp_bc_aui_C_5?ie=UTF8&node=6810564011"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Rose Gold"
            },
            {
                "name": "Brand",
                "value": "LUXE Bidet"
            },
            {
                "name": "Material",
                "value": "Acrylonitrile Butadiene Styrene (ABS)"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Shape",
                "value": "U-Shape"
            },
            {
                "name": "Product Dimensions",
                "value": "17.7\"L x 7\"W"
            },
            {
                "name": "Item Weight",
                "value": "2.38 Pounds"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Manufacturer",
                "value": "‎LUXE Bidet"
            },
            {
                "name": "Part Number",
                "value": "‎NeoPlus320rg"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎NeoPlus320rg"
            },
            {
                "name": "Pattern",
                "value": "‎Toilet Seat"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Included Components",
                "value": "‎Standard LUXE-Hinge Covers, Hot Water Cap, Hybrid Cold Water T-adapter – 7/8″ x 7/8” x 3/8″, Plastic Wrench – 3/8″ x 7/8″, NEO 320 Plus Bidet Attachment, Metal Hot Water T-adapter – 3/8” x 3/8” x 8mm, 15-inch Metal Braided Cold Water Bidet Hose – 3/8″ x 3/8″, Plumber’s Tape for a snug and secure installation, 10-foot Polyurethane Hot Water Bidet Hose – 3/8” x 8mm, LUXE Toilet Seat LUXE-Hinge Covers"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B0B1GWXDXG"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,058 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,799 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #17 in Bidet Attachments"
            },
            {
                "name": "Date First Available",
                "value": "May 17, 2022"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "What is the difference between NEO 320 and NEO 320 Plus? Both are hot water models that come with rear wash, feminine wash, and self-clean modes, however the NEO Plus features an upgraded Advanced 360° Self-Cleaning Mode. All NEO Plus models come with Lift-to-Clean and Slide-in Installation features. Is it hard to install the NEO Plus to my toilet? The patented EZ-Lift Hinges on the NEO Plus make installation quick and simple, without having to remove your toilet seat. Combined with our first-class LUXE Customer Support team, you never have to worry with a LUXE Bidet. What is Advanced 360° Self-Clean Mode, and how is it different from the self-clean modes of other bidets? Only NEO Plus Series bidets come with this innovative cleaning mode. Now upgraded to flush debris off not only the bidet nozzle(s), but also the Guard Gate as well. This feature is designed to help you maintain the bidet in between routine upkeep. Which toilets are compatible with the NEO Plus Series? Is there a weight limit for NEO Plus bidets? The NEO Plus is compatible with most 2-piece toilets and some 1-piece toilets, and works with most toilet seats including the LUXE Toilet Seat. Check the above NEO Plus Fit Chart prior to purchase. The weight limit for NEO Plus bidets is 300 lbs. Can I install the NEO Plus Series bidet with the same parts from my NEO Series bidet? For LUXE Customers upgrading from a NEO to a NEO Plus Series bidet, please use the new parts included with your kit. NEO Plus Series bidets come with Standard 3/8\" Fittings, which are different from NEO Series 1/4\" fittings.",
                "media_link": []
            },
            {
                "media_text": "LUXE Bidet Products NEO 320 NEO 320 Plus LUXE Toilet Seat Features Retractable nozzles, protective guard gate, and built to fit most toilet setups. Features Slide-in Installation, Advanced 360° Self-Clean Mode, and Lift-to-Clean Hinges. Features Soft-close, quick-release, and designed to fit any bidet attachment. Why This LUXE Bidet's original best-selling bidet, with over millions of customers. Why This LUXE Bidet's innovative bidet with never-before-seen patented features. Why This Seamlessly install with any bidet attachment or as a normal feature-packed seat.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1969c0e2-e773-4613-a5d1-0da9ac1a0a03.__CR0,0,600,450_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0fe6a631-8269-451b-84e1-5fec770185a7.__CR0,0,600,450_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8710f4f1-64d9-4574-bac6-2a56f9da09d0.__CR0,0,600,450_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e2968717-6c61-4fb8-af4a-a0a4d915dada.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a944bc9b-e697-4ed7-b4da-7fa47ec6754e.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/33008983-8af2-4b3b-b7bf-2aa78c1f203e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1969c0e2-e773-4613-a5d1-0da9ac1a0a03.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0fe6a631-8269-451b-84e1-5fec770185a7.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8710f4f1-64d9-4574-bac6-2a56f9da09d0.__CR0,0,600,450_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JennieJennie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDHY2IWX4PTKY6OCCWRHPWZDPIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JGLAWQXYXHIT?ASIN=B0B1GWXDXG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Great upgrade, and if I can install it, anyone can. (Don't bet on 10 min though.)",
                "reviewText": "I've been low-key wanting to add a bidet attachment to my toilet for a while now and finally got around to doing my research and decided to go with this one as a high-quality but affordable option. I decided to get the one that gives you warm water even though there's an extra (plumbing-related) step to installation.I had some trepidation about the installation, as I am SO far from a plumber or handyman or even DIY kind of person, and unscrewing pipes freaks me out. The installation definitely took longer than the advertised 10 minutes; however, it was not impossible and I did manage to get it done in about 30-45 minutes total (though I took a break to eat lunch during a moment of frustration so not sure exactly how long it actually took since I wasn't paying that much attention).The instructions were clear and easy to understand by and large--much more so than what you usually find with instructions on things like this--and you can also see little step-by-step videos on their website if you run into problems. I did run into a couple of issues. I didn't have any problem with the first few steps of the installation--setting up the attachment on the toilet, hooking up the cold water line.Where I ran into problems was on the second part, connecting the hot water under the sink. The first time I tried to connect it, I guess I didn't get the hot water tube all the way onto the T-valve firmly enough, so when I tried turning on the bidet, it shot right out and was spraying water furiously from under the sink (fortunately, the stream went straight into my bathtub so didn't create too much of a mess! but word to the wise--make sure that hot water tube is ALL THE WAY on and flush with the threads; it's hard to get on there, don't think, \"Oh this is probably good enough,\" just keep pushing it harder).That was easy enough to fix (and easy enough to identify where the problem had been). So I fixed that, put everything together, tried the bidet again, and it worked great. But then I noticed that there was a (small but persistent) leak around the T-valve under the sink. Can't have that. This time, it was not as readily apparent what the problem was. I tried tightening everything as much as I could (again) but it was still leaking (and I couldn't even tell exactly where from), so I ended up having to take the whole thing apart again (just the hot water T-valve under the sink, not the entire bidet or anything), put more plumbers tape, and screwed everything back in as tight as I could get it. I guess that must have been the problem before (not tight enough somewhere, or needed more plumbers tape?) because this time it worked...the bidet works great and no leaking (at least not that I've seen yet).My advice for people like me who are intimidated by DIY projects: You can definitely do this, at least if you have access to all the water sources and connections you need, and it can be a one-person job (I did it alone), but expect it to take at least half an hour (don't do it when you're in a rush) and just be patient...As for the bidet itself: It's been less than 24 hours but so far I love it. I don't know if this has to do with the water pressure at my house or the bidet, but the flow is STRONG, so use caution when you try it out the first couple of times--it can blow you away; open it slowly--and (lesson learned) don't test it out when you're not actually sitting on the toilet, unless you want it to spray your wall. It does not stay in the toilet if there's no butt there to catch the spray.But I can definitely see that this is going to both save a lot of toilet paper while also making me feel cleaner, because let's face it...as one of my Italian friends said one time in explaining the value of a bidet to ignorant Americans like me and my friends...if you accidentally put your hand in dog poo, would you feel clean enough just wiping it off with paper, or would you want to use water? Fair analogy and I think the answer is pretty obvious. Team Bidet 4 Life over here!",
                "reviewVotes": "112 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61vRBehJH-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQJCFVXPGO5BW45RPACEWYIBBRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EP31D3PZ8QA9?ASIN=B0B1GWXDXG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2023",
                "reviewTitle": "5.0 out of 5 stars new design, still excellent performance",
                "reviewText": "I have had the 320 model for almost 6 years but the previous design. the only problem I've ever had was the the sprayer is supposed to plunge back up into its housing where it's in a stored position. due to hard water it begins to stick after a year or so. i live in the central US and we typically have hard water so that is why that issue occurs(I'm assuming).The positives: both hot and cold water(i turn it to the cleaning mode and turn the valve to total hot while using restroom to let hot water get to the valve, then turn to cleaning mode). excellent pressure, cleans well every time. Nice design both in functionality and this updated model is a nice jump in aesthetic appeal. I haven't had one malfunction, outside of the plunger issue, 1 time. The hardware that comes with it, to connect to your plumbing, is easy enough. My only recommendation is to make sure you thread everything by hand first so that you dont cross thread the plastic components(and be patient w/ this). This new design swings up as well which makes it so much easier to clean the toilet. I have only had this updated version for a month, so im not sure how it will hold up in the long range compared to the old model, but so far it is doing great comparatively. If i ever have problems I'll make sure to update this review.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David S.David S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAANIOJRRTCJ6JPZYOUF6SOATAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R163EVA8AB7FRE?ASIN=B0B1GWXDXG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Self-Cleaning Spigots and Easy to Clean",
                "reviewText": "The media could not be loaded. For someone who isn't a plumber, installing a bidet is a day-long, sweaty project after all the parts have been set out and figured out. There will likely be many parts that go unused. Hold onto them as spares, and keep them with the old bidet as a backup. This is my second Luxe Bidet. The quality is good, though the installed product has a delicate feel. Be careful as you install and use it.The instructions, like many whose authors are keen on showcasing their consummate knowledge, contain far too much information, which obfuscates the practical guidance. I ended up setting them aside and figuring out visually which parts go where. There are many parts but figuring them out visually is an order of magnitude simpler than reading and understanding the instructions, which are written to cover every case. This makes it very difficult to abstract the instructions that apply to your particular case, and to figure out which parts they correspond to.Start by turning off the wall valve and draining the tank into a bucket. Then pour out the bucket and keep it under the tank outlet to catch additional drippage.Since I don't have hot and cold output from my tank, I inferred that the supplied end cap is to cap off the hot input (pictured) to the bidet. I then had to use my vice grips and the supplied plastic wrench in tandem to unscrew the tank outlet valve and install the new one. This is sweaty work which, for a non-plumber, has to be painstakingly re-learned from the last installation, especially when the toilet is in a corner that restricts free access to the plumbing. I had to feel my way to aligning the threads so that they would catch and screw in straight. Take care not to strip or damage the nylon threads against the metal threads. The materials are nevertheless a good choice, as they prevent corrosion over time and maintain a water-tight seal. Once that's done, the rest is fairly easy, but that's a big \"once\".The installed bidet is just about as easy to use as the old version, though the main control switch seems more delicate. This main control switch sits closer to the rim than the last model, which makes it hit against your leg unless it is swung out of the way. The old model did not have this problem and seemed mechanically more sound. The main advantage as stated is that this newer model has a self-cleaning spigot and swings out of the way so you can easily clean under it. That's a big advantage that allows the whole assembly to be kept sparkling clean with spray cleaner and a few wipes of a paper towel.The double-height lid bumpers, sold separately, are a must. Position them carefully to ensure they don't slip off the toilet bowl under any usage modes. But them up next to the rim's own pre-installed bumpers for mechanical support. Use super glue to supplement the self-adhesive backing, which won't hold on its own over the long term.Provided the plumbing is well tightened and secure, the end result is well worth the day-long installation effort. It should last you until the next model comes out without the need for additional plumbing adjustments. There is of course play in the mountings which allows for minor adjustments but that's just a convenience based on long industry experience.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71v5kfHsokL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e2629c1-43dd-48ea-9ec7-293414c483cb/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Lifes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENABDWT2BK3GN6YP4HMUMB2FGBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RKZ1SDAONJI8?ASIN=B0B1GWXDXG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Refreshing",
                "reviewText": "The Luxe Bidet is very soothing and I love the way you can adjust the pressure. It is perfect and at an affordable price. I wouldn't look anywhere else if you are budget conscious. Think about the pros of this unit: temperature control, pressure control, easy hookup, attractive, no worries about it being battery or electrically-operated. It has everything for a budget conscious person. So glad I found this after looking at many units. I feel I made the right decision.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "claudia silva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 20, 2023",
                "reviewTitle": "incompatible con entrada de agua caliente en MEX",
                "reviewText": "Dejando de lado que no pude conectar el agua caliente debido a que la T que mandan no es de la medida estandard de mexico, lo demas bastante bien.La T que va a la manguera de la taza si es medida estandard. Por lo cual se me hizo muy extraño que la otra no. Si consigo la pieza facilmente, subire la calificacion, pero si no, se queda a la mitad xq solo podre usar “la mitad” de producto 🥲",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beverly Y.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 9, 2023",
                "reviewTitle": "The whole family loves it!",
                "reviewText": "The product was very well packaged and installation was straightforward. Just keep in mind to have extra Teflon tape and a couple of hours to install and test. The Luxe bidet is easy to use and has worked well for everyone in the family. Getting warm water is easy by just running the tap at the sink first. And being able to adjust the temperature on the Luxe is well appreciated because the water can get too hot! Cleaning is simple with the lift-up hinge and we like that it does not rely on electricity to get a warm water wash. We love it so much that we are ordering another one for the other washroom.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "trebuh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 4, 2024",
                "reviewTitle": "US Anschlüsse",
                "reviewText": "Meine Wasseranschlüsse sind ca. 2m weg. Ich habe mir 2m 3/8 Zoll Verlängerungen besorgt. Passt nicht zusammen. Anschlüsse an Bidet sind keine 3/8 Zoll => Rücksendung.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Count Simon G Smith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 15, 2023",
                "reviewTitle": "Useless to UK market",
                "reviewText": "The plumbing threads are American and don't fit UK threads, I was unable to source an adaptor which would fit so totally useless item.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 29, 2024",
                "reviewTitle": "Easy to install and works great",
                "reviewText": "I was surprised how easy it was to install. I did have to order seat lift bumpers.Very easy to use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$62.99",
                "sellerName": "Luxe Shop",
                "sellerRating": "5"
            }
        ]
    }
}