{
    "remaining_requests": 37630,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TOTO-Two-Piece-Elongated-Universal-CEFIONTECT/dp/B0999Q23WQ",
    "body": {
        "name": "TOTO Drake Two-Piece Elongated 1.6 GPF Universal Height TORNADO FLUSH Toilet with CEFIONTECT, Cotton White - CST776CSFG#01",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/TOTO-Two-Piece-Elongated-Universal-CEFIONTECT/dp/B0999Q23WQ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31ZZ08YXmBS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31SpVA0io8S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41A9mmbE1sL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fJMyPdU9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-8pQScsNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41REUbONdIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dYC7N9 mL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the TOTO Store",
            "link": "https://www.amazon.com/stores/TOTO/page/B123FCFC-ED54-45A5-870A-32AA77BA4B73?ref_=ast_bln"
        },
        "brand": "TOTO",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 516,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "POWERFUL PERFORMANCE WITH LESS FREQUENT CLEANING - TORNADO FLUSH swirls water in a circular pattern to fully wash the bowl surface. CEFIONTECT is an ultra-smooth glaze that minimizes waste from sticking so that it is easily washed away..Trap Seal : 2-1/8\". Minimum Water Pressure 8 psi (Flowing)",
            "MORE COMFORT ACROSS A WIDER RANGE OF INDIVIDUALS - TOTO's Universal Height is taller than a standard toilet and makes sitting down and standing up easier for many people. Universal Height models are capable of meeting the ADA height requirement.",
            "REDUCE WATER USEAGE WITHOUT SACRIFICE - The 1.6 gallon per flush Drake enables you to save water without worrying about diminished performance. The Drake features a wide 3 inch flush valve and a siphon jet bowl that gets the job done in one flush.",
            "STYLISH AND MODERN DESIGN - Update your oasis with this stylish design that couples well with any bathroom décor. The elongated bowl provides added space for comfort. The toilet fits into 12 inch rough-in installations and has a left-hand trip lever.",
            "COMPLETE YOUR TOILET - Finish your purchase with the addition of a TOTO SoftClose seat or upgrade to a WASHLET bidet seat. Drake tank and bowl with hardware included. Purchased Separately: Wax ring, flange bolts, and water supply lines."
        ],
        "description": "The TOTO® Drake® Two-Piece Elongated 1.6 GPF Universal Height TORNADO FLUSH® Toilet with CEFIONTECT® is a beautifully designed high profile toilet. The Drake features TOTO’s TORNADO FLUSH®, a rimless, hole-free design with dual-nozzles that creates a centrifugal washing action that assists in rinsing the bowl more efficiently. This version of the TOTO Drake includes CEFIONTECT®, a layer of exceptionally smooth glaze that minimizes waste from sticking to the ceramic. CEFIONTECT, coupled with TORNADO FLUSH, assists to reduce the frequency of toilet cleanings, minimizing the usage of water, harsh chemicals, and time required for cleaning. This version of the TOTO Drake is designed in TOTO’s Universal Height, which allows for a more comfortable seat position across a wide range of users. This version of the Drake has a left-hand chrome trip lever and is ADA compliant. The Drake bowl and tank set includes a tank to bowl gasket, tank to bowl hardware, and toilet bolt caps. Additional items needed for installation and use must be purchased separately: wax ring, toilet mounting bolts, water supply lines, and toilet seat.",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b?ie=UTF8&node=680350011"
            },
            {
                "name": "Toilets & Toilet Parts",
                "link": "https://www.amazon.com/Toilets-Toilet-Parts/b?ie=UTF8&node=6810474011"
            },
            {
                "name": "Toilets",
                "link": "https://www.amazon.com/toilet/b?ie=UTF8&node=680355011"
            },
            {
                "name": "Two-Piece Toilets",
                "link": "https://www.amazon.com/two-piece-toilets/b?ie=UTF8&node=542639011"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Cotton White"
            },
            {
                "name": "Product Dimensions",
                "value": "28.38\"D x 17.19\"W x 30.13\"H"
            },
            {
                "name": "Material",
                "value": "Ceramic"
            },
            {
                "name": "Brand",
                "value": "TOTO"
            },
            {
                "name": "Installation Type",
                "value": "Floor Mounted"
            },
            {
                "name": "Shape",
                "value": "‎Elongated"
            },
            {
                "name": "Seat Material Type",
                "value": "‎Plastic"
            },
            {
                "name": "Manufacturer",
                "value": "‎TOTO"
            },
            {
                "name": "Part Number",
                "value": "‎CST776CSFG#01"
            },
            {
                "name": "Item Weight",
                "value": "‎32.2 pounds"
            },
            {
                "name": "Item model number",
                "value": "‎CST776CSFG#01"
            },
            {
                "name": "Size",
                "value": "‎1.6 GPF"
            },
            {
                "name": "Style",
                "value": "‎Modern"
            },
            {
                "name": "Pattern",
                "value": "‎Toilet"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Certification",
                "value": "‎ADA"
            },
            {
                "name": "Included Components",
                "value": "‎Toilet Tank, Toilet Bowl"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B0999Q23WQ"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 516 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,412 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #1 in Two-Piece Toilets"
            },
            {
                "name": "Date First Available",
                "value": "July 13, 2021"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Us At TOTO, we design simple, brilliant, elegant solutions for basic human needs. That means a TOTO bathroom is always more than a routine. It’s a ritual where every innovation, every detail, is designed with you in mind. For over 100 years TOTO has been dedicated to improving lives around the globe through tirelessly designing and engineering products that deliver innovative technology while still maintaining the beauty expected from TOTO. POWERFUL PERFORMANCE, DEPENDABLE CLEAN Drake Two-Piece Elongated 1.6 GPF Toilet The Drake Two-Piece Elongated Universal Height TORNADO FLUSH Toilet with CEFIONTECT is intentionally designed with cleanliness in mind. The Drake features a rimless, hole-free design with dual nozzles that create a highly efficient centrifugal washing action for better bowl rinse after each flush. With the assistance of the CEFIONTECT exceptionally smooth glaze, waste is minimized from adhering to the surface, helping the toilet bowl to stay cleaner longer. ADA Compliant to serve the needs of everyone without additional adaptation. Designed with quality materials to ensure longevity and durability. Available in additional colors and features to maximize benefits and coordinate with all bathroom spaces. Complete the set with a SoftClose seat or upgrade with an electronic WASHLET bidet seat.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f3d10b20-6c3c-4753-ae93-e258cb82c3ab.__CR0,0,300,400_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e1ddd708-c4c6-4e91-8f06-69dbf4607095.__CR0,0,350,175_PT0_SX350_V1___.png"
                ]
            },
            {
                "media_text": "Effective, Efficient, and Environmentally Focused Cleaning System Powerful Flushing System Our TORNADO FLUSH flushing system generates 360-degrees of cleaning power that reaches every spot. Advanced Clean Technology Our CEFIONTECT ceramic glaze minimizes waste from sticking to porous ceramic surfaces. Improved Water Spot A large water spot that reduces the places where waste can cling to the bowl. Simplified Cleaning The rimless design eliminates places where waste can build up and makes it easier to clean.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b2800954-c143-4703-ba0b-424bbbe9666c.__CR0,0,220,220_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e1c22836-1ac5-4d63-8961-9ca01e4df11f.__CR0,0,220,220_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/06bc13d6-9a28-4916-88df-1cfe877d346c.__CR0,0,220,220_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/dc372543-d9ed-4e12-9501-173ea61a28e0.__CR0,0,220,220_PT0_SX220_V1___.png"
                ]
            },
            {
                "media_text": "Everything You'll Need to Experience Next-Level Clean Everything you need is within reach! This model will come with both tank and toilet bowl included. Simply purchase compatible seat, installation hardware and wax ring. Elevate your experience by upgrading to one of our TOTO WASHLET Electronic Bidet seats, delivering next-level clean and a pampered spa-like feeling after each use.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/34ac4114-02d7-40da-b3de-c374f77801ac.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Choose the Drake That's Right for You! Newly Designed with Everyone in Mind TOTO's Drake Toilet comes in a variety of options to fit your unique needs and complement your bathroom space. Available in standard or Universal Height, 1.28 or 1.6 GPF, 10 or 12 inch rough-in sizes, and with trip levers located on the left or right side of the tank.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a9952b67-b679-4dd9-abf5-0a455bbd4e20.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/79343c5d-9aad-48f8-954e-fae5559dcbbb.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f3d10b20-6c3c-4753-ae93-e258cb82c3ab.__CR0,0,300,400_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e1ddd708-c4c6-4e91-8f06-69dbf4607095.__CR0,0,350,175_PT0_SX350_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b2800954-c143-4703-ba0b-424bbbe9666c.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e1c22836-1ac5-4d63-8961-9ca01e4df11f.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/06bc13d6-9a28-4916-88df-1cfe877d346c.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dc372543-d9ed-4e12-9501-173ea61a28e0.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/34ac4114-02d7-40da-b3de-c374f77801ac.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a9952b67-b679-4dd9-abf5-0a455bbd4e20.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "HBS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETFAOMK4N2AQD4V6FKBPV5EWNYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D1QOGHAVGCDG?ASIN=B0999Q23WQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Packaged well",
                "reviewText": "The toilet was packaged very well. Bowl came in custom styrofoam 2+in surround. Tank came in box with 2+in blown foam corners. Although one exterior box arrived with a giant hole in the side and both boxes were left upside down, the toilet was not damaged. Very pleased. Good style, easy to install, quality glaze, stays clean, and is affordable. Seems to be clean with water only, which has been fine so far since it actually doesn't get very dirty to begin with. Flush is kind of loud, but fast to refill. A nice upgrade!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael GmirkinMichael Gmirkin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AET5XEZGTUIUZB32HVDPNCAHTYBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBFORD84DX8UP?ASIN=B0999Q23WQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2023",
                "reviewTitle": "5.0 out of 5 stars So far so good. It's a toilet. Seems to do what it says...",
                "reviewText": "Okay, so after doing some research during a bathroom remodel, replacing an old, low, janky \"rounded\" toilet, I decided to buy the TOTO Drake [original] single-flush 1.6 GPF [gallons per flush] \"universal height\" [slightly higher sitting for us tall folks] \"elongated\" toilet with Tornado Flush, or whatever it's called, here on Amazon. And I picked up a nice Bemis elongated slow-close toilet seat/lid with nickel hinges (same as the other toilet) from Home Depot, since I used it on another toilet and liked the design, materials, and slow-close.Anyway, had my handyman brother install it with a Better Than Wax rubber gasket between the toilet and flange. Seemed like it was done relatively quickly. So, presumably, if you know what you're doing, it's reasonably easy to install?So far, I've not had to actually scrub / clean it yet. It's only been installed a week or so. But, so far no problems, no tank flange/seal leaks, no external drips/leaks, etc. Time will tell if any develop. But, so far, it seems to be doing nicely.Some advertising materials indicated a large \"water spot\" in the bowl [as opposed to some where there's nearly no water in the bowl], but I couldn't ever really get a good sense of what that meant from online materials. So, I've included a picture with the general water level in the bowl when the tank & bowl are filled and off, for reference, in case it helps anyone else.It's a reasonably large \"water spot,\" contra some where the water just sits down at the very bottom and the rest of the bowl is dry, which can lead to bits hanging on for dear life. So far, that hasn't been an issue with this toilet. In the old bowl (with regular rim holes that just point downward), it was. With the new bowl it has kinda' like two swirly jets from the tank toward the top of the bowl, with another jet that pushes stuff directly into the drain pipe and a relatively rimless design, and it's stayed pretty free of bowl debris so far. And it seems like it'll be easy to clean without having to guess whether the under-rim area is clean or not (since it doesn't have an overhang for stuff to get under, just the bowl sides and two water jet outlets that swirl water into the bowl). Whether it will remain free of clinging debris over the long term remains to be seen, but so far so good...Since it hasn't clogged yet, I can't tell if the space between the existing \"water spot\" [which takes up about half the bowl height (+/-)] and the lip of the bowl is sufficient to hold the water contents of the tank, if it did clog, or if it would overflow, strictly between the \"water spot\" + water from the tank. Kind of hope never to have to find out. (o_0)The tank seem to refill fairly quickly. Can't say whether it's louder or quieter than other tank refills. There's definitely refill sound. Don't know that I'd say that it's overly loud, which I guess means it's reasonably quiet. You definitely still hear it, so it's not like it's silent. But it's not terribly obtrusive and tends to be fairly quick, IMO.Overall, so far, I'm not disappointed by it. It's cleared everything I've put in it so far, as far as toilet paper and such and hasn't clogged one yet. Unlike the old small round toilet which would have a hard time clearing much of anything and frequently clogged with fairly, I think, average amounts of T.P. As far as that goes, I'm pleased so far, not having had to plunge it yet once. That's a nice change of pace. Hopefully that keeps up. Haven't explicitly tried flushing huge piles of T.P. like some advertising suggests it's capable of to see if it actually clogs, or of the swirling action successfully clears it. Maybe I'll try it sometime and get back to you... ;)",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61cRiOv7BcL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacob M. Jackson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGEHV3FNN5C2DEOFZLYQ3MJ5SUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2519KAAV3O01F?ASIN=B0999Q23WQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Should have bought this thing years ago!!",
                "reviewText": "Iv avoided buying a new toilet for so long, because the sewage pipe was just over 11\" from wall, and I still had a 3+ that gave a full flush almost everytime!! Well this new one is worth every penny, it even has a better flush with wat less water, it setback is perfect, and love the rimless bowl, so much easier to clean! No hidden spots, get the over price toilet seat with it.. it's worth the extra money! Also the tank lids flush, not over hanged.. give a clean look! I am worried about the flush Mechanism in the tank, it's a bit complex turn normal and probably will be $$ to replace, on average are water hard and have to replace the old ones every two to three years.. let's see how well it's holds up before I replace the other ones..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3I5FVNV2K5BFOKSPMCX5E4QCZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9QHOLFHWDLRG?ASIN=B0999Q23WQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Works great",
                "reviewText": "I like this toilet because it flushes very easily and it refills very quickly. I wish it came in a higher model. I’m 5’3” and it’s almost too low for me.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carl SCarl S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLP7PI2EQHBUXHHKCO2LREVJAMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYLK06TKZW0KC?ASIN=B0999Q23WQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Fantastic Upgrade!",
                "reviewText": "The media could not be loaded. We're remodeling two bathrooms and needed new toilets. We decided to go with the Toto Drake with \"Tornado Flush\"! Who wouldn't want that?These toilets are quite the upgrade to the cheap builder-installed toilets that were in the house. They're stylish, fit and finish is perfect and they have lots of features that make them easy to install and maintain. The height is perfect. And the \"Tornado Flush\" works great!Everything was pre-installed in the tank, too. Just install the tank on the lower half, hook up the water, put the lid on and have at it. All the parts seem to be really top quality and nothing required adjusting from how it was installed from the factory. It fills quickly and quietly.The installation instructions were clear and concise. The process was very easy. We're really happy with these toilets.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61EbTUblJKL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1bbd80d2-8c1d-40a9-bece-65ddb60138b5/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Dr. Dan Meyers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEFMGUMONMKSAMYGTLDLDIESHEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1U2ZJE5KWJI9T?ASIN=B0999Q23WQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2023",
                "reviewTitle": "5.0 out of 5 stars The ULTIMATE Throne",
                "reviewText": "UPDATE on 12/7/2023:Still more impressed than I expected. I've had about a dozen people over my house that wanted to know the model number. How many people ever ask you about your toilet? For me, exactly ZERO - until I got this. And good luck clogging it. My three year old nephew thought it would be \"funny\" to flush a full sized hand towel down the toilet. We're taking a highly absorbent full sized bathroom hand towel. When my sister told me I was so upset, i almost threw up. I called my plumber and he told me to keep an eye on it and if it got backed up to turn off water and call him right away. Guess what? That was two weeks ago and many flushes ago. It did not clog. Let me say that again: A full sized hand towel did not clog this toilet. My old toilet clogged on two wads of toilet paper. This thing is a BEAST!ORIGINAL REVIEW:I did two months of research before replacing two new toilets. Spoke to every major toilet manufacturer. Many plumbers. The end result? The Toto Drake Elongated Standard Height. 1.6 gallon flush. Absolute perfection. Replaced junk 1.26 gallon 2000 year models and it's a difference of night and day. I could go into turbo flush power, almost silent flush, bowl washdown that cleans the bowl with every flush, virtual inability to clog, special coating that allows you to clean with just a wet rag and a little dish soap, seat comfort, etc etc but I’m not going to. Just get this and look no further.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda S. Harding",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCCFGIYMFCPLLHOABEWOR3P6BSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5JO3M9SNMXPK?ASIN=B0999Q23WQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars The best toilet ever!",
                "reviewText": "If I had the money. I would replace all my toilets with Toto toilets! All around great flush and well made!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}