{
    "remaining_requests": 37447,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Luxe-Bidet-Neo-180-Non-Electric/dp/B00JG2824E",
    "body": {
        "name": "LUXE Bidet NEO 180 - Self-Cleaning, Dual Nozzle, Non-Electric Bidet Attachment for Toilet Seat, Adjustable Water Pressure, Rear and Feminine Wash, Lever Control (White)",
        "price": "$43.50",
        "originalPrice": "$47.73",
        "rawPrice": 43.5,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Luxe-Bidet-Neo-180-Non-Electric/dp/B00JG2824E",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00KRL5WBE"
        ],
        "asinVariationValues": [
            {
                "asin": "B00A0RMQ1E",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$43.50",
                "variationImageURL": "https://m.media-amazon.com/images/I/31VIOz3bBdL._SS36_.jpg"
            },
            {
                "asin": "B00JG2824E",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$37.30",
                "variationImageURL": "https://m.media-amazon.com/images/I/315VwAIYP3L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/315VwAIYP3L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41cZJopFVyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517-CPoGF8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-OlK8xeVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Tof4kdFsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rGUKtMRPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A14XffTSGML.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the LUXE Bidet Store",
            "link": "https://www.amazon.com/stores/LUXEBidet/page/4FDE87B6-8205-49FA-B7DA-22AAB032E84E?ref_=ast_bln"
        },
        "brand": "LUXEBidet",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 9073,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 3 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "DUAL WASH MODES – The rear wash sprays a stronger flow towards the rear. The feminine wash sprays a softer flow towards the front. The feminine wash also helps to keep you clean during monthly cycles and comes in handy for new or expecting mothers.",
            "HYGIENIC PROTECTION – The guard gate is designed to shield the nozzles for your ultimate sanitary experience. The nozzles automatically retract behind the guard gate after each wash to ensure it is protected until your next use.",
            "THE ULTIMATE VALUE – With a sleek design and high-quality parts, our bidet attachment will give your bathroom a next-level look. Constructed with high-pressure valves with metal-ceramic cores and steel hoses instead of plastic.",
            "AN EASY HOME UPGRADE – Elevating your home with a luxurious element has never been easier. Includes ALL PARTS AND TOOLS to get your bidet up and running in minutes. Easily attaches to and detaches from any standard two-piece toilet.",
            "18-MONTH WARRANTY – Our world-class Customer Care team is always here to make sure you are 100% satisfied, so anytime you have problems or concerns about the products, we are just one call away. Register your bidet online and get an extended warranty."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b/ref=dp_bc_aui_C_3?ie=UTF8&node=680350011"
            },
            {
                "name": "Bidet & Bidet Parts",
                "link": "https://www.amazon.com/Bidet-Bidet-Parts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6810562011"
            },
            {
                "name": "Bidet Attachments",
                "link": "https://www.amazon.com/Bidet-Attachments/b/ref=dp_bc_aui_C_5?ie=UTF8&node=6810564011"
            }
        ],
        "productInformation": [
            {
                "name": "Recommended Uses For Product",
                "value": "Bathroom"
            },
            {
                "name": "Mounting Type",
                "value": "Wall Mount"
            },
            {
                "name": "Number of Handles",
                "value": "1"
            },
            {
                "name": "Handle Type",
                "value": "Lever"
            },
            {
                "name": "Installation Method",
                "value": "Single Hole"
            },
            {
                "name": "Finish Type",
                "value": "Polished"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Handle Material",
                "value": "Ceramic"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Warranty Type",
                "value": "limited"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 9,073 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,698 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #22 in Bidet Attachments"
            },
            {
                "name": "Brand",
                "value": "LUXE Bidet"
            },
            {
                "name": "Included Components",
                "value": "Neo 180 Bidet Body, ½” x ¼” Plastic Wrench, Teflon Tape, 7/8” x 7/8” x ½” Metal Cold Water T-Adapter, 15 inch – ½” x ¼” Cold Water Bidet Hose, 2 Adjustment Plates with Rubber Gaskets See more"
            },
            {
                "name": "Model Name",
                "value": "BidetNeo180sww"
            },
            {
                "name": "Model Number",
                "value": "Neo 180 white"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "17 x 10 x 3 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.1 Pounds"
            },
            {
                "name": "Installation Type",
                "value": "Single Hole"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Everything Included Out of the Box 1 2 3 4 5 6",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/012bb30a-cdd9-475f-8937-3104db33818a.__CR0,0,1464,600_PT0_SX1464_V1___.png"
                ]
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "LUXE Bidet Products NEO 180 NEO 185 Plus LUXE Toilet Seat FEATURES Retractable nozzles, protective guard gate, and built to fit most toilet setups. FEATURES Slide-in Installation, Advanced 360° Self-Clean Mode, and Lift-to-Clean Hinges. FEATURES Soft-close, quick-release, and designed to fit any bidet attachment. WHY THIS LUXE Bidet's original best-selling bidet. WHY THIS LUXE Bidet's innovative bidet with never-before-seen patented features. WHY THIS Seamlessly install with any bidet attachment or as a normal feature-packed seat.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/581a1d90-135c-445e-9bd9-6ae4c3555dca.__CR0,0,600,450_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0831a8c-278f-4eba-9085-ee03a901d432.__CR0,0,600,450_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8710f4f1-64d9-4574-bac6-2a56f9da09d0.__CR0,0,600,450_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/371bd766-0c75-4cb4-8552-18725697ff6d.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9a91026-6e0e-4339-a2d1-e6c74eb4126a.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/012bb30a-cdd9-475f-8937-3104db33818a.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34a4284a-7679-4a1c-96c4-cc17159d7ec9.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0f23e8c1-a287-46d2-a45d-26dc0bc19cce.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/63444375-5279-4d04-99aa-85bd0e101967.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c5d3e6de-0519-46dd-906e-43b9a5360261.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5258951a-dc5f-412d-b4e4-591e33faebe9.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d37ee359-58ce-4a56-800e-daa1580fc16b.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7b603071-2d2e-4bc4-9b4b-43f17d3f5253.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/67b2d198-b698-418c-86f7-d037dba3e08c.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/581a1d90-135c-445e-9bd9-6ae4c3555dca.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0831a8c-278f-4eba-9085-ee03a901d432.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8710f4f1-64d9-4574-bac6-2a56f9da09d0.__CR0,0,600,450_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jason T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKEJIONM47HTRR7GXWQC2BFQTIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SHP1MYIN6SGD?ASIN=B00JG2824E",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 11, 2015",
                "reviewTitle": "5.0 out of 5 stars Installs fast, is easy to use, and works great. Fantastic choice!",
                "reviewText": "I’ve been waiting to review this product for quite a while, so that I could give an honest assessment of it after longer-term use. In the past, I’ve written reviews before really getting the bigger picture on an item, and sometimes my perceptions and the objects performance change quite a bit after the honeymoon period is over. This is not one of those cases.Review in a nutshell: The Luxe Bidet Neo 180 is fantastic. An economical device that installs fast, is easy to use, and delivers on expectations. If you are in the market for an affordable bidet, this is a great choice.Review out of a nutshell: The item arrived quickly, and was a surprisingly small package. The shell of the bidet is plastic, as are most components, and this did give me pause. However, over the period of use, I have had no issues whatsoever. My biggest concern was the plastic stem that connects the water line to both the toilet tank as well as splitting off to the bidet itself, specifically the shear strength of it, as the awkward distance from the existing shutoff to the tank would have put the connecting water line at an angle. I was worried that under pressure the force from the supply line would be exerted against the plastic stem sideways, instead of straight on, and that that might cause problems. Whether a valid concern or not, I solved the issue by taking the longer of the included supply lines and looping it to “create” a 90 degree angle, then tied the loop to keep it in place.Installation was relatively quick and easy, maybe 20 minutes in total. Although I don’t recall the instructions calling for it, I used plumber’s tape (also called Teflon tape) on all the threading, wrapping clockwise for four or so layers. Centering the bidet took a little time, but wasn’t difficult, made even easier by using the markings that appear on the bidet itself—there are rotating circles that allow you to change where the seat bolts pass through the bidet and thereby change its position, and there are markings along the perimeter of the circle (like number on a clock) that allow you to mirror the two circles to better find the center. The one challenge here was keeping the bidet in place while reinstalling the seat, and an extra set of hands at this point came in handy, just to keep things put. After that, I placed a shallow bowl beneath the fittings in case of leaks, and opened up the water. No leaks, no problems.A word about water pressure: Other reviews have noted that this bidet really brings the pressure, and that has been my experience as well. Even with a regulator that reduces the pressure of the water when it enters my house, this bidet can still knock your socks off. If you are considering using it for any reason related to or resulting in high sensitivity, you should definitely take some time to get to know how much to lift the handle and the resulting flow. The handle that turns the bidet on has a short pull, and the pressure ratchets up quickly. With practice, though, you’ll find your “sweet spot”. If your toilet supply has a cutoff valve, it may be worthwhile to experiment with turning it down to reduce the overall water flow, even though your toilet tank will fill more slowly.One last thing: The handle for using the bidet is located on the right side of the seat. It is possible to catch the handle and lift it if you are reaching back, say to flush the toilet while still seated, pull up your pants, reaching for your favorite magazine, or whatever else you might be up to. This can be really, really easy to do. There are three settings on this bidet, one of which is to clean the nozzles themselves. This setting directs the water along the face of the sprayers and straight down into the bowl. It’s a nice feature that has a second purpose as well--you might want to consider turning it to this setting when guests who are unfamiliar with the bidet arrive. Otherwise, you might need to keep some extra sets of clothes on hand (company and I both learned this the hard way).This item has been a great addition to the house, providing a level of hygiene and comfort I didn’t know I was missing. Now I do, and I really do miss it whenever I’m not at home. Be warned, it’ll spoil you. But as some commercial or other once said, “Aren’t you worth it?”.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nobody777",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCFMJVA3Q7ZQO6PUH534TRLFJ4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13CI8JRWLX2AP?ASIN=B00JG2824E",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 3, 2018",
                "reviewTitle": "5.0 out of 5 stars Easy install, does the job, highly recommended!",
                "reviewText": "I've actually been wanting to get one of these for some time and have researched several models... eventually deciding on the Luxe Bidet Neo 180 with the dual wash options and self-cleaning nozzles. My wife only giggles when I've talked about wanting to get one (usually preceded by an \"ewww, yuck, no thanks.\" What can I say... After having the pleasure of living with a lovely little hemorrhoid, the prospect has intrigued me often, since I've heard many positive stories about improved comfort, cleanliness and healing with a bidet. Yes, this is far too much information, but hey this a review about a bidet and I know I ain't the only person who's curious about this.First up, the installation... Very easy to install (took less that 30 minutes). I decided to also install a new toilet seat when adding the bidet. We're planning to buy a new toilet in the coming months, so I just purchased a cheap seat for the time being. Cost me less than $6 at WalMart for a decent wood seat that fit perfectly with no gap issues. All the hoses connected easily with no leaks. Very impressed at how simple and intuitive the whole process was. There are instructions, but if you're marginally savvy, you won't need them. Installation is super easy. The package also comes with the necessary tools and thread tape, all in the box. The only other tool I needed that was not in the box was a screwdriver to remove the existing bolts on the seat.Now for the test... WOW!!!! Let me tell you, yes it works! I must say I like this style of lever as you can easily control the flow of water by pulling up and pushing down as slow or quickly as desired (much like a regular faucet). One tip: Recommend setting the dial to Clean mode when not in use. It's easy enough to bump the lever when sitting down and give yourself an early shot in the yehaw. My wife giggled when she heard the first unexpected \"hooooo!\" It's actually not bad at all. I know there are more expensive units that even use warm water and cost a lot more money, but I can't see how that would be necessary at this point. The cool water is actually not a shocker or unpleasant at all so it works just fine and means less to hook up and less money to spend. What a great device!I have to be honest, when the spray is occurring, the impression is that it must be making a complete mess under the seat, splattering water everywhere (especially since it took a moment to adjust myself to find the \"sweet spot\" - ha). I checked several times to see if water was spraying over the sides, but it wasn't. When I was finished, there was no mess under the seat, just some evidence of water spray on the bottom of the seat. I hesitate to get too graphic here, but if you're reading this it's because you probably have the same curiosity... The answer is, it does a VERY effective job! The follow up wipe to dry was clean. I was impressed. No complaints from ol' Mr. Hemorrhi either.My wife was next up... Actually, she avoided use of it for most of the day, even using the hall toilet instead (which she NEVER uses) - hahaha. Finally, she was a good sport gave it a reluctant try. I waited, respectfully, in the next room.... I heard the spray kick in and her immediate \"whoooo\". \"Now how about that honey?\" I said... She replied, \"yup, it works.\" That's pretty much all she said and I had a good laugh. It wasn't as bad as she expected. She wasn't brave enough to try the \"Women Wash\" setting yet, but give it time. heheheFinally, the self-cleaning nozzle wash. Works beautifully. Just set the dial to Cleaning and pull the lever. Water rushes down, completely covering and cleaning both nozzles. No mess, no splash, works perfect.One thing I was concerned about, which hasn't proven to be an issue at all. My current toilet is a bit older and holds more water in the bowl than most newer toilets I've observed. I was concerned that the spray nozzles would submerge in the water when activated, but it seems that does not occur. Nothing but a clean and clear spray of water.Great purchase, easy install, great function and it even looks kinda cool. Best of all, it does the job very well and makes for a happy back side I must say. Highly recommended!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jose",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 24, 2021",
                "reviewTitle": "Vale la pena!",
                "reviewText": "Fácil de instalar y de usar, tras varios meses de uso puedo decir que fue una gran compra!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samer Shkoukani",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 16, 2023",
                "reviewTitle": "What they don't tell you...",
                "reviewText": "I'm based in the UK and this did not fit in between the toilet seat and bowl. It caused the seat to shift to one side and actually ended up ruining it. It's not seamless at all as they say. What they don't tell you is that to fix this issue you have to buy their specialized LUXE Bidet Luxe Toilet Seat for £100.... which is a complete joke. If they made that clear from the start it would have saved me ruining my toilet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "leela",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 29, 2017",
                "reviewTitle": "A good buy. I can recommend it particularly for senior ...",
                "reviewText": "It has met the requirements. A good buy. I can recommend it particularly for senior citizens.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Suresh Kumar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 22, 2017",
                "reviewTitle": "Some people have commented on the plastic T adapter being of lower quality but I don't think they understand how to judge if pla",
                "reviewText": "I bought this item just before Christmas 2016. We had a problem fitting it in the UK due the vary sizes of the T adapter/fitting. Upon leaving feedback the customer service department contacted me quickly and offered to send me a new T adapter with equal size fittings which is more ideal for the UK. Some people have commented on the plastic T adapter being of lower quality but I don't think they understand how to judge if plastic is good or poor quality. I find that plastic modern plumbing in the U.K. is doing very well. Less rusting, less soldering, better all round but that's my opinion. Anyhow customer service can not be faulted and the ingenuity behind making a quality yet cost effective product is great. I could not update my previous comment so here is my update with four stars. Four stars because I have yet to fit the part. But as soon as I have I will update my comments and hopefully give this 5 stars.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jay Nine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 9, 2016",
                "reviewTitle": "Cheap addition, high water pressure, use less toilet paper today!",
                "reviewText": "*I did get a free review unit AFTER I bought one a few months prior to being contacted by the company, so this review is mostly based on the initial unit I've purchasedTL;DRPro:Easy to installLess toilet paper usedGood qualityCon:Water pressure is a bit highToilet seat does not sit flush with the bowl unless you purchase bumper separatelyFull ReviewGot recommended about this product after I gave up initially looking for something similar. The other products I've research before cost $100s more, but they are full toilet seat replacement and usually an import item from Japan. This cost a fraction less than the full toilet seat bidet but does get the essential job done, to wash your toosh after you deuce. This model however does include a setting for feminine wash (round dial, middle for regular wash, right to clean the jets, left for female use).It works great, I have no problem with the installation. It takes about 15-20 minutes to install, and all you really need is a wrench and a flat head screw driver. Some complained how they wish the included \"T\" adapter to be metal and not plastic, I think it is fine since plastic doesn't rust and usually the existing fittings you are replacing are already plastic. You just have to remember to finger tight the nut plus maybe one turn with the wrench, don't over tighten it otherwise you'll crash it. Do check all the fittings there is a plastic gasket inside prior to installing.This model only only supply cold water, since it takes water from the same source as your toilet tank. You probably could wire the hose to the hot water tap from your faucet. However, even in the winter (about -5 degree Celsius where I'm located today), I found the water just refreshing and not overly cold. My wife had tried using it as well after some convincing. She said it works fine after you find out where the jet is shooting, but do need some getting used to if you never used a bidet before.One thing I do wish they would upgrade on the next model would be to include a water pressure reducer. After you initially installed the unit, place your hand in front of the jet and see where it shoots for alignment. It can easily shoots water onto the facing wall or out the door if your have a smaller bathroom. Other than that, for the price, you can't really go wrong if you are interested/intrigued in a bidet. You save more than a fraction of the price of a separate bidet unit, and you also use less toilet paper. I haven't seen a spike in the water bill since the water you use per wash is so minimal.Great company, great product, highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}