{
    "remaining_requests": 37629,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/XEK-Bathrooms-Sprayer-Operation-Display/dp/B0C2PY4LJK",
    "body": {
        "name": "XEK Smart Toilet, One Piece Bidet Toilet for Bathrooms, Toilet with Warm Water Sprayer & Dryer, Foot Sensor Operation, Heated Bidet Seat, Auto Smart Toilet with LED Display",
        "price": "$519.00",
        "originalPrice": "$609.90",
        "rawPrice": 519.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/XEK-Bathrooms-Sprayer-Operation-Display/dp/B0C2PY4LJK",
        "soldBy": {
            "sellerID": "A2Z45L8DH083W1",
            "name": "XEK US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2Z45L8DH083W1&asin=B0C2PY4LJK&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CCGJZ4DK"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In stock",
        "couponInfo": "Buy any 2, Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41J2vHoEU3L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41g-Jby9zIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41px03fSX5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41s7joIz6QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41u1hHXzhaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lYBdUBeTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hXc-DBvxL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the XEK Store",
            "link": "https://www.amazon.com/stores/XEK/page/AFE2B34A-4D35-4769-9D6F-E2FE327D0D89?ref_=ast_bln"
        },
        "brand": "XEK",
        "merchantInfo": "XEK US",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 44,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$29 delivery February 21 - 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【INSTANT WARMING COMFORT】XEK smart toilets have an advanced toilet seat constant temperature heating system, which can maintain the temperature of the seat, water, and dryer. Let you get a warm spring-like experience in the cold season. The XEK bidet toilet has a temperature memory function, which is convenient for you to use and does not need to be set every time.",
            "【INTELLIGENT CONTROL TOILET】Off-seat flushing, button control flushing, foot sensing flushing, and remote control flushing will flush to make you free your hands in all directions. And we set the KEY KNOB function button for the elderly and children. They can quickly switch between rinse, clean and dry functions. The smart toilet LCD displays a real-time display of toilet function usage.",
            "【HYGIENIC CLEANING & DRYING】XEK smart toilet has the functions of post-cleaning, female cleaning, and massage cleaning. The deodorizer uses a powerful air filter to effectively purify the air around the bidet. Air is drawn in and passed through an ionic carbon filter to eliminate the unpleasant smell. Brings health to you and your family.",
            "【PRODUCT SPECIFICATIONS】XEK one-piece smart toilet product size: 26.8in*16.1in*20.9in. Net weight: 88.3lb. Material: Ceramics. Voltage: 110V-130V. Power cord length: 60 inches.",
            "【ONLINE SERVICE】XEK provides one year warranty for all customers who purchase our smart toilets. We have a professional after-sales team to provide you with product installation solutions and the best service. Welcome to contact us through Amazon message, we will solve your problem in time"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b/ref=dp_bc_aui_C_3?ie=UTF8&node=680350011"
            },
            {
                "name": "Bidet & Bidet Parts",
                "link": "https://www.amazon.com/Bidet-Bidet-Parts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6810562011"
            },
            {
                "name": "Bidet Seats",
                "link": "https://www.amazon.com/Bidet-Seats/b/ref=dp_bc_aui_C_5?ie=UTF8&node=6810566011"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "K1"
            },
            {
                "name": "Product Dimensions",
                "value": "25.9\"D x 16.1\"W x 20.4\"H"
            },
            {
                "name": "Material",
                "value": "Ceramic"
            },
            {
                "name": "Brand",
                "value": "XEK"
            },
            {
                "name": "Item Weight",
                "value": "99.59 Pounds"
            },
            {
                "name": "Installation Type",
                "value": "‎Floor Mounted"
            },
            {
                "name": "Shape",
                "value": "‎Rectangular"
            },
            {
                "name": "Seat Material Type",
                "value": "‎Ceramic"
            },
            {
                "name": "Manufacturer",
                "value": "‎XEK"
            },
            {
                "name": "Part Number",
                "value": "‎K1"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎XEK"
            },
            {
                "name": "Included Components",
                "value": "‎1 x Toilet, 1 x Bidet Seat, 1 x Mounting Hardware"
            },
            {
                "name": "ASIN",
                "value": "B0C2PY4LJK"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 44 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#77,780 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #57 in Bidet Seats"
            },
            {
                "name": "Date First Available",
                "value": "April 17, 2023"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "XEK SMART TOILET ENJOY A NEW LIFE COMBINED WITH TECHNOLOGY The XEK One-piece smart toilet finely crafted core technology provides precise functionality for optimal hygiene and ultimate personal comfort, from personal cleaning, and LED night light to touch-free on/off, all easily accessible via touch remote control.",
                "media_link": []
            },
            {
                "media_text": "Intelligent Control & Soft Night Light When a person approaches the smart toilet, the locator automatically flips the toilet lid and automatically flushes and closes when leaving. LED smart night light, perfect for children, the elderly, or anyone who needs to use the bathroom in the middle of the night. Top material & intelligent dual control The XEK smart toilet is made of high-quality ceramic materials. And it adopts high-density waterproof technology, which can achieve the waterproof effect of daily use. With intelligent dual control (remote control and toilet side button), the LCD screen displays the usage of the toilet function in real-time. The Smart Security Max When there is a power outage, the smart toilet can still function normally. You only need to find the function button on the side of the toilet and select the function you need to use. Ensure that customers can still use the toilet normally in the event of a power outage. And our smart toilet is equipped with a thermostat and leakage protector, bringing safety and comfort to your family. Three Views Of The Smart Toilet Smart Toilet Parameters Power: 1350W，Air Flow > 0.2m3/min，Water inlet temperature: 15°C ，Water discharge: 750ml/min，Outlet water temperature: 40°C，Alternating voltage : 110V+10%,50HZ/60HZ",
                "media_link": []
            },
            {
                "media_text": "XEK Smart Toilet Function XEK Smart Toilet Function Instant hot type Wash Hip cleaning · Female cleaning · Mobile cleaning · Water temperature regulation · Water-pressure adjust Clean Self-cleaning nozzle · Spray regulation · Wall washing · Smart cleaning glaze Cozy Seat heating · Wind temperature regulation · Drying from heater · Night light · Automatic deodorization · Energy province electricity · Double filtration · Seat induction · LED indicating screen Safety Equipment 12V safety voltage · Leakage protection · Power Memory Flushing Automatic flush · Flushing by identify male urine · Flush during power failure",
                "media_link": []
            },
            {
                "media_text": "Is it easy to install? Most of them have been installed before the factory, only need to fix the position and connect the water pipe, there are installation videos that can be referred to, very simple. Does this toilet have leakage protection? How is the quality? The toilet has 12 protection measures and our products are certified by IAPMO EGS&CUPC&CEC, so the quality is guaranteed. Does the XEK toilet have a foot sensor to open the seat? Yes. As long as it is close to the toilet, it will automatically open the toilet lid. How to flush without power? The XEK smart toilet is designed with a backup battery device to ensure the normal operation of the basic functions in case of a power outage. You can flush by pressing the side button in case of power failure.",
                "media_link": []
            },
            {
                "media_text": "INSTALLATION Installation Manual (PDF) can be downloaded on our product page Product Type: One Piece Toilet. Structural form: Siamese. Drainage method: ground row Flushing Type: Pressure Assist, Siphon Jet. Amount of water per flush: 0.924 - 1.056 gallons Note: The amount of water used for flushing and draining is actually related to the water pressure (the angle valve can adjust the water pressure) Angle valve external tooth specification: 1/2 Angle valve adapter male head specification: 7/8 (Our angle valve is generally suitable for 1/2 size, and a 7/8 angle valve adapter is also provided to avoid individual customers needing a 7/8 joint) Note: It is recommended that the water pipe specification of the customer's home is 1/2 inner tooth or 7/8 inner tooth The vertical distance between the center of the sewage outlet and the wall: is 11.8in Note: It is recommended that the diameter of the sewage outlet of the customer's home is 3.94-4.72in",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/111375b6-292c-4aeb-b282-e3a56e35be5f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f08acf65-e9fa-4d87-ab01-64524af27ed5.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2da8a993-6740-4c59-92b7-0f4a36cd9318.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49fa44c1-3298-41f3-9f40-34fe847670de.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bf56368f-5f16-4edf-8793-983b4b1c2529.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/79f463e6-d354-4282-9411-a704e972f1d5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "T. J. Cannon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUIV5CBFNSFUFKWV3QJXNACNTYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUV6DRVKO41CZ?ASIN=B0C2PY4LJK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Works Great and Customer Service is Outstanding",
                "reviewText": "The media could not be loaded. So, I got this for myself for Christmas and was SO EXCITED to try it. It was easy to install, I know some people have complained about it not being bolted down...but it is so heavy, does not move, and has not been a problem at all. However, after installing the toilet it unfortunately did not work. It just would not flush. We would hit the flush button and the water would just swirl and not go down. I contacted the seller and they emailed me back right away with three things to try:1. Make sure the filter on the toilet was clean.2. Make sure none of the lines were pinched during installation3. If you have a home incoming water filter, make sure it is clean.Now, I won't lie, I didn't think it would make a difference but we checked 1 and 2...no change. We went to Loews and purchased a new home filter.....and believe it or not IT WORKED. If you watch the video and see the flush now...just imagine when we pressed the flush button before a little water swirled but it didn't even flush the toilet paper down.Side note: We had noticed (before purchase) a water pressure change, like when using the toilet ...the shower pressure would drop. We had NO IDEA that the filter affected the water pressure that much. Turns out it does, because our water pressure is now back to normal.Positives: I love the light, warm seat, bidet, and that the seat opens as I walk into the bathroom. My mom came over and tried it and liked it so much she is now getting one too. I have contacted customer service over four times, and they have gotten back to me right away each time.Negatives: The only negative I will give it is the beeping. It beeps when the lid opens, when you get up, when you flush...etc... This can be annoying if you are sleeping (I'm a light sleeper) and it wakes you up. I did contact them and they said there is no way to turn off the beep. I'm not taking any stars away for this b/c I did read the reviews before I purchased and knew about it already.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/69518dd9-62af-4043-a4fe-caeae1bc1585/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "john bickley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRD6QHOV7ONWO3Q7VL36JZIKHEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLKBEN4GML66B?ASIN=B0C2PY4LJK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing",
                "reviewText": "Amazing toilet that has all the bells and whistles at a great price! I've never experienced a toilet that deodorizes as i go #2, somehow it takes care of the odor. Fun and easy to operate, Luxurious and well designed. My carpenter was amazed as well, and wants one too! upon flushing, this toilet washes the bowl thoroughly. Opens automatically, no hands neededonly drawback is, i wish i could turn off the beep between functions. otherwise i love this toilet!",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. ManzS. Manz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGARP3PN346FCVKDXXO2AQ4JQJRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NULNZWEE3WSQ?ASIN=B0C2PY4LJK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Love at the first sight",
                "reviewText": "We absolutely love everything about this truly smart toilet.Easy to install, I did it by myself in less than 30 minutes, although I recommend 2 people to lift and position it because at 100lb, it can be quite heavy for one person.All functions are as described,except for the display that can only show temperature settings in Celcius. This could be a bit confusing for US customers.There is also another automated function that does not appear in the instructions manual which comes with the unit, however the company customer service helped me to get it setup and functioning very quickly.Specifically this is \"Auto Flush\" after a Male Standup business.To set this up, you must first power the toilet off with the button on its remote .You then have to press and hold the \"cover close\" button (located on the LEFT of the circle on remote), until you hear a beep. One beep means function is ON and 2 beeps means function is OFF.So with auto flushing after Male Standup or Sitting Down, this is a fully functional smart toilet.The bidet functions also work great and we both love the heated dry function.Bottom line is that this smart toilet offers everything and I can't think of any other function that it does not provide, other than perhaps an \"auto foam\" feature which we have on our guest room smart toilet, but that one is also a little more expensive than this unity because of its foam feature.Great smart toilet which I can confidently recommend to anyone.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61VoF1Fg2EL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71AY4tv01PL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRY5PVZ6YEW55DSD5YMTEXNBL7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19XRAB905E8B?ASIN=B0C2PY4LJK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome toilet!",
                "reviewText": "We ar exteemely satisfied with this product. It worked fantastically! It was easy to install. We only had to add a power outlet to draw power. It comes with wax seal and we only added silicon to lock it in place. Great product and extremely cheap compare to other brands.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61g25II0LOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61mUkg-SDTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Kuenzi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEARYE655HS3GZY4UX5VDQAZDJHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AF91FCN8VQUJ?ASIN=B0C2PY4LJK",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "1.0 out of 5 stars Multiple challenges",
                "reviewText": "After spending $200 to install this toliet because it does not align to toilet standards, I soon discovered that the seat warmer stopped working. The remote control often requires you to push buttons 2-3 times before it activates. There must be something wrong with the auto-seat lifting because I hear the toliet seat go up and down during the night even though there has been no motive near the toilet. Also the washing arm turns off if you move at all. Would be nice if it had an isolation mode since you cannot move while using the bidet otherwise it turns off. I would not recommend this toilet.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristi Botelho",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFORCNLR6GQDE747KSLIWRBSPORQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5852AWXBL70D?ASIN=B0C2PY4LJK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Great looking and nice features",
                "reviewText": "Great looking quality toilet but just be aware that this just sits directly on the toilet flange and then siliconed around the base. I personally was not comfortable installing it without a way to secure it to the flange so I reached out to customer service and they refunded me. 5 stars for the great customer service as well as the quality build of the toilet. It’s just unfortunate that there is no way to secure it to the flange with bolts like most toilets here in the US",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cuong Nguyen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4MKNEDDZGWWHGFFU5BVEJUJSUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IH0IY7J0NWV7?ASIN=B0C2PY4LJK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "4.0 out of 5 stars Quality control issue",
                "reviewText": "It looks nice and has many features. Love the heated seat. Had issues with auto flush setting but seller promptly helped to fix the setting. So far, great product. User and installation manuals have room for improvement.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. Scauflaire",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZDEWIKRYAXJKKFNXCZXH4GSIZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RNJWVRQUKGF7?ASIN=B0C2PY4LJK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "5.0 out of 5 stars love this automatic flush toilet",
                "reviewText": "All functions work as advertised. Will probably order another one for the guest bathroom. This one has me so spoiled I don't want to use a normal toilet. Love the fact it opens up automatically, has a foot control for men, flushes automatically and has a warm seat. Love the bidet function as well. You can stop using toilet paper as it will wash and dry for your comfort. Only thing I wish was different is I wish the lid would close before the automatic flush instead of afterward.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}