{
    "remaining_requests": 37637,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sublime-1-Piece-Compact-Small-Toilet/dp/B07CSG4VWN",
    "body": {
        "name": "Swiss Madison SM-1T257 Sublime II Compact 24\" Length One Piece Toilet Dual Flush 1.1/1.6 GPF with Side Holes, Glossy White",
        "price": "$239.00",
        "originalPrice": "$331.74",
        "rawPrice": 239.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sublime-1-Piece-Compact-Small-Toilet/dp/B07CSG4VWN",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C7XRHL1F"
        ],
        "asinVariationValues": [
            {
                "asin": "B07CSG4VWN",
                "variationName": "Color",
                "variationValue": "Glossy White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21VDZ7jyAhL._SS36_.jpg"
            },
            {
                "asin": "B09X8C4SC4",
                "variationName": "Color",
                "variationValue": "Matte Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31IaPwSrmKL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/51znLEhvcCL._AC_SY355_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Swiss Madison Well Made Forever Store",
            "link": "https://www.amazon.com/stores/SwissMadisonWellMadeForever/page/2E74195D-23FD-4A26-AAF7-B4C4A9DFDF80?ref_=ast_bln"
        },
        "brand": "SwissMadisonWellMadeForever",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 643,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 22 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Dual flush with high-performance gravity 1.1 / 1.6 gallon per flush (gpf). Item dimension L: 24 x W: 13.81 x H: 27.31 inches",
            "Seamless porcelain one-piece with an easy-to-clean design",
            "Compact bowl ensures plenty of room for comfort in small spaces",
            "Soft Closing Seat closes gently and quietly",
            "Quick-Release seat can be unlatched from the toilet for easy removal and convenient cleaning no tools required"
        ],
        "description": "The Sublime II tank drops seamlessly into a fully skirted smaller bowl creating a slender one piece toilet Dual flush allows you to choose between partial and full flush without sacrificing excellent performance The perfect compact toilet for smaller installation areas",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b?ie=UTF8&node=680350011"
            },
            {
                "name": "Toilets & Toilet Parts",
                "link": "https://www.amazon.com/Toilets-Toilet-Parts/b?ie=UTF8&node=6810474011"
            },
            {
                "name": "Toilets",
                "link": "https://www.amazon.com/toilet/b?ie=UTF8&node=680355011"
            },
            {
                "name": "One-Piece Toilets",
                "link": "https://www.amazon.com/one-piece-toilets/b?ie=UTF8&node=542638011"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Glossy White"
            },
            {
                "name": "Product Dimensions",
                "value": "24\"D x 13.8\"W x 27.3\"H"
            },
            {
                "name": "Material",
                "value": "Porcelain"
            },
            {
                "name": "Brand",
                "value": "Swiss Madison Well Made Forever"
            },
            {
                "name": "Item Weight",
                "value": "83.7 Pounds"
            },
            {
                "name": "Installation Type",
                "value": "‎Floor Mounted"
            },
            {
                "name": "Shape",
                "value": "‎Round"
            },
            {
                "name": "Seat Material Type",
                "value": "‎Plastic"
            },
            {
                "name": "Manufacturer",
                "value": "‎Swiss Madison"
            },
            {
                "name": "Part Number",
                "value": "‎SM-1T257"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎SM-1T257"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Size",
                "value": "‎Dual Flush"
            },
            {
                "name": "Style",
                "value": "‎Compact"
            },
            {
                "name": "Finish",
                "value": "‎White"
            },
            {
                "name": "Pattern",
                "value": "‎Toilet"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Included Components",
                "value": "‎Toilet"
            },
            {
                "name": "Warranty Description",
                "value": "‎1 Year Limited Warranty"
            },
            {
                "name": "ASIN",
                "value": "B07CSG4VWN"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 643 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#96,369 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #19 in One-Piece Toilets"
            },
            {
                "name": "Date First Available",
                "value": "May 1, 2018"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/7dfc9f51-2644-4256-9946-fb1ae9c9f5e6.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/78b29f02-8aa8-4a7d-af85-55da53015ff4.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/74784d88-1961-4dfc-8af2-6676023ef69a.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1389c46b-5de0-438e-9fe6-1317fdec6cb0.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a6eb417a-7353-45a6-8656-fcca782186ba.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Catherine M.Catherine M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGASBNZW24WAJVKL5YPVLT3KK36A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REND70LMNZNMA?ASIN=B07CSG4VWN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect for small bathroom",
                "reviewText": "I am very happy with this toilet! The modern design, the smaller tank for reduced water consumption. I like the soft close seat, its comfortable enough. The install is a little tricky, I used the traditional flange screws, not the ones included and I purchased a rubber ring which worked really well. I would not recommend the wax ring included. The only downside is the flushing mechanism/buttons are not easy to push and don't always flush on the first try.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61+NNk1RaVL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andre Bouravnev",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJXYQ6GJEZUFUER2VHWIW7KHLJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BAYQHX4ISVVD?ASIN=B07CSG4VWN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 26, 2020",
                "reviewTitle": "5.0 out of 5 stars Elegant, stays clean and flushes very well.",
                "reviewText": "I was worried that it will be too small but it actually a perfect size. It’s been a year and it flushes quietly and fast. Nothing sticks to the bowl to my amazement and it is just elegant. It’s easy to clean and it looks like it will last for a long time. The installation was quick for me. But I already installed about 4-5 toilets. I do agree with some that the bolts in the back could be a challenge if there is little room between the wall and the toilet, but I was able to tighten it all right. I still say that for the price you get the best quality you can find. If you install it right it does not leak. Do make sure to tighten everything as some parts come preinstalled. Do not over tighten though. I love it.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sundog",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7SI6JXKNC2T5D7IVZGS2Y2HEHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39QI6SOGO1IHR?ASIN=B07CSG4VWN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "4.0 out of 5 stars The Smallest Toilet I Found and Some Tips",
                "reviewText": "I am thrilled to get this toilet installed and the fact it gives my three foot wide bathroom an extra FOUR inches than a standard round toilet. Those four inches can count for a lot in such a small space. This toilet was part of a complete redo of my bathroom in my very old home with 3 x 6 feet of floor space, other than the shower. Rather than making a larger bathroom I decided to go with a little toilet and sink and well planned storage.The biggest downside for me was the shipping. It didn't start tracking for 10 days and arrived a week later broken. I'm not sure who dropped the ball, or the toilet, but I ended up having to pull my old toilet out of the trash to tied me over. I admit, my final purchase was from another retailer and it arrived in a few days and in one piece. They also shipped it by Fed Ex instead of UPS.I read the reviews about the seat being uncomfortable and it is. Buy yourself a comfortable, good quality seat and install it before you install the toilet. If you change your mind later, you will have to pull the toilet to install a different seat. Consider the seat that comes with it a freebie not worth keeping. While the standard round seat doesn't completely follow the lines of the toilet, it looks fine, and it follows the lines of my body better!Throw away that wax ring, and any wax ring for that matter. I'm a fan of Fernco toilet gaskets for a couple of reasons. Installed on a new toilet, I have never had them fail. I have done rentals most of my life, and replaced a lot of wax rings, but never a Fernco that was installed on a new, clean toilet. The Fernco also makes it easy for one person to line up the screws. After the Fernco is glued to the bottom of the toilet, you can set it over the hole and it will hold the toilet up. Put in your screws, line them up, then push the Fernco down into the toilet drain. If you have to pull the toilet at any time, chances are the Fernco will remain tight and you can reuse it. If you use the was ring, and it fails, consider another waxless gasket. It is hard to get the Fernco to glue on perfectly following wax. You won't get the benefit of the gasket holding up the toilet to install the screws though, and being a small older woman installing this alone, I appreciate that!Remember to attach your waterline before you set the toilet to keep things easy and get a longer supply line if you need to. I was fine with the one I had on hand.I already had a low flow toilet with a low waterline inside the bowl, so this was not an issue for me. This is not a \"right height\" or \"chair height\" toilet so be aware of that if it is an issue for you. I LIKE a lower toilet myself and the lower height was a selling point for me.I was able to hand tighten the screws easy enough, but a deep socket ratchet, or cutting off the screws will be required to tighten them the final bit.I have to say I LOVE this little toilet, and with homes surely being smaller in the future, think they are really on the right track here. I am taking one star away just because of the slightly odd shape that makes the seat uncomfortable, but if I could take off just half a star, I would. The worst was the shipping glitch and broken toilet, but I won't consider that in my overall rating.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blaise Strenn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETO44NO22JGPR52I7R5QYGBJFWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AHRKOQ0II3JJ?ASIN=B07CSG4VWN",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2021",
                "reviewTitle": "1.0 out of 5 stars Installation is a real challenge.",
                "reviewText": "I expected better from a toilet in this price range. The instruction manual, if you can call it that is extremely poor. The Toilet came with some lag bolts and wall anchors, no closet bolts, so a trip to the store was needed. Then the wax ring was undersized, so back to the store. And a third trip was necessary for a rachet wrench to tighten the nuts on the closet bolts. It could have been designed much better to make installation easier. I understand this is a compact toilet, but installation was orders of magnitude more difficult than other toilets I have installed. Cannot imagine one person being able to do this alone. The supply line has to be connected before the toilet is set down on the closet bolts. It did not take that much longer, but was much more intense. I wear a man’s size large glove, and I could not thread the nuts on the closet bolts through the small opening. My wife’s smaller hands were needed. After a couple of installation attempts due to the small wax ring, then a damaged wax ring for the toilet was not set properly, we still had a small leak somewhere. Small amounts of water around the base of the toilet. There was no leak around the foam seal we ended up using, rather after talking to the company, it was determined the water was coming from the bowl from a small defect somewhere. No idea if damaged during shipping or manufacturing, but sent toilet back and ordered another. When the second toilet came, we first tested the bowl for leaks. No leaks, so we installed it. After all the practice with the first toilet, we had it done in about 45 minutes, and no leaks! It fits nice in our small bathroom and does look nice and will be easy to clean, but now having installed one, not sure I would buy another.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave E. ThomasDave E. Thomas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4XAEN6CME4WJBU4NMETTGHKIXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M1XCS72AEIKV?ASIN=B07CSG4VWN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Works awesome for small space",
                "reviewText": "We bought a farm and our first building we built was a barn with a small living quarters to use while we build a house. The bathroom is small 4' x 9'. To put it in perspective the shower is 3' x 4' and my wife wanted a 40\" vanity, so space for the toilet was limited. This was the perfect solution it is chair height which is a big plus. I found it quite easy to install read some reviews about trouble with the bolts but I had no issue using a deep well socket and ratchet to get them tightened. I did get my wife to get the nuts started as reaching into the hole with my hands was a bit clumsy. But not undoable. Also the seat needs to be installed very tightly the fittings for the seat work on compression so getting them tight is a must.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ys+5LOYGL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. McMichael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHA4FZBHD7G2VMXZSCB2ZUP4OHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHFI9M9QYNUPP?ASIN=B07CSG4VWN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2022",
                "reviewTitle": "3.0 out of 5 stars Bowl is the smaller size",
                "reviewText": "Pros- Small, sleek, modern. Installs close to wall with no gap. Would be good for a small guest room.Cons- Although the description says “elongated,” the bowl opening is the smaller size. The family now calls it the “tiny toilet.” The seat kind of feels like cheap plastic, but the rest of the product seems fine.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Grant",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 22, 2023",
                "reviewTitle": "Bien jolie ...merci !",
                "reviewText": "Pour l'usage correspondant à la photo ...bien jolie mais n'a pas encore été installée...merci pour excellent délai de livraison...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Comfort C",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 6, 2023",
                "reviewTitle": "Compact and practical",
                "reviewText": "The compact toilet and functional.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}