{
    "remaining_requests": 37409,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Kohler-K-77780-0-One-Piece-Elongated-Intelligent/dp/B07N9JW4NL",
    "body": {
        "name": "KOHLER 77780-0 Karing Smart Toilet with Auto Open & Close, One-Piece Elongated Intelligent Bidet Toilet with Heated Seat, 1.08 GPF, White",
        "price": "$3,750.00",
        "originalPrice": "$3,750.00",
        "rawPrice": 3750.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Kohler-K-77780-0-One-Piece-Elongated-Intelligent/dp/B07N9JW4NL",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/21WkRGW-ScL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/416JsGWkJ1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21Nto4Kj9DL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21P1jQsIMKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Flw0lDUUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RUHTrlP L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-FFNqB6iL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Kohler Store",
            "link": "https://www.amazon.com/stores/Kohler/page/65234E2A-82BF-4ACB-81F2-8475C60E4EB4?ref_=ast_bln"
        },
        "brand": "Kohler",
        "merchantInfo": "Ships from and sold by eFaucets.",
        "customerReview": "2.7 out of 5 stars",
        "customerReviewCount": 7,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20. Order within 21 hrs 5 mins",
            "FREE delivery February 20 - 23."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "WaterSense is a voluntary label from the US Environmental Protection Agency (EPA), which identifies products that meet criteria from the EPA for water-efficiency and performance."
        },
        "features": [
            "Compact one-piece intelligent toilet with integrated personal cleansing",
            "Elongated bowl offers added room and comfort",
            "1. 08 gallons per flush (gpf)",
            "Advanced personal cleansing functionality with self-cleaning wand and precision air dryer",
            "Adjustable settings for heated seat, dryer and water temperature"
        ],
        "description": "Minimalist style meets maximum hygiene. The next-generation Karing Intelligent toilet features an ergonomic seat design for a streamlined look with the comfort of integrated personal cleansing. Use the advanced touchscreen remote to create your preferred settings for warmth, cleansing, and drying. A pre-mist function sprays the bowl before every use, leaving it cleaner after every flush. The powerful 1. 08-gallon flush provides significant water savings compared to a 1. 28- or 1. 6-gallon toilet.",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b?ie=UTF8&node=680350011"
            },
            {
                "name": "Toilets & Toilet Parts",
                "link": "https://www.amazon.com/Toilets-Toilet-Parts/b?ie=UTF8&node=6810474011"
            },
            {
                "name": "Toilets",
                "link": "https://www.amazon.com/toilet/b?ie=UTF8&node=680355011"
            },
            {
                "name": "One-Piece Toilets",
                "link": "https://www.amazon.com/one-piece-toilets/b?ie=UTF8&node=542638011"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Product Dimensions",
                "value": "26.5\"D x 16.69\"W x 21\"H"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Brand",
                "value": "Kohler"
            },
            {
                "name": "Item Weight",
                "value": "10 Pounds"
            },
            {
                "name": "Installation Type",
                "value": "‎Floor Mounted"
            },
            {
                "name": "Shape",
                "value": "‎Elongated"
            },
            {
                "name": "Seat Material Type",
                "value": "‎Plastic"
            },
            {
                "name": "Manufacturer",
                "value": "‎Kohler"
            },
            {
                "name": "Part Number",
                "value": "‎77780-0"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎K-77780-0"
            },
            {
                "name": "Finish",
                "value": "‎Ceramic"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Usage",
                "value": "‎Inside"
            },
            {
                "name": "Included Components",
                "value": "‎LCD remote control, Seat, Power cord, Supply line"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "Warranty Description",
                "value": "‎3 Year Limited"
            },
            {
                "name": "ASIN",
                "value": "B07N9JW4NL"
            },
            {
                "name": "Customer Reviews",
                "value": "2.7 2.7 out of 5 stars 7 ratings 2.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#947,861 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #356 in One-Piece Toilets"
            },
            {
                "name": "Date First Available",
                "value": "January 31, 2019"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/1c9ca019-172f-4df0-bf56-db4c657ecbbe.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/361c000e-b4f4-45e7-8f51-efcfddd21183.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/01261409-502d-4a7a-a6a3-dc9e06e823f5.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "AF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT7W3GHVTKYFDMF2RIEYB7CBSYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAVS8110NHESP?ASIN=B07N9JW4NL",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2021",
                "reviewTitle": "3.0 out of 5 stars Lots of Pros and some Cons",
                "reviewText": "Kohler as a company makes good products and this is one of them but needs quite a bit of refinement to make it a 5 star product.Here is where it falls short:1. Lack of presets on the remote for multiple users. Different users have to make constant adjustments for themselves. the Karing 1.0 has the option to set 2 presets on the remote and this should have been rolled into the 2.02. Lack of nightlight, it is not really a nightlight when the lid closes the light goes out. This compared to Karing 1.0 when the lid closes the led light is still on and surrounds the bowl so it actually behaves as a night light.3. User manual, there is an error in the manual for setting the functions you have to \"Press and Hold\" the remote function to make changes, the manual simply states to press. This is an easy fix but i wonder if the people who wrote the manual actually read it.4. Remote settings, to make setting changes with the tone it is far more difficult than it needs to be, there are times the toilet makes an extra beep alert when you don't expect it so it is quite confusing and could be changed to make it more user friendly.5. The Wand, it does not extend out enough to avoid getting water splashed on the back of the seat. Every time the rear wash is used with the wand fully extended you end up having to wipe the rear of the bowl dry as water will splash there. The full extension still requires you to scoot all the way back, it should be able to extend an inch or two further to avoid the back splash when the water power is at maximum.6. Seat sensor, compared to the Karing 1.0 you have to be literally right in front of the seat almost touching it to get the seat to come up. The Karing 1.0 you can be a feet or two away and it would open which is nice b/c with the 2.0 you have to wait for the seat to open and unfortunately there is no way to adjust the sensor sensitivity. Please add sensor sensitivity or change it so it is more like Karing 1.0.7. Lid closing. When the lid closes you can hear it slam close, again compared to the Karing 1.0 which closed but it was much more quiet as the lid didn't slam against the seat.8. Lid closing, it takes a good minute for the lid to close after you get up, this is just too much time, if you are sleeping and a minute later you hear the lid slam against the seat it can be startling.9. Pre-wash, the intent is good, but when the lid opens it pre-washes the bowl, i don't think this is necessary if you go #1 a prewash will not do anything. The problem is as soon as you sit down on the bowl it pre-washes again it wastes water as it pre-washes when the lid opens, than pre-washes again as soon as you sit down on the seat. Just wasting water here and the first pre-wash should be eliminated.10. Dryer: well this is worthless just like the Karing 1.0, unlike the Karing 1.0 you can't set the heat on the dryer at all, sometimes the air is cold, sometimes warm, not sure what causes this to blow cold or warm when it wants but it is not consistent and like the 1.0 it does not dry at all unless you want to sit there through 2-3 cycles of the dryer which even at that point it still will not dry you. You will need toilet paper to dry yourself and the seat if you use the rear wash.11. Rear plastic cover: The rear plastic cover is rather difficult to make work and stay in place, the stainless water hoses don't have much give and when you tie it to your home valve it is usually impossible to close the rear cover and put all the hoses is the tight space. Not a big deal but something to improve for Kohler12. Power saving mode, still unclear how this works as ive tested with a Kill-a-Watt meter and draw is constant.13. Remote lacking buttons and the power button is recessed and flush with the mount hard to press to wake up. Would have like the ability to move the icon's around but this might be more advanced than allowed14. I have to call Kohler out on this, you spend this much on a toilet and they give you the cheapest of cheapest two screws as part of the final step to screw the cover to the base. All 4 times that screw stripped on me and i had to use my own screws to secure the bowl. What does it cost to provide a quality screw, you can buy a box of 100 for $6 from lowes. Kohler should be ashamed of themselves for providing such garbage screws!Now that may appear to look like a bunch of negatives, but the reality is you will not find a better toilet at the price point. Let me list the Pros of this toilet.1. Kohler Customer Service is great, if you have any issues they have a dedicated team for smart toilet. Now I don't agree with their assessment of how well the heater works and I think most people would agree it does not dry well.2. Sleek design, minimal design and foot print3. Easy to clean, overall design makes it easy to clean compared to regular toilet and other smart toilets4. Forced flush rather than gravity flush, it really cleans the bowl as you flush which is great plus5. Pre-wash, this is again a pro and con the way it is implemented, but the 2nd pre-wash is great to avoid anything sticking to the bowl6. Flush does not splash out the bowl, compared to other smart toilets the water remains in the bowl and does not get on the seat, huge plus7. Auto flush works great, only a single flush is usually needed after #28. Remote is sleek however the sensitivity is something that could be improved. I talked about the recessed button at the top which is not easy to press. The remote does wake up when the seat opens which is a huge plus so you don't have to press the button to wake it, and you can tap the screen to wake it when it sleeps which is a plus. Overall the remote is very sleek and looks far more professional than other remotes of other smart toilets I have seen which looks like a kids remote compared to this.9. Heated seat if you like to use it, we don't care for it10. The Electrolyzed water and UV sanitization of wand is great and no other toilet company offers this. Again hygiene and cleanliness is critical.11. Powerfull flush, it is loud but not too bad and it cleans the bowl.12. Installation is not bad at all, everything is provided in the kit even the water line assuming it is the same that matches your valve.13. Good packing from Kohler, the toilet is well protected, can't say the same about their sinks14. So far it is plug and play, time will tell if it lasts.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Clark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQDBWGAP6AHA3EBHPTAZMLCK24A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SY75V9LZIAOS?ASIN=B07N9JW4NL",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 17, 2023",
                "reviewTitle": "2.0 out of 5 stars My thoughts after installing two of these yesterday.",
                "reviewText": "As per a review read here from two years ago (apparently nothing has been done about it at Kohler), I was astonished at the pathetic quality of the mounting screws that were provided with this very expensive toilet. A screw head completely stripped out with only minimal force applied. It had driven in past the point of removal but it did not tighten down enough to hold the toilet in place, or hold the cover plug. This leaves me wondering where else they may have cut corners here. Also remarkable is the fact that Kohler does not include a wax ring ($5) with this $3200 toilet.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TXfilesTXfiles",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUXFM5JAIKV6WX2CILOXQ2IVQ4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCYFSHNS8KTQX?ASIN=B07N9JW4NL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Love it, though repair is interesting.",
                "reviewText": "This Kohler Karing 77780 bidet came with the house. We love it. Recently, though, we had a leak and ultimately need to replace the intake valve assembly. Kohler's web and chat were very helpful, but there is no service manual, only an installation manual and a parts diagram on their web. Our local master plumber got it done, and here are a couple hints.After popping off the top cover, remove the two obvious screws. Then tilt up the now loosened back cover and genitally SLIDE the seat assembly forward; but not too much - it's wired. Now the motors, piping, and traditional retention screws are exposed for your work as shown in the photo. Good luck!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719BdbrknJL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "VIP WOJO",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6EM5WLDPI4YSZ6EKR64EWMJNVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QFOXVPYJSJY2?ASIN=B07N9JW4NL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 1, 2021",
                "reviewTitle": "5.0 out of 5 stars Love the design. Guests also.",
                "reviewText": "Works flawlessly. I can’t believe I was with out smart toilet for so long. Now I would never go back to regular one. This Kohler smart toilet is what you pay for. Great Quality & ease of use. Love the digital screen remote. Thanks Kohler for such a great product.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}