{
    "remaining_requests": 37646,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/HOROW-HWMT-8733-Compact-Bathroom-Concealed/dp/B07K32DFHS",
    "body": {
        "name": "HOROW HWMT-8733 Small Compact One Piece Toilet For Bathroom, Powerful & Quiet Dual Flush Modern Toilet, 12'' Rough-In Toilet & Soft Closing Seat Include, 25\"D x 13.4\"W x 28.4\"H, White",
        "price": "$239.00",
        "originalPrice": "$239.00",
        "rawPrice": 239.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/HOROW-HWMT-8733-Compact-Bathroom-Concealed/dp/B07K32DFHS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNR353S6"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CLRX45K4",
                "variationName": "Size",
                "variationValue": "10\" Rough-in",
                "price": "$506.09",
                "variationImageURL": ""
            },
            {
                "asin": "B07K32DFHS",
                "variationName": "Size",
                "variationValue": "12\" Rough in",
                "price": "$239.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41HVvCdx-SL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Y6L2uZCAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51--nqhqT5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ilfi3svUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-huDK5oqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41raainFF3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91uWt8UW7jL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the HOROW Store",
            "link": "https://www.amazon.com/stores/HOROW/page/A09341BE-FA66-4BD9-80CC-1A75964A8DC1?ref_=ast_bln"
        },
        "brand": "HOROW",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 585,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 14 hrs 4 mins",
            "FREE delivery Tuesday, February 20. Order within 18 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Modern Compact Design: This small toilet measures just 25 inches deep by 13.4 inches wide and 28.4 inches high, ensuring plenty of room for comfort in a small space. Great for apartments, small bathrooms, ensuite bathroom and more",
            "Small but Comfort: If you’re worried that a compact toilet might mean a seat that’s too small for comfort – don’t be. The bowl here is a standard round version, and the space is saved on the tank shape and size; It features a 16.5-inch height seat making it easier for anyone who has a hard time getting up from a low bowl",
            "Powerful with No Clogs: Siphon flush with two options. The full flush uses 1.6 gallons of water, while the light flush uses 1.1 gallons. That gives you plenty of power to ensure the bowl is clean and also saves on your water bill",
            "Easy to Clean: The fully glazed bowl is designed to stay clean, so you won’t need to get out the toilet brush often",
            "Peaceful use: The modern toilet comes with a soft closing PP seat, which will avoid any clattering when you use the toilet, great choice to keep the peace in an en suite bathroom",
            "Easily Installed: Two big installation access on the side allows the plumber to install this dual flush toilet much easier. Package includes toilet, soft closing toilet seat, pre-installed flush valve, high-quality wax ring, floor bolts, and also installation instruction",
            "Life-Time After-Sales Service: HOROW values each customer’s shopping experience and believes in the quality of our products, therefore our toilets comes with lifetime after-sales service and 2 years limited warranty. Our customer service center will respond to messages within 12 hours",
            "Certification: cUPC,UPC and Water Sense certified. CEC compliant. cUPC certified water flush valve",
            "Upgraded Package: The toilet was very well packed and encased well in styrofoam to prevent being damaged during shipping"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b/ref=dp_bc_aui_C_3?ie=UTF8&node=680350011"
            },
            {
                "name": "Toilets & Toilet Parts",
                "link": "https://www.amazon.com/Toilets-Toilet-Parts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6810474011"
            },
            {
                "name": "Toilets",
                "link": "https://www.amazon.com/toilet/b/ref=dp_bc_aui_C_5?ie=UTF8&node=680355011"
            },
            {
                "name": "One-Piece Toilets",
                "link": "https://www.amazon.com/one-piece-toilets/b/ref=dp_bc_aui_C_6?ie=UTF8&node=542638011"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Product Dimensions",
                "value": "25\"D x 13.4\"W x 28.4\"H"
            },
            {
                "name": "Material",
                "value": "Ceramic"
            },
            {
                "name": "Brand",
                "value": "HOROW"
            },
            {
                "name": "Item Weight",
                "value": "90 Pounds"
            },
            {
                "name": "Installation Type",
                "value": "‎Floor Mounted"
            },
            {
                "name": "Shape",
                "value": "‎Round"
            },
            {
                "name": "Seat Material Type",
                "value": "‎Plastic"
            },
            {
                "name": "Manufacturer",
                "value": "‎HUNAN HOROW SMART HOME CO.,LTD"
            },
            {
                "name": "Part Number",
                "value": "‎Dual Flush Toilets"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎HWMT-8733"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Size",
                "value": "‎12\" Rough in"
            },
            {
                "name": "Style",
                "value": "‎HWMT-8733 Modern Comfort Toilet"
            },
            {
                "name": "Finish",
                "value": "‎White Toilet"
            },
            {
                "name": "Pattern",
                "value": "‎Toilet"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Flush Type",
                "value": "‎Dual"
            },
            {
                "name": "Rough-In",
                "value": "‎12 Inches"
            },
            {
                "name": "Certification",
                "value": "‎CEC, Energy Star, cUPC, WaterSense"
            },
            {
                "name": "Special Features",
                "value": "‎Super Compact Toilet for Small Bathroom"
            },
            {
                "name": "Usage",
                "value": "‎Your HOROW product is built from best-in-class materials and boasts a superior construction. However, your toilet is not meant to be used as permanent, If you think there's a problem with your HOROW product, please contact horow.cs@hotmail.com as soon as the defect is noticed."
            },
            {
                "name": "Included Components",
                "value": "‎Wax Ring, Floor Bolts, Installation Instruction Manual, Side Cover, Toilet Seat"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "Warranty Description",
                "value": "‎2 Year Limited Warranty"
            },
            {
                "name": "ASIN",
                "value": "B07K32DFHS"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 585 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#27,362 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #4 in One-Piece Toilets"
            },
            {
                "name": "Date First Available",
                "value": "November 15, 2018"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Powerful with No Clogs & Save water Siphon flush with two options. The full flush uses 1.6 gallons of water, while the light flush uses 1.1 gallons. That gives you plenty of power to ensure the bowl is clean and also saves on your water bill",
                "media_link": []
            },
            {
                "media_text": "Easily Installed & Allows for installation in any bathroom Two big installation access on the side allows the plumber to install this dual flush toilet much easier. Package includes toilet, soft closing toilet seat, pre-installed flush valve, high-quality wax ring, floor bolts, and also installation instruction. Rough-in Option : 10\" & 12\"",
                "media_link": []
            },
            {
                "media_text": "Technical Details Flushing technology Siphonic Jet Trapway size 2 inches Flush valve size 2 inches Seat height 16 1/2” Toilet material Solid Porcelain MaP Rating 600g Handle/Lever Placement Flush Buttons Are Chrome-Plated Water Consumption Dual-flush 1.6GPF/1.1GPF Style Modern Comfort Toilet Special Features Compact Design for Small to Medium Bathroom , Small Bathroom, Water Closet, and Powder Room",
                "media_link": []
            },
            {
                "media_text": "Is it a small toilet or standard toilet, and if it is a small toilet, How small is it? The HWMT-8733 model is a small toilet, and the size is 25\" Long x 13.4\" Wide x 28.4\" High. This seat height is 16.5\". Highly recommend. Can I remove this pp seat to install a bidet seat? Yes! Removed the toilet seat and installed the seat which comes with bidet. But make sure both model's measurements are compatible. I am a little worried about the position of the shut off valve, will it affect the installation? There is a picture in the link of the shut off valve position provided by horow. You can measure it according to the size. If the angle valve is on the ground, it may not be suitable. Could this work on 11’ rough in? The 12\" toilet can't be installed on the 11’ roughin, our 10\" toilet can, but there will be a 1\" gap with the wall Is the horow one-piece toilet free return if quality or broken? Yes, HOROW will be responsible for any quality of the product and any damage caused during transportation.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a892aa3e-5739-4681-894c-e59942a11a56.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/46ae87fa-15b7-42bb-b17c-d37f0f21eccd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "D. Solberg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKEMRF5KCQGL7PKUW4F7NCJKB3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R94NNDCXDOLIL?ASIN=B07K32DFHS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2021",
                "reviewTitle": "5.0 out of 5 stars Best small toilet",
                "reviewText": "First off, this toilet looks great, is well made, works well, and fits into a small space. That's a lot to ask for, apparently, because the brands at the big box stories are all at least two inches (or likely more) longer.I was initially worried about the toilet seat on the round model. It has a plenty large enough opening, but the seat is narrow, so I thought that thin people with a bony bottom might feel a little uncomfortable during longer uses. However, after using it for a while, my wife and I actually find it very comfortable. Also, note that we bought the more expensive toilet seat from the same company, which is sturdy and worth it. The one that comes with it is pretty cheap feeling and flimsy (odd because the rest of the toilet seems very sturdy). You can NOT find a toilet seat size at the store that will fit this small toilet.The toilet was pretty easy to install. The washers that came with it were too small, but the toilet flange bolts were thick and of solid quality. Oh, the toilet comes with a sink hose adapter attached for some reason. It's easy enough to remove the adapter and use a standard toilet hose, but I had to make an unnecessary trip to the hardware store because I didn't read the instructions the first time and didn't notice that I could remove it at first.Flushing power seems good so far for #1 and #2, although we haven't really \"challenged\" it yet. So far, it has also stayed clean, so the drop zone is apparently well placed, at least for us.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ooh, shiny gadget.Ooh, shiny gadget.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXAMSEN6MT4WQHSXCV4JRGXWODA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LYA84322YBRY?ASIN=B07K32DFHS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars It really is compact!",
                "reviewText": "The media could not be loaded. In my house, I have a tiny bathroom that doesn't have room for an elongated toilet so this HOROW HWMT-8733 Small Compact One Piece Toilet was replacing a classic round toilet. The problem that I'd always had with the original toilet was that it was uncomfortable to use because of its size.The HOROW features a one-piece design with a dual flush system to save water. It was also described as small and compact which is why I was kinda worried about whether the HOROW would actually be a good replacement because it is also a compact toilet.Installation was very straightforward. Everything I needed was in the box, including the wax ring. The dual flush system was already installed so no additional work there. This toilet had standard fittings and I was able to replace the water pipes without an extra trip out to the hardware store. After installation, I found that this toilet took up even less floorspace, well it took up less physical space overall, than my original round toilet.The flush system needed a bit of adjustment (check my video) to ensure that the button can reach the flush mechanism enough to ensure that it flushed, but after that, everything worked smoothly. I love the dual flush system because the small flush uses less water and because of that, the tank refills super quickly. Flushing the toilet at night will no longer wake anyone up.Speaking of being quiet, this toilet's flush system is really quiet. Much quieter than my original toilet, which I've tried to quiet down through various toilet fill systems. The soft close lids also help to ensure that no one is woken up by a loud bang at night.So to answer the concern I mentioned at the beginning of this review, the HOROW toilet is a bit narrower but it is actually long enough to where it actually felt more comfortable than my original round toilet.This is a good toilet. It fixed a lot of problems I had with my original toilet and actually gave me more space in my tiny bathroom.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/619j4PZ12FL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Hp7B9bx8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Bfecsvo4L.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12603017-3738-49bc-8070-3d5dc688600c/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Richard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5PNKS6SWSRQTZXY5KUQ4V4FEBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HW6OSB1YP7JC?ASIN=B07K32DFHS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Super nice looking toilet (who says that?). Worried about the seat though.",
                "reviewText": "Great looking and small size dual flush toilet here. Too expensive honestly at $250, but hey, there aren't many options for this size in a smaller dual flush and separate tank design. Easy to install.The seat is a bit wobbly though and I worry about it. Just like all the other reviews state. I'm afraid if you aren't perfectly still when sitting on the toilet that the seat keepers will eventually break and a replacement seat is waaaaay too expensive. Crappy.Excellent looking toilet though and other than the seat design it would be a perfect toilet.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Veritas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELJW4OGE6UZCCQJXVP3VYHHHHQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPIOZLUV79537?ASIN=B07K32DFHS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars High quality!",
                "reviewText": "I recently purchased two toilets for my home. One is a Toto Drake 1.6 gpf and the other this toilet that I am reviewing. I am impressed with the quality. The glazing is excellent and applied to the entire exterior. This is unlike the Toto, which does not glaze the back of the tank. I think the quality of the glazing is superior to the Toto, which is surprising. Toto has the reputation of being the best, but this toilet seems like higher quality, at least with the glazing.Bothe this toilet and the Toto Drake use siphoning action for flushing. The Toto has two “tornado” outlets that swoosh around the bowl. This toilet has maybe 30 holes distributed around the rim, like a traditional toilet. But these are angled, so the water comes out and swooshes the entire bowl very effectively. Better than the Toto, frankly. The Toto requires frequent cleaning as its flushing action doesn’t “get it all.” This toilet does a super job, which is great since it is in a tight guest bathroom. This toilet is small but roomy. Oh, get the model that has the upgraded seat. It won’t slide around. Another plus and indicator of quality is that this toilet sits flat on the floor, no rocking. Not quite true of the Toto. Both are fine toilets, but I have to give the edge to this small one-piece over the Toto.Final note: you’ll notice several other brands of what seems like the same, small, one-piece toilet. They are at different price points. I think it likely that they are all made in the same Chinese factory, but to different quality standards. I’m impressed with this particular brand, and I’ll buy this same model again for my small office bathroom.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$319.99",
                "sellerName": "Horow",
                "sellerRating": "4.5"
            }
        ]
    }
}