{
    "remaining_requests": 37577,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Natures-Head-Contained-Composting-Quarters/dp/B009Z7EKIC",
    "body": {
        "name": "Nature's Head Self Contained Composting Toilet with Close Quarters Spider Handle Design",
        "price": "$1,030.00",
        "originalPrice": "",
        "rawPrice": 1030.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Natures-Head-Contained-Composting-Quarters/dp/B009Z7EKIC",
        "soldBy": {
            "sellerID": "A1MN0Q6CDKIQT",
            "name": "Natures Earthly Way",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1MN0Q6CDKIQT&asin=B009Z7EKIC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61XnwyqfH7L._AC_SY606_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Nature's Head",
            "link": "https://www.amazon.com/Natures-Head/b/ref=bl_dp_s_web_20115865011?ie=UTF8&node=20115865011&field-lbr_brands_browse-bin=Nature%27s+Head"
        },
        "brand": "Nature's Head",
        "merchantInfo": "Natures Earthly Way",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 918,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 14 hrs 54 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "No one - and I mean no one - will beat my customer service and individual support",
            "Easy to install by any reasonably handy person.",
            "Absolutely No Odor. No Maintenance. 5 Year Warranty.",
            "Huge Capacity. 2 people using full time will empty every 4-6 weeks. Easy empty in 5 minutes.",
            "A vast improvement over older composting toilet designs. This one works!"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b/ref=dp_bc_aui_C_3?ie=UTF8&node=680350011"
            },
            {
                "name": "Toilets & Toilet Parts",
                "link": "https://www.amazon.com/Toilets-Toilet-Parts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6810474011"
            },
            {
                "name": "Toilets",
                "link": "https://www.amazon.com/toilet/b/ref=dp_bc_aui_C_5?ie=UTF8&node=680355011"
            },
            {
                "name": "One-Piece Toilets",
                "link": "https://www.amazon.com/one-piece-toilets/b/ref=dp_bc_aui_C_6?ie=UTF8&node=542638011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "20.98\"D x 19.02\"W x 20.98\"H"
            },
            {
                "name": "Brand",
                "value": "Nature's Head"
            },
            {
                "name": "Item Weight",
                "value": "28 Pounds"
            },
            {
                "name": "Installation Type",
                "value": "wall"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Seat Material Type",
                "value": "‎Plastic"
            },
            {
                "name": "Manufacturer",
                "value": "‎Natures Head"
            },
            {
                "name": "Part Number",
                "value": "‎NH001"
            },
            {
                "name": "Item model number",
                "value": "‎Spider Handle"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Voltage",
                "value": "‎12 Volts"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B009Z7EKIC"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 918 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#77,006 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #14 in One-Piece Toilets"
            },
            {
                "name": "Date First Available",
                "value": "October 31, 2012"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Toni G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYE66P7MIOS5RFCJGU27JF5RT6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36ZCIVN5A4DNV?ASIN=B009Z7EKIC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2017",
                "reviewTitle": "5.0 out of 5 stars Well I am pleased to report after two weeks of full time use ...",
                "reviewText": "I can't fully express how well this toilet works. I was a little aprehensive about living full time with a composting toilet. I had done a fair bit of research on the topic in preparation for living in a tiny house and this one seemed to be the clear leader.I had so many concerns: would it have an unpleasant odor? Would it be difficult to use? Would it require constant cleaning? What about installation? Most importantly, HOW WILL I LEARN TO AIM??Well I am pleased to report after two weeks of full time use that all my concerns are calmed.Firstly, it has no discernable odor, even when the lid is lifted or the upper portion is lifted partially when removing the liquids bottle to empty it every other day or so. Even when in use it us less odiferous than a standard flush toilet because the little onboard fan is constantly whisking any odors right out the vent hose.It is not difficult to use, just sit and go. Open the trap door before a solids deposit of course, but otherwise just do what you do naturally.Installation was easy, this 50 ish woman with slightly above average handy person skills did it in 15 minutes.Cleaning is simple if you spray down the inside of the bowl with a water and white vinegar mix after EVERY use and perform a minor wipe up with a paper towel (which you then just drop into the trap door) if you have a particularly egregious contact mark. Which leads me to AIMING, which is not even a thing, just sit down comfortably. This thing is so well designed that unless you have some wildly divergent anatomy that I can't even imagine, it is a non issue. That trap door is right where it needs to be. Just remember to open it first. And if you are a dude, just sit already, it's ok, nobody is judging you.As for emptying things, the liquids bottle is easy to remove, cap, carry and dump. I have't got to the point of emptying the solids chamber yet ( I used coir fiber available here on amazon as the composting medium) so I will update if it is anything other than as straightforward and simple as all the other aspects of this product. If you want lots of details on that there are several good youtube videos on the topic.The brilliant design, heavu duty construction, super simple installation and stellar online support makes this worth every single penny.",
                "reviewVotes": "176 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paula",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2JOMZRIPMSZ3H3K7NFGATVAXNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37817WQPZ3AE7?ASIN=B009Z7EKIC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 27, 2018",
                "reviewTitle": "5.0 out of 5 stars With considered attention and minimal effort this is a clean and efficient no water toilet system.",
                "reviewText": "I bought this Toilet system for my vintage Airstream that is parked as a farm dwelling in rural Montana. While it does take a few minutes of reading to understand the system, if you use it with care and pay attention to your output, it works very well. I found it easy to install. I was able to adapt a vent opening to connect the vent hose to the existing toilet exhaust in the Airstream. I trimmed the vent hose to fit nicely. I've got mine in a narrow space so it's not mounted to the floor--I have to pull it forward to release the side clips to empty the urine container and to slide off the solid waste collector. I've just placed a sturdy washable outdoor rubber mat under it and it doesn't slide or tip as the space is snug. Emptying the Urine Container is simple but you do have to empty often--every 2-3 days for 1 person using only this toilet. The solid waste is a bit trickier, but if you follow the directions and upend the solid bin collector into a bag as directed, it's straight forward. Although I could wait longer, I dump the bin every 4 weeks. I'm able to manage it with a bit of effort in the small bathroom space. I use coconut fiber as the composting material--I bought enough to fill a large covered bin which I store outside in all weather--just add the block to your fiber storage bin and add water as directed--when moistened break into pieces--it looks like nice clean brown fibrous material--just allow plenty of room for the coco fiber brick to expand. You can then scoop the coconut fiber into the toilet solid waste receptacle to the right level. When you're ready to empty the solid waste, do stretch the opening of a 13 gallon kitchen bag over the opening of the base tightly over the rim so that you can invert the base and empty the contents into the bag--I use a 13 gallon composting bag. Don't count on the waste to be fully composted when it comes out of the bin although it isn't smelly if you use the toilet as directed. You'll want to dispose of the waste in a responsible manner--further composting or approved disposal method. I dump mine into a fully contained disposal compost system used only for this waste--it will take a long time to fill my system since it contains only the solids from one toilet/one person. I intend to compost it for 2 full years before using it--and then around trees we've planted. So far, I've used the toilet for Fall and Winter use in a mostly heated space but I'll update the review after a full year. I've tried multiple systems for toilet waste--and am very happy with the comfort of the toilet, functionality, cleanliness and appearance. If the costs were less, I'd buy several for our farm--as it is, they're a bit of an investment although I'm very happy to have mine.Edit update. As of May 2022 I’m still completely happy with the toilet and it is still functioning as intended.",
                "reviewVotes": "148 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Molly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 11, 2023",
                "reviewTitle": "My mother ordered it on my account",
                "reviewText": "As the title says. She says it works well. Saved us from having to go pee outside when our sewer lines froze (out of town)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "paula thorneycroft",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 8, 2023",
                "reviewTitle": "Well made and fit for purpose",
                "reviewText": "Had our Natures Head nearly a year now, not the cheapest on the market, but there's a reason for that; it's a well made piece of kit, well designed and customer service is exceptional. Unless you have a fairly arrid climate a fan is a must. Easy to install and maintain.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 4, 2022",
                "reviewTitle": "Teuer aber GUT, ich will nie wieder Chemie im Womo haben",
                "reviewText": "Das Teil hat jetzt 2 x 4 Wochen Skandinavien hinter sich + einige Kurzurlaube in Deutschland, den Lüfter habe ich immer noch nicht angeschlossen, bisher keine Geruchsbelästigung vorhanden, Funktion und Stabilität immer noch unverändert gut. Wie es bei einer Außentemperatur größer 25°C mit den Gerüchen ist kann ich noch nicht beurteilen.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TTT",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on November 24, 2019",
                "reviewTitle": "輸入品と割り切れば",
                "reviewText": "本体は、しっかりとした造りで、良いが床に取り付ける金具は寸法不良で使えない。ACアダプターのコンセント側の付属が無い。細かい所で不満。",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daryn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 5, 2023",
                "reviewTitle": "Easy install",
                "reviewText": "I never used it. Just installed this for a client. Super easy. Almost too easy. Just make sure it’s far enough away from the wall behind it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$1,030.00",
                "sellerName": "Down Time Marine",
                "sellerRating": "5"
            },
            {
                "price": "$1,030.00",
                "sellerName": "Boat and RV Accessories",
                "sellerRating": "4.5"
            }
        ]
    }
}