{
    "remaining_requests": 37498,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SAMODRA-Ultra-Slim-Minimalist-Non-Electric-Adjustable/dp/B08QHTVDM3",
    "body": {
        "name": "SAMODRA Ultra-Slim Bidet Attachment for Toilet - Dual Nozzle (Frontal & Rear Wash) Hygienic Bidets for Existing Toilets - Adjustable Water Pressure Fresh Water Toilet Bidet - Easy to Install",
        "price": "$29.99",
        "originalPrice": "$35.99",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SAMODRA-Ultra-Slim-Minimalist-Non-Electric-Adjustable/dp/B08QHTVDM3",
        "soldBy": {
            "sellerID": "A20T1D8YSREI02",
            "name": "Samodra Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A20T1D8YSREI02&asin=B08QHTVDM3&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B4DWJXLC"
        ],
        "asinVariationValues": [
            {
                "asin": "B091KL4Z41",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31bXCwFctHL._SS36_.jpg"
            },
            {
                "asin": "B091KR1KSZ",
                "variationName": "Color",
                "variationValue": "Rose Gold",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31zZ8ggsuGL._SS36_.jpg"
            },
            {
                "asin": "B08QHTVDM3",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31XmqWHNJwL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31-55jklYmL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/511 06xXnML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41GW8YmfEWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51guh5Z4xQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mKJBJjrdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ebMzT00cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71J54nsmMTL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SAMODRA Store",
            "link": "https://www.amazon.com/stores/SAMODRA/page/19E0B964-F22D-4723-9881-3EB53FF04AA7?ref_=ast_bln"
        },
        "brand": "SAMODRA",
        "merchantInfo": "Samodra Direct",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 15975,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 42 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Enjoy a personalized cleaning experience with DUAL NOZZLE CLEANING MODES. Our SAMODRA bidet features a Posterior Mode for both men and women, and a Feminine Mode for women's private areas. With a simple rotary switch, you can easily switch between the two modes and adjust the water pressure to your liking.",
            "Upgrade your bathroom with ULTRA-Slim Bidet IMPROVED VERSION. Our bidet attachment is 60% thinner than traditional bidets, with a thickness of only 0.19 inches. The improved edge design ensures a perfect fit with most toilets, so you don't have to worry about mismatches.",
            "Customize your cleaning experience with ADJUSTABLE WATER PRESSURE. Our ultra-slim bidet features a rotation controller that adjusts the water pressure based on the angle of rotation. The larger the angle, the stronger the water pressure. Plus, the nozzle starts watering when it rotates 15-20 degrees and reaches maximum pressure at 90 degrees.",
            "Protect your bidet nozzle with NOZZLE PROTECTION DESIGN. Our bidet features a nozzle concave downward design that prevents the nozzle from being broken by the toilet pedestal ring due to external force when using the toilet.",
            "Invest in HIGH QUALITY COMPONENTS with SAMODRA bidet. Installation is a breeze with our simple and detailed instructions, including a stainless steel braided hose, brass T-adapter and Teflon tape."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b/ref=dp_bc_aui_C_3?ie=UTF8&node=680350011"
            },
            {
                "name": "Bidet & Bidet Parts",
                "link": "https://www.amazon.com/Bidet-Bidet-Parts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6810562011"
            },
            {
                "name": "Bidet Attachments",
                "link": "https://www.amazon.com/Bidet-Attachments/b/ref=dp_bc_aui_C_5?ie=UTF8&node=6810564011"
            }
        ],
        "productInformation": [
            {
                "name": "Manufacturer",
                "value": "‎SAMODRA"
            },
            {
                "name": "Part Number",
                "value": "‎B007PW"
            },
            {
                "name": "Item Weight",
                "value": "‎7.1 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎9 x 3.3 x 14.6 inches"
            },
            {
                "name": "Item model number",
                "value": "‎‎Series 07"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Style",
                "value": "‎Dual Nozzles(Rear & Feminine Wash)"
            },
            {
                "name": "Material",
                "value": "Acrylonitrile Butadiene Styrene (ABS)"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Hose Length",
                "value": "‎2.39 Feet"
            },
            {
                "name": "Special Features",
                "value": "‎‎Non electrical, Ultra-Slim, Adjustable water pressure, High compatibility with toilets, Brass pressure control valve"
            },
            {
                "name": "Included Components",
                "value": "‎7/8\" x 7/8\" x 9/16\" Cold Water Brass T-adapter, 9/16\" x 3/8\" Cold Water Connection Metal Braided Hose, 1 * Teflon Tape, Installation and User Guide, 2 Circular Attachment Plates, SAMODRA Bidet Body"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B08QHTVDM3"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 15,975 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,224 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #11 in Bidet Attachments"
            },
            {
                "name": "Date First Available",
                "value": "December 14, 2020"
            },
            {
                "name": "Brand",
                "value": "SAMODRA"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7921cb97-012c-4933-9c71-3ad882edbfde.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/61d4464c-87a2-4be0-9fee-af07a36798d5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/130f4fc2-bc3d-4091-91cd-06545e37bbcd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c479527a-f0f8-45f5-b6da-9514659f65a2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/be42e38b-95d4-4cc3-b070-dde6e0d0afae.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LexiLexi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMNWOPPAPAIG5UN24BXD3SRONOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YF4HXE3R84P5?ASIN=B08QHTVDM3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2022",
                "reviewTitle": "5.0 out of 5 stars This is a must-have!",
                "reviewText": "I've had this for a few months now and it still works great!INSTALLATION: Most people should be able to install this easily, however I don't have any experience with this type of thing. Be very careful that you install the nut with the threads facing the proper way; I stripped them easily which caused a leak that rendered my whole toilet unusable and caused a lot of frustration. Once I replaced the nut and got some help, it was great!PRESSURE/FLOW: The pressure adjustment is not super sensitive like some bidets so you have a wide range between a soft flow and a harder flow. I've used some bidets where a millimeter makes the difference between a comfortable or painful flow, but this one is not like that.USE/INTERFACE: I really like the handle twist operation. It's simple to navigate for new users or children/elderly, very straightforward. It makes for a clean, attractive design. This also did not bulk up my toilet seat so I didn't need risers for the front half of it like some models require. It's unnoticeable!FEMININE WASH: It's very convenient having the feminine wash, specifically after working out or during my time of the month. Even if you are a man, if you have a woman in your life, she will appreciate having this available and feel more comfortable because of it. Having that option for this price is amazing.CONS: I didn't want to get a warm water bidet because of the price and I figured that might be even more difficult for me to install, but sometimes I do wish I had the option. However, that's not the product's fault but just remember this does not have a warm option.In conclusion, for the price, it really is an excellent product. It's honestly life-changing to have a bidet and I recommend them to everyone. You will feel cleaner, clean yourself faster, and save money on toilet paper. If it had a drying function, I would no longer buy toilet paper at all (those styles are quite an investment, however). This is a major improvement in my life as-is. As mentioned, the price is truly unbeatable for the product you're receiving. I was prepared to pay double for what I considered an \"inexpensive\" type and I'm so glad I found this. You will not be disappointed.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61+9To8XyTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61L7KNB3N9L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Music In Mind",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGF67MAIWJMISNAISIC64FQWV6MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3A7Y6W85P9C6L?ASIN=B08QHTVDM3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Hail To The Happy Heinie!",
                "reviewText": "I sighted bidets frequently while traveling Europe decades ago. My young, naive perspective at the time merely considered it an exclusive domain of the female gender.Years later it found its way to American residential toilets in various forms that include a simple attachment such as this Samodra brand that is of eloquently simple design and reliable function. Installation was relatively easy with care to secure the hoses and align the nozzle. In use, targeting the anus with its stream provides a most thorough cleansing. One may need to scooch around the seat for optimum alignment. TMI?This and some other bidet attachment brands offer a version for the female anatomy, replacing the “nozzle-cleansing downwash\" with an alternative stream.A LUXE Bidet 4 piece Universal Toilet Seat Bumper Kit (sold on Amazon) will level the seat to accommodate the attachment.This Samodra bidet performs very well, offering myriad benefits I note here: 1. Eliminates toilet paper 2. Saves sewer or septic system 3. Cleans thoroughly 4. Provides hands-free hygieneShower your heinie clean with a bidet, and walk away fresh every time. Oh, and never again buy another roll of toilet paper.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tea-talk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPT6WODD77QRUOBAXOR6UT7FPGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9GT1LZEGKFUA?ASIN=B08QHTVDM3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2022",
                "reviewTitle": "5.0 out of 5 stars Sceptic No More!",
                "reviewText": "My husband and I watch a lot of YouTube...a lot of YouTube. One of our favorite channels has been sponsored by Hello Tushy off and on for a while now and it got my husband thinking that he might like to try a bidet. Since Hello Tushy is EXPENSIVE (and we are broke millennials), we decided to try something cheaper. I am EXTRMELY pleased with this bidet! I honestly didn't think I'd like this weird contraption - why would I want water shooting up my butt? What if it missed? How was I supposed to get clean? But little did I know that these were all just baseless fears - probably encouraged by \"Big TP\", the toilet paper industry that wants to continue to get more of my hard earned money!When we got the bidet, we found out that it was very easy to install. Full disclosure - we did end up having to go to the hardware to get a new supply line hose because the rubber gasket on the old one basically disintegrated as soon as we unscrewed it to add the bidet line. So, it cost us $2.99 plus tax extra plus a trip to the hardware store. But I don't blame the bidet for that - blame a toilet that has probably been in the house since 1978. (Hey, if it ain't broke, don't fix it!) So, not including the trip to the hardware store, it probably took us 20 minutes or so to install.I absolutely love how slim this design is - I've seen other bidets that require a toilet seat lift or something like that, and this one does not require any extra hardware.The water pressure is also great - not too rough, but definitely enough to make you feel clean! Also, full disclosure - when we installed it, we wanted to see how it worked, so my husband sent me out in the hall FAR AWAY from the toilet so I could watch him turn it on. I still got sprayed in the face from probably 5-7 feet away. He did have it on full blast, and he did apologize...but there was much laughter and hilarity that ensued. Thank goodness it was clean supply water and not toilet water!Anyway, since we have installed this bidet, neither of us will use another toilet to do our business! Forget family holiday gatherings now - everyone is coming to our house for Christmas because my husband doesn't want to use his parents' toilet any more! I also think I've convinced my brother to buy one for himself. (Guess there is another family we can safely visit for holidays now though.)Do yourself and the planet a favor and get this bidet! It is a great model, easy to install, and will save you a ton of money on toilet paper! I will never go back!",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ricardo M. IbarraRicardo M. Ibarra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF26IHWL6E2Y2YMH6TL6VHL4BBNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33GVBI8A36GUJ?ASIN=B08QHTVDM3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "4.0 out of 5 stars The quality and the design.",
                "reviewText": "Easy to use and easy to install. It looks so much nicer than the one I bought 2 years ago. Dual jet is cool and the handle, the thickness, and the the knob is just perfect.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61bjwK8x+oL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71hsp5RgPhL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arturo Sallas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 28, 2024",
                "reviewTitle": "Funciona",
                "reviewText": "Anteriormente instalé uno que no tenía suficiente presión, y lo tuve que regresar. Compré este y funciona perfecto. Lo instale en 20 minutos.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miriam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 5, 2023",
                "reviewTitle": "Excelente!",
                "reviewText": "muito prático e fácil de instalar!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A Voracious Reader",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 22, 2023",
                "reviewTitle": "A very good choice for a cold water bidet",
                "reviewText": "After a trip to Japan I came home an immediately installed three cold-water bidet attachments on my toilets. I bought two different brands, including this one. Both were good, but I greatly prefer this one.I absolutely love the very streamlined controls. (The other brand I bought, had two dial knobs). It's just a simple twist of the wrist, and you get a stream to the front; twist the other way, and you get a stream that is more toward the back.Because there are no knobs and its so sleek in design, cleaning it is really easy and it can remain hygienic. Remember this sits next to your toilet bowl so I wanted something that is easy to clean in case of pee splashes.Installation was very simple, the instructions were clear and it came with everything including the plumber's tape and a template. The profile of the unit is very slim, so it fit under my existing toilet with no problem. I've had it now for 6 months, have used it literally daily, and it does not leak whatsoever.Highly recommended, especially for the price.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Skinky",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 11, 2023",
                "reviewTitle": "Incompatible with UK plumbing.",
                "reviewText": "Wish I'd read the reviews. Impossible to plumb this in. My husband plumbed the whole house but couldn't source connections that would adapt the fittings of this device. Don't see a way to contact the supplier either. If anyone has a solution please post it in the questions section.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "parto avaz poor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 14, 2022",
                "reviewTitle": "Not so good",
                "reviewText": "I am not pleased with its pressure adjustment",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$35.99",
                "sellerName": "Samodra Direct",
                "sellerRating": "5"
            }
        ]
    }
}