{
    "remaining_requests": 37442,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Throne-Bidet-Attachment-Toilet-Non-Electric/dp/B0CNTPQK1W",
    "body": {
        "name": "Bidet Attachment for Toilet – Non-Electric Self Cleaning Water Sprayer Toilet Bidet Double Nozzle (Frontal & Rear Wash) Bidet Toilet Seat Attachment, Easy Install (White)",
        "price": "$49.99",
        "originalPrice": "$49.99",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Throne-Bidet-Attachment-Toilet-Non-Electric/dp/B0CNTPQK1W",
        "soldBy": {
            "sellerID": "A2TK136XWSMSWJ",
            "name": "Moss Plumbing",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2TK136XWSMSWJ&asin=B0CNTPQK1W&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNTR6Q5J"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CNTR16RV",
                "variationName": "Color",
                "variationValue": "Black/Chrome",
                "price": "$49.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ehpKtwclL._SS36_.jpg"
            },
            {
                "asin": "B0CNTPQK1W",
                "variationName": "Color",
                "variationValue": "White/White",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31grYTAuToL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "406",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31grYTAuToL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41J4LW08IQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HeApW0h5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bvbsaEf3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RJcFFxJ-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hid 16HTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mssUQfnPL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Throne Store",
            "link": "https://www.amazon.com/stores/Throne/page/3A37413D-81B4-421C-B7E8-28A5A6C0F71C?ref_=ast_bln"
        },
        "brand": "Throne",
        "merchantInfo": "Moss Plumbing",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 29,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Premium Quality Components: Crafted with top-tier materials, our bidet toilet attachment boasts high-quality components, featuring durable ABS construction and woven steel hoses for long lasting durability. Resistant to wear and tear, it minimizes the need for frequent replacements. The ultra-slim design ensures seamless compatibility with various toilet types.",
            "Dual-Nozzle System: A dual-nozzle system in toilet spray bidet enhances the cleansing experience by providing dedicated nozzles for posterior and feminine wash. This feature accommodates diverse hygiene needs, making the bidet a practical and inclusive solution for households with various family members while promoting hygiene, comfort, and versatility in use.",
            "Quick and Easy Installation: No need for professional plumbing services! Our toilet bidet attachment can be easily installed in minutes, fitting most standard toilets. All necessary parts and tools are included. Our Ultra-slim toilet bidet is designed to fit the most standard U.S toilets. Enjoy adjustable water pressure, dual nozzles, and a hygienic cleanse in minutes!",
            "Cost-Effective & Eco-Friendly: Our bidet attachments for toilets are cost-effective and eco-friendly alternatives to tissue paper. With water cleansing, our self cleaning bidet not only helps in reducing skin itchiness and irritation but also reduces paper waste while promoting environmental sustainability. Our water bidet offers a hygienic and economical solution for a more efficient bathroom routine.",
            "Satisfaction Guaranteed: We believe in the quality of our non electric bidet for toilet and the satisfaction of customers is our top priority. If you are not happy with Throne Easy install bidet for any reason, please feel free to contact us. We will try our best to satisfy you. Your compliments and complaints about our product are highly appreciated and welcomed."
        ],
        "description": "Experience the next level of cleanliness and comfort Transform your daily routine with this luxurious bidet experience. Experience the next level of cleanliness and comfort. Say goodbye to traditional methods and embrace modern freshness. A touch of sophistication for your bathroom – because you deserve it. Redefine your bathroom experience with this must-have attachment. The sleek and modern design of the Throne Bidet not only enhances your bathroom's aesthetics but also promotes a more hygienic environment. Its slim construction ensures universal compatibility with most standard toilets, making installation simple and convenient.",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b?ie=UTF8&node=680350011"
            },
            {
                "name": "Bidet & Bidet Parts",
                "link": "https://www.amazon.com/Bidet-Bidet-Parts/b?ie=UTF8&node=6810562011"
            },
            {
                "name": "Bidet Attachments",
                "link": "https://www.amazon.com/Bidet-Attachments/b?ie=UTF8&node=6810564011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Throne"
            },
            {
                "name": "Mounting Type",
                "value": "Wall Mount"
            },
            {
                "name": "Color",
                "value": "White/White"
            },
            {
                "name": "Included Components",
                "value": "Bidet Attachment; All necessary bolts and nuts for secure installation; T-Adapter: For connecting to the water supply line; Flexible Hose: For connecting the bidet to the T-adapter; Rubber Washers: To ensure a watertight seal in all connections; Instruction Manual: Detailed guide for installation and usage; Quick Reference Guide: For easy understanding of features and controls. See more"
            },
            {
                "name": "Handle Type",
                "value": "Knob"
            },
            {
                "name": "Model Name",
                "value": "KGxTHRONE"
            },
            {
                "name": "Handle Material",
                "value": "Brass"
            },
            {
                "name": "Is Electric",
                "value": "No"
            },
            {
                "name": "Manufacturer",
                "value": "‎Moss Plumbing LLC"
            },
            {
                "name": "Part Number",
                "value": "‎B023"
            },
            {
                "name": "Item Weight",
                "value": "‎1.7 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎8.63 x 15.37 x 2.05 inches"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎B023"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B0CNTPQK1W"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 29 ratings 4.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,224 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #34 in Bidet Attachments"
            },
            {
                "name": "Date First Available",
                "value": "November 22, 2023"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Step into the Future of Personal Hygiene with this Smart Bidet Attachment Upgrade your Throne with this Innovative and Refreshing Addition Built for Longevity: Made from extremely high-quality and durable materials, our bidet is made to provide reliable performance and maintain its aesthetic appeal over time. Self-Cleaning Functionality for Enhanced Hygiene: With hygiene as a top priority, our bidet includes an automated self-clean button. This feature ensures the nozzles are rinsed and cleaned before and after each use, maintaining cleanliness and peace of mind. Dual-Nozzle Cleansing: Experience tailored comfort with adjustable nozzles for both bottom and feminine hygiene.Self-Cleaning Feature: Ensures optimal hygiene with an automatic nozzle cleaning function.Intuitive Controls: Easy-to-use buttons and intensity knob for a personalized cleaning experience.Quick-Detach Design: Simplify maintenance with an easy lock-and-unlock mechanism for hassle-free cleaning.Ultra-Slim Elegance: Modern, sleek design that fits seamlessly with any bathroom decor.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eff7e738-4082-4662-aff2-bf52b269e47f.__CR0,0,1293,800_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Ultra-Slim, Modern Design: The sleek and modern design of the Throne Bidet attachment not only enhances your bathroom's aesthetics but also promotes a more hygienic environment Intuitive Controls for Ease of Use: Featuring easy-to-read buttons and an intuitive intensity knob, which allows effortless adjustment of water pressure, ensuring a comfortable experience for you and your loved ones The Perfecr Choice for Family: Elevate your bathroom experience with the Throne Bidet, a cutting-edge addition to modern hygiene, perfectly blending functionality with an elegant design.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a032e63c-ca6f-4440-8324-e1c88ac3284b.__CR0,0,2500,2500_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8211ffed-1cc6-4c9a-9115-162056e54798.__CR0,0,2500,2500_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ab4566f-a025-4248-8579-34ec4d7aaffd.__CR0,0,2500,2500_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "A Small Change that Makes a Big Difference in Your Daily Routine Revolutionize Your Routine with the Refreshing Touch of Advanced Bidet Technology! What are the advantages of the Throne bidet attachment? Bidet attachments provide a more thorough and effective cleaning compared to traditional toilet paper, promoting better personal hygiene.Elevate your hygiene routine effortlessly with our bidet attachment – a modern solution for a cleaner, more comfortable bathroom experienceBy reducing the need for excessive toilet paper usage, bidet attachments contribute to a more sustainable bathroom routineOver time, using a bidet attachment can lead to cost savings as it decreases the reliance on toilet paperThe gentle stream of water from a bidet attachment can be particularly soothing and provide relief, especially for individuals with certain medical conditionsBidets can help prevent skin irritation, itching, and discomfort that can be caused by excessive wiping with toilet paperBidet attachments are often beneficial for individuals with mobility issues or those who may find it challenging to reach and wipe effectivelyUsing a bidet attachment may reduce the risk of certain infections and contribute to overall genital healthExperience the luxury of advanced cleansing. Our bidet attachment not only enhances personal hygiene but also adds a touch of sophistication to your bathroom",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2fa359b7-ac91-45f2-b3f0-ac586442fe95.__CR0,0,1293,800_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "No Need for Extensive Plumbing Changes or Professional Help! Some Warm Tips Adjust the Temperature: Find a comfortable water temperature to enhance your experience and prevent any discomfort.Start with Low Pressure: Begin with a gentle water pressure setting, gradually increasing to your preference for a soothing cleanse.Optimal Positioning: Ensure proper seating on the bidet seat to allow the water stream to reach its intended area effectively.Posterior and Feminine Wash: Familiarize yourself with the different wash options, catering to both genders for a thorough and personalized cleanse.Maintain Cleanliness: Regularly clean the bidet nozzle and surrounding areas to ensure a hygienic experience every time you use it.Consider Sensitive Settings: If you have sensitive skin, opt for lower pressure and warmer water to prevent any irritation. Remember, using a bidet is a personal experience, so feel free to customize the settings to match your comfort level and preferences. Enjoy the upgrade to a cleaner, more refreshing bathroom routine!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e7e0f5ad-6514-4e18-be4d-373764de82b3.__CR0,0,1293,800_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Contribute to Overall Genital Health",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ba22f53a-38b6-4c81-9db9-7166721f212b.__CR0,0,1293,800_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Experience the next level of cleanliness and comfort Transform your daily routine with this luxurious bidet experience. Experience the next level of cleanliness and comfort. Say goodbye to traditional methods and embrace modern freshness. A touch of sophistication for your bathroom – because you deserve it. Redefine your bathroom experience with this must-have attachment. The sleek and modern design of the Throne Bidet not only enhances your bathroom's aesthetics but also promotes a more hygienic environment. Its slim construction ensures universal compatibility with most standard toilets, making installation simple and convenient. Prominent Features: Patented in the USA Non-Electric Self Cleaning Frontal & Rear Wash Easy Install & ultra-slim Detachable Dual nozzle Cold water bidet",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5f3afb96-e4cf-4a12-9ad1-6579531d9c7f.__CR0,0,2500,2500_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/09bb2bb9-9add-42a0-8652-0767577273eb.__CR0,0,1293,400_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eff7e738-4082-4662-aff2-bf52b269e47f.__CR0,0,1293,800_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a032e63c-ca6f-4440-8324-e1c88ac3284b.__CR0,0,2500,2500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8211ffed-1cc6-4c9a-9115-162056e54798.__CR0,0,2500,2500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ab4566f-a025-4248-8579-34ec4d7aaffd.__CR0,0,2500,2500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2fa359b7-ac91-45f2-b3f0-ac586442fe95.__CR0,0,1293,800_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e7e0f5ad-6514-4e18-be4d-373764de82b3.__CR0,0,1293,800_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ba22f53a-38b6-4c81-9db9-7166721f212b.__CR0,0,1293,800_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5f3afb96-e4cf-4a12-9ad1-6579531d9c7f.__CR0,0,2500,2500_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEE3WYSTBQA7Y7GPKHGAEKRERWAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10TOC41JZ6VDS?ASIN=B0CNTPQK1W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Sleek Design, Easy Install, Clean Butt",
                "reviewText": "Love the elegant design and easy to use buttons. First bidet I've owned, and like many say, \"I can't believe I waited this long.\" Worth every dollar. Very sturdy and high quality. Water line and fittings are all metal. The pressure control works great and can be set to your pleasure and comfort, especially if you're new to water shooting up your bum. Thanks, KingGeorge",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul E. Cooley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDLZCATXF45ZQQG5JCRD2BF3RRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIX5PT90OBI6T?ASIN=B0CNTPQK1W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Clean Butt, No Complaints",
                "reviewText": "Was fairly easy to install, although I had to thread the T-adapter with all the other attachments detached in order to get it to screw in properly. Apart from that, the bidet is excellent in construction and a welcome potty companion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mason",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6PFCFI4MR342QTB5RYRJTAV4NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A86LJH9MCX1J?ASIN=B0CNTPQK1W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Very high quality components",
                "reviewText": "Incredibly easy to install and the components are clearly high quality, nothing feels cheap about this bidet. Great price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mossimo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHJGN76HNF7BE6BW42JPLD7Q3WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FAHV4BOYIYE7?ASIN=B0CNTPQK1W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Buy!!!!!",
                "reviewText": "Very easy to instal. Very slim and neat looking. Super easy to use. No problem. So much happy of my purchase. I had all our three toilets with this bidet. No issue. No leak problem.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan Michael ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWZGJUHXVHPHM5JAE3MVLWQFKOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R136DUDE0IXM8I?ASIN=B0CNTPQK1W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Attractive look, easy to use, super durable",
                "reviewText": "I love how this looks sleek with the rest of my modern bathroom. The design of the bidet is fantastic. I put it on my main level and get compliments from my guests!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rich EnckRich Enck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEL6VWIVEED4DIVOKY7EY6HSSIGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AL6BXNOH8KE3?ASIN=B0CNTPQK1W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Product",
                "reviewText": "Nothing bad to say about this amazing product, easy install, easy instructions and incredible functionality of product.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+C8v9fpOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/811a2yvI8UL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Derek LopezDerek Lopez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF325OJAML4LXA5GIW47PHGKA5XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXXOPVS0LME70?ASIN=B0CNTPQK1W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars The button map and it's component's are really good quality.",
                "reviewText": "The installation was fast and easy took me about 15 to 20 minutes and the water pressure is perfect thanks KG and I'll see you on the next stream .",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61GzY3d1JQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61dPvQ6D2OL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61jBsFTLV3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/718sYYkX7nL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lito",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4NK7AWNOQTUOZF7WCVYARAXQSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R157STMEFJNM9U?ASIN=B0CNTPQK1W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars It feels good",
                "reviewText": "It cleans so well and takes alllll the gunk around. 10/10",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}