{
    "remaining_requests": 37387,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/MS854114SL-01-Ultramax-Toilet-Cotton/dp/B001DEN5JU",
    "body": {
        "name": "TOTO MS854114SL#01 Ultramax ADA One Piece Toilet, Cotton White",
        "price": [
            "10 options from$772.99"
        ],
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/MS854114SL-01-Ultramax-Toilet-Cotton/dp/B001DEN5JU",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B00313JTMI"
        ],
        "asinVariationValues": [
            {
                "asin": "B001DELJZW",
                "variationName": "Color",
                "variationValue": "Bone",
                "price": "$1,130.68",
                "variationImageURL": "https://m.media-amazon.com/images/I/31KHalXSLLL._SS36_.jpg"
            },
            {
                "asin": "B000TFCQNA",
                "variationName": "Color",
                "variationValue": "Colonial White",
                "price": "$784.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/31S3ZX5iYjL._SS36_.jpg"
            },
            {
                "asin": "B001DEN5JU",
                "variationName": "Color",
                "variationValue": "Cotton",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31+JlVX17tL._SS36_.jpg"
            },
            {
                "asin": "B000TFBRZS",
                "variationName": "Color",
                "variationValue": "Sedona Beige",
                "price": "$828.42",
                "variationImageURL": "https://m.media-amazon.com/images/I/31HQlRA4NbL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31 JlVX17tL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31sJvkCmDzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31w-rKEZttL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/3110rHF3uSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/312YDuwWI9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31ANvcC7UgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419AVGJ15FL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1CDmLsYZ3S.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81xk0Rl5naL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the TOTO Store",
            "link": "https://www.amazon.com/stores/TOTO/page/B123FCFC-ED54-45A5-870A-32AA77BA4B73?ref_=ast_bln"
        },
        "brand": "TOTO",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 102,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Toto MS854114SL#01 ADA ULTRAMAX ONE PIECE TOILET COTTON",
            "G-Max flushing system: Quiet, powerful, commercial grade flushing performance",
            "Fast Flush: Wide 3-Inch flush valve is 125 percent larger than conventional 2-Inch flush valves",
            "Wider, 2-1/8-Inch computer designed, fully glazed trapway",
            "Large water surface",
            "Bowl Rim Height 17 1/4-Inch, Tank Height 29-1/4-Inch, Tank Width 16-1/2-Inch"
        ],
        "description": "Product Description TOTO MS854114SL#01 Ultramax ADA One Piece Toilet, Cotton White From the Manufacturer ADA Height, sleek high profile elongated one piece toilet with 12-Inch rough-in. Low consumption (6 Lpf/1.6 Gpf) siphon jet flushing action. Tank cover, fittings, chrome plated trip lever and SoftClose seat included. G-Max's extra-wide 3-Inch flush valve and wide 2-1/8-Inch glazed trapway offer increased flow, drawing water into the bowl more quickly, and then away more forcefully . And with G-Max's powerful siphon jet, the system makes sure what goes down stays down. G-Max is the industry benchmark for flushing performance with features like: A larger 2-1/8-Inch glazed trapway offers increased flow, drawing water into the bowl more quickly and then away more forcefully to prevent clogging. A huge 3-Inch flush valve creates a quicker, quieter, more forceful flush. An extra large siphon jet generates unmatched power for one-flush superiority to make sure what goes down stays down. This toilet complies with ADA regulations for height. Toto's SoftClose seat is the latest in innovative smart seat technology with Comfortable Ergonomic Design, Molded Bumpers, and High Gloss Polypropylene. (Resistant to Chemicals and Cleaning Agents.) Constructed of solid, high-impact plastic, this unique seat is specifically designed to reduce injury and to eliminate annoying \"Toilet Seat Slam\". The seat and lid utilize a built-in SoftClose hinge system, which lowers the seat down to the bowl gently and quietly. The engineering of SoftClose incorporates Toto's high standard of quality and consumer ease. Top tightening mounting bolts ensure easy installation. And of course, all seats are precision designed to fit regular or elongated bowls.",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b/ref=dp_bc_aui_C_3?ie=UTF8&node=680350011"
            },
            {
                "name": "Toilets & Toilet Parts",
                "link": "https://www.amazon.com/Toilets-Toilet-Parts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6810474011"
            },
            {
                "name": "Toilets",
                "link": "https://www.amazon.com/toilet/b/ref=dp_bc_aui_C_5?ie=UTF8&node=680355011"
            },
            {
                "name": "One-Piece Toilets",
                "link": "https://www.amazon.com/one-piece-toilets/b/ref=dp_bc_aui_C_6?ie=UTF8&node=542638011"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Cotton"
            },
            {
                "name": "Material",
                "value": "Porcelain"
            },
            {
                "name": "Brand",
                "value": "TOTO"
            },
            {
                "name": "Item Weight",
                "value": "89 Pounds"
            },
            {
                "name": "Installation Type",
                "value": "Floor Mounted"
            },
            {
                "name": "Shape",
                "value": "‎open-front"
            },
            {
                "name": "Seat Material Type",
                "value": "‎Plastic"
            },
            {
                "name": "Manufacturer",
                "value": "‎Toto"
            },
            {
                "name": "Part Number",
                "value": "‎MS854114SL01"
            },
            {
                "name": "Product Dimensions",
                "value": "‎32 x 20 x 17 inches"
            },
            {
                "name": "Item model number",
                "value": "‎MS854114SL#01"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Size",
                "value": "‎12 Inch"
            },
            {
                "name": "Style",
                "value": "‎Traditional"
            },
            {
                "name": "Finish",
                "value": "‎Chrome"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Water Consumption",
                "value": "‎1.6 Gallons per Flush"
            },
            {
                "name": "Flush Type",
                "value": "‎Water Saving Toilets"
            },
            {
                "name": "Included Components",
                "value": "‎ADA ULTRAMAX ONE PIECE TOILET COTTON"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "Warranty Description",
                "value": "‎One Year Limited Warranty"
            },
            {
                "name": "ASIN",
                "value": "B001DEN5JU"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 102 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#369,514 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #129 in One-Piece Toilets"
            },
            {
                "name": "Date First Available",
                "value": "January 25, 2008"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "WearbeWearbe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH75F6FJJ3UYY5RJKHZNWLQ6ZZDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NMXDXQYTPVUL?ASIN=B001DEN5JU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 26, 2011",
                "reviewTitle": "5.0 out of 5 stars The Best Toilet in the WORLD!",
                "reviewText": "Toto Ultramax MS854114SL (SL means it is the tall version)I researched toilets for a couple of months back when we put in our first bathroom. This had great reviews back then and from the reading I did it was the clear winner. I bought this almost 3 years ago and we, a family of 4, have been happy users all this time.I'll start with the most important paragraph then hit the other points in a more logical way...The Flush: I have HATED low-flow toilets ever since they came out. My Grandmother put one in several years before I got this one and it has had nothing but trouble. We have to flush it 2 or 3 times for anything solid. Plus it had weak internals and randomly leak-flushed. After experiencing that P.O.S. toilet I was dismayed at the thought of having to buy my own low-flow and pined for the robust flushes of my youth. Toto had some 1.28 GPF toilets but when I saw they had this 1.6 GPF I marked that down as \"necessary\". I have no idea how the 1.28s work, but this 1.6 one is GREAT. I have put some monsters down this toilet and there has never even been a slight hiccup. We have never plunged nor double flushed. It is a dream toilet with a supreme flush.Installation: I used a wax-free toilet seal (3 inch) since we have in-floor heating and a wax seal would melt. That was easy as all you do is peal the sticker back off the rubber seal, flip the toilet upside down, paste the seal over the column-hole thingy, flip the toilet back around and lower it onto the hole in the floor while guiding the two screws up through the holes in the toilet base. It took about 4 minutes and there was never a problem afterward.Over all presentation: The lines are clean and it is attractive. The single piece design is super easy to clean and I no longer have to fish sponges, wipies or rags through the tank crack. I originally wanted an enclosed trap design so I could just sponge off the sides, but this is so smooth and easy to clean that it is just as good.Seat height: This is one of very few toilets that I liked that has a seat height above 17 inches (the SL in MS854114SL). I am 6 foot, 180 lbs. My wife is 5'9\" (and nobody knows how much she weighs). We are both tall with long legs and the seat height is PERFECT. I feel like I'm squatting when I use standard height toilets now, so be careful if you get this, it will spoil you.Seat: The seat that comes with it is brilliant. You can \"drop\" the seat (and/or cover) and it will slowly and quietly lower itself into the closed position. Or you can push it down of you are doing the wee-wee dance and don't feel like waiting. Either way, it never slams down and I love not hearing that crash anymore. Additionally, the seat is molded in a way that if you have small children who are learning how to urinate while sitting it somehow catches the pee that passes between the stool and the seat. The underside is curved upward but other than that it is a mystery how it works. I have never cleaned urine dribbles off the front of the toilet but I frequently have to paper off the underside of the seat after my son misses the water. It is a small but nice feature. Lastly, it is amazingly comfortable. My wife wanted to get a padded seat but we waited for some reason and after we used the toilet for a week we have never thought about the padded toilet seat again.The tank: There have been no problems so the only times I've looked into the tank was back when we didn't have running water for a while and I had to manually fill the tank from stored water. My only gripe with the design is that the glue holding the Velcro onto the lid was not stronger than the Velcro, so both pieces of Velcro now stay on the tank side and serve as a cushion for the lid. I would have preferred a tank lid that was molded to fit so the Velcro wouldn't be needed. But it looks nice and it has never fallen off, so it isn't a big deal.I just bought our second Toto Ultramax MS854114SL today to put into our 2nd bathroom which we are finally finishing up this week. I don't know a better way to endorse this than to buy another one. Oh, my Mom loves this toilet now, too, and will be getting several when she and my Dad remodel their bathrooms this summer.____________________Update 25 March 2013These toilets are still going strong. We did have a small issue last month, but it was easily resolved: The toilets both started randomly flowing, making a high pitched squeal. At first, we fixed it by flushing the toilet, but over the course of a couple of months the problem got worse until there was a very small, constant flow after flushing. I initially thought that the flappers had worn out, but when I stuck my hand into the reservoir to do a tactile inspection of them, I noted that they were coated in a slippery film. We have a salt-water system in the house, so maybe it is just a reaction between the salt and plastic, not sure. Anyway, I rubbed the flappers between my thumb and fingers until they no longer felt slippery and, WALLA, the problem is no more. We are still very happy with these toilets.____________________Update 12 December 2014Still happily sitting tall and single-flushing. I had to clean the flappers again this month and the first toilet we bought needed a little special doctoring on its flapper. Due to the slippery film, the flapper had caved in a little and deformed so that it was ever-so-slightly oval instead of round. After cleaning it, it remained deformed which allowed it sometimes flow a little and do that squeal. I emptied the tank, poured in some hot water (not quite boiling), and stretched the flapper in the direction it needed in order to return to circular. I held it there as I turned the cold water back on and let the flapper \"solidify\" again. I plan on cleaning the flappers every 6 months, squeal or no squeal, to reduce the chance of deforming.____________________Update 24 September 2015The first toilet's flapper is now grossly deformed and constantly leaks, so I ordered a $12.50 replacement flapper: TOTO THU499S Universal Flapper TOTO THU499S Universal Flapper Installation was very easy and took about 5 minutes. My original pink flapper required cutting of its rubber at the attachment point. The replacement had forks that easily snapped into place. The Toilet Model to be used on the chart on the back of the box is \"CST854S(L)(G)\" which is Arrow setting 7 (just twist the red cap to the 7), chain length 13 (I simply made the chain taught when the flush handle was at rest), Lever Hole 3 (I don't think this is overly important as it works on any of the 3 holes available on mine).We are back to having the best toilet in the world!Note: I originally spent $439.24 after shipping on this toilet. Current Amazon prices have shot way up. Last week I ordered a 3rd toilet for an addition and paid $472.51 after shipping.",
                "reviewVotes": "81 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71NaYtF+CjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71UPV7d8hmL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4J65ZEJQ77O7ESJZB34H4ZNIKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RE5DU1EVA2E4?ASIN=B001DEN5JU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 4, 2011",
                "reviewTitle": "5.0 out of 5 stars Worth every penny",
                "reviewText": "This is my first time submitting a review on Amazon for anything and I am a Prime member who utilizes Amazon monthly. The TOTO arrived in perfect shape with all items. Install was a snap in my newly remodeled master bath. This toilet replaces a old Gerber which I liked because it was not a low flow toilet. My only complaint with the Gerber was even with flushing 7.5 gallons or more per flush in recent months it was getting stopped up 2 to 3 times a week. I have not been a fan of low flow toilets (in my experience most leave residue with 1 flush). The TOTO Ultramax has changed my opinion. It does the job with 1 flush, less water (1.5 gallons)and no leftover residue. It also looks great. The elongated bowl and ADA height make it comfortable for everyone in my household (2 adults, and 2 teenagers).My toilet wasn't purchased with the sanagloss feature, but whatever coating it has in the bowl resists staining.Overall it is a pricey toilet (you could buy 2 or 3 toilets from your local home improvement store for the price of 1 TOTO) but in my opinion best toilet I have used. I am retired US Army, I have utilized toilets worldwide in my career (most other countries have either been utilizing low flow for years or they don't regulate water usage)and hands down this is the best looking toilet, that performs perfectly with less use of resources I have ever utilized.Think on this, when you like whatever you have purchased you don't think about the cost. I my experience, I only sweat the cost on things I don't like. I really like the TOTO Ultramax.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Sinclair",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSFPTI2WNIAG6UZHU6I7O3CGMXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G0NVZU6IT9G?ASIN=B001DEN5JU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2012",
                "reviewTitle": "5.0 out of 5 stars One of the best toilets available",
                "reviewText": "Compared to Kohler, American Standard, and other consumer grade toilets available, this one tops the list. This toilet is not the jet-powered flush variety you find in airports and bus stations, but it does take care of business in \"one flush\". Since the 1.6 gal (low volume) toilets were mandated in the late 90's, I have experienced poor performance that often require multiple flushes. Well, not so with this Toto. It may cost a bit more but worth the money. It's increased height is more comfortable, the flush is reasonably quiet, and efficient at it's job. No more wasted time on visual inspections and waiting to recharge for another flush (I have better things to do with my time).I particularly like the Toto \"one-piece\" unit -- it eliminates the hassle of installing the water tank on the cheaper two-piece units. And the larger, elongated area opening is far superior to the smaller, circular area design that violates and contaminates male organs (who was the genius behind the ubiquitous circle opening?) Overall, it's a very good design.I installed two of these and am in the process of ordering four more. In fact, my wife enjoys this Toto so much that the usual one-trip a day visit has turned into a multiple-trip per day occurrence. Yes, she enjoys the experience that much. Says it was her best valentines present ever.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ron salzman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 27, 2014",
                "reviewTitle": "One Star",
                "reviewText": "terrible transport company",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}