{
    "remaining_requests": 37352,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LUXE-Bidet-Plus-Next-Generation-Self-Cleaning/dp/B0B1GZ32FF",
    "body": {
        "name": "LUXE Bidet NEO 120 Plus - Only Patented Bidet Attachment for Toilet Seat, Innovative Hinges to Clean, Slide-in Easy Install, Advanced 360° Self-Clean, Single Nozzle, Rear Wash (White)",
        "price": "$43.99",
        "originalPrice": "",
        "rawPrice": 43.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LUXE-Bidet-Plus-Next-Generation-Self-Cleaning/dp/B0B1GZ32FF",
        "soldBy": {
            "sellerID": "A1OP21VZD8M3FB",
            "name": "Luxe Shop",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1OP21VZD8M3FB&asin=B0B1GZ32FF&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B1S914F1"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B1GZ32FF",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$43.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/313Q+U5ngCL._SS36_.jpg"
            },
            {
                "asin": "B0B1G14SND",
                "variationName": "Color",
                "variationValue": "Chrome",
                "price": "$43.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31xKCvzGNHL._SS36_.jpg"
            },
            {
                "asin": "B0B1GWNDW1",
                "variationName": "Color",
                "variationValue": "Rose Gold",
                "price": "$38.77",
                "variationImageURL": "https://m.media-amazon.com/images/I/31JVl7t7MlL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/313Q U5ngCL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41DkBWB54aL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aYA3PzzgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fltA6pVCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EuY KmhtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Qh8ngHyCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/817RmzHwPhL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the LUXE Bidet Store",
            "link": "https://www.amazon.com/stores/LUXEBidet/page/4FDE87B6-8205-49FA-B7DA-22AAB032E84E?ref_=ast_bln"
        },
        "brand": "LUXEBidet",
        "merchantInfo": "Luxe Shop",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 916,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 3 hrs 9 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "NEVER-BEFORE-SEEN INNOVATION – The only bidet that flips up and out of the way for easy cleaning of hard-to-reach spots. Activate the 360° Self-Cleaning mode for panoramic cleaning of both the guard gate and nozzles.",
            "FASTEST, EASIEST INSTALLATION – Patented, U-shaped adjustment plates allow for quick and easy installation without removing the entire toilet seat. Stainless steel hinges allow for adjustments even after installation. Compatible with LUXE Toilet Seat.",
            "INCREASED COMPATIBILITY – Comes with standard fittings and a Hybrid T-Adapter with improved functionality and resistance to cross-threading.",
            "SLEEKER, MODERN LOOK – New low-profile, compact design comes in three premium finishes: White, Rose Gold, and Chrome. Features ergonomic knobs and improved water pressure control.",
            "WARRANTY & SERVICE – All LUXE Bidet NEO Plus bidets include an 18-month manufacturer’s warranty that can be extended to 2 years by registering your product on the LUXE Bidet website."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b/ref=dp_bc_aui_C_3?ie=UTF8&node=680350011"
            },
            {
                "name": "Bidet & Bidet Parts",
                "link": "https://www.amazon.com/Bidet-Bidet-Parts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6810562011"
            },
            {
                "name": "Bidet Attachments",
                "link": "https://www.amazon.com/Bidet-Attachments/b/ref=dp_bc_aui_C_5?ie=UTF8&node=6810564011"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Brand",
                "value": "LUXE Bidet"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Shape",
                "value": "U-Shape"
            },
            {
                "name": "Product Dimensions",
                "value": "17.7\"L x 14.72\"W"
            },
            {
                "name": "Item Weight",
                "value": "1.9 Pounds"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Manufacturer",
                "value": "‎LUXE Bidet"
            },
            {
                "name": "Part Number",
                "value": "‎NeoPlus120sww"
            },
            {
                "name": "Item model number",
                "value": "‎NeoPlus120sww"
            },
            {
                "name": "Pattern",
                "value": "‎Toilet Seat"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Included Components",
                "value": "‎Standard LUXE-Hinge Covers, NEO 120 Plus Bidet Attachment, Hybrid Cold Water T-adapter – 7/8″ x 7/8” x 3/8″, Plastic Wrench – 3/8″ x 7/8″, 15-inch Metal Braided Cold Water Bidet Hose – 3/8″ x 3/8″, Plumber’s Tape for a snug and secure installation, LUXE Toilet Seat LUXE-Hinge Covers"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B0B1GZ32FF"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 916 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,493 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #18 in Bidet Attachments"
            },
            {
                "name": "Date First Available",
                "value": "May 17, 2022"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "What is the difference between NEO 120 and NEO 120 Plus? Both NEO 120 and NEO 120 Plus come with a rear wash and self-clean mode, however the NEO Plus features an upgraded Advanced 360° Self-Cleaning Mode. All NEO Plus models come with Lift-to-Clean and Slide-in Installation features. Is it hard to install the NEO Plus to my toilet? The patented EZ-Lift Hinges on the NEO Plus make installation quick and simple, without having to remove your toilet seat. Combined with our first-class LUXE Customer Support team, you never have to worry with a LUXE Bidet. What is Advanced 360° Self-Clean Mode, and how is it different from the self-clean modes of other bidets? Only NEO Plus Series bidets come with this innovative cleaning mode. Now upgraded to flush debris off not only the bidet nozzle(s), but also the Guard Gate as well. This feature is designed to help you maintain the bidet in between routine upkeep. Which toilets are compatible with the NEO Plus Series? Is there a weight limit for NEO Plus bidets? The NEO Plus is compatible with most 2-piece toilets and some 1-piece toilets, and works with most toilet seats including the LUXE Toilet Seat. Check the above NEO Plus Fit Chart prior to purchase. The weight limit for NEO Plus bidets is 300 lbs. Can I install the NEO Plus Series bidet with the same parts from my NEO Series bidet? For LUXE Customers upgrading from a NEO to a NEO Plus Series bidet, please use the new parts included with your kit. NEO Plus Series bidets come with Standard 3/8\" Fittings, which are different from NEO Series 1/4\" fittings.",
                "media_link": []
            },
            {
                "media_text": "LUXE Bidet Products NEO 120 NEO 120 Plus LUXE Toilet Seat Features Retractable nozzles, protective guard gate, and built to fit most toilet setups. Features Slide-in Installation, Advanced 360° Self-Clean Mode, and Lift-to-Clean Hinges. Features Soft-close, quick-release, and designed to fit any bidet attachment. Why This LUXE Bidet's original best-selling bidet, with over millions of customers. Why This LUXE Bidet's innovative bidet with never-before-seen patented features. Why This Seamlessly install with any bidet attachment or as a normal feature-packed seat.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b5af1bb6-1b40-47d4-83c6-f3f3b0fd7455.__CR0,0,600,450_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0d8d1d4-902c-4290-8d8a-dfddd1cef4f4.__CR0,0,600,450_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8710f4f1-64d9-4574-bac6-2a56f9da09d0.__CR0,0,600,450_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0a5e703d-0897-4909-b30b-2eec93c675c0.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a944bc9b-e697-4ed7-b4da-7fa47ec6754e.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/33008983-8af2-4b3b-b7bf-2aa78c1f203e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b5af1bb6-1b40-47d4-83c6-f3f3b0fd7455.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0d8d1d4-902c-4290-8d8a-dfddd1cef4f4.__CR0,0,600,450_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8710f4f1-64d9-4574-bac6-2a56f9da09d0.__CR0,0,600,450_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cyberlaw Prof",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDIGMLVMT64BKWQBJAKAW6ZTEHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RITEU0IGKN55W?ASIN=B0B1GZ32FF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Product to install and use; will wait for longevity",
                "reviewText": "I discovered easy-to-install add-on bidets about twelve years ago in a hotel in Melaka, Malaysia. Since then, I've owned five: (1) an American version of the (Japanese) Toto Eco-Washer that I saw in that hotel; (2) several Blue Bidet BB-1000's; (3) a dual nozzle Bio Bidet Slim Edge; and now (4) this one to replace (3), which broke down after three years.This product seems the best thought-out and designed of all—with by far the best instructions, in fluent native-level English—and by far the easiest to install. The instructions even explained several variations of US \"standard\" plumbing that should accommodate nearlyany standard toilet.The operating design is by bar the best for cleaning the mechanism and keeping it clean. A small, white plate protects the nozzle when retracted, and I think that's all you need clean regularly. Just a swipe or two of the old toilet brush should do it. But you can also extend the nozzle to clean it, too. (I haven't yet tried this.)In addition, there's a separate dial for the cleaning mode, which waters the nozzle (and the plate?) for cleaning. You can use this even while sitting on the toilet. Best of all, the whole apparatus bends back on hinges to allow you to clean the toilet under-edge behind the bidet. (This part of our toilet had accumulated some really disgusting black sludge, which may have been hose detritus or even black mold. Now I think it will never darken our bowl again!).Installation was also well thought out. I brought out a bunch of tools from my toolkit and only needed one—a long handled screwdriver to tighten my pre-existing toilet-seat bolts after installation. The product itself contained all the wrenches you need to install the device, include a special thumb wrench permanently mounted on the bidet hose, which you can use to tighten each end by hand.The nice little secret of this device (and most modern plumbing) is that you don't need any big heavy wrenches. All the plumbing fixtures included, as well (probably) as the nut on your existing toilet tank supply, work just like garden hoses. Each has an interior rubber washer that seals against the interior metal without your straining to tighten anything.You only need to watch out for two things. First, make sure the washer for each joint hasn't somehow slipped out before joining the parts. Second, be careful to align the two threaded parts to be joined gently, and not to cross the threads. If the threads are aligned right, you will never have to exert more than easy finger pressure to wind the nut on, until it gets close to tightening. In fact, I never used a wrench at all, other than the finger one supplied on the input hose. I hand-tightened everything, and there were no leaks. (If you're obsessive-compulsive like me, you can put a paper towel down after installation and see whether any drops show up in the next day. If so, just tighten a bit more.)Total installation time took 32 minutes, with less than an hour including the first test and clean-up. You needn't fear installing this yourself if you have any mechanical skill at all.On my previous dual-nozzle Bio-Bidet Slim Edge (before it broke down) the stream for pooping was so strong it hurt my anus, so I had to shift forward and use the dual (supposedly female) nozzle. In contrast, this bidet had tolerable stream pressure up to the end of its range.I noticed only two minor things that might be improved. First, the stream seemed a little spray-ey, but I'm sure we can get used to that. Second, the little supplied thumb wrench on the stainless supply hose was put in backwards, but it could still be used on both ends.The only thing we might worry about with this product is longevity, and for that we'll just have to wait and see. At the moment, just after installation and first test, it seems the clearly best of the breed, and at a good price.",
                "reviewVotes": "52 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B. BelmonteB. Belmonte",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFCAB3LZS5GYBYDM3MNI75FXAPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R100L4MYBVOKYJ?ASIN=B0B1GZ32FF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Are you sick & tired of getting swamp butt on hot humid days? This is a game changer!!!",
                "reviewText": "It baffles me why the US is so far behind when it comes to having bidets in the bathroom. I do construction and am seeing more homes put them in, but it’s crazy how people don’t get the importance of having clean hygiene after doing your business. Here is a little anal-ogy: Say you were picking after your dog and got some poop on your hand. You wouldn’t take a piece of toilet paper or paper towel and wipe it off and call it a day, would you? No, you’re gonna wash it off with soap and water. It’s the same concept as that, do what you normally do and then wash off with the Luxe Neo 120 Plus. You can use soap and water or just plain water. But after using this a few times you will never want to use a bathroom without a bidet again. It’s that good! I just bought 3 more to give to family members on Christmas for a stocking stuffer from Santa.Before buying mine I read in the comments that some people bought the extra bumpers/spacers and others didn’t. I decided to purchase them because I wanted the toilet seat to be a little raised up more than the bidet itself. The bumpers on my seat are not high at all and didn’t want all the weight going on the bidet and possibly cracking it. As it is made of plastic. Just get a tube of 100% silicone, it can be clear or white it doesn’t matter. Get the location where you want to set the bumpers and put a nice size gob on them and then close the seat and lid and put like a 10lb weight on it for a few hours. Then I put some more silicone around the whole edge of the bumper where it meets the seat and use your finger or caulking tool to smooth it out. Silicone is very strong and you can also remove them with a putty knife without damaging the seat or bumpers if you need to take them off in the future. Other than that, installation was a breeze. It took maybe 10 minutes at most to install everything. You’ll only need 2 tools, a slotted screwdriver and an adjustable v-jaw pliers or crescent wrench. Everything else is provided in the box besides the extra bumpers and silicone. I am thoroughly happy with the Luxe brand bidets and its performance so far. I highly recommend that brand if you are thinking about getting one. Just do it!!! It’s 100% worth the money to invest in one. Besides your hygiene you’ll be saving money on not having to buy toilet paper and wipes so often. It really is a game changer, it’ll leave you clean as a whistle.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ardCRo+wL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel de la ParraDaniel de la Parra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIF6ZRVCGVOOTMEZFUJUW5UH2IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PGP4K9RSGOP?ASIN=B0B1GZ32FF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars This should be the standard in the Western world",
                "reviewText": "I just visited Japan last month and for the first time I used a bidet. Long story short: the Japanese-style bidet should be the standard in the entire world. Toilet paper DO NOT CLEAN YOU ENTIRELY! If you wipe your rear only with toilet paper please keep this is mind: you have feces in your rear no matter how clean you think you are. When I was back home I was convinced I needed a Japanese-style bidet so I saw some high end options, around $350 but before buying one of those I decided to try this one because it is only $40. First thing is that I was able to install it in 5 minutes without any tools, super easy. How does it work? Absolutely fantastic! it shoots water so strong to the area that needs to be cleaned and believe me: it cleans you! I use toilet paper just to literally make sure my rear is clean, and it always is. Just in toilet paper savings this product pays for itself in a couple of months! It doesn't have features that high end bidets have like warm water, drying, warm seat, lights, sounds, or female washing (sorry ladies) but to clean your hole, this bidet is absolutely perfect! Absolutely every home in the Western countries should have a bidet, this is the best way to have your rear really clean. Try to clean a plate of Nutella mixed with grease only with toilet paper, it'll always be sticky and smell like Nutella, you need water to really wash it, same thing with your back door. Buy a bidet you need it either you admit it or not!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Qnljwwm6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manoel Do V. Silva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 15, 2023",
                "reviewTitle": "Não é compatível com diâmetros e roscas nacionais, é impossível instalar a peça principal.",
                "reviewText": "Não gostei de a Amazon vender um produto que não adapta aos rabichos e válvulas dos vasos nacionais, e é impossível usar redutores e uniões nacionais porque a rosca das peças do bidet é diferente do padrão nacional.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Devin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 8, 2023",
                "reviewTitle": "It got even better!",
                "reviewText": "I believe this is my 4th or 5th Luxe bidet. I've basically bought one anytime I moved cities/countries. This is one constant in my life that hasn't changed in quality and I'm glad the new plus model is an improvement over the still good old model.I really like the new slide-in mechanism. Made installation so much easier and faster. It took me 15 minutes to install. The new model looks posh and clean. Wish they were a little cheaper in Canada though.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sakill Wally-Issop",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 28, 2023",
                "reviewTitle": "Médiocre - Raccordement très difficile voir impossible",
                "reviewText": "Le raccordement de ce bidet n'a pas de sens. On ne peut que le raccorder d'une seule manière uniquement. Si votre toilette ne dispose pas des bonnes entrées et raccords de basse vous ne pouvez pas le mettre. La taille raccordement sont uniques et n'existe pas dans tous les pays ou sont différents. Par exemple un des tuyau est en 3/8 en réalité c'est pas le cas. Dans mon pays (La France) le tuyau est en réalité entre un 3/8 et 1/4 (entre un 12x17 mm et un 8x13 mm) et donc c'est impossible de le raccorder. Un autre tuyau est en 1/2 et en réalité pour un français sont tuyau est entre un 15x21mm et un 20x27mm, encore impossible de le brancher .Ce truc est une blague",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Goedeheks",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 14, 2022",
                "reviewTitle": "Sold in the UK but doesn't fit UK toilets.",
                "reviewText": "This is an bidet, they sell it in the UK but the hose will not reach British stop taps since they're on the other side. Avoid this bidet if you're in the UK, they will not give you a longer hose.Additionally, it makes your seat on a slant, they sell \"toilet seat adapters\" separately, which they should just include in the box if it wasn't such a scam.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 14, 2023",
                "reviewTitle": "Does not fit Australian fittings",
                "reviewText": "Should not be sold in Australia as the connectors do not fit our plumbing. The T connector needs to be 1/2 inch (where it connects to toilet and water inlet hose). You won't be able to find what you need at bunnings or plumbing shop btw as the fitting that connects the hose to the actual bidet is a different size again and completely non standard.Luxe do not have an exact 1/2 inch t adapter replacement part for this model...The work around provided by luxe (free of charge though you pay postage) is the hot water t adapter (you can use it with cold) with a plasticky hose. (Parts can be found on luxe website).Everything is now working. But I had to waste a lot of time finding the solution! Not to mention waiting a long time for second package to arrive. If you're outside of US be aware of differences in plumbing sizes. AliExpress products appear cheaper and with correct fittings provided for different countries. Personally go there next time...Update: little plastic hose popped off fottong and nearly flooded bathroom. Not suitable for Au, returned",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$43.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}