{
    "remaining_requests": 37453,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SlimEdge-Attachment-Electric-Install-Internal/dp/B07CGVBZGL",
    "body": {
        "name": "Bio Bidet by Bemis SlimEdge Freshwater Bidet Attachment for Toilet, White, Non Electric, Easy Install",
        "price": "$42.79",
        "originalPrice": "$59.00",
        "rawPrice": 42.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SlimEdge-Attachment-Electric-Install-Internal/dp/B07CGVBZGL",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CCK6P2H8"
        ],
        "asinVariationValues": [
            {
                "asin": "B07CGVBZGL",
                "variationName": "Style",
                "variationValue": "1-Pack Bidet",
                "price": "$42.79",
                "variationImageURL": ""
            },
            {
                "asin": "B0BXMXGHXC",
                "variationName": "Style",
                "variationValue": "2-Pack Bidet",
                "price": "$75.31",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31jFQHqMmUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41KmFez5pML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BE6 lVkKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51e7-hUmszL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AeRISwj-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41F2q2LrJ3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1PFuuFW2DL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Bio Bidet Store",
            "link": "https://www.amazon.com/stores/BioBidet/page/2FEDD45E-A107-4EB8-AF8F-7A0C7EA3D709?ref_=ast_bln"
        },
        "brand": "BioBidet",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 30618,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "WATER DOES IT BETTER – Choose the cleansing, freshwater spray to fit your needs; dual bidet nozzles allow for rear and front wash",
            "BIDET YOUR WAY – Easy-to-use comfort control knob gives you adjustable water pressure and ensures a comfortable, personal wash experience",
            "EASY INSTALLATION – Upgrade your bathroom in minutes with a home bidet, no plumber and no batteries required; comes with all necessary instructions and connectors for an easy install",
            "JOIN THE MOVEMENT - Reduce the need for toilet paper by switching to a universal fit attachable bidet; wash with water and say hello to a cleaner, healthier lifestyle",
            "BUILT TO LAST: Quality components such as brass valve and inlet and braided metal bidet hose offered in a slim bidet design"
        ],
        "description": "Treat yourself to a bathroom upgrade with the Bio Bidet by Bemis SlimEdge bidet attachment for your toilet. Using the comfort grip control knob, you have complete control over the responsive, adjustable water pressure. Personalize your wash for women and for men with this easy-to-use attachable bidet. Soothing postpartum care, hemorrhoid treatment, front and back cleansing are all possible with built-in retractable dual nozzles. All necessary components for installation are provided including the t adapter valve, water hose and bidet connectors. Bidet installation is easy, no plumber, no electricity, no batteries, and no wiring needed. Easily enhance the functionality of your bathroom on your own with a fast 15 minute install. Built to last, the SlimEdge bidet attachment features a quality design built-in brass valve and inlet, alongside a braided metal water supply hose. Join the movement! Reduce the need for toilet paper and live a fresh, clean lifestyle by switching to a bidet. From bidet sprayers, to bidet attachments, to bidet toilet seats, to full bidet toilet systems, we have the best bidet option for you. Bio Bidet by Bemis is proud to offer innovative products that are easy to install and built to last.",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b/ref=dp_bc_aui_C_3?ie=UTF8&node=680350011"
            },
            {
                "name": "Bidet & Bidet Parts",
                "link": "https://www.amazon.com/Bidet-Bidet-Parts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6810562011"
            },
            {
                "name": "Bidet Attachments",
                "link": "https://www.amazon.com/Bidet-Attachments/b/ref=dp_bc_aui_C_5?ie=UTF8&node=6810564011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Bio Bidet"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Bathroom"
            },
            {
                "name": "Mounting Type",
                "value": "Toilet Mount"
            },
            {
                "name": "Finish Type",
                "value": "White"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Included Components",
                "value": "Bidet attachment, mounting hardware, connecting components & instructions"
            },
            {
                "name": "Special Feature",
                "value": "Easy to Install"
            },
            {
                "name": "Handle Type",
                "value": "Knob"
            },
            {
                "name": "Style",
                "value": "1-Pack Bidet"
            },
            {
                "name": "Installation Type",
                "value": "‎Single Hole"
            },
            {
                "name": "Model Name",
                "value": "‎Simple Bidet Toilet Attachment in White with Dual Nozzle, Fresh Water Spray, Non"
            },
            {
                "name": "Handle Material",
                "value": "‎Brass"
            },
            {
                "name": "Item Weight",
                "value": "‎1 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "‎Bio Bidet"
            },
            {
                "name": "Part Number",
                "value": "‎Bio Bidet"
            },
            {
                "name": "Product Dimensions",
                "value": "‎7.2 x 17.34 x 3.4 inches"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎SlimEdge"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Size",
                "value": "‎1 Pack"
            },
            {
                "name": "Finish",
                "value": "‎White"
            },
            {
                "name": "Pattern",
                "value": "‎Toilet Attachment"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Special Features",
                "value": "‎Easy to Install"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B07CGVBZGL"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 30,618 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,732 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #19 in Bidet Attachments"
            },
            {
                "name": "Date First Available",
                "value": "April 17, 2018"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9f6da503-69ad-49c0-a7d7-ce4f5597a474.__CR0,6,2000,1237_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d13584e-0e94-4b9d-ab7c-59f91da3aa1f.__CR0,6,2000,1237_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b95357c7-68a4-4c7c-b671-7f3c0164ad81.__CR0,6,2000,1237_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/888df26e-8496-4ac5-a406-f41dba72a488.__CR0,6,2000,1237_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cbc9d4f1-f26d-444c-9e0e-b50a8e0b77f3.__CR0,6,2000,1237_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Pedro Garcia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJHXCSZNYPNYUEDTTYL3GNM6RIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2347TFG2RSHA?ASIN=B07CGVBZGL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars A Life-Changing Bathroom Upgrade for Seniors: SlimEdge Freshwater Bidet Attachment",
                "reviewText": "Purchasing the Bio Bidet by Bemis SlimEdge Freshwater Bidet Attachment for my 87-year-old mother has been one of the best decisions for enhancing her bathroom experience. Its ease of use and perfect functionality for its intended purpose have made a significant difference in her daily routine.Unboxing and Installation:From the moment we unboxed the SlimEdge Bidet Attachment, the quality and user-friendly design were apparent. The installation process was a breeze, thanks to the clear and concise instructions included. It's rare to find a product that promises easy setup and actually delivers on that promise, making this bidet attachment a pleasant surprise.Designed with Seniors in Mind:What stands out the most is how senior-friendly this bidet attachment is. The knob control is incredibly straightforward, allowing my mother to adjust the water pressure with minimal effort. This ease of management has made it an invaluable addition to her bathroom, significantly enhancing her independence and comfort. It's heartening to see how much this simple upgrade has improved her daily life, providing us with peace of mind about her well-being.Performance and Impact:The bidet's performance exceeds expectations, offering a refreshing and thorough cleaning experience that paper could never match. The environmental benefits of reducing paper use are a bonus, aligning with our family's efforts to live more sustainably. Moreover, the positive impact on my mother's hygiene and the convenience it brings to her caregiving routine cannot be overstated.A Note on Durability:If there's any downside, it's that the bidet attachment doesn't feel as sturdy as I believe it should be. However, considering the affordable price point, this is a minor issue that we're more than willing to overlook. The value it brings in terms of functionality and ease of use far outweighs this concern.Conclusion:The Bio Bidet by Bemis SlimEdge Freshwater Bidet Attachment has proven to be an amazing addition to my mother's bathroom, greatly aiding in her personal hygiene and providing us with numerous benefits. It's an excellent choice for anyone looking to introduce a bidet into a senior's life, combining ease of installation, simplicity of use, and effective cleaning in one affordable package. Despite its slightly less sturdy build, its performance and the independence it offers to elderly users make it a product I wholeheartedly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "geetwogeetwo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA6DNUTS3MPSKBO2MKUNMTKGU5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KRF1NQ6RIQJ9?ASIN=B07CGVBZGL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Inexpensive and works as advertised",
                "reviewText": "I see bidets for hundreds of dollars. I got this on a Black Friday deal for $35 as I’ve never had one and this was so inexpensive I decided it was time to try one. As you can see there isn’t much room to hook up but that’s typical in bathrooms. The critical step is hooking up the supplied valve to the bottom of the toilet tank fill valve. I could have used an extra set of hands as the fill valve in the tank will want to spin when you are tightening the supplied valve onto the bottom of the tank. I suggest a channel lock and or adjustable wrench to tighten. It comes with a cone shaped gasket, make sure it’s in there. As long as you get this connection properly tightened you are good to go. It was very simple but just working in a tight spot. Putting on the spray/water stream part under the ring is very simple and the water stream is very accurate. The on/off has a nice click so you know when you have it back in the off position. It has an adjustable water stream/pressure that you control by simply turning the knob more or less. I suggest not worrying about just using the cold water line that fills your toilet. I thought you might need warm water but was pleasantly surprised that the cold/tepid water from the existing toilet fill line was very very refreshing in that area. Don’t get hung up on that. If I bought an expensive one I still wouldn’t hook up hot water knowing what I know now. I have had no issues, no drips, no leaks and about a half hour install. Get things hooked up properly/ snug/tight and this thing is great.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61k1emtVIsL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pJPhxvvaL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "MM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCFASDBVKIWXYTGNTIKQT7C7S5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NPZGCXNVSE61?ASIN=B07CGVBZGL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2022",
                "reviewTitle": "4.0 out of 5 stars Tricky to fit our toilet but it's on there.",
                "reviewText": "I wanted to like this. It looks pretty simple and has a front wash setting.It was sinple to install. However, it doesn't really appear to fit our toilet the right way. We have a round shape and our toilet seat is weird so it's easy to swap out but it attaches in chunky latches, not a skinny part. I tried to fit the bidet loops over but then it doesn't flat because the part that hangs down won't reach the bowl. I think it's slightly too narrow or the round loops are slightly too small.I put the bumpers on so the bidet attachment won't be disturbed when we sit down on the seat. I'll try to fiddle with the toilet seat attachments and update my review if I can make any fit improvements.Well, it's on there and it's not leaking so far. Both the butt wash and the front wash seem to work but there's no \"gentle\" water pressure. Even when you turn the knob very slowly, it either doesn't spray hard enough to reach you or it blasts you.UPDATE: I watched a youtube video about how to install our Myfair removable toilet seat so I could figure out how to get it off again. I had the bidet plumbed in so I was determined to make it fit the toilet. I got in on here now and the lower part fits in the bowl like it should. It's flat against the toilet and doesn't need the bumpers. It works great when you're sitting on the toilet but still gets water on the floor if you try to test it with the lid shut. I'm bumping it up one star because it seems pretty good. I just wish the water pressure was adjustable. It's fine to power wash your bum but the front wash is a little too rough for my liking.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/511r8dLZc6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51DnWZkTGbL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51X0DtzrUeL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51m78w2w9yL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Dlncm1GzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Oi0ZAbK4L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61RCO8jZ20L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61nEdL6bZiL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pedro A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 3, 2023",
                "reviewTitle": "Excelente bidê mas não é compatível com os padrões de encanamento brasileiros",
                "reviewText": "O bidê funciona muito bem, é bem mais fino e elegante que o último modelo que tive mas a instalação é muito mais complicada do que deveria pois os componentes tem todos medidas feitas para os padrões americanos.A conexão T que você deveria instalar entre a caixa d'água da privada e a mangueira tem duas bocas de 7/8\" enquanto que tanto a entrada da caixa quanto a ponta da mangueira de minha privada (e pelo que os encanadores com quem conversei me disseram, praticamente todas as privadas do Brasil) tem 1/2\". Ou seja, voce vai precisar de 2 adaptadores de 1/2\" para 7/8\" para fazer esta instalação.Decidi então ignorar a conexão T e instalar a mangueira do bidê direto no registro de ducha higiênica que tem na parede ao lado da privada, mas mais uma vez enquanto o registro tem 1/2\" a mangueira do bidê tem uma entrada de 3/8\". Portanto tive que procurar um adaptador de 1/2\" para 3/8\" e depois de percorrer 5 lojas finalmente encontrei um com estas medidas feito para instalação de encanamento de gás.Em resumo o produto é bom, mas por não ter seus componentes pensados no mercado brasileiro a sua instalação é bem chata.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. HardingR. Harding",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 19, 2022",
                "reviewTitle": "Fácil de instalar, buena calidad",
                "reviewText": "La versión \"SlimEdge\" de este bidé tiene un precio razonable y parece estar fabricado con alta calidad y durabilidad. Se suministra con un adaptador en T de metal que se conecta directamente debajo de la conexión de manguera estándar de 7/8 de pulgada en la cisterna (ver tercera foto). Luego, la manguera original se vuelve a conectar a la parte inferior del adaptador en T. Luego, la manguera de 1/2 pulgada revestida de metal se conecta al lado del adaptador en T y al conector debajo de la perilla de control del bidé. El bidé es lo suficientemente delgado como para caber debajo de la conexión del asiento existente y tiene inserciones antideslizantes. Este inodoro American Standard en particular tiene obstrucciones cerca de los dos orificios para sujetar el asiento del inodoro, pero la rotación disponible en la ranura me permitió usar un ángulo diagonal (foto 2) para colocar el asiento a través del bidé con éxito. Las funciones de lavado delantero y trasero funcionan muy bien y permiten un buen control de la presión. El clic audible y táctil al llegar a la posición central de APAGADO también es una gran característica. El paquete también contiene espaciadores altos que puedes colocar debajo del asiento del inodoro para levantarlo si toca el borde de la taza del inodoro, aunque no tuve que instalarlos. En general, estoy muy satisfecho con este producto.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51jbwBUBUUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61+41yPhYmL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61dkoHnnZbL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jerker Malmgren",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on August 15, 2023",
                "reviewTitle": "Ej standard kopplingar",
                "reviewText": "Det var ingen vanlig dimension eller gänga på kopplingarna. Jag kollade med VVS-firma, kyl-firma och HydroScand, ingen visste vad det var för konstiga kopplingar. Fick lämna in slangen till HydroScand så klippte de av den och satte dit en standard 1/2\"-koppling istället.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tomaz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on March 20, 2023",
                "reviewTitle": "Weird non standard braided metal attachment hose size",
                "reviewText": "This one seems to use a weird non standard braided metal hose attachment size so I couldn't find longer hose which would fit (tried 3/8, 1/4 and 1/2, nothing worked).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LeeLoo_the_GSDLeeLoo_the_GSD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 7, 2021",
                "reviewTitle": "Great product, just watch the pressure! 💦",
                "reviewText": "**Update August 2023: Two and a half years later and I'm still very happy with this product. I still reccommend 👌**Original ReviewAs of this review, I have been using this for three weeks. This is my first bidet purchase, and I installed it on an American Standard toilet with an elongated bowl, and slow close lid. My plumbing is standard for Canada.1️⃣ InstallationThis quick and easy for me. I did not require any tools, and even though I didn't use the Teflon tape, I have not had any leaks. ( I will go back and apply the tape, I just wanted to test the setup). I did not need to use any of the bumpers provided for the toilet seat, either. Also, the instructions state that if the toilet isn't going to be used for a long period of time that the water source should turned off, I assume to prevent leaks if these parts fail; something to consider if you are not home for extended periods of time.👉Ensuring that the rubber stoppers are in place, and in the correct position is key for ensuring there are no leaks!2️⃣ Looks & CleaningIt is a different shade of white than my toilet. In my bathroom, the control handle sits closest to the wall and is generally protected from accidents (weight being applied, things dropped on it). Also, it does add more crevices for toilet gunk to hide; bathroom fuzzies and loose hairs that accumulate on toilets. Something to consider if you are planning on installing this is a high volume washroom.👉If your bathroom has very tight spaces around the toilet, make sure you will have room for this.👉If your exports look like chocolate bomb exploded in the bowl where the bidet will be sitting, consider how much extra cleaning this will involve and if your household members will actually keep this up.3️⃣ The SprayI read a review about bidets before that mentioned \"blowing your anus right off\" and damn, if that isn't the truth! I find you have to wait a second after turning the dial for water pressure to build up enough to open the nozzle. For example, if the pressure was 1 to 5; turn it to 1 until water starts coming out, and then to your desired setting. In one of my attached photos, I've drawn red lines to indicate the max that I've gone to. I am in Canada, it is winter, and I've hooked into the cold water toilet line. A quick blast from the bidet isn't too bad, but if you dial up too much, or for too long, it is basically like waterboarding your orfices with ice water, and you may leave the washroom feeling violated.This bidet has a bum wash and a femine wash. The nozzles are in the same spot, but just seem to have a different spray setting. If we're comparing to garden hoses, think 'full' for bums, and 'jet' for the femine wash (Yikes). The angle is just slightly different, but I find myself trying to shuffle around to make sure my bits get a rinse which sometimes leads to water somehow spraying back onto the seat and lid. This could be because I usually perch closer to the end away from the tank. I can assume that if a male hit the 'feminine wash' by mistake, that you might hear crying coming from the washroom.Probably the most important bit of information in here is that this bidet has been surprisingly effective at rinsing away all exports. I just use a small wash cloth to dry off any whizzels, keeping g a lot of toilet paper from entering my septic system. As for deuces, I still use a bit of toilet paper, but I have yet to see any evidence of exports on the TP even if I had consumed an expired family size bagged salad kit the day before.👉When you dialing the spray, WAIT a second for the water pressure to build enough to open the nozzle, THEN dial up the pressure!👉The 'feminine wash' is um...aggressive. Consider making a simple instruction/warning sign for house guests in case they are brave enough to try it out.👉This bidet is effective at rinsing away exports. I'm saving on TP, and giving my septic system a break. A pack of baby wash clothes from the dollar store work great for drying off the pieces.4️⃣ Final VerdictI am happy I bought this, and would buy again. I don't see myself buying anything fancier than this in the future because this one is doing what I need it to; clean my pieces, and reduce TP consumption. As a female, I am glad I have the option for femine wash.Hope this review helps!",
                "reviewVotes": "48 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/A1u9oeXi5wL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Wwy6zFkzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/A1ISaORnLnL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91Y5j7sw99L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91pgPmonpDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/A1L-YkLcVeL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81AULFzZgAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/A14dm7UDyVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/A1SLm33rmsL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}