{
    "remaining_requests": 37329,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/American-Standard-5900A05G-020-Non-Electric-Elongated/dp/B01ERU55D0",
    "body": {
        "name": "American Standard 5900A05G.020 Aqua Wash Non-Electric Bidet Seat for Elongated Toilets, 14.9 in Wide x 3.6 in Tall x 21.1 in Deep, White",
        "price": "$70.26",
        "originalPrice": "$81.27",
        "rawPrice": 70.26,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/American-Standard-5900A05G-020-Non-Electric-Elongated/dp/B01ERU55D0",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BNN97LQ1"
        ],
        "asinVariationValues": [
            {
                "asin": "B07PVKD2FZ",
                "variationName": "Style",
                "variationValue": "Electric",
                "price": "$330.20",
                "variationImageURL": ""
            },
            {
                "asin": "B01ERU55D0",
                "variationName": "Style",
                "variationValue": "Non-Electric",
                "price": "$70.26",
                "variationImageURL": ""
            },
            {
                "asin": "B0BN4NK8NK",
                "variationName": "Style",
                "variationValue": "Non-Electric Slim",
                "price": "$148.85",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "Only 2 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31VpJ3KF4UL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/312FTnxUedL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wTCeDW9CL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31yG7-eeT-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EqrgagS8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31qZs2oIbDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JpIWB7OeL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the American Standard Store",
            "link": "https://www.amazon.com/stores/AmericanStandard/page/5D44E085-1297-42B1-9388-98E95E1AC5DC?ref_=ast_bln"
        },
        "brand": "AmericanStandard",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2574,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Non-electric bidet feature with adjustable spray volume",
            "Independent self-cleaning dual nozzles for effective front and back cleansing",
            "\"No Slam\" Slow-close seat & lid for user convenience. Bidet Spray Type: Horizontal",
            "One-push removable seat for easier cleaning of the seat and bowl",
            "Manual Side Lever : Easy to operate",
            "2-7/16\" (62 mm) seat height",
            "Seamless telescoping lid design to conceal the seat ring",
            "Includes mounting hardware, water supply hose and seat",
            "Fits most conventional elongated toilets",
            "Removable nozzle tips for additional cleaning"
        ],
        "description": "Aquawash bidet seat features a modern design with a slim 60 mm telescoping seat that accompanies any decor. This seat features a water pressured bidet seat with adjustable spray patterns and detachable nozzles; No electrical power required. This seat also features a one button push lift-off for easier cleaning; Slow close hinges to prevent slamming of the seat and top mount installation for easier install. Fits most conventional toilets.",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b?ie=UTF8&node=680350011"
            },
            {
                "name": "Bidet & Bidet Parts",
                "link": "https://www.amazon.com/Bidet-Bidet-Parts/b?ie=UTF8&node=6810562011"
            },
            {
                "name": "Bidet Seats",
                "link": "https://www.amazon.com/Bidet-Seats/b?ie=UTF8&node=6810566011"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Brand",
                "value": "American Standard"
            },
            {
                "name": "Material",
                "value": "polypropylene plastic"
            },
            {
                "name": "Style",
                "value": "Non-Electric"
            },
            {
                "name": "Shape",
                "value": "Elongated"
            },
            {
                "name": "Product Dimensions",
                "value": "19.69\"L x 14.06\"W"
            },
            {
                "name": "Item Weight",
                "value": "5.6 Pounds"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Manufacturer",
                "value": "‎American Standard"
            },
            {
                "name": "Part Number",
                "value": "‎5900A05G.020"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎5900A05G.020"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Size",
                "value": "‎14.9 in wide x 3.6 in tall x 21.1 in deep"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Included Components",
                "value": "‎Seat, Spec Sheet, Installation Sheet"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B01ERU55D0"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,574 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#38,296 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #33 in Bidet Seats"
            },
            {
                "name": "Date First Available",
                "value": "April 25, 2016"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Designed to Improve Personal Hygiene and Well-Being Dual Spray Nozzles Separate feminine and posterior cleaning nozzles are engineered to ensure thorough cleansing Slow Close Seat and Lid Gentle and quiet, no-slam motion Manual Operation Easy-to-use controls offer adjustable spray volume for confident cleansing Easy to Remove One-push removable seat to quickly clean seat and bowl",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/903a4daa-7ed7-46bc-9b1b-38088fc94536.__CR0,0,917,917_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e1e66ba8-10ed-4ec5-92ef-dab5633c5a10.__CR0,0,917,917_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45ec76f0-6174-40a4-8e1d-4564ad4038ba.__CR0,0,917,917_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2e9e820-bbbf-40ad-9977-7b1ec9658285.__CR0,0,917,917_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "AquaWash 2.0 AquaWash Slim AquaWash 1.0 Profile Height 3 3/4\" (95mm) 2 3/16\" (55mm) 2 7/16\" (62mm) Heated Seat ✓ On-Demand Warm Water ✓ Operation Manual Control Manual Control Manual Control Push-Button Seat Removal ✓ ✓ ✓ Night Light ✓ Slow-Close ✓ ✓ ✓ Requires Electricity ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/41c1ded6-053c-4154-8971-273b3bd69d1d.__CR0,0,4042,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/903a4daa-7ed7-46bc-9b1b-38088fc94536.__CR0,0,917,917_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e1e66ba8-10ed-4ec5-92ef-dab5633c5a10.__CR0,0,917,917_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45ec76f0-6174-40a4-8e1d-4564ad4038ba.__CR0,0,917,917_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2e9e820-bbbf-40ad-9977-7b1ec9658285.__CR0,0,917,917_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c230221c-bbbc-4e4b-942c-12e8de4ff1a8.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5d6246c1-82f2-450a-a08b-c1f5793900a7.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "AM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGR7TMFDYWSHRIAKQ3ZHCCTDCOYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2K0NNDU49VOSP?ASIN=B01ERU55D0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 13, 2020",
                "reviewTitle": "5.0 out of 5 stars Cannot get a better one at this price point - comparison with BB2000",
                "reviewText": "I own a Bio Bidet BB200 for many years. My downstairs toilet does not have a near power outlet, so I have been postponing installing one there for a while. I decided to go with a \"cheap\" bidet and it was a great decision. Is ti as good as the BB2000? No. Mind that it is 10% of the BB2000 price. Is the BB2000 10x better than this one. No.I would say that this one is a better value for the money than the BB2000. Having said that, it is not perfect, but you can't expect that at this price point.Here are the good things about it.+ Easy to install+ Great price+ Works as described and as expected+ Fits ok (more on that later)+ No need for power+ Soft close lid (did not expect it at this price)+ Seem durable - had it for 5 months now.What could be better?- My toilet is a Kohler and this seat fits, but just barely. That is, the seat is shorter than the toilet. It would be great if they would offer two different sizes or so. I realize it may create a nightmare as people would order the wrong one. Still, for my toilet, the seat could be about 1.5 inches longer, which would be great.- The nozzles slide in an out, but essentially they have two positions. Full retracted when not in use and fully extended when in use. Also, since there are two of them, each ends up shooting water at a slight angle, rather than straight. You end up getting more wet that you need to and also having to wiggle to make sure the water washes where needed. Of course, this varies with everyone's anatomy. One way to improve would be to have the nozzles replaceable. Then sell shorter or longer or tilted (to a side) nozzles and people would use the ones that fit them best. I think it would not be a major mechanical change.- The seat cover is slow closing (which is great), but the back of the seat gets so close to the tank that the seat cover barely stands straight. This could be unique to my toilet, although I mounted it as far as possible from the tank.Compared to the BB2000+ The lack of warm water or seat warmer is not an issue for us. Granted we live in TX now. It was a godsend in the winters when we lived up North.+ Easier to reach an operate than the fancy remote control+ Not missing the air dry feature of the BB2000, as I never really though that one work well anyway.+ Better seat design than the BB2000. The BB2000 has a sizable gap between the seat and an rim of the toilet. For men, in some cases, it is not unlikely to inadvertently \"aim\" for that gap when seated, which results in unwanted splashing outside. The Aqua Wash has a larger lip inside that covers said gap.- Miss the adjustable length of the spray nozzle.- The seat is smaller than the BB2000, yet not by much.All in all - great product for the price. I would pay double if the few issues I mentioned would be addressed.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pat Norton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZMVDLGR63VUR5CLU4D4TWBCBKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10NNKV4XTR7HQ?ASIN=B01ERU55D0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars I’m in love with my bidet!",
                "reviewText": "What can I say - I’m so pleased with this bidet.Not too expensive, easy to install and works very well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mutatio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQ5GLGDNIL4BDQ4DWJHZT7LROZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R867RU1AX9VU2?ASIN=B01ERU55D0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2019",
                "reviewTitle": "4.0 out of 5 stars Great bidet seat so far!",
                "reviewText": "Working great so far! Got this as an interim replacement as we wait for a Brondell Swash model to go on sale. Had picked up a round version from Genie Bidet a couple years ago and can compare the kits (though perhaps genie bidet has improved since then). Basically, this looks like all the other bidet seats of the same variety. Same lever, same markings, etc. The things that made This stand out from the Genie Bidet round model was the hardware. The mounting bracket, bolts, and adjustable spacers are basically identical. The inserts for the American Standard seat, however, or a higher-quality rubber, rather than the hard plastic ones provided with the genie bidet seat. The plastic inserts did not allow for a firm attachment and the seat would move if you were sitting on it and it shifted your weight. I ended up having to use the bolts and the plastic threaded nuts for the genie bidet version. The rubber inserts for the American Standard seat have brass threading and once you get the insert in (a bit of a challenge), they fasten up very snugly without the need for the threaded nuts. That said, if you do need the traditional bolt/nut setup, the nuts provided in this kit appear to be a higher quality plastic, also with the brass threading in the interior, less likely to strip the threads as might happen with the fully plastic ones that came with the genie bidet seat. Again, it’s possible that the hardware kits have been upgraded for the other brand since the time of purchase, so take this with a grain of salt.Be advised if you’re new to bidets, this is cold tap water! You will get accustomed to it but a cold booty spray could also be used to help wake you up in the morning!The seat was easy to install and there were no leaks on the first attempt, which is always great to see.Why 4 stars and not five? Having come from one of the fancy electric seats that finally gave up the ghost, the wider spacing on the wands is noticeable during use. For example, while using the rear wash, you effectively have to scoot a little bit over to make sure that the stream is hitting you where you need it to, to flush the seal, so to speak. This is where having a secure seat is key. If you are shifting around to try and get a good spray, you don’t want the seat to be sliding around on the bowl. Thankfully that’s not the case with this seat. That said, the wands on the electric bidet that we had were so closely spaced, that you didn’t have to move around to “center up“, so to speak, on the spray. Additionally, it’s possible that the wands on the electric version also have the nozzles rotated slightly in to avoid the need to shift around. While you can apparently pull off the heads of these nozzles to clean or replace them, it would be great if these wands could be slightly adjustable to angle them in to account for being a bit more widely spaced than other bidet seats. Also, and this appears to have been remedied with the seats by Alpha Bidet, but the front/back symbols and lever directions are a bit counterintuitive. e.g., turning the lever back should be for the rear spray while forward should be for the feminine spray. Not a dealbreaker, but you would think that would have been a natural design decision to make. Lastly, the mounting bracket and mechanism just barely worked to get a good fit on our American Standard Cadet 3 dual flush toilet using the rubber inserts to mount the seat. The seat almost mounted a bit too far back and that was with the mounting bracket installed as far forward as possible. The traditional nut/bolt mounting might have given it some extra play, but I was able to finally get the seat mounted without looking as though it was sitting further back on the bowl than a traditional seat would. Also, keep in mind that most seats like this, mechanical or electric, require room behind the mounting holes to be fully functional, like having the lid and seat stay up. I didn’t notice any specs for these mechanical seats, but I believe Brondell wants at least 1.5” to 2” of space between the mounting holes and the tank for their electric wand-based bidets. Keep that in mind for these seats as well. The seat feels a bit flat and level compared to the Brondell electric seat, which has more of a downward slope from the back to front of the seat. That slope, while taking some getting used to affords a lid that has a similar slope, which I believe gives it a bit more room for the lid and seat to go back. Both the lid and seat on the American Standard seat are more level, which is why the space between the mounting holes on the bowl and the tank will be important to attend to in getting this seat to work appropriately in terms of the lid and seat being put up and staying up. Hopefully that makes sense.Beyond that, I would recommend pulling the flow regulator. I found the pressure to be a bit low and the lever allows you to effectively determine how much pressure you get, so I don’t see the need to have the regulator installed. The extra pressure is also more effective in getting your seal fully flushed. Sorry to get graphic, butt if you have a softer BM, getting it fully flushed out will mean you won’t have any extra grit or sediment that can eek it’s way out after the fact and cause irritation back there. The extra water pressure can help with that.In sum, this appears to be a great replacement for a more expensive bidet that used a similar wand mechanism, although it required electricity to run. After we had purchased our expensive electric seat, I had wondered if anyone had come up with a similar idea that simply operated off of water pressure. Sure enough, someone had taken the idea and ran with it. If you can’t afford the more expensive electric seats, this is a great alternative that far surpasses the separate bidet attachments that dip down into the bowl and are fastened under your traditional seat (tried one of those too). Get one of these seats and you will wonder how and why you ever went without one before! You will get a much better cleaner bottom and you will use a lot less toilet paper as well.",
                "reviewVotes": "49 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JokesterJokester",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 29, 2023",
                "reviewTitle": "Almost perfect",
                "reviewText": "I did allot of research trying to find a bidet. In the end I decided I didn't want an add-on but to replace the entire seat.This one was very easy to install and the instructions were straight forward. It seems fairly well constructed and didn't notice anything that might break over time.The handle is easy to use, as even my four year old can do it without issue.The only downside is the comfort of the seat itself. I think its the size it had to be to fit the bidet part in. But it's just not as comfortable as the original seat.Despite that, it's still worth having. No idea why we didn't get a bidet sooner.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ZKP1gKzEL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ermilo G",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 29, 2023",
                "reviewTitle": "Excelente producto",
                "reviewText": "Lo único que le falta al fabricante es poner las medidas de las piezas, la “T” y de las mangueras la medida de su conexión",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Turcotte",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 11, 2023",
                "reviewTitle": "Very good, not overkill, do what it has to do!",
                "reviewText": "Very simple but effective. Clearly, this is a good quality product.No unusable options, not overpriced, just a good, paperless, confortable, warm water butt cleaner!You think you were clean all those years? No! Now you can be.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Leung",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 9, 2020",
                "reviewTitle": "Works as expected!",
                "reviewText": "Ordered this so we don't need to use as much toilet paper, though once you use a bidet, it's hard to go back to just toilet paper by itself!I installed it myself two weeks ago - I don't have much plumbing experience, enough to change the tap washers and that's about it. The instructions were straightforward, there was an overlay to put the back plate where the seat cover will slide in and click into place. If you want instructions before you buy it, the American Standard website has a copy of them.My issue was the included plastic t-connector/adapter did not fit to my cistern inlet and the water hose. The connectors were too big so had to go to the local hardware store (Bunnings) to get a replacement part with smaller openings.Once installed, everything was working as expected. The toilet seat closes softly, the bidet sprays well. I noticed the seat is a little narrower and due to the bidet, it is smaller than the toilet seat cover that was replaced so it takes a little getting used to. Overall, it is quite nice and I would recommend this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Glenn L. Allen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 7, 2023",
                "reviewTitle": "Do I detect a hint of minty freshness?",
                "reviewText": "Simple to use and does the job. Installation by our plumber was easy. Be prepared though as the water temperature will depend on what line you attach it to.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}