{
    "remaining_requests": 37513,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/K-5724-0-Quiet-Close-Adjustable-Self-Cleaning-Electrical/dp/B017Y451GM",
    "body": {
        "name": "KOHLER 5724-0 PureWash M250 Elongated Bidet Toliet Seat, Manual Non-Electric Bidets for Existing Toilets, Adjustable Bidet Sprayer, White",
        "price": "$99.99",
        "originalPrice": "",
        "rawPrice": 99.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/K-5724-0-Quiet-Close-Adjustable-Self-Cleaning-Electrical/dp/B017Y451GM",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNSHHRGV"
        ],
        "asinVariationValues": [
            {
                "asin": "B017Y451GM",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$99.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31c9NBysDyL._SS36_.jpg"
            },
            {
                "asin": "B06XN66S21",
                "variationName": "Color",
                "variationValue": "Biscuit",
                "price": "$115.02",
                "variationImageURL": "https://m.media-amazon.com/images/I/21cbdNUxgYL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/21fANI3rfUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41to0EViQUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31XQ7k XFTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31LUnXD5IoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21JDqAhq1lL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21PbBtaH3pL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Czhg0Rq-L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Kohler Store",
            "link": "https://www.amazon.com/stores/Kohler/page/65234E2A-82BF-4ACB-81F2-8475C60E4EB4?ref_=ast_bln"
        },
        "brand": "Kohler",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 3814,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 3 hrs",
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 12 hrs 45 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "No Slam Elongated Bidet: Puretide Quiet Close Toilet Seat features a lid that closes slowly and silently without slamming; the side handle allows you to adjust water intensity and spray position without electricity, while the hygienic self-cleaning wand automatically rinses after each use, White",
            "Shift Prevention: Grip-tight bumpers prevent the toilet seat from shifting during use and add stability; it features an ergonomically contoured, closed-front toilet seat elongated surface for added comfort and a single wand that provides ambient-water cleansing",
            "Easy to Clean Kohler Toilet Seat: Quick release hinges allow for easy removal and convenient toilet cleaning; to clean, simply use a soft, dampened sponge or cloth; never use an abrasive material such as a brush or scouring pad",
            "Effortless Install: Quick-attach hardware for fast and secure installation, with color matched plastic hinges, all hoses and connections included; requires connection to toilet water supply line",
            "Elongated Toilet Seat: Fits most elongated toilets; for non-residential application recommend using K-7671 or K-20110 Kohler toilet seats"
        ],
        "description": "The PureWash M250 bidet toilet seat makes it easy to add the freshness and assurance of personal cleansing to your existing toilet. With a sleek, low-profile seat design, PureWash M250 provides the superior cleansing of a spray wand that's fully adjustable for position and water pressure. This manual bidet toilet seat requires no electricity or batteries and installs in minutes, connecting to the toilet's water supply line.",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Kitchen & Bath Fixtures",
                "link": "https://www.amazon.com/Kitchen-and-Bath-Fixtures/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3754161"
            },
            {
                "name": "Bathroom Fixtures",
                "link": "https://www.amazon.com/bathroom-fixtures/b/ref=dp_bc_aui_C_3?ie=UTF8&node=680350011"
            },
            {
                "name": "Bidet & Bidet Parts",
                "link": "https://www.amazon.com/Bidet-Bidet-Parts/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6810562011"
            },
            {
                "name": "Bidet Seats",
                "link": "https://www.amazon.com/Bidet-Seats/b/ref=dp_bc_aui_C_5?ie=UTF8&node=6810566011"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Brand",
                "value": "Kohler"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Style",
                "value": "Bidet Toilet Seat"
            },
            {
                "name": "Shape",
                "value": "Elongated"
            },
            {
                "name": "Product Dimensions",
                "value": "22.25\"L x 20\"W"
            },
            {
                "name": "Item Weight",
                "value": "7.8 Pounds"
            },
            {
                "name": "Operation Mode",
                "value": "Manual"
            },
            {
                "name": "Manufacturer",
                "value": "‎KOHLER"
            },
            {
                "name": "Part Number",
                "value": "‎K-5724-0"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎5724-0"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Size",
                "value": "‎Elongated"
            },
            {
                "name": "Pattern",
                "value": "‎Toilet Seat"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Number Of Pieces",
                "value": "‎1"
            },
            {
                "name": "Number of Handles",
                "value": "‎1"
            },
            {
                "name": "Special Features",
                "value": "‎Adjustable"
            },
            {
                "name": "Included Components",
                "value": "‎Toilet Seat"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "Warranty Description",
                "value": "‎KOHLER One-Year Limited Warranty"
            },
            {
                "name": "ASIN",
                "value": "B017Y451GM"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 3,814 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#17,329 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #16 in Bidet Seats"
            },
            {
                "name": "Date First Available",
                "value": "November 13, 2015"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Purewash M100 Bidet Attachment (K-22860-0) Purewash Elongated Bidet Toilet Seat (K-98804-0) Puretide Elongated Bidet Toilet Seat (K-5724-0) Puretide Round Bidet Toilet Seat (K-76923-0) Adjustable Water Pressure ✓ ✓ ✓ ✓ Dual Wands Front & Rear Spray ✓ ✓ - - Self-Cleaning Wands ✓ ✓ ✓ ✓ Adjustable Spray Position - - ✓ ✓ Manually Operated ✓ ✓ ✓ ✓ Fits Most Elongated Toilets ✓ ✓ ✓ Fits Most Round Toilets ✓ - - ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b42927ee-a7d0-48e0-9156-6b2992547af7.__CR5,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/904f0056-0285-40c4-ac56-2f4186c5f448.__CR2,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9b611eef-58f6-43ed-a8b5-f60b1978eb25.__CR5,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7027fc4-9d32-4d28-900e-f9c9f77c7c87.__CR13,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "reggers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRIJSWJIE2BTYQ5XLXVTADOR3ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MZMKBEC7HND9?ASIN=B017Y451GM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2019",
                "reviewTitle": "5.0 out of 5 stars Great bidet seat! So easy to use and install!",
                "reviewText": "I’ve always loved going to some high end hotels and finding an electric bidet toilet. It makes cleaning up so much more thorough. I didn’t think I could have one since I didn’t have an electric outlet near any of my toilets. I had heard a commercial about attachments to existing toilet seats. When I researched them, they looked clunky and just ugly since they are mostly visible.When I found the whole bidet toilet seat i was amazed. I did some research and settled on the Kohler puretide it looked great and sounded like it fit my needs. My only concern was that it didn’t heat the water but that was a small concern since I live in Hawaii - warm year round.Installation took about 20 minutes for each bathroom and that included removing the existing regular toilet seats. The connections were very easy to do and it looks great in the bathroom. The only thing that looks out of the ordinary is the handle and that’s fine - it’s easy to reach and maneuver when you’re using it.Some people have complained about the size of the seat opening being smaller than a normal seat - but that is to be expected. You’re working with a standard sized toilet boil and you have to find a way to fit in the bidet functionality. That takes up space and there’s no way around that - you have to fit in the bidet’s functions somewhere and there’s no way around that. Also note I am a man and have no problem using it and feeling cramped and uncomfortable down there.My only concern is that when I have people over to my place and they use the guest bath, I have to explain to them to not turn it on unless they’re seated - unless they want to get sprayed with water and have water all over the floor.I’m incredibly happy and wish i had known about this seat years ago! It works like a charm. The spray is very strong and I can direct it as needed. My concern about not having heated water was a non-issue since my cold water isn’t ice cold. It also looks clean and sleek in the bathroom.(Note - I used the softness score to indicate “fit and comfort”. I gave it 4 stars since it feels different than my previous seat (naturally) and takes a bit of getting used to.)",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lorraine Z.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWRE6ILHI755JZ4RDMPA2BUPD3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ6AG2ENZWEHD?ASIN=B017Y451GM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars completely satisfied with my purchase LOVE IT!!",
                "reviewText": "It fits perfectly on m Toto toilet. Also works perfectly as well. I waited a long time to buy and am happy with my decision...wondering how I got along without it.. So easy to use, the spray is just right, and even the water temperature seems ideal I was worried that it would feel too cool Not the case I LOVE IT!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. L. Messina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYBWUQKDQMSZ72QWMBNBXGIULPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAF82IF0T1JYY?ASIN=B017Y451GM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2022",
                "reviewTitle": "4.0 out of 5 stars The Bold, Practical Joke of Kohler",
                "reviewText": "This isn't my first bidet rodeo. Like many others, I came across their practicality during 'the great toilet paper shortage of 2020'. I stumbled upon a Coco brand bidet at a truck stop in Iowa (of all places), that felt so incredible, I felt like I had to start going back to church on Sundays to atone for my sin. Nonetheless, it was everything a bathroom experience should be: efficient, comfortable and, most importantly, much more sanitary than a non-bidet experience. It gets you cleaner and your hands never come near your bottom.A few months later, I purchased an electronic Lotus Bidet. It had everything I might want from a bidet: heated seat, heated water, adjustable heat settings, adjustable pressure, adjustable nozzle position and a dryer. I think any modern electric bidet is certain to give you the same, excellent experience, though (from what I've read) all bidet dryers are still stuck in the pre-dyson type hand drying days. Remember when you'd push the button, put your hands under the dryer for awhile, then wipe them on your pants? That's where bidet dryers are.I had my Lotus for 2 years. During that time, I visited a spot in Europe with a ceramic 'sink' type bidet. It felt like washing your bottom in a sink. I mean, it was still more sanitary than just toilet paper alone, but it had nothing on the electric bidet. I was happy to return home. Life was great and then, I moved.Unfortunately, my awesome new place didn't have an outlet anywhere near the toilet or in a position where an electric cord was feasible. I figured I could easily transition back to a regular, non-bidet life. Turns out, the non-bidet world just isn't as sanitary and I immediately noticed the difference. I considered suffering it (is that suffering, or am I victim of first world problems?), but eventually decided to try a non-electric bidet.I wasn't too concerned with losing the dryer, since they don't work that great to begin with. I could easily live without the heated seat (I'm not royalty), but I was concerned for the loss of warm water. My concern was reasonable since a cold water bidet is sort of like drinking orange juice after brushing your teeth... but on your bottom. It's... 'intense', but not a deal-breaker. It definitely gets your bottom cleaner than toilet paper alone.So, what about the practical joke from my headline?The Kohler bidet is looks great, and feels great to sit on. It mostly easy to install, except for one thing: connecting the hose to the seat. There's a small filter that does everything to keep you from making a tight connection between the seat and T-Joint.I thought mine was pretty tight when I installed mine, until I went to the other room and heard what sounded like a burst pipe. I knew exactly what it was.I immediately shut off the gushing water and saw the connection had popped off: it seemed tight, but never actually was. Joke is on me.I fought with the connection for awhile (and I mean 'fought'), until I realized I wouldn't get a good connection unless I just took out the filter. I'm sure the filter would do well to keep out calcium, but for tonight, I'm leaving it off. I'd rather be the victim of one practical joke rather than two.Outside of that issue, it's a really great seat, though I can't lie: warm water would be nice.",
                "reviewVotes": "61 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "yellowtv",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGATFFZFODXEZQN5PFLEP2SREY5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4IP59FMOWSGM?ASIN=B017Y451GM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Simple and effective",
                "reviewText": "This is a simple and effective way to maintain hygiene. It could be therapeutic for some conditions.Easy and straightforward installation. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 15, 2021",
                "reviewTitle": "Easy install - works well",
                "reviewText": "I was looking add-on bidets but this one being integrated into the seat design made a lot more sense to me. I like that it comes with 3 different nozzles and the arm allows for adjustment of the spray angle while seated. The adapter is chrome plated metal not plastic. The soft close is nice too. I have this installed on a Toto elongated toilet. The fit isn't perfect but it is close enough and looks good in the closed position. The design is clean with nice styling.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 17, 2021",
                "reviewTitle": "HIGIENE",
                "reviewText": "LO PRÁCTICO, LA HIGIENE Y CON EL TIEMPO SE AHORRA DINERO, SIN PAPEL HIGIÉNICO.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PGCPGC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 8, 2023",
                "reviewTitle": "Easy Install Bidet",
                "reviewText": "The media could not be loaded. Very functional and practical. Only buy bathroom tissue once a year now (pack of 6) as you don't need it. Installed one of these on all the toilets in the house. You may need to explain to guests how to use it if they are not familiar with Bidets. Ambient water so no electric outlet required. Kohler made this one easy to install and use. Everyone in the family has expressed the Bidet beats paper, much cleaner than🧻too....",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Ni9eAFGBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61xlMH3TxVL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/D1z IjiFHvL.mp4"
                }
            },
            {
                "reviewerName": "Hine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 2, 2022",
                "reviewTitle": "Feels cheap but works well",
                "reviewText": "I agree with what most of the other reviewers say. The fact that the seat moves a bit when installed makes it feel cheap. Also, unlike other KOHLER products, the plastic feels light and flimsy. I also agree that the pressure is low. I had one of the $50 bidet attachment things before, and the pressure was quite high, but with this KOHLER product, I had to use the nozzle for houses with low water pressure. It's fine with that nozzle, but if you actually had low water pressure in your house, this probably would not work. Also, the opening is very small. A big person would have trouble using this. I should also mention that it did not fit one of our elongated seat KOHLER toilets which has a curved join between the tank and the pedestal, and so I had to install it on another older KOHLER toilet we have. Check your toilet product number before ordering.The installation was very easy, much easier than with the previous bidet. I probably spent half an hour all together but, but if I was doing it a second time, it could be done in ten minutes. The components are well made.The functionality is very good. Being able to move the jet makes a big difference. It is significantly better than a simple static attachment type bidet.All in all, it's a fair deal for the price, but I would prefer something with a more solid feel and a larger seat opening. Also, the Amazon listing should make it clear that it does not fit all elongated seat KOHLER toilets.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 18, 2021",
                "reviewTitle": "So glad we went this route.",
                "reviewText": "Lovely seat, very comfortable, three different spray tips to choose from (one at a time installed though) which helps with adjusting the spray pressure to your preference. Looks sleek, fits our toilet perfectly. Planning to buy more for other bathrooms.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$99.99",
                "sellerName": "Plumbing Distributors Inc.",
                "sellerRating": "5"
            },
            {
                "price": "$99.99",
                "sellerName": "General Plumbing Supply",
                "sellerRating": "4"
            },
            {
                "price": "$99.99",
                "sellerName": "Buildcom",
                "sellerRating": "4.5"
            }
        ]
    }
}