{
    "remaining_requests": 28785,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Leick-9066-RS-Favorite-Finds-Night/dp/B073LBWPJF",
    "body": {
        "name": "Leick Home Favorite Finds Nightstand Table with Shelf, Russet",
        "price": "$157.48",
        "originalPrice": "$252.03",
        "rawPrice": 157.48,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Leick-9066-RS-Favorite-Finds-Night/dp/B073LBWPJF",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CBV52KSQ"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Dark Earth/Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41fJaOPlX-L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Medium Oak",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41-HFkumosL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Mission Oak",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51D8ZvJmlCL._SS36_.jpg"
            },
            {
                "asin": "B073LBWPJF",
                "variationName": "Color",
                "variationValue": "Russet",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ax6acRtUL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Slate",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31AEZcYfBLL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71Rjus4K2sL._AC_SX522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Leick Home Store",
            "link": "https://www.amazon.com/stores/LeickFurniture/page/91EB64BE-7EDC-40AB-896F-094A542ED24B?ref_=ast_bln"
        },
        "brand": "LeickFurniture",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 2601,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20. Order within 3 hrs 45 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Solid Wood Construction: With sturdy North American solid hardwood construction, you will have this versatile end table for years to come",
            "Multi-Functional Side Table: Measuring 22 inches L x 16 inches D x 28 inches H, it is the perfect size to function as a side table, end table, or nightstand",
            "Authentic Mission Design: Beautiful russet finish accentuates the natural wood grain, while canted legs and blackened hardware deliver an authentic craftsman look",
            "Match Any Style: This Mission style nightstand table can work in many home design aesthetics including traditional, arts and crafts, and contemporary",
            "Easy Assembly: This side table is designed for a quick and seamless set-up"
        ],
        "description": "The Leick Home Mission Living Room End Table showcases a beautiful real wood grain, canted legs, and blackened hardware for an Arts and Crafts design. The durable wood drawer is a great place to store remote controls, notepads, and more to clear the table top of clutter while keeping everything within reach. Use the lower shelf for additional storage or to display home decor. This small side table is perfect for a living room couch end table, bedroom nightstand, or anywhere you need a little extra storage. Its small scale makes it easy to fit into corners, between furniture, or in a small room. Built from solid, North American ash lumber and protected with a durable, hand-rubbed finish, all it takes is a few minutes and your home's newest addition is at your service. Designed and manufactured by Leick Home, the trusted source for quality home furnishings for every taste and budget.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b?ie=UTF8&node=1063308"
            },
            {
                "name": "Nightstands",
                "link": "https://www.amazon.com/Nightstands-Bedroom-Furniture-D%C3%A9cor/b?ie=UTF8&node=3733251"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Leick Home"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Room Type",
                "value": "Bedroom, Living Room, Home Office"
            },
            {
                "name": "Included Components",
                "value": "End Table, Assembly Guide, Installation Tool"
            },
            {
                "name": "Color",
                "value": "Russet"
            },
            {
                "name": "Furniture Finish",
                "value": "Oak"
            },
            {
                "name": "Model Name",
                "value": "Favorite Finds"
            },
            {
                "name": "Model Number",
                "value": "9066-RS"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 2,601 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#84,814 in Home & Kitchen (See Top 100 in Home & Kitchen) #654 in Nightstands"
            },
            {
                "name": "Frame Material",
                "value": "Wood"
            },
            {
                "name": "Top Material Type",
                "value": "Ash,Solid + Manufactured Wood"
            },
            {
                "name": "Is Stain Resistant",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Wipe clean with a dry cloth, do not use strong liquid cleaners or any polish containing silicone"
            },
            {
                "name": "Assembly required",
                "value": "Yes"
            },
            {
                "name": "Assembly Instructions",
                "value": "Require Assembly"
            },
            {
                "name": "Warranty Type",
                "value": "Limited"
            },
            {
                "name": "Warranty Description",
                "value": "1 year limited warranty."
            },
            {
                "name": "Specific instructions for use",
                "value": "Residential Use"
            },
            {
                "name": "Product Dimensions",
                "value": "16\"D x 22\"W x 28\"H"
            },
            {
                "name": "Item Width",
                "value": "22 inches"
            },
            {
                "name": "Leg Length",
                "value": "27.25 Inches"
            },
            {
                "name": "Tabletop Thickness",
                "value": "5.69 Inches"
            },
            {
                "name": "Size",
                "value": "16 in x 22 in x 28 in"
            },
            {
                "name": "Item Weight",
                "value": "34 Pounds"
            },
            {
                "name": "Maximum recommended load",
                "value": "30 Pounds"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Number of shelves",
                "value": "1"
            },
            {
                "name": "Number of Drawers",
                "value": "1"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Style",
                "value": "Night Stand"
            },
            {
                "name": "Table design",
                "value": "Nightstand"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Special Feature",
                "value": "Storage"
            },
            {
                "name": "Is Foldable",
                "value": "No"
            },
            {
                "name": "Base Type",
                "value": "Legs"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Indoor"
            },
            {
                "name": "Shape Rectangular",
                "value": "Top Material Type Ash,Solid + Manufactured Wood"
            },
            {
                "name": "Frame Material Wood",
                "value": "Item Weight 34 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Why Choose Solid Wood? When shopping for furniture, it's important to consider the materials used in its construction. While manufactured wood, such as particleboard or plywood, may seem like a budget-friendly choice, real wood is often a better value in the long run. Solid wood furniture has been a staple in homes for generations, and for good reason. Solid wood furniture has a timeless appeal that transcends trends and styles. Whether your home is modern, traditional, rustic, or eclectic, solid wood furniture can seamlessly blend in and elevate the aesthetic of your space. Its timeless charm ensures that it will never go out of style, making it a smart and durable investment.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c7d0067f-2887-4076-bebf-ebc14e311ff2.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Features Solid Wood Construction: With sturdy North American solid hardwood construction, you will have this versatile end table for years to come Multi-Functional Side Table: Measuring 22 inches L x 16 inches D x 28 inches H, it is the perfect size to function as a side table, end table, or nightstand Authentic Mission Design: Beautiful russet finish accentuates the natural wood grain, while canted legs and blackened hardware deliver an authentic craftsman look Match Any Style: This Mission style nightstand table can work in many home design aesthetics including traditional, arts and crafts, and contemporary Mission Side Table in Russet The Leick Home Mission Living Room End Table showcases a beautiful real wood grain, canted legs, and blackened hardware for an Arts and Crafts design. The durable wood drawer is a great place to store remote controls, notepads, and more to clear the table top of clutter while keeping everything within reach. Use the lower shelf for additional storage or to display home decor. This small side table is perfect for a living room couch end table, bedroom nightstand, or anywhere you need a little extra storage. Its small scale makes it easy to fit into corners, between furniture, or in a small room. Built from solid, North American ash lumber and protected with a durable, hand-rubbed finish, all it takes is a few minutes and your home's newest addition is at your service. Designed and manufactured by Leick Home, the trusted source for quality home furnishings for every taste and budget.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ffa40f6a-0a27-47d7-b401-331265f01f65.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Solid Wood Construction With sturdy North American solid hardwood construction, you will have this versatile side table for years to come Authentic Mission Design Classic russet finish side table with solid ash top and oak veneer for the craftsman look Easy Assembly This table is designed for a quick and seamless set-up",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8779efdb-cda0-40b9-9a73-90e06ee4485d.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cdb64478-6130-43c1-a973-e8d1eda49274.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e3c812bd-575e-4538-8a9d-4d2743ef077d.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/c7d0067f-2887-4076-bebf-ebc14e311ff2.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ffa40f6a-0a27-47d7-b401-331265f01f65.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/09c28dd9-3b97-42fa-8b67-2b419cca704a.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8779efdb-cda0-40b9-9a73-90e06ee4485d.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cdb64478-6130-43c1-a973-e8d1eda49274.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e3c812bd-575e-4538-8a9d-4d2743ef077d.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/01b662c6-6214-44b8-ba9e-d1dc7a9ec3d0.__CR0,0,1940,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6X34ZB444V7XUBXOYXS6WIEPIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NZEX8KM7KIIZ?ASIN=B073LBWPJF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Solid good looking table",
                "reviewText": "Shipped via ups; and they did not hustle. Was well packed and had no damage. Put it together myself in about 45 min. (only 12 bolts). The lamp took most of the time; but was not difficult. Directions were good. The top is veneer while the sides were solid wood. The drawer is small but well made and assembled. The height is just right. I would not put much weight on the bottom shelf as the 4 bolts are the only support. I am 5'-8\" and can reach the switch. The shade is OK (square and rustic brown \"grass\"). I do not need the arm to use my laptop; maybe for reading if the recliner was more upright. I would buy the table again and recommend it if you like mission style.Update: After using for a few days I decided to replace the lamp harp. It came with a 10\"(so a larger 3way bulb would fit). A 7\" lamp harp keeps the light out of my eyes when the arm is not extended for reading; but is too short for most 3way bulbs. Also the just OK cheap shade was replaced with a pricey antique shade ($47). Went a little crazy and replaced the screw top on the lamp harp with an amber crystal one for another $10. The result was (in my humble opinion) fantastic; and well worth the total cost pf about $277.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQ7AMVIW2OWBM25WPAURWM2BZHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7ZLC8OUAQLD4?ASIN=B073LBWPJF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 7, 2012",
                "reviewTitle": "5.0 out of 5 stars Great price on a good looking sturdy Mission style table",
                "reviewText": "I had been looking at a few different Mission Style end tables, my thhinking was Mission doesn't need much to make it look good other than the basic design and the right coloration. So after considering the size of the all of the tables of this type here on Amazon I bought one to try. It worked out so well I bought another so both sides of my sofa have these end tables with lamps and plent of space left over. For me the size of the table top was a major consideration and I couldn't find one with a larger table top space. It would have been nice to have had a larger drawer and the vertical slatts that are on at least a few of the other offerings, but it sseemed to me that they all had a smaller top so...The tables look great and they feel solid, the assmebly is one of the fastest and easiest I've encountered. The drawer is a little small but functional, it opens & closes easily and though smallish is usable and large enough to store a few remotes. The over all area of the drawer is 2 1/2\" Deep, X 5\" Wide, X 12\" Long.The tables look very nice and the construction is as solid as anything you can find under two hundred or so, plus the assembly is fast and easy as it gets. In my opinion the tables look nicer in real life and have been told that they do not look like \"put together furniture\" but look and feel like something you would buy from a furniture store.I was hesitant about buying these tables ( thinking it was probably cheaply made and flimsy and no major loss if they where ) so I only bought one. With the intention of buying one for the hidden far corner of the living room, and buying a nicer table more expensive table for the area that would be exposed to view, but actually these look fine, and I'm not worried about the look at all. In fact they fit in very well with my living room furniture. I have a solid oak Mission style Entertainment Center (two bookshelf that stand about 5.5 feet tall with closed door storage on the bottom of each tower) and a very nice Rustic Oak Mission Style Coffee table, and these in expensive end tables match the look of the rest of the living room furniture.Over all the color and finish are outstanding. The drawer though a little small is still handy with enough room for moderate storage, and opens and closes easily. I believe the color will match virtually any darker colored stained oak Mission style furniture. The shipping and delivery where very prompt and they actually arrived sooner than I had expected. The packaging was very good, sufficient to protect the finish and wood from all but the most severe abuse and mishandling.So with all this said I would not hesitate to recommend them to anyone, and particularly for the money. These two tables where a great buy and will be around for years to come.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Resident Gourmet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMS6SZWPXBWDZNA4C3VJTVW5MEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Q4Z06TU1G5PQ?ASIN=B073LBWPJF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2023",
                "reviewTitle": "5.0 out of 5 stars CLASSIC MISSION STYLE THAT LOOKS RIGHT AT HOME WITH OUR 1957 VINTAGE MISSION FURNITURE!",
                "reviewText": "I purchased this Mission Style side table to function as a computer stand for my ATX sized gaming PC/Chassis which lives next to my 55\" SONY 4k TV and surround sound system equipment rack.The space below the table top is perfect for stowing my UPS battery backup, and the super high quality and Looooong accessory drawer is PERFECT for storing all the little doo dads PCs, game consoles and TVs tend to need around, such as remote controls, USB sticks, portable backup drives, game cartridges etc.The drawer comes pre-assembled and already installed into the main top piece of the table. The slider system for the drawer is first class all the way and has a nice buttery feel to it when you slide it open or close it. It closes with a satisfying “clunk” as well.Assembling this thing is really easy. All of the hardware and tools are included! Basically, all you need to do is bolt the two side pieces on to the main table top piece that houses the drawer and then bolt the bottom shelf to the side pieces.The quality of the wood used in this piece is really impressive! It actually matches the color and overall finish of our vintage 1950s solid Dark Oak Mission furniture in the same room. It's actually uncanny how close the finish color and varnish coating resembles pieces that were hand made out of solid oak back in 1957 when my parents purchased our vintage mission set new. This was a nice surprise we had not expected!The table is very heavy for its size and very stable. Which is a GOOD THING! This piece just exudes high quality materials and workmanship!The black anodized HEX screws that affix the side pieces and the bottom shelf to the table top (Main Piece) all bolt into genuine BRASS threaded inserts that are already installed at the Leick Home factory. No worries about the screws cracking the wood, or otherwise not tightening properly, like our old POS side table this product is replacing. (A wobbly mess from day one!)If you are a fan of classic Mission Style furniture, you can purchase this piece with confidence! It has all the classic looks and feel of original Mission pieces from the 50s. If we told someone that this table was a vintage piece from 1957, they would have no reason to doubt us!",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Al V.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLEAZJRJPUN26PUGOR44FUYYLFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRU3V3H80H8QD?ASIN=B073LBWPJF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "4.0 out of 5 stars Beautiful woodwork!!",
                "reviewText": "This was a perfect piece in my new Living room!! Was disappointed that it wasn't the square one I chose, but still looks great!! The building of it was easy bc it was almost already put together! The price was very descent for this piece!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TSampson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTFMXBDC6HZWLPZTLGQ5XZLYXGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IGNI3ZDRY9AE?ASIN=B073LBWPJF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice table!",
                "reviewText": "This table went together quickly and was a snap to assemble! The bolts fit nicely into the machined holes. The table looks good and seems very sturdy. Good value for the money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 2, 2023",
                "reviewTitle": "Pleasantly surprised",
                "reviewText": "Don’t think of flat pack furniture. Instead think of top quality, well designed furniture. Yes you have to put some parts together but it can be done quite easily. I will definitely purchase more",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 22, 2020",
                "reviewTitle": "Made in China?",
                "reviewText": "Before I ordered, I went to the Leich Home website and saw their long heritage of making furniture in Sheboygan Wisconsin since 1910. Was I surprised when the two end tables got delivered with \"Made in China\" stickers all over the boxes and tables. Really wanted to support a North American manufacturing company not just some empty marketing company. Tables are ok but one of the units has two scratches on table top. Need to decide if I will ask for replacement or attempt to repair my self given returning the units will be difficult. Overall, disappointed. Units seem expensive for offshore product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg C",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 30, 2020",
                "reviewTitle": "Size needs change",
                "reviewText": "Sturdy furniture but should hold standard file folders",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bassetluv",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 12, 2019",
                "reviewTitle": "Very sturdy, handsome stand",
                "reviewText": "Okay, after getting past a mistake I made during assembly (where I thought the top of the stand wouldn't align because of the back panels...my error) I was amazed at how easily the stand went together. Instructions are simplistic, but you almost don't need them anyway as it's such a basic setup. Not counting the time I spent scratching my head over my own error, I'd say it takes about 10-15 minutes to put the stand together.It's extremely sturdy, heavy, and fits in a corner snugly with minimal space taken up - unlike the corner stand I was replacing, that jutted out quite a bit. In a small room, this can make a big difference.The stand arrived in an extremely well-packaged box, really limiting the chance of damage during shipping. There wasn't a nick, scratch, or even the slightest mark on any of the components when I unboxed it. The stand itself unfolds once out of the box, and the buyer needs only to insert the two back pieces (and bottom shelves), then add the top (attaches with three bolts), and then insert the clips that the adjustable shelfs rest on. That's it. A great design, user friendly, and the finished look of the stand is beautiful. Any equipment that is behind the glass door (in my case, a cable video box, a PS3 and an Apple TV box) will still receive the signal from their remotes when the door is shut, and the two side doors have lots of space to store DVDs and Blu-rays.My only 'con' with the stand would be the odour. It does have a rather strong scent when first set up; I've had it for a day now and it seems to be dissipating a bit. I suspect that within the next day or so, it will have aired out completely. For someone who is sensitive to chemical smells it might bother them; for myself, it doesn't affect me. Overall, I'm extremely pleased with this corner stand, and it was well worth the purchase.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cindy Szram",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 5, 2018",
                "reviewTitle": "Five Stars",
                "reviewText": "This is a really nice quality table ~ good construction, easy to assemble and beautiful lines. Love it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$157.40",
                "sellerName": "Cymax",
                "sellerRating": "4"
            },
            {
                "price": "$167.83",
                "sellerName": "OJCommerce",
                "sellerRating": "4"
            }
        ]
    }
}