{
    "remaining_requests": 27156,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Linksys-AC1600-Router-Certified-Refurbished/dp/B00LV84SQM",
    "body": {
        "name": "Linksys Smart Wi-Fi AC1600 Router (EA6400) (Renewed)",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Linksys-AC1600-Router-Certified-Refurbished/dp/B00LV84SQM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31oBG3ZB8oL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41aMu5-RyLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31OmI56xCxL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 133,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "This Certified Refurbished product is manufacturer refurbished, shows limited or no wear, and includes all original accessories plus a 90-day warranty",
            "Wireless AC Technology - the Linksys EA6400 uses the next generation Wireless AC technology for powerful networking",
            "Ultimate Speed - Up to 3x Faster than Wireless N - With the Linksys EA6400 Experience, speeds approximately 3x faster than Wireless N (N300 + AC1300. Beamforming Technology - Focuses wireless signal from router to the client device for optimal performance",
            "USB 3.0 Port - Add external storage or other devices to share across your network. USB 3.0 transfer rate is 10x faster than USB 2.0",
            "Advanced Security and Guest Access - Wireless WPA/WPA2 encryption and SPI firewall help keep your network safely connected. Easily secure your network, while providing guests with Wi-Fi access"
        ],
        "description": "Wireless-AC for Faster Speed and Reliability Upgrade your wireless home network and enjoy speeds up to 3x faster than conventional wireless-N. As the number of Wi-Fi-enabled devices in your home increases, wireless-AC makes it possible for you and your family to simultaneously stream movies, music or play online games without interruption from a slow network connection. Includes a USB 3.0 port and four gigabit ports that let you connect multiple devices and increase your storage space. Beamforming Creates Stronger, Faster Connections Features beamforming, an innovative technology that optimizes the wireless signal strength between your connected devices and router. Beamforming enables the router to identify and connect directly with other devices, rather than simply sending out wireless signals in a general direction. This results in faster network speeds, better wireless range, and reduced interference from other devices. It also helps extend the battery life of connected devices and reduce their power consumption because data is transferred more quickly. Manage Your Home Network Remotely with Linksys Smart Wi-Fi With Linksys Smart Wi-Fi you can access and control your home network from wherever you are using your smartphone, tablet, or computer. For example, you can set parental controls to restrict Internet access during certain times of the day and create unique, secure Wi-Fi passwords for your guests. You can also monitor activity on your home network, add new devices, and check upload and download speeds. In addition, Linksys Smart Wi-Fi allows you to prioritize which devices on your network receive the most bandwidth to reduce lag times and buffering when you're streaming HD media or gaming. Your Linksys Smart Wi-Fi account also gives you access to a growing suite of apps that provide new ways to control and interact with your home Wi-Fi network.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b?ie=UTF8&node=172504"
            },
            {
                "name": "Routers",
                "link": "https://www.amazon.com/Routers-Networking-Online-Communication-Add-Ons/b?ie=UTF8&node=300189"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "13 x 10.4 x 2.7 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.05 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Linksys"
            },
            {
                "name": "ASIN",
                "value": "B00LV84SQM"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 133 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "July 16, 2014"
            },
            {
                "name": "Brand",
                "value": "Linksys"
            },
            {
                "name": "Model Name",
                "value": "EA6400"
            },
            {
                "name": "Special Feature",
                "value": "WPS"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "2.4 GHz Radio Frequency"
            },
            {
                "name": "Compatible Devices",
                "value": "Tablet, Smartphone"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Security"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired;Wireless"
            },
            {
                "name": "Color",
                "value": "For Canada Only"
            },
            {
                "name": "Security Protocol",
                "value": "WPA-PSK, WPA2-PSK"
            },
            {
                "name": "Number of Ports",
                "value": "3"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bender Rodríguez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMGKVQPIGQDRAYZRRYVLBIE3PSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNJFMBCJ4XZUP?ASIN=B00LV84SQM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2017",
                "reviewTitle": "5.0 out of 5 stars Worth Every Penny! Works Like A Champ!",
                "reviewText": "After close to two months of use we have zero complaints. The signal is strong (5 bars) throughout the house (1,000 sq. ft./multiple floors). At first we were a bit weary since it is a refurbished, but it is working like new and looked new out of the box. Recommend using the phone app for setup as it was user friendly. Used with Cox.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cameron Scholtz, PhD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAX3M2I4AXOIVG4NU2SCZLKWILA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28M0PEB31YMGA?ASIN=B00LV84SQM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2017",
                "reviewTitle": "5.0 out of 5 stars An Absolute Bargain!",
                "reviewText": "I purchased this Certified Refurbished unit from Amazon.1. Plugged it in. Connected one RJ45 patch cable to my cable modem. Connected another RJ45 cable to my computer. And one to my printer.2. From my computer, loaded up my web browser and pointed it to 192.161.1.13. Signed in with the password provided on the router. (don't forget to change this)4. Configured the wireless settings for my wireless devices.Had everything up and running about 30 minutes. Works great! Signal seems strong. It's in a back bedroom and I have about 60-70% at the other end of the house. However, I'll be using my older Lynksys Linksys EA4500 as a wired bridge on the other side of the house.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SD Abingdon, MD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP5NUWZQFXY2ARKUJPPM7NMQ3JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLERASZPZGTOQ?ASIN=B00LV84SQM",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 15, 2016",
                "reviewTitle": "1.0 out of 5 stars New one Great, Refurb one trash. Linksys support SUCKS.",
                "reviewText": "I have one that is not a refurb and I would give it 4 stars. I have liked Linksys for some time and have LOVED CISCO for a while.Buying a refurbished device is always a gamble. They generally fall into 2 basic categories: \"Buyer didn't like it and sent back a perfectly fine box\" (that cant now be sold as new) and \"Defective equipment that will pass the most basic of tests.\" If it is returned and will run the most basic set of tests for 1 minute, the manufacturer certifies it as working and resells it. That's what I got this time. It works great for 30 to 90 minutes. Then all wireless connections stop working. Other people on the same cable modem and router keep working fine, but everyone on this router freezes. After a reboot it is again fine for 30 to 90 minutes. I am virtually sure this box will be \"re-certified\" and sold to someone else. I had higher expectations since CISCO now owns this company and knows a few things about \"burn period\" and \"intermittent failure\".UPDATE: After 1 hour of inline CHAT and then 30 minutes on the phone that got disconnected, I tried one more time to get an RMA. After another 20 minutes I was told that since I purchased it at Amazon, I had to email in a JPEG of the receipt to get an RMA number. I did that while still on the phone. After 24 hours it has not arrived. I will throw this GARBAGE away before I will waste any more time talking to Linksys.DO NOT BUY THIS REFURBISHED.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tyler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHH5L4QXKIHBS7RI4YN7N2FSUUMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV85G608O1J4T?ASIN=B00LV84SQM",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2015",
                "reviewTitle": "3.0 out of 5 stars Good speed, fair range.",
                "reviewText": "It was easy to set up and the speed is solid. Right next to the unit my computed showed 300Mbps (in the wireless connection status window) and several speed tests confirmed I was receiving our maximum ISP upload/download rates using the EA6400. Our verizon router maxed out around 20-25 Mbps. The EA6400 provides our full speed of ~55Mbps (5Ghz) next to and one floor down from it. The 2.4Ghz is almost as fast reaching about 40-50Mbps. The 2.4Ghz range shows 2/5 bars in our basement, 2 floors down, which is disappointing. The price was right when I bought this, but there are likely better options out there.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sunlandgal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOGD3GCQC2RD5VJ6AXNRPDVHR4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLOP9R26DMENK?ASIN=B00LV84SQM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2017",
                "reviewTitle": "5.0 out of 5 stars Great Budget AC Router",
                "reviewText": "Hubby set this up and almost decided to return it due to poor performance: dropped signal to smart TV and other devices. He then decided to check for any updated software from Linksys and found the latest version. That did the trick! The unit provides superior coverage throughout our 2900 sq ft 2 story home as compared to our older E2500 and E1000 Linksys routers and full 100mbs download speeds from our Spectrum cable internet when in the same room as this on our N devices and that speed on my iPhone6 with AC from where we hang out in the family room, 30 feet and 2 walls away. He tested this after DD-WRTing the E2500 and E1000 routers, but the speeds are faster without them running, even with 2-3 interior walls in between. We opted for the inexpensive Squaretrade 2 year warranty on this refurb item, a total no-brainer addition. This is a true bargain for a budget AC router.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "XzillaX",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEETICOJUSMWOLNVMJNAR6QRB7AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVA1CS0FXU6RF?ASIN=B00LV84SQM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 12, 2017",
                "reviewTitle": "4.0 out of 5 stars Good buy, decent speeds",
                "reviewText": "I pay for a decent internet plan with TWC/Spectrum and was wondering why I was having connectivity and latency issues with my devices on wifi. Replaced my Netgear WRG614 with this model. Excellent upgrade, and just what I needed to increase my speeds 10x+. My gaming console, laptop, phones, tablets, etc. can all connect simultaneously and have decent speeds now. Took away one star due to setup. Refurbished device had settings and needed to be fully reset before it would allow proper setup. Simple fix for myself, as I work in IT, but the regular joe might take a moment to figure it out. Would definitely buy this again.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa Young",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2CN53ABPVI2KLPPWU3A2ALPFTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BGVRDLGHNOUM?ASIN=B00LV84SQM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2015",
                "reviewTitle": "5.0 out of 5 stars Easy setup, solid performance.",
                "reviewText": "This router after 1 day, is all I could ask for from a configuration and performance standpoint. Buying it refurbished cost half price of a new unit and I simply added a 2 year square trade warranty for $5 just in case anything does go wrong. It was a breeze to setup and performance is great. Time will tell on the refurbished aspect, but again purchasing a simple extended warranty still put the unit at less than half price of a new unit.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Friendly Lime",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKH432245MRDVJSCSCLIOPCK3IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO0B9MSYIHI5S?ASIN=B00LV84SQM",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2017",
                "reviewTitle": "2.0 out of 5 stars it's hard to believe that the \"Linksys Official Store\" would do such a crappy job, but",
                "reviewText": "I bought this router (refurb EA6400) from the \"Linksys-Official-Store\" in Amazon.The condition of the item was OK (looked almost new), but was poorly refurbished:- The router had not been reset to factory conditions.- The \"SimpleTap\" NFC card was missing.- In particular, there was still information about some previous user (i.e., a list of previous devices).- The firmware version was old.Frankly, it's hard to believe that the \"Linksys Official Store\" would do such a crappy job, but....On the positive side, the router seems to perform fine so far (after factory reset and updating the firmware). But it's been only two days so far -- given some of the other reviews, I'm not too confident this will last...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}