{
    "remaining_requests": 27057,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/D-Link-Aquila-AX3000-Wi-Fi-Router/dp/B00PTQNOC6",
    "body": {
        "name": "D-Link AX3000 WiFi 6 Mesh Router - Contemporary Ecofriendly Design - High-Performance - Feature Rich - AI Enabled - Parental Controls – Covers up to 2800+ sq. ft – Expandable Mesh (M30)",
        "price": [
            "2 options from $85.54",
            "1 option from $169.99",
            "11 options from $47.49"
        ],
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/D-Link-Aquila-AX3000-Wi-Fi-Router/dp/B00PTQNOC6",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CSWJQTC6"
        ],
        "asinVariationValues": [
            {
                "asin": "B00PTQNOC6",
                "variationName": "Style",
                "variationValue": "AX3000 1-Pk Router",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CQYB2W79",
                "variationName": "Style",
                "variationValue": "AX3000 2-Pk Mesh System",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B084H5K2C4",
                "variationName": "Style",
                "variationValue": "Router AC2640",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08DF9LGFL",
                "variationName": "Style",
                "variationValue": "Router AX5460",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "30",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/210QJRd8AKL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41MT2HlB7sL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BPJzdocJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PgX1UYLzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41UvD L2coL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sNoIvOxcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418p54EdrHL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/59e08a21-4ba1-45de-8c42-bdc2c3db1547/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/95364685-70e9-4438-9419-42bede4184c3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/730b481c-14bc-45be-980f-86523f18b3a1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/29fd3ea3-87f0-4095-90f3-e564de52b46b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c418077c-c817-4eeb-bb74-dcaaf936d105/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1e5b7739-a029-4430-a69a-72d628f2d7d3/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the D-Link Store",
            "link": "https://www.amazon.com/stores/D-Link/page/0C3604A4-614C-4C7D-8006-7E3CBC48CC12?ref_=ast_bln"
        },
        "brand": "D-Link",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 511,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "ULTRA FAST CONNECTIVITY: Revel in speeds up to 3 Gbps with an extra antenna on the faster 5 GHz band, assuring seamless video streaming, video conferencing, and smooth gaming.",
            "UNINTERRUPTED WIFI EVERYWHERE: Enjoy robust 360° spherical coverage courtesy of a sophisticated antenna design and advanced AI technology, ensuring fast and consistent Wi-Fi in every corner of your home.",
            "SCALE-AS-YOU-NEED MESH WIFI: Future proof your network and easily expand your coverage by adding more AQUILA PRO AI devices to create a whole home Mesh network.",
            "BLAZING FAST GIGABIT WIRED CONNECTION: 4 × Gigabit LAN ports allow you to make fast and reliable connections to wired devices like smart TVs, gaming PCs and more. The Gigabit WAN port lets you get the most from your service provider Internet Connection.",
            "BETTER PROTECT YOUR HOME NETWORK: Help keep your family safer online with our premium home network security features like Advanced Parental Controls, ETSI EN 303 645 cybersecurity certification and WPA3 encryption.",
            "SETUP AND MANAGEMENT SIMPLIFIED: The intuitive AQUILA PRO AI app helps guide you through setup and monitors your network to help you keep it running at peak performance. Easily setup Enhanced Parental Controls, Guest Network and more right from the app.",
            "REFINED AESTHETICS: Boasting an eagle-inspired form and a unique feather-patterned ventilation design, the M30 seamlessly complements any home décor. Feel comfortable placing it out in the open and letting your WiFi soar.",
            "ECO-FRIENDLY DESIGN: With a housing made from post-consumer recycled materials and delivered in sustainable packaging, the M30 was designed to reduce its environmental impact."
        ],
        "description": "Experience the ultimate smart home networking solution with D-Link AQUILA PRO AI. Designed with a blend of elegance and functionality, the cutting-edge AQUILA PRO AI AX3000 Wi-Fi 6 Mesh Router (M30) delivers premium AI optimized Wi-Fi 6 performance, unrivaled speed, extreme capacity, and impressive range, all tailored to meet the demands of even the most intensive home networks. Say goodbye to connectivity issues and embrace a seamless online experience with the AQUILA PRO AI.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1/000-0000000-8675309?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2/000-0000000-8675309?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3/000-0000000-8675309?ie=UTF8&node=172504"
            },
            {
                "name": "Routers",
                "link": "https://www.amazon.com/Routers-Networking-Online-Communication-Add-Ons/b/ref=dp_bc_aui_C_4/000-0000000-8675309?ie=UTF8&node=300189"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2.8 x 0.31 x 5.5 inches"
            },
            {
                "name": "Item Weight",
                "value": "11.8 ounces"
            },
            {
                "name": "ASIN",
                "value": "B00PTQNOC6"
            },
            {
                "name": "Item model number",
                "value": "M30"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 511 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#212,206 in Electronics (See Top 100 in Electronics) #1,430 in Computer Routers"
            },
            {
                "name": "Date First Available",
                "value": "November 19, 2014"
            },
            {
                "name": "Manufacturer",
                "value": "D-Link"
            },
            {
                "name": "Country of Origin",
                "value": "Taiwan"
            },
            {
                "name": "Brand",
                "value": "D-Link"
            },
            {
                "name": "Model Name",
                "value": "D-Link Aquila Pro AI AX3000 Mesh Wi-Fi 6 Router"
            },
            {
                "name": "Special Feature",
                "value": "QoS, Guest Mode, WPS, Remote Access, Parental Control"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "802.11n, 802.11b, 802.11ax, 802.11ac, 802.11g"
            },
            {
                "name": "Compatible Devices",
                "value": "Gaming Console, Personal Computer, Tablet, Smart Television, Smartphone"
            },
            {
                "name": "Frequency",
                "value": "5 GHz"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Home, Gaming, Business"
            },
            {
                "name": "Included Components",
                "value": "M30 Router, Adapter, Ethernet Cable, Quick Install Guide"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi, Ethernet"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Introducing the D-Link AQUILA PRO AI AX3000 Wi-Fi 6 Mesh Router - M30 AI OPTIMIZED WI-FI FOR GREATER SPEED, COVERAGE, AND CAPACITY Experience the ultimate smart home networking solution with D-Link's AQUILA PRO AI series, built with advanced AI-enabled capabilities for fast and reliable whole home Wi-Fi coverage. The D-Link AQUILA PRO AI AX3000 Wi-Fi 6 Mesh Router (M30) gives you all the benefits of Wi-Fi 6 in a clean and decor-friendly design. Powered by AX3000 Wi-Fi 6, you can expect incredibly fast WiFi 6 speeds, great Wi-Fi coverage, and the power to handle more connected devices. With its unique 5 antenna configuration, the M30 can cover up to 2,800 sq. ft. out of the box. But if you need more, it’s ready to expand with advanced Mesh functionality. Just add more AQUILA PRO AI Mesh Routers (M30) or Extenders (E30) to expand into a Whole Home Mesh System. Perfect for: Replacing your slow wireless routerAdding Wi-Fi 6 to your inflexible ISP routerGetting greater coverage in and around your home",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3f4c98a-886e-45c4-bff5-5dde0304793f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "High Performance Network Future-proof Wi-Fi 6 Performance. - The Wi-Fi 6 Difference Wi-Fi 6 brings next-generation Wi-Fi technology into your home, giving you the quantum leap in capacity, speed, and range you need to handle all your Wi-Fi demands. Perfect for high-performance, highly device-dense smart homes. Your home network gains more WiFi streams to handle high-demand applications, like 8K TVs, online gaming, PCVR gaming, video calls, and more on the growing number of devices in our home. Wi-Fi 6 improvements come from the efficient use of Wi-Fi features. 4X4 MU-MIMO allows your home network to talk to and support more devices simultaneouslyOFDMA increases throughput and provides smooth WiFi to more devicesBSS coloring reduces interference from neighborsMore Wi-Fi streams for shorter response times and less latencyBeam-Forming manages antenna power and selection to steer focus Wi-Fi signalsIncreases battery life of devices with Target Wake Time100% backward compatible with Wi-Fi 5 (11b/11a/11n/11ac)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/be0f761a-309f-4fac-bdc2-1ac3a7da821f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Feature Rich with Advanced Management and Performance Features Working behind the scenes to keep your Wi-Fi optimized AI Optimized Wi-Fi for more reliable performance Experience hassle-free network management with the AQUILA PRO AI App. Let the AI Assistant effortlessly monitor your network's performance and recommend optimizations. AI Wi-Fi Optimizer - A dedicated antenna scans your environment to keep you on the cleanest channel. AI Mesh Optimizer - Mesh nodes collaborate with each other to optimize network traffic. AI Traffic Optimizer - Keeps your activities uninterrupted, whether you're gaming, voice calling, video streaming, or downloading. Easy App Setup and Management with the AQUILA PR AI App Use the AQUILA PRO AI mobile app to ease your configuration with a few clicks. Scan the QR code and follow the straight forward steps to effortless installation. Parental Controls, Guest Wi-Fi Network and Enhanced Security Ensure your children‘s Internet usage is on your terms with Advanced Parental Controls. Easily set profiles and restrict website access and schedule when your kids can access the Internet. Easily set up a guest Wi-Fi network to share with friends and family.Help keep your home network more secure around the clock with ETSI EN 303 645 cybersecurity certification and the latest WPA3 encryption, designed to provide robust protection for all your connected devices. Extreme Coverage Employing an advanced antenna configuration optimized to produce a more balanced 360° spherical Wi-Fi coverage range and equipped with 5 powerful antennas including one extra 5 GHz antenna for extended range on the faster 5 GHz band, the M30 ensures greater overall coverage and faster performance, making it perfect for high-bandwidth applications like 8K streaming and LAG-free gaming.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8695cee1-cb95-4093-a61f-e09c0da97c9c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Grow-as-you-need Mesh - Get the Perfect Whole Home Mesh System for your Needs One Seamless Mesh Network Need more coverage? Grow as you need mesh is easier than you think. AQUILA PRO AI units work together to create a whole home mesh network with one single network name connecting you to the strongest signal as you walk through your home, eliminating the need to disconnect and reconnect to different Wi-Fi networks as you move around. Customize your placement to get the best performance for your environment using the built-in Wi-Fi signal strength indicators.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/453216af-8b48-4ed8-a39c-81d1d3badaf0.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3f4c98a-886e-45c4-bff5-5dde0304793f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/be0f761a-309f-4fac-bdc2-1ac3a7da821f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8695cee1-cb95-4093-a61f-e09c0da97c9c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/453216af-8b48-4ed8-a39c-81d1d3badaf0.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Weaze the WizeWeaze the Wize",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEX3FHXURGRIDG5RINUPJLE4KNMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D9L1NTH446Q3?ASIN=B00PTQNOC6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2020",
                "reviewTitle": "5.0 out of 5 stars D-Link dazzles with the DIR-X5460!",
                "reviewText": "I was already apart of the D-Link family as I was using the DIR-882 but when I saw the DIR-X5460 on sale for Prime day, I had to take the leap despite the upcoming release of WiFi-6E routers in the near future. This is a significant leap from my old router as it has way more horsepower top to bottom with the new Wi-Fi 6 capability. The only two Wi-Fi 6 ready devices I had available to test were my OnePlus 8 phone and a desktop Wi-Fi card I also caught on sale. It boosted my transmit speed on my phone from 866mbps to 1200 mbps! I have a ton of smart home devices and they all connected very quickly. Setup was a breeze and it even automatically updated the firmware to the latest version. I feel very little drop off switching from my desktop from a wired connection to the wireless connection . It even has cloud support to the router to accept voice commands however, I find the functionality for it to be rather buggy and cumbersome. It would be far easier to login to the router and make the needed changes on their simple to use GUI instead of using the voice features which are pretty limited to toggling the guest network status and rebooting the router. I feel I'll be able to get plenty of use out of this router as it will be awhile before Wi-Fi 6e adoption rate is high enough to want to change up from this high performing router. Do not hesitate to buy if you are in the market for another wireless router as you'll be hard pressed to find one with this much power at a reasonable price point.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41JjiN847JL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41q73lMfFqL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51C9o6bmbfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51HQXII1UCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71UAiCd76ZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71bNQi1dMtL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "RN",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUYO7GSTJVAVIKKLCJULVS3NFVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8MPRDHYWQQXK?ASIN=B00PTQNOC6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 19, 2022",
                "reviewTitle": "5.0 out of 5 stars Nice router",
                "reviewText": "For almost 8 years, I had been using the same reliable D-Link DIR-880L router. However, when I upgraded my cable modem, the DIR-880L did not allow me to get the full speed provided by my ISP. Hence, I upgraded to the D-Link WiFi 6 Router AX5400. After receiving the new router, I downloaded the D-Link WiFi app onto my phone and scanned in the provided QR code. Everything seemed to go okay, but I did not get any internet connection after multiple attempts. Even when connecting my laptop through ethernet cable, I could not manually set up things in the configuration webpage. I called my ISP to reset the cable modem, but I still could not get internet connection between the cable modem and router. So, I hypothesized that the D-Link provided low profile (thin) ethernet cable might be faulty. I switched to a standard ethernet cable, and, that solved the whole connection issue! This is the fourth time that I have seen faulty ethernet (even brand new) cables from different suppliers through the years. So, if you have internet connection issues during setup, please try another ethernet cable! Anyway, the D-Link phone app is useful to configure separate 2.4 GHz and 5 GHz options; it seems easier to work with this app than the web-based configuration page. Now I get greatly improved speeds though out the house.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BigOldBear",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZGCTDZT2DMLXWNFJZRLN6DM4RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QYD7PT4FE0L5?ASIN=B00PTQNOC6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2021",
                "reviewTitle": "4.0 out of 5 stars GREAT Router - lousy tech support",
                "reviewText": "I found the router to be excellent, but the company falls short on Tech support.While \"working\" with tech support on a nice included option, I found THREE, (3), MAJOR PROBLEMS with their \"so called\" tech support. The router, \"itself\", works great, but getting the included option working, was a FARCE, and it still is not working. Problem (1): While trying to work with the tect, it took \"forever\" for her to get back to me after short comments. It was evident she was \"supporting\" multiple clients at a time. Was on for over 1-hour, but talked, in-fact, less that 15-minutes. ->-> Problem NOT solved..!!Problem (2): The Tech support agent had ABSOLUTELY no knowledge of the option, or how to get it working.. ->-> Problem STILL NOT solved.Problem (3): Contacting tech support again, on-line, and informing them of my problems with tech support, and TOTALLY explaining my woes, and requesting a call ONLY got me ->->-> Please call tech support. Technical support on an option, I specifically wanted, (number 2 reason for buying) SUCKS. WISH they would contact me directly, their \"on-line\" support did NOT help.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ReviewsReviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDH3T6SNGLLUZQC5UFEBOZINAZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AJX8689KWQS3?ASIN=B00PTQNOC6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Router",
                "reviewText": "I'm gamer, I usually use ethernet wire ran through the hallway to game on pc. I replaced my ethernet wire with this router. I then bought a wifi 6 Network adapter from ASUS and it paired with it the router and its like I'm gaming on ethernet. Its no joke this is gaming grade wifi and I get 29-30 ping in online first person shooters which is basically what I was getting on ethernet. You may be able to achieve 0ping results with this router but my internet is not that good so you will have to try it yourself. ALSO - I am able to game and stream simultaneously with this router with no issues or decrease in my game's ping and I see no lag in the output stream. (For those who stream)",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}