{
    "remaining_requests": 27348,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/eero-mesh-WiFi-router-extender/dp/B07WMMD6DD",
    "body": {
        "name": "Certified Refurbished Amazon eero mesh WiFi router",
        "price": "$55.99$55.99",
        "originalPrice": "",
        "rawPrice": 55.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Eero-6-Router/dp/B085VM9ZDD",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BHTSSS8M"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41FceoNHnDL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/214-vH4V12L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/414USQMV78L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EJqglAvgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41txe3FhrNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XvjiHPRzL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the eero Store",
            "link": "https://www.amazon.com/stores/eero/page/FC890135-A1A9-499D-91A1-860E8614C254?ref_=ast_bln"
        },
        "brand": "eero",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1692,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Friday, February 16. Order within 7 hrs 47 mins",
            "FREE pickup Monday, February 19",
            "Or fastest pickup Friday, February 16. Order within 7 hrs 47 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "A Certified Refurbished Amazon eero mesh WiFi router is refurbished, tested, and certified to look and work like new and comes with the same limited warranty as a new device.",
            "Fast standalone router - The eero mesh WiFi router brings up to 1,500 sq. ft. of fast, reliable WiFi to your home.",
            "Works with Alexa - With eero and an Alexa device (not included) you can easily manage WiFi access for devices and individuals in the home, taking focus away from screens and back to what’s important.",
            "Easily expand your system - With cross-compatible hardware, you can add eero products as your needs change.",
            "Works with your internet service provider - Eero connects to your modem to bring your existing internet connection to every corner of your home.",
            "Set up in minutes - The eero app walks you through setup in less than 10 minutes and allows you to manage your network from anywhere.",
            "Don’t let WiFi slow you down - Get the most from your WiFi by streaming, gaming, and working from anywhere in your home.",
            "Gets better over time - Automatic updates keep your network safe and secure.",
            "TrueMesh technology - Eero intelligently routes traffic to avoid congestion, buffering, and dropoffs."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": "",
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Spiker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTAMNEKMVJFHHYMHT2PWZULZJGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EWV23XIHE413?ASIN=B07WMMD6DD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Can't Tell It's a ReFurb",
                "reviewText": "I bought this during one of Amazon's sales because my FireStick was not recognizing the wireless network that it had for the past three, or more, years. It came in a refurbished plain box but I can't tell that anyone ever used it. I'm pretty sure someone bought this not knowing what it was or how to use it. I'm feeding it from a wired TP-Link Deco X-20 mesh in my bedroom and it works great!!! It was cheaper, and less hassle, than getting a new FireStick.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX3VF5EK33UNWTYS43YY2KZL3JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18TCKLII89L3A?ASIN=B07WMMD6DD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Ultra fast; quick install",
                "reviewText": "It took me no more than 15 min. to download the Eero app on my iPhone and fully install the router. When I opened the Amazon box and did not see an inner box, I became concerned and questioned what I was getting into buying a \"refurbished\" unit. Cosmetically, the router is indistinguishable from a new one. Operationally, perfect! Hoping to get many years of enjoyment from this beautiful device.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DAV",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRR5IWKDR7VS3KACZGZKMHDYCKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RMAAHJKRPX8O?ASIN=B07WMMD6DD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Great WiFi",
                "reviewText": "Our WiFidid not work well in our townhouse. Eero came highly recommended and we love it. I originally purchased the 3 piece system but decided I needed one more module. The reconditioned module came like new and worked perfectly. The overall system works great and our WiFi is seamless.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ToniMiller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGBMS6T5DZME755ZEVXKYZ6F3KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12IJB9V7ZOTIB?ASIN=B07WMMD6DD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "4.0 out of 5 stars Slow",
                "reviewText": "My Wi-Fi seems to be slower than usual and there’s a lot of dead space and I lose Wi-Fi a lot. I really not. I haven’t decided if I like it or not OK",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MovieFan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6SG5VA3WWQLIHY6MHS7ILG3KFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ORNLLWKAJB83?ASIN=B07WMMD6DD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars A great mest WIFI router",
                "reviewText": "About a year ago I purchased a eero mesh wifi router system consisting of three (3) parts. One failed after a few months, so I ordered another replacement and opted for the refurbished. Amazon was GREAT and refunded a portion of my money on the failed router and applied it to the refurbished router, making it essentially free with a small refund to my account. Not only that, but this refurbished router has worked perfectly with no problems whatsoever. Highly recommended.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "leonardo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELFBES3MOGKZBU5P2JH74DJFSXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSPK4A9N6RGTG?ASIN=B07WMMD6DD",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "1.0 out of 5 stars Useless not flexible set up.",
                "reviewText": "This thing is useless, i got it to use it as a wireless router. After around an hour and several attempts i couldn’t because it needed to connect to internet wired or something, never made it work, the app got stuck and there was no way to manually set it up. Literally made me loss so much time and made my job way harder since i had to work without wifi because this piece of crap needed internet connection to work… it sucks and i don’t know why are there so many people giving so nice reviews and saying “it took 10 minutes so set up” maybe it was just meant for them and for their perfect environment… also it has to be liked to an account to work… it is just so bad and useless…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Modan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJD4JEYRTLO3AQDS4M7FDF7LFUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYEI5LTG53GR3?ASIN=B07WMMD6DD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars They work great for me and I got them at a fantastic price",
                "reviewText": "I bought these for less than $100 on sale including a smart plug. They set up easily and have been working as well as possible. I have an extremely slow Internet Provider so I can't comment on their full possibilities. I bought them in anticipation of a new fiber system in my rural area but it isn't available yet.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A_diva",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFO77ASFI5QTDGHC54EGKMSG2IFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JHIDO56EX2DD?ASIN=B07WMMD6DD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Best Decision EVER",
                "reviewText": "This review is probably premature, I literally just connected the devices and I’m extremely impressed!I do not like buying used goods but this is my second refurbished purchase through Amazon that seems to be perfect!The device set up is so simple. You literally download the app, plug it in just follow the app. All I remember doing is clicking “next” and the app found my eero devices.I had just purchased another mesh Wi-Fi router (Tenda Nova) and had just re-routed all my cameras to those devices and a few home devices, but the second node in the Tenda Nova kept dropping. The good thing is the way my house is set up, one Tenda Noca box could handle everything but I really wanted to maximize coverage in my house so I was set on two nodes and decided to try the eero system. I was re-routing my cameras and other devices but I didn’t even have to the eero system picked them up and added them! Thank goodness! Note: I used same name and Wi-Fi password as before. Saved me some headache because my outdoor camera reset button is in an awkward place : / .One thing I notice however is all my devices are picking up on one of the eero’s instead of the nearest devices going to the closest eero. This is the same observation I noticed on the Tenda Nova system. I’m thinking that the layout of my house doesn’t really need two nodes. I’ve always only had one modem-router combo in my house provided by my ISP provider and the box covered my 3,000 sq foot home. I think this is because my house layout. The rooms all kind of border my main living and game room so when my box is in the center if he game room or family room I pretty much get internet in all the surrounding rooms. With this in mind I’m not sure if I’ll keep both unless I figure out a layout that pushes more coverage in my front and back yard.Great product not sure why I’m so late to this other than my ISP modem worked really well and I kept getting promotions to waive the rental fee , but after years of promotions my ISP is putting their foot down and I refuse to pay the rental fee. In any case no regrets!I paired this with a refurbished Arris router also sold by Amazon. I’m getting slightly higher download Mbps than I pay for!Happy customer! :)))))",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}