{
    "remaining_requests": 27162,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ZTE-Velocity-Mobile-Hotspot-Unlocked/dp/B0747PF6P6",
    "body": {
        "name": "ZTE Velocity | Mobile Wifi Hotspot 4G LTE Router MF923 | Up to 150Mbps Download Speed | WiFi Connect Up to 10 Devices | Create A WLAN Anywhere | GSM Unlocked - Black",
        "price": "$64.99",
        "originalPrice": "",
        "rawPrice": 64.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ZTE-Velocity-Mobile-Hotspot-Unlocked/dp/B0747PF6P6",
        "soldBy": {
            "sellerID": "A1Y4W53B6KY4HP",
            "name": "PrimePhaze",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1Y4W53B6KY4HP"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41UovvqqyAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21jckQwp8dL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41UeAdGLPeL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the ZTE Store",
            "link": "https://www.amazon.com/stores/ZTE/page/2E671287-F09D-4224-80DE-703EB13B7B62?ref_=ast_bln"
        },
        "brand": "ZTE",
        "merchantInfo": "PrimePhaze",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 473,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 22 - 28.",
            "Or fastest delivery Tomorrow, February 15. Order within 1 hr 31 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "DOES THIS DEVICE NEED A SIM CARD: Yes it does Being that this device is GSM unlocked it will work on any GSM Network with a Micro size SIM Card The sim card does not come included, Contact your Network Provider to acquire your complimentary Sim card (Free from most Carriers with activating of an account)",
            "WHAT NETWORK FREQUENCIES ARE SUPPORTED AND CAN BE RECEIVED BY THIS DEVICE: LTE bands 2/4/5/17/29 and UMTS HSPA 850/1900/2100. As well this device can provide WIFI: Dual-Band WiFi (2.4GHz or 5GHz) This variation of bands give it the ability to roam on LTE in many foreign countries, including all of Europe and much of Asia",
            "HOW LONG CAN I EXPECT THE BATTERY TO LAST ME: Well the battery has 2,800mAh which in a Usage time frame means 10 solid hours of streaming at 4G LTE speeds as well it has a Standby time of up to 240 hours before you need to recharge the battery. WHAT CAN I EXPECT OUT OF THE BOX: Well this device has a Single-Core Qualcomm MDM9225 Processor giving it the ability to Connect up to 10 devices simultaneously with Separate Guest WiFi to ensure security as well it will come with a charger and a manual",
            "WHAT DOES UNLOCKED REALLY MEAN: Unlocked devices are compatible with GSM carriers the kinds that Use SIM Cards for Service like AT&T and T-Mobile as well as with GSM SIM cards (e.g. H20, Straight Talk, and select prepaid carriers) Unlocked Devices will not work with CDMA Carriers the kinds that don't use sim cards for service like Sprint, Verizon, Boost or Virgin (contact your network provider prior to purchasing for verification that they support GSM frequencies)",
            "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! WILL NOT WORK ON VERIZON OR SPRINT !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
        ],
        "description": "This AT&T Velocity Wi-Fi hotspot allows you to simultaneously connect up to 10 devices to the Internet at 4G LTE speeds. The intuitive touch screen makes navigation and changing settings simple. Rechargeable lithium-ion battery",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Routers",
                "link": "https://www.amazon.com/Routers-Networking-Online-Communication-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=300189"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "0.67 x 2.48 x 4.49 inches"
            },
            {
                "name": "Item Weight",
                "value": "4 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0747PF6P6"
            },
            {
                "name": "Item model number",
                "value": "MF923-B"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 473 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#32,951 in Computers & Accessories (See Top 100 in Computers & Accessories) #1,172 in Computer Routers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "OS",
                "value": "RouterOS"
            },
            {
                "name": "Frequency",
                "value": "5 GHz"
            },
            {
                "name": "Wireless communication technologies",
                "value": "4G, Wi-Fi"
            },
            {
                "name": "Connectivity technologies",
                "value": "Wi Fi"
            },
            {
                "name": "Special features",
                "value": "WPS"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Whats in the box",
                "value": "Adapter, USB Data Cable"
            },
            {
                "name": "Manufacturer",
                "value": "ZTE"
            },
            {
                "name": "Date First Available",
                "value": "July 23, 2017"
            },
            {
                "name": "Brand",
                "value": "ZTE"
            },
            {
                "name": "Special Feature",
                "value": "WPS"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "5 GHz Radio Frequency, 2.4 GHz Radio Frequency"
            },
            {
                "name": "Compatible Devices",
                "value": "Unlocked for GSM Networks only"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Business"
            },
            {
                "name": "Included Components",
                "value": "Adapter, USB Data Cable"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi Fi"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dave",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFA5CKA6NV5DZBCEC4PUSZFPLUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9PVUET54DQNL?ASIN=B0747PF6P6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2018",
                "reviewTitle": "5.0 out of 5 stars Works great for my purpose",
                "reviewText": "I purchased this device for the purpose of transferring the SIM from a broken AT&T Mobley device I had been using with a USB adapter in my RV. I have been very happy with the way this switch has worked out. The Velocity works seamlessly with the Mobley SIM and also seems to pick up signals better than the Mobley did. It is also more portable than my prior arrangement which required a USB cord or AC adapter cord at all times. One feature I really like is that you can adjust the transmission range of the Velocity from far to near so that it doesn't use a lot of battery power transmitting a signal to places you won't be using it. For example, when it is charged up and set to far the battery runs down pretty quickly because it is broadcasting to an entire campground instead of just inside my RV. When set to near the battery lasts much longer because the signal is only being broadcast right around where the Velocity is located. Why should I run my battery down broadcasting to an entire campground when I am using the Wi-Fi inside my 100 sq ft camper van? Great feature. It also charges up pretty quickly.",
                "reviewVotes": "53 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J_Sysak",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFNPRNJUDKEICXFWVCFZIPSQTDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GRTDHFKCGQ68?ASIN=B0747PF6P6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2019",
                "reviewTitle": "5.0 out of 5 stars Good Bang for the Buck",
                "reviewText": "This review is for the ZTE Velocity Mobile Hotspot; which I bought from the seller Energy Electronics. The hotspot was received new, in shrink-wrap with all of its pieces (battery, battery cover, charger). The battery came charged to 77%. I inserted an AT&T prepaid sim card purchased at Best Buy (I went online and bought my data-only plan when I purchased the hotspot.), and was up and running in less than 10 minutes. I topped-up the charge and went on to use the hotspot for several hours to stream video with my Amazon Fire Stick with no issues. Build quality of this item seems good and performance is wonderful. You can even choose whether to use a 2.4GHz or 5GHz connection for the hotspot and how far it will broadcast its signal.Honestly, I don't understand the negative reviews on this one. I would definitely buy this item again.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ruthie Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEQVU4BP4UZ4DNEIDNM7EK6YEYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GYVRZR2QNMMV?ASIN=B0747PF6P6",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "1.0 out of 5 stars Defective item",
                "reviewText": "I will NEVER order from you again ,the item DO NOT WORK …….",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dre!cali",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFS6O6BE5FOGQUMJERUYX5X5OCXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AS79HDE4JVU4?ASIN=B0747PF6P6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 11, 2018",
                "reviewTitle": "5.0 out of 5 stars Simple and easy to use and setup",
                "reviewText": "I bought this product for use with pay-as-you-go AT&T service. I took the device to the nearest AT&T store, they put a SIM in it and for $25 (3GB of data) I was out the door. I bought this as a test to use at work (we have crappy coverage from pretty much everyone) and I didn't want to devote a lot of money or a contract because I wasn't sure how well it would work (AT&T cell phones don't receive enough signal to be usable). So placed this thing on the windowsill and I was able to get 10mb down and 500k up so enough to do most of what I needed to do. I like how it wasn't too expensive and gives me another alternative to get out on the internet when I really need to.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBKQ4F6SFS2H32C7ICFBHVNHVNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ID23ER1ELVNT?ASIN=B0747PF6P6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 22, 2020",
                "reviewTitle": "4.0 out of 5 stars APN configurable from internal web server",
                "reviewText": "I purchased a bunch of these to use with Mobal SIMs as low cost SMS pagers from outside US. With the price in mind and for that rather simple purpose the units work just fine. However the time keeping function is rather bad since the time zone seems fixed and I can't find any place to set the clock manually. Seems somewhat half-baked.The other day I decided to try out the mobile router function and I couldn't find any place to configure the APN using the on-screen menus. I unsuccessfully tried a couple of data-only SIM cards that work with Android and I couldn't get it to work - most likely due to missing/incorrect APN configuration. Not exactly plug and play.After playing around a bit I logged on to the wifi provided by the router and by chance directed my browser to 192.168.1.1 where after inputting the default password the page allows you to configure things in more detail. I eventually found a place to configure the APN and now the unit serves as a little gateway on a remote location.Next step I'd like to try to use USB for tethering and use the unit without wifi as a modem. Not sure if that will work.As conclusion, if you've got time on your hands and have experience configuring network equipment and computers then you might be able to use these mobile routers with SIM cards from other vendors than AT&T.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LoneWolfe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGRMHINMJWMTR6MDVZJPQOHR3LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ4JL2KXG01A5?ASIN=B0747PF6P6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2019",
                "reviewTitle": "5.0 out of 5 stars It's Working Fine",
                "reviewText": "I bought this to see if it could replace my satellite system. When I installed the battery and sim it started right up and made the connection. It is so much faster than my satellite system(and so much cheaper). The cell tower is 12 miles away as the crow flies, so I wasn't sure if this would pull in a strong enough signal to be useful. It gets 3 bars and occasionally 4 bars which is great since this doesn't have a port for an external antenna. At 3 bars I get 56 Mbps down and 14 Mbps up. The wifi works well with plenty of range for my needs. And add to this the flexibility it provides when I travel, it's a been a great purchase....so far.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RockmanRockman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUSXMSK2J3JV3KYTMMIPM2GWVDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O7H1L4XJ6LZE?ASIN=B0747PF6P6",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2022",
                "reviewTitle": "3.0 out of 5 stars It Works",
                "reviewText": "I knew what I was getting it for. I'd an upcoming international trip and wanted to make sure I've mobile internet connectivity to be able work from anywhere. This comes with user manual that's not very helpful. It didn't work right out of the box, I as well contacted AT&T that's of no use. Finally after digging for hours, I managed to make this work, that's great, but it has one design flaw that doesn't hold the SIM all the time in and keep throwing that out for some reason. I told this to Amazon and asked for return but they didn't help with that. I did mention that I'm currently out of the States. They said they will send me return instructions to return this when I'm back but no such instructions ever received. This is the first time I have seen Amazon not being helpful. Quite sad to see.Overall this serves the purpose, you can connect 8 devices over 5G/ 2.4G Wifi, and 2 devices over guest WiFi, so in total 10 devices can connect simultaneously. You can run this over one bandwidth at a time so you will either have 5G or 2.4G running at a time. This is bit obsolete as it only supports 4G mobile sim, no 5G sim support. This has a decent battery that lasted me approx 12 hours, standby is great.This is not at all value for money, cause the same model in different color was just half the price, but as I needed this on time before my trip and this model was shipping & delivering before my trip hence had to pay double the price.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61+6+vYmlVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61MAnvk2AmL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71b4d14hopL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "rob",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 17, 2023",
                "reviewTitle": "Not sure if it really works on not",
                "reviewText": "Difficult set up for Canada, and i still haven't been able to get it working (Bell).Frustrated and I would not recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}