{
    "remaining_requests": 27333,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Eero-6-Router/dp/B085VM9ZDD",
    "body": {
        "name": "Amazon eero high-speed wifi 6 router and booster | Supports speeds up to 900 Mbps | Works with Alexa, built-in Zigbee smart home hub | Coverage up to 1,500 sq. ft. | Advanced security",
        "price": "$89.99",
        "originalPrice": "",
        "rawPrice": 89.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Eero-6-Router/dp/B085VM9ZDD",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08GB83F7C"
        ],
        "asinVariationValues": [
            {
                "asin": "B085VM9ZDD",
                "variationName": "Configuration",
                "variationValue": "1-Pack",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Configuration",
                "variationValue": "2-Pack",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Configuration",
                "variationValue": "3-Pack",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B085VM9ZDD",
                "variationName": "Style",
                "variationValue": "Router",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "Router + Extender",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41M1qwmnvLL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21ZxD7z0LqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41O692q7v6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JTQ5Zc-6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51B7swUdynL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LY KGmvOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UHyzD3qYL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4f3e6916-186b-40a4-9777-d90f0a9f8e5f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cb7a3fbe-d33e-443c-9dba-b01cdb6dadf3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5dc1d218-5c20-4e9d-9183-17759aebd369/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4e91840c-bced-460f-9be3-6ffb4c794123/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cc887be1-9f53-4a0f-84a5-93692a92273a/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a4a5b9f1-96a4-4897-bdda-9d7bf9e1733c/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the eero Store",
            "link": "https://www.amazon.com/stores/eero/page/FC890135-A1A9-499D-91A1-860E8614C254?ref_=ast_bln"
        },
        "brand": "eero",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 18398,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Friday, February 16. Order within 13 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "WHOLE-HOME WI-FI 6 COVERAGE - eero covers up to 1,500 sq. ft. with wifi and supports wifi speeds up to 900 Mbps.",
            "SAY GOODBYE TO DEAD SPOTS AND BUFFERING - Our TrueMesh technology intelligently routes traffic to reduce drop-offs so you can confidently stream 4K video, game, and video conference.",
            "MORE WIFI FOR MORE DEVICES - Wi-Fi 6 supports faster wifi than prior standards and permits 75+ connected devices.",
            "SET UP IN MINUTES - The eero app walk you through setup and allows you to manage your network from anywhere. Plus, free customer support is available 7 days a week.",
            "BUILT-IN ZIGBEE SMART HOME HUB - eero 6 connects compatible devices on your network with Alexa—so there’s no need to buy separate smart home hubs for each device.",
            "GETS BETTER OVER TIME - Automatic updates bring the latest and greatest in eero wifi while also helping to keep your network safe and secure.",
            "EASILY EXPAND YOUR SYSTEM - With cross-compatible hardware, you can easily add eero products as your needs change."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": "",
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mystery Lover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVYG3GIABXMCBBNASK2ZU4Q4HVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNJHAABZJKYRF?ASIN=B085VM9ZDD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy to use",
                "reviewText": "We live in an old home that has plaster and sheetrock for walls. The wi-fi signal does not do well on the 2nd floor or in the master bedroom which is a bit distant from the router. To have a technician come out and run wires upstairs and into the master would have cost us several hundred dollars. Using a mesh wi-fi system made more sense.The Eero brand had good ratings from several different sources and it was on sale during Amazon Prime Day so I thought I'd give it a try. The instructions for set up are online so my son came over to help and it took us about 30 minutes to get the system up and running.The Eero mesh system is doing a great job! No dropped signals, excellent coverage, great speed! I highly recommend it!",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael J. Descy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6S4W56HHLCW2K6344KZOVWH6EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CUH3FAR45F4J?ASIN=B085VM9ZDD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2020",
                "reviewTitle": "5.0 out of 5 stars Coverage over speed",
                "reviewText": "I have an approximately 2,000 square foot house. My main router has to be on one end of the house on the top floor. Before the Eero, this always meant I had to live with some dead zones within my living area, mainly at the opposite end of my house and on the deck behind our house. The Eero’s wireless mesh network is able to deliver WiFi to a much larger area of my house than a single router could, and did not require me to drill holes in my wall to hard-wire something. It does so at the expense of network speed for the devices that connect to the satellite Eeros, rather than to the main one. That seems like a fair trade-off to me, however, because network speeds are fast enough for me, and because most of the areas where speed is lower are the areas that I either had spotty WiFi connections, or no WiFi connections, before I had a mesh wireless system.#### Comparison with my old routerMy old router was a tri-band 802.11ac router that cost about as much as the Eero 6 3-pack. In many respects, it was an excellent router. It was fast and offered very good coverage throughout the house, but its reach did not cover my entire living area. (Note: The Eero 6 is a WiFi 6-capable device, but I am currently running all devices on 802.11ac or older WiFi specifications. I expect to get WiFi 6-enabled devices next year, and I know my network will be ready for them.)The regular (non-“Pro”) Eero 6 system is designed for homes with internet speeds of up to 500Mbps. I currently have a 400Mbps connection. Before and after upgrading my router, I ran a bunch of speed tests throughout my house. With my old router, I maxed out my internet connection in about half the house, but had much lower speed further out, and the connection dropped to nothing or almost nothing at the side of the house opposite my router, and outside on my deck. With the Eero, speed tests are up to 400Mbps for devices connected to the main Eero unit, and up to 200Mbps (and down to 40Mbps) for devices that connect to one of the two satellite units. The coverage area is much larger, however.The Eero is just as fast as my old router in the same room that the main Eero base unit is in. In other rooms of the house, where the Eero is obstructed by multiple walls, or is wirelessly hopping from on Eero to another, my average speeds are half that (200 Mbit) or one tenth that (40 Mbit). The thing is, even when the speed is compromised (due, I suppose, to the connection hopping between the Eero devices) the WiFi is still fast enough for what I use it for: video and audio streaming and the web. I can actually use my iPhone and my computer in the backyard, with Internet speeds that are fast enough for streaming video and music, so, in a sense, that is a 100% improvement over what I had before.In my household, we have at least twenty wireless devices connected to the Eero at any time, in addition to five hardwired computers, including a home media server/NAS. We stream video, audio, and do video conferencing much of the day. There are a lot of packets going through my network, and the Eero has routed and transmitted them without a hitch.#### The hardwareAll three Eero units are identical in appearance, though only the base unit has Ethernet jacks. They are much smaller than any home router I have had before, and look completely unobtrusive. They are designed with a slanted and sloped top, to discourage you from putting anything on top of them. They cannot be wall mounted without some kind of bracket, which is not included. I found the design to be a little more limiting than I had expected, because I had to found tabletops to place each unit on; I couldn’t place them in hallway outlets like the Eero Beacon.The “main” Eero unit is a router, but, unlike most home routers, it does not contain a built-in switch. That means that you can connect one, and only one, device to it via Ethernet. If you connect several devices to your current router via Ethernet, you have two options with Eero: either (1) run the Eero in bridge mode, using your old router to route packets, or (2) buy a relatively inexpensive unmanaged switch to sit beside the Eero base unit, and connect your hardwired devices to that. I chose the second approach because I already had a switch.In the past, many of my WiFi routers have “flaked out” after a while, probably because they get too hot for too long. I noticed that the main Eero unit gets warm, but not hot, to the touch, but only toward the bottom, where the circuit board is. I don’t think it gets warm enough to “fry” the electronics eventually; I certainly hope not.#### The iOS AppI knew, from heading ads for Eero on podcasts, that Eero has an smartphone app for administrating and monitoring the network. I did not know that using such an app was the _only_ way to administer the network. I am a home networking nerd, very familiar with the web-based admin tools of numerous brands of home routers, including open source firmwares such as DD-WRT and Tomato—so this actually tripped me up when I was trying to re-create the static IP addresses of my NAS and app server. I assumed I could log into the admin page of the router, find out what IP address those devices ended up at, and then log into them over the network. I have found that wired devices do not always show up in the connected devices list in the iOS app. This can make it hard to find what IP address they are connected to.I use the iOS app, which is attractive and pretty easy to use. You should know that you tap the top section of the “Home” tab of the Eero app to see all your Eero devices and manage them—it isn’t immediately obvious. Setting up the Eero system from the app was simple, and the app lets you monitor your network, and turn off the light on top of each Eero if you want.Unlike almost every router I have ever used, the Eero’s default IP range (at least in my case) is 192.168.4.0/24. The “.4” part surprised me, and required me to update some devices that had fixed IP addresses in the 192.168.1.0/24 range.#### Eero SecureThe Eero comes with a free, 30-day trial for Eero Secure. It is an optional service that may be useful to you. I don’t plan to subscribe because I already have a similar service that I am happy with. I could see it being useful, however, especially due to the tight integration with the Eero app and Eero hardware.",
                "reviewVotes": "201 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GwenGwen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVOQ7OWC34VW6UJ5Q5ZKKYVOLTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UVFPRVHGTU3W?ASIN=B085VM9ZDD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars This works great and was super simple to setup.",
                "reviewText": "I am in a 3800 square foot house with an upstairs and a downstairs.The Windstream Gateway was installed years ago in one corner of my house downstairs. I had good coverage (110 Mbps down, 45 up) when I was close to the gateway. When in the opposite side of the house upstairs there was essentially no WiFi coverage. I used a WiFi extender up there with all its' drawbacks.A friend convinced me to get the eero mesh network and I did. I have 110 Mbps down all over the house now.I have an outbuilding 75 yards away and ran an ethernet cable up to it, installed another eero router (not node) and I have 110 Mbps up there too.The initial setup at the main house was simple, menu driven with the free eero app and I did it with no help needed.When I did the out building I called Tech Support and immediately got a HUMAN to walk me through that setup which took less than 10 minutes.I cannot say enough good about this product and would give it 10 stars if I could.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61rCX7OvWEL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "JoHaJoHa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCZ6QGWW5P5REJLKYFU2TM5MC2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MCCXYAJ5F8WL?ASIN=B085VM9ZDD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "4.0 out of 5 stars Excellent Mesh Product, lacks features",
                "reviewText": "This is a pretty good product and will meet (but not exceed) my mesh Wifi needs. The setup was very easy. I have gigabit fiber download and this particular model maxes out at 500 Mbps over wifi which is acceptable for any need we have in our house. There is a gigabit port that you can patch into another switch for wired near-gigabit speeds (depending on your switch). Advance firewall functionality is a subscription service, I'm sure this is the way things are going (market collusion) but this is the first wifi-router of any type I have owned that does not include the firewall and advance features by default. My other complaint/concern is that there is no way to manage the strength of signal or select a default or favored connection device. What would make sense is for any device in range of the base unit that can get 300+ Mbps connections to attach to the base unit instead of one of the beacons (APs), that seem to max out at about 250 Mbps (despite their proximity to the base unit). Overall this 3 device unit will meet your needs if you need a simple mesh network and don't need advance wifi functionality.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/11gkNv6rvbL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}