{
    "remaining_requests": 27181,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TP-Link-Extender-Extenders-Internet-Supports/dp/B08DHLCLCY",
    "body": {
        "name": "TP-Link N300 WiFi Extender(RE105), WiFi Extenders Signal Booster for Home, Single Band WiFi Range Extender, Internet Booster, Supports Access Point, Wall Plug Design, 2.4Ghz only",
        "price": "$17.99",
        "originalPrice": "$19.99",
        "rawPrice": 17.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TP-Link-Extender-Extenders-Internet-Supports/dp/B08DHLCLCY",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CPWKYT19"
        ],
        "asinVariationValues": [
            {
                "asin": "B0971BBYSN",
                "variationName": "Style",
                "variationValue": "AC1200, Internal Antenna",
                "price": "$26.59",
                "variationImageURL": ""
            },
            {
                "asin": "B093WZ15FR",
                "variationName": "Style",
                "variationValue": "AC750, External Antenna",
                "price": "$25.99",
                "variationImageURL": ""
            },
            {
                "asin": "B08DHLCLCY",
                "variationName": "Style",
                "variationValue": "N300,External Antenna",
                "price": "$17.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31dBVRG9vkL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41-PagCrc-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lXfeJNzWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mhtX9vwfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416gzywOqSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JIFL7aV7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81WXdqWRiLL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37c60832-86d2-4db0-84a2-9e12f855bc26/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/087ce28c-54e4-419a-ac49-0622fa48fb42/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6eb1ae0-d4ee-4dcf-a5e4-f3061355f440/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/49bb69b6-63fd-4954-b59f-111a73987381/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/be0e96f8-e1e2-4898-a90e-f69dfb56f76b/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/474876b1-66e4-42c7-8ea9-251ab859e625/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1cg1EUbAcL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91VI4uaZsAL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the TP-Link Store",
            "link": "https://www.amazon.com/stores/TP-Link/page/A8C9009F-3398-4DE2-96E5-DAF7BBD28401?ref_=ast_bln"
        },
        "brand": "TP-Link",
        "merchantInfo": "Sold by The Surplus-Hut and Fulfilled by Amazon.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 26549,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 12 hrs 34 mins",
            "FREE delivery February 25 - 27 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Extend WiFi Coverage - Boost Internet WiFi coverage with 2 external antennas for more reliable Wi-Fi, compatible with any WiFi Router, Gateway, Access Point",
            "More than a WiFi Repeater - RE105 also supports AP mode which creates a new Wi-Fi Access point for home",
            "Fast Ethernet Port - Experience wired speed and reliability anywhere in your home by connecting your favorite device to the fast ethernet port",
            "Better Range with External Antennas - Two external antennas with MIMO technology for improved range versus standard range extenders",
            "Set Up in Minutes - Easily set up and manage your WiFi in a few quick and easy steps using the TP-Link Tether app (Android, iOS). Find the optimal location for the best WiFi connection with an intelligent signal indicator",
            "All WiFi extenders are designed to increase or improve WiFi coverage, not to directly increase speed. In some cases improving signal reliability can affect overall throughput",
            "If you experience any trouble during or after set up, please contact us. TP-Link offers a 2 year warranty and 24/7 technical Support"
        ],
        "description": "Compact. Strong.Despite its compact size, it may be hard to ignore the RE105 due to the truly impressive way that it projects Wi-Fi access into the areas of your home that your standard router simply cannot reach. The RE105 supports wireless speeds of up to 300Mbps and keeps all of your favorite devices running as fast as possible.As Powerful As You ExpectThe two external antennas with MIMO technology help set the RE105 apart from the rest. MIMO technology enhances your network by dramatically increasing wireless speeds and the two external antennas ensure that a stable wireless signal reaches you where you need it most.Effortless Network ExpansionTwo Simple Taps and You are Ready to ConnectJust press the WPS button on your router, then press the Range Extender button on RE105 to begin enjoying simple, expanded Wi-Fi.Connect with ConfidenceThe Intelligent LED indicator provides a simple, color-coded indication, allowing you to find the perfect location.Repeater When Router Fails YouThe RE105 works as a repeater to save you from poor signal by expanding your router’s network coverage to the primary \"dead zones\".Access Point For A New NetworkWhen RE105 works in AP Mode, it turns Ethernet port into your own personal Wi-Fi hotspot to create a new network.Tether is an intuitive app that allows users to conveniently monitor the state of your range extender.Easy MonitoringTether is an intuitive app that allows users to conveniently monitor the state of your range extender.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b?ie=UTF8&node=172504"
            },
            {
                "name": "Repeaters",
                "link": "https://www.amazon.com/Repeaters/b?ie=UTF8&node=3015439011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.15 x 2 x 2.7 inches"
            },
            {
                "name": "Item Weight",
                "value": "4.2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B08DHLCLCY"
            },
            {
                "name": "Item model number",
                "value": "ELCM"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 26,549 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25 in Repeaters"
            },
            {
                "name": "Date First Available",
                "value": "July 22, 2020"
            },
            {
                "name": "Manufacturer",
                "value": "TP-Link"
            },
            {
                "name": "Country of Origin",
                "value": "Vietnam"
            },
            {
                "name": "Brand",
                "value": "TP-Link"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "802.11n, 802.11b, 802.11a, 802.11g"
            },
            {
                "name": "Data Transfer Rate",
                "value": "300 Megabits Per Second"
            },
            {
                "name": "Frequency Band Class",
                "value": "Single-Band"
            },
            {
                "name": "Connector Type",
                "value": "RJ45"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Set Up Made Easy Simply press the WPS button on your router, then press the Range Extender button on you RE105 to begin enjoying extended WiFi. An intelligent LED indicator makes it easier to find the perfect location. Eliminate Dead Zones The RE105 expands your current WiFi coverage using specially designed antennas, perfect for web browsing and watching content online.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2a486f9c-e5d7-44e9-a175-caf41eaddd9a.__CR0,0,650,350_PT0_SX650_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0a8326cf-5a9f-44f7-82b0-cca71ed068d9.__CR0,0,650,350_PT0_SX650_V1___.png"
                ]
            },
            {
                "media_text": "Fast Ethernet Port Experience wired speed and reliability anywhere in your home by connecting your favorite device to the fast ethernet port. Access Point Mode Access Point mode turns your Ethernet port into your own personal WiFi hotspot to create a network by connecting it to an internet source.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/033ad597-3d60-47ca-9fca-643484dfe9c1.__CR0,0,650,350_PT0_SX650_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/91f8cc0f-7e4c-4897-94a3-0239e3e06336.__CR0,0,650,350_PT0_SX650_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/7a2647a3-a2a6-4470-83e3-c9b61440bfee.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9e1efcb6-a783-4a9c-9deb-0efa2d666816.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2a486f9c-e5d7-44e9-a175-caf41eaddd9a.__CR0,0,650,350_PT0_SX650_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0a8326cf-5a9f-44f7-82b0-cca71ed068d9.__CR0,0,650,350_PT0_SX650_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/033ad597-3d60-47ca-9fca-643484dfe9c1.__CR0,0,650,350_PT0_SX650_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/91f8cc0f-7e4c-4897-94a3-0239e3e06336.__CR0,0,650,350_PT0_SX650_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c7c89acf-9c6a-404c-beae-9e6e30c9bbb1.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e9cbf8e2-af3d-4fae-a409-747255f137ed.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sierra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5TITCBX4GE4DTDDMUJVOAOQUGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PFE9FH7QU050?ASIN=B08DHLCLCY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars The Best Buy on the market.",
                "reviewText": "This extender meets all my criteria for an elderly widow whose technological knowledge is self taught. I love TP link products. Their state of the art technology is superb and their pricing is more than competitive. For someone like me, setting up is a breeze and my wifi now is astounding.No more lagging and buffering that tests your patience and puts you to sleep,when streaming. Even my outdoor security camera works like clockwork due to this addition. If you are looking to enhance your wifi you need to look no further with this TP link Extender. I highly recommend it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tech Guy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLCLX4OBBZFN6BUONX5YIN6HEPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RRDOQJO03M2H?ASIN=B08DHLCLCY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Great little extender for IOT devices.",
                "reviewText": "This works great for my needs. Extremely easy setup, and the Tether app works great.Had a garage door opener that mysteriously dropped off my 2.4GHz Wi-Fi after several years of zero problems. Couldn't get it to reconnect to my wireless router despite my many years of network configuration and troubleshooting experience.Took my Wi-Fi analyzer out to the garage and discovered there are a ton of neighboring Wi-Fi networks causing interference on all 11 channels in all directions, so my regular Wi-Fi signal was dropping. Figured I'd need a stronger signal from an extender as I wasn't ready to buy another router just for the garage (too big and more $$$).All I needed was this small extender set inside the house near the garage and the signal to my garage door opener is back to excellent. Zero problems. It has not impacted my network speeds on my regular Wi-Fi SSIDs, as I tested profusely with speed test apps and sites.After the initial set up close to your router, make sure you reposition this extender somewhat close to HALFWAY between your wireless router and the end devices you want to connect. Too far in either direction and it won't give you the desired results. Think of this extender as a relay -- it's only as good as the signal connection it has with BOTH your wireless router and the end devices you want to connect.This is a great extender for medium to lower bandwidth-using IoT and other devices. Sure, it's still using the older N and AC protocols, not AX, but the speeds it produces for me are plenty sufficient for these needs.Works flawlessly with an ASUS AX router. Getting very usable and sometimes even higher speeds through this extender than from the router at the edges of the house. Able to stream video and audio without any problems.There is a recommended firmware update available for this extender, and you can use the Tether app to update the extender very easily.Can't beat the low price on this one either. Very cheap and elegant solution that actually works. Really liked that it automatically added two more SSIDs, adding \"_EXT\" to the end of my existing SSIDs (Wi-Fi network names).",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Billsdad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFEOFDABZTTA44HJBSZCEIQTUWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GB3TKGWRPBB9?ASIN=B08DHLCLCY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars Worked well as a Wi-Fi extender, couldn't make it work as an access point.",
                "reviewText": "This product says it can be used either as an extender or as a wifi access point. It was very straightforward to get it going as an extender, and it worked well. However there weren't really any clear directions on how to get it set up as an access point--it referred you to a website that doesn't have the directions. I ended up giving up and using it as an extender, for which it works well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josh Hanson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEL76YH37OQBOT233QNKSIY3SCHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FTSFNXFFIUKC?ASIN=B08DHLCLCY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2022",
                "reviewTitle": "5.0 out of 5 stars Understanding How It Works",
                "reviewText": "I am writing this review because so many people are giving it a bad review because frankly they do not know how the technology works. First off it is a signal extender and not a booster, meaning it will extend the signal you have but it will not increase the speed! The speed is only as fast as the signal coming into the house to your router! In my case I was not getting a good signal to my Ring Camera because the signal was not strong enough! You basically put the extender between where you are getting a good signal and where you want the signal to extend too. For example I used a speed tester app to find the best signal in between the router and where the signal is going!I have read several comments that say you need to understand how it works and doesn't work. First off if you don't know how the technology works then you don't need to be writing a review. Other reviews said it creates a second SSID and they keep getting disconnected switching between the router and the extender! I will say this it was super easy to install just download the app by scanning the QR code in the instructions manual. Once the app is open create an account and follow the instructions. YES by default it creates a second SSID!Here is were you have to understand the technology. If you don't want certain people for example to have access to the extender you can have a second passphrase so that only people you want to have access can. If you just want to extend the network throughout the house you have to name the SSID the same as the router SSID as well as the passphrase. What this will do is when you move into that part of the house your phone will automatically switch to the closest signal which is the extender. Yes you will be disconnected from one and connected to the other, but because the SSID and passphrase are the same for you it will be instantaneous! if you are listing to music or watching a video because of the buffer time you will not have any loss of service!In conclusion It is working as intended and doing what I needed it to do. I have a 200mbps connection from the cable company and I was getting 7mbps at the camera and now I am getting 65mbps and the camera is working so much better! The reason I am only getting 65mbps is because although the signal strength is better it's not 100% full signal. I know their are other Extenders with better range but most of them have external antenna's and I was putting this in the kitchen and wanted it to look as neat as possible for my wife.",
                "reviewVotes": "239 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HUGO  ZAPI ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 4, 2023",
                "reviewTitle": "Buen producto",
                "reviewText": "Tiene buena señal y es fácil de instalar y programar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lupita",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 19, 2023",
                "reviewTitle": "Muy bueno",
                "reviewText": "A pesar de que tuve que estar buscando que ningún muro bloqueara… excelente.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos Mateos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 26, 2023",
                "reviewTitle": "El producto llego sin ningún problema.",
                "reviewText": "Excelente el producto, cumple con las expectativas de extender la red de wifi, fácil de instalar, el único problema es que viene todo en ingles. Hasta ahora todo bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 4, 2022",
                "reviewTitle": "Boosted area from poor to good",
                "reviewText": "A bit bulky at the power point with the US to AU adapter",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabriela lopez rocha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 28, 2024",
                "reviewTitle": "Excelente",
                "reviewText": "Buen producto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}