{
    "remaining_requests": 27316,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/eero-reliable-gigabit-connect-Coverage/dp/B091G65HH6",
    "body": {
        "name": "Amazon eero Pro 6E mesh Wi-Fi router | Fast and reliable gigabit + speeds | supports blazing fast gaming | Coverage up to 2,000 sq. ft. | 2022 release",
        "price": "$199.99",
        "originalPrice": "$249.99",
        "rawPrice": 199.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/eero-reliable-gigabit-connect-Coverage/dp/B091G65HH6",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09V22NCB3"
        ],
        "asinVariationValues": [
            {
                "asin": "B091G65HH6",
                "variationName": "Configuration",
                "variationValue": "1 Pack",
                "price": "$199.99",
                "variationImageURL": ""
            },
            {
                "asin": "B091G68F8C",
                "variationName": "Configuration",
                "variationValue": "2 Pack",
                "price": "$319.99",
                "variationImageURL": ""
            },
            {
                "asin": "B091G64GVK",
                "variationName": "Configuration",
                "variationValue": "3 Pack",
                "price": "$439.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/11klMFfz3rL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51JBrtF0BBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lz6RjtbWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zQb-cL5xL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41janc 2Z9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zSLB34rVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/01RoRuWjLpS.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the eero Store",
            "link": "https://www.amazon.com/stores/eero/page/FC890135-A1A9-499D-91A1-860E8614C254?ref_=ast_bln"
        },
        "brand": "eero",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 4044,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 12 hrs 57 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "EERO’S FIRST Wi-Fi 6E ROUTER - eero Pro 6E supports fast speeds and direct access to the new 6 GHz band when using Wi-Fi 6E devices, resulting in lower latency. Backward-compatible with previous-generation eero devices.",
            "WIRED SPEEDS, WITHOUT THE WIRES - Game, work, or stream reliably with eero Pro 6E.*",
            "EERO TECHNOLOGY OPTIMIZES YOUR WIFI - Supports blazing fast gaming across your whole-home network.",
            "MORE BANDWIDTH, GIGABIT+ SPEEDS - Supports network speeds up to 2.3 Gbps — including wired speeds of up to a gigabit and wireless speeds of up to 1.6 Gbps. Enables gigabit+ internet plans when using the 2.5 Gb Ethernet port.",
            "MORE WIFI FOR MORE DEVICES - Network coverage up to 2,000 sq ft and support for 100+ connected devices.",
            "EXPERIENCE THE EERO TRUEMESH DIFFERENCE - eero’s patented TrueMesh technology intelligently routes traffic to reduce drop-offs and dead spots.",
            "SET UP IN MINUTES - The eero app guides you through setup and allows you to manage your network from anywhere.",
            "WORLD-CLASS CUSTOMER SUPPORT - Any questions? Our expert wifi troubleshooters are ready to help by phone in the US at +1-877-659-2347 or by emailing support@eero.com.",
            "GETS BETTER OVER TIME - Receive automatic updates to help keep your network safe and secure. Online security and additional network management features available via a separate subscription."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Wifi coverage",
                "value": "Covers up to 2,000 sq ft"
            },
            {
                "name": "Type",
                "value": "Router (connects to modem as primary router)"
            },
            {
                "name": "Supported speeds",
                "value": "Supports network speeds up to 2.3 Gbps — including wired speeds of up to a gigabit and wireless speeds of up to 1.6 Gbps. Ideal for gigabit+ internet plans (up to 2.5 Gbps using the 2.5Gb Ethernet port)."
            },
            {
                "name": "Wi-Fi connectivity",
                "value": "Wi-Fi 6E tri-band concurrent 2:2:2 (802.11ax); compatible with older Wi-Fi standards"
            },
            {
                "name": "Wired connectivity",
                "value": "One auto-sensing 2.5 gigabit Ethernet port and one auto-sensing 1 gigabit Ethernet port"
            },
            {
                "name": "Speed Rating",
                "value": "AX5400"
            },
            {
                "name": "Smart Home Connectivity",
                "value": "Works with Alexa, Amazon Frustration Free Setup, 802.15.4 radio (Zigbee, Thread), Bluetooth Low Energy 5.0"
            },
            {
                "name": "Electrical Rating",
                "value": "100-240V AC, 50-60 Hz"
            },
            {
                "name": "Processor, memory and storage",
                "value": "1 GHz dual-core processor, 1024MB RAM, 4GB flash storage"
            },
            {
                "name": "Network Security and Services",
                "value": "Profiles, WPA3 (eero Labs feature), WPA2, TLS v1.2+, VPN passthrough, IPv6, NAT, UPnP, port forwarding, DHCP, static IP, and cloud connectivity."
            },
            {
                "name": "Required for setup",
                "value": "Supported iOS or Android device and internet service (with cable or DSL modem, if required). See requirements."
            },
            {
                "name": "Temperature Rating",
                "value": "Operating: 0˚C-40˚C Storage: -25˚C-60˚C Operating humidity: 0%-90%, non-condensing Operating altitude: <3000m"
            },
            {
                "name": "Dimensions",
                "value": "5.6 in x 5.4 in x 2.0 in (142mm x 138mm x 51mm) Actual size and weight may vary by manufacturing process."
            },
            {
                "name": "Warranty and Support",
                "value": "1-year limited warranty. Free customer support is available 7 days a week. Learn more about warranty and support."
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least five years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates."
            },
            {
                "name": "Subscription",
                "value": "30-day eero Plus trial is limit one per new eero customer account. Additional terms apply, see the eero Plus Terms of Service for more details. eero Internet Backup performance will vary and you are responsible for data charges with backup connection providers. Learn more about eero Internet Backup requirements, performance, and compatibility here."
            },
            {
                "name": "Legal Disclaimer",
                "value": "Some features require linking your Amazon account, and downloading the Alexa application or using a compatible Alexa device. Internet connection speeds and availability depend on your internet service provider; if your internet service provider does not provide you with the maximum supported speed, you will not experience that maximum speed. Maximum network speeds, if applicable, reflect combined supported speeds across wired and wireless clients. Maximum wireless signal rates are derived from IEEE 802.11 standard. Specifications assume wired Ethernet connection; your experienced speed may vary when connected to an eero device that is configured as a wireless extender. Coverage estimates are based on normal use conditions. Actual range and performance can vary, and maximum supported speeds may not be available to all customers, due to factors such as local regulations (including power limits), network configuration, interference, connected devices, device usage, building materials, and obstructions. Specifications are based on use of a Wi-Fi 6 or later generation client device that supports 160 MHz. For more information about eero performance, visit support.eero.com. Combining eero Pro 6E devices with older generation eero devices on the same network may result in reduced performance across the network. *“Wired speeds, without the wires” assumes a benchmark of 1 Gbps wired port speed, and use of either i) 6 GHz on mesh backhaul and use of a client device that supports 160 MHz, and/or ii) a Wi-Fi 6E or later generation client device that supports 160 MHz."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LLamaBob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH3IHWUZ3UVBJVGO5HHN5D2IDOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EL5E7YT27CH7?ASIN=B091G65HH6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Wish I would have done it sooner",
                "reviewText": "The eero Pro 6E box arrived yesterday. I was going to wait until the weekend to install it but I started about 6:00pm. I installed the app, which walked me through the install, step-by-step. It was super easy. First I installed one of the three units that connects to my cable modem. After the successful indication, then I added the 2nd unit in the office. It connected and reported good health. Then I added the 3rd unit upstairs. This one couldn't get a good signal, so I moved it to a different wall and it worked great. Now I have super high-speed, full coverage throughout the house. My phone or laptop will automatically switch to the nearest, most powerful node. I powered down and retired my two Netgear Nighthawk routers.The only complaint is the documentation on Amazon, which doesn't mention if the USB-C power adaptors are included. They are included. I bought 3 USB-C power adaptors which was not needed, which I am returning.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SweetSavvyReviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXRAORS3PX64DU7JFUP4TKQWEDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROP5OG8RYJ6ZV?ASIN=B091G65HH6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect in a 6000sqft Villa with Concrete Walls",
                "reviewText": "I recently upgraded my home network to the eero Pro 6E, and the results have been nothing short of astounding. I live in a 6000 square foot villa with walls made of concrete, which has always been a Wi-Fi nightmare. Traditional routers struggled to penetrate those thick walls, and I had constant dead zones throughout the house. However, the eero Pro 6E has completely transformed my connectivity experience.From the moment I set up the eero Pro 6E in a mesh network, I noticed a dramatic improvement in Wi-Fi coverage. The setup process was incredibly user-friendly, and within minutes, I had seamless connectivity across the entire villa. Even in the farthest corners of the house, I now have strong and reliable Wi-Fi signals.One of the standout features of the eero Pro 6E is its ability to handle the challenging environment of concrete walls without requiring any hardwiring. This was a game-changer for me, as drilling holes in my walls was not an option. The tri-band Wi-Fi 6E technology delivered lightning-fast speeds, even when multiple devices were connected simultaneously. Whether it was streaming 4K videos, video conferencing, or online gaming, the eero Pro 6E handled it all effortlessly.I also appreciate the intuitive eero app, which allows me to manage my network with ease. From setting up guest networks to monitoring device usage, it provides excellent control and insights into my network performance.Moreover, the eero Pro 6E receives regular firmware updates, ensuring that I always have access to the latest features and security improvements. This gives me peace of mind knowing that my network is not only fast but also secure.In conclusion, if you have a large space with concrete walls that cannot be hardwired, the eero Pro 6E is the ultimate solution for your Wi-Fi needs. It has transformed my villa into a connected paradise, eliminating dead zones and delivering blazing-fast speeds. I can confidently say that it's worth every penny, and I wholeheartedly recommend it to anyone seeking a top-tier mesh Wi-Fi system. Thank you, eero, for making my home Wi-Fi dreams come true!",
                "reviewVotes": "50 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RAV",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIRPPNO7RSBC6ZM6OILCILN5ZJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20IEV2APCJ8V3?ASIN=B091G65HH6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Works from basement upwards for me. Easy setup",
                "reviewText": "The best place to start your original router is in the middle of your house middle floor etc. However my setup was entry of cable through the basement. So I have my original router in the basement kind of near the middle then the next two routers are about one floor up and then another floor up after that on the left side of the house. When I tried putting these next two in the middle there is a metal barrier from the ductwork that prevents flow of the Wi-Fi signal through the house. The signal to the router itself was good but it would keep dropping if you were sitting behind the wall that had the duct work in it. But since these eero's have strong signal they do great on the side of the house and I get fantastic throughput all the way to the garage and even halfway out into the yard on the opposite side of the house. Set up was easy just follow the app instructions.At first I thought an app I use, VNC viewer, would need some special firewall settings as I was unable to connect after new routers, but it was actually Windows 10 that was preventing it from working due to new network recognized. So launching VNC viewer server going into the config then clicking okay prompted Windows to ask me if I wanted to allow VNC communication through the network. So you click on yes now working. So it was Windows firewall not eero firewall preventing it.I have shark vacuum robots that run on a 2.4 GHz only. And they use your cell phone to make the pairing to the network. Since eeeo handles all of the Wi-Fi automatically it'll connect your phone to whatever is the best quickest which is normally 5 Ghz and your phone can't find the shark vacuum robot. Eero settings under troubleshooting gives you an option to temporarily turn off 5 GHz speed to allow 2.4 GHz only devices to connect to the network. So enable that on your eero app then disconnect your phone and reconnect it to the home network and you will join on 2.4 GHz. Then follow your instructions for connecting to the shark vacuum robots to get them connected to your home network through your phone. When you're done and about 10 minutes later when it times out you can if you choose disconnect and reconnect your phone so you'll connect it the faster 5 GHz speed. But once your robots are connected to the eero Network they'll continue to be connected using 2.4 GHz even after power off due to the pairing you did. So it's a one time thing.You don't need the extra services eero offers unless those are packages that you pay for today through some service to protect you on the internet.The units feel warm to the touch so keep them in a well ventilated place. They look nice and work so far.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}