{
    "remaining_requests": 27331,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Introducing-Amazon-eero-dual-band-extender/dp/B086P6PBWB",
    "body": {
        "name": "Certified Refurbished Amazon eero 6 dual-band mesh Wi-Fi 6 router, with built-in Zigbee smart home hub",
        "price": "$74.99",
        "originalPrice": "",
        "rawPrice": 74.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Introducing-Amazon-eero-dual-band-extender/dp/B086P6PBWB",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BHGRFKFH"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31YlndshtFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21ZxD7z0LqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41O692q7v6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JTQ5Zc-6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51B7swUdynL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LY KGmvOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iLwL95rwL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the eero Store",
            "link": "https://www.amazon.com/stores/eero/page/FC890135-A1A9-499D-91A1-860E8614C254?ref_=ast_bln"
        },
        "brand": "eero",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 647,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 13 hrs",
            "FREE pickup Tuesday, February 20",
            "Or fastest pickup Tomorrow, February 15. Order within 1 hr 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "A certified refurbished eero 6 dual-band mesh Wi-Fi 6 router is refurbished, tested, and certified to look and work like new and comes with the same limited warranty as a new device. Certified Refurbished Amazon devices may be packaged in generic Amazon-branded boxes.",
            "Whole-home Wi-Fi 6 coverage - eero covers up to 1,500 sq. ft. with wifi and supports wifi speeds up to 900 Mbps.",
            "Say goodbye to dead spots and buffering - Our TrueMesh technology intelligently routes traffic to reduce drop-offs so you can confidently stream 4K video, game, and video conference.",
            "More wifi for more devices - Wi-Fi 6 supports faster wifi than prior standards and permits 75+ connected devices.",
            "Set up in minutes - The eero app walk you through setup and allows you to manage your network from anywhere. Plus, free customer support is available 7 days a week.",
            "Built-in Zigbee smart home hub - eero 6 connects compatible devices on your network with Alexa—so there’s no need to buy separate smart home hubs for each device.",
            "Gets better over time - Automatic updates bring the latest and greatest in eero wifi while also helping to keep your network safe and secure.",
            "Easily expand your system - With cross-compatible hardware, you can easily add eero products as your needs change."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Title",
                "value": "Amazon eero 6 mesh wifi system"
            },
            {
                "name": "Wifi coverage",
                "value": "Covers up to 5,000 sq. ft."
            },
            {
                "name": "Type",
                "value": "1 Router, 2 extenders"
            },
            {
                "name": "Supported speeds",
                "value": "Best for internet speeds up to 500 mbps."
            },
            {
                "name": "Wifi connectivity",
                "value": "Wi-Fi 6 dual-band concurrent 2:2 (802.11ax), compatible with older wifi standards"
            },
            {
                "name": "Wired connectivity",
                "value": "Two auto-sensing gigabit Ethernet ports for WAN and/or LAN connectivity"
            },
            {
                "name": "Speed rating",
                "value": "AX1800"
            },
            {
                "name": "Smart home connectivity",
                "value": "Works with Alexa, Amazon Frustration Free Setup, 802.15.4 radio (Zigbee, Thread), Bluetooth Low Energy 5.0."
            },
            {
                "name": "Electrical Rating",
                "value": "100-240V AC, 50-60 Hz"
            },
            {
                "name": "Processor, memory, and storage",
                "value": "1.2 GHz quad-core processor, 512 MB RAM, 4 GB flash storage"
            },
            {
                "name": "Network security and services",
                "value": "Profiles, WPA3 (eero Labs feature), WPA2, TLS v1.2+, VPN passthrough, IPv6, NAT, UPnP, port forwarding, DHCP, static IP, and cloud connectivity"
            },
            {
                "name": "Required for setup",
                "value": "Supported iOS or Android device and internet service (with cable or DSL modem, if required). See requirements."
            },
            {
                "name": "Temperature Rating",
                "value": "Operating: 0˚C-40˚C Storage: -25˚C-60˚C Operating humidity: 0%-90%, non-condensing Operating altitude: <3000m"
            },
            {
                "name": "Dimensions",
                "value": "3.9 in x 3.8 in x 2.4 in (99.4 mm x 97 mm x 61.4 mm). Actual size and weight may vary by manufacturing process."
            },
            {
                "name": "Warranty and Support",
                "value": "1-year limited warranty. Free customer support is available 7 days a week. This device receives the same limited warranty as a new device. Learn more about Certified Refurbished Amazon devices."
            },
            {
                "name": "Subscription",
                "value": "30-day eero Secure trial is limit one per new eero customer account. Additional terms apply, see the eero Secure Terms of Service for more details."
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least five years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates."
            },
            {
                "name": "Legal Disclaimer",
                "value": "Some features require linking your Amazon account, and downloading the Alexa application or using a compatible Alexa device. Internet connection speeds and availability depend on your internet service provider; if your internet service provider does not provide you with the maximum supported speed, you will not experience that maximum speed. Maximum wireless signal rates are derived from IEEE 802.11 standard. Specifications assume wired Ethernet connection; your experienced speed may vary when connected to an eero device that is configured as a wireless extender. Coverage estimates are based on normal use conditions. Actual range and performance can vary, and maximum supported speeds may not be available to all customers, due to factors such as local regulations (including power limits), network configuration, interference, connected devices, device usage, building materials, and obstructions. Specifications are based on use of a Wi-Fi 6 or later generation client device. For more information about eero performance, visit support.eero.com."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BurnedToast",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5IHYFPLVKYZYYVFUW76DBV5I4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TZ2KXJY15YLT?ASIN=B086P6PBWB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars No more devices dropped by my router. Easy to set up and it is fast!",
                "reviewText": "My old router was a TPLink Archer C7 and TPLink repeater; my wife's apple phone and tablet kept disconnecting and the only way to reconnect was to reboot the router, which took a while. We cut the cable a few months ago, so everything on our TV comes from the Internet, and we were getting pauses.I kept the old network name and password, so this was plug and play. I got a router and two repeaters because my house is about 3400 sq ft and the internet connection for the router is at one end of the house.Installation was totally painless, everything works perfectly, and no more pauses. I and my wife are very pleased.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BuyItOnce",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHON7564QIPVIM54PNXXNQGYKF2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYV79WFG07MVD?ASIN=B086P6PBWB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy to set up and manage with solid speed and coverage",
                "reviewText": "Small and effective way to deploy mesh network for speed and network coverage with easy to manage features via app. You do give up more powerful and deep network customization features as well as LAN ports on each node but it's perfect for casual users and I can maintain access remotely via app to monitor/troubleshoot as needed. Has remained stable for couple months now with no issues and happy users who noticed the increased speed and reliability.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQEPQ6QXT3U7YEXCALWIUFHMW2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NY0X3WEIMHW?ASIN=B086P6PBWB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Amazing Device, Potentially Brutal Setup",
                "reviewText": "First the device is absolutely fantastic once you get it up and running and my house has a mesh Wi-Fi network in every nook and cranny.I have Centurylink and went in expecting the worst and it was. There was no “just plug it in and it works” as advertised. I had to research that I was on a PPPoE with my VLAN and get my username and password from Centurylink. After that I had to doublenat my Eero because PPPoE wasn’t supported on the firmware it shipped with. After that it was a hard reboot for the Eero and then attempted many times to connect to my modem. Eventually I gave up and just left it in with a hokey doublenat configuration.I’m not a network engineer and had no clue what the above meant so it took me a long time to understand all this. The Eero help guide only got me so far and had to go to other forums. To be fair I did not call Eero customer support but there has to be an easier way. My biggest criticism after the supposed plug-and-play marketing is they’re shipping refurbished units with pretty ancient firmware. I believe the PPPoE addition was over a year ago.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BeachBunny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQESMYBCVUDJ3J6CLKJ5VUTNUMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSUF0CUETGK22?ASIN=B086P6PBWB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "5.0 out of 5 stars It just works",
                "reviewText": "I've been doing IT work for 30+ years. When this router came up on sale, I couldn't resist. WiFi6 for under $50 from a reputable company? Sure, I'll try it.Setup was indeed fast. I'm not a fan of apps and would prefer to do everything through a web browser, but the app and router worked flawlessly. I think most non-technical people would have no trouble following along and be up and running in about 5 minutes, with most of that time waiting for the devices to power up. Very little needed from the user to get these going.So far, range has been great and they've been stable. I can't comment on speeds too much as I only have an 80/10 Mbps internet plan, so this router is far more capable than my internet connection. This replaces an Asus RT-N66U router, which is an 802.11n router, and just this single Eero router has better coverage than the N66U. I don't need any more coverage than this, so I'm good.Despite being so locked down and automated, you still have the ability to set DHCP reservations and Port Forwarding, which really is as advanced as I need for my home setup. Sure, I'd like VLANs and other things, but with some adjustments it's doing everything my old Asus router with Merlin firmware was doing for me. I even have a Pihole connected and running on here.So...what's not to like? The only things I dislike are generally why the Eeros are so popular. They're not meant for techie users. They're highly simplified, highly automated. There aren't all sorts of settings to adjust and tweak, nor are there tons of reporting. BUT, they're not meant for it. It's a bit of an adjustment for a techie since the Eero handles all of this automatically, and so far, it's handling it well. I'd like a web interface rather than app or at least in addition to the app, but at the same time, the app does everything it needs to. More Ethernet ports would be appreciated though. I did have to buy an external 8-port switch to have this replace my Asus. The Asus had 5 ports total (1 WAN, 4 LAN), whereas the Eero only has 2 Ethernet ports.At the end of the day, especially after dealing with IT problems at work all day, it's nice to come home and have something this simple that just works. It's home WiFi, not corporate. Eero has managed to turn home WiFi into an appliance. Plug it in, set the WiFi name, set the password, done.One other thing I like are that firmware updates are regular, so far monthly. Eero's smart in having a limited number of models available, so it's much easier for them to support. They say they'll keep supporting a router for 5 years after it's final date of sale. If that holds true it'd be amazing, BUT, it does look like they've done the planning to make this happen.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sliver1081",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXTUYWTQVYN5DSN4JLWPPRUANZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROLIZSAY7NGSG?ASIN=B086P6PBWB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Game changer.",
                "reviewText": "I have AT&T fiber and since they installed the new router in my basement, the reception has been crappy in my 2-story house. Read the reviews here and thought for the price, it would be worth a try. NO COMPLAINTS. I am not technologically saavy at all. Very easy set up and one hiccup just required unplugging both my router and the eero router for 5 minutes and it was good to go. Having no trouble with dead spots anywhere in the house now.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}