{
    "remaining_requests": 27095,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/MOTOROLA-MT7711-Gigabit-Comcast-Internet/dp/B07GX2ZQXG",
    "body": {
        "name": "Motorola MT7711 24X8 Cable Modem/Router with Two Phone Ports, DOCSIS 3.0 Modem, and AC1900 Dual Band WiFi Gigabit Router, for Comcast XFINITY Internet and Voice",
        "price": "$191.20",
        "originalPrice": "$239.99",
        "rawPrice": 191.2,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/MOTOROLA-MT7711-Gigabit-Comcast-Internet/dp/B07GX2ZQXG",
        "soldBy": {
            "sellerID": "A2P3NBC5MW5UMJ",
            "name": "Region Goods",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2P3NBC5MW5UMJ&asin=B07GX2ZQXG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09K4R9KDM"
        ],
        "asinVariationValues": [
            {
                "asin": "B07GX2ZQXG",
                "variationName": "Style",
                "variationValue": "WiFi 5 + DOCSIS 3.0",
                "price": "$191.20",
                "variationImageURL": ""
            },
            {
                "asin": "B09HL4RLRV",
                "variationName": "Style",
                "variationValue": "WiFi 6 + DOCSIS 3.1",
                "price": "$399.95",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/311gvfrsokL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41JVU ejgDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518wGieVHmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41M6CtcNs2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51e4tvo4jYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EYxxfeY8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZwewWenmL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Motorola Store",
            "link": "https://www.amazon.com/stores/Motorola/page/5293F48E-1F7B-4C0E-9617-ADF6A7EDD190?ref_=ast_bln"
        },
        "brand": "Motorola",
        "merchantInfo": "Ships from and sold by oddpricecom.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 5801,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Sunday, February 18. Order within 7 hrs 51 mins",
            "FREE delivery February 22 - 28.",
            "Or fastest delivery February 20 - 22."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "THREE-IN-ONE CABLE MODEM, AC1900 ROUTER, AND XFINITY COMPATIBLE VOICE PORTS - Includes 24X8 DOCSIS 3. 0 cable modem, AC1900 Dual Band (2. 4GHz and 5GHz) Gigabit Router, four Gigabit (GigE) Ethernet ports, and two XFINITY Voice compatible phone ports. This product is approved by Comcast for Xfinity Internet and Voice, and recommended by Comcast for XFINITY Internet service speeds up to 400 Mbps.",
            "REQUIRES COMCAST XFINITY INTERNET SERVICE. Approved by and for use with Comcast Xfinity and Xfinity X1. This product will not work with any other Internet service provider.",
            "ELIMINATE UP TO 156 Dollars IN CABLE MODEM RENTAL FEES PER YEAR – Say goodbye to monthly rental fees and landline phone costs.",
            "BUILT-IN HIGH-SPEED ROUTER WITH AC1900 WIRELESS AND POWER BOOST - provides Internet access for WiFi devices including smartphones, notebooks, tablets, and more. Four 10/100/1000 Gigabit Ethernet LAN ports provide wired connections to Windows and Mac computers and other Ethernet-capable devices. A Broadcom cable modem chipset provides security from Denial of Service attacks.",
            "WIRELESS POWER BOOST FOR BETTER SPEED AND RANGE - adds high-performance WiFi power amplifiers to boost the wireless signals to the legal limit, giving a significant boost in speed and range. In addition, AnyBeam beamforming at both 2. 4 GHz and 5 GHz frequencies focuses the signal on wireless clients to further enhance performance and range. NOT included is a backup battery option (Model 98250) that allows your phone to make calls for 8 hours on standby after power loss."
        ],
        "description": "3-in-1 solution that saves you money Cable modem + WiFi router + voice The MT7711 combines a DOCSIS 3.0 cable modem, AC1900 WiFi router and 2 phone lines for fast speeds and reliable calling. With savings up to 168 dollars per year in modem rental fees, it's the smart choice for Xfinity Internet & Voice subscribers. Easy and reliable A worldwide leader in technology people depend on. Comes with our 2-year quality agreement and free support from our USA team of connectivity technicians. Simplifies the installation process and eliminates wires.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Modems",
                "link": "https://www.amazon.com/Computer-Networking-Modems/b/ref=dp_bc_aui_C_4?ie=UTF8&node=284715"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "8.25\"L x 2.25\"W x 9\"H"
            },
            {
                "name": "Item Weight",
                "value": "3.76 pounds"
            },
            {
                "name": "ASIN",
                "value": "B07GX2ZQXG"
            },
            {
                "name": "Item model number",
                "value": "MT7711"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 5,801 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#15,597 in Electronics (See Top 100 in Electronics) #19 in Computer Networking Modems"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "August 28, 2018"
            },
            {
                "name": "Manufacturer",
                "value": "MTRLC LLC"
            },
            {
                "name": "Brand",
                "value": "Motorola"
            },
            {
                "name": "Internet service provider",
                "value": "Xfinity"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Compatible Devices",
                "value": "Tablet, Smartphone"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "3-in-1 solution that saves you money Cable modem + WiFi router + voice The MT7711 combines a DOCSIS 3.0 cable modem, AC1900 WiFi router and 2 phone lines for fast speeds and reliable calling. With savings up to 168 dollars per year in modem rental fees, it's the smart choice for Xfinity Internet & Voice subscribers. Easy and reliable A worldwide leader in technology people depend on. Comes with our 2-year quality agreement and free support from our USA team of connectivity technicians. Simplifies the installation process and eliminates wires. Key features Up to 800 Mbps cable internet speed Up to 1900 Mbps wireless speed 4 Gigabit Ethernet ports 2 telephone lines",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/3cf085ba-72f1-438f-b5ae-27cc2113b795.__CR210,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Certified for Xfinity Internet & Voice Works seamlessly with Xfinity by Comcast. Not compatible with non-Xfinity voice services. High-speed cable internet Recommended for Comcast Xfinity internet service plans with speeds up to 800 Mbps. WiFi speeds up to 1900 Mbps Power Boost and AnyBeam beamforming deliver fast speeds and extended coverage.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/85b34ef0-1222-4b8d-8cb1-6755d2b5e120.__CR0,0,2501,2501_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/3ee9ac18-1992-4ce5-bbff-ad50623bd30b.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7948d96-19e6-4585-bb76-a781798553d5.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Superior streaming & gaming Features 4 Gigabit Ethernet ports for quality streaming, gaming, and connecting. Simple setup & expert support Easy installation and free support from our USA team of connectivity technicians. 2 Xfinity phone lines Supports advanced features including caller ID, call forwarding, and conference calling.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/dcd951ca-f482-4427-8239-600211500cc0.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/ab4619d6-34a6-478b-a0c9-5ab159fa710a.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/57d3b5b1-1773-4d76-a85e-ae8f2891dd5e.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "MG7315 MG7540 MG7550 MG7700 MT7711 Product Type (This table only includes cable modems with a built-in WiFi router) 8x4 Cable Modem plus N450 WiFi Router 16x4 Cable Modem plus AC1600 WiFi Router 16x4 Cable Modem plus AC1900 WiFi Router 24x8 Cable Modem plus AC1900 WiFi Router Cable Modem plus AC1900 WiFi Router plus Phone Service DOCSIS 3.0 Channel Bonding 8x4 16x4 16x4 24x8 24x8 Certified for These Cable Internet Services. Typically Works with Many Others. Comcast Xfinity, Cox, Spectrum, Sparklight (CableOne), WOW! Comcast Xfinity, Cox, Spectrum, Sparklight (CableOne) Comcast Xfinity, Cox, Spectrum, Suddenlink, WOW!, Sparklight (CableOne) Comcast Xfinity, Cox Comcast Xfinity (Exclusively for Xfinity, not other cable services.) Recommended by Comcast Xfinity for Internet Service This Speed Tier or Below 200 Mbps 300 Mbps 300 Mbps 600 Mbps 600 Mbps Maximum Internet Download Speed (Actual speeds are lower) 343 Mbps 686 Mbps 686 Mbps 1000+ Mbps 1000+ Mbps Built-in WiFi Router N450 3x3, Power Boost AC1600 3x3 / 2x2, Dual Band, Beamforming, DFS AC1900 3x3, Dual Band, Power Boost, Beamforming, DFS AC1900 3x3, Dual Band, Power Boost, Beamforming AC1900 3x3, Dual Band, Power Boost, Beamforming WiFi Power Boost for Extended Range and Faster WiFi Yes No Yes Yes Yes Gigabit Ethernet Ports 4 4 4 4 4 Telephone Ports (for Xfinity Voice) No No No No Yes Is There a No-Router Version of This Product? Yes, MB7220 (8x4 Cable Modem) Yes, MB7420 (16x4 Cable Modem) Yes, MB7420 (16x4 Cable Modem) Yes, MB7621 (24x8 Cable Modem) Yes, MB7621 (24x8 Cable Modem)",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/84ac5c45-f102-43b7-8534-cc73675409f7.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/3cf085ba-72f1-438f-b5ae-27cc2113b795.__CR210,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/85b34ef0-1222-4b8d-8cb1-6755d2b5e120.__CR0,0,2501,2501_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/3ee9ac18-1992-4ce5-bbff-ad50623bd30b.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7948d96-19e6-4585-bb76-a781798553d5.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/dcd951ca-f482-4427-8239-600211500cc0.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/ab4619d6-34a6-478b-a0c9-5ab159fa710a.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/57d3b5b1-1773-4d76-a85e-ae8f2891dd5e.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/fb54f940-6b1b-40da-9e5e-cc05f54048d0.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/b16a51dd-c2fa-4805-a4fb-d7283de1aa5d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/f5bf0a21-b3a3-400d-b7bd-a250823b0d43.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/7b595119-d67d-4d38-ae93-acee78221097.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/4bb7ff52-8858-4a9a-9e05-90d2b9a52ff7.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Thom M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERUABSDRGPCIVZ2PEMNTQSGU2YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MFK70PCW277T?ASIN=B07GX2ZQXG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2019",
                "reviewTitle": "5.0 out of 5 stars Easy as Pie",
                "reviewText": "Like most here I got tired of paying the $13 a month rental for the Comcast gateway. The Arris gateway provided by Comcast also created a problem for me whenever we experienced a power outage. I sometimes took up to 3 hours for the Arris to sort itself out and allow me an internet connection even though it would let me connect to the gateway.Connecting the Motorola couldn't be easier (especially if you use the Ethernet cable connection between the computer and gateway). To connect via WiFi, I only had to log onto the gateway using the default user name and password printed on the tag on the bottom of the gateway. As soon as the computer log onto the gateway an immediate window popped on the computer screen welcoming me to Xfinity and with the click of one button the gateway registered itself with the provider. A message came on the screen and notified me that it may take up to 30 minutes before I had network access but I was connected and ready to surf the internet immediately. If you connect with the Ethernet cable you don't even have to select a user name or enter a password. As soon as the gateway powers up and runs through about 2 minutes of light blinking it will automatically bring up the Xfinity registration page. I don't understand the comments from some users that said it was necessary to call Comcast to register both the WiFi and Voice capabilities and have their techs push magic buttons to get the gateway up and running. This thing really is connect, plug, hit the power button on the rear of the gateway, wait for the lights to indicate it is ready, then log in with your computer and select the register mode on the computer screen.The user interface is much better than the Arris gateway with much more flexibility on configurations. In addition the built-in firewall the gateway also has an onboard VPN. The Motorola has a much better array of security options than the Comcast rental. After changing the admin login as well as the user name and password for both channels I ran a WiFi analyzer to check for signal level, speed, and overall performance on both the 2.4 and 5 GHz channels and everything was perfect. My download speed on 5 GHz is about 20% faster than with the Arris. Usinng slightly different names for each channel will allow you to divide you network load so you are not taxing the channel you have connected to your computer. I kept my computer on the 5 Ghz channel and split off my Nest system, smart TV, DirecTV, and tablet to the 2.4 GHz channel.The only thing I liked better with the Arris gateway compared to the Motorola is the power supply is internal to the Arris so you only have a power cord leading from the socket to the unit. On the Motorola, a power brick plugs into the wall and a low voltage wire travels from the brick to the gateway. This just creates a little more clutter and one more thing sitting on the shelf. The Motorola is slightly smaller and obviously lighter since the power supply is external.I did experience one problem that had nothing to do with the gateway and mention it here because other users may also have a WD MyCloud Home NAS drive that you will be attaching to the gateway. Once I had my gateway up and running smoothly I connected the Ethnernet cable between the MyCloud Home and the gateway. As soon as I did I lost internet connection even though both the 2.4 and 5 GHz channels showed they were still available. I called Motorola customer support to see if they had any tips. The support rep said they had never heard of any problem like this and even quizzed the other reps. One rep said he was running the same gateway with the same MyCloud Home on his network and had not problems. It took a while to determine that the MyCloud was the problem and a Google search indicated that the Plex app that was enabled on the MyCloud was causing the problem. I disconnected the MyCloud, cycled the power on the gateway and it returned to normal operation. I did a reset on the MyCloud and did not enable Plex when I had it reconnected and everything worked fine. After making sure everything was working correctly I eventually enabled Plex and everything remained normal. Powering everything off and back on did not cause any adverse reaction so everything is good.",
                "reviewVotes": "53 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason DeBettencourt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQVPPDL4FS4D5QJ4ILL7Y3PRUMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FUPOSG039DM8?ASIN=B07GX2ZQXG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 23, 2019",
                "reviewTitle": "5.0 out of 5 stars Solid modem, good performance, setup/install good, and not*",
                "reviewText": "Replaced my older (3 yo) Comcast modem with this one. Internet activation was easy took 5 minutes over the phone. WiFi is much faster than the old one. So 5-stars for speed, ease -- for internet it just worked.Getting my voice line up, however, was a Comcast support adventure. Two levels of Comcast consumer customer support could not get the voice modem to register on their network. It seemed super odd, since the device was online on their internet service. Couldn't they just access the device directly and do it? Wasn't the case it seem that's not a skill they have. So they scheduled a tech to come out (in 2 days). So, no land line for 2 days, they gave me a bill credit (OK, thanks).The Comcast tech they sent was great (shocking, I know). After he checked the signal coming in and all the house wiring he calls their support line. First level he gets can't fix it after going through their script. He looks puzzled and goes back to the truck to make some calls. He comes back with dedicated xfinity voice support on speaker (so I can hear the tech on the other end). Voice specialist goes through all checks and reboots the modem 3 times. Still no success, then voice support claims \"I don't know. It must be a bad modem.\" The tech on-site says, \"It came out of the shrink wrap 2 days ago. That seems unlikely, but thanks.\" He hangs up and says, \"OK, this is no good. Let me see what I can find out.\" Ten minutes in the truck and he's back with another tech on speaker who sends the modem for a boot again -- but this time the phone line light comes on!! It blinks four times and then goes out. I hear the tech on the phone say, \"Hang on, I'm looking at the log here.\" Then, \"OK, I have it and can update. Unplug it and let it cold boot lets see if it registers.\"The modem cold booted -- and bingo, picks up the voice line. Dial tone. Test call. All good. Lights all green. 45 minutes that all took. Neither I nor the on-site had any idea what needed to be done -- but don't let them tell you the modem is bad. They certified the device -- it's supposed to work on their network.Oh, and if you have to get a tech visit like this, confirm with the tech before they leave that it was a Comcast issue -- and you're not going to be paying for the tech visit. And hope you get a persistent tech who won't give up.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$191.20",
                "sellerName": "Your-Fulfillment",
                "sellerRating": "5"
            },
            {
                "price": "$191.20",
                "sellerName": "Ronin Distribution",
                "sellerRating": "4.5"
            },
            {
                "price": "$191.20",
                "sellerName": "Hoth Investments",
                "sellerRating": "5"
            }
        ]
    }
}