{
    "remaining_requests": 27053,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Netgear-C6250-100NAS-Certified-Xfinity-Comcast/dp/B0111MRLLG",
    "body": {
        "name": "Netgear C6250-100NAS AC1600 (16x4) WiFi Cable Modem Router Combo (C6250) DOCSIS 3.0 Certified for Xfinity Comcast, Time Warner Cable, Cox, More (Renewed)",
        "price": "$118.00",
        "originalPrice": "$179.99",
        "rawPrice": 118.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Netgear-C6250-100NAS-Certified-Xfinity-Comcast/dp/B0111MRLLG",
        "soldBy": {
            "sellerID": "A3DG6X8R7E7914",
            "name": "Mega Deals & Savings",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3DG6X8R7E7914&asin=B0111MRLLG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "Only 4 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31I t1oZA0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Nm5HuvUyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41E Vv-xqHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Vl0JEixAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51XNq-R7TkL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1eRjPspO4L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81pN2lsviCL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the NETGEAR Store",
            "link": "https://www.amazon.com/stores/NETGEAR/page/0BAEE44C-8BBE-4F72-9CF9-3CFB6CFB92F1?ref_=ast_bln"
        },
        "brand": "NETGEAR",
        "merchantInfo": "Sold by Melbourne Express and Fulfilled by Amazon. Seller Certifications:Minority-Owned Business",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1571,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Friday, February 16. Order within 12 hrs 12 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 12 hrs 12 mins",
            "FREE pickup Tuesday, February 20",
            "Or fastest pickup Friday, February 16. Order within 12 hrs 12 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "COMPATIBLE WITH ALL MAJOR CABLE INTERNET PROVIDERS: Including certification by Xfinity by Comcast, COX, and Spectrum. NOT compatible with Verizon, AT&T, CenturyLink, DSL providers, DirecTV, DISH and any bundled voice service.",
            "SAVE MONTHLY RENTAL FEES: Model C6250 replaces your cable modem and WiFi router saving you up to $168/yr in equipment rental fees.",
            "SPEEDS BY CARRIER: Spectrum (up to 300Mbps), Xfinity (up to 300Mbps), Cox (up to 250Mbps).",
            "FAST WiFi PERFORMANCE: Get up to 1500 sq ft wireless coverage and 25 devices connected with AC1600 speed (up to 1600 Mbps).",
            "VERSATILE CONNECTIONS: 2 Gigabit Ethernet ports and 1 USB port give you fast wired connections to your computer, printer, game box, storage drive, and other devices.",
            "MODEM TECHNOLOGY: Engineered with 16x4 channel bonding and DOCSIS 3.0.",
            "SAFE & SECURE: Includes parental controls, and supports WEP and WPA/WPA2 wireless security protocols."
        ],
        "description": "The NETGEAR AC1600 Wi-Fi DOCSIS 3.0 Cable Modem Router provides the fastest cable speed available with an AC1600 Wi-Fi router and integrated DOCSIS 3.0 cable modem, with up to 680 Mbps. It works with cable Internet provider Comcast XFINITY and more.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Modem Router Combos",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17442743011"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Type",
                "value": "‎802.11ac"
            },
            {
                "name": "Brand",
                "value": "NETGEAR"
            },
            {
                "name": "Series",
                "value": "‎C6250"
            },
            {
                "name": "Item model number",
                "value": "‎C6250-100NAS"
            },
            {
                "name": "Operating System",
                "value": "‎Linux"
            },
            {
                "name": "Item Weight",
                "value": "‎1.2 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "11.7\"L x 10.05\"W x 3.15\"H"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎11.7 x 10.05 x 3.15 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Batteries",
                "value": "‎1 Lithium Ion batteries required."
            },
            {
                "name": "Manufacturer",
                "value": "‎NETGEAR"
            },
            {
                "name": "ASIN",
                "value": "‎B0111MRLLG"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎January 4, 2016"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,571 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,768 in Computers & Accessories (See Top 100 in Computers & Accessories) #48 in Modem Router Combos"
            },
            {
                "name": "Internet service provider",
                "value": "spectrum, optimum, cox, xfinity"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi, Ethernet"
            },
            {
                "name": "Compatible Devices",
                "value": "Gaming Console, Storage Drive, Personal Computer, Tablet, Printer"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Why Buy Your Own Modem with WiFi? Eliminate Monthly Fees Eliminates monthly rental fees that can amount 168 dollars or more per year. Better WiFi Performance Get superior WiFi coverage and more features compared to cable provider modems with WiFi.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/eab0e94e-82d0-4230-826c-9cf89b95e425.__CR0,0,1200,1200_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": ". Works with Major Cable Providers Works with all major cable providers such as Xfinity by Comcast, Spectrum, and COX.* *Not compatible with Verizon, AT&T, CenturyLink, DSL providers, DirectTV, DISH, and any bundled voice services. Built for Serious Speed Supports cable internet plans with speeds up to 300Mbps ensuring fast, reliable internet speed for HD streaming and more. Up to 1500 Sq. Ft. WiFi Coverage Enjoy strong, reliable WiFi coverage thanks to range-boosting amplified antennas.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ceb40c91-045e-4de8-9bd0-71209da08821.__CR0,0,900,900_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8b5fcca3-787b-4ad0-9cfa-075f5e440b25.__CR0,0,1200,1200_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/43e2f875-e93a-48cd-af4b-2b18ccd10615.__CR0,0,1200,1200_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": ". Seamless WiFi for up to 25 Devices Intelligently selects between dual bands to minimize interference and maximize speed for your many smart wireless devices. Built for Serious Streaming Up to 1600Mbps wireless speed (AC1600), perfect for demanding HD streaming and gaming. Easy 5 Minute Setup Step 1: Plug your coax cable into the modem router. Step 2: Activate by either (a) connect an Ethernet cable to your computer and follow the on-screen setup, or (b) call your cable provider to activate over the phone. Two Gigabit Ethernet ports and one USB port give you super-fast wired connections to your computer, printer, game box, storage drive, and other devices.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/40167f38-44ee-4e82-a873-f9b99ff689c9.__CR0,0,900,900_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2ce252c8-c46b-4985-bece-b21af1d03c80.__CR0,0,900,900_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f69e678a-6551-4127-a6e2-43f8866894a9.__CR0,0,1200,1200_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "C6250 C7000 C7800 Cable Provider Compatibility All Major Cable Providers and Xfinity by Comcast, Spectrum, COX All Major Cable Providers and Xfinity by Comcast, Spectrum, COX All Major Cable Providers and Xfinity by Comcast, Spectrum, COX Cable Internet Plan Speed Compatibility Up to 300Mbps Up to 600Mbps Up to 2Gbps Wi-Fi Speed AC1600 (up to 1600Mbps) AC1900 (up to 1900 Mbps) AC3200 (up to 3200Mbps) Wi-Fi Coverage Up to 1500 sq ft and 25 devices Up to 1800 sq ft and 30 devices Up to 3000 sq ft and 45 devices Gigabit Ethernet Ports 2 x 1G 4 x 1G 4 x 1G Telephone Voice Ports (Xfinity by Comcast Only) USB Ports (Printer, storage drive, etc) 1 x USB 2.0 1 x USB 2.0 2 x Fast USB 3.0 Modem Technology DOCSIS 3.0 and 16x4 Channel Bonding DOCSIS 3.0 and 24x8 Channel Bonding DOCSIS 3.1 and 32x8 Channel Bonding Parental Controls ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/93230d94-d842-42d9-89d6-b55cbf5cd128.__CR0,1,2066,639_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/eab0e94e-82d0-4230-826c-9cf89b95e425.__CR0,0,1200,1200_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ceb40c91-045e-4de8-9bd0-71209da08821.__CR0,0,900,900_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8b5fcca3-787b-4ad0-9cfa-075f5e440b25.__CR0,0,1200,1200_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/43e2f875-e93a-48cd-af4b-2b18ccd10615.__CR0,0,1200,1200_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/40167f38-44ee-4e82-a873-f9b99ff689c9.__CR0,0,900,900_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2ce252c8-c46b-4985-bece-b21af1d03c80.__CR0,0,900,900_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f69e678a-6551-4127-a6e2-43f8866894a9.__CR0,0,1200,1200_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4a00a5f6-512f-4d92-8204-90c07a4c9349.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e1a93bb3-a6fe-4180-9067-07438a126901.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f7022658-52bc-4b20-95cf-f1b563f48bcf.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TMF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7OTMGLOLWP2VVVJSFBL32VV7SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKVR6UK8PGJDG?ASIN=B0111MRLLG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2016",
                "reviewTitle": "5.0 out of 5 stars Netgear is a great company and helped me beyond any reasonable expectation. A+.",
                "reviewText": "EDIT (September 9, 2016)Netgear has surpassed any expectations I could ever have. As you can see below, I had a bunch of connection issues with the router when I first bought it. They reached out to me, went through a whole slew of diagnostics, and sent my family a new router that fixed most of our issues. Things were still not 100%, though, and I continued to work directly with an engineer (not just a CS rep!) to find the exact source of the problem, which likely turned out to be interference in our home. We came up with a gameplan, Netgear shipped me yet ANOTHER router for free to try, and boom, 100% internet functionality. I didn't pay a dime for any of the new routers or for any of the shipping.Through thick and thin, Netgear assisted me and wouldn't stop helping until my issues were fixed. I can't recommend buying from them enough. Hopefully this saga shows how important it is to buy from good companies, and Netgear is one of them.NOTE: I left the old reviews up just to show people what I went through and how committed Netgear was to patiently helping me with my issues. Thanks again, Netgear.------------------------------EDIT (July 7, 2016):After working extensively with Netgear, including having one of their engineers work through problems with me for over a month and sending me a brand new router overnight, most of our issues have been rectified. We're now at 95% functionality and my wife and I are much happier with our purchase. There's just a few more kinks to work out, and Netgear is still helping us with them. Their service is second to none for sure and they've gone above and beyond to help us.------------------------------This has been a frustrating experience to say the least. My wife and I bought this to replace our Comcast router and save ourselves from long-term rental fees, but I was hesitant to do it as finding a reliable router is tough and our Comcast router was working fine. Turns out my fears were justified.It worked just fine for about 2 weeks, but then it started randomly dropping connection with devices. The devices work just fine and still show full wifi signal, and the router itself shows no signs of breakage and all the proper LEDs are lit, yet here we are, unable to maintain an internet connection for more than 10 minutes at a time.We tried troubleshooting. It doesn't automatically switch channels to lesser-filled channels, so we manually put it on a channel that only we are on. Still get dropped connections. We thought too many devices being connected may be confusing it, so we dropped it down all the way to a single device, and that device got dropped within 10 minutes. We did this with multiple devices, and they all got dropped as well. The worst thing is, when multiple devices are connected and are all working just fine, only one or two will randomly lose connection while the others continue chugging along. It's totally random and unrepeatable.Overall, for a couple that has heavy internet demands and requires stability and consistency in their connection, this router gave us everything but. Its performance is inconsistent, it constantly drops our devices while showing no signs of trouble, and now we're stuck with it because Amazon's return policy on this \"router\" is only 30 days. Call me crazy, but I wish I were blowing 10 bucks a month on a Comcast rental router. At least it worked.DO NOT BUY.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wood Boatnik",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELDRIRQ7H4XBDLZC3LWFBUTDRDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BAQQBCH51DJ?ASIN=B0111MRLLG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2018",
                "reviewTitle": "5.0 out of 5 stars The best choice for us!",
                "reviewText": "We live in a rural area with limited high speed Internet options. After suffering for months with our phone company's dismal DSL service: maybe 2.5 Mbps download speed, and CONSTANT service drops during the day, we took a chance with our cable TV provider. We have had the same Cable TV company for over 9 years, with no signal problems and so, felt that it was the best option. At the time, Cable was offering up to 100 Mbps, up from their previously advertised service of 60 Mbps. We are not heavy online users, but do have 2 cellphones, 2 tablets, a wireless laptop and a cabled desktop, and it's just two of us in the house. I researched cable modem/routers and decided on this unit for its dual-band gigabit capability, its wireless signal strength and the fact that it was stated to be compatible with our cable service provider. Well, true to form Netgear delivered on all counts!. When I was a Network ADM, I always chose Netgear switches for their ease of integration, 5 minutes or less from in the box to in service. Same with this modem/router. I had it all set up for the Cable installer, so when he came he just had to check the signal strength and then provision it with the main office and we were up and running. The BEST part is that now I routinely run speed tests and get 114Mbps download speeds. The unit has been in place over a week and no issues or problems as yet. We have a 3600 SF house and the range is excellent. Thank you Netgear, for hitting this one out of the park for us!",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mari",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETUIBKO3Y5S34G5RCVM66KEY2JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TH7R3ELEBZYU?ASIN=B0111MRLLG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 5, 2018",
                "reviewTitle": "4.0 out of 5 stars Great product, may have minor issues, BUT GREAT!",
                "reviewText": "First of all, this is a very good modem, I currently have Spectrum +100 Mpbs and it runs flawlessly. I got it because I no longer wanted to pay the rental fee for leasing the old modem. The setup and activation process was extremely easy to do, so if you're looking for a quality modem within your spending budget, then I would recommend this modem, plus it has wifi built it so you don't have to waste space occupying a modem and a router. Two minor issues for this, the 5GHz connection seems to lose connectivity sometimes when I am browsing the web, could probably be on my end (I'll update this if problem persists) Also, if you're a fan of wifi calling on your mobile device, then this MIGHT not be for you (You may have to tinker with the settings to get it working). Other than that, it is great modem/router!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vitruvius",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2DZVWITJGCERCJZGVEH4Q4J2PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLT4K5XFIC42G?ASIN=B0111MRLLG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2022",
                "reviewTitle": "5.0 out of 5 stars Simple for Xfinity Comcast...",
                "reviewText": "This product worked perfectly in FL with Comcast xFinity. It was a breeze to set up and there were zero problems. Only thing you must make sure is to register the Serial/Mac address with the service provider, otherwise nothing will work. As soon as registered, everything works great. Speeds are as expected. Nice discreet all in one unit. I would recommend again.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$119.49",
                "sellerName": "Ama-Zooms",
                "sellerRating": "4.5"
            },
            {
                "price": "$121.47",
                "sellerName": "Onlinellc",
                "sellerRating": "4.5"
            },
            {
                "price": "$152.28",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}