{
    "remaining_requests": 27387,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Linksys-Networking-Wireless-Coverage-E8450/dp/B08LMQLG7X",
    "body": {
        "name": "Linksys E8450 AX3200 WiFi 6 Router: Dual-Band Wireless Home Network, 4 Gigabit Ethernet Ports, Parental Controls, 3.2 Gbps, 2,500 sq ft, 25 Devices",
        "price": "$99.00",
        "originalPrice": "$149.99",
        "rawPrice": 99.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Linksys-Networking-Wireless-Coverage-E8450/dp/B08LMQLG7X",
        "soldBy": {
            "sellerID": "A164OPQDTKO5OE",
            "name": "Connected Home Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A164OPQDTKO5OE&asin=B08LMQLG7X&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CR1XDP8F"
        ],
        "asinVariationValues": [
            {
                "asin": "B08FBMDYJ3",
                "variationName": "Style",
                "variationValue": "1000 ft, 10+ Devices",
                "price": "$27.90",
                "variationImageURL": ""
            },
            {
                "asin": "B07RD8NHS2",
                "variationName": "Style",
                "variationValue": "1000 ft, 10+ Devices, 1.0 Gbps",
                "price": "$35.00",
                "variationImageURL": ""
            },
            {
                "asin": "B08FBNH7MV",
                "variationName": "Style",
                "variationValue": "1500 ft, 20+ Devices",
                "price": "$62.46",
                "variationImageURL": ""
            },
            {
                "asin": "B08LMQLG7X",
                "variationName": "Style",
                "variationValue": "2500 ft, 25+ Devices",
                "price": "$99.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/318INCeLHOL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51TPlFExQSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nhsrirhFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sVoWj2heL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kviP3GdNL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Linksys Store",
            "link": "https://www.amazon.com/stores/Linksys/page/E0C967DE-6A97-4E8F-9358-86C50D6219E8?ref_=ast_bln"
        },
        "brand": "Linksys",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 3524,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 13 hrs 9 mins",
            "FREE delivery Monday, February 19",
            "Or fastest delivery Sunday, February 18. Order within 6 hrs 54 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "FAST, EXPANDED COVERAGE FOR 25plus DEVICES: Bring capacity to handle more than 25plus mobile, streaming, gaming, and smart home devices to your WiFi network. Coverage up to 2,500 sq. ft. and speeds up to 3.2 Gbps.",
            "QUICK, EASY SET UP: Browser based set up and management are a breeze. Walkthrough setup and simply enjoy your WiFi.",
            "PARENTAL CONTROLS: Advanced security features allow you to limit online time and black specific websites for your kid's devices. Share internet, not personal data, with a separate guest network.",
            "SIMULTANEOUS DUAL-BAND STREAMING: Unclog your network with twice the bandwidth. Wireless signals transmitted on 2.5Ghz and 5Ghz simultaneously allow for the strongest connection possible. Choose your lane depending on whether you need range or performance.",
            "24/7 CUSTOMER SUPPORT: Customer support is available in English 24 hours a day, seven days a week.",
            "WIFI 6 TECHNOLOGY - WiFi 6 technology gives you faster speeds and increased ranges for more devices.",
            "DUAL-BAND WIFI YOU CAN COUNT ON - 3.2 Gbps and dual bands let you surf, stream, game, and chat without losing a connection.",
            "Amazon exclusive extended 18 month warranty"
        ],
        "description": "The Linksys E8450 is a powerful, compact and reliable WiFi 6 router that lets you surf, stream, and game all at the same to keep you connected to the things that matter most.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Routers",
                "link": "https://www.amazon.com/Routers-Networking-Online-Communication-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=300189"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6.14 x 3.03 x 8.66 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.41 pounds"
            },
            {
                "name": "ASIN",
                "value": "B08LMQLG7X"
            },
            {
                "name": "Item model number",
                "value": "E8450"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 3,524 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,389 in Electronics (See Top 100 in Electronics) #98 in Computer Routers"
            },
            {
                "name": "Date First Available",
                "value": "October 25, 2020"
            },
            {
                "name": "Manufacturer",
                "value": "Linksys"
            },
            {
                "name": "Brand",
                "value": "Linksys"
            },
            {
                "name": "Model Name",
                "value": "Dual-Band Wireless Home Network"
            },
            {
                "name": "Special Feature",
                "value": "Guest Mode, Parental Control"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "802.11ax"
            },
            {
                "name": "Compatible Devices",
                "value": "IPhone, Tablet, Television, Gaming System, Xbox, Playstation, Nest and Alexa Devices"
            },
            {
                "name": "Frequency",
                "value": "5 GHz"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Business"
            },
            {
                "name": "Included Components",
                "value": "Router"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/920a2cea-a4b7-4924-bc79-6d490db39387.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ac4517b5-9fad-4acf-a4cf-086bef3b5105.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ec187476-4800-4ae4-8d91-f8326aa59e77.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bernd W. Herrmann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTR3R2Y57OEMLKSWMJOFG4NXCLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UBBNDUDHHKOG?ASIN=B08LMQLG7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 8, 2023",
                "reviewTitle": "5.0 out of 5 stars A superb replacement for the Router originally provided by Spectrum Cable/Internet Services",
                "reviewText": "As a matter of background information, the original model router that I received from Spectrum when I first subscribed to their service, was a very powerful 5G model. But after 4 years, I began getting dropouts and other issues with my streaming capabilities. We don't do cable TV, rather we do streaming via various ROKU sticks or boxes. Since all of my ROKU devices are connected via WiFi, it is essential that the signals stay strong for quality streaming.After the first router began malfunctioning, Spectrum provided another new router. Unfortunately, that was a weaker model and we began experiencing issues there also.That's when I decided to invest in a relatively inexpensive, yet superbly operating modem. After doing my homework and finding out that many review sites recommend the Linksys E8450 AX3200 WiFi 6 Router, especially for Spectrum, I purchased one - and it arrived the same day (talk about awesome).Hookup was quite easy actually - but just to be safe, I also called Spectrum Tech Support to inquire if there was anything else I needed to do. They replied that unlike a modem, which requires certification on their end, routers are technically no big deal and one can use any router.Setup was easy - after connecting the new Linksys E8450 AX3200 WiFi 6 Router to my modem, I then rebooted and reset the modem. After coming back on line, the modem easily saw and communicated with the Router. As part of the instructions, they also give you an address to type in your browser, which takes you to your router settings.Now here is where it gets nice. The first time you go to this router settings page, you are asked to provide your own settings - meaning name of device and the password you wish to use. So what I did was to use the same ID and password that I had for my previous router so I would not have to redo all the devices I own that use my WiFi - it was a cinch! But you do have to use a combination of caps, small letters, numbers, and symbols for the password. If your previous passwords (that you'd still like to use) don't have this combo, you'll have to change them to meet the Linksys requirements. Of course, then you have to redo the login on all the devices you use to connect to your WiFi.After connecting everything, everything worked superbly. My download speeds were fantastic (well, fantastic for me). I have the 500 Meg download service with Spectrum, yet with this Linksys E8450 AX3200 WiFi 6 Router, I am getting download speeds of 590 Megs per second and 25 Megs upload speeds - which is better than the service I'm paying for. Great job Linksys.Now obviously, this is a new router, and all I can report upon is what I'm experiencing now. Will check back in within 6 months or so to add more comments if things change.In closing, I tend to chuckle at those reviews where the reviewer states he/she had a hard time connecting, or setup was too complicated. That's because they are usually not literate when it comes to setting up anything with a computer - and it's not a Linksys issue. I'm no computer scientist, and everything connected perfectly and I had no issues.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan Helm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESB3F4WW7Z75RPOJ4N6JQBKJAIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IP2CSC32V8Z4?ASIN=B08LMQLG7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Good price, great device.",
                "reviewText": "Put OpenWRT on it day one. It’s range/power is decent and covers my ~1500’ two story home by itself pretty well. Signal at the furthest corned is weak but I can mesh this if that matters. It worked out of the box very well in minutes. Putting OpenWRT on it is just awesome … I have perfect control over DDNS, DHCP, DNS/DoH, ad blocking, firewalling IOT, WireGuard/VPN. It even has a power on/off and a a reset button that are accessible. And it’s plenty fast.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ted",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXWXFTOYS6B75ROS2PD6SGJF2DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WRCDXRRDCDCD?ASIN=B08LMQLG7X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2020",
                "reviewTitle": "4.0 out of 5 stars Blazing fast , compact and very good range, For the price this is the \"BEST DEAL\"",
                "reviewText": "I recently upgraded my spectrum plan and my old Netgear router N7000 was not able to keep up, lotsa drops, devices having IP address issues, intermittent connection, daily router resets etc. So was in the search for a newer Ax routers, ideally a tri-band but since the prices were sky high, i opted for the dual band AX.Narrowed it down to the Asus AX-3000 and Linksys AX3200 , it is almost $40 cheaper compared to the ASUS and also has good range and higher gig support. 3200 compared to 3000.Pros- compact with no antennas bulging yet the range is better than older Netgear R7000. ( whole house is being covered with 5ghz).The speed i am getting over the air is almost 80% of my what my plan calls for, wired it might get 100% of advertised speed. ( over the air speed is always less than wired connection)Very easy to connect to my spectrum provided modem, did over the air firmware update once i got into the router. ( was super easy from opening the package to connecting my devices, renaming SSID and security PW, enabling Guest network etc took in all about 10-12 mins)So far about 18 devices are connected and have had no issues with dropped network, IP address clash, internet slowdown etc.Browser interface is very simple like i remember back in 2005 linksys used to have. Nothing much has changed, its very basic with not much of hoopla.Cons-The guest network can be turned on but cannot change the SSID. (it is a subset of your router ssid with a dash and guest next to it. ( netgear n7000 gave you the option to name your guest ssid)The guest network when connected using the setting of your phones, it takes you to browser PW login. Just like in the cafes and free WIFI commercial estblishment.The BIGGEST DRAWBACK for me is Linksys app on ios, it does not support this router as yet as this is an E series router, hopefully will get support in future but CS wasn't sure when since this is fairly new router. ( hence only 4 stars which i will update when there is mobile app support to manage the wifi).FINAL THOUGHTS -For the price and features available, it is worth the money, very simple but basic browser router configs. But it does an excellent job of connecting your devices either on 5ghz or 2.5 ghz with blazing fast speed and so far have not had any issues that i was experiencing with my older router.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Craig Saunders",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7B2C64UKMB5IWQEQ2FTXTUUMIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KTDGF4JUR7HN?ASIN=B08LMQLG7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Works as it should, great features and fantastic wi-fi",
                "reviewText": "I bought this along with an arris to replace the rental box that came with my service. It's already paid for itself over time, and I don't really need to mess with it. When I do need to access the interface for port forwarding, wifi signal changes, wifi password changes, etc, it's super easy to navigate. From what I can look up, the security is pretty standard for home routers, but there are options to change how you would want to allow wi-fi connections. There's an option for network HDD, but I don't have an external drive to use with it to test it on, and I'm not confident enough with the security of it to use it anyway. In all, I am very satisfied with this purchase and I'd recommend it to anyone with a typical household usage to replace their rented router/modem setup. If you're not computer savvy, just make sure to buy a modem to go with it when you do, because it's not intended to work without a modem (and make sure it's docsis 3.1 modem).",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOCELYN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 18, 2023",
                "reviewTitle": "Buena señal y fácil instalacion",
                "reviewText": "Me agrada que no se necesite disco. Lo configure con su cable original. Ya sabía que se necesita cable internet, compre uno largo aprox de 10 metros, lo conecte al módem de telmex para dar señal en planta baja ( incluso adentro de casa no llega bien señal de datos móviles) da buena señal, tanto por WiFi y computadora de escritorio (conectado a cable)..asi que ya hay WiFi en planta alta con telmex y en toda la planta baja con el router.Add: Yo puse casi la misma contraseña que tiene el de telmex, solo le cambie una letra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Socorro viridiana salazar salazar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 2, 2023",
                "reviewTitle": "Muy bueno",
                "reviewText": "Muy útil este producto, lo recomiendo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 11, 2022",
                "reviewTitle": "Excelente calidad",
                "reviewText": "compre dos equipos para ponerlos en malla y funcionan correctamente con una buena cobertura y velocidad únicamente es importante actualizar el equipo para que funcione sin ningún problema",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert Légaré",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2022",
                "reviewTitle": "Linksys Routeur AX1800 Wi-Fi 6",
                "reviewText": "Just as advertised",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AmazCustomer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 2, 2021",
                "reviewTitle": "Ex",
                "reviewText": "Excellent Product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}