{
    "remaining_requests": 27376,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/eero-reliable-gigabit-connect-Coverage/dp/B08ZK39NSL",
    "body": {
        "name": "Amazon eero 6+ mesh Wi-Fi router | Fast and reliable gigabit speeds | connect 75+ devices | Coverage up to 1,500 sq. ft. | 2022 release",
        "price": "$109.99",
        "originalPrice": "$139.99",
        "rawPrice": 109.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/eero-reliable-gigabit-connect-Coverage/dp/B08ZK39NSL",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09V24FVL6"
        ],
        "asinVariationValues": [
            {
                "asin": "B08ZK39NSL",
                "variationName": "Configuration",
                "variationValue": "1-Pack",
                "price": "$109.99",
                "variationImageURL": ""
            },
            {
                "asin": "B08ZK3D89L",
                "variationName": "Configuration",
                "variationValue": "2-Pack",
                "price": "$189.99",
                "variationImageURL": ""
            },
            {
                "asin": "B08ZK2BHP2",
                "variationName": "Configuration",
                "variationValue": "3-Pack",
                "price": "$239.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BLXKY4PF",
                "variationName": "Configuration",
                "variationValue": "4-Pack",
                "price": "$349.98",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41O8d6eVgrL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/11u7Coc9SXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418aYbEPoQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XF1xYrfML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qX DHl SL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SeyhNNEBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZYbIaEgAL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bb716b27-9b9e-41a0-a90a-d46031970c21/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/80478103-e3dd-4d56-bde5-9e2d4946dedc/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/07fb4ee7-43f5-4a74-b64e-d19cce5d7a9c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2cdb3928-c883-46b0-9783-0189b4e9c675/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/23004359-29f1-4676-aea2-079127f8296f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/00b2f5ee-f4bb-4cd8-8a1c-30bfe2f9fcc7/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the eero Store",
            "link": "https://www.amazon.com/stores/eero/page/FC890135-A1A9-499D-91A1-860E8614C254?ref_=ast_bln"
        },
        "brand": "eero",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 6274,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 15 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "A GIGABIT SPEED ROUTER, FOR LESS - Supports wifi speeds up to a gigabit, without the premium price tag. eero 6+ is our most affordable gigabit router ever.",
            "WI-FI 6 GETS A BOOST - eero 6+ supports additional wifi bandwidth on the 160 MHz radio channel (that’s just wifi talk for faster connectivity). With the eero 6+, you’ll get enough wifi for the whole family to work, stream, and video chat—all at the same time.",
            "EXPERIENCE THE EERO TRUEMESH DIFFERENCE - eero’s patented TrueMesh technology intelligently routes traffic to reduce drop-offs and dead spots.",
            "SET UP IN MINUTES - The eero app guides you through setup and allows you to manage your network from anywhere.",
            "WORLD-CLASS CUSTOMER SUPPORT - Any questions? Our expert wifi troubleshooters are ready to help by phone in the US at +1-877-659-2347 or by support@eero.com.",
            "GETS BETTER OVER TIME - Receive automatic updates to help keep your network safe and secure. Online security and additional network management features available via a separate subscription.",
            "BUILT-IN SMART HOME HUB - eero 6+ contains a smart home hub to connect compatible Thread and Zigbee devices on your network with Alexa, replacing the need to buy separate hubs.",
            "EASILY EXPAND YOUR SYSTEM - With cross-compatible hardware, you can easily add eero products as your needs change."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Wifi coverage",
                "value": "Covers up to 1,500 sq ft"
            },
            {
                "name": "Type",
                "value": "Router (connects to modem as primary router)"
            },
            {
                "name": "Supported speeds",
                "value": "Supports ISP plans up to a gigabit"
            },
            {
                "name": "Wi-Fi connectivity",
                "value": "Wi-Fi 6 dual-band concurrent 2:2 (802.11ax); compatible with older wifi standards"
            },
            {
                "name": "Wired connectivity",
                "value": "Two auto-sensing gigabit Ethernet ports"
            },
            {
                "name": "Speed Rating",
                "value": "AX3000"
            },
            {
                "name": "Smart home connectivity",
                "value": "Works with Alexa, Amazon Frustration Free Setup, 802.15.4 radio (Zigbee, Thread), Bluetooth Low Energy 5.0."
            },
            {
                "name": "Electrical Rating",
                "value": "100-240V AC, 50-60 Hz"
            },
            {
                "name": "Processor, memory, and storage",
                "value": "1 GHz dual-core processor, 512MB RAM, 4GB flash storage"
            },
            {
                "name": "Network security and services",
                "value": "Profiles, WPA3 (eero Labs feature), WPA2, TLS v1.2+, VPN passthrough, IPv6, NAT, UPnP, port forwarding, DHCP, static IP, and cloud connectivity."
            },
            {
                "name": "Required for setup",
                "value": "Supported iOS or Android device and internet service (with cable or DSL modem, if required). See requirements."
            },
            {
                "name": "Temperature Rating",
                "value": "Operating: 0˚C-40˚C Storage: -25˚C-60˚C Operating humidity: 0%-90%, non-condensing Operating altitude: <3000m"
            },
            {
                "name": "Dimensions",
                "value": "3.9 in x 3.8 in x 2.6 in (99.4 mm x 97 mm x 65.8 mm) Actual size and weight may vary by manufacturing process."
            },
            {
                "name": "Warranty and Support",
                "value": "1-year limited warranty. Free customer support is available 7 days a week. Learn more about warranty and support."
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least five years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates."
            },
            {
                "name": "Subscription",
                "value": "30-day eero Plus trial is limit one per new eero customer account. Additional terms apply, see the eero Plus Terms of Service for more details. eero Internet Backup performance will vary and you are responsible for data charges with backup connection providers. Learn more about eero Internet Backup requirements, performance, and compatibility here."
            },
            {
                "name": "Legal Disclaimer",
                "value": "Some features require linking your Amazon account, and downloading the Alexa application or using a compatible Alexa device. Internet connection speeds and availability depend on your internet service provider; if your internet service provider does not provide you with the maximum supported speed, you will not experience that maximum speed. Maximum network speeds, if applicable, reflect combined supported speeds across wired and wireless clients. Maximum wireless signal rates are derived from IEEE 802.11 standard. Specifications assume wired Ethernet connection; your experienced speed may vary when connected to an eero device that is configured as a wireless extender. Coverage estimates are based on normal use conditions. Actual range and performance can vary, and maximum supported speeds may not be available to all customers, due to factors such as local regulations (including power limits), network configuration, interference, connected devices, device usage, building materials, and obstructions. Specifications are based on use of a Wi-Fi 6 or later generation client device that supports 160 MHz. For more information about eero performance, visit support.eero.com. Combining eero 6+ devices with older generation eero devices on the same network may result in reduced performance across the network."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A. C. Meyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMNXI2PUW2X3TPPQGFIARE4HW5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FI9TG6PZXZMD?ASIN=B08ZK39NSL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2022",
                "reviewTitle": "5.0 out of 5 stars Stop shopping and pull the trigger.",
                "reviewText": "This is a revelation. Laugh at me, but I had two NETGEAR WNAP310 (sophisticated but dated Wireless N business-class PoE APs) for a two story 2500sf 1920s era home. I ran them off of a GS108TP Gb PoE switch with one in the center of the 2nd story and one in a backyard office building, about 100ft apart. The APs were connected to Cat5e back to the switch. Comcast gives me 100Mbps cable service (fluctuates) and both the modem and the Unifi EdgeRouter were rated for Gigabit. Devices included 2 PCs, 4 Apple phones/tablets, 2 Geeni smart outlets, 2 Nest cameras and 2 smoke alarms, and Amazon Echo family devices.Performance was fine near the APs, but mobile devices did not transfer across APs well, the performance in the backyard/outbuildings suffered because the devices were constantly confused about which AP to use, and there were dead spots in the corners of the house. In essence, I was overprovisioned from the ISP and gated at the edge due to the Wireless N technolgoy with no smarts about 2.4 or 5Ghz, delivering mostly 10Mbs performance more than 50 ft away from the APs.After increasingly strident feedback from my internal customers began exploring options. Standardizing on Unifi gear meant more cost and network management (and evenings tinkering) than I want any more. The eero products looked good, brought mesh tech, worked with Alexa and smart home devices.Immense performance difference with just 2 eeros (one replacing the router and the outbuilding AP and one replacing the upstairs AP). 100Mbps speeds from everywhere. Simple UI in the app; not as customizable (no router CLI) but does enough - like custom DNS - with everything I wanted.Lessons learned:1. Using the wired network for backhaul was a good idea. Get the traffic off of the wireless by using the eero routers if you can plug them in.2. Use the Beacons if you need to reach farther and have a power outlet but DON'T have an RJ45 port.3. The coverage is a lot better than I expected (YMMV). My house is on a 6500sf lot (65x100) and with two eero routers roughly inline with the long axis, I have coverage for 80%. Another in the last third of the lot would be ideal but I don't need to cover the street and the sidewalk.4. I expect eero 6 (500Mbps) would probably produce the same results, but the 6+ (900Mbps) means I'm ready for Gigabit ISP package.For me, it means a MUCH faster LAN, lots less tinkering, and less hardware required than I planned.I bought a 3-pack of 6+ routers to use the Cat5e as backhaul. This was a good idea",
                "reviewVotes": "87 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elderhigh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVQQB2SON26GVOAN7T6UQ6C7CGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4DS3LIEL6QZ8?ASIN=B08ZK39NSL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 18, 2022",
                "reviewTitle": "5.0 out of 5 stars Excellent Mesh WiFi System; Takes some experimentation to get great WiFi throughout the home",
                "reviewText": "I have a lot of grandkids that come over and spend the night. They complained about \"my Internet\" for years. Works great for the wife and me, but the grandkids were not happy. So I decided to try a mesh system.I read a lot about the various mesh systems out there and decided to give the eero system a try. I decided on the 6+ system because it was the latest release and the price was right for three units. The Pro line was just too expensive; for $400 more I did not see a real advantage.Two days after ordering the eero routers arrived. I quickly unboxed and disconnected the Netgear router and remote Access point that I placed on the upper floor.Our house is about 2,800 square foot ranch. The Internet comes into the basement. I placed the first eero router where the old Netgear router was sitting, connected it to the cable modem, then added power to the eero and used the eero app on my iPhone to begin setting it up. Set-up went pretty quick on the first unit. I then connected the open port on the main eero router to a Netgear switch. The Netgear switch is then connected to a MoCA adapter to give me wired Ethernet connections in three other locations in the house. Those three locations also have Netgear switches connected through MoCA adapters. All but one MoCA are 2.5v and one is a 1.1v MoCA.Next I put the second unit upstairs on top of a dry sink cabinet and set that one up with the app which went quickly. Finally, the third app was placed in one of the two bedrooms the grandkids like to use when visiting.Now I started to do speed tests in different rooms and locations throughout the house. I will honestly tell you that at first, I was not impressed. I expected better speeds/bandwidth then what I was seeing. Since only the main router had a wired connection, the other two units relied on a wireless connection back to the main router. In some cases I was only seeing about 50Mbs in most of the upstairs areas. Ugh!Then I decided to check the speed/bandwidt on my main computer which had a wired connection using a MoCA adapter back to a small Netgear switch next to the main eero router. I was only getting ~150Mbs! That was a \"WTF\" moment as it should have been around 400Mbs which is the bandwidth I have from the Internet provider.More frustration, but I put that issue on hold for a bit. I started moving the two upstairs eero devices around to different rooms and locations. Sometimes they improved, sometimes not. Frustration.Then I decided to move one of the eero devices to the media cabinet where I had a small Netgear switch connected to a MoCA adapter which of course went back to a MoCA adapter connected to the main eero router. I did not do this originally because I tried to locate the two upstairs eero devices as centrally in the house as possibly.That really changed things. Suddenly I was getting better speed and bandwidth from not only the wired upstairs eero device ~400Mbs, but also to the second wireless eero device. So now I had a better wireless signal with the wireless eero device.Then back to the main computer. Still only ~150Mbs. For grins I had a moment where a light went off....let me try shutting the power off to the 1.1v MoCA adapter. Checked the speed on the main computer again, and over 400Mbs. Now I knew that MoCA was backwards compatible, but after this I did some reading. What I missed is that when you mixed versions, the entire MoCA Ethernet will go to the bandwidth of the older MoCA in use. Makes sense now, but what did not make sense was that they same set-up was being used pre-eero install and was not an issue. Then when I reconnected power to the 1.1v MoCA, the speed not the main computer was still at ~400Mbs. I cannot explain that, but I did order a cheap Trendnet 2.5v MoCA from Amazon and replaced the old version so that now all MoCA adapters were at version 2.5.Since everything seemed to be running well now, I just experimented with placement of the remaining eero unit that was being used wirelessly seeing where I got the best speed when devices were connected to it. Finally settled on the guest bedroom.The last thing I did was change the IP addresses and range to match what I had on the old Netgear routers and even assigned four of the hardware devices fixed IP addresses as before.The grandkids have stopped complaining about the WiFi. I am also very happy.I should also add that when the grandkids are not here, we have close to 70 devices connected to the network such as Echo devices in each room, iPhones, iPads, Fire Tablets, TVs, Fire TV units. several computers including Raspberry Pi units (my ham radio hobby related Pi's), home automation with a Habitat and God only knows what else.My advice if you buy the eero system. Do not get discouraged if you run into issues. Keep trying. Mine was a bit more complicated because of the MoCA Ethernet network and all the devices I have connected. Yours may go in much easier. Try to use a wired connection to at least one eero on each floor of your home. Also keep moving the eero devices around for best placement and speed/bandwidth.If you have issues and questions, eero has great community forums. I never asked any questions, but did use the forums to locate issues/suggestions that others had which helped me quite a bit. In summary, I am very happy with the eero 6+ system.",
                "reviewVotes": "495 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "blind guy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF46IQ2HGDBKJNMG7W7EJLZYQHAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QMA1Z5956UFE?ASIN=B08ZK39NSL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Great",
                "reviewText": "To start I am blind and use a screenreader on my computer s and phone. The app was fully accessible to the blind which is awesome. That being said, this works great. I have ATT and the modem and extenders I had from ATT suck. Always have dead spots and poor handoff and signal intermittent. This EEERO fixed all of that. To start The app walks you right through setup and it is easy. I am blind and it took 20 minutes tops. You can use your original WIFI name and password which saves alot of hassle with reconnecting. I just changed the modem's name as the app suggested to prevent confusion with your devices getting not the wrong WIFI. I got the 3 pack. Both ports are either input or output. Again great for a blind person. Once setup on the first one is done, you just plug in the next and the app does the rest. After I was done I checked all my dead spots and/or slow spots and I have full signal.. speediest is what I use to test and I have consistent pings, jitter and download and upload speeds all through my house. I even have descent service 60 feet in front of my house and in the the backyard. My house has walls with pipes and appliances in the middle which can affect signal. The EERO has no issues with this at all. I had 2 spots that were always horrible and they are both at full speed like everywhere else now. I am so happy I got these. I was having lag issues and handoff issues and all of this is gone now. Very impressed. The app is simple to use, straightforward, and accessible. I highly recommend it for sure. You can also hook alexa to it and control some of it as well I have not done this. But it looks easy enough to do. If you have issues try this it more than likely will work.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}