{
    "remaining_requests": 27269,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TP-Link-AC750-WiFi-Range-Extender/dp/B07N1WW638",
    "body": {
        "name": "TP-Link WiFi Extender with Ethernet Port, Dual Band 5GHz/2.4GHz , Up to 44% more bandwidth than single band, Covers Up to 1200 Sq.ft and 30 Devices, signal booster amplifier supports OneMesh(RE220)",
        "price": "$16.96$15.02$16.96",
        "originalPrice": "$34.99",
        "rawPrice": 16.96,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TP-Link-AC750-WiFi-Range-Extender/dp/B07N1WW638",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $3 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31KztYvSteL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41KmXua76gL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QIU7IeJ9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ls8Aspc0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41s9M46Ph-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JQkAGmTmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wQBCs2s5L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ea47028-122a-47fa-a0a1-b9a9fc2a6069/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/31fcacc8-8f76-47b1-8a9c-6c17916607e5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3b31b80c-62bc-405d-b6a7-a52f2cb9cec0/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8b676688-9b35-4f1c-bf88-d3382d36e4cb/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4382c3ed-5edb-46ec-8327-954497f55476/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37fb461b-ab67-4b70-9b9f-67f472d2e8af/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71uC4KyBqRL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1SMJS4TpwL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the TP-Link Store",
            "link": "https://www.amazon.com/stores/TP-Link/page/A8C9009F-3398-4DE2-96E5-DAF7BBD28401?ref_=ast_bln"
        },
        "brand": "TP-Link",
        "merchantInfo": "Sold by JMBO Sales (Fast shipping) and Fulfilled by Amazon.",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 103450,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 11 hrs 49 mins",
            "FREE delivery February 24 - 26 on orders shipped by Amazon over $35",
            "Or fastest delivery February 20 - 22",
            "FREE pickup Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 15. Order within 11 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Dual Band WiFi Extender: Up to 44% more bandwidth than single band N300 WiFi extenders. Boost Internet WiFi coverage up to 1200 square feet and connects up to 30 devices(2.4GHz: 300Mbps; 5GHz: 433Mbps)",
            "Eliminate Wi-Fi Dead Zones - Enjoy Lag-Free Connection to any type of devices, including wired devices via Fast Ethernet port. System Requirements - Microsoft Windows 98SE, NT, 2000, XP, Vista or Windows 7, 8, 10, Mac OS, NetWare, UNIX or Linux",
            "Stay Connected - Expand Wi-Fi Coverage for your Smart Phones, Smart TV, Fire Stick, Google Chromecast, Web Browsing, Alexa Echo, Ring and more",
            "Easy Set Up - 2 Simple taps and you are ready to connect, smart indicator light helps to install in best optimal location",
            "OneMesh Technology - Enables the creation of a OneMesh network for seamless roaming when paired with the Archer A7 Router (more devices to be updated in the future)",
            "The Ethernet port of RE220 can easily turn your wired Internet connection into a wireless access point. It can also function as a wireless adapter to connect wired devices, like Blu-ray player, game console or smart TV",
            "All Wi-Fi extenders are designed to increase or improve Wi-Fi coverage, not to directly increase speed. In some cases improving signal reliability can affect overall throughput. System Requirements Microsoft Windows 98SE, NT, 2000, XP, Vista or Windows 7, 8, 10, Mac OS, NetWare, UNIX or Linux."
        ],
        "description": "RE220 expands your existing Wi-Fi coverage with next generation 11AC Wi-Fi technology. It works with any standard Wi-Fi router and creates stronger dual band connections in hard-to-reach areas, allowing you to enjoy seamless wireless coverage throughout your home or office. RE220 provides APS (Adaptive Path Selection), with APS, Dual band or tri-band range extender can dynamically select the best backhaul connection between 2.4/5G/5G2 to ensure RE to router have the best connection, and in such way maintain a better overall Wi-Fi performance. Comparable to NETGEAR AC750 Wi-Fi Range Extender (EX3700-100NAS) Maximum wireless transmission rates are the physical rates derived from IEEE Standard 802.11 specifications. Range and coverage specifications along with the number of connected devices were defined according to test results under normal usage conditions. Actual wireless transmission rate, wireless coverage, and number of connected devices are not d, and will vary as a result of 1) al factors, including building materials, physical objects and obstacles, 2) network conditions, including local interference, volume and density of traffic, product location, network complexity, and network overhead and 3) client limitations, including rated performance, location, connection quality, and client condition. Operating Temperature: 0°C to 40°C (32°F to 104°F).",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Repeaters",
                "link": "https://www.amazon.com/Repeaters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3015439011"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Type",
                "value": "‎802.11n, 802.11b, 802.11a, 802.11g, 802.11ac"
            },
            {
                "name": "Brand",
                "value": "TP-Link"
            },
            {
                "name": "Series",
                "value": "‎[New Version] Wifi Extender=AC750"
            },
            {
                "name": "Item model number",
                "value": "‎RE220"
            },
            {
                "name": "Operating System",
                "value": "‎Windows 98SE, NT, 2000, XP, Vista or Windows 7, 8, 10, Mac OS, NetWare, UNIX or Linux"
            },
            {
                "name": "Item Weight",
                "value": "‎3.2 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎2.6 x 4.3 x 3 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎2.6 x 4.3 x 3 inches"
            },
            {
                "name": "Color",
                "value": "‎White"
            },
            {
                "name": "Voltage",
                "value": "‎120240 Volts"
            },
            {
                "name": "Manufacturer",
                "value": "‎TP-Link"
            },
            {
                "name": "ASIN",
                "value": "‎B07N1WW638"
            },
            {
                "name": "Country of Origin",
                "value": "‎Vietnam"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎January 22, 2019"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 103,450 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2 in Repeaters"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "802.11n, 802.11b, 802.11a, 802.11g, 802.11ac"
            },
            {
                "name": "Data Transfer Rate",
                "value": "733 Megabits Per Second"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Connector Type",
                "value": "RJ45"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "High Speed Mode for Maximized Performance Uses one dedicated Wi-Fi band as backhaul and another dedicated Wi-Fi band as an access point to maximize the bandwidth on extender Wi-Fi. Provides stable Wi-Fi for your smart home devices like security cameras, video doorbells, smart bulbs and garage openers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a6b892c-f5fc-4cb1-9170-49d96798221f.__CR0,0,800,600_PT0_SX800_V1___.png"
                ]
            },
            {
                "media_text": "Sleek Design and Kid Friendly A sleek and compact design that blends seamlessly into your walls and decor, leaving room for the other outlet.Baby friendly for no large external antenna.Easily schedules the LED on or off to your needs, no blinking light disturbing your sleep.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/41bd98e6-dac9-4bba-b3e7-510d8420b1ac.__CR0,0,800,600_PT0_SX800_V1___.png"
                ]
            },
            {
                "media_text": "Previous page Universal Compatibility The RE220 is compatible with any of your existing Wi-Fi router or access points. Easy Setup Use the WPS button on your router and the RE220 to easily connect the extender to the network. You can also use the Tether App or Web interface as needed. Next page 1 AP and Adapter Mode 2 Universal Compatibility 3 Easy Setup",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3490bc1c-ecb2-4759-9b48-5ddeed158b5b.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8e1d8d3a-a649-4be1-b91d-cd5db365febb.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bc0cad1d-ebce-428a-ab6d-5241f5e0cdbf.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a6b892c-f5fc-4cb1-9170-49d96798221f.__CR0,0,800,600_PT0_SX800_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/41bd98e6-dac9-4bba-b3e7-510d8420b1ac.__CR0,0,800,600_PT0_SX800_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2a429afc-e709-430d-8231-9aabb62b296d.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29706093-514b-4aff-b1b6-6f93a369944e.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/37fec857-002f-4c79-bcec-74fe85238130.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/68c56328-8c99-44bd-bfed-fb04861b5dfb.__CR0,0,1464,600_PT0_SX1464_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BluEyedTiger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQVF7FNPSZSQ5AGECNG6HTPSVCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CXXH14YTCNM7?ASIN=B07N1WW638",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 5, 2019",
                "reviewTitle": "5.0 out of 5 stars Exactly what I needed and works astonishingly well for a small price",
                "reviewText": "So far the TP-Link AC750 RE220 Dual-Band WiFi Extender (2019 release) has worked great and suits my needs perfectly.It's small and visually appealing so you don't need to worry about hiding a bulky or ugly device. It actually resembles an plugin oil diffuser like a lot of us might have. It is very light weight so it shouldn't sag from the outlet when plugged in. You will lose an outlet plug and if that's a problem you can always use an extension cord and put it where ever you want. The front of the RE220 boasts 5 easy to understand LEDs informing you of its status (power, ethernet, WiFi, 2.4 GHz and 5 GHz bands) and a WPS button. The bottom of the device has a high speed RJ45 ethernet port (this is absolutely golden for wired devices) and a reset button which is recessed so you don't have to worry about accidentally pushing it and ensuring that you have to mean it when you do use that feature. It is supposed to work with any WiFi router. The mobile app and web user interface also give you management options like enabling the High Speed Mode, restricting particular devices for a specified amount of time and it even lets you turn off the LEDs if they might disturb your sleep or distract you. I personally have not used the extra features as of yet but they sound like they might be pretty useful, especially being able to turn off the LEDs. I think everyone has noticed blinking lights from various devices and they can be super annoying if they're in your bedroom or visible when you're trying to focus.The RE220 was very simple to set up with easy to follow step-by-step directions in the box, which guide you through the process and inform you about your options for setup (WPS, mobile app, web UI), where to find the app, a QR code for the app (this is also printed on the box) and the web UI address for setup if you opt to use a computer instead of the app or WPS feature. I chose to use the app which is also very simple which made the process all the more enjoyable. All you have to do is follow the on-screen prompts and it goes smoothly. It has you setup your 2.4 GHz and 5 GHz WiFi bands separately as they each have a password although it's usually the same and it's also true that not all networks are dual-band. I didn't have a single problem during setup. It was quick and painless.The only setup issue I did have was mine. In my haste to get the RE220 going, I didn't rename the extender's WiFi signal to match my home network so it caused conflicts with my IoT devices that were trying to talk to each other because the network is password protected and I had actually created a second password protected network. This caused some communication issues. The instructions even tell you that you may want/need to do this but I was in a hurry so I could get other things done and overlooked that. Once the signal was renamed and the password set to match the original network it worked great and without issue. This was very easy to do within the mobile app but could also be easily done using a laptop or desktop computer.I bought this to solve an issue with a device I got a great deal on. I stumbled upon a used Sony Media Streaming Bluray player for $15. I couldn't believe it and couldn't pass it up. I didn't really need it but I was tired of using my phone or laptop to stream movies and video to my bedroom TV. It was always a hassle and the only alternative was a wired connection directly to the TV and that in itself was a pain and more so if I wanted to play any of the discs that I have since my laptop doesn't have a built-in disc player and I have to connect the USB BR/DVD/CD player. The problem was that the player required a wired network connection and not wireless. I can't complain since it was practically free. I don't know about you but my house does not have wired ethernet. I could do that myself but it's time consuming and the money needed cancels any value in my purchase, in fact, it probably would have exceeded the cost of a brand new media player and I didn't want to make that kind of investment just to get a media player on the network. My TV is a few years old and it doesn't have WiFi or smart apps itself and I'm not ready to spend a few hundred just to get that kind of experience there either. Not when I can work around it for much less. This network extender allowed me to connect the Bluray player to the network using a spare network cable that was laying around from an old printer or maybe it was an outdated gateway from an internet old service provider. Regardless, the cable was brand new in the package and all I had to do was plug it into the TP-Link RE220 extender and my Bluray player and BAM the player was on the network and asking me to install updates. To top it all off, the WiFi signal in my bedroom is much stronger and everything using the RE220 signals have a much more reliable signal. That's not to say my Arris Gateway didn't give me a good signal to begin with, it's just a stronger signal.The speed of the TP-Link RE220 AC750 WiFi Extender works great for watching Prime videos in HD. I get full 1080p just fine. There is always a loading delay but I think that's the player which is a few years old so the memory and processor speed is not top of the line but it was $15 so again I'm not complaining. If you plan on watching 4k Ultra video, you may want to do some research to see if the TP-Link RE220 AC750 WiFi Extender meets your needs speed-wise, but it claims 433 MBps for 5 GHz and 300 MBps for the 2.4 GHz bands which should be fast enough but it's not GigaBit speed for sure. I don't have a GigaBit speed router so it wasn't a concern. My TV isn't 4k Ultra capable so I didn't worry one bit about it. I did notice that when I watched a movie using the Amazon Prime app on the player, it checked the connection speed and displayed the result and it's exactly what I see on my Samsung Galaxy S9+ on the home WiFi so the RE220 does not seem to be slower than the Arris Gateway my network is running on to begin with and the only speed issues I ever see are when too many devices are simultaneously using too much bandwidth (multiple HD TVs, cell phones, laptops, remote set top boxes, etc). First world problems...am I right? The only solution there is a faster internet connection and router which hasn't been necessary and saves money and even if I did upgrade I think this WiFi extender would still suit my needs.",
                "reviewVotes": "549 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Skyquestxt8",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZHOB3C7NEZRTOC6WH5PJZAZDHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO4GW14URSWPI?ASIN=B07N1WW638",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "4.0 out of 5 stars very good solution to extending your wifi",
                "reviewText": "Super easy to setup and works quite well. The device extends your wifi signal with a _EXT added to the name so not good for a mobile solution like your phone but works well for fixed items like a TV in the far room. Extender is small and decent looking. Only complaint is that it is not very powerful so you may need mutiple depending on the size of the area you want to cover or the distance needed.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew HatcherMatthew Hatcher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5FHRLMQOHNTYNKJXCRXS36AN3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JQW22V5X8N11?ASIN=B07N1WW638",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Great little product",
                "reviewText": "I recently purchased the TP-Link WiFi Extender, and it has proven to be a game-changer for my home network. My internet router is inconveniently located in my bedroom due to the apartment complex's infrastructure, causing a frustratingly weak WiFi signal in my living room. This became particularly problematic as I work from home, and the unreliable signal was causing disruptions during virtual meetings.Enter the TP-Link WiFi Extender, a solution that lives up to its promises. The installation process was a breeze, and within minutes, I had it up and running. The simplicity of just plugging it into the wall and completing the setup through a user-friendly app was a welcome surprise. No technical expertise required – a major plus for someone like me who isn't tech-savvy.Since incorporating the extender into my network, the transformation has been remarkable. I no longer experience signal drops, and all my devices, including my laptop crucial for work meetings, now enjoy a consistently strong and fast connection. The reliability has significantly improved, eliminating the stress of interruptions during critical work moments.What sets this product apart, besides its stellar performance, is its affordability. The TP-Link WiFi Extender offers an effective solution without breaking the bank. I highly recommend this product to anyone facing similar WiFi challenges. It has made a noticeable difference in my daily work routine, and I am thoroughly satisfied with its performance. In conclusion, if you're in need of a reliable and cost-effective WiFi extender, the TP-Link is an excellent choice.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61pCCJNQ2UL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "CZARAB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3N3CXI4HYK2NHTWA24O36TWN3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R271P3FBTQNTEX?ASIN=B07N1WW638",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "3.0 out of 5 stars Does the job but with quirks",
                "reviewText": "I purchased this to extend my Internet in my office as my printer was in the corner, and technically farthest away from the router. Did extend the signal, and I intended to use the same SSID NETWORK BUT THIS CAUSED PROBLEMS.SET UP WAS EASY. AND FIGURING THE NETWORK IS VERY EASY.PERFORMANCE is the issue I had as I suspect they were signal collision or crowding in areas of overlap with the main router, and the transition did not work as you would expect such as with mesh network. Given that this is not a mesh I’m not sure if that was realistic expectation, but I really had to use the same SSID and that DID NOT WORK.I think if you did a new SSID.. it would not cause issues.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Connor N.Connor N.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECWILZHMPKW7FTAV5IEDJVOPFLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4WPEP8RUYC5F?ASIN=B07N1WW638",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Sleek, Functional, Well-Priced",
                "reviewText": "We needed this for a Wi-Fi boost across our house so our Blink Cameras would have better connection to our Wi-Fi Router. Easy setup, I used the app and it wasn't hard to understand how to get it to function, very clear and well built app - alongside that, the device is in amazing packaging and sleek to have in any room. The WiFi was boosted, it does create another networked named \"\"WIFINAME\"_EXT\" so we just renamed it to \"Security\" and allow users to login to our regular network without having to guess which is which.Often times Amazon products are cheap and do not have good supporting apps, this is a product that would easily sell at Best Buy for double or triple the price. Really happy with the purchase.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61-VQYTZ01L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61BbjACRglL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HD813",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7EQ5VRNGRTKW7WEVHQUCCFHUYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VVRHMN7AHX3K?ASIN=B07N1WW638",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Works for me",
                "reviewText": "It definitely improved wifi signal to our detached garage which is 45' or so from the house. I was lucky to get 50-60 Mbps before but am now getting speeds averaging 110-120 Mbps on the laptop & firestick in that two-story building. However, the online setup instructions differ from the printed setup that came in the box. It took several attempts & head scratching to get the extender to work as advertised. But once I cracked the code, I was very pleased with its performance. Definitely worth the effort.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karla tirado",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 27, 2024",
                "reviewTitle": "Muy buena recepción de señal",
                "reviewText": "Resulto útil, con muy buena recepción de señal en un edificio de dos plantas y fue fácil de instalar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tsukaho Fujita",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on April 5, 2021",
                "reviewTitle": "Very good",
                "reviewText": "This extend wifi coverage and setting up is very easy. Very good buy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ottmar Ruiz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 10, 2024",
                "reviewTitle": "Muy buen dispositivo",
                "reviewText": "Fue una muy grata sorpresa la rápida entrega y lo bien que funciona el dispositivo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E.V.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 28, 2024",
                "reviewTitle": "Nice wifi booster",
                "reviewText": "This wifi signal booster is working great with my smart globe doorbell. After instalation of this booster the doorbell wifi signal strenth is between 86% to 95%. It is amaising improvment from 24%! The life video feed is no longer lagging or the doorbell is off-line. It was easy to set up.The booster is nice and very affordable.I'm very happy with my purchase.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J.L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 30, 2023",
                "reviewTitle": "Excellent WiFi Extender",
                "reviewText": "My company installs many high end video camera surveillance systems and the TP-Link extender is a favourite when the NVR recorder is as an example in the garage attic and the client router is far away in a second floor home office. The products have worked to perfection, saving many hours of labour as opposed to home run wiring. The app is an installation tool that makes the setup even easier. Will continue to use the product. Using this product on surveillance installations guarantees that you will not have cost overruns. The product is transparent to the client. It just works! We have even developed a laser cut metal powder coated wall mount bracket to hold the NVR in hidden places. Just a cool solution to help my company perform more successful installs. You won't go wrong with this product.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}