{
    "remaining_requests": 27216,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Linksys-Wireless-Including-Parental-Controls/dp/B00AAU54TW",
    "body": {
        "name": "Linksys E1200 Wi-Fi Wireless Router with Linksys Connect Including Parental Controls (Renewed)",
        "price": "$89.99",
        "originalPrice": "",
        "rawPrice": 89.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Linksys-Wireless-Including-Parental-Controls/dp/B00AAU54TW",
        "soldBy": {
            "sellerID": "AQPX2GMWFAQFE",
            "name": "Search Buy Repeat",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AQPX2GMWFAQFE&asin=B00AAU54TW&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41fnzOGYVeL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31g7HqUI3kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31QL4tvUvcL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Search Buy Repeat",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 1800,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 21 - 23.",
            "Or fastest delivery February 20 - 22."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "This Certified Refurbished product is manufacturer refurbished, shows limited or no wear, and includes all original accessories plus a 90-day warranty",
            "Enjoy the benefits of Wireless-N300 (802.11n) in your home ideal for surfing the web emailing and printing wirelessly Connect your computers wireless printers smartphones and other wireless devices at up to 300 Mbps transfer speed",
            "Enjoy broad wireless coverage provided by MIMO antenna technology Use four Fast Ethernet (10/100 Mbps) ports to directly connect wired devices",
            "Keep your network protected with customizable security settings including WPA/WPA2 Personal and SPI firewall protection Give visitors password-protected Internet access on a separate network so your visitors have access to the Internet but not your computers or data"
        ],
        "description": "The Linksys E1200 Wireless-N Router offers fast speed and reliable range so you can create a powerful wireless home network. It connects computers, wireless printers, and other Wi-Fi devices at speeds up to 300Mbps. The WPA/WPA2 encryption and SPI firewall help keep your network protected from virus and hackers by enhancing security settings. The included Cisco Connect software gets you set up in three easy steps and offers powerful tools for the ongoing management of your network. You can establish a separate guest network and limit Internet access using Parental Controls, and access-advanced settings. The MIMO antenna technology provides a wide coverage of wireless connection. Your computers, wireless printers, smart phones, and other wireless devices can be connected instantly at a transfer speed of 300Mbps. When using this powerful Wireless-N router, surfing, emailing, and printing wirelessly is an easy process. Enjoy the benefits of Wireless-N (802.11n) in your home Ideal for surfing the web, emailing and printing wirelessly Connect your computers, wireless printers, smart phones, and other wireless devices at up to 300Mbps transfer speed Enjoy broad wireless coverage provided by MIMO antenna technology Use 4 Fast Ethernet (10/100 Mbps) ports to directly connect wired devices Keep your network protected with customizable security settings, including WPA/WPA2 Personal and SPI firewall protection Set up your wireless network in 3 easy steps using included Cisco Connect software Give visitors password-protected Internet access on a separate network Use Cisco Connects Parental Controls to block specific websites and restrict Internet access during certain hours Customize your network using easily accessible Advanced Settings",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Routers",
                "link": "https://www.amazon.com/Routers-Networking-Online-Communication-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=300189"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Type",
                "value": "‎802.11n"
            },
            {
                "name": "Brand",
                "value": "Linksys"
            },
            {
                "name": "Series",
                "value": "‎FBA_E1200-AP"
            },
            {
                "name": "Item model number",
                "value": "‎FBA_E1200-AP"
            },
            {
                "name": "Item Weight",
                "value": "200 Grams"
            },
            {
                "name": "Product Dimensions",
                "value": "‎9.84 x 4.96 x 6.46 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎9.84 x 4.96 x 6.46 inches"
            },
            {
                "name": "Color",
                "value": "For Canada Only"
            },
            {
                "name": "Manufacturer",
                "value": "‎Linksys"
            },
            {
                "name": "ASIN",
                "value": "‎B00AAU54TW"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎October 28, 2011"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 1,800 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#67,856 in Computers & Accessories (See Top 100 in Computers & Accessories) #2,094 in Computer Routers #6,309 in Climate Pledge Friendly: Computers #7,781 in Renewed Computers & Accessories"
            },
            {
                "name": "Model Name",
                "value": "FBA_E1200-AP"
            },
            {
                "name": "Special Feature",
                "value": "WPS"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "802.11n"
            },
            {
                "name": "Compatible Devices",
                "value": "Printer, Smartphone"
            },
            {
                "name": "Frequency",
                "value": "2.4 GHz"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Security"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi Fi"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. De Gannes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVX5FACOPAXEXT34LDPTR2N4W7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZFXQQAJ5LWTR?ASIN=B00AAU54TW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 3, 2014",
                "reviewTitle": "5.0 out of 5 stars Review From An I.T. Networking College Student",
                "reviewText": "AT THE END BELOW I GIVE SIMPLE INSTRUCTIONS ON HOW TO MAKE THIS ROUTER PERFORM AT IT'S PEAK (for novices).This router is amazing for the price. You can't beat the bang to buck ratio here. The only problem here is that there's clearly a model lottery going on. Some are getting the E1200v1 while others are getting the E1200v2 at random. There's no way to choose, & you REALLY want that v2 model. It has double the RAM of the v1 among other things & you can do a lot more with it in terms of installing CFW etc. I was lucky enough to get a v2. It performs better than its v1 counter part & is immune to a security flaw present in the v1s. As soon as you get your v2 (if you get one) & set it up, you'd want to go & download the latest firmware build from Linksys support & install it to the router. The v2 here comes with the 2.0.02 2012 build. You want the 2.0.06 2013 build to clear up the bugs & security flaws the router comes with.Now that we're past that...this router is FAST. I mean FAST, & VERY stable. I had a Belkin-G before & couldn't download 500MB without the connection dropping constantly on me. With the E1200v2, I've been downloading 4GB files all day & the connection hasn't dropped once, & it's downloading way faster than my Belkin even in Mixed Mode. I was afraid of the \"refurbished\" status of this product. As someone who studies & deals in I.T. & tech, I generally don't practice buying used or refurbished electronic products. It's out of the question for me. However, I took the chance with this router & I haven't regretted it. There's a wealth of features to enjoy even without using CFW on it, & the interface is easy enough for beginners to get a grasp on it.If you want this router to perform at it's best there are a few settings you'd want to change from the get-go. I'll give you a heads up:1. Apps & Gaming>>>QoS: Disable WMM support2. Wireless>>>>Basic Wireless Settings: Change Config View to manual, set your Channel to either 1, 6, or 11. If all the devices in your home support the same type of wireless standard (eg. wireless-n, wireless-g etc), set it to broadcast that standard ALONE in Network Mode instead of using \"Mixed\".3. Wireless>>>>>Wireless Security: Just like with your signal standard above, if all your devices support the same security protocol, select it from the drop down list instead of using a Mixed Mode. Select either WPA2 or WPA (preferably WPA2 if all your devices support it).4. Setup>>>>IPv6 Setup: If you don't know what IPv6 is or don't know whether you're using it or not, chances are...you aren't. Disable it.There you have it. Hope you guys get the same great performance from this router as I did.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miranda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGV4C535WAR2MCKH4EVSF4HBCRBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F9SJHG8DMH2D?ASIN=B00AAU54TW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2012",
                "reviewTitle": "5.0 out of 5 stars Easy to Install and It Works!",
                "reviewText": "After my last experience with ordering a wireless router for a cheaper price, and having to return my first item ever to Amazon (and I order nearly everything here from coffee to shoes to office supplies to books...) because in order for the router to work it required me to download some crazy ridiculous software I was standoffish to order another one. In fact, if I didn't invest in an iPhone 4 last month that required a Wi-Fi connection to save on my data I would have not ordered another wireless router. But I did, and I'm so glad that I chose this one.The router arrived promptly and came with a CD for installation, power cord and blue cable. No manual, which made me a little anxious. I put the CD into my computer as requested, followed the simple instructions (that did not involve going into my computer's control panel to configure a bunch of codes and keys like the other router). I followed the directions for plugging in the router into the power cord and my existing wired router. Within five minutes of opening the box I had full bars on my laptop. Cha-ching!I did have the option to update the system after I got connected, which I opted for, and the Internet still works. It also hooked up to my iPhone 4 with no problems. Otherwise, I have had the Internet for a week and have had only one incident of dropped Internet, but that is due to a regular update from my DSS provider and it occurs at night when most people are asleep, so would normally not be a problem. The connection went off at that time and came right back on; I wouldn't have even known about it if I weren't working online. Also I have moved the phone into the bathroom and into two different bedrooms in our one story home and the service dropped one bar in these rooms when the doors were closed but went back to full three bars when I opened them.I'll post an update in the next few months about the service. Hope this helps resolve any questions you have about purchasing this quite affordable wireless router.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Horse",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 28, 2017",
                "reviewTitle": "Good hardware but poor firmware",
                "reviewText": "Very easy to setup. It is even easier to change the firmware to DD-WRT if you don't like the stock firmware which is very poor on parental control. I changed and it and works to my satisfaction.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hari P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 28, 2017",
                "reviewTitle": "Brand Worthy",
                "reviewText": "value for money & worthy deal with this price. on top of all amazing service by amazon & seller.I am using it for quite time now... i waited fro few months to post views,...its really good wifi router. Easy to configure, and less power consumption, and very reliable. Provides decent level of device controls and supports all levels of security. In this segment best suited for domestic purpose.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Akiv Kandlekar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 3, 2020",
                "reviewTitle": "Very good WIFI Router",
                "reviewText": "Product was not in Amazon Packing but was is in brand new condition and in its original product packaging.Installation took time since Linksys is a professional device and has good security features and a sturdy device and it is also under Cisco. Also I didn't use their quickconnect software.Operating System or Firmware is bit slow when accessed from Browser.However, it's a smart device and one can implement couple of security features with help of Internet Providers or IT Network Engineer.I also tested Netfix, Amazon works perfect on HD TV and Mobile even at its last range available in my bedroom.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Harish bhat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 1, 2014",
                "reviewTitle": "Excellent Product",
                "reviewText": "This is a fantastic wifi router with excellent range and is very easy to setup. I purchased a different router from another brand which did not function properly. I returned the product to Amazon, which has an excellent hassle free returns process. I am very happy with this model from CISCO. It is sleek and does not get heated up as it has several cooling vents on all sides.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vishal K.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 10, 2021",
                "reviewTitle": "Worked for 10 Days till No-Return Date",
                "reviewText": "This Router costed me / my ISP a lot of time. It was a brand new router. It worked well for 3 days. There after it started dropping LAN speeds to 10 Mbps. After 4 more days, it stopped connecting to the Internet. We changed everything around this router but did not work. Ultimately after replacing this router with another one, things got sorted. This router was a culprit. Now i cannot even return this router via Amazon as i am 2 days late for the return. Frankly speaking, i did not expect this from Linksys.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$89.99",
                "sellerName": "Techproz",
                "sellerRating": "5"
            }
        ]
    }
}