{
    "remaining_requests": 27232,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TP-Link-Extender-RE550-1900Mbps-Wireless/dp/B08TLT65WM",
    "body": {
        "name": "TP-Link AC1900 WiFi Extender (RE550), Covers Up to 2800 Sq.ft and 35 Devices, 1900Mbps Dual Band Wireless Repeater, Internet Booster, Gigabit Ethernet Port",
        "price": "$69.99",
        "originalPrice": "$79.99",
        "rawPrice": 69.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TP-Link-Extender-RE550-1900Mbps-Wireless/dp/B08TLT65WM",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CBPZS25J"
        ],
        "asinVariationValues": [
            {
                "asin": "B08TLT65WM",
                "variationName": "Style",
                "variationValue": "AC1900",
                "price": "$69.99",
                "variationImageURL": ""
            },
            {
                "asin": "B01MR90E3A",
                "variationName": "Style",
                "variationValue": "AC2600",
                "price": "$89.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Q-iVGmXUS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51RNQP3Q01S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41yE82drgIS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/516SUWiLvES.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RGhddTzlS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41m5uv 2sbS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41eYPtSb1jL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fab03f18-6afa-426b-a6f2-83d30fb51986/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e68590a5-22fb-4cbc-9c40-24347ef94b13/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/08b79342-065d-45bb-8def-693b390e8cbe/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/67fd0cfe-429e-40a9-b03f-7e5fa012066f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bc5ebda7-59a0-42b8-a8bd-eff9679f4abf/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ccdfc1e4-90cf-499c-8314-4968027be476/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81ZLC40BLOL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C18YMkoZ-XS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the TP-Link Store",
            "link": "https://www.amazon.com/stores/TP-Link/page/A8C9009F-3398-4DE2-96E5-DAF7BBD28401?ref_=ast_bln"
        },
        "brand": "TP-Link",
        "merchantInfo": "Sold by Quality Photo and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 23088,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Friday, February 16. Order within 6 hrs 12 mins",
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Friday, February 16. Order within 7 hrs 12 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fast AC1900 Dual Band WiFi - Simultaneous 600Mbps on 2.4GHz plus 1300Mbps on 5GHz",
            "Better WiFi Coverage with 3 Antennas - Three adjustable external antennas provide optimal Wi-Fi coverage and reliable connections",
            "Gigabit Ethernet port - Act as a wireless adapter to connect a wired device to your network at Gigabit speed",
            "Intelligent Signal Light - Help to find the best location for optimal Wi-Fi coverage by showing the signal strength",
            "AP Mode - Create a new WiFi access point to enhance your wired network with WiFi capability",
            "Ultimate Compatibility - Extend the range of any WiFi Internet router or wireless access point",
            "TP-Link Tether App - Easily access and manage your network using any iOS or Android mobile device",
            "All Wi-Fi extenders are designed to increase or improve Wi-Fi coverage, not to directly increase speed. In some cases improving signal reliability can affect overall throughput"
        ],
        "description": "Boost Whole Home Wi-Fi with Your Existing Router A single router has limited Wi-Fi coverage and always causes Wi-Fi dead zones. RE550 wirelessly connects to your existing router and expands its Wi-Fi signal into areas it can’t reach on its own. Enjoy your stable network experience wherever you are at home. Faster Dual Band Wi-Fi up to 1900 Mbps RE550 delivers dual band (2.4 GHz and 5 GHz) to transmit Wi-Fi signals, doubling the performance of each band. It enables you to keep more devices connected at the same time with its 600 Mbps 2.4 GHz and 1300 Mbps 5 GHz dual bands. Use the 2.4 GHz band to send email and browse the web and the 5 GHz band for gaming and HD streaming. Wi-Fi keeps Strongest for Unlimited Moving With TP-Link OneMesh Technology, it’s easy to form a wifi network with a single Wi-Fi name for seamless whole home coverage. Just connect RE550 to a OneMesh router. Always enjoy the strongest Wi-Fi when you’re walking around with no need to search around for a stable connection. Adaptive Path Selection: Keeps Itself Working at Top Speed Adaptive Path Selection keeps your network running at optimal speeds by automatically choosing the fastest connection path to the router. Always keep your devices fast and stable—ideal for network environments crowded with many devices and applications. High Speed Mode: Maximized Speed with Dedicated Backhaul Uses one dedicated Wi-Fi band as backhaul and another dedicated Wi-Fi band as an access point to maximize the bandwidth on the extended Wi-Fi. Built-In Access Point Mode RE550 is more than a wireless range extender. Simply plug an Ethernet cable into its Ethernet port and easily turn your wired internet connection into a 3×3 MIMO dual band wireless access point. Control at Your Fingertips Set up and manage your Wi-Fi through the TP-Link Tether app from your smartphone (Android, iOS), including TP-Link routers and range extenders.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b?ie=UTF8&node=172504"
            },
            {
                "name": "Repeaters",
                "link": "https://www.amazon.com/Repeaters/b?ie=UTF8&node=3015439011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6.4 x 3 x 2.6 inches"
            },
            {
                "name": "Item Weight",
                "value": "8.2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B08TLT65WM"
            },
            {
                "name": "Item model number",
                "value": "RE550"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 23,088 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10 in Repeaters"
            },
            {
                "name": "Date First Available",
                "value": "February 9, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "TP-Link"
            },
            {
                "name": "Country of Origin",
                "value": "Vietnam"
            },
            {
                "name": "Brand",
                "value": "TP-Link"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "802.11n, 802.11b, 802.11a, 802.11g, 802.11ac"
            },
            {
                "name": "Data Transfer Rate",
                "value": "1900 Megabits Per Second"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Special Feature",
                "value": "Adjustable"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "OneMesh For Seamless Whole-Home Streaming With TP-Link OneMesh technology effortlessly create a Mesh network with a single network name for uninterrupted streaming when moving around your home. Just connect the RE550 range extender to a OneMesh router for a smart roaming experience that can be managed from the TP-Link Tether app.[2]",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3fa5cb84-f095-49ec-bc5f-f620af1cdc8e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "High Performance Dual-Band Wi-Fi up to 1900 Mbps Supporting the 802.11ac Wi-Fi standard, 3x faster than standard 802.11n speeds, the RE550 delivers up to 1900Mbps of fast speeds for bandwidth-intensive tasks like 4K streaming, online gaming, video calls and more.¹ Built-in Access Point Mode The RE550 is more than a wireless range externder. With a built-in Access Point mode for plug in an Ethernet cable into the Ethernet port to easily turn any wired connection into a high-speed 3x3 MIMO dual-band Wi-Fi signal.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b0ecbd98-7774-4e48-a961-8b87c605949e.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/5d69f6f4-f817-4e80-9679-2d94c5c71e77.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            },
            {
                "media_text": "Setup Made Easy Always Find the Best Location for Placement The intelligent signal indicator helps you easily find the best place to position your RE550 for optimal signal strength from your existing router to boost WiFi coverage. Control At Your Fingertips Set up and manage your Wi-Fi network through the TP-Link Tether app from your Android or iOS mobile device. Maintain full control of your network even when you're away from the house.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c573c392-252d-4e0c-bccd-57b1815acec0.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/578f69a9-085c-40a2-b5f2-3d22cb14d920.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/c158f56d-d8f6-4b60-8b05-22cf679c854d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6a7b7c3a-93dd-4a41-bf57-036c457431ee.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6acee921-e984-4e70-9abf-2261aa077413.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3ec52101-17b4-4076-a0f2-43ad7b387a5a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3fa5cb84-f095-49ec-bc5f-f620af1cdc8e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b0ecbd98-7774-4e48-a961-8b87c605949e.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5d69f6f4-f817-4e80-9679-2d94c5c71e77.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c573c392-252d-4e0c-bccd-57b1815acec0.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/578f69a9-085c-40a2-b5f2-3d22cb14d920.__CR0,0,650,350_PT0_SX650_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "AMP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7M5SOFJULIE6JOH225P3AD4LEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R68LZLV23TTF5?ASIN=B08TLT65WM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Booster for my Wi-Fi Signal!",
                "reviewText": "I am a big fan of color changing dimmable smart bulbs. However, they were not working so great in my bed room, which is the furthest room away from the WiFi router. Half of my room is basically a dead zone, and my best floor lamp happens to be placed within that zone. So I was having a heck of a time with connectivity on the smart bulb. When contemplating what I could do to solve this issue, I decided to buy this extender and plug it in the hallway. Set up was somewhat easy, and is all done through the phone app. It did disconnect on me a couple times in the first couple of days but once I got it right, it’s been smooth sailing ever since. I only wish I bought this extender sooner! Not only does my smart bulb work flawlessly, for the past few months since I made this purchase, I have experienced no less than 5 bar Wi-Fi signals and fast internet throughout every corner of my bedroom. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Serpico16Serpico16",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHFJMOHYVJTD4J4HQVSDYDW2K2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W3MZ2I8AY06Z?ASIN=B08TLT65WM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2021",
                "reviewTitle": "5.0 out of 5 stars BEAUTIFUL AND POWERFUL WIFI EXTENDER FOR MY LINKSYS WRT 3200ACM - FLAWLESS SO FAR!",
                "reviewText": "Honestly, I have only had the TP-Link AC2600 WiFi Extender(RE650) for about 2 weeks. But it performsawesome - solid signals on both 2.4 and 5 GHz bands. Extremely easy to setup, just use the WPS or Log Directly into it. I did both methods just to see how it would go, as I generally never use the WPS (EASY METHOD) of adding devices to my router, I had to go ahead and try it. Went so easy, so easy.But being a bit of a computer, networking nut, I still like doing things the direct hands on way, so directly logged in, very easy to navigate, changed that default security password jazz - DO THIS or anyone who sees these devices or any hooked to your system, will straight off try to log in to them and either hack you or just lock you out.Not to scare anyone, just keep that in mind with ANY electronic devices hooked to your network. Save yourself the heartache.That said, it's so easy to do or have a family member help you, but it is really very easy. read and follow the easy directions and you should not have any problem.My LinkSys Router used to (2yrs ago) delivered a 5 BAR signal to everywhere on my property (about 1/2 acre) but my house is only about 1850 sq-ft. Router sits in the farthest room from screened back porch. As I said, 2 yrs ago the signal was 5 BARS everywhere maybe occasionally at the farthest corner of the property I might dip to 3 but then zoom back up to 5 within seconds.That was 2 yrs ago, more homes have been built, more cell towers etc. So for the last 12 - 15 months, that great signal dropped to 5 BARS occasionally with 2 mostly or completely dropping signal altogether.That's some Big League Taboo nowadays, so that leads me to my purchase of the TP-Link AC2600 WiFi Extender(RE650) - Plugged it in at the opposite end of the house - In the Laundry Room. No problems. Solid Signal on both bands - never drops at all, not even a flicker. Fast transfer speeds, I upload / download photos and graphics to and from my place of work. No hick-ups, no more dropouts, just a solid enjoyable signal. Watch HD and some 4k videos over it without a bit of trouble.This device is top shelf in my opinion. You can set timers for when it shuts off and wakes up (when nobody's home) and can even set the led lights to always on, always off, or at a sleep/wake time.Yeah you can get cheaper, but that's generally a gamble with finding a diamond, usually you get what you pay for. Who needs that headache to save 25 or 50 bucks. Not saying saving some money is a bad thing, I like money too, work hard for it, so throwing it away is not something I do either, but if your internet and network traffic is important to you - why skimp. There may be better too, really just depends on how you use it.If you're a real Rockefeller Type, go for whatever fits your need. I just needed my strong signal and network/internet transmission speeds back to STELLAR.And STELLAR is what this 58 yr old kid got with this TP-Link WIFI Extender. Oh, and it comes with an Ethernet port built into it for direct configuring or getting even more speed out of it. I only used it for the direct login to the device and to upload a new update. That was easy peasy too.Oh, and it has 4 swing up antennas on it. Really nice device, just place it and forget it.Sorry for such a long winded review, but it is an honest one. Like I said, I have only had it for maybe 2-3 weeks, more 2 weeks. Will definitely update if anything happens to change it. FOR NOW IT'S AWESOME AND 5 STARS.Hope this was helpful people.Thanks TP-LINK. Very well done.",
                "reviewVotes": "94 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/9144amca+QL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Javid Akhundov",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEINQUQ4WXG637FW2TSH6FU6WOCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REA9I51FSR7DL?ASIN=B08TLT65WM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2023",
                "reviewTitle": "4.0 out of 5 stars Handy for Simple Usage",
                "reviewText": "I use RE550 extender in a wireless configuration, where it is located from ten-twelve meters from the main router. There is nothing between them, except two wooden doors and some edges of concrete walls. The internet speed is sixty Mbps download and upload.According to TP-Link’s network settings, the signal between RE550 and Archer A8 seems to be hundred percent on 2.4 GHz, and almost hundred percent on 5 GHz. The Wi-Fi connection icon in the network settings sometimes shows the last bar gray, but most of the time it is full.The coverage is better than WA850RE by a lot, but it is not perfect. The 5GHz signal on Xiaomi Redmi Note 8 between two-three concrete walls and seven-eight meters is sixty-seventy percent.The repeater provides a constant internet connection to five portable devices and one wired device. There are no stutters when two phones and one smart TV play back one 4K HDR and two 1080p YouTube videos. Its workability around several devices is stable.The package and the product arrived without any physical damage or cosmetic imperfections.Unexpectedly, but after the last firmware updates the device works fine. Unfortunately, same can’t be said about Archer A8 and C80.In almost all network configurations, the repeater/range extender is not worth it, since it does not completely copy and distribute the network like Mesh Wi-Fi devices. However, with a software support, which all network manufacturers put on their products (EasyMesh from TP-Link) it, is possible to use supported range extenders or routers as a Mesh Wi-Fi device. There are several downsides though. One of them is that you cannot form a network chain between all devices; other devices can only talk to the main router. If you can afford a Mesh Wi-Fi system device, it is worth more than any range extender.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Carrot",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 27, 2023",
                "reviewTitle": "Super Strong Signal and Coverage- worth every penny",
                "reviewText": "I have been using another Extender for a couple of years now, it works, but I the connection is not always stable or available for devices I need to connect outside, but it works 85% of the time. And I always have doubts or cannot always trust the extender always feed coverage / signal connections. I have tried 2 other products of extenders but they worked pretty much the same. That is why I thought...well, it's probably my problem how everything is constructed and lay out in regards to the areas I need to use this extender. So I have given up in trying to find something better because I think it's going to be pretty much the same results.So last week I finally decided to give another chance to look for a better Extender, I found this, but at first I didn't have much high hope, I would just try it and then refund it if the performance is not what I expected. But to my surprise, the signal is so much stronger providing VERY stable and solid connections ! Now I feel 100% with this extender providing solid connection, I can see my devices loading faster, and not drops at all, everything just work so much better now. Very happy. Now in my case, I'm not so much concerned about \"dead zones\" is more like I need a solid connection to where I need to use it and this extender performed just that, a solid connection. My internet connect is pretty solid so if the extender can extend it, then everything will be fine, again, this extender did a solid job in extending connection. I'm sure this extender can always broadcast a very long range of connection to help reduce dead zones/spots.Oh, in terms of installation/setup, I do recommend to use the \"Tether\" app to setup. It's easier for most users. But if you have experience with extenders, you can always connect to the extender network and use a browser (i.e. your phone, iPad, or even a computer) to configure and setup the extender. For me, I used the Tether app to setup the Extender, and I used the Tether app to check status of the extender but the browser offers you more options in settings (i.e. changing wifi passwords - you cannot do that with the Tether app). The instructions are all there in the piece of paper and it's not long so don't need to be scared, it's pretty easy. Just follow what it says. And basically you can just setup/configure using the Tether app but the app is 80 Mb so I might delete it and just connect to the extender and configure / monitor from a browser going forward (just need to save the URL on my browser)If you want to use the Tether to setup/configure this extender you will need (do it before you setup the extender):1. Create a d-link account (very easy, just need an email and create a password)2. Have a Password Handy for your Extender - make 1 up (You need to create a login password to your Extender - You don't want everyone to be able to connect to your Extender and mess things up right?) - you will still need this even if you don't use a Tether app to setup your extender.3. Have your WIFI password ready (the password of the WIFI connection that you want the extender to use). If you are connecting your extender to your router/modem directly with a cable, you do not need this but I think most people are trying to extender their WIFI connections wirelessly.Worth every penny imo, I got this on sale for $60 CDN + tax. . 5 Stars product. Good Luck and hope this extender will be the last one you need for years to come.",
                "reviewVotes": "64 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SUSANA GARCIA ESTEBAN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 10, 2023",
                "reviewTitle": "Muy buena elección",
                "reviewText": "Se instala fácil, recomiendo este repetidor,Buena elección",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SON EU",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 20, 2022",
                "reviewTitle": "NO VALE PARA NADA,EL VENDEDOR UN DESASTRE.NO LO RECOMIENDO PARA NADA",
                "reviewText": "-Ñ",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P. Prakash",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 30, 2019",
                "reviewTitle": "Superb product",
                "reviewText": "I bought this and found it to be amazing product. It is able to extend wifi range to my entire 4 bedroom apartment. The best part is that you can keep the same SSID, so no need to switch networks when you're away. It's also much cheaper than the typical mesh networking solutions so perfect for a mid - large size household",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kaz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 10, 2024",
                "reviewTitle": "easy-peasy",
                "reviewText": "easy-peasy to set up, good signal around the house and outside where the light bulb cameras are to be installed.Although I have to add that the signal is markedly impeded by the outside walls of the house (cinder blocks and bricks, looses almost 20dB when the RE550 and the 'client' (light bulb camera) are separated just by the wall. I guess it's been built with for modern 2x4 and wood panelled houses :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$69.75",
                "sellerName": "MVP Soft Store",
                "sellerRating": "4.5"
            }
        ]
    }
}