{
    "remaining_requests": 27286,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Extender-Repeater%EF%BC%8CCovers-Devices-Internet-Booster/dp/B0BRQJHC5Z",
    "body": {
        "name": "HIMALU 2024 Newest WiFi Extender/Repeater，Covers Up to 9860 Sq.ft and 60 Devices, Internet Booster - with Ethernet Port, Quick Setup, Home Wireless Signal Booster",
        "price": "$13.88",
        "originalPrice": "$17.67",
        "rawPrice": 13.88,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Extender-Repeater%EF%BC%8CCovers-Devices-Internet-Booster/dp/B0BRQJHC5Z",
        "soldBy": {
            "sellerID": "A3K6O76X9E0OKY",
            "name": "US-Aoke",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3K6O76X9E0OKY&asin=B0BRQJHC5Z&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31cVZdEQ ML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51fOoubBJhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/414oajT g3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4150SWGXN9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41N9aiccqHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WYPfPiiRL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: HIMALU",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=HIMALU"
        },
        "brand": "HIMALU",
        "merchantInfo": "US-Aoke",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 7343,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 13 hrs 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✅Extended wireless coverage - Boosts your WiFi Range and Connects up to 40 Devices such as Smartphones,Laptops, Tablets, Speakers, IP Cameras, IoT Devices, Alexa Devices and more.",
            "✅No WiFi Dead Zones & Bufferin - WiFi extender booster, engineered to expand your existing WiFi network. 360° coverage up to 4000 SQ FT.",
            "✅One touch connection - Press the WPS Button on routers then press WPS on Wifi Extender to make fast connection.",
            "✅Plug and Play - Simply plug WiFi repeater into any outlet, then click WPS button on the repeater and on your router, then you can move the WiFi repeater anywhere.",
            "✅Easy to Setup - Just press the WPS button on the WiFi extender and router, you can extend the wireless coverage within 8s. Or easy set up by smartphone. Smart signal lights help to find the best location for optimal WiFi coverage."
        ],
        "description": "Extended Coverage: Reach every corner of your home or office with a reliable WiFi signal, eliminating dead zones and ensuring a seamless online experience.High Device Capacity: Connect up to 60 devices simultaneously without compromising speed or performance. Ideal for smart homes with a multitude of devices.Ethernet Port: Enjoy the flexibility of both wireless and wired connections. The built-in Ethernet port allows you to establish a stable wired connection for devices like gaming consoles, smart TVs, or desktop computers.Quick Setup: The user-friendly setup process ensures a quick and easy installation, making it accessible for users of all technical levels.Home Wireless Signal Booster: Boost your existing WiFi signal for improved speed and coverage, providing a more reliable internet connection for all your online activities.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Repeaters",
                "link": "https://www.amazon.com/Repeaters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3015439011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3 x 3 x 3 inches"
            },
            {
                "name": "Item Weight",
                "value": "4.6 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0BRQJHC5Z"
            },
            {
                "name": "Item model number",
                "value": "R11"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 7,343 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5 in Repeaters"
            },
            {
                "name": "Date First Available",
                "value": "January 5, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "HIMALU"
            },
            {
                "name": "Brand",
                "value": "HIMALU"
            },
            {
                "name": "Data Transfer Rate",
                "value": "300 Megabits Per Second"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Special Feature",
                "value": "Alexa"
            },
            {
                "name": "Connector Type",
                "value": "RJ45"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ofbengal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVFTIS3PC5MSY7I3AE4D2TFPD5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVFFIJU66WGVL?ASIN=B0BRQJHC5Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Works very well, Easy Set Up, Great Price",
                "reviewText": "We live outside of town, not many options for internet, so we have a router that has to be in the corner of the back of the house. Problem was getting signal up to the front room and front porch where we spend a lot of time. Looked through so many extenders and found this gem. Price is amazing for this powerful little device. Setup took less than 5 minutes on my boyfriend’s phone. I took notes from the comments that made the setup easier (will share below). No lagging anywhere outside or inside the house now, strong signal, device leaves outlet open for another to still be used. Had to play around with the location of the extender, but got it in a great place that’s not too far from the router and doesn’t have to send the signal through too much to get to the front of the house. Highly recommend this extender.For setup and best function, here’s what helped me after reading other comments and from my experience with this extender so far:This extender gives you a second WiFi network. You have your original network and this one so they will have two different names.We’ll call the original Wi-Fi just “Router” and the extender “Extender” for further explanation, so pretend those are the names of your networks when you open any device like a phone or tablet or PC and connect to a Wi-Fi network available.You have Router already, that’s your main one, and you have a password for that usually. Before setting up this new device, you pick a name and password, so in this case, you picked Extender as your network name and for the password, I just used the same one as Router to make it easy. You will be asked for your SSID. Router is your SSID number as well, unless they want the original, which is located on the back of your actual router. Have your desired network name and password and current SSID available. (So instead of Extender, pick a name you want, and a password, have that ready)Follow the prompts on your phone or tablet or PC to set all the above up (the instructions are a bit roughly written, but easy to figure out what they’re trying to say)When you plug in the device, find a spot not too far from your original router while accounting for anything the router has to go through to get signal out that could interfere (a cement wall, two rooms, behind a couch in the corner, etc-all not very good places). We have a fairly strong signal from our original router to the front room, so we put it in there on the wall closest to the main router. We may have to move it to the hallway, but it works very well now so we think it’s a good spot. We did have it in the room behind the front room to be closer to the router, but going through another room and a cement outer wall made using the internet a tiny bit glitchy, but it still worked. You may have to play with where it goes depending on your house setup and where you need your signal, just don’t go too far from the main router.If you unplug the extender and plug it back in, it goes right back on, but if your devices are set up to default to your original network, you may have to go back into your devices and click back onto the extender network if that’s the one you want to use. To help with this, we kept all devices that worked fine on the original network on that network, like our game consoles and tv streaming devices, thermostat, etc, and only changed the ones we travel around the house with to the extender network, like our phones and tablets.So far those are the key things that made this extender worth every penny and more. We get to enjoy our porch now at night while we watch our shows on our tablet! Hope this helps anyone looking through the countless extenders out there!",
                "reviewVotes": "309 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dawn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE7FFUTL3UX4EUIWVDJ5JLRXYCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXAPVI55P5BTU?ASIN=B0BRQJHC5Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Great device for the money",
                "reviewText": "This wifi extender is a very nice unit. It is a sleek black unit, and I want to say it looks like a 4 X 4 square with antennas on either side of the box. The only problem that I had with the unit was the installation of the unit. The instructions do not explain the steps to get the unit connected to your modem for the one step installation. The instructions only show you what to do if the one step installation doesn't work. I finally called our cable company and they helped me. Once I knew how to connect it to my modem it was a piece of cake to install. One thing that we are not told anywhere in the instructions is the fact that once you get ready to install it you need to have the unit plugged in right by your modem when you connect it to the network because you need to press the WPS button on your modem and the extender at the same time so it can connect properly. Once I did that it was a breeze to install.It works great for us we live in an apartment that is half below ground and has concrete walls all through my apartment. My modem is in a horrible location but the extender has improved my internet connection and has helped a lot with the lag problem I had been having. It works great at extending through the concrete walls. I would definitely recommend this wifi extender to anyone looking to help your wifi get to the problem spots in your house. I would love to have the company give a better step by step installation for people who are not tech savvy it would have probably gone a lot smoother. But we love it and would buy it again.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike'sMuZik",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCCUYW6ACVHO2O6AFHOPIVKCDHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYANYBWV92JFU?ASIN=B0BRQJHC5Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Solid wifi extender for the price",
                "reviewText": "I was looking to replace a similar device that is a few years old I work from home so also nice to have the old one as a backup. Under $20 with an ethernet output just what I needed. My wifi router is pretty far from my bedroom with office space in between so this gives consistent good speed and helps make sure the whole house is covered. Setup could be more user friendly but if you program it before connecting to your network it sets up pretty quickly. Not sure I would trust it for gaming if you are trying to run multiple consoles / devices at once. For the price it does a good job",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel J. Prinzing",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEXBSMRX23MLTEKHY2U6HBIDERA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JQ3R4L51JIGX?ASIN=B0BRQJHC5Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars This One Works and is Easy to Set-Up!",
                "reviewText": "This is the third different WiFi extender that I have ordered from Amazon in about two weeks. The first two, both different manufacturers, did not work. Their WiFi signal did not show up on my WiFi menu. This one had clear instructions, which were totally different than the other two. I set it up in minutes and it works great. Before the extender, I was only getting about 5 meg from my router which could provide 25 meg if I was near it. It's satellite, so it isn't super fast. That's why I needed an extender. With this extender, I got 24 meg in the room where it was only 5 meg before the extender. By the way, I have used other WiFi extenders in other locations, so I know what I'm doing. I was able to easily return the other WiFi extenders for a refund from Amazon.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Travis W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM54P76SOXUHDCYFMF57KT5NY3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHPV2O09CX6R1?ASIN=B0BRQJHC5Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Good so far. Interesting device.",
                "reviewText": "So I think the best way to explain this device is it just increases the range of your wifi while giving it a slightly modified name. I mainly got it to have the ethernet port over wifi. It's like having an invisible ethernet cable running from the computer room down the stairs. And I know, it's a 300 mbps model but we have 15 mbps DSL haha! All of my IP addresses are the same still. I was confused at first from another review stating that it was its own network... I thought that meant I had to go through the IP address displayed on the unit to configure the network. Nope. Still the same address as our old AF wireless gateway. To me, once I understood that, it was extremely easy to setup. I reset the unit a couple times out of confusion to try and access its IP. That is only needed if you set it up on a desktop. Just go to whatever browser and enter it in.In my case, the last 4 characters of the mac address for the password were the same as the 4 characters of the wifi name. Once you sign into that, you can select and sign in to your wifi and it will set up its extension from that.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$13.88",
                "sellerName": "Everything and Anything,",
                "sellerRating": "4.5"
            },
            {
                "price": "$13.88",
                "sellerName": "Lelijian sports equipment",
                "sellerRating": "5"
            },
            {
                "price": "$13.88",
                "sellerName": "XTQQSM",
                "sellerRating": "5"
            }
        ]
    }
}