{
    "remaining_requests": 27177,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ARRIS-SURFboard-SBG6580-RB-DOCSIS-Router/dp/B00X4VBJC0",
    "body": {
        "name": "ARRIS SURFboard SBG6580-RB 8x4 DOCSIS 3.0 Cable Modem / N300+N300 Dual Band Wi-Fi Router - (ARRIS Renewed) - Black",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/ARRIS-SURFboard-SBG6580-RB-DOCSIS-Router/dp/B00X4VBJC0",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B01HJJ28CC"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41QJEQ-RzXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31RbD-S5KqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415M6G9OH3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JYkbTD9QL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 733,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "3 products in 1: Cable Modem, N600 Dual band WiFi and 4 Port Gigabit Router",
            "Requires cable internet service. Compatible with major U.S. Cable Providers like Xfinity, Spectrum, Cox, Suddenlink, Mediacom, etc. Not compatible with ATT, Verizon or CenturyLink.",
            "8 DOWNLOAD & 4 UPLOAD channels. Recommended for plans of 150 Mbps and below. Supports both IPv4 and IPv6",
            "N600 (2.4Ghz N300 + 5Ghz N300) Wi-Fi Router with 4 Gigabit Ethernet ports. Best for residential homes under 2,500 sq. ft. in moderate populations",
            "90 Day Warranty. ARRIS Certified Refurbished. US Technical support. ARRIS Certified Refurbished products will ALWAYS be branded ARRIS, Never Motorola! If you get Motorola branded product they are illegitimate, need to be returned to Seller and Reported to Amazon."
        ],
        "description": "High-speed Internet and Wireless N at your fingertips. The SURFboard SBG6580 Wi-Fi Cable Modem is 3 products in one device: DOCSIS 3.0 Cable Modem, Dual-Band 802.11n Wi-Fi Access Point and 4-port Gigabit Ethernet Router. Capable of download speeds up to 343 Mbps and Wi-Fi speeds up to 300 Mbps per band, the SBG6580 is an affordable, complete solution for your home network. And with built-in security you never have to worry. SURFboard. The Market Leader in modems.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Modems",
                "link": "https://www.amazon.com/Computer-Networking-Modems/b/ref=dp_bc_aui_C_4?ie=UTF8&node=284715"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Type",
                "value": "‎802.11n"
            },
            {
                "name": "Brand",
                "value": "ARRIS"
            },
            {
                "name": "Series",
                "value": "‎SBG6580-RB"
            },
            {
                "name": "Item model number",
                "value": "‎SBG6580-RB"
            },
            {
                "name": "Item Weight",
                "value": "‎2 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎1.97 x 6.77 x 6.58 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎1.97 x 6.77 x 6.58 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎ARRIS Solutions, Inc."
            },
            {
                "name": "ASIN",
                "value": "‎B00X4VBJC0"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎May 4, 2015"
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 733 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Internet service provider",
                "value": "spectrum, optimum, cox, xfinity"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Compatible Devices",
                "value": "Router"
            },
            {
                "name": "Total Ethernet Ports",
                "value": "4"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Saphy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH535OWKYDXZC6A755QBGEDIN4UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R280P0HM2ASOVT?ASIN=B00X4VBJC0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2017",
                "reviewTitle": "5.0 out of 5 stars EDITED REVIEW",
                "reviewText": "I wrote the below review but then found out this is not a hardware problem - just another TWC horrible service problem! Turns out that Time Warner Cable disables wifi capabilities on two-in-one modem & routers in some areas. Another reason to switch from TWC ugh.This modem/router is great and works well so far.-----------------------I almost never leave bad reviews but the Cable Modem, N600 WiFi Router is TERRIBLE. I followed all the directions and called TWC - everything was fine and the signal was strong. However the WiFi light was green for 30 seconds and before I could connect to it, turned off completely and will not work.I tried unplugging it for a few minutes, resetting it and calling for support (must pay $34 to ask questions over the phone!). Unfortunately, the window to return it has expired so I'm just out almost $50.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cleeg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGA4IN5R4AGXOE4DMYWUIQ36UF5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9TYP60F4IDWO?ASIN=B00X4VBJC0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2016",
                "reviewTitle": "5.0 out of 5 stars The ARRIS SBG6782-AC was easy to set up following the online manuals",
                "reviewText": "The ARRIS SBG6782-AC was easy to set up following the online manuals. TWC activated it by telephone. It works great and saves $15 monthly on modem and WiFi charges. The online manual helped with password setup and etc. The modem is set in the basement at one end of our house where the cable enters and two wired computers are. The WiFi works great in that area but we use a separate access point WiFi router at the central point of the house for the other end. We had it set up for the previous rented router also, due to the makeup of the house and distance. It is not likely any router would do better in this house. I picked the SBG6782-AC (certified refurbished) for the 4-Ethernet ports and it will allow for future speed upgrades.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Feldman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXALW3BEK3DRFEPCMDHTXDK6X2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTV8CI6ZZ2XXE?ASIN=B00X4VBJC0",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2015",
                "reviewTitle": "1.0 out of 5 stars Unless you love stress, frustration and headache, find another solution. This is garbage!",
                "reviewText": "Waste of time and money. I purchased this despite my friend's recommendation of getting a separate modem/router. I figured for $69.99 I would roll the dice. HUGE MISTAKE. Initially I spent about 25 minutes on the phone with Comcast to provision the router. For the first couple days everything was fine. Day 4 my internet connection completely dropped to the point that I had to call Comcast for tech support. 45 minutes into that call the tech discovered that my REFURBISHED modem/router was still linked to another Comcast customer's account. Because that customer was in a different region of the country, the tech couldn't move the modem from that account to mine so he had to submit a support ticket. He was EXTREMELY helpful and explained this process could take a couple days and he called me in the afternoon both days as we waited about 72 hours for the modem to be removed from the previous account and added to mine. He called me on that 3rd day to give me the good news that everything was 'resolved'. Sounds good, but that was just on Comcast's end.After a couple hours this unit started dropping WiFi signal with laptop, phones, ROKU, Amazon Fire TV Stick, iPads, everything. Maybe you could keep a signal with the modem/router for an hour or so but then you would see it reconnect. COMPLETE GARBAGE. Forget downloads, you will have network errors over and over as the modem/router drops signal repeatedly.KEEP IN MIND that ALL DOCSIS 3.0 modems are subject to ISP control of firmware. Depending on your service you may/may not have the most current firmware, it is all based on what your ISP sends to your modem, you have no contol. Buying a separate router and modem allows you to control the firmware on your router, which is essential for keeping your wifi signal up continuously.BOTTOM LINE: Sometimes you can put shampoo and conditioner in the same bottle and your new hybrid product works well. In this case, there is no amount of price savings that would justify the horrible quality of this combo unit.FWIW I bougth a Arris SB6141 Modem ARRIS SURFboard SB6141 DOCSIS 3.0 Cable Modem - Retail Packaging - Black with an ASUS RT-AC68R router ASUS (RT-AC68R) Wireless-AC1900 Dual-Band Gigabit Router . Although it was a clean $100 more than what I spent initially on the SBG6580, I got both refurbished on Amazon and have had smooth sailing, a sharp contrast to the dreadful SBG6580. BUYER BEWARE!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maggie J. Hurley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVYF26N3XXDESQSUBNYROTFUYSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27T3II1AO7X25?ASIN=B00X4VBJC0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2016",
                "reviewTitle": "4.0 out of 5 stars I bought the refurbished model to save even more money and am quite pleased with my purchase",
                "reviewText": "I got this because my cable company wanted to charge me a lot more for a lesser version. I bought the refurbished model to save even more money and am quite pleased with my purchase. It was an easy set up and so far it is working great. My cable company less so but the router/wifi works perfectly. The cable guy said it probably wouldn’t transmit throughout my entire apartment (about 850 sq ft) but it does! I get signal in every part of my home and even part of the way down the elevator when I leave! So it definitely has great signal strength. I also like that it allows for up to 10 devises. 5 on a stronger faster frequency and 5 on a slower one. With so many devices now-a-days it’s great to be able to connect all of them at once. I’ve actually hard wire connected my smart TV & computer as well so I’m not using up wifi connectivity for those devises. It has plenty of ports so that is a nice feature too. Overall I am very pleased and as a non-tech-savy person I am really happy with this purchase especially for the price! My only complaint would be that the password is crazy long. There might be some way to change that but like I said, I'm not really tech savy lol.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Simeon Hein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQNJMMPHAL7SV25Q7KXYV76M4BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KJQXLAVKYT1T?ASIN=B00X4VBJC0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 27, 2018",
                "reviewTitle": "5.0 out of 5 stars Works well, no problems.",
                "reviewText": "This worked perfectly for me. I didn't call Xfinity, just followed the included instructions. It didn't work the first few times for some reason. But after a few times, the modem found the Xfinity site and the two connected. This unit uses less than ten watts, closer to seven or eight watts, so it is very power efficient. So far everything is fine. Good upload and download speeds. The green power light on the AC adapter is quite bright so I put tape over it, no need for an extra night light. (Dr. Simeon Hein is the author of Black Swan Ghosts: A sociologist encounters witnesses to unexplained aerial craft, their occupants, and other elements of the multiverse and Opening Minds: A Journey of Extraordinary Encounters, Crop Circles, and Resonance )",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}