{
    "remaining_requests": 27274,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Netgear-Nighthawk-Whole-System-3-Pack/dp/B086ZN5R6P",
    "body": {
        "name": "Netgear Nighthawk Whole Home Mesh WiFi 6 System, 3-Pack (MK63-100NAS)",
        "price": "$148.49",
        "originalPrice": "$157.99",
        "rawPrice": 148.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Netgear-Nighthawk-Whole-System-3-Pack/dp/B086ZN5R6P",
        "soldBy": {
            "sellerID": "A1SZ59IS0F98XI",
            "name": "A&J Variety Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1SZ59IS0F98XI&asin=B086ZN5R6P&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/3184N68-2bL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21PqkQLUdTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qMiGItUJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ev1Aq5LxL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the NETGEAR Store",
            "link": "https://www.amazon.com/stores/NETGEAR/page/0BAEE44C-8BBE-4F72-9CF9-3CFB6CFB92F1?ref_=ast_bln"
        },
        "brand": "NETGEAR",
        "merchantInfo": "Sold by PRODUCTS 360 and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1726,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Friday, February 16. Order within 3 hrs 50 mins",
            "FREE delivery Thursday, February 22",
            "Or fastest delivery Friday, February 16. Order within 13 hrs 50 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Faster Speed For Your Needs Up to 1.8Gbps for smooth HD streaming, improved gaming, uninterrupted video calls, and no more waiting for content on smart phones, computers and tablets. Capacity Beyond Belief MK63 with next generation WiFi 6 technology has 1.5X more capacity than previous WiFi, delivering faster speeds to your 25 devices. More Efficiency, Less Congestion Say goodbye to slow connections when a houseful of devices are sharing WiFi. New OFDMA technology makes sharing WiFi bandwidth much more efficient",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Whole Home & Mesh Wi-Fi Systems",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17935294011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "11 x 7 x 6 inches"
            },
            {
                "name": "Item Weight",
                "value": "4.11 pounds"
            },
            {
                "name": "ASIN",
                "value": "B086ZN5R6P"
            },
            {
                "name": "Item model number",
                "value": "MK63-100NAS"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,726 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,224 in Electronics (See Top 100 in Electronics) #49 in Whole Home & Mesh Wi-Fi Systems"
            },
            {
                "name": "Date First Available",
                "value": "April 11, 2020"
            },
            {
                "name": "Manufacturer",
                "value": "Netgear"
            },
            {
                "name": "Brand",
                "value": "NETGEAR"
            },
            {
                "name": "Special Feature",
                "value": "WPS"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer, Tablet, Smartphone"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gaming"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi Fi"
            },
            {
                "name": "Number of Ports",
                "value": "3"
            },
            {
                "name": "Control Method",
                "value": "App"
            },
            {
                "name": "Data Transfer Rate",
                "value": "1.8 Gigabits Per Second"
            },
            {
                "name": "Voltage",
                "value": "100240 Volts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Netgear Nighthawk Whole Home Mesh WiFi 6 System, 3-Pack Overview Enjoy advanced whole home WiFi designed to deliver smooth video streaming and fast online gaming to more devices at the same time. Using the latest WiFi 6 technology, it’s ideal for medium to large homes up to 4,500 sq.ft. and internet speeds over 100Mbps.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/f96ea3f0-8576-409a-9999-4f8372a65da2.__CR118,62,1002,620_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Features Advance Whole Home WiFi Eliminate WiFi dead zones and buffering with satellites placed throughout your home for more reliable WiFi coverage in every room. Latest WiFi Technology With the latest WiFi 6 technology, improve your network with the fastest speeds, more reliable connections, and greater connected capacity. Super Fast WiFi Combined WiFi speeds up to 1.8Gbps lets your family enjoy better streaming, faster gaming, and supports your smart home needs. Mesh WiFi Mesh WiFi delivers a strong connection for up to 4,500 sq. ft., from the front door to the backyard and everywhere in between.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/f96ea3f0-8576-409a-9999-4f8372a65da2.__CR118,62,1002,620_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/321a450e-7cf4-467a-91db-84ed234d8d06.__CR107,0,596,596_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/a3966fee-1e60-4df5-b7d4-94706d6f4299.__CR114,603,646,646_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Elizabeth H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEE7BUO3WNU72YHUDO4HK3O6AI3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VCZA1IPV54YU?ASIN=B086ZN5R6P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy set up, Fantastic coverage.",
                "reviewText": "I have Xfinity, so I did have to purchase a separate (xfinity approved) modem. That said this mesh network works fantastic. We have no drops in coverage or signal and am clocking 80-140mbps over what I pay for. I’m in a 2 story 2500sqft home. Overall it took me maybe 10 minutes to setup the router and both satellites. I like the app and some of the features for customization. It’s also easy to log into the router for more advanced settings.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jazzy J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6UU6GM6CM3MGV5RCPHM6JMZKXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X2U6Y0VJCODI?ASIN=B086ZN5R6P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "5.0 out of 5 stars It really works and extends wifi distance",
                "reviewText": "The cable man who came to my home recommended this exact one. I have \"dead zones\" in my house that the cable company could not fix. After installing this system, the wifi works great in the areas it didnt work before. It was easy to install and I'm not very tech savy. I just followed the instructions on the app. I keep one downstairs by my wifi router and the other two upstairs. It really extends the distance of my Wi-Fi. Internet works great now throughout the whole house and everyone is pleased with it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L. Bruch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGO33IO2BNRVXO2BGEIYBMGIREWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30TZJIM25656C?ASIN=B086ZN5R6P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Whole house coverage",
                "reviewText": "My Verizon Fios was upgraded to their highest speed. After that upgrade everything stopped working. Speed was slower, connections were lost, and Verizon had me on hold for HOURS for several days and attempts. I gave up. My neighbor recommended night hawk. It improved everything back to 100 percent. Worth the money!!!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "titanhusker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIZ27MYUJYDZLSZWSHZLFOHTN7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EP4XX6SHDPFE?ASIN=B086ZN5R6P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 22, 2021",
                "reviewTitle": "4.0 out of 5 stars Product with lots of potential, yet can be aggravating for the typical end-user",
                "reviewText": "I have been using this product for over six months, experiencing different results from time to time. I have seen it perform exceptionally well and total failure. The use of this product might depend upon the complexity of your network or what you intend to do with it. As a standalone, it probably functions pretty well for its intended purpose. Out of the box, the installation is fairly straightforward. If you have a smartphone, it will walk even the most non-tech savvy individual how to get it functioning. Advanced or power users such as myself, tend to see the setup as very vanilla or basic. One thing that should be highlighted bar none in the setup and is worthy to note is that each satellite will operate wirelessly independent of the router, however, it will operate exceptionally better if hardwired for ethernet backhaul. When I originally purchased this unit, the problems were fairly intense with disconnections almost all of the time. The satellites would not stay synced. I strongly considered returning the product and getting three independent routers to do the same thing. I read somewhere that there was going to be a firmware update that would correct these issues. Within thirty or so days, the firmware patch was released correcting the vast majority of issues. Over the course of six months, there have been a few updates, nothing as major as the first one. I did discover through experimenting, that while in the bedroom I could pull a max speed of 80mbps off a gig connection over wifi, but when I attached an ethernet cable to the back of the satellite from the router, the speed increased to 700mbps. In the manual, it will tell you that you can connect one satellite for wired ethernet backhaul. You can connect as many as you want, provided you use a network switch from the main router MR60 to the satellite's MS60s. In my particular setup, I needed coverage in my master bedroom and a playroom. Since both of these rooms are on the first floor and my main router (RAX120) is on the second floor, we had sporadic coverage at best. I have been utilizing the MR60 as a secondary router (by turning off the DHCP and statically assigning the MR60, MS60s their own ips) and sharing the same SSID and Password. This way the internet is fluid to work no matter what room I am in or what device I am on. These little units work well for the most part in this configuration, however, from time to time, the connection acts stagnant requiring a reboot. At times I can not access the MR60 page over wifi, but I can over ethernet. Sometimes it will go for months with no issue and other times it will just give issue after issue. In one of the latest firmware updates, they allow you to run the device as an access point, which is the proper way to do it, however, through further testing my connection speed drops by 25%, utilizing it this way versus using it as a secondary router. I would like to see the firmware steadily be improved for more reliability. My ratings are as follows, 4 stars over all for the product as it is not the worst and offers a lot for a package deal in comparison to much more expensive setups. 4 stars on the signal, when it works it works really good, when it doesn't it isn't good at all, improved firmware could make this even better. 3 stars on tech support, as I don't use tech support, most of the people don't speak well or listen to the problems the user is facing, partly because they simply do not know the product they are representing, 3 stars for the mobile app, it is good and looks appealing, however, I simply use the GUI because I can not access both the RAX120 and MR60 on the app at the same time and I don't use the app. The GUI is the only way to support both routers at the same time",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brookelyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3Z5CY5VRXY4NCTFT5REBZVN4AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V73D0T5W11JD?ASIN=B086ZN5R6P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Better then eero (my opinion)",
                "reviewText": "These are pushing wifi much further and faster then my eero6 mesh. Super happy. Can't ever go wrong with the Nighthawks. My rings cameras outside now have all signal bars. Where as the eero was only hitting half or less signal bars. Stream contents loads much faster too. I only compare bc I know the eeros are good too. But for my house Nighthawk is much better.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donovan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUU53RST47MG32UKIFXLVQN2VSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O2IY9VVKJ7D?ASIN=B086ZN5R6P",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2021",
                "reviewTitle": "1.0 out of 5 stars Run away. Don’t waste your time.",
                "reviewText": "Heed the reviews. WiFi drops devices constantly. Zoom meetings disconnect. One spot in my home with full wifi signal strength will not connect to the internet- it seems the mesh routers can’t decide which to use and give up. And, yes, I stayed on top of updates. During a firmware update, one of my satellites was bricked and totally unresponsive. Customer support is nonexistent to obtain a warranty repair. Tried to load the firmware directly to the satellite as some users suggested on forums but with no success. The steps seem outdated for windows 10. Tried the support website and could never figure out how to contact anyone. I’ve read on forums that for have to pay $50 or whatever for phone tech support. I’m well within the 1 year manufacturer warranty so why should I pay for support? I’m out $275 and months of dealing with this nonsense. I ordered a different brand more pricey mesh system. We’ll see how that goes…Update: I’m happy I tried another brand and forked up a little more money. I can’t name them or Amazon will delete my review. But I can tell you that my SYStem stays LINKed to the internet. Range is better and the mobile app/setup is worlds better. So upset I lost almost $300 and months of my life with this Netgear junk. By the way, Betgear also charges to remotely access your router and you get an unusable scaled down bitdefender vpn as well as unreliable malicious website warnings with the service. I turned off all the “safety features” because they constantly blocked my email accounts on my iPhone as well as non-malicious website.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Rubin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJDZIP4MG67JVVS53BH6UAODIIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R3DA7PYAKIPE?ASIN=B086ZN5R6P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Mesh System",
                "reviewText": "Very easy to set up. Works great from the moment go. Netgear makes great products.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hollie Slaton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEESQI4RBGMNQFGVCY7LJPVWWHGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2N0DY4LV5T4XU?ASIN=B086ZN5R6P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Great system!",
                "reviewText": "Couldn’t go without this now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Domingo Torres",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 8, 2021",
                "reviewTitle": "Excelente un poco caro",
                "reviewText": "Vale cada centavoCubre toda la casa, fácil de usar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "miguel salgado gadsky",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 28, 2020",
                "reviewTitle": "Buen producto",
                "reviewText": "Una casa de tres niveles y en cada uno ya existe señal y velocidad constante, aparte estéticamente son mejores que un módem.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerardo Melgoza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 13, 2020",
                "reviewTitle": "Cumple con las características",
                "reviewText": "facil de instalar y configurar",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alfredo Colin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 13, 2021",
                "reviewTitle": "Muy bueno, no excelente",
                "reviewText": "Un gran producto. Lo compré principalmente porque la diferencia entre los Mbps que recibía en mi módem (cerca de 200 Mbps) y lo que llegaba en el resto del departamento (90 Mbps) hacía evidente el gran desperdicio de velocidad que pagaba respecto a la que experimentaba. También tenía un área en la que señal prácticamente no llegaba, aún con extensores Netgear Ac1200. Compré entonces un router Huawei Wifi 6 y la verdad bueno. Recibía casi los 200 Mbps pero a los 5 metros de nuevo se caía la velocidad. Finalmente me decidí por estos Nighthawk, por ser de malla para cubrir más area, ser Wifi 6, estar a buen precio (cuando lo compré, costaba 2 mil pesos más económico que la versión Mk62 que sólo trae dos equipos, este trae tres) y ser de marca Netgear que en el pasado me ha demostrado ser de calidad. El resultado fue muy bueno. Este sistema de malla me entrega ya 195 Mbps en cualquier lugar del depa y ya no hay zona sin señal. El único inconveniente para mí fue que, resulta que este sistema te deja ambas redes 2.4 y 5 en una misma, con el mismo nombre y clave y no es posible separarlas. Esto fue un problema puesto que estoy automatizando mi depa con muuuuchos smart swirches, smart plugs y smart lights, y dos Echo de Amazon (Alexa), pero varios dispositivos, sobre todo los smart plugs, sólo funcionan con red 2.4. El resultado es que pocos plugs funcionaron. ¿Que tuve que hacer? Dejar todavía funcionando uno de mis extensores Netgear AC1200 a donde se conectaron todos mis dispositivos smart. La historia acabó bien pero, ¿qué necedad de Netgear de no dar la opción de diferenciar ambas redes, como cualquier otro sistema?",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "orlando",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 28, 2020",
                "reviewTitle": "Mala conexión 2.5",
                "reviewText": "Buena velocidad pero no compensa las caídas de dispositivos en la red 2.4",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$149.99",
                "sellerName": "Woot",
                "sellerRating": "4.5"
            },
            {
                "price": "$160.00",
                "sellerName": "Bioink",
                "sellerRating": "5"
            },
            {
                "price": "$161.99",
                "sellerName": "MeimeiGo",
                "sellerRating": "3.5"
            }
        ]
    }
}