{
    "remaining_requests": 27401,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TP-Link-WiFi-AX3000-Smart-Router/dp/B09G5W9R6R",
    "body": {
        "name": "TP-Link AX3000 WiFi 6 Router – 802.11ax Wireless Router, Gigabit, Dual Band Internet Router, VPN Router, OneMesh Compatible (Archer AX55)",
        "price": "$94.99",
        "originalPrice": "$129.99",
        "rawPrice": 94.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TP-Link-WiFi-AX3000-Smart-Router/dp/B09G5W9R6R",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B75X65DW"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BTD7V93F",
                "variationName": "Style",
                "variationValue": "AX3000 w/ 2.5Gbps Port(Newer)",
                "price": "$129.99",
                "variationImageURL": ""
            },
            {
                "asin": "B09G5W9R6R",
                "variationName": "Style",
                "variationValue": "AX3000, WiFi 6 Router",
                "price": "$94.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41k2nQctcOL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41lM-z1yNhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fQji2keuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41CqwnnXJQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41U2sc90JnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41IjFMshNNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41eYslOEhCL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1VvzRujCJL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91ICYvZqQxL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the TP-Link Store",
            "link": "https://www.amazon.com/stores/TP-Link/page/A8C9009F-3398-4DE2-96E5-DAF7BBD28401?ref_=ast_bln"
        },
        "brand": "TP-Link",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 5969,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 12 hrs 12 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Next-Gen Gigabit Wi-Fi 6 Speeds: 2402 Mbps on 5 GHz and 574 Mbps on 2.4 GHz bands ensure smoother streaming and faster downloads; support VPN server and VPN client¹",
            "A More Responsive Experience: Enjoy smooth gaming, video streaming, and live feeds simultaneously. OFDMA makes your Wi-Fi stronger by allowing multiple clients to share one band at the same time, cutting latency and jitter.²",
            "Expanded Wi-Fi Coverage: 4 high-gain external antennas and Beamforming technology combine to extend strong, reliable, Wi-Fi throughout your home.",
            "Improved Battery Life: Target Wake Time helps your devices to communicate efficiently while consuming less power.",
            "Improved Cooling Design: No heat ups, no throttles. A larger heat sink and redefined case design cools the WiFi 6 system and enables your network to stay at top speeds in more versatile environments.",
            "Compatible with Alexa: Control your router via voice commands and make your life smarter and easier with Amazon Alexa",
            "TP-Link HomeShield - TP-Link's premium security service keeps your home network safe with cutting-edge network and IoT protection. Free features: 1. Basic Network Security including Security Scan and IoT Device Identification 2. Basic Parental Controls 3. Quality of Service 4. Basic Weekly/Monthly Reports. Visit TP-Link website for more information.",
            "Works with all internet service providers such as AT&T, Verizon, Xfinity, Spectrum, RCN, Cox, CenturyLink, Frontier, and more (A modem is required for most internet service providers)."
        ],
        "description": "The product is multiple voltage compatible, that voltage arrange is 100-240V.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Routers",
                "link": "https://www.amazon.com/Routers-Networking-Online-Communication-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=300189"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "12.99 x 9.45 x 2.87 inches"
            },
            {
                "name": "Item Weight",
                "value": "1 pounds"
            },
            {
                "name": "ASIN",
                "value": "B09G5W9R6R"
            },
            {
                "name": "Item model number",
                "value": "Archer AX55"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 5,969 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#252 in Electronics (See Top 100 in Electronics) #2 in Computer Routers"
            },
            {
                "name": "Date First Available",
                "value": "October 11, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "TP-Link"
            },
            {
                "name": "Country of Origin",
                "value": "Vietnam"
            },
            {
                "name": "Brand",
                "value": "TP-Link"
            },
            {
                "name": "Model Name",
                "value": "Archer AX55"
            },
            {
                "name": "Special Feature",
                "value": "QoS, Guest Mode, WPS, Internet Security, Remote Access"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "802.11n, 802.11ax, 802.11b, 802.11ac, 802.11g"
            },
            {
                "name": "Compatible Devices",
                "value": "Gaming Console, Security Camera, Personal Computer, Tablet, Smart Television, Smartphone"
            },
            {
                "name": "Frequency",
                "value": "5 GHz"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gaming, Home"
            },
            {
                "name": "Included Components",
                "value": "Wi-Fi Router Archer AX55, Power Adapter, RJ45 Ethernet Cable, Quick Installation Guide"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Wi-Fi 6 Upgrades Everything The latest generation of Wi-Fi technology brings faster speeds, less lag, and higher capacity, enabling more simultaneous connections on your home network.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df1bb29d-d84e-48e7-8bf3-cc30d6bbd388.__CR0,0,800,600_PT0_SX800_V1___.png"
                ]
            },
            {
                "media_text": "More Responsive Experiences Less Loading Wheels Enjoy smooth gaming, video streaming, and live feed simultaneously. OFDMA makes your Wi-Fi stronger by allowing multiple clients to share one band at the same time, which cuts latency and jittering.²",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dccaead2-0c82-4a95-93ab-879862199bc3.__CR0,0,800,600_PT0_SX800_V1___.png"
                ]
            },
            {
                "media_text": "Wi-Fi Coverage Throughout Your Home 4 high-performance external antennas boost Wi-Fi signals throughout your home. Beamforming technology detects devices and concentrates wireless signal strength towards them, especially for previously hard to reach outlets.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3f40de4-452c-4059-92ca-bb2d7abce55d.__CR0,0,800,600_PT0_SX800_V1___.png"
                ]
            },
            {
                "media_text": "TP-Link HomeShield: Advanced Security For Your Everyday Devices",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/00b1d997-28d8-4248-b7b2-c00a015be992.__CR0,0,1464,600_PT0_SX1464_V1___.png"
                ]
            },
            {
                "media_text": "OneMesh Compatible Supports OneMesh to form seamless whole-home coverage, preventing drops and lag when moving between signals.(OneMesh WiFi Extender is needed) Improved Cooling Design No heat ups, no throttles. A larger heat sink and refined case design cool the WiFi 6 system and enable your network to stay at top speed. Advanced WPA3 Security The latest Wi-Fi security protocol, WPA3, brings new capabilities to improve cybersecurity in personal networks.⁴ Easy Setup and Use Set up and manage your Archer router in minutes with the intuitive Tether App with guided setup instructions.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a5800cfb-6ef6-4a2b-9a5c-c5cf029c8cf0.__CR0,0,300,225_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed30c50c-ff78-437d-883a-dec3cf3838ab.__CR0,0,300,225_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6438f5fa-fc18-4330-a8d3-bf6a43d768a3.__CR0,0,300,225_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7b23f5f9-ace1-4efa-a390-b343571b5ba9.__CR0,0,300,225_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07b578ef-937b-4498-85dc-ad367989eb49.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aafacd1b-f3bc-450e-b6b6-6d2784b8e35c.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df1bb29d-d84e-48e7-8bf3-cc30d6bbd388.__CR0,0,800,600_PT0_SX800_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dccaead2-0c82-4a95-93ab-879862199bc3.__CR0,0,800,600_PT0_SX800_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3f40de4-452c-4059-92ca-bb2d7abce55d.__CR0,0,800,600_PT0_SX800_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/00b1d997-28d8-4248-b7b2-c00a015be992.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a5800cfb-6ef6-4a2b-9a5c-c5cf029c8cf0.__CR0,0,300,225_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed30c50c-ff78-437d-883a-dec3cf3838ab.__CR0,0,300,225_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6438f5fa-fc18-4330-a8d3-bf6a43d768a3.__CR0,0,300,225_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7b23f5f9-ace1-4efa-a390-b343571b5ba9.__CR0,0,300,225_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Steven Sabin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZSCTTBLNDXMJDKDNZ7RXJOJIKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JJ01MKMXXXE2?ASIN=B09G5W9R6R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Just works and delivers the full 500 Mbit/s I'm paying for",
                "reviewText": "I bought a Deco X55 back in July 2022 after my 11-year-old Apple AirPort Extreme / Time Capsule just couldn't keep up with all my connected devices (now numbering 27 including IoT lights, etc).Although I liked the Deco, it was a bit harder to set up than it should have been. I will separately comment on that product instead of including it here.Suffice to say that I could never achieve the full 500 Mbit/s speeds I was paying for and instead would get in the mid 400's if I was lucky and often it fell to the high 300's. I put devices that didn't need the bandwidth, such as IoT light switches, thermostats, etc. on the 2.4 Ghz band. But still, even with my computer 4 feet from the Deco, I could never hit 500. The forcing function for me was the Deco did not have a USB port and I wanted to hook my 6TB external hard drive to the router so it would be accessible by my iPad and two computers \"over the air\".The first thing I noticed was how easy it was to set up. I used the tether app and it did not skip a beat. Very intuitive and it just worked, first time, out of the box when I followed the guidance of the app on my phone.The second thing I noticed was the speed. Routinely getting 520-540 Mbit/s speeds from the devices where I need it, like Apple TV, iPad, and my laptops.The third thing I noticed was the signal strength. I guess that is to be expected since it has 4 antennas instead of the hidden one in the Deco's little white cylinder that is aesthetically pleasing but just simply not as powerful.The Archer AX3000 also has two processors so whether it is signal strength, processing power, or a combination of the two, every device in my house that needs to have a high-speed connection has it - no matter where I am at within the 1800 sq. ft. structure.I place the router on top of a tall bookshelf and I like that I can see the LEDs without standing on a step stool. The Deco didn't permit that because of where the LED was located; I had to stand on the couch to see if the light was red or green.Both the Deco and the Archer AX3000 were good at keeping devices connected without dropping them and with staying connected to my cable modem. My old Apple AirPort would drop its connection to the modem about 3-4 times per week, and that is what prompted me to start looking for something more reliable. Also, the Time Capsure (2TB hard drive) was starting to faintly squeal on occasion, and I think that was the fan. It tended to get very hot and it was clear to me that it was being taxed too heavily with so many devices. It started it's life in 2012 with only 5 connections (iMac, 2 phones, 1 iPad, 1 printer) and this gradually increased to 5X as many devices. I am today at 27 and counting and the Archer AX3000 has no trouble keeping up.I like the Tether app and the ability to give names to my connected devices, to see what band they are on, and to assign icons.Connecting my external hard drive was also pretty straightforward and most of my issues were in understanding how to enable Win 11 and my ipad to use SMB and FTP to access the HDD - not any failing of the router.The price was reasonable ($135) and I could not be happier with the upgrade. Now, to put my Deco X55 on eBay and find it a new home. It was a good little device for the 6 months I had it, but my home is small enough that it doesn't need a mesh device and satellites, and now that I have compared it to the Archer AX3000 it is clear that the Deco cannot match the performance. I pay for 500 Mbit/s through my ISP (Spectrum) and I am finally getting not only the full 100%, but actually about 110% in most cases.",
                "reviewVotes": "42 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "trs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSPMUJDSWB6B2AL5645KK3JDFZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM0Z8J6O3ZICD?ASIN=B09G5W9R6R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Solid performer",
                "reviewText": "[updated]I updated from a TP-Link Archer C7. I have an Arris SB8200 modem. Here are a few notes.The AX55 signal strength seems a little better, especially in the 5 GHz band. It also adds 802.11ax and WPA3 security as well as \"Smart Connect\" which allows you to combine 2.4G and 5G bands under a single SSID and have the router decide which to use with each client. You could just give the separate bands the same SSID with any router. In that case each client would decide which band to use. The router login no longer uses a username, only a password.I have now tried \"Smart Connect\" with 2 TP-Link routers in 2 different houses and I am not impressed. On both I eventually had to separate the 2 bands. It was especially dysfunctional on mobile devices (phones, laptops, etc.). It doesn't seem to switch bands very easily as you move around. Even stationarydevices seem to bounce inexplicably between the two bands, which can have very different signal strengths.The wi-fi encryption settings can be a problem depending on your equipment. The options are:NoneWPA2-PSK[AES]WPA2-PSK[AES]+WPA-PSK[TKIP]WPA3-PersonalWPA3-Personal+WPA2-PSK[AES]WPA2-EnterpriseWPA/WPA2-EnterpriseI wouldn't touch either WPA or TKIP. Previously I used only WPA2-PSK[AES]. I would have liked to have used WPA3-Personal+WPA2-PSK[AES] here, but I have an older 2.4G printer with WPA/WPA2[AES or TKIP]. It would not connect unless the router was set to WPA2-PSK[AES] or WPA2-PSK[AES]+WPA-PSK[TKIP]. In the end, I set the 2.4G band to WPA2 (only) and the 5G band to WPA2+WPA3.Configuration and Installation-----------------------------------Installing the router was pretty straightforward. I turned off wi-fi on my laptop, wired it (DHCP) to one of the router's client ports, browsed to 192.168.0.1, and logged in (password is on the bottom of the router). Alternatively, you could leave your wi-fi enabled and connect to the router's default SSID, also on the bottom. Doing it over wi-fi is just a bit more risky.I configured it entirely through the web interface using the Advanced menus. I changed the password and IPv4 address and left it with a temporary SSID while walking through all the other settings. After that was done, I shut down my old router, changed the temporary SSID and passcode on the new router to the permanent ones, shut down the new router, and connected it to my modem.I have not as yet found anything I can do with the Tether app that I can't do, and more easily, with the web interface.The router would not connect to the internet when I powered it on until I remembered that the modem has to be rebooted to pick up the router's MAC address. It won't connect to a new router until then. I powered off both, powered up the modem, waited until it was fully up, and then powered up the router. It connected immediately and has been running fine since then.Once connected, I reviewed the internet (IPv4 and IPv6) status and settings. For Comcast, at least in this area, the IPv6 WAN connection type is Dynamic IP(SLAAC/DHCPv6) with DHCPv6 and prefix delegation selected. The LAN type is SLAAC+Stateless DHCP. I prefer to use Google's public DNS servers (8.8.8.8, 8.8.4.4, 2001:4860:4860::8888, and 2001:4860:4860::8844), I've set those to override the Comcast-provided defaults.Performance---------------I have 400 Mbps Comcast service with an Arris SB8200 modem. The modem indicates DOCSIS 3.1 service on the downstream side, but not on the upstream side. My laptop wireless NIC is an Intel AC7265 dual-band b/g/n/ac adapter.On a wired connection to the router, I get download speeds of 475+ Mbps. 480 would be the most I would expect given Comcast's typical practice of over-provisioning by 20%.On 5G wi-fi with 40 MHz channels, I get 475 Mbps next to the router and about 20' away in the same room. I get 355 Mbps in the next room, which is 73% faster than with the Archer C7.On 2.4G wi-fi with 20 MHz channels, I get 100 Mbs in the next room and 45 Mbs 2 floors up on the opposite side of the house. That's 25% and 80% faster than with my Archer C7.Those who have unexpectedly slow wi-fi performance and who have \"Smart Connect\" enabled may be connected via the 2.4 GHz band without realizing it. Another reason not to use that feature.I live in a crowded wi-fi neighborhood with people who think it's a good idea to use 40 or 80 MHzchannels in the 2.4 GHz band. Don't do that. It makes all your neighbors' performance worse anddoesn't really help yours.",
                "reviewVotes": "58 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Snoopy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZJ7ZZYTWXUEB6KDH5JRHTJMLLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T0D5LQCD83LZ?ASIN=B09G5W9R6R",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "4.0 out of 5 stars Upgrading from previous TP-Link was far too time consuming and tedious.",
                "reviewText": "The router itself is fine. Good range and consistent performance and speeds. USB 3.0 port increases Time Machine backup speed. However, the TP-Link backup file of my previous AX21 could not be used to configure the AX55 using the web based app. I thought those files would have been interchangeable. This was a HUGE disappointment as I was hoping that configuration could have gone MUCH faster than it did. In the Tether App, the basic setup was fine. But then I had to go through all 21 devices on my network and identify them by their MAC address, rename each of them to what they had been named in the AX21version of the app, and then reassign icons. Huge waste of time that could have been avoided if the backup files were compatible.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 12, 2024",
                "reviewTitle": "AX 55 - bom roteador",
                "reviewText": "AX 55 - bom roteador",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JEK",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 26, 2023",
                "reviewTitle": "Mejor de lo esperado",
                "reviewText": "Canal de 160hz, el alcance es mayor de lo esperado y supera por mucho a los otros router de prueba y de los vecinos. La velocidad es la esperada. Y la administración es fácil con la app",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Serge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 6, 2024",
                "reviewTitle": "Very pleased",
                "reviewText": "Easy to set up, It’s fast, reliable and has a good range.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sergio E F Reis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 16, 2023",
                "reviewTitle": "Muito fácil de configurar",
                "reviewText": "Facilidade de configuração, velocidadeVendedor rapido",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 31, 2023",
                "reviewTitle": "Excelente router",
                "reviewText": "Está súper bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}