{
    "remaining_requests": 27061,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/802-11ac-Wireless-Antenna-Magnetic-Desktop/dp/B0CM6BTNZX",
    "body": {
        "name": "Dual Band 2.4GHz 5GHz 5.8Ghz RP-SMA Gaming WiFi 6E 802.11ac/ax Wireless Antenna with Magnetic Base for Intel AX201 AX200 PCIe NGFF WiFi USB Card PC Desktop PCIe WiFi Card Wireless Network Router",
        "price": "$16.99",
        "originalPrice": "",
        "rawPrice": 16.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/802-11ac-Wireless-Antenna-Magnetic-Desktop/dp/B0CM6BTNZX",
        "soldBy": {
            "sellerID": "A3G30AE25B9WYV",
            "name": "TREADALT-TEC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3G30AE25B9WYV&asin=B0CM6BTNZX&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CVBKTGVB"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CM6BTNZX",
                "variationName": "Style",
                "variationValue": "Magnetic Base",
                "price": "$16.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CL4LBDXM",
                "variationName": "Style",
                "variationValue": "RP-SMA Male",
                "price": "$8.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CL4NGCQX",
                "variationName": "Style",
                "variationValue": "SMA-Male",
                "price": "$8.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31lR20JjM6L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/414bxfGejdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41oSjSFpjcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31XwgNEnB2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Y-WJa pjL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: TREADALT-TEC",
            "link": "https://www.amazon.com/TREADALT-TEC/b/ref=bl_dp_s_web_38749564011?ie=UTF8&node=38749564011&field-lbr_brands_browse-bin=TREADALT-TEC"
        },
        "brand": "TREADALT-TEC",
        "merchantInfo": "TREADALT-TEC",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 22,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 12 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Application: wireless network router, PCI PCIe PC Desktop network card, built-in wifi motherboard, notebook PC desktop computer external USB network adapter, WLAN AP & Hotspot wireless range extender, security cameras",
            "Tri band WiFi: 2.4g(2400-2500MHz)/5g(5150-5850MHz)/6g(5900-7125MHz); Support 802.11 b/g/n/ac/ax/wifi 6/wifi 6e; Connector: RP-SMA Male",
            "Support Wi-Fi 6E: the new 6 GHz band can bring more bandwidth, faster speeds, lower latency and less interference; perfect for online gaming and streaming 4K/8K video Improve Signal Reception: Enhance the speed and stability of your Wi-Fi connection, ensuring no network drops even when using multiple devices simultaneously",
            "This antenna base is magnetic so you can put the stand anywhere with a surface that is iron, the magnetic base will allow it to stay firmly in the place you want. Improve Signal Strength: help WiFi devices to have a faster speed and stable connection, get no network drops when using multiple devices simultaneously",
            "Also, Compact for Gigabyte for ASUS ASRock for MSI motherboard 7. Support AX200 AX210 9260AC 9560AC AX201 8265 7265 8260 3165 and other wireless network cards",
            "Extend Bluetooth Range: improve coverage and reception stability for your Bluetooth devices, like Bluetooth headphones, headset, wireless controllers, Bluetooth network card, etc"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b?ie=UTF8&node=172504"
            },
            {
                "name": "Network Antennas",
                "link": "https://www.amazon.com/Computer-Networking-Antennas/b?ie=UTF8&node=3015438011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "4.02 x 0.39 x 8.19 inches"
            },
            {
                "name": "Item Weight",
                "value": "9.5 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "TREADALT-TEC"
            },
            {
                "name": "ASIN",
                "value": "B0CM6BTNZX"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 22 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#568 in Computer Networking Antennas"
            },
            {
                "name": "Date First Available",
                "value": "October 31, 2023"
            },
            {
                "name": "Brand",
                "value": "TREADALT-TEC"
            },
            {
                "name": "Hardware Interface",
                "value": "Bluetooth, USB, PCI"
            },
            {
                "name": "Data Link Protocol",
                "value": "IEEE 802.11ac"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Dual Band WiFi Antenna RP-SMA Male (Hole in Center) (2 Pack)Dual Band WiFi Antenna RP-SMA Male (Hole in Center) (2 Pack)TS9 4G LTE Antenna(2 Pack) (2 Pack)Dual Band WiFi Antenna RP-SMA Male (Hole in Center) TS9 4G LTE Antenna(2 Pack) 802.11 b/g/n/ac/ax/wifi 6 6E ✓ ✓ ✓ 4G LTE/5G ✓ ✓",
                "media_link": []
            },
            {
                "media_text": "Dualband + WiFi 6E Antennas Directional and omnidirectional antennas compatible with the 802.11ac/ax and WiFi 6E standards. The ac/ax standards enable extremely high bandwidths. We offer different types of antennas with varying ranges for various deployment scenarios. We are happy to assist you in selecting the right 802.11ac/ax WiFi antenna. 802.11ac (WiFi 5): The 802.11ac standard, also known as WiFi 5, primarily operates in the 5 GHz band and provides higher bandwidth compared to its predecessors (802.11a/b/g/n). 802.11ac supports MIMO, improving data transmission by utilizing multiple antennas, and contributing to better performance in environments with many wireless devices. 802.11ax (WiFi 6): The 802.11ax standard, also known as WiFi 6, also operates mainly in the 5 GHz band and offers higher theoretical data transfer rates compared to WiFi 5 (802.11ac). This allows for even faster wireless connections and improved performance, especially in environments with many concurrently connected devices. WiFi 6E (E=Extended): Wi-Fi 6E extends the available frequency range of the 802.11ax standard to the 6 GHz band (5925 - 7125 MHz), resulting in more available channels and further increasing bandwidth.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5de4b861-8bc8-46b9-99a6-6d028e416041.__CR0,354,1000,619_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Omnidirectional High Gain 5dBi 2.4GHz & 5.8GHz & 6GHz Antenna for 802.11AX Wifi 6E Router Network Card More information about 802.11ac/ax, WiFi6 and WiFi 6E WLAN antennas WiFi, also known as Wi-Fi, is ubiquitous nowadays – from computers and smartwatches to smartphones and tablets. However, not all wireless networks are the same. The various Wi-Fi standards, ranging from Wi-Fi n and ac to the latest developments such as Wi-Fi 6 (802.11ax) and Wi-Fi 6E, can be confusing. Here, we provide a comprehensive guide to understanding everything about Wi-Fi, especially the 802.11ac WiFi antennas. An overview of WiFi standards: 802.11a/b/g/n: Early generations, each with specific frequency bands and transmission technologies.802.11ac: Integrates the efficiency of Wi-Fi A and B, with higher speeds and improved range. MIMO technology allows for multiple simultaneous data streams.802.11ax (Wi-Fi 6): The latest development, with enhanced efficiency and performance features, especially in environments with many connected devices.802.11ad (WiGig): Complements Wi-Fi AC and operates in the 60 GHz band, offering very high data rates but limited to short ranges and direct line-of-sight.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d50b7c9-fd8d-45f1-8335-40f8c1476c24.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Dualband + WiFi 6E Antennas Regarding Wi-Fi 6 (802.11ax) and the extension Wi-Fi 6E, these standards provide increased capacity and efficiency, especially in environments with many devices. Wi-Fi 6E extends the frequency bands to the 6 GHz range, allowing additional channels to minimize interference. The benefits of Wi-Fi AC (802.11ac) include: Utilization of the 5 GHz band for higher speeds and reduced interference.Standardized beamforming for targeted signal steering.Increased modulation (from 64QAM to 256QAM) for more bandwidth.New channel widths of 80 MHz and 160 MHz, doubling and quadrupling the bandwidth compared to Wi-Fi N.Support for up to 8 streams in MIMO, further enhancing over Wi-Fi N. The introduction of Wi-Fi 6 (802.11ax) brings additional improvements in efficiency, speed, and capacity. Multi-user MIMO (MU-MIMO) allows access points to effectively communicate with multiple devices simultaneously. WiGig (802.11ad) specializes in extremely high speed over short distances and is mainly used for wireless docking stations in enterprises. Interoperability issues may arise, especially with different frequency bands. However, most routers are dual-band, allowing the use of various Wi-Fi standards. Backward compatibility exists as long as devices operate on the same frequency band. In practice, throughput is halved compared to theoretical speed, and the 2.4 GHz band may be congested in urban areas. For more demanding applications such as HD video streaming, 5 GHz WiFi is often recommended. When choosing WiFi for smartphones, tablets, and laptops, considering the supported antennas and streams is important to achieve maximum speed.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f37e14f0-5310-4add-a60e-73ebe3efb912.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Details About WiFi Dual band 2.4/5.8GHz MIMO Omni Antennas Dual-Band WiFi Omnidirectional antenna provides high gain wide blanket coverage in both the 2.4 GHz and 5 GHz WiFi bands as well as the Public Safety Band. Ideal for 802.11ac 802.11n/ax4×4 MIMO Dual Band 2.4 GHz & 5 GHz MIMO Wi-Fi Operation RP-SMA Male (Hole in Center)Contains 2 independent antennas",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49b25888-1788-4929-aba9-9a3396b02caa.__CR0,109,1116,345_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c5b6f99-74c6-4059-a8d6-98692361f34e.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0ab97897-a6c4-4c90-a7b7-ce8662d71e71.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/045b4484-4bac-4d02-b6ff-66ccb4b79321.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5de4b861-8bc8-46b9-99a6-6d028e416041.__CR0,354,1000,619_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d50b7c9-fd8d-45f1-8335-40f8c1476c24.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f37e14f0-5310-4add-a60e-73ebe3efb912.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49b25888-1788-4929-aba9-9a3396b02caa.__CR0,109,1116,345_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "cti2019",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHOOUANWWNIKJRE57LXWLGXHDSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32KHCF75E42BM?ASIN=B0CM6BTNZX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Extensive testing: 2-5 dBm improvement compared to Dell laptop built-in antenna.",
                "reviewText": "It's surprisingly hard to definitively test an antenna, so I went waaay above and beyond to get reliable repeatable real-world results. WiFi signals fluctuate a LOT, so you can't simply look at signal strength with one antenna, and then with another. Variability, for one antenna alone, can be +/-10dBm. In order to completely rule that out, I wrote a custom program to sample signal strength, 500 times, calculating the mean, mode, and average. Instead of measuring just one connection, to my home router, I recorded 500 samples, for every hotspot in the neighborhood (3 at 5.8Ghz, 3 at 5Ghz, 18 at 2.4Ghz). I choose 500 samples, because that was the number of samples it took to overcome outlier readings, swings from high to low, cross station interference, and other influences. The average, at 500 samples, reliably matched (within 1dBm) the average for another 500 samples, for all 24 hotspots. My efforts didn't stop there. I ran the test again with the antenna base rotated 90 degrees (still pointing up), and with the laptop's internal antennas/screen rotated 90 degrees. With the first test, these antennas gave a 2-3dBm boost, and with the rotated position, they gave a 3-5dBm boost. It took a couple of days, to get the analysis program written, but it's awesome to finally have solid definitive numbers to compare. I'd say this is a good antenna that will definitely improve signal strength. Keep in mind that laptop Wi-Fi antennas usually perform quite well, because they are built into the screen, and have a reasonable length to them. If you are replacing stubby style antennas, that come with desktop Wi-Fi cards, you should see even more improvement than what my tests show. Those stubby antennas are terrible, and they are stuck behind the signal blocking metal PC case. You'll do much better with this antenna, mounted up and away from the case. Enjoy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ciespi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGO2KVWVMRV5FD6FTXW6CZWRZ6XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H6H8EUAQROLE?ASIN=B0CM6BTNZX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Works X570 mobo",
                "reviewText": "The original antenna for my x570 mobo ripped so I needed a replacement. This cam in handy immediately. It fits the connector and signals are back to normal. The Dd long cable allows you more leniency to place the antenna closer or farther away. The base of the antenna has a magnet which can be a plus if you have a place to stick it. Overall this is a good replacement as I don't notice any signal drops or bad connections.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NadeMagnetNadeMagnet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVS2BABACMTSKZIFYJCH3HJQNWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29H50SYTDE6GQ?ASIN=B0CM6BTNZX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Works better than the stock motherboard antenna",
                "reviewText": "I wasn't really in the need for a new antenna since the one that came with my Asrock Z490 Taichi motherboard worked good enough. But I've never tried an aftermarket one so I thought I'd give it a shot.What I like about it.It has a strong magnet. There's no issue whatsoever of it falling off of at least a ferrous metal case. The stock antenna had nothing to hold it on. At least not natively. I'd of had to have used something like double sided tape if I wanted to stick it to the side or back. Plus the antenna can only be pointed vertically from its base. So I just had it on top and I ended up knocking it off often so this is nice that that won't be an issue anymore. It's also nice having it off the top since now none of the top exhaust fan is blocked. I mean the stock antenna was hardly blocking a lot of air, but hey some is more than none last time I checked. As shown in the pics by running the \"netsh wlan show interface\" command in the command prompt, this now lets my motherboard pick a 5 GHz channel instead of the 2.4 GHz. 2.4 is better for things like going through walls more easily which is why my motherboard picks it since the PC is upstairs and the router is downstairs, but 5 is faster. So though it's saying the signal strength is lesser, it's lesser on the better option and is still easily a high enough signal strength. The two antenna are moveable and lock in 3 places. Vertical, horizontal, and a 45 degree. The 360 degree rotation of them stays in place in whichever angle you put them at instead of letting gravity making them fall.What I don't like about it.I would have liked to see a longer cable which would allow more placement options. It's longer than the stock but only by about 2-3 inches which amounts to nothing meaningful.But that's a small gripe and this is still better than the stock antenna despite that Taichi motherboard being Asrock's 2020 flagship motherboard model. So I'm happy with this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/31cxSdiUwXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/31fQgTsOzzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71OhNPokssL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71V-TllcZ5L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Louie Camanag",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXY2REZAWZUGI4IJ34NBXSOUY4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V8SL2TYVMRMP?ASIN=B0CM6BTNZX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Great signal",
                "reviewText": "Very happy with this product - got a great signal, so far I have not had any lags/delays, no disconnections. Base magnet is pretty strong, keeps the whole thing upright. Pretty good deal for the price tag.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MarksMarks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUMDPAEXQQMM5HC2MMLGWFCC55A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PGJ4V0CVTF4H?ASIN=B0CM6BTNZX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Huge, Stylish Wifi Antenna for computers. Upgrades motherboard bundled antennas.",
                "reviewText": "This is an excellent antenna and attaches to the motherboard antenna ports easily. I got excellent Wifi6 signal with great speeds. The magnetic base keeps it in place nicely. The design of the antenna is also very cool and looks very sci-fi and futuristic.This replaces the antenna that came with my motherboard. It is always on the floor in two pieces as it is designed to have two plastic pieces snap together but always falls over and detaches.Only criticism that I have is that the base is huge and the magnet is not strong enough to hold on to partial portion of the base. When you do put it on the side, it does hold it but a small nudge and it might slide to the floor. Other magnetic antennas have a smaller base but a stronger magnet that can attach firmly to the side of the case. Since my case has glass on both sides, there is not much space for it to grab on to. I put it on top of the case which blocks a little bit of the airflow from the AIO but it is better than flopping around in the ground.Overall, great huge antenna as a good replacement for wifi antennas that come with motherboards.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Dpi+T6KDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71H0+hE668L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/814qYHULqtL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Schwartz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVMGSPHA72VPA4AHHKK7DTHLKWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMWQGIYDAGW6Y?ASIN=B0CM6BTNZX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Weak magnet...",
                "reviewText": "I bought an antenna almost exactly like this before. The base on the one I purchased said EDUP. This one had a QC-passed sticker over the same area. I removed it and it said EDUP under it. So the base is shaped the same but the antennas are a little different shape but work essentially the same. The only difference I can see is that the magnet in the base of the new one is much weaker than the older one. I am happy with the increased Wi-Fi signal performance just like with the older one but am not happy with the weaker magnet. If you wanted to slap this on the side of your PC case it would not stay in place as well as the older one would. Other than that I'd recommend this antenna.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}