{
    "remaining_requests": 27230,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Linksys-Dual-Band-Extender-Booster-RE6250/dp/B06ZY2PJ39",
    "body": {
        "name": "Linksys RE6250: AC750 Dual-Band Wi-Fi Extender for Home, Wireless Range Booster, Internet Booster, Works with Any Wi-Fi Router",
        "price": "$16.99",
        "originalPrice": "$19.99",
        "rawPrice": 16.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Linksys-Dual-Band-Extender-Booster-RE6250/dp/B06ZY2PJ39",
        "soldBy": {
            "sellerID": "A164OPQDTKO5OE",
            "name": "Connected Home Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A164OPQDTKO5OE&asin=B06ZY2PJ39&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CRT3XW4J"
        ],
        "asinVariationValues": [
            {
                "asin": "B01DT48WZS",
                "variationName": "Size",
                "variationValue": "Wifi 5",
                "price": "$99.00",
                "variationImageURL": ""
            },
            {
                "asin": "B06ZY2PJ39",
                "variationName": "Size",
                "variationValue": "AC750 (Speed)",
                "price": "$16.99",
                "variationImageURL": ""
            },
            {
                "asin": "B015Z3OD22",
                "variationName": "Size",
                "variationValue": "RE6300 - 1,000 Sq. FT - 750 Mbps",
                "price": "$39.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/21ASnMnvMML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31o5dGsm54L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21Neu0XGj1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21z3iMAHrnL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/813Hjw-ki5L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/813Hjw-ki5L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Linksys Store",
            "link": "https://www.amazon.com/stores/Linksys/page/E0C967DE-6A97-4E8F-9358-86C50D6219E8?ref_=ast_bln"
        },
        "brand": "Linksys",
        "merchantInfo": "Ships from and sold by beforeyougo.",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 5947,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 10 hrs 27 mins",
            "FREE delivery Monday, February 26.",
            "Or fastest delivery February 16 - 20.",
            "FREE pickup Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest pickup Friday, February 16. Order within 14 hrs 42 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Eliminate WiFi dead zones in your home and expands coverage better HD streaming, gaming, and more",
            "Easy setup with Push Button Connect",
            "Works with all Wi-Fi routers or ISP-supplied gateways",
            "Guides you to the best placement in your home with Spotfinder technology"
        ],
        "description": "Eliminate dead zones and Boost Wi-Fi from your router with the Linksys AC750 Wi-Fi range extender (RE6250). with AC1200 Wi-Fi speeds (N300 + AC433), households will enjoy fast, uninterrupted Wi-Fi indoors and Outside it features spot Finder technology and WPS for simple setup and optimal placement in relation to your router. It works with all Wi-Fi routers, including those from service providers, to deliver uninterrupted streaming, online gaming, and seamless content sharing.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Repeaters",
                "link": "https://www.amazon.com/Repeaters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3015439011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1.5 x 2.79 x 4.14 inches"
            },
            {
                "name": "Item Weight",
                "value": "4.6 ounces"
            },
            {
                "name": "ASIN",
                "value": "B06ZY2PJ39"
            },
            {
                "name": "Item model number",
                "value": "RE6250"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 5,947 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#182 in Repeaters"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "May 29, 2017"
            },
            {
                "name": "Manufacturer",
                "value": "Linksys"
            },
            {
                "name": "Brand",
                "value": "Linksys"
            },
            {
                "name": "Data Transfer Rate",
                "value": "750 Megabits Per Second"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Connector Type",
                "value": "USB 3.0"
            },
            {
                "name": "Included Components",
                "value": "Linksys AC750 Wi-Fi Range Extender, RE6250 Quick Installation Guide Regulatory Information"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTXQEURKOUHXXRYBHWCWML227GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C7BT6MP84LVT?ASIN=B06ZY2PJ39",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great",
                "reviewText": "I had to contact linksys for setup help. Works great. They also told me it was out of warranty. I just bought it????",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW227JTIMWEKVHX2CRFOMHM3EOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10Q2WB12QO888?ASIN=B06ZY2PJ39",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Great tech support! Great extender once set up via tech support!",
                "reviewText": "I am a tech user, but not a troubleshooter nor fixer. I need assistance to set up state of the art wifi stuff.About a year ago I purchased a different wifi extender from Amazon, which I finally got set up after three or four attempts. It worked okay, but the signal kept winking in and out. So I ordered this Linksystem wifi extender. It comes with directions for installation, but the unit just didn't cooperate. So I called the Linksystem tech number, and the support person walked me through every step, until it was working flawlessly. My modem is about sixty feet from the tv, where we stream our news and tv programing through a provider over the internet. It is an old home, with lots of rebar and five walls including a shower stall and cabinets to beam through. Since the tech person helped me setup this linksystem extender to interact with my computer and modem, it has not ceased to function, nor to not provide a strong signal. Linksystem tech service was great. There was no long wait, no non-human interaction with talking computers to go through before you talk to a live tech support person. That alone was worth the price of the wifi extender. I highly recomment this wifi extender, and Linksystem tech support.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hollis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLHDZNUJM46ZNAYIDUSUKQFV5BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16FWGK3Q5WVM9?ASIN=B06ZY2PJ39",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 7, 2016",
                "reviewTitle": "4.0 out of 5 stars The sales pitch is wonderful, but \"Beware the Jabberwock\"",
                "reviewText": "Conflict of interest statement: Lynksys asked me to review this product. They paid for the product; I paid the WA tax. So we both have an interest in the review but I am not a salesman. I am reviewing how to get the product working.The front of the box says \"Works with ALL Wi-Fi routers\", and the side panel says, in smaller type, \"Push-button Connet: One-Touch connection to your router\". Sounds wonderful. But not so fast. You first have to decide if you are going to set this up as a \"wireless range extender\" or as a wired range extender (access point). My guess, which is the same as Linksys', it that you saw Wi-Fi Range Extender in the name of the product and locked onto the Wireless image. So we will deal with that first.Now, the first question is there a WPS button on your router? If no, you are in for a world of hurt, because for you there is no Push-button connect, no One-Touch connection to your router. If yes, you are directed to plug the extender device into an electrical outlet near the router. Here the bubble bursts. In my case, my computer system is in the third bedroom, which is the crib room, and all the electrical outlets are at shin level. So the first thing you have to do is cannibalize a short extension cord so you can move the device up to a convenient level surface where you can watch the side of the device with the WPS button. Now plug it in. The Led light on the side will start to blink green. Wait about a minute until it starts to blink orange. Press the WPS button on the side of the router. Press the WPS button on the side of the Range Extender, and watch the LED on the FRONT of the device: It will start to blink green, and turn to a solid green. Hurray! The Push-button, One-Touch connection has been made. If it starts to blink orange, the connection was not made and you have to do the button pushing again. If you never get a solid green, then you have to do the browser based setup just like the WPS buttons were never there in the first place. Assuming that the connection was made, and you have a dual mode router that broadcasts in both 2.4 GHz and 5 GHz, you do the push-buttons sequence again for the 5 GHz signal.All that is conjecture on my part, because my router, the DSL router from Frontier, does not have a WPS button. I haven't figured out how to apply the instructions for the browser-based set-up sequence yet, and will report on that anon.I did manage to get the extended setup process to complete, but not without tumbling into a number of pitfalls. I switched my computer from wired to wireless operation, plugged the extender into a nearby end of an extension cord, waited until the blinking green front light turned to a blinking orange light, and then changed the wireless connection to the Linksys Extender setup-XXX as instructed launched setup by using the browser to go to [...], as instructed in the setup sequence guide. The guide says to \"be sure to choose 'as a wireless range extender' 1when asked how you want to use your range extender\". Then the guide says to follow the on screen instructions to complete the set-up process. No further step-by-step guidance is provided and you are left to your own interpretations of what the on-screen instructions mean.The first page is fairly straight-forward. It asks you to create an Admin password. You type it in once, and then a second time, and then a hint to help you remember the password. Then click save and it advances to the next page where it does a lookup of the available Wi-Fi signals. You choose the one you want which you want to connect. Then it asks for the network password. What the hell is that, I ask? I just made a password, so it is asking for the similar password on my modem. It never worked. Finally, I logged into my modem my self, and discovered again that I had to give it a user name as well as the password, and the device only had modem SID and the password. So what single piece of data could it want to connect to the modems Wi-Fi? Oh, yes! That would be the Public System Key, which definitely is not the modem's password. So, I tried again, using the PSK. A rotating icon of a circling blue rectangles appeared to signify that it was working and then it stopped and hung there for a while, and finally a new page appeared to say it had extended the 2.4 GHz band and asked me to select the name of the 5.0 GHz band. So, I gave it the SID of my modem, and the PSK and it came back saying that no connection could be made. I tried several times, same result. I tried going into the manual setup, but that was no help and I could not get it to complete the process with just one network extended. I eventually called support. The system engineer asked me to let him take over my computer and he proceeded investigate the modem and tried a number of time to get back into the extender device setup program, but could not and by then my computer lock-up and had to be rebooted. So I terminated the session and my advice is to never let them take over your computer. We had concluded that my modem had only the 2.4 GHz band, and the extender device needed to be reset to factory settings.After rebooting my computer, I attempted to reset the extender device. Again, this did not happen on the first attempt. I finally concluded that you had to let it get to the blinking orange state, the poke the reset button with a bent paper clip, until the blinking orange light went dark and the blinking green started. Then it worked as a clean device. I got to the part where it was ask about the 5GHz network, carefully looked down the list of options, and found the button that said I don't want a second network, clicked that, and it went on to complete the process. I captured the summary of the setup parameters, and pasted it onto the bottom of a text page of the modem's parameters. All is well, I thought.But, after I was writing up the review, I thought I should go back and do it all over and write down exactly what was on those pages. So, it is back to a reset of the extender device, connect to the extender setup signal, start the process again, writing down the exact words of the prompts, and suddenly and error page pops up and say the connection with the computer has been lost. I will wait until the signal returns. My computer says it is still connected. But I disconnected, reconnected, still nada. Finally, I reconnected with the little box that says to reconnect automatically checked, and the error page went away. Then another error page appeared, saying that modem had quit working and please reboot it. So I did that. And I retried making the connection. That didn't work, so I tried putting the connection data in manually. Still nada. Finally, in frustration, I clicked retry again, and it worked. At this point, I decided that both these two problems were caused by the extender device itself, and it's extension software was really not ready for the casual public. So, if you are not quite familiar with Wi-Fi and advanced computer operations, then do not buy this product. The chances that you will get it to work is pretty small. Wait until both the setup software is improved and the user guide is expanded to handle all of the possible distress points. The nerds among us deserve whatever adventures we get ourselves into.I will report about the details of the range extension anon.",
                "reviewVotes": "56 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGYA7PR4ISQ7JZVKH7TZT4ONOUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SYVXTU1GPWBW?ASIN=B06ZY2PJ39",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2019",
                "reviewTitle": "1.0 out of 5 stars Not a fan of this, my devices could never see it on my network",
                "reviewText": "Quick set up is fairly straightforward if you have a wi-fi protected setup button, you just wait for the light on the extender to blink orange, then push the wi-fi protected setup button on your router, and then on the extender and wait for it to turn solid green. Then you repeat the process to connect to the 5GHz antenna. My router is a max stream router so there should be no more steps other than logging into the home page for the extender. My router could see the extender. The problem was, nothing else could see it. My phone never could detect the other network. My computer would occasionally if I reset the extender and connected it again to the router repeatedly until it would miraculously show up on my computer wi-fi screen. The extender was less than 3 feet away from my computer so distance was not an issue. When I tried to connect to it, it asked for a router pin, which I supplied, and then when I hit \"connect\" it would say it couldn't connect to the network and my only option was to close the window. Then I would have to reset the extender and try again until I could get the network to display, but I could never connect to it. I always got the error message.So, I called Linksys tech support, which was a huge waste of time. I had to give them all of my information to set up an account before they would even listen to what the issue was. Then after I explained everything, the tech support dude wanted me to let him control my computer remotely to change some router settings. Ummm - no thank you! There was absolutely no reason I couldn't have done what he wanted, I was in my Linksys Dynamic Home webpage with the settings. But, no, he wanted to remote into my computer.If they can't make a Linksys extender work with a LINKSYS router unless tech support remotes into your network, then I guess I don't need it.Bye Bye Linksys, I'm going to see if I like Orbi any better.Oh, and if you use Linksys, their parental controls don't work consistently either which is something I have always been dissatisfied with. For example, it is supposed to turn off my teenager's wifi to his computer at 10 pm and I can't remember the last time it actually did that. Maybe a year ago it worked for a few weeks and then stopped. Taking controls off, putting them back on doesn't fix it. The firmware is up-to-date.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr Craig Sturgeon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 9, 2022",
                "reviewTitle": "Not for use in the UK!!",
                "reviewText": "Why are you selling this item in the UK in £s it doesn't come with a UK plug and neither does it say so in the description",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alberto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 18, 2017",
                "reviewTitle": "Linksys RE7000 Excelente",
                "reviewText": "Excelente extensor de señal Wifi, cumple su misión. Me funciona a la perfección y más que el router al que lo conecté (EA8300) es de la familia Max-Stream de Linksys al igual que el extensor RE7000, por tanto tienes una sola señal Wifi (dual band) y te cambia en automático del router al extensor según dónde esté la señal más fuerte. tanto en el router como en el extensor obtengo el 100% de la velocidad de internet contratada. Dado que las casas en México son de materiales sólidos (block, ladrillo, concreto) la señal se extiende unos 100 m2 adicionales (depende de la construcción donde se instale), sabiéndolo ubicar te es muy útil. Lo recomiendo. Si tu router no cuenta con Max-Stream (de Linksys) si te funciona pero no con itinerancia automática (tienes que cambiar de red (router-extensor) de manera manual), puedes entonces optar por un extensor más económico.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 5, 2017",
                "reviewTitle": "Easy to Install",
                "reviewText": "Arrived on time and was well packaged. No documentation enclosed but was avail via website. Easy to install on my network and has nicely expanded the WIFI coverage around my home. Unlike some others which require a new network name to be used this device allows for replication of existing network name so no need to change connection settings in networked devices.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "007",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 13, 2018",
                "reviewTitle": "Extender is good.",
                "reviewText": "It can extend the wifi signal up to 2 rooms.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marc Singapore ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on May 29, 2020",
                "reviewTitle": "Good service and response from the seller",
                "reviewText": "Had great service experience with order and follow up. My only grumble is the device came with US plug and no alternate option, meaning that had I not had a socket converter at home for UK plug I’d have been challenged. But that said, did exactly what’s was needed and very easy to set up. Works well with my Vellop Mesh WiFi. Thank you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$17.99",
                "sellerName": "Inuma",
                "sellerRating": "4"
            },
            {
                "price": "$29.99",
                "sellerName": "Connected Home Store",
                "sellerRating": "5"
            }
        ]
    }
}