{
    "remaining_requests": 27091,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/NETGEAR-Nighthawk-Gigabit-Ethernet-Compatible/dp/B0106N5OOW",
    "body": {
        "name": "NETGEAR R7900P-100NAS Nighthawk X6 AC3000 Dual Band Smart WiFi Router, Gigabit Ethernet, Compatible with Amazon Echo/Alexa",
        "price": "$80.97",
        "originalPrice": "",
        "rawPrice": 80.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/NETGEAR-Nighthawk-Gigabit-Ethernet-Compatible/dp/B0106N5OOW",
        "soldBy": {
            "sellerID": "A2D88764C0O6FE",
            "name": "Almoine",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2D88764C0O6FE"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418snO5ucCL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31T4XS7L OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fhvtJfIoL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1vRhDdQ6IL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/D1OsDMZJyQS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the NETGEAR Store",
            "link": "https://www.amazon.com/stores/NETGEAR/page/0BAEE44C-8BBE-4F72-9CF9-3CFB6CFB92F1?ref_=ast_bln"
        },
        "brand": "NETGEAR",
        "merchantInfo": "Almoine",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 1083,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21.",
            "Or fastest delivery Tomorrow, February 15. Order within 1 hr 50 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "3.0Gbps—Fast combined WiFi speed for uninterrupted streaming",
            "Tri-Band MU-MIMO—Simultaneous streaming to more devices",
            "1.8GHz dual-core processor delivers lag-free gaming",
            "USB 3.0 port offers high-speed, storage-ready access.System Requirements:Microsoft Windows 7, 8, Vista, XP, 2000, Mac OS, UNIX, or Linux.Microsoft Internet Explorer 5.0, Firefox 2.0, Safari 1.4, or Google Chrome 11.0 browsers or higher",
            "Nighthawk App - Easily setup your router. Manage Internet access by pausing and resuming internet instantly. Run a speed test. All from your mobile device!"
        ],
        "description": "Gaming You need the best when you're taking on the online gaming world. The Nighthawk X6 is the pro gaming choice and the latest in AC3000 speed and performance. Powerful dual-core 1GHz processor and three offload processors provide Wi-Fi speeds up to 3.0Gbps. Nighthawk's Tri-Band Wi-Fi ends game-lag and multiplies the intensity of immersive, uninterrupted, online gaming while Dynamic Qu's prioritizes Internet traffic by application & device. Streaming Nighthawk X6 multiplies the entertainment factor for everyone in your home. Seamless, simultaneous streaming for multiple devices is now a reality thanks to powerful Tri-Band Wi-Fi and features like Smart Connect and Beamforming+—it's the end of buffering, jittery video, and lag as you know it. Dynamic Qu's prioritizes your Wi-Fi bandwidth by application, such as Netflix as well as by device for smoother streaming. A built-in DLNA-ready server and iTunes server add to your media enjoyment, allowing you to play and share your videos and music quickly and easily. And to keep your media both safe and instantly accessible, you can use the free Ready SHARE Vault app for automatic, continuous backup of all your home PCs wirelessly, to the USB hard drive connected to the router super-speed USB 3.0 port. Easy install-easy setup for iPad, tablets, smartphones and computers.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Routers",
                "link": "https://www.amazon.com/Routers-Networking-Online-Communication-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=300189"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Type",
                "value": "‎802.11ac"
            },
            {
                "name": "Number of USB 3.0 Ports",
                "value": "‎1"
            },
            {
                "name": "Brand",
                "value": "‎NETGEAR"
            },
            {
                "name": "Series",
                "value": "‎R7900"
            },
            {
                "name": "Item model number",
                "value": "‎R7900-100NAS"
            },
            {
                "name": "Operating System",
                "value": "‎Windows 7, 8, Vista, XP, 2000, Mac OS, UNIX, or Linux"
            },
            {
                "name": "Item Weight",
                "value": "‎2.43 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎11.63 x 8.92 x 2.14 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎11.63 x 8.92 x 2.14 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Batteries",
                "value": "‎1 Lithium Ion batteries required."
            },
            {
                "name": "Manufacturer",
                "value": "‎Netgear Inc"
            },
            {
                "name": "ASIN",
                "value": "‎B0106N5OOW"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎June 20, 2017"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 1,083 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#21,652 in Computers & Accessories (See Top 100 in Computers & Accessories) #815 in Computer Routers"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Larry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXVXG2N22IYO4LZGM6GWYBI5DTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JZ66PQKTA7DE?ASIN=B0106N5OOW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2018",
                "reviewTitle": "5.0 out of 5 stars This is a fantastic router for the price... great performance and loaded with a ton of useful features",
                "reviewText": "The price was fluctuating quite a bit on Amazon, but when I saw it come up for sale at $149.99 ($50 less than Costco's price) The deal was too good to pass up. This router does everything I expect a router to do, and it does it well. One of the reasons I replaced my old router was relatively poor 5GHz coverage, and I was not disappointed with he R7900, which has great wi-fi coverage throughout my home.I elected to manually set the router up, because I know what I'm dong and wanted to make the router upgrade as seamless as possible, so hat I could preprogram it and substitute it for the old router when finished. All my devices connected to the new router without issue, as I used the same SSIDs, IP addresses, etc, including the address reservation feature to keep my fixed network addresses the same.The R7900 has some great monitoring features as well, allowing me to see which of my devices are using data, and how much. I can also monitor total data consumed per day/week/month so I can compare it with my ISP's data consumption tool.Netgear offers and makes use of a free dynamic DSN service that I plan to take advantage of with my Raspberry PI 3, setting up an email server with my own domain name, allowing me to create personalized email addresses for my whole family, for free. This will save me some money as I migrate off of Godaddy's expensive email service. I'll just keep my domain name with them.In sum, because of the great performance and price, I can highly recommend this router.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MLan72",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAZI24MZCKYQAK3I5BLJAKN2JVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UBT1WLJ424WF?ASIN=B0106N5OOW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2018",
                "reviewTitle": "5.0 out of 5 stars Amazing speed, easy to set up",
                "reviewText": "So we bought this (NETGEAR Nighthawk X6 AC3000 Dual Band Smart WiFi Router) a few weeks ago hoping for an improvement over our 3-5 year old (not sure when it was made) NETGEAR R6100 which kept dropping signal or was very weak in different parts of the house.I'm so happy with this purchase, don't even know where to start. So I'll keep it short and sweet. It works very well, super fast, and easy to set up - for normal home usage that is. Not sure if a pro gamer would agree, or how well it would do in a business environment, but here in my 4 bd, 1,750 sq ft home with bedrooms on both ends of the house - ranch split design - with computers, laptops, streaming devices, gaming boxes, printers and other things doodads and doohickeys hooked up to the internet and depending on a strong signal in each room or area of our 9,583 sq ft lot size (strong signal reaching even the far corners of the back yard) ... IT WORKS SUPER FAST AND TOTALLY AMAZING! We love the speed and the fact that we don't have to keep adjusting the location of the router or move closer to it if we want to download something, print something or just browse the Amazon (he he)! So to end this on a sweet note, YES I definitely recommend this product for anyone looking to buy a great fast router. Not the cheapest for sure, but in my opinion it's one of the best. Also can't beat the Amazon fast delivery and most of the time with Prime membership, free returns. Thanks for reading and ask if you have any questions.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CBerg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZDFMPXJ4K5QR3ICRREML7343GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J5TC75UASAD5?ASIN=B0106N5OOW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2017",
                "reviewTitle": "4.0 out of 5 stars Fixed the VPN Security Problem and ReadyShare Printing",
                "reviewText": "Update 3 May 19: I went back to giving this router 4 stars. First they fix the VPN vulnerability. I am happy now that I can go to other countries and use a safe VPN. The second is because I really like the ReadyShare. I had a old iMac computer, circa 2008, that I use as a server type. i.e. It host my itunes music, itunes movies, and usb printer. However, my household is starting to be a mix environment of PC and Apple and Bonjour for printing stop working or I could not get it to work with Windows 10. Originally I thought ReadyShare was only for storage put it can be used for printers. I plug in my printer into the 1 USB port on the router and installed ReadyShare on all the computers (PC and Mac) and it worked like a charm.Update 23June18: One of the reason I bought this particular WiFi Router was the VPN. However, the Open SSL used by netgear is no longer being supported because of a security vulnerability. Netgear said they are fixing the problem but has yet to introduce a firmware upgrade.So far I am happy with the NETGEAR R7900.Pros: - Three Bands (1 x 2.4Ghz and 2 x 5Ghz). I put all my IoT and legacy on the 2.4Ghz, all my 11N on the first 5Ghz, and all the 11AC on the second 5Ghz. - OpenVPN. Never trusted public Wifi. Not to hard to configure my iPad Pro and iPhone 6. - Subjectively, my 11ac devices seem faster (iPad, iPhone, and Macbook Pro). My old router was 11n. Also, I have an old iMac (11n) and this is the first time it consistently has a strong signal RSSI is 50dB with a link speed of 450Mbps. Using my old 11n router, it would fluctuate between 22-24 dB and link speed of 150-200Mbps. - Guest Network on 2.4 and 5 GHz. I don't have this on but I am glad that this function is available in the event I have over night guest.Cons: - The router produces a lot of heat. You can't really see it in the picture but the top is a grate to allow heat to escape. - The channels in the 5Ghz are locked. The first 5Ghz channels are 36,40,44,48 and the second 5Gz channels are 149,153,157,161. These channels are only 20MHz wide. So if you are looking at using channels that used 40 or 80 MHz bandwidth this router is not for you. - The router is large. Larger than my old 11n router (Airport Extreme Base Station square 4th gen)Things I didn't really care for but they work. USB 3.0 port to connect an external drive. My iMac acts as a storage server (I have a Drobo attached) so I don't really need the USB port. It has 4 Gig LAN Ports. Only using one to connect my Ethernet over Power adapter. I have a few computers and a couple of IoT that don't have wireless. Parental Control is cool if you have a young family. I guess you can use it for the guest network.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "N B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6QKJTC6SSHLKQQATWAR33252HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMZO14MAHZQJ1?ASIN=B0106N5OOW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 22, 2018",
                "reviewTitle": "5.0 out of 5 stars Great range and processing power.",
                "reviewText": "I purchased this router due to the ever increasing demand of network resources. Granted, this router can process far greater than my internet speed, however when I work from home and family members are streaming video, this router does not miss a beat. The range is tremendous. This router is in the basement on one end of my home, and I can have full signal in my garage on the opposite end. I did have to call support at first, for some reason it was not connecting to the internet, however it was the only option I did not try first. But I can safely say it was user error. It is pretty neat to have 3 different networks, 2.4 GHz for older devices and a stronger signal, with the 5 GHz band not as strong as the 2.4, but it could also be due to router placement. This router will likely be moved in my house elsewhere, rather than right next to my game system which was always plugged into the LAN. The phone app could be better, I personally preferred the LinkSys app better, but that could always change.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ray and Irma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 8, 2018",
                "reviewTitle": "Excellent wireless router",
                "reviewText": "Router works perfectly. it has all the functionality I was looking for. Good coverage and stable connections of all 2.4 and 5 bands",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donald",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 23, 2019",
                "reviewTitle": "Great product. No issues",
                "reviewText": "Very easy to figure out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Merlin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 2, 2018",
                "reviewTitle": "Great router, with some build issues.",
                "reviewText": "Pretty good router. Nice options, including QOS, auto-negotiating between the 5GHz bands to load balance clients. My only gripe is the antennas are super flimsy. If you were to drop this thing, or a toddler were to find it, bye-bye antennas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kyle 905",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 21, 2018",
                "reviewTitle": "Easy setup. Looks great and strong signals over Rogers ...",
                "reviewText": "Solid interface. Easy setup. Looks great and strong signals over Rogers wireless modem wifi.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 29, 2018",
                "reviewTitle": "Four Stars",
                "reviewText": "Works great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}