{
    "remaining_requests": 27292,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TP-Link-Router-AX1800-Gigabit-Compatible/dp/B098XZPP35",
    "body": {
        "name": "TP-Link WiFi 6 Router AX1800 Smart WiFi Router (Archer AX21) – Dual Band Gigabit Router, Compatible with Alexa - A Certified for Humans Device (Renewed)",
        "price": "$54.99",
        "originalPrice": "$74.99",
        "rawPrice": 54.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TP-Link-Router-AX1800-Gigabit-Compatible/dp/B098XZPP35",
        "soldBy": {
            "sellerID": "A2EY5WP9K29AC7",
            "name": "Quality Photo",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2EY5WP9K29AC7&asin=B098XZPP35&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41bu48KQP6L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Quality Photo",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 633,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Tomorrow, February 15. Order within 1 hr 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": "",
        "description": "TP-LINK Renew 1 Year All state Warranty",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Routers",
                "link": "https://www.amazon.com/Routers-Networking-Online-Communication-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=300189"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "12 x 10 x 4 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.13 pounds"
            },
            {
                "name": "ASIN",
                "value": "B098XZPP35"
            },
            {
                "name": "Item model number",
                "value": "AX1800"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 633 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,915 in Electronics (See Top 100 in Electronics) #96 in Computer Routers #1,842 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Date First Available",
                "value": "July 8, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "TP-Link"
            },
            {
                "name": "Brand",
                "value": "TP-Link"
            },
            {
                "name": "Special Feature",
                "value": "WPS"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "802.11ac"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer"
            },
            {
                "name": "Frequency",
                "value": "5 GHz"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Home"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi, USB, Ethernet"
            },
            {
                "name": "Control Method",
                "value": "App"
            },
            {
                "name": "Voltage",
                "value": "100240 Volts"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "R T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRLXUFKCR4BFMPAGFJR4YTSEOQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQUTSFGO0JV48?ASIN=B098XZPP35",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Product",
                "reviewText": "The TP-Link WiFi 6 Router AX1800 is a game-changer when it comes to home networking. This smart WiFi router brings the power of WiFi 6 technology to your fingertips, offering faster speeds, improved performance, and better capacity for handling multiple devices simultaneously.Setting up the router was a breeze, thanks to the intuitive mobile app that guided me through the process step-by-step. The router's sleek design seamlessly blends into my home decor, and its compact size is a definite plus.The WiFi 6 capability is a noticeable improvement, especially in crowded environments with numerous connected devices. It provides a more stable and reliable connection, reducing lag and buffering during video streaming and online gaming.I particularly liked the parental controls feature, which allows me to manage and monitor internet usage for my kids. The robust security options, including WPA3 encryption, ensure a safe and secure online experience for all my devices.Another highlight of this router is its backward compatibility with previous WiFi standards, meaning older devices can still connect without any issues.On the downside, while the range is generally good, I noticed some drop in signal strength when farther away from the router. However, this can be mitigated by adding WiFi extenders or strategically placing the router in a central location.In conclusion, the TP-Link WiFi 6 Router AX1800 is an excellent investment for those seeking a reliable and future-proof networking solution. With its impressive performance, user-friendly interface, and advanced features, it certainly lives up to its promise of delivering top-notch WiFi performance for the modern connected home.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ricko Bernard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDSDD65ZSV5QNXR6EQIS7XC6XKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV1TYRTP0Z26K?ASIN=B098XZPP35",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars No issues months in!",
                "reviewText": "Writing this review months after i got it and its still holding up well, this thing is awesome for the money!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JoeParker54",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP6UKDSLJSEQI2WOXXLQRYFCONA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PZ6ENRSBVGFM?ASIN=B098XZPP35",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2022",
                "reviewTitle": "4.0 out of 5 stars Works better than supposedly faster models",
                "reviewText": "A version 3.6 AX21 arrived quickly in a brown box in like new condition, factory reset and ready to be set up. Scanning the QR code on he bottom of the router to join the network was easy enough, then my phone prompted me to enter the setup page without having to bother to download an app - I like that TP-Link makes it apparent the Tether app is available but not necessary for use. Setup was pretty painless and uneventful - reset modem (important step, I have found), plug in router and then proceed to go through setup.My biggest gripe is that when using Smart Connect and auto channel selection through the simple setup menu, the router wanted to pick already crowded channels instead of those that nobody nearby was using - also defaulted to narrow channel width for some reason. I ended up choosing my own wifi channels based on a survey of neighboring networks, manually set 5ghz channel width to 80mhz and performance is much better. The only other issue I have is that my Firestick 4K connects but cant see the internet when I use the same SSID for both bands so I just enabled a 2.4Ghz guest network with a seperate SSID and no more issues.Otherwise my speeds have more than doubled across the same range compared to my old Archer C6 AC1200 router and it is able to handle much faster transfer rates - the old router could not handle more than 400Mbps download speed even over wired connections while this can do twice that in the same room and 30ft and two walls away I can still pull 300-400Mbps where before it woud drop to 150-200Mbps with much more jitter and unstable connection. I can cloud game from my bedroom with hardly a hiccup.While the port on the back is only USB2.0, this is quickly becoming one of my favorite features - I was able to plug in a couple old hard drives I have some old DVD rips, movies, and TV shows on and stream/mount them just fine (as long as the receiving device can handle it - VLC player on a Chromecast w/Google TV struggled to mount and play ISOs but I can do it no problem on my PC). Otherwise transfer speeds seem to average about 25MB/s which is plenty fast enough for doing some aferhours file backups or streaming a couple movies off the drives at once.This was a much more pleasant experience than the refurbished Archer AX50 (technically it was an AX3000 1st generation with much older firmware) which is based on an intel chipset. It was an unstable piece of garbage and wasnt even capable of maintaining a decent wired connection. I litterally boxed it up to return within 45 minutes of setting up and requested not only a refund, but also an apology from the seller, tp-link, and amazon for selling such a bad product.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joshua Rutowski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIBJB3S5ZD2FB7YEJIA4C5FGJHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15SL5C1H3X99H?ASIN=B098XZPP35",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Works like a new one",
                "reviewText": "After riding with the Archer A8 for a few years (and loving it), I decided to finally make the leap to WiFi 6. My wife and I have added quite of bit of extra WiFi clients the past year, and the strain, while not terrible on the A8, was showing. Mobile devices would lose connection for a moment, smart appliances would lose connectivity for a moment, etc.But I loved the TP experience, both in the web app and Tether and the range was fantastic in the A8.This one? Basically everything I loved about the A8 but with all the bells and whistles of WiFi 6. It has full range throughout my 2 story house, and speed tests confirm it's pretty consistent within the house.As for the renewed thing, after buying an M1 MacAir earlier this year from Amazon, and it being in pristine condition I figured they could handle a mainline router. Comes in a brown box, with power cord (that is the same from my A8), and an ethernet cable. Instructions are provided with a QR code. But it's pretty simple stuff to setup.Very pleased, definitely recommend saving 20 bucks for the renewed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "YUI-METAL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZSK6GD3E3DHPSIY4OPHLUFKSIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4HB9WC7PWRHG?ASIN=B098XZPP35",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "5.0 out of 5 stars No App required!",
                "reviewText": "My Internet company recently upped my speed so I needed to replace my router from 2008 for it to work. However I wanted one that didn't require a stupid APP to set up! Luckily I found this one! The app is optional. It works good and is fast hopefully it lasts just as long as my old one",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zach",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEY4RT523WUXF32Q6MNIJ2YXKAAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L18EVZLBRROX?ASIN=B098XZPP35",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Great replacement for our older Archer C7 AC1750!",
                "reviewText": "The last couple routers that I've used have been TP-Link, and I've always been happy with their products. This router is no different! It has pretty easy setup, and I like the Tether App. I really like the ability to add a WiFi extender using the OneMesh feature. Our older router did not have that, which was one of the reasons for upgrading to this one. We plugged in a RE315 Wifi Extender in our sunroom and connected via OneMesh, and now have strong wifi out on our patio. Signals and speeds have been consistent, with no more buffering!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bhargav",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYRWOK53ZPKHVIF4YCITVW6TXQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FLUZ98WYPPC0?ASIN=B098XZPP35",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great as a vpn router",
                "reviewText": "Just had to install a vpn config for it work as a vpn router. Love it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}