{
    "remaining_requests": 27324,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Google-WiFi-system-1-Pack-replacement/dp/B01MDJ0HVG",
    "body": {
        "name": "Google WiFi System, 1-Pack - Router Replacement for Whole Home Coverage - NLS-1304-25,white",
        "price": "$53.99",
        "originalPrice": "$129.00",
        "rawPrice": 53.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Google-WiFi-system-1-Pack-replacement/dp/B01MDJ0HVG",
        "soldBy": {
            "sellerID": "A3NZWXSNTH0Z2Q",
            "name": "Electronics Club",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3NZWXSNTH0Z2Q&asin=B01MDJ0HVG&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08V2MLHLN"
        ],
        "asinVariationValues": [
            {
                "asin": "B01MDJ0HVG",
                "variationName": "Style",
                "variationValue": "Google Wifi (2016 model) 1 Pack",
                "price": "$53.99",
                "variationImageURL": ""
            },
            {
                "asin": "B01MAW2294",
                "variationName": "Style",
                "variationValue": "Google Wifi (2016 model) 3 Pack",
                "price": "$144.49",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31E0S5ADY9L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/61i2F1rOoML.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81e59Mcl2iL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Google Store",
            "link": "https://www.amazon.com/stores/GoogleLLC/page/080B7645-8292-4117-A6CA-1BF598F3FE26?ref_=ast_bln"
        },
        "brand": "GoogleLLC",
        "merchantInfo": "Sold by Just Right! and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 17088,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Tomorrow, February 15. Order within 5 hrs 29 mins",
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 12 hrs 59 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "A new type of connected system that replaces your router for seamless wifi coverage throughout your home, helping eliminate dead zones and buffering",
            "Network assist technology keeps your connection fast by always selecting the clearest channel and fastest band for your devices; WiFi throughput: 1200 MPBS.",
            "A simple app gets you set up quickly and allows you to see what's connected, prioritize devices, and pause the WiFi on kids' devices",
            "A single WiFi point covers up to 1,500 square feet, a set of three covers homes up to 4,500 square feet WiFi points work together so you can add more if you need additional coverage",
            "24/7 phone support from google; 1 year warranty; material: plastic",
            "Connectivity technology: 2x2 802.11ac Wave 2 + BLE"
        ],
        "description": "Enjoy a fast signal in every room, on every device. Google Wi-Fi is a new type of connected system that replaces your router for seamless coverage throughout your home. It is a standalone whole home mesh system which does not promise compatibility or interoperability with other 3rd party Wifi systems. But compatible with all Wifi client devices.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Whole Home & Mesh Wi-Fi Systems",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17935294011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "4.17 x 4.17 x 2.7 inches"
            },
            {
                "name": "Item Weight",
                "value": "11.8 ounces"
            },
            {
                "name": "ASIN",
                "value": "B01MDJ0HVG"
            },
            {
                "name": "Item model number",
                "value": "NLS-1304-25"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 17,088 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,517 in Electronics (See Top 100 in Electronics) #20 in Whole Home & Mesh Wi-Fi Systems"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 6, 2017"
            },
            {
                "name": "Manufacturer",
                "value": "Google PC"
            },
            {
                "name": "Brand",
                "value": "Google"
            },
            {
                "name": "Model Name",
                "value": "Google Wifi 1-Pack"
            },
            {
                "name": "Special Feature",
                "value": "WPS"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "5 GHz Radio Frequency, 802.11a/b/g/n/ac, 2.4 GHz Radio Frequency"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer"
            },
            {
                "name": "Frequency",
                "value": "5 GHz"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Home"
            },
            {
                "name": "Included Components",
                "value": "1 power adapter, 1 6.5 ft Ethernet cable, Quick start guide, 1 Wifi point"
            },
            {
                "name": "Connectivity Technology",
                "value": "2x2 802.11ac Wave 2 + BLE"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LKF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFMLABA572T23BUGAUUWNGFTKBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M9IZB6XBYQZO?ASIN=B01MDJ0HVG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 5, 2017",
                "reviewTitle": "5.0 out of 5 stars NIce Router--UPDATE",
                "reviewText": "My initial impression of the Wifi System was wrong and I have upgraded it to a five star rating.After some tweaking of the placement of the three nodes included in this kit,, I find that the wifi signal is pervasive throughout my nearly 5000 sf home and is very strong even outside 100 feet away. On top of that, the system is rock solid and stable-- a consistent and powerful signal wherever I need it. I have gigabit service and wifi speeds are consistently 50MB download (though quite a bit slower upload) at most usable distances. Within a few feet of the router, I am topping 400MB!Not sure why it did not impress me at first. My only thought is that the system may take some time to configure how it connects itself to create the mesh.Very impressed now.++++++++++++++I like it but don't love it after a few days of use.Purchased Fios gigabit service-- which has been a huge disappointment because the only place you can get giga speed is right at the verizon modem. My house is wired with cat5 however cat5e is the protocol which provides reliable gigabit service. Best I could do on a hard wired setup was about 150 MB. WiFi is also not as robust--but I figured that mesh networking is the latest and greatest and worth a try.Very easy to set up, application is simple and quick-- I had the three wifi points included in the box up and working in a few minutes. One plugs into your cable modem's WAN port (generally a yellow outlet) with the included patch cord. The other two units are placed about a room or so away from each other to provide an area of consistent coverage.So it works. However the blazing fast gig speed is only available in a small circle around the hardwired unit plugged into the cable modem. The network is solid and fairly large throughout my house however speed at any of the other units drops off significantly and is only about 50MB or so generally.Now 50MB is substantially enough to do anything you want including streaming videos--however, I was looking to spread gig speed throughout the house and this device will not do that.I do have an Archer TP 7 wifi which is really substantially stronger and costs less than $100 bucks. Comparatively, the google wifi units provide a slightly more consistent field but over a lesser area. I can pick up a usable wifi signal from the TP7 more than 150 feet away-- at a point where the signal from the three google units are not even showing up on my device.SO... perfectly usable and lovely looking google wifi is neat and works-- but doesn't do much more than a cheaper but much more powerful regular modem.You would think that all of this would be second nature by now-- strong wifi wherever you need it doesn't sound like asking too much if you are willing to pay. However, it is not as simple as it looks and this device isn't pushing any envelopes in my humble opinion.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marty B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3MFCCZGVYV7XRSZMHOP4QM7L2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14KCYVJ61ZJEZ?ASIN=B01MDJ0HVG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2017",
                "reviewTitle": "5.0 out of 5 stars Day One Experience with Google WiFi - Updated",
                "reviewText": "After 18 months, my Google WiFi is doing great. It provides a consistent and strong WiFi signal throughout my home and in my front and back yards. I almost forget about it, but it is always there. I tested another current (2018) system by Linksys, but it was not as consistently fast as my Google system. Get this - you will be happy with it.Original Review:Day One: Loving it... I have a two story home and use Comcast for my internet service provider. They provide a single modem / router which reaches most of my home pretty well. It is located upstairs in a front room of my home. Unfortunately, it doesn't do a tremendous job of reaching my downstairs office and is spotty in my back yard. I like to listen to my Sonos system when I'm by my swimming pool and it's always a 50-50 proposition if my phone can stay connected to my home network to control the Sonos. Occasionally, when I run backups, my backup program tells me that I have lost connection to the network drive. I have tried a couple of TP-Link range extenders and they help, but not overwhelmingly.After reading a TheWireCutter article on mesh networking products, I decided to try Google's WiFi system. WireCutter actually recommended Netgear's Orbi, but as I read their review and others, I concluded that the Orbi really isn't mesh at all..... it's just a really really strong WiFi router and repeater. I'm sure it works fine, but it is more money than Google's product and I wanted to try a true mesh network.I set the Google WiFi up this morning. It took about ten minutes to put all three units in play. I think it took longer for me to come up with a clever name for my new home network than to physically install the units. The app for the system is very easy to follow, in true Google fashion.I tested the WiFi signal throughout my house and compared it to my still functioning Comcast WiFi signal. Outstanding! In places where my old signal was wimpy, the Google system was pumping out a strong clear signal that permeated places in my back yard yet unseen by WiFi. Very impressive.Next: the fun part--- reconnecting everything in the house to the new WiFi connection and new network. I have a 26 port network switch which connect my two network attached storage drives, my television and DVD player and my beloved Sonos bridge. I ran an ethernet cable from the 2nd port on the main Google unit to the switch and hoped that it would instantly allow access to everything. Nope... everything still expected to be connected to the original network. So, I disconnected cable running from the Comcast router to the switch, waited a few minutes and then checked. That was all I needed to do for those devices to connect - just give the switch ONE connection the network running through the Google router.The next issue I encountered was that my Sonos system would run fine from my PC, but not from my android phone or tablet. In fact, it caused an issue where my phone and tablet would connect to my Google network, then disconnect, then reconnect. I couldn't get my Sonos app to control anything. I called Google's support line for this WiFi system to see if they could help. They gave me some good advice:- first, don't expect everything on your network to instantly recognize everything else. I've noticed in the past when I connect network devices, like NAS drives, they don't always connect for a few minutes. Sean, from Google support said that things might take a day or two to be fully integrated.- second, when something isn't quite right, power down your modem and your Google WiFi router - the one connected to your modem. Wait five minutes and then restart your modem. Give that about three or four minutes to fully come back to life, then power on your WiFi again. That can take a minute or so to fully reboot. When I did this, my Sonos system was fine and was fully controllable by my android apps.So, it's still early in the game, but I now have a really strong WiFi signal throughout my 3350 square foot house. I have a very good WiFi signal out by my pool. My network backups appear to be running much quicker and complete without interruption. I'll update this as things progress, but on Day One, everything seems to be better, faster and running just great.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joni",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWBKCNIMT5LORJ67TFOEXEBN6JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZUZRYNFB8BUA?ASIN=B01MDJ0HVG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars 45+' to shop and it works!",
                "reviewText": "I have a shop with a small \"bunker\" as my wife calls it with a smart TV and other essentials. I researched and tried several devices before this one to no avail. I asked the question re: distance and the tech response was \"maybe if you place one in a water tight box half way it would work\". I did purchase a water tight box but decided to try adding it to the garage instead (the garage is between the house / modem and the shop). I set it up and BAMM! WiFi connectivity! The reading between the house and the garage was Very Strong while the connection between the garage and the shop is Strong. I'm an old dude and this was pretty easy to set up. The only thing I don't care for is you have to download the Google Home app to your phone and I despise having a bunch of miscellaneous apps on my phone (old dude). With that said, once downloaded, the app made connecting a breeze. In case you're like me and don't spend your life trying to download every app under the sun I would say be certain to snag the Google Home app as there will several other pretenders to the throne offered to you and some with a subscription. The Google Home app was free and easy to navigate. Again, nearly 50 ft to the shop, 4 interior walls between the \"modem\" connected device and the first \"node\" in the garage (about 20') and one exterior wall on the garage with a rock facia and 25+ feet to the shop node that sits in a window sill facing the house / garage. If I was super geeky I could tell you all the up and down speeds but that's not me. I can tell you that I can stream movies and music with zero buffering and exquisite 4HD quality.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 3, 2021",
                "reviewTitle": "Muito bom produto",
                "reviewText": "Esse wifi mesh é muito bom. Tenho quatro em casa e posso andar na casa toda sem perder a qualidade da conexão. O software é ótimo e permite que vc monitore o estado de cada hub. Além de boa qualidade ele é bem bonito e fácil de instalar. Nota 10 !",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claudio LuquesClaudio Luques",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 14, 2020",
                "reviewTitle": "Excelente roteador",
                "reviewText": "Excelente produto, mantém a rede estável e distribui a sua disponibilidade de velocidade de acordo com a necessidade dos dispositivos conectados",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-rhyMtjxL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "RexxRexx",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2020",
                "reviewTitle": "100% satisfied and very impressed!",
                "reviewText": "After much research, decided to replace our cable router Wi-Fi + various older routers converted into Wi-Fi access points around the house with the Google Whole Home (3 access points) a mesh network. We had lots of dead-spots around the house (3 floors, 1,000 sqft/floor), and everyone had to constantly switch between a number of unique Wi-Fi networks depending on what room they were in. Our home is wired with LAN cabling, so I wanted a mesh network with a wired backhaul for maximum performance, which ruled out the newer Google Nest Wi-Fi system. Before installing I (1) called the cable company to add a 2nd IP, (2) turned on IP Passthrough on router port 1 and (3) turned off/disconnected all my existing wifi networks. I then hooked up the first point to router port 1, and then deployed the other 2 points around my home using the phone app; the process took about 15-20 minutes! NO more dead spots anywhere in our house! Google says to setup the system wirelessly first, then (optional) wire them together with LAN cable afterwards. Even in 100% wireless mode, the coverage and speed was amazingly better than our old system. Once I hardwired in the backhaul, we’re getting 150 - 300+ mbps on our wireless hardware around the house vs about 20-50 mbps before (we have a Shaw Internet 300 plan). I turned on the Guest network to connect all our various IOT/automation devices to secure that traffic away from the main user network, in case any of the devices or providers get hacked. This was the best $300 (on-sale after Xmas) I have spent; it’s very easy to set up, the phone app is great and it all works way better than I could have imagined.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ZV3OT5aEL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nilofar  lasania",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 3, 2020",
                "reviewTitle": "Excellent product",
                "reviewText": "Its very easy to install and wifi signal is excellent it easily cover my 2bhk , it looks pretty decent with led light.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 27, 2019",
                "reviewTitle": "Problems with broadband - get these",
                "reviewText": "Delighted, if you’re struggling with your virgin router and paying a fortune for fibre broadband get one or more or these, plug in to the back of your router and set up a new network - google easy and works properly - genuinely made a massive difference",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$53.99",
                "sellerName": "GoodStuff CR Division",
                "sellerRating": "4.5"
            },
            {
                "price": "$53.99",
                "sellerName": "Next Generation Tech",
                "sellerRating": "4.5"
            },
            {
                "price": "$129.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}