{
    "remaining_requests": 27111,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Certified-Refurbished-eero-reliable-Coverage/dp/B0B5W5FK78",
    "body": {
        "name": "Certified Refurbished Amazon eero 6+ mesh Wi-Fi router | Fast and reliable gigabit speeds | connect 75+ devices | Coverage up to 1,500 sq. ft. | 2022 release",
        "price": "$104.99",
        "originalPrice": "$124.99",
        "rawPrice": 104.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Certified-Refurbished-eero-reliable-Coverage/dp/B0B5W5FK78",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C1RZJW2M"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31jr8FBHfEL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/11u7Coc9SXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418aYbEPoQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XF1xYrfML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qX DHl SL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SeyhNNEBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51z8HZhYimL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the eero Store",
            "link": "https://www.amazon.com/stores/eero/page/FC890135-A1A9-499D-91A1-860E8614C254?ref_=ast_bln"
        },
        "brand": "eero",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 225,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20. Order within 12 hrs 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "A Certified Refurbished Amazon eero 6+ mesh Wi-Fi router is refurbished, tested, and certified to look and work like new and comes with the same limited warranty as a new device. Certified Refurbished Amazon devices may be packaged in generic Amazon-branded boxes.",
            "A GIGABIT SPEED ROUTER, FOR LESS - Supports wifi speeds up to a gigabit, without the premium price tag. eero 6+ is our most affordable gigabit router ever.",
            "WI-FI 6 GETS A BOOST - eero 6+ supports additional wifi bandwidth on the 160 MHz radio channel (that’s just wifi talk for faster connectivity). With the eero 6+, you’ll get enough wifi for the whole family to work, stream, and video chat—all at the same time.",
            "EXPERIENCE THE EERO TRUEMESH DIFFERENCE - eero’s patented TrueMesh technology intelligently routes traffic to reduce drop-offs and dead spots.",
            "SET UP IN MINUTES - The eero app guides you through setup and allows you to manage your network from anywhere.",
            "WORLD-CLASS CUSTOMER SUPPORT - Any questions? Our expert wifi troubleshooters are ready to help by phone in the US at +1-877-659-2347 or by support@eero.com.",
            "GETS BETTER OVER TIME - Receive automatic updates to help keep your network safe and secure. Online security and additional network management features available via a separate subscription.",
            "BUILT-IN SMART HOME HUB - eero 6+ contains a smart home hub to connect compatible Thread and Zigbee devices on your network with Alexa, replacing the need to buy separate hubs.",
            "EASILY EXPAND YOUR SYSTEM - With cross-compatible hardware, you can easily add eero products as your needs change."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Wifi coverage",
                "value": "Covers up to 1,500 sq ft"
            },
            {
                "name": "Type",
                "value": "Router (connects to modem as primary router)"
            },
            {
                "name": "Supported speeds",
                "value": "Supports ISP plans up to a gigabit"
            },
            {
                "name": "Wi-Fi connectivity",
                "value": "Wi-Fi 6 dual-band concurrent 2:2 (802.11ax); compatible with older wifi standards"
            },
            {
                "name": "Wired connectivity",
                "value": "Two auto-sensing gigabit Ethernet ports"
            },
            {
                "name": "Speed Rating",
                "value": "AX3000"
            },
            {
                "name": "Smart home connectivity",
                "value": "Works with Alexa, Amazon Frustration Free Setup, 802.15.4 radio (Zigbee, Thread), Bluetooth Low Energy 5.0."
            },
            {
                "name": "Electrical Rating",
                "value": "100-240V AC, 50-60 Hz"
            },
            {
                "name": "Processor, memory, and storage",
                "value": "1 GHz dual-core processor, 512MB RAM, 4GB flash storage"
            },
            {
                "name": "Network security and services",
                "value": "Profiles, WPA3 (eero Labs feature), WPA2, TLS v1.2+, VPN passthrough, IPv6, NAT, UPnP, port forwarding, DHCP, static IP, and cloud connectivity."
            },
            {
                "name": "Required for setup",
                "value": "Supported iOS or Android device and internet service (with cable or DSL modem, if required). See requirements."
            },
            {
                "name": "Temperature Rating",
                "value": "Operating: 0˚C-40˚C Storage: -25˚C-60˚C Operating humidity: 0%-90%, non-condensing Operating altitude: <3000m"
            },
            {
                "name": "Dimensions",
                "value": "3.9 in x 3.8 in x 2.6 in (99.4 mm x 97 mm x 65.8 mm) Actual size and weight may vary by manufacturing process."
            },
            {
                "name": "Warranty and Support",
                "value": "1-year limited warranty. Free customer support is available 7 days a week. Learn more about warranty and support. This device receives the same limited warranty as a new device. Learn more about Certified Refurbished Amazon devices."
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least five years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates."
            },
            {
                "name": "Subscription",
                "value": "30-day eero Secure trial is limit one per new eero customer account. Additional terms apply, see the eero Secure Terms of Service for more details. eero Internet Backup performance will vary and you are responsible for data charges with backup connection providers. Learn more about eero Internet Backup requirements, performance, and compatibility here"
            },
            {
                "name": "Legal Disclaimer",
                "value": "Some features require linking your Amazon account, and downloading the Alexa application or using a compatible Alexa device. Internet connection speeds and availability depend on your internet service provider; if your internet service provider does not provide you with the maximum supported speed, you will not experience that maximum speed. Maximum network speeds, if applicable, reflect combined supported speeds across wired and wireless clients. Maximum wireless signal rates are derived from IEEE 802.11 standard. Specifications assume wired Ethernet connection; your experienced speed may vary when connected to an eero device that is configured as a wireless extender. Coverage estimates are based on normal use conditions. Actual range and performance can vary, and maximum supported speeds may not be available to all customers, due to factors such as local regulations (including power limits), network configuration, interference, connected devices, device usage, building materials, and obstructions. Specifications are based on use of a Wi-Fi 6 or later generation client device that supports 160 MHz. For more information about eero performance, visit support.eero.com. Combining eero 6+ devices with older generation eero devices on the same network may result in reduced performance across the network."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Thomas A Chicoski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHOGXUIV7ACTSKMEOHYJPSUIJ5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32H24ACQIRZZZ?ASIN=B0B5W5FK78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars great mesh wi-fi router",
                "reviewText": "I got this to further extend my mesh wi-fi router system. Came quickly and set up very easily. Works like a charm.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex MAlex M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV322YECIB5XLNNA3EVJ2AM4VMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W3DYQMA96MIL?ASIN=B0B5W5FK78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect for a Smart Home Setup!",
                "reviewText": "I picked up this router during my recent switch to a new internet provider, and it's been nothing short of fantastic. If you're someone with a plethora of IoT or smart devices at home or work, this router is a dream come true.The accompanying app is a standout feature. It provides an overview of all the devices on your network and even lets you boot off any unknown or unwanted guests. Plus, for those with Alexa devices, here's the kicker – you can use them as signal extenders, ensuring that your Wi-Fi reaches every nook and cranny of your space!Installation was a breeze. Just plug it into power and your modem, then follow the user-friendly steps in the app. Once it's all set up, it's a compact little box that you can easily tuck away.If you're looking for a reliable router with smart features and seamless performance, this one has my full recommendation. It's made managing my connected devices a breeze!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711ttWxqE0L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susanne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERHKNLEG2T2YGLKUFCDYBFQDAUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F5GNL4HCHZA9?ASIN=B0B5W5FK78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Great refurbished item, like new",
                "reviewText": "I replaced my original Eero router with the 6+. The replacement was super easy with the app, and the coverage and speed is much better.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Todd M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUNPFGR6QXBZ6KYBMFLMC4AZZUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G8U242V8246J?ASIN=B0B5W5FK78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Best way to set up a home network",
                "reviewText": "This system is easy to set up and control via the app. Coverage is great, and I have never had any issues. This is the third that I purchased to make sure the network is strong all over a 3800 sq ft house.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. S. Keck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMCSD4XRDESLN3XN652UBSAGMDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D7CX3IX0B3T?ASIN=B0B5W5FK78",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Easy to Set Up - Blankets Our House with WiFi",
                "reviewText": "We have a 1500 sq ft home on Cape Cod with SimpliSafe security and cameras, video doorbell, ets. The Xfinity-provided wifi modem wasn't giving us reliable coverage for the doorbell cam and another camera on the garage at the other side of the house. I purchased a Motorola DOCSIS cable modem and got rid of the Xfinity modem, then connected this refurb eero system. Super-easy setup. App tells you if you're placing the satellite mesh devices in a good location. One thing to note: eero runs a 2.4ghz network and a 5ghz network simultaneously, and names both of them the same. If you have 2.4ghz-only devices (like my older Kindle, the SimpliSafe system, or Amazon Echo devices), you will probably have to use the eero app to PAUSE the 5ghz network and let your devices connect to the 2.4ghz. I did that initially when connecting these more-selective devices, and they seem to reconnect fine on their own now, HOWEVER, I occasionally have to manually PAUSE the 5ghz network to let the SimpliSafe base station reconnect. It's a bit annoying but not a deal-breaker. Also, the eeros all have 2 Ethernet ports on the back, so there's only 1 port available at the main router. I purchased an inexpensive unmanaged Ethernet switch for my desktop so I can get multiple devices plugged in. Overall, very satisfied with the performance. Cable internet is asymmetric; on wifi or hardline, I get roughly identical up/down speeds, so no complaints, although despite paying for \"gig speed\" from Comcast, I'm averaging 550 down and 25 up. supposed to be \"up to\" a gig down and 30 up. Meh. Spoiled by my Sonic gigabit fiber to the house in CA, I guess. ;-)",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris 2321",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKKIWVOR66EUTXUW42YP6NZKE3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25VZ0S0GQ6LBV?ASIN=B0B5W5FK78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect upgrade",
                "reviewText": "I needed something additional since my current system gave us some wifi dead spots in the house. This exceeded expectations. It connected directly with my fiber network and I placed 2 more at each end of the house. Exactly what I needed. Super easy setup and user friendly app.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dona Pete",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4PGRSITDG6EK6J6NKWOKSLH4KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I4E9DYIY3Y7B?ASIN=B0B5W5FK78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Like new and works perfectly.",
                "reviewText": "I need an additional eero 6+ and decided to try refurbished. It looks new and works perfectly. I saved $40 as compared to new and I can't tell the difference. Thank you.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUD3KKLEPUIMOW7XKJ7P3KH6DBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Q6BVJLI5GBWP?ASIN=B0B5W5FK78",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Must Perform a firmware update",
                "reviewText": "When I first was setting these up there were a few technical glitches that I think can help you if you know out of the gate. I was to the point that I thought I was going to have to return these. Instructions in the app tell you to disconnect everything from your modem and restart it but it doesn’t tell you is that you need to reboot your modem and let it power up on its own and make sure it’s connected to the Internet THEN plug in your first eero and begin the set up process. If you do not do this then it will fail because it’s trying to utilize the Internet to register the first device as the main gateway. It quickly registers and set up and asked you to name the Wi-Fi network. Then it prompts you for a firmware update to which you have the option to skip for now or update immediately. Since I had a three pack and I wanted to go ahead and set up the rest of the units first I chose to skip the firmware update as it said it could take up to 15 minutes. The problem is I guess because there was such a firmware gap from what it arrived with versus what it needed to be updated with that it would not allow any of the other units to see each other when you try to add them into the mesh. Literally no matter how close they were to each other it would fail and tell you that they were too far apart. It got to the point where I literally sat them next to each other and still got that error stating that they were too far apart in which I thought I was going to have to return the unit at that point. I decided as a last ditch effort to go ahead and perform the update on the initial main unit which is called gateway and after I did that every other eero Learned and perfectly and immediately no matter where I had them placed in my house.Definitely let your modem be connected fully to the Internet before powering up the first Gateway and definitely perform the firmware update on the first unit when prompted before learning in the rest and you shouldn’t have any issues.Lastly I have an older laptop computer (like 5 years old) and it could not see the Wi-Fi 6 signal. I had to update the driver on my laptop network card and it was able to immediately see the network. So if you have any older computer that’s also something you might want to know. You can usually very easily find the driver needed at your computers manufacture’s website",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}