{
    "remaining_requests": 27152,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Linksys-AC900-Smart-Router-Refurbished/dp/B00LV7O9FI",
    "body": {
        "name": "Linksys AC900 Smart Wi-Fi Router (Refurbished)",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Linksys-AC900-Smart-Router-Refurbished/dp/B00LV7O9FI",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41h -Y0MnQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31rD31TAMPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/312VcIi45uL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Linksys Store",
            "link": "https://www.amazon.com/stores/Linksys/page/E0C967DE-6A97-4E8F-9358-86C50D6219E8?ref_=ast_bln"
        },
        "brand": "Linksys",
        "merchantInfo": "",
        "customerReview": "3.5 out of 5 stars",
        "customerReviewCount": 78,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "This Certified Refurbished product is manufacturer refurbished, shows limited or no wear, and includes all original accessories plus a 90-day warranty",
            "Wireless AC Technology - The Linksys EA6200 uses the next generation Wireless AC technology for powerful networking.",
            "Ultimate Speed - With the Linksys EA6200 Experience up to AC900 Mbps (N300 +AC565).",
            "Dual Band 2.4 + 5 GHz - Double the bandwidth to maximize wireless throughput.",
            "USB 3.0 Port - Add external storage or other devices to share across your network. USB 3.0 transfer rate is 10x faster than USB 2.0.",
            "Beamforming Technology - Focuses wireless signal from router to the client device for optimal performance."
        ],
        "description": "Wireless-AC for Faster Speed and Reliability Upgrade your wireless home network and enjoy faster speeds than conventional wireless-N using the AC900 Dual-Band Smart Wi-Fi Router from Linksys. This router offers wireless-AC technology, which delivers a faster, stronger Wi-Fi connection ideal for online HD video streaming services. With speeds up to AC900 Mbps (N300 +AC565), wireless-AC provides gigabit Wi-Fi speeds that allow content to download faster. Wireless-AC makes it possible for you to stream shows on your HDTV while family members download music or other files--without interruption due to a slow network connection. The AC900 includes a USB 3.0 port and four gigabit ports to let you connect multiple devices, allowing you to quickly print, share, and store content across your network. Beamforming Creates Stronger, Faster Connections The Linksys AC900 Smart Wi-Fi router features beamforming, an innovative technology that optimizes the wireless signal strength between your connected devices and Linksys router. Beamforming enables the router to identify and connect directly with other devices, rather than simply sending out wireless signals in a general direction. The result is faster network speeds, better wireless range, and reduced interference from other devices. It also helps extend the battery life of connected devices and reduce their power consumption because data is transferred more quickly. Manage Your Home Network Remotely with Linksys Smart Wi-Fi Using Linksys & family of wireless-AC peripherals, you can take full advantage of the improved speed and stability of wireless-AC. Linksys Universal Media Connector lets you connect wired devices such as game consoles and smart TVs to your Wi-Fi network and stream HD or even 3D HD video content. The connector operates on the 5 GHz band, resulting in less interference and a clearer signal.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Networking Products",
                "link": "https://www.amazon.com/Networking-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172504"
            },
            {
                "name": "Routers",
                "link": "https://www.amazon.com/Routers-Networking-Online-Communication-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=300189"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Type",
                "value": "‎2.4 GHz Radio Frequency"
            },
            {
                "name": "Brand",
                "value": "Linksys"
            },
            {
                "name": "Series",
                "value": "‎Linksys AC900"
            },
            {
                "name": "Item model number",
                "value": "‎EA6200-RM"
            },
            {
                "name": "Item Weight",
                "value": "‎1.8 pounds"
            },
            {
                "name": "Package Dimensions",
                "value": "‎13 x 10.5 x 2.7 inches"
            },
            {
                "name": "Manufacturer",
                "value": "‎Linksys"
            },
            {
                "name": "ASIN",
                "value": "‎B00LV7O9FI"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎June 1, 2014"
            },
            {
                "name": "Customer Reviews",
                "value": "3.5 3.5 out of 5 stars 78 ratings 3.5 out of 5 stars"
            },
            {
                "name": "Model Name",
                "value": "Linksys AC900"
            },
            {
                "name": "Special Feature",
                "value": "WPS"
            },
            {
                "name": "Frequency Band Class",
                "value": "Dual-Band"
            },
            {
                "name": "Wireless Communication Standard",
                "value": "2.4 GHz Radio Frequency"
            },
            {
                "name": "Compatible Devices",
                "value": "Gaming Console, Smart Television"
            },
            {
                "name": "Frequency",
                "value": "5 GHz"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Home"
            },
            {
                "name": "Connectivity Technology",
                "value": "WiFi"
            },
            {
                "name": "Number of Ports",
                "value": "3"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ron Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENAJ5JXPAMWODSPKO2AEU3EEUDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N5S1FNLEFWDG?ASIN=B00LV7O9FI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2015",
                "reviewTitle": "5.0 out of 5 stars I lucked out and got a good one",
                "reviewText": "I've had one of these for 3 months and it has been rock solid. It can't be beat for the price, assuming you get a good one. The cloud setup is a little unsettling (what problem are they solving exactly?) but it works. I get 867 Mb/s connections on a MacBook Pro, mostly because my neighbors don't have 802.11ac routers yet. In three years when Belkin decides it isn't making any money and the new buyer of Linksys discontinues the cloud service, I'll probably feel like I got my money's worth and also feel cheated at the same time. Why worry about the future when there's enough to worry about today?As an aside and in response to another review, no third party router works with Comcast for long -- it's a PC or the highway if you don't lease their router. Non-approved MAC addresses (fixed endpoint identifiers assigned to each manufacturer) are alternately ramped down to near-zero bandwidth or excluded from Comcast's ARP table, meaning no connection at all. Basically anything other than a PC or a Comcast router is useless. You can complain until the cows come home and it doesn't make a bit of difference. So I use Windows with Internet Connection Sharing as a router and save the $10/month rental fee. At least until CenturyLink chooses to rewire my neighborhood.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephen Gibson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI2YKTEGM4Q7IXRYHKVT2UZELZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3S3ICV990ZE84?ASIN=B00LV7O9FI",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2014",
                "reviewTitle": "1.0 out of 5 stars Stay away, no range and constant connection drops...... Consider yourself warned!",
                "reviewText": "I had the urge to get a new router to replace my 5 year old Netgear WNR2000.I had high hopes setting this one up that I more bandwidth and better connectivity through my entire home. I can connect to the 5 year old router anywhere in my home, but after setting up this router the first thing I noticed is the signal was much worse on the 2.4GHz band. Ridiculously worse! there is 30db less at only 10' away. One the second level of our home it was nearly nonexistent with 2 of our wireless devices unable to connect at all. This was never a problem with our old router. I thought about just getting a repeater for the upstairs until the next issue showed up.Stability? My old router was rock solid, but this router was constantly dropping out while streaming through wireless. This is something I am not accustom to and I was amazed how much worse this was than our old setup.I had high hopes. I was excited at the prospect of having dual band, gigabit, USB (for a network storage device) and more bandwidth for streaming through my ever growing network. The ridiculous lack of range and stability with this router are far too sub par to be adequate for wireless streaming. Bad enough it drops out when you are surfing the web and you have to wait for it to reconnect, even worse when you constantly lose your movie streams.I couldn't tolerate this any longer. I'm returning this router tomorrow and diverting back to my old router. I can live without gigabit and dual band for now to have a router worth connecting to.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gary J Griff",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUJQ6IVORYU2VABTB5KPWCBUMPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZX6WZX4O5SW?ASIN=B00LV7O9FI",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 25, 2015",
                "reviewTitle": "3.0 out of 5 stars OK router",
                "reviewText": "Good router, easy to install, worked for everything except I could not get a 1 TB hard drive to access the USB port, even though the information I got on it said it would. I am returning it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "thepiratemorgan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPRPDDHVCZ5FTZNQ6WCVEDEFN3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BTKTBF07VR3B?ASIN=B00LV7O9FI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2014",
                "reviewTitle": "4.0 out of 5 stars Pretty fast and stable, better than last 2 Netgears I've owned.",
                "reviewText": "Reasonably stable router, I've had a few times where I've needed to reboot it, maybe once a month. Not nearly as bad as the last Netgear router I owned. I like the new interface, although some settings seem \"buried\", but you get the hang of it if you access it enough. You CAN log into this without a \"Cisco Smart Wifi\" account, so don't let other reviews say you can't. There is an option on the main interface page to \"log into router\" AND an option to log in with Smart Wifi. It may have been a past practice of Cisco to require a Smart Wifi account, but with the latest firmware, I can tell you mine does not. I took off one star because the range is only slightly, if at all, better compared to the Netgears. I would have thought the antennas would be better in a Cisco.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Oriel Rivera",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH665CU5KXJYKI5V33FROM5WFDYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EA51HFYORT9M?ASIN=B00LV7O9FI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 22, 2016",
                "reviewTitle": "5.0 out of 5 stars Nice Wireless Router. Bang for your buck",
                "reviewText": "I bought this refurbished and it certainly is a lot of bang for my buck. It is fast, stable, reliabe and can be tuned to your need. I personally don't like very much the new \"more graphic\" interface, but is not a problem.I plugged a USB 3.0 USB and I feel (not scientifically based appreciation) that it isn't as fast as it should be for uploading heavy files, bu for streaming seem to work fine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}