{
    "remaining_requests": 403,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Legends-Lattes-Novel-Fantasy-Stakes/dp/B0B3G97QY1",
    "body": {
        "name": "Legends & Lattes: A Novel of High Fantasy and Low Stakes",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Legends-Lattes-Novel-Fantasy-Stakes/dp/B0B3G97QY1",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51SvT6mQNcL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Travis Baldree",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Travis+Baldree&search-alias=audible"
        },
        "brand": "Travis Baldree&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 19999,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "This program is read by the author.The much-beloved BookTok sensation, Travis Baldree's novel of high fantasy and low stakes.Come take a load off at Viv's cafe, the first and only coffee shop in Thune. Grand opening!Worn out after decades of packing steel and raising hell, Viv, the orc barbarian, cashes out of the warrior’s life with one final score. A forgotten legend, a fabled artifact, and an unreasonable amount of hope lead her to the streets of Thune, where she plans to open the first coffee shop the city has ever seen.However, her dreams of a fresh start filling mugs instead of swinging swords are hardly a sure bet. Old frenemies and Thune’s shady underbelly may just upset her plans. To finally build something that will last, Viv will need some new partners, and a different kind of resolve.A hot cup of fantasy, slice-of-life with a dollop of romantic froth.A Macmillan Audio production from Tor Books. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b?ie=UTF8&node=720360"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Action-Adventure/b?ie=UTF8&node=10159265011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "7 hours and 19 minutes"
            },
            {
                "name": "Author",
                "value": "Travis Baldree"
            },
            {
                "name": "Narrator",
                "value": "Travis Baldree"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "June 14, 2022"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0B3G97QY1"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#696 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Gaslamp Fantasy (Audible Books & Originals) #8 in Gaslamp Fantasy (Books) #40 in Action & Adventure Fantasy (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lark of The Bookwyrm's Hoard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGIKB2T7Q5XPKUTJFVUYVQQYHGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34DO0WT8U8J1Z?ASIN=B0B3G97QY1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Heartwarming cozy fantasy",
                "reviewText": "What can I say about LEGENDS & LATTES that hasn’t already been said? Baldree’s breakout, bestselling debut novel hits the sweet spot for me: low-stakes cozy fantasy, found family, believable (and likeable) main character, interesting secondary characters, and solid worldbuilding with a D&D feel. It’s a well-crafted novel with good pacing and just the right amount of description…enough to bring the scenes vividly to life without overwhelming the action or Viv’s emotional journey.Speaking of Viv, I almost didn’t read the book because my concept of orcs is decidedly influenced by Tolkien, who in turn was influenced by George MacDonald’s goblins (with which I’m also familiar.) In other words, I was put off by the mere idea of an orc as a main character. (More fool me; I should know better than to judge based on stereotypes, even in fiction!) But between the internet buzz, the delightful cover art, and the seemingly unlikely premise—an orc mercenary retiring to open a… coffee shop?!—I decided to give it a try, and I’m so glad I did. I fell hard for Viv and her newfound friends, for her respect for others regardless of species, and for the warmth and welcoming atmosphere of the Legends & Lattes café.And omg, the food descriptions! I can’t read the book without craving cinnamon rolls, chocolate croissants, biscotti, and (since I can’t drink coffee) a decaf chai latte to go with them.I love LEGENDS & LATTES so much, it has joined the ranks of my rereadable “comfort books,” and I have already read it twice. I can’t wait to read the prequel, BOOKSHOPS & BONEDUST![NOTE: Review originally published on my blog, The Bookwyrm's Hoard.]",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott Slemmons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNNA6PWC526R4M5PMM72PZCPX2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2K2YHH91S7MH?ASIN=B0B3G97QY1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Cozy and Fun",
                "reviewText": "In this fantasy novel, our lead character is Viv, an orc barbarian who has gotten tired of the adventuring life. After one last job, she's able to kill a giant spider-like monster called a Scalvert Queen, and the only treasure she takes from its hoard is a Scalvert's Stone, a magical organ the monster has grown in its skull. The Scalvert's Stone is rumored to bring fortune to its owner. From there, Viv travels to the city of Thune, where she buys a run-down livery stable, buries the Stone under the building, and gets to work to realize her fondest dream: owning a coffee shop.Yes, a coffee shop.And almost no one in Thune has any idea what coffee is. Ale? Yes. Tea? Yes. Coffee? Crushed-up beans mixed with hot water? Sounds weird, yo.But before you can have a coffee shop, you need to have a shop -- and a busted down livery isn't inviting to customers. So she hires a hob named Cal, and they get to work renovating the property. While that's going on, Viv hires an assistant to help run the place. Tandri is a succubus -- but not the \"horny demon that screws you to death\" kind of succubus. In fact, she keeps herself severely buttoned-down and works at being as emotionless as possible. Still, she's helpful, creative, and artistic, and takes over maintenance and updating of the shop's signage and menu, along with working at the front counter. And finally, she hires Thimble, a very quiet ratkin who is an absolute genius baker, and who keeps customers stuffed with delicious pastries.Once the shop opens -- under the name \"Legends & Lattes,\" of course -- it enjoys slow but steady growth, particularly as new items are added to the menu, and it attracts a host of regulars, including an aspiring musician with an experimental guitar, a wizard student who really just wants somewhere to study, a chess-playing gnome who may exist outside of time, and an extremely large and extremely useful dire cat.But the success of the business brings other problems. The local crime boss, the Madrigal, sends bands of thugs to pressure Viv to pay the protection racket, and Fennus, an elf who used to be part of Viv's adventuring party, figures out that she has a Scalvert's Stone and has decided to steal it from her, no matter what the cost.Can Viv figure out a way to keep her shop afloat in a world of cutthroat thieves and crooks? Can she keep her customers and her employees happy? Can an orc barbarian find love in a world of iced lattes, ley lines, and cinnamon rolls?So what the heck with this thing, huh? A fantasy novel where there's relatively little swordplay or magic, where the action sequences are few and far between, where there's more emphasis on coffee, baking, carpentry, and feeeeelings? How is that supposed to work?!Well, the thing is, it works a peach. The plot and characters are engaging, it's a fast-moving and fun read, and it's absolutely a pleasure to read a fantasy novel where you don't have to constantly worry about assassins and dark mages and quests and chosen ones and dragons.You always hear stodgy old-timers complaining about these cozy fantasies, but it's not like it's a new upstart sub-genre overthrowing True Fantasy. Elements of cozy fantasy have appeared in dozens of established classics. A major element of Tolkien's work was the detail and love he put into descriptions of feasts and the joys of living in a homey community like Hobbiton. Almost every Studio Ghibli movie has strong elements of coziness running through it. Authors whose books regularly explore cozy fantasy include Terry Pratchett, Neil Gaiman, Brian Jacques, Becky Chambers, T.J. Klune, Diana Wynne Jones, T. Kingfisher, Katherine Addison, and many others.Still, cozy fantasy didn't really become an important sub-genre until this book came out and proved to be extremely popular. Cozy fiction in general seems to be enjoying a surge in popularity. Basically, we live in interesting times. We can't afford houses. Prices on food keep going up. We can't afford many luxuries. We can't trust politicians, judges, the media, the police, or much of anyone else. The environment is absolutely falling to pieces. Our rights as human beings are being attacked on multiple fronts. Nazis march in the streets, and no one does anything to stop them. Everything is stress, stress, stress, and more stress.But a cozy fantasy like \"Legends & Lattes\" gives you access to a warm, welcoming coffee shop in an entertaining setting, where you can imagine yourself sitting quietly, enjoying an iced mocha and a biscotti, watching an orc brew coffee, an oversized mouse baking cinnamon rolls, a giant cat curled up in the corner, and a gnome playing chess with himself. It's comforting, and fun to read, and that's a fine way to spend a weekend.",
                "reviewVotes": "53 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Bookwyrm Speaks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAUY6S2QQDD4ITMPRZAPKWMCYPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39A5DPZYPCTZS?ASIN=B0B3G97QY1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 13, 2022",
                "reviewTitle": "5.0 out of 5 stars Just a fantastic slice of life cozy fantasy.",
                "reviewText": "When I heard that one of my favorite narrators, who also happens to be a talented game designer and story writer was publishing his first book, I knew I'd have to check it out. Legends and Lattes is that book, and I will tell you upfront, this is one of my favorite books of the year. It's not shocking to me he wrote such a good story, but I was amazed at how much I came to really care for the characters and the world he creates.And what a world it is. Anyone who has ever played a game Travis wrote and designed knows he creates a world you can sink right into, and this one is no exception. Taking place mostly in the city of Thune, you are drawn into how this city resembles a medieval city. The various craftsmen and women and their businesses feel so real, and you can almost see the various sights, especially as Legend's and Lattes the business comes into being. The neighborhood feels warm and inviting, but we still get a good look at the other districts of the city as well, both good and bad. Its a world with magic and adventurers, and yet it feels like a fully realized world where you can step into a locally owned coffee shop and buy a latte and a pastry. It's the coziest of worlds, with a real intimacy that is surprisingly pleasant and heartwarming.The characters are such a treat. Viv is the orc warrior who gives up adventuring to take a chance on opening the first coffee shop in Thune, introducing it's denizens to the wonders of this gnomish treat. 22 years of adventuring were enough, and Viv wants to do something orcs don't generally do, which is live peacefully to a ripe old age and die peacefully in her sleep, not by an ax blow to the skull. She is such a fun character, because she has is the best kind of fish out of water story, wanting to put her violent past behind her to try and find peace for herself in something she thinks she'll truly be happy doing. She really could solve a lot of problems in the book by resorting to \"Viv Smash\", but she is dedicated to not being about that life, and its really heartwarming to see. How the story for her plays out is really unexpected, with a lot of twists and turns up until the very end.The secondary characters are excellent as well. The most important of these is Thandri, Viv's assistant who is actually more a second main character. She is a succubus, although she doesn't use her inbred abilities, and actually sees them as a hinderance more than anything else. She is a talented artist, and is a lot of help to Viv in growing the business. She too is trying to escape her past, which was much different than I expected, and she really plays a pivotal role in Viv's life. They have such great camaraderie, and they work together seamlessly, really enhancing each others strengths.There are quite a few other characters as well, such as the ratkin Thimble, who makes up for his silence, with a great work ethic and amazing ability to create sinfully delicious pastries. He is another vital part of the growth of Legends and Lattes, and his silent presence in felt throughout the story. The other characters are a fun bunch, from the nosy but nice neighbor to the shop, to the young wizard student who comes in to study, and is actually the cause of a new drink in the shop, created in a hilarious way. They all play so well together that you can't help but to want to go hang out with them yourself.The antagonists shift throughout the story. The initial antagonists ended up becoming friendly with Viv, so they became what I'd call more neutrally aligned. The antagonist who causes the most harm is actually a blast from Viv's past, and knowing Viv, has ideas how to ruin what she's worked so hard to build for herself. While he may have some insight, his own narcissism may be his downfall, without Viv having to resort to a life she swore to avoid again. It was very intriguing to see how this played out.The narration was handled by the author himself. Being a narrator by current profession, this was a logical choice, especially considering he knows the characters and story better than anyone. You can tell he poured his heart and soul into this one, and an already talented narrator puts on his best performance to date. The characters already had life, and he just enhances that even more, bringing all the character to life in new and exciting ways. You can feel the emotion throughout, and I'll be honest, you get hit right in the feelz several times. I highly recommend this format, although paper and ebook are excellent as well.It's not often a book about a slice of life, with characters building lives, friendships, love and a coffee shop would be first pick of mine to read, but I may have been missing out. The term cozy is thrown around a lot, sometimes as a pejorative, but this book kind of embodies the best of what a cozy kind of story can be. With some fantastic characters, interesting relationships and fun world building, you have the recipe for the best kind of story, the ones you re-read time and again. This is definitely one that will get an annual re-read at least, and is the best kind of comfort read. I highly recommend picking this up in whatever format you prefer, you won't be disappointed.",
                "reviewVotes": "82 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ellens.bookishcollection",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 24, 2023",
                "reviewTitle": "Cozy Fantasy at its finest.",
                "reviewText": "𝐇𝐢𝐬 𝐞𝐲𝐞𝐬 𝐰𝐢𝐝𝐞𝐧𝐞𝐝. \"𝐖𝐞𝐥𝐥 𝐬𝐡𝐢𝐭. 𝐊𝐢𝐥𝐤𝐞𝐧𝐧𝐲 𝐛𝐞𝐚𝐧 𝐰𝐚𝐭𝐞𝐫. 𝐈𝐥𝐥 𝐛𝐞 𝐝𝐚𝐦𝐧𝐞𝐝.\"This wholesome story is like a warm cup of tea on a cold day. It's so cozy and easy to read, this is my newest comfort book. The story telling was beautiful, but the story was a simple slice of life. I absolutely adoreeverything about Legends & Lattes.☕️ Cozy Vibes☕️ Queer Romance☕️ Tough FMC𝐀𝐟𝐭𝐞𝐫 𝐭𝐰𝐞𝐧𝐭𝐲-𝐭𝐰𝐨 𝐲𝐞𝐚𝐫𝐬 𝐨𝐟 𝐚𝐝𝐯𝐞𝐧𝐭𝐮𝐫𝐢𝐧𝐠, 𝐕𝐢𝐯 𝐡𝐚𝐝 𝐫𝐞𝐚𝐜𝐡𝐞𝐝 𝐡𝐞𝐫 𝐥𝐢𝐦𝐢𝐭 𝐨𝐟 𝐛𝐥𝐨𝐨𝐝 𝐚𝐧𝐝 𝐦𝐮𝐝 𝐚𝐧𝐝 𝐛𝐮𝐥𝐥𝐬𝐡𝐢𝐭. 𝐀𝐧 𝐨𝐫𝐜𝐚𝐬 𝐥𝐢𝐟𝐞 𝐰𝐚𝐬 𝐬𝐭𝐫𝐞𝐧𝐠𝐭𝐡 𝐚𝐧𝐝 𝐯𝐢𝐨𝐥𝐞𝐧𝐜𝐞 𝐚𝐧𝐝 𝐚 𝐬𝐮𝐝𝐝𝐞𝐧, 𝐬𝐡𝐚𝐫𝐩 𝐞𝐧𝐝—𝐛𝐮𝐭 𝐬𝐡𝐞'𝐝 𝐛𝐞 𝐝𝐚𝐦𝐦𝐞𝐝 𝐢𝐟 𝐬𝐡𝐞'𝐝 𝐥𝐞𝐭 𝐡𝐞𝐫𝐬 𝐟𝐢𝐧𝐢𝐬𝐡 𝐭𝐡𝐚𝐭 𝐰𝐚𝐲. 𝐈𝐭 𝐰𝐚𝐬 𝐭𝐢𝐦𝐞 𝐟𝐨𝐫 𝐬𝐨𝐦𝐞𝐭𝐡𝐢𝐧𝐠 𝐧𝐞𝐰.I'm used to many of my books having multiple POVs, but we only see the world through the perspective of Viv in Legends & Lattes. The characters we spend the most time are only a small few, but it is enough. The character development is fabulous, and so heart warming.𝐓𝐡𝐞 𝐜𝐨𝐦𝐛𝐢𝐧𝐞𝐝 𝐚𝐫𝐨𝐦𝐚𝐬 𝐨𝐟 𝐡𝐨𝐭 𝐜𝐢𝐧𝐧𝐚𝐦𝐨𝐧, 𝐠𝐫𝐨𝐮𝐧𝐝 𝐜𝐨𝐟𝐟𝐞𝐞, 𝐚𝐧𝐝 𝐬𝐰𝐞𝐞𝐭 𝐜𝐚𝐫𝐝𝐚𝐦𝐨𝐦 𝐢𝐧𝐭𝐨𝐱𝐢𝐜𝐚𝐭𝐞𝐝 𝐡𝐞𝐫, 𝐚𝐬 𝐬𝐡𝐞 𝐛𝐫𝐞𝐰𝐞𝐝 𝐚𝐧𝐝 𝐬𝐦𝐢𝐥𝐞𝐝 𝐚𝐧𝐝 𝐬𝐞𝐫𝐯𝐞𝐝 𝐚𝐧𝐝 𝐜𝐡𝐚𝐭𝐭𝐞𝐝, 𝐚 𝐝𝐞𝐞𝐩 𝐜𝐨𝐧𝐭𝐞𝐧𝐭𝐦𝐞𝐧𝐭 𝐰𝐞𝐥𝐥𝐞𝐝 𝐮𝐩. 𝐈𝐭 𝐰𝐚𝐬 𝐚 𝐠𝐫𝐨𝐰𝐢𝐧𝐠 𝐰𝐚𝐫𝐦𝐭𝐡 𝐬𝐡𝐞'𝐝 𝐧𝐞𝐯𝐞𝐫 𝐞𝐱𝐩𝐞𝐫𝐢𝐞𝐧𝐜𝐞𝐝 𝐛𝐞𝐟𝐨𝐫𝐞, 𝐀𝐧𝐝 𝐬𝐡𝐞 𝐥𝐢𝐤𝐞𝐝 𝐢𝐭. 𝐒𝐡𝐞 𝐥𝐢𝐤𝐞𝐝 𝐭𝐨 𝐚 𝐠𝐫𝐞𝐚𝐭 𝐝𝐞𝐚𝐥.The fabled artifact was fun and while the story is very predictable, it was fun. I devoure the entire book in one sitting. I will now be on the hunt for more cozy fantasy. It is a type of book I didn't know I needed.⭐️⭐️⭐️⭐️⭐️ 5/5",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandro Batista",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 9, 2023",
                "reviewTitle": "I hate this book",
                "reviewText": "Reading this thing made me extremely giddy about a cat sitting on a bed and a goblin drinking a mug of coffee. I hate what this book does to me...10/10 would recommend",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "natalia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 28, 2022",
                "reviewTitle": "Uma leitura confortável",
                "reviewText": "Um dos livros de fantasia mas gostosos de ler, com aroma de café e gosto de pão com de leite e canela, amei todos as personagens, mas Timble tem meu coração.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The H",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 9, 2024",
                "reviewTitle": "A wonderfully warming story for a cold winter evening",
                "reviewText": "Reading this story was like holding a mug of steaming hot tomato soup between cold hands, inhaling the glorious aromas and knowing that each sip will be a treat on the tongue (I'm not a coffee drinker, but I imagine some people get this experience from coffee - judging by the story!)The prologue was jarring and set me up for a VERY different read, however the rest of the story was soft and snuggly. Like a warm fuzzy blanket.I liked the characters and thought they were fleshed out nicely without having too much gumph to wade through. I did not have to skip a SINGLE page reading this story as there was no frivolous \"padding\" which seems so common these days.There was a very clear storyline throughout and, although I predicted what would happen early on, I was pleasantly surprised by the manner in which it occurred. I also really like the message of the story which roughly equates to \"it takes a village\" and is a lovely example of how that village happens, and how it works through strife.Lovely, lovely story. Thank you!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonas Mohlin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on January 23, 2024",
                "reviewTitle": "Mysig high fantasy, inte som alla andra 😊",
                "reviewText": "En för mig helt ny sorts fantasy med mysfaktor.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}