{
    "remaining_requests": 224,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Glimmer-Other-Urban-Fantasy-Novel-ebook/dp/B097Z1Y2ZP",
    "body": {
        "name": "Glimmer of the Other: An Urban Fantasy Novel (The Other Realm Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Glimmer-Other-Urban-Fantasy-Novel-ebook/dp/B097Z1Y2ZP",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Hat9Xu8vS._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Heather G. Harris",
            "link": "https://www.amazon.com/Heather-G-Harris/e/B097ZP5J8S/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 5569,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B097Z1Y2ZP"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (September 1, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 1, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 939 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 318 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,418 in Kindle Store (See Top 100 in Kindle Store) #10 in Time Travel Science Fiction (Kindle Store) #21 in Time Travel Fiction #42 in Werewolf & Shifter Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 5,569 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ignazia M. Grant",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIIKCFVQ5J6XWYPYZBKGHHMLSOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G8BBBISNSYX2?ASIN=B097Z1Y2ZP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Saving the Realms",
                "reviewText": "After her parents’ murders Jinx, Jessica Sharp at 18, became a private investigator, creating a job in which she could work for others but also to continue the search for answers about who had murdered her parents and why. Her mother always told her to “fly under the radar” since there was something unique about herself that could cause problems. Jinx was a human lie detector. Recognizing instantly the truth or lie behind what people were saying, and sometimes if she pushed them a bit, she could get them to truthfully answer questions they’d had no intentions of answering. This she keeps to herself, however, not even telling the caring Mrs. Harding, the neighbor who lived next door Jinx’s whole life. Mrs. H. was a real help, she had comforted Jinx after her parents’ death, continued to watch out for her, even keeping Gato, Jinx’s extremely large Great Dane, when he couldn’t tag along on a job.A simple search for a missing young woman will open realms to Jinx, she never dreamed existed, much less could she believe that she belonged in them. Joined in her search for Hester, Lady Sorrel’s granddaughter, is Zachary Stone, who appears as stoic as his name…at first. It was the stop at Rosie’s Café that Stone realized Jinx was what he called a ’truth seeker’. Stone suddenly grabbed her wrist looking at her saying she’d been ’hidden’. Which translated that even though she was aware of her powers, she had been totally ignorant of the world of magical beings of which she was one. There are three realms, but all her life Jinx had lived in the Common Realm where magical beings could mingle with humans without the humans seeing them as they really are. Stone, it seemed, was a high-ranking inspector in what he called the Connection, a governing body for the Realm of the Other. Without much fuss, Stone stepped out behind Rosie’s introduced her to the Other. When they walked back into the café, it was like walking into the mirror and coming out on the other side into a strange world that looked the same, only some of the people she saw definitely weren’t human. Within this realm magical beings and humans still mixed but as an Other Jinx could now see the magical creatures as they truly were. And finding Hester just became a lot more complicated since the new boyfriend she had disappeared with was a vampyr.Characters, both human and magical beings inhabit the realms in which Jinx would travel with Stone. Each had its rules that must be followed while danger flowed hot and heavy in all three realms, emotions were high, and it was easy to offend without knowing it. At the center of it all was the dagger created for a very special purpose that at all costs must not fall into the wrong hands. This tale has some well-known legendary beasties, as well as some I had never seen in my decades of reading sci-fantasy literature. Heather Harris did a grand job of giving even the familiar beasties unique abilities and characteristics. Her realms may be hidden but the suspense and danger is on just about every page. I never knew what to expect when I turned the next page or who Stone and Jinx might encounter. The story is a living thing that moves in and out of the imagination and made me feel as if I were being drawn into a world filled with stories yet to be shared, characters that I grew to care about, but might disappear from the next page.Dry humor sneaks in, in spots, British colloquialisms and wording I found easily understandable in the context of the telling. A tale which gives us implied romance, danger, death, hard won friendships, shifters, deamons, empathy’s, vampyrs, trolls, ogres, mer-people, dragons and more. I got so caught up in the series after turning the last page, I immediately picked up the rest of the books to follow the story to its “conclusion”? Written in the King’s English the reader be treated to familiar words with different spellings, British colloquial sayings, and humor.I first started listening on audio and found myself lost in listening to the beautifully narrated book. Alyse Gibbs’ precise, clipped King’s English is spot on and very easy to follow. [I worked for over 15 years with a British lady who never gave in to American slang.] Likewise, I never seemed to have a problem distinguishing which character was speaking since Alyse Gibbs’ intonations and slight changes in range of her voice quickly alerted me that a different character was speaking. She is an excellent narrator. I highly recommend this tale in both Audible and eBook, I made good use of both.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jilly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHG5XB4RGGSIKKJ7BDN3U3RVXFKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R381SG4GAGI4DX?ASIN=B097Z1Y2ZP",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "4.0 out of 5 stars Good series",
                "reviewText": "I really enjoyed this series! There were some weird continuity errors here and there throughout the 7 books, but if you can get past that, it's an awesome new series, and I love all the characters. There's no cheating. There's romance in the book, but it's not the main focus.. there's definitely a good plot to the whole thing.Spoilers:The love interest in the first book isn't the love interest foe the rest of the series, so don't get too attached. The main guy is properly introduced in book #2. There's no cheating and not really any other woman drama, but the guy is centuries old and does have some beautiful exes that pop up. I'm not a fan of having the main female character put herself and her looks down all the time.. it gets old, and she's constantly saying she looks like a troll compared to every other woman.. but she doesn't lack confidence, so I let it slide while reading, but this is fantasy, and I want my main character to be beautiful, powerful, and confident... this one describes every other woman as beautifully sexy and herself as a lumbering oaf.. not cool. Anyways, besides the weird continuity issues and the way the main character describes herself, the story itself was well written and incredibly entertaining. I'd definitely recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frederic Nash",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTYRAJTQYDJLQSPICJKEJSHRV7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAW7UWHNUGU9U?ASIN=B097Z1Y2ZP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars glimmer of the Other",
                "reviewText": "This is the first book I read by this author. It had plenty of action and mystery. There were engaging characters. The book is filled with different paranormal. I will read the next book in the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CindyV",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJF5C3JCREUOJRANFR3V5JNEBPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ER5D9PM4AIA3?ASIN=B097Z1Y2ZP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Fast paced, binge worthy fun!",
                "reviewText": "Fourteen days ago I picked up and read \"Glimmer of the Other,\" my introduction to Heather G. Harris. Ahem, fourteen days later and I have just finished her entire catalog of Other Realm/Wolf/Witch books, and now I'm branching out to her new world (which I haven't started, but have pre-ordered the upcoming Portlock Paranormal release). I have thoroughly enjoyed being immersed in the Other world. Great cast of characters, entertaining banter, excellent world building, and interwoven storylines - all combined to keep my attention and at times I had to read ahead in order to stop for sleep (I just had to know what happened).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EZreader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJOAESGYC6ARSGKVNV3UBW5TT3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6XCTO2TH14ND?ASIN=B097Z1Y2ZP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Love the characters, the story, the series, the audio, and the wit",
                "reviewText": "This book was secreted away on my TBR list when I stumbled upon it in September and the lovely cover lured me over - the author's world kept me there.My! What a whirlwind it has been for me since. I have read all of the published books to date (focus on Jinx - Glimmer/Court, Lucy -Wolf, Amber - Witch) more than once and now going through the entire book series again on Audio. WHAT A TREAT!GLIMMER of the....Other, Dragons, Hope, Christmas, Death, DeceptionDefender, Protection, Guardian, Saviour of the PACKChallenge, Betrayal, Revival of the COURTRune, Hex, Coven of the WITCH (so far)I voraciously read every last one of them.When I listened to the audio, it added another layer to the story because even though I KNOW it takes place in the UK some of the characters didn't sound like it in my head. Once I heard (say Inspector Stone), I had an ah-ha moment.Alyse Gibbs (Narrator) is amazing. She does such a great job of bringing the story to life, capturing the essence of the characters, and the feeling of the moment. Because of her, I was able to better understand what was meant by the different accents.Even if you are not fond of audiobooks, I would strongly encourage you to read the book (as your preference) and then check the audio out from the library. You can thank me later. :)",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Tyson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXPYPHJINCXNKNSLEVKI2BLX5AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSGDQZN8GQJI3?ASIN=B097Z1Y2ZP",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Its Complicated",
                "reviewText": "I have gotten to the point in my reading life where I can almost tell how a book direction is going to go. But not so in this reading ride it has what I assumed was a predictable curve into a curve you didn't know was there kudos and good job to the author on the thrills. \"Que tus pensamientos sean curvados para siempre\". (\"May your thoughts be forever curved.\")",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 24, 2023",
                "reviewTitle": "One of the best fantasy worlds around",
                "reviewText": "I just love the Other books, and it all starts with this one. Heather G. Harris has quickly become one of my favourite authors. Glimmer takes you on a fast-paced adventure, managing to introduce the world and characters without detracting from the energy of the story. It does the job so well, that when you start the next book you will feel like you're coming home.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jayne Rainey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 11, 2024",
                "reviewTitle": "Amazing book from start to finish",
                "reviewText": "Gripped from the start and as a scouser I loved the Liverpool local references to places I have been, seen and know it was just fantastic. I downloaded book 2 as soon as I finished book 1!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "adepp",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 17, 2023",
                "reviewTitle": "Fantastic debut series",
                "reviewText": "I highly recommend it! 😁This is the first book of Heather's The Other Realm Series, and I couldn't put it down or in this case. What a fantastic introduction to wonderful main, I love Jinx, and secondary characters, fantastic world-building, intrigued plotline, action pack with a little bit of mystery.It's such a privilege witness Jinx's journey and discover the exciting Other Realm at the same time as her.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Me",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 25, 2023",
                "reviewTitle": "A great series!",
                "reviewText": "This is my second time reading this series. I am enjoying it just as much this time around. Thanks for it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle User",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 22, 2022",
                "reviewTitle": "Great world building",
                "reviewText": "I have to commend the author on her world building abilities, she created a place that is truly three dimensional in its existence. From governing laws to creatures and realms, this world was very well developed. The main character is a supernatural lie detector and the way that plays on the page is kind of neat. Her character threw me off a little bit in the beginning as she started out kind of straight edged and hard but then became more playful and less cold, but you get over that transition fairly quickly. Be aware that this book ends on a cliffhanger,which isn't for everyone, but luckily the next book in the series is out and bound to answer your questions.The Other is an interesting realm and one I enjoyed exploring, if you like mythological creatures and a different spin on otherworldly affairs, then this read might just be for you.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}