{
    "remaining_requests": 305,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Curse-Shadows-Thorns-Broken-Kingdoms/dp/B09X6RRK11",
    "body": {
        "name": "Curse of Shadows and Thorns: The Broken Kingdoms, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Curse-Shadows-Thorns-Broken-Kingdoms/dp/B09X6RRK11",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51S9MN5omOL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "LJ Andrews",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=LJ+Andrews&search-alias=audible"
        },
        "brand": "LJ Andrews&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 11743,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A rebellious princess. A cursed rogue. A forbidden love that will bring a kingdom to its knees.As niece of the king, Elise Lysander cares about two things: sneaking into gambling dens, and avoiding an advantageous marriage at all costs.When her uncle holds the life of her deathly ill father over her head, reluctantly, Elise puts her fate into the hands of Legion Grey, the handsome and mysterious dowry negotiator. He may be arrogant and infuriating, but soon Legion incites a blistering, forbidden passion she can’t ignore.As their attraction grows, so do the dangers: attacks from black-eyed people, a cursed enemy who is more beast than man, and rumors of fae returning for the crown they believe was stolen from them long ago.After a bloody coup upends the kingdom, Elise flees with Legion, but nothing is as it seems. The man she allowed into her heart reveals his own secret plans with the return of magic—and he has every intention of using Elise to see them through.With war between magic and mortal on the horizon, Elise must pick a side to protect her kingdom. Does she stand with her people who stole the throne? Or with a man who lied his way into her heart and whose secret past could bring her destruction?Filled with luscious world building, banter-filled romance, and epic battles, Curse of Shadows and Thorns is the first book in The Broken Kingdoms series. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b?ie=UTF8&node=720360"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Action-Adventure/b?ie=UTF8&node=10159265011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 38 minutes"
            },
            {
                "name": "Author",
                "value": "LJ Andrews"
            },
            {
                "name": "Narrator",
                "value": "Stina Nielsen"
            },
            {
                "name": "Audible.com Release Date",
                "value": "August 23, 2022"
            },
            {
                "name": "Publisher",
                "value": "Podium Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09X6RRK11"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,826 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #16 in Action & Adventure Romance (Audible Books & Originals) #116 in Fantasy Romance (Audible Books & Originals) #272 in Action & Adventure Fantasy (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SimplyAdventures",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESOJL2SBE64ASZANWTYTPXHGBZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JF6OLC6YW0L?ASIN=B09X6RRK11",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2022",
                "reviewTitle": "5.0 out of 5 stars This book got me out of my book slump",
                "reviewText": "So I've been in a book slump for The last month and I happened to come across this author's tiktok And read the blurb and I sat on the book for a few weeks until I saw another TikTok And decided to take the plunge because I noticed that the last book comes out soon So by the time I finish Reading needs the last one will be out.Well this book got me out of my book slump. It is so well written and the characters are just perfection. I will say that the FMC does make some really dumb decisions BUT She does them in a way that you can relate to As a younger coming of age adult.Spoilers below probably.So this book follows is 1 person POV. Elise is the main character you follow. She is related to the Royal family in this book. Her Uncle is the king and her Mother is his sister. She has one older sister and she is betrothed to her Uncle son ( her cousin ). So yes there is some light incest that is talked about but it is not in the book. It's just more historical think GOT or British Royal Family. Now this book does talk about consorts and how taking on lovers and cheating is a thing historically. I just want to mention both of those things because I do know some people have problems with those types of things but I don't think they are a problem in this book because they are not Really brought up in a s$xual way. There is very little smut in this book there are a few scenes between the main MCs. So the book starts out FMC has become of age at 20 For marriage and her dowry has been open so people can start bidding her hand at marriage. So There's a marriage negotiator named Legion Gray who is the MMC Who has been basically called upon to take on the negotiations for her marriage to find her a husband. You soon find out that everything is not as it seems. There is a lot going on And there are people coming for the Crown but you also find out quickly that there are lots of Fae In this book and you realize that the throne was taken by Elisa's distant relatives that are now dead.. You also find out that Legion is not who you think he is and has been cursed to not remember who he is. The last 25% of this book is perfection there It's so much going on that it is amazing. At the end of the book we find the FMC and the MMC separated but you understand why even though the decisions might not be the best You can understand why they're in place and why they happened. I will say that with the book series having 7 books and this book being 350 pages it can be a lot and there are parts that are somewhat slow in the book but I don't think the book needs to be Shorter or any parts taken out becauyes there's so much back story going on that each part of the book is taking a step towards telling the story and I think it's needed. There isn't too much repeating but there was a time or 2 where I did pause from reading but I still read the book in A-day and a 1/2. I think how they tied the blood wraith into who Legion Gray was and how he was and how he is actually valid the last nightprints really sets up the rest of the series and how Ari it comes in to play for the next book. As I touched on above the only thing I really didn't love is how naive the FMC was but I understand why she was written that way but I didn't think she made smart decisions like not taking off her bracelet That identified who she was or When she was going to go back to where her Hometown was after she saw what her sister and cousin did. She had absolutely no reason to go back there even to get Mattus knowing that atthat time she could not trust Mattus's Uncle. Even if she had met up with Mattus at that point she could have been kidnapped or in trouble in the sense with the blood wraith.",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FloofyMoose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDRTDFKIBLQ2ROI7WAQZB4BJO2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10W5TDDAOZ3F4?ASIN=B09X6RRK11",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "4.0 out of 5 stars Solid start to the series",
                "reviewText": "Curse of Shadows and Thorns is the first book of the Broken Kingdoms series, a 9 book series about a rebellious princess and a cursed rogue. It focuses on themes of what’s expected vs. what’s right, forgiveness, loyalty and trust. Tropes include forbidden love, betrayal, slowburn, who did this. you came and hidden identities. This is a dark fantasy so please check the content warnings.The Lovely: I loved the characters and their relationships (main and otherwise). Some of the secondary characters seemed a bit flat but I think that’s because we haven’t really gotten to know them yet. I can’t wait to see how the characters and relationships develop over the course of the series.Also Nice: I liked the plot and how the story played out. Some of it was predictable but there were enough surprising moments to compensate. I loved the moments when the tension was (seemingly) low and then BAM something unexpected happened. The ending was satisfying from a cliffhanger perspective.The Mundane: There is a LOT of world building in terms of history and the realms, but not a lot about the magic system. I’d like to know more about who has magic, how they get it, the types of magic and how it’s used/applied. I hope we learn more going forward.Rating: 4/5 Stars 1/5 spicy flamesRecommendation: I’ve had this series on my TBR for a while but have hesitated to dig into a nine book series as I knew I’d want to read all 9 books in a row. I really liked this first book in the series and am excited to see where it goes from here. This book did feel more New Adult (almost YA) but I understand this changes in future books as the FMC becomes older. I’m hopeful we’ll get some spice as well. If you like an interesting story that combines a strong plot and relatable characters in a fantasy world, I think you would like this book.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MaryBeth  K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7FVWTQTUJ22J5G4QXYJOHD4GPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QY8AOAFJRAAY?ASIN=B09X6RRK11",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars It took me a while...",
                "reviewText": "To be overcome by Legion Grey! I was starting to read The Ever King when I read the author note about The Broken Kingdoms and so I have begun this amazing journey with the feisty, brave Elise and the electric Legion Grey as he was known for the bulk of the book. Loving this genre, I began to have my suspicions about him which were proven correct! So, Ever King must wait, on to the rest of this series first!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVM3PXADDVFHXK3Z7JHHOOBMUKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1L9LHDA2RVRWH?ASIN=B09X6RRK11",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "3.0 out of 5 stars Not terrible but not great",
                "reviewText": "I got this because of the reviews, gave it a try and wasn't disappointed, but it's not great. I thought the writing style was jarring, I felt pulled out of the story so much, too many grammatical mistakes, and one paragraph actually duplicated word for word, and that's annoying. It was slow to start, plodding along until the last 3rd of the book. I didn't mind Elise too much, although I get so tired of the stubbornness to drive a story, but I've read worse characters. I could see the plot a mile away, so it wasn't at all surprising. I also never really got the feel these guys were Vikings. I did go ahead and order the next 2 books BEFORE reading the last chapter. Annnndddd - That was a mistake. Spoiler: I can't believe that Legion would leave Elise on her own so he can run off seeking his revenge when the ENTIRE kingdom and every other faction is hunting her. He leaves her with the gal, the Agitator, whose job it was to assassinate Elise. Really? There is not one single place she can go that she's not being hunted and he's all \"hey, thanks for trying to sacrifice your life for me, I'll never forget you, and hey head east or north or whatever chic\" and we're supposed to like this guy? He bails on her without getting her to safe place, didn't give her a magic rock or sprinkle any fairy dust on her now that's he got his pointed ears, just smacked her on her ass and out the door, or woods and away she went. Nice oh honorable dude. pffff.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Renate Rowland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOBX3FACZO5EGVUK7QSJ5COXOLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VTP3M22RIIST?ASIN=B09X6RRK11",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars What a fantastic start to a series!",
                "reviewText": "I already dove into the Ever Seas (head first), but it was a wonderful experience getting to know the characters who brought this series to life.Elise and Legion are just superb, and I will eagerly follow the rest of the cast on their journeys.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley Rohr",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 9, 2024",
                "reviewTitle": "Good Read",
                "reviewText": "Kept me into the story from beginning to end and made me want to read the other 8 to see where to story goes.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S.Anne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 22, 2023",
                "reviewTitle": "Fantastic",
                "reviewText": "This book had me hooked immediately. What a story. So gripping, so addictive, could not put it down.The FMC Elise is a member of the royal family, as much as it pains her to be sometimes, she’s good at staying quiet and knowing her place. Which means when her father’s health gets worse and her uncle steps in to marry her off she has no choice but to accept. Except the man who is supposed to choose her future husband is someone who she can’t help but gravitate towards. She’s not sure why, she knows he’s hiding something, but then she is hiding who she really is, she just doesn’t know it.Legion the MMC is good at putting on a show, his whole persona is one. The real him would make people run and hide, which many people have done. There is something in his darkness that is pulling towards the light in Elise and he won’t let her slip through his fingers, no matter how hard she fights him.Dive in to this world, you will not be disappointed it’s a wonderful world to get lost in",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manon de Jong",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on June 28, 2023",
                "reviewTitle": "Fine read",
                "reviewText": "I read this because I keep seeing it on Tiktok..It took me some time to get into the story, the beginning had a lot of world building and word introductions (fury = magic).Sometimes people were interchanged with their profession. Like Mattis - the carpenter. For some reason I missed those hints and when they talked about the carpenter I got confused.Some people/names were also introduced with three at a time. But again that's more a me problem than a book/writing problem.*MAYBE SPOILERS*In the end, everything that was hyped on tiktok took a while to actually happen.The plot focus/goal also seemed to change for me. It started with Elise (main female character) needing to find a husband and getting a negotiater (main male character). Offcourse she wants to have a choice in the matter and have her voice be heard. Meanwhile the king is a mean *sshole, same goes for the future king (her cousin) and queen (her sister)... Incest, yikes.The kingdom struggles with Agitators who are trying to get the 'real King' on the throne.This takes up about 70% of the story.And then suddenly we find out that Legion Grey (the negotiater) is cursed (this was hinted at twice in a small manner). And after that it was really just focused on this curse and Elise helping him find a way out of it (Beauty and the beast fibe for about 20% of the book).In the end we quickly came back to the main storyline after mostly losing it by focusing on this curse.*END OF SPOILERS*In the end. Cool world, even though it took a while for me to understand what was happening (mostly who was who and where from?). I liked the touch of Swedish in the book but I don't think I'll be picking up the next book.Maybe if it's on sale or free on kindle that I would consider. (Or put in it my digital library and then forgetting about it like the other 40 or more books on there...)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ms. Autumn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 21, 2023",
                "reviewTitle": "Loved it",
                "reviewText": "I really enjoyed this book. I’m slowly making it out of a reading slump and this book helped. Looking forward to the sequel - it’s already downloaded 😄",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PRITI SINGH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 25, 2023",
                "reviewTitle": "Nice",
                "reviewText": "Nice story . I liked it a lot just right amount of everything, whether it is suspense, action, drama or romance loved it a lot.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}