{
    "remaining_requests": 349,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Monsters-Born-Made-Tanvi-Berwah/dp/1728268842",
    "body": {
        "name": "Monsters Born and Made",
        "price": "$5.27",
        "originalPrice": "$11.99",
        "rawPrice": 5.27,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Monsters-Born-Made-Tanvi-Berwah/dp/1728268842",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "11",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91GSRk+vAFL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Tanvi Berwah",
            "link": "https://www.amazon.com/Tanvi-Berwah/e/B09NYN4NSB/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 169,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Sourcebooks Fire (August 1, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1728268842"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728268842"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 14 - 18 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 8 - 12"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.88 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#332,429 in Books (See Top 100 in Books) #185 in Teen & Young Adult Monster Fiction #1,157 in Teen & Young Adult Sword & Sorcery Fantasy #1,270 in Teen & Young Adult Fantasy Action & Adventure"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 169 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Crystal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ4H3WJ6XA6DWPW3GF5LBLOQEYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OKZM63HZQ4JT?ASIN=1728268842",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2022",
                "reviewTitle": "5.0 out of 5 stars A thrilling, fierce read from start to finish!",
                "reviewText": "I absolutely LOVE this book and cannot recommend it enough. I've seen it described as The Hunger Games meets the Scorpio Races and that description couldn't be more perfect. Monsters Born and Made lives up to all of its hype.Koral is one of my favorite protagonists ever--she's fierce and determined and I found myself rooting for her from page one. Dorian is an amazing character too and I ship him and Koral SO HARD. I also loved the dynamics between Koral and her family.AND THE WORLD BUILDING. The world that Tanvi created is so vivid and compelling, I couldn't stop reading once I started. I'm really hoping for a book 2 that delves even deeper into this setting because I loved it SO much. I'm obsessed with Maristags and the other monstrous creatures in this book. They're seriously the coolest and unlike anything I've ever read (in the best way!).A definite 5/5 stars and I can't recommend it enough. ⭐️⭐️⭐️⭐️⭐️",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thicc & Ired",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHS34URRXHEMA5UOQY6TEAYNYC7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UOLXQLKVJYEQ?ASIN=1728268842",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "4.0 out of 5 stars 3.7 / 5.0",
                "reviewText": "Monsters Born and Made is a dystopian fantasy of human kind on another planet, where a caste system of society designates people into jobs and prevents movement between social tiers. It is Hunger Games meets The Scorpio Races and a heavy dose of colonial oppression. And it just ends?I had read the book while listening to the audio, and the narrator on the audiobook doesn’t pace their reading in a way I enjoy listening too. I stopped listening after about 30% and read the remainder of the book. It’s good, descriptive but leaves enough open to the imagination that you don’t feel forced into a perspective. I was a little lost on some of the off-politics, it thought it was moving well enough that more would be released last, but then it wraps quickly.It is a satisfying ending, and I am already looking forward to Berwah’s next book, but I am uncertain if it’s the sequel to this or a new character all together. Overall, this is very well paced, the world building is excellent, the characters could use some work (they are rather one note), and the plot is engaging until it’s not, because it just ends…Until Next Time,MC",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sara CSara C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5APLG2LY3TSWB3RE2VSWIYZODQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UQGS4XCR3KCQ?ASIN=1728268842",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2022",
                "reviewTitle": "5.0 out of 5 stars Off the Charts World Building!",
                "reviewText": "Off the charts world building. Some of the best I’ve ever read! A great debut novel! I can’t wait to read Book 2!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81sFNvSG6PL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81sd5RN52oL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. DeFiore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM3YMBCOLSTUMLPO2TGEFNK2AQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QSV9FCZWQG39?ASIN=1728268842",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 18, 2022",
                "reviewTitle": "3.0 out of 5 stars Dystopian fantasy with a unique world",
                "reviewText": "What It’s About: Koral Hunter and her family are Renters, members of a low caste in their society. Koral and her brother support their family by capturing maristags and selling them to members of the elite Lander caste for the Glory Race. The amphibious maristags are ferocious, which makes the work quite treacherous. After a failed hunt, Koral’s family is left virtually penniless, unable to afford life-sustaining medication for her younger sister. In her desperation, Koral sneaks her name into the entries for the upcoming Glory Race. When she’s selected, many of the Landers are angry that the low-caste girl has stolen one of only ten spots in the competition, but Koral is determined to win and save her family.My Thoughts: The book’s interesting premise and gorgeous cover drew me in. I liked the book; however, it reminded me a lot of The Hunger Games and especially Red Rising with the way the living arrangements for the members of the different social classes were organized. As a big fan of early 2010s middle grade and YA dystopian novels, I felt the plot was rather predictable.The world Berwah creates in Monsters Born and Made is rich and, at times, frightening. The characters’ culture has clear ties to south Asia. Many of these elements are part of their everyday lives, which makes them stick out less in the narrative. The fantasy elements of the novel and its references to Greek mythology are mentioned more explicitly and thus are likely more noticeable for the reader. This combination plus the dystopian plot makes for a really neat fantasy world that I loved reading about but would never want to inhabit.This book was heavily plot-driven. I liked the characters, but they all felt a bit flat to me, likely as a result of there being so much focus on the action. Koral sticks out as determined, tenacious, loving, and trusting; however, there’s so much focus on the action that I’m not sure I got to know her enough to care deeply about her. Her backstory with Dorian was interesting, and I would also have liked some more depth there.The last 10% or so was my favorite part of the novel. I won't go into my reasoning as it contains spoilers.Thank you so much to the author, NetGalley, and Sourcebooks Fire for a chance to read and review this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenn BJenn B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZMLVJB2AUEDELR7HYG4LQPX6JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFP71L6DU7RMB?ASIN=1728268842",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "5.0 out of 5 stars \"You swim with monsters these people cannot scare you\"",
                "reviewText": "I wasn't sure at first but the more I read this book, the more I fell in love with it. I absolutely loved the mirror stagged the more she was in the story. I love the bond between her and Koral, showing that you can't judge something based on its nature. I'm not completely familiar with south asian mythology, But I think this was a great book to bring some of those elements alive for me. It was action packs, a riveting tale of coral's need to survive and her desire to rise above oppression. I enjoyed that there was a little bit of a love story, but at the same time, there wasn't and that wasn't the focus of the story.There are a few draw backs such as it does get slow and drags on at times, and some may find it hard to connect with Koral. I know it was likened to The Hunger Games, but while there are similar elements it is it's own book and try not to go into reading this expecting the same thing.I think for a debut novel it was good, but there is definitely room to grow and I look forward to seeing Tanvi's talent expand. I hope there is more from these characters and creatures.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71dGRSDYViL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71vRG+DdtuL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Megan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 25, 2022",
                "reviewTitle": "Deadly, Fast-Paced Adventure",
                "reviewText": "I can definitely see the logic in the comparative titles for this being HUNGER GAMES and FABLE. If you loved either of those I 100% recommend Monsters Born And Made! What an adventure. Koral lives in this rough, deadly world catching and training vicious sea creatures for the upper class's sport and Glory Games. There were times that I marvelled at her character's ability to get through a situation. Berwah has really instilled the desperate sense of a divided world and THAT CLIFFHANGER. I gasped at the lengths some of the characters would go to to keep the status quo from changing. Overall, an incredibly rich, visual and gritty world that I could definitely see being a movie and a cast of characters you want to fight for.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}