{
    "remaining_requests": 252,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dungeon-Born-Divine-Book-ebook/dp/B07RR97GXF",
    "body": {
        "name": "Dungeon Born (The Divine Dungeon Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dungeon-Born-Divine-Book-ebook/dp/B07RR97GXF",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91bN8k9uQbL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Dakota Krout",
            "link": "https://www.amazon.com/Dakota-Krout/e/B01M2UQD35/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 5459,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Teen-Young-Adults-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3511261011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07RR97GXF"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Mountaindale Press; 2nd edition (May 9, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 9, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3122 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 403 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28,115 in Kindle Store (See Top 100 in Kindle Store) #46 in Role Playing & Fantasy Games #79 in Cyberpunk Science Fiction (Kindle Store) #144 in Cyberpunk Science Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 5,459 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dylan Schnabel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5QWITZ742PPSVFUAVGYHB3PCUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13ZMEZCWLUYLN?ASIN=B07RR97GXF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2016",
                "reviewTitle": "5.0 out of 5 stars Fresh twist on a familiar concept",
                "reviewText": "Preface: In the interest of full disclosure, I would like to say I personally know the author, but if anything, it would cause me to be more critical of his work.Preface II: Author originally had some mechanical and consistency errors, but edited them out. This review has changed to reflect the current state of the book (after 10/20/16).I'd also like to start out with highly recommending this book, especially if you're into video games like World of Warcraft or role-playing games in general, role-playing games like Dungeons and Dragons, or even just the fantasy/dungeon diving genre. It is a fresh twist on a familiar concept which is really needed in fantasy as a whole.Overall, I felt the premise was very promising. It was different in that it (often) focuses on dungeon diving from the viewpoint of the dungeon rather than the diver. This provides an interesting outlook while still providing the otherworldly fights we fantasy readers crave. For someone who doesn't want spoilers, the best description/review I can give of the book is that it is a story about a dungeon, from conception to a place filled with death and danger. It is also a story of character evolution from both the dungeon and some of the divers which enter its maw.Spoilers aheadPros: The author found an interesting concept and ran with it. He didn't allow himself to be too bogged down in the gimmick of making the dungeon sentient. Using Dale as a secondary main character works well to get us out of the dungeon from time to time. The premise is mostly unique and pays off beautifully. The magic system is actually my favorite part of the book and is extremely intricate while still easy for the reader to understand. The concept of runic symbols/inscriptions vs enchantments vs incantations keeps things balanced in that magic can be done by anyone but can be extremely dangerous at worst and extremely taxing at best and in that it provides both flavor and diversity to the magic. The creatures in the dungeon and the way they are created is incredibly insightful. The humor lines up directly with the author's humor and made me chuckle (if not flat out laugh) at work a handful of times. The world is incredibly well described and detailed, although it still feels as though we learn new things throughout the book. The characters are typically likable when they are supposed to be and unlikeable in the same token.Cons: The cons in this book are more about personal style than actual poor writing and are better described in the mixed bag section below. Honestly, the part about this book that made me the least not happy was the last page. Nothing about the content on said page, but that it was the last page. I wasn't ready to transition into a second book quite yet and felt some loose ends were left a bit too loose, but then looking at the length of the book, I can understand why the writer wrapped it up. In fact, I feel like the ending itself was a great way to spur on the sequel, even if there are some questions burning in my mind.Mixed Bag: There is a ton of exposition, or world building, in this novel. I quite enjoy it, but many do not enjoy this level of exposition. Also, there is very little physical movement in the book. The only places the story takes place is the Phantom Mountains (specifically the mountain Cal is in), inside of Cal, and a short bit in the capital city. Cal, being a dungeon and all, doesn't move much at all. Again, I feel the author does a good job spicing up the environment and flat out changing it to keep things from getting stale. Other than that, some people may point to rapid character development as a flaw, but that is clearly explained as the side effects of the refinement of essence and the ranking up of characters, and I feel it is well thought out and well explained.When it comes down to it, I give the book a 10/10 focusing on the concept, the actual narrative told, the wonderful world that is built, the magic system, and the humor while the only knocks against this book are those listed in the Mixed Bag section, and I personally enjoyed those parts of the book. Out of a 5 star system, a 10/10 obviously equates to a 5/5I highly recommend this book and look forward to learning more about this world and the characters in it in Book 2.",
                "reviewVotes": "95 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LVtaTeach",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQ26LKDSHWEWL7XIJ5AJ2OTQKPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXLC2FWI9BEFK?ASIN=B07RR97GXF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "4.0 out of 5 stars Well done",
                "reviewText": "I would have given the book 5 stars as the story line was so unique, but the dungeon’s joy of death got a little taxing. All in all it was an interesting story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cole",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7IQTGRZD44FQK7M647QXUBDHCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6Q8HMKLPCYHX?ASIN=B07RR97GXF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2016",
                "reviewTitle": "5.0 out of 5 stars Opens up a new subgenre for a long time fantasy reader.",
                "reviewText": "Do you remember your first fantasy book? That feeling of yearning you got when you finished the last page in that series: 'I need more of this'. You spend years hunting down every famous series, every amazing new world that can open your mind up. This is how I felt after finishing dungeon born. It gave me that hunger to find more books like it. I went and read the only other LitRPG dungeon series on amazon (slime dungeon), started hunting down online dungeon core series that have been translated from Korean, and started combing through other LitRPG books even if they had nothing to do with dungeons. Dungeon Born has turned me on to this new and interesting sub-genre of fantasy.Here are the many things that I thought worked great for this book:1. Interesting concept of a dungeon core as the main character. There is really only one other series on Amazon that does something like this.2. Interesting magic system. I think it burrows from Eastern ideas about chi and energy, I'm not used to seeing it much because I tend to read Western fantasy. I found it interesting and I think the Author did a great job of dribbling in explanations of the system. He avoid any bad info dumps, and gave the information out in a way that made sense within the story. The magic/energy system also applies to humans and the dungeon in interesting ways.3. Developed world and political system. There are kingdoms at war with competing territorial claims. Churches dedicated to rooting out evil. An adventurers guild with internal politics. Standard fantasy races with a few twists.4. Good power progression. I can't count the number of fantasy novels that I have seen ruined by bad power progression. This novel feels on track to avoid those problems. The dungeon could have easily been wiped out by the first real scouting group of heroes that came through, and even after a full book to develop it could still easily be beaten by some of the powerful heroes in the world. The human main character is given a few shortcuts to power, but is still a weakling compared to his teachers, and he works his but off to get the power he does acquire.5. Good story. The characters face real danger and challenges. They aren't just breezing through life with plot armor on.I don't really have any substantial criticisms, so I'll just add some things I'd really like to see in the next book:1. Further elaboration on how people are handling the dungeon. What keeps getting these people killed? Is it bad luck? Are they getting to bold when they should be careful?2. Are people realizing how weird this dungeon is? The reader know its the only dungeon to come from a human soul. We know some of the loot and creatures that the dungeon is making are very strange. Are people picking up on this and reacting to it? I'd love to hear more of the lore about standard dungeons from the perspective of the humans that go dungeon diving. Right now we just have the pixie explaining how the dungeon is different.3. More development of the fantasy races. Right now there are high elves, wood elves, dark elves, dwarves, and demons. The elves have been given a bit of a twist. I'd love to know more about the other races and creatures.4. Another great story. The author opened up some new story threads at the end of this novel. I hope we get to see a lot of development of these new stories in the next novel.5. Steady power progression. Seriously, I love that the two main characters spent a lot of time at mediocre levels of power. Please don't let them jump up a bunch of levels just because they are main characters. If the author manages to end the third book without the main characters progressing up into the god tier power levels (SS rank or above) I'll be so happy and proud.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bhawan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 30, 2023",
                "reviewTitle": "Loved the Book",
                "reviewText": "First dungeon perspective litrpg I am reading. Loved the Book, liked the explanations and enjoyed the story being narrated from other characters. Would love to have the dungeon given some time to let other creatures in it before the story started so it introduced more variety in critters, otherwise it was an enjoyable read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "n s cesar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 10, 2023",
                "reviewTitle": "Good",
                "reviewText": "Good morning I am I gonna have to be in the industry and have a lovely day 😘😘😘💓 to the shop across your website and the markup language and culture.Words required aside.Read this if you're into litrpg. It's good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Non",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 3, 2019",
                "reviewTitle": "Genre fusion that works and is actually entertaining!",
                "reviewText": "Went into the novel with no expectation that it was a not only a Dungeon Core type story but also a Cultivation tale (the latter typically associated with Chinese fantasy martial arts i.e. Xianxia) -- and it just works and is fun to read.If you've ever wonder how a granite armored 400 lb rabbit would fare against a Displacer Beast, this may be exactly what you need to read.The Dungeon Core parts felt like a Home Improvement show where a new couple gets guided by an interior designer and chief carpenter into turning a fixer-upper into something eye-catching and livable. It sounds boring and it probably will be for people encounter the initial chapters where info dump aspect to the world-building and establishing the physical laws of the world but just like those types of Home Improvement shows, there's a steady transformation happening which makes you appreciate the workings of the author's mind when he set forth to integrate a build and defend premise alongside energy cultivation for myriad wondrous applications.There is a macabre quality to the assimilation and recycling of living things-- both the created Mobs and defeated dungeon divers -- which never really goes away but is offset by how entertaining the other human characters interact with each other and the dungeon.The author has a great sense of humour and it's a lot more evident with the humanoid characters.There is a twofold explanation given as to why the dungeon is just left as is and not destroyed as some other dungeons within the story. Pretty much every other thing that sounds strange for the unacquainted e.g. meditating to absorb Essence from the environment immediately after clearing a room, is presented with a detailed rationale.Give this a chance past the opening chapters since it does get better. It's worth your time if you want something different from your fantasy fare.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ivan Dimitrov",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 13, 2019",
                "reviewTitle": "Very good dungeon read",
                "reviewText": "It was a very good read. The start was a bit slow and strange but it picked up momentum soon after and I stayed till 5 am to read while I planned to sleep at 1 then 2 then 3. You get the idea.The world building is very very good.The MC(not the dungeon mc) has a lot of character building and effort put into it too. So really you get 2 stories. 1 of the MC development and one for the dungeon.I have to admit I skipped a bit of the MC parts as I feel the writer over committed on that. I do understand why he did it though as this is not a single book it's a series and it will lead to a very broad array of options for the writer to develop the story.There is a bit of a cliffhanger at the end which I do not appreciate and would like all 1st books to be able to be stand alone. Add the the end to be continued like a title.I still give it a 5 because the quality of writing is of a very high standard which is rare in the genre like this. Also this has been edited to perfection like a diamond. If there is any mistakes I didn't notice them. The style of writing I personally like, very much so. Whether you will I don't know. Now on to the 2nd book to see if the quility is the same as before and not get disappointed I hope.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 28, 2022",
                "reviewTitle": "Worth getting into",
                "reviewText": "At the start I found it hard to really get into bur by the end I really enjoyed it. Going to read the second one now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}