{
    "remaining_requests": 334,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sinister-Magic-Fantasy-Dragon-Dragons/dp/B088B1GK7X",
    "body": {
        "name": "Sinister Magic: An Urban Fantasy Dragon Series: Death Before Dragons, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sinister-Magic-Fantasy-Dragon-Dragons/dp/B088B1GK7X",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ZSbjY20vL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lindsay Buroker",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Lindsay+Buroker"
        },
        "brand": "Lindsay Buroker",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 8353,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "I’m Val Thorvald, and I’m an assassin. When magical bad guys hurt people, I take care of them. Permanently. This doesn’t make me popular with the rest of the magical community — as you can tell from the numerous break-ins and assassination attempts I’ve endured over the years. But thanks to my half-elven blood, a powerful sword named Chopper, and a telepathic tiger with an attitude, I’ve always been able to handle my problems with aplomb. Maybe some cursing and swearing, too, but definitely aplomb. That changes when my boss is afflicted with a mysterious disease, a government agent starts investigating me, and a godforsaken dragon shows up in the middle of my latest job. I’ve taken down vampires, zombies, and ogres, but dragons are way, way more powerful. And it doesn’t look like this one is going to like me. Worse than that, he wants to use his magic to compel me to do his bidding, as if I’m some weak-minded minion. That’s not going to happen. I’d die before being some dragon’s slave. But if I can’t figure out a way to avoid him, save my boss, and get rid of the government spook, I’m screwed. Or dead. Or screwed and dead. And that’s never comfortable. Pick up Sentient Magic today to see if I make it. Even if you don’t care about me, I promise the tiger is cool. Read more",
        "breadCrumbs": [
            {
                "name": "Audible Books & Originals",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_1?ie=UTF8&node=18145289011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18580606011"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18580607011"
            },
            {
                "name": "Paranormal & Urban",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18580622011"
            },
            {
                "name": "Urban",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=18580625011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 35 minutes"
            },
            {
                "name": "Author",
                "value": "Lindsay Buroker"
            },
            {
                "name": "Narrator",
                "value": "Vivienne Leheny"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 13, 2020"
            },
            {
                "name": "Publisher",
                "value": "Lindsay Buroker"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B088B1GK7X"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,900 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #152 in Urban Fantasy #176 in Dragon & Mythical Creatures Fantasy #494 in Dragons & Mythical Creatures Fantasy (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCYKT2BECB6O7CTATIZG5P5TEYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16EZZL2USAA1?ASIN=B088B1GK7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2020",
                "reviewTitle": "5.0 out of 5 stars - 4.5 to 4.75 stars -",
                "reviewText": "This is the first book that I've read/listened to by this author. I thought it was really good and had an interesting concept. I'm looking forwards to reading/listening to the next book, and I would recommend this book to other people who like strong heroines, tigers, and hot dragons.*Spoilers*One aspect to this story is that I like is that the main character, Val, isn't invincible. She starts out as a character who has had years of experience in her field, has built up her list of weapons that she uses, and is physically strong and agile. But she has her own weaknesses, such as new health problems, that get in her way. I honestly felt bad that because of her line of work she isn't able to have any friendships or relationships with her family. And I highly doubt there is any way to fix it unless she proves to the supernatural creatures that she is on their side and not against them or she decides to retire. I am curious if her health issues really are related to her job, age, and stress levels, or if it's something else, like she really was somehow poisoned or she had just been through so much that her body - being half elf - has just started to not heal itself in some ways. It is a little suspicious that she would suddenly have these issues, but it could be just as other doctor said and it's just age related.I am also curious if her divorce with her husband was on equal terms or if it was more on her side than his. She had stated that she had never been in love before (but had thought she had been when it actually wasn't love), despite being in two relationships: the first being her friend who was somehow killed, and then her former husband who she had married and has a 14 year old girl with. She had mentioned that she thought she had been in love with her former husband and that he was a really nice guy - she had even tried giving up her job to live a normal life with them - but I don't think that life was enough for her as she wants to protect people where no one else can and ended up going back into the field and divorcing him while severing all ties with her family. So I'm kind of curious if her ex-husband and daughter are actually on good terms with her or if they resent her for basically abandoning them and never keeping in touch. It was clear from what her mother had stated that they keep in touch with her mother and will usually spend once a year during the winter at her house to ski, but that doesn't say anything about what their thoughts are or if they understood why she did what she did with cutting all ties with them. I am relieved that her mother now seems to understand a bit better now of her situation/job and they seem to be a bit more friendly with each other, since her mother seemed to resent her for what she did to her family.I was a bit surprised to hear that the main character is in her esrly 40's, as I'm more used to reading characters who are in more of my age demographic, which would be a character in their 20's. But I wasn't bothered by it at all and it was interesting to read about a character who is much older and experienced than myself.I really liked pretty much all of the characters. I also enjoyed all the funny moments. I did find that it doesn't seem like there are many people Val can truly rely on that doesn't have ulterior motives and is truly just there to help. Which does enforce the fact that Val is a rather lonely character who goes through a lot just to help and save people. I did notice that Val and possibly Zav are rather black and white characters with how they view the world and their goals. Val believes she is defeating bad guys through her missions and doesn't exactly think they deserve judgement before she finishes them off since that is her job. On the other hand, Zav, believes that the dragon court and law is superior to all laws in every world and thinks that every criminal should be judged and put through rehabilitation to become a better citizen, no matter the crime they have caused. For me, I think there are flaws in both points of view. I don't exactly trust the dragon court, especially if the dragons are as powerful and arrogant as they have been stated to be, and also they are in separate worlds with a lot of humans most likely unaware of the fact that supernatural beings actually exist. I don't think it is right that creatures from another world could or should enforce rules and laws that they would have to follow. On Val's point of view, I don't think it is exactly right to forgo judgement and just kill them on the spot and every other creature that gets in her way. It is probably allowed as Val stated, but that is probably because humans or the government don't have any other way to handle supernatural creatures that end up being harmful to humanity. They can't do what Zav is doing by restraining and putting them in prison that is in another world.Zav and Val have an interesting dynamic and I'm interested to see more interactions between them.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manie Kilian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGD5VNXT35PVAQGVV7XR3QPPLL5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KMETF6GWRHLG?ASIN=B088B1GK7X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "4.0 out of 5 stars When an elf and a dragon clash",
                "reviewText": "The first in a series called Death before Dragons, Sinister Magic introduces us to a half elf assassin, Val, in a world where very few people have any idea of all the magical beings around them.No, Val is not a killer for hire. Her goal and job is to protect humans. As such she is an absolute terror. Except when a dragon unexpectedly makes his way to Earth too to capture criminal beings as well, the clash between two strong personalities threatens to upset everything.A lot goes haywire.Restoring peace?Does not look likely.Enjoy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3Z5Y3KXVRT22AOEL5UOV3PM5QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TK0OTO5PVAFS?ASIN=B088B1GK7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Death Before Dragons book 1",
                "reviewText": "Intriguing storyline ,quirky characters ,and a snobby dragon make this a great start to a new series.Cant wait to read book two in this series !",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGH4OTHXPD7O3N2X55LTYBOSWNRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NDPVH9XDDXZK?ASIN=B088B1GK7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Entertaining",
                "reviewText": "I'm not a fan of snarky female main characters and am not thrilled with their current popularity but found this book entertaining in spite of that. It's well written, the plot interesting and overall a good addition to the urban fantasy genre.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott Wozniak",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKIFTCH6G3UUB7Q5WANDNKI7AHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWZGWI3VTRT49?ASIN=B088B1GK7X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "4.0 out of 5 stars Urban fantasy adventure",
                "reviewText": "This is a classic urban, fantasy world, with elves and dwarves and ogres, and all the usual magical races. There’s nothing especially new or creative about the setting or the magic. This is mostly an action story with a bit of a mystery. There are some hints of new abilities and new weapons that may be explored in the next book. But there is only a little bit of change in the world or characters in this book. Mostly the main character works to fix what went wrong, and we end the book with everything back where we started. The action is a lot of fun, and the characters are interesting. But it didn’t have the world building and the big surprises that I especially love. So I don’t think I’m going to continue the series.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "OpinionatedLady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVGSQWH225GBCAFGEMP7M35PPRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R201XZY4YI5PTH?ASIN=B088B1GK7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Great intro to a new series",
                "reviewText": "I cannot wait to read the next installment. These characters are so intriguing, and have so many possibilities for great backstories, future mayhem, and witty repartee. I'm hoping to see Dmitri and Nan join forces, to find out why the dragon was assigned to Earth, and to watch our hero get some happiness.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hyacinth E. Palmer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2MZPR2NSGZPH2JPWLJXUWYWAFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15Z63KMVJ78CS?ASIN=B088B1GK7X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "3.0 out of 5 stars It Was Okay",
                "reviewText": "Val Thorvald, the assassin worked all of my nerves but, I liked the action in the book. I don't know that I will read more. With audiobooks following along with Kindle, it has to keep me engaged. This one didn't quite do that.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arlene J. Medder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXJ3ADSBQ5X4ZCFKU7DEQL3F76Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JPOHJWKYGCHX?ASIN=B088B1GK7X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Some days it doesn't pay to be a secret government assassin",
                "reviewText": "Like when your insurance won't cover your jeep after it's been tossed into a tree. Or your boss doesn't believe you should get a combat bonus for killing a wyvern.And of course, when a dragon shows up.Val is a government contractor sent to kill magical entities that have been killing people. She was as a soldier and tried to have a normal life once. But when people are in danger and she can help, she can't stay away.She is snarky, entertaining and dangerous to be around. She has a life before the story starts but this is a new chapter.I started reading & gulped it down like fresh cold water on a hot day. There's a lot of good material but I don't want to spoil it. If you are undecided, read the sample & then buy the book (like I did).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Moogie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 22, 2023",
                "reviewTitle": "A great read!",
                "reviewText": "The story moves right along with lots of action, intrigue and magical creatures on both sides of the issue!So far, I love all of Ms Buroker's books!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SSinclair",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 13, 2024",
                "reviewTitle": "What a good read.....",
                "reviewText": "What a good read.... thoroughly enjoyed it! Nice characters along side main character Val.... I do like her attitude fun and feisty! I did go in reading this thinking that I'd only read this one, but have downloaded book 2 already! And am pretty sure 3 will be making my list very soon....",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 13, 2021",
                "reviewTitle": "Fun and light UF adventure",
                "reviewText": "I loved L. Buroker‘s „Emperor’s Edge“ series and was disappointed that this wasn’t the case with many of her later novels. So I am really happy to tell you that this first in a fun UF series finally had all the good vibes that I loved about EE.Val is a half-elf and works as a contractor for the army in nowadays Pacific Northwest. Whenever a supernatural is convicted for heinous crimes, she is the executioner sent out to kill them (people with elven blood are rare and rather hard to kill). That is, until a dragon appears who says that she is interfering with his task given him by the Dragon Justice Court (which none on Earth knows, because the last dragon is said to have visited this world a thousand or more years ago). And her liaison at the military gets ill (and it seems that the cause is of magical nature). And a few problems more. For example that Val as executioner is overall strongly disliked in the supernatural world. Nevertheless she sets out to save her boss, avoid the pompous dragon and watching her on her quest is a lot of fun. The action is fast paced, the dialogue and comments are deadpan and at times even hilarious.It’s not the most refined world- or character building, but for one it’s enough and second, this is the first in a series so I expect both to become more elaborate over the course of the series. Anyway, I had a lot of fun reading this book and will definitely continue with the next installment right now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "doris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 29, 2020",
                "reviewTitle": "Great book.",
                "reviewText": "Interesting new series. Love the fact Val is older and the setting is our world and all the modern references. Looks like this is going to be an action packed fun series with diverse interesting characters. Am loving the tiger and the dragon , Dimitri and Nimm, well actually all the good guys! Let me say right now Val and Zav had better get off together, am hoping for elven dragon offspring here! Good luck Lindsay with this new series can not wait for the next book in the series. x",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jane",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 4, 2023",
                "reviewTitle": "Dragnns can be annoying.",
                "reviewText": "I became more enamoured with the character as the boo went on. Love the Tiger, but the dragon makes me want to slap him up upside his head. Hoping that he will grow on me as he grows up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}