{
    "remaining_requests": 266,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Forgotten-Kingdom-Lost-Queen/dp/B084HMP7F5",
    "body": {
        "name": "The Forgotten Kingdom: The Lost Queen",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Forgotten-Kingdom-Lost-Queen/dp/B084HMP7F5",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51gIGby38vL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Signe Pike",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Signe+Pike"
        },
        "brand": "Signe Pike",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1350,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From the author of The Lost Queen, hailed as “Outlander meets Camelot” (Kirsty Logan, the author of The Gloaming) and “The Mists of Avalon for a new generation” (Linnea Hartsuyker, the author of The Golden Wolf), a “rich, immersive” (Kirkus Reviews) new novel in which a forgotten queen of sixth-century Scotland claims her throne as war looms and her family is scattered to the winds.AD 573. Imprisoned in her chamber, Languoreth awaits news in torment. Her husband and son have ridden off to war against her brother, Lailoken. She doesn’t yet know that her young daughter, Angharad, who was training with Lailoken to become a Wisdom Keeper, has been lost in the chaos. As one of the bloodiest battles of early medieval Scottish history abandons its survivors to the wilds of Scotland, Lailoken and his men must flee to exile in the mountains of the Lowlands, while nine-year-old Angharad must summon all Lailoken has taught her to follow her own destiny through the mysterious, mystical land of the Picts.In the aftermath of the battle, old political alliances unravel, opening the way for the ambitious adherents of the new religion: Christianity. Lailoken is half-mad with battle sickness, and Languoreth must hide her allegiance to the Old Way to survive her marriage to the next Christian king of Strathclyde. Worst yet, the new King of the Angles is bent on expanding his kingdom at any cost. Now the exiled Lailoken, with the help of a young warrior named Artur, may be the only man who can bring the warring groups together to defeat the encroaching Angles. But to do so, he must claim the role that will forever transform him. He must become the man known to history as “Myrddin.”“Intrigue, rivalry, and magic among the mists of old Britain - The Forgotten Kingdom is an enchantment of a read.” (Kate Quinn, New York Times best-selling author of The Alice Network) Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Family Saga",
                "link": "https://www.amazon.com/Family-Saga-Genre-Fiction-Books/b?ie=UTF8&node=10163"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "14 hours and 32 minutes"
            },
            {
                "name": "Author",
                "value": "Signe Pike"
            },
            {
                "name": "Narrator",
                "value": "Toni Frutin, Gary Furlong, Siobhan Waring"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 15, 2020"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B084HMP7F5"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,821 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #98 in Arthurian Fantasy (Books) #193 in Historical Fantasy (Audible Books & Originals) #208 in Fiction Sagas"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENBVWRPBR2MM7FFZKWS76FTWOSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SL0TEQY1L2AC?ASIN=B084HMP7F5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Gripping!",
                "reviewText": "I've just finished both book 1 & 2 of this series in less than a week. I found the author's writing to be quite enthralling and would stay up to the wee hours (when I should have been sleeping) because I could not put these books down. Wonder filled blend of history, supernatural fantasy, and yet emotional human experience. I am hooked and can't wait for book 3. I really enjoy the feminine retelling and this is now a favorite.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Werscotties",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3SLK4T3ZWV3VH2KUAOQMLBDE5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33KF9R91WZTMI?ASIN=B084HMP7F5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2023",
                "reviewTitle": "5.0 out of 5 stars the forgotten kingdom",
                "reviewText": "Draws you in early in the story. Keeps you sitting on pins and needles. The ending kinda drops and leaves you hanging. Thus book three!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lauralee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT7I6GWWL6BG4RPHZ5WQ6GWDLFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9290BSD1Z8OQ?ASIN=B084HMP7F5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 6, 2022",
                "reviewTitle": "4.0 out of 5 stars A Good Sequel!",
                "reviewText": "The Forgotten Kingdom is the sequel to The Lost Queen. Languoreth is a prisoner in her own council as she awaits the news of her husband who is fighting against her brother and first love. Eventually, her husband returns and becomes king. As queen, can Languoreth find a way to bring peace between the Old Religion and the New? As Languoreth learns the ropes of queenship, she discovers that there is a personal cost. Languoreth is the sole narrator in The Lost Queen. However, her story is barely focused upon because the story also focuses on her brother, Lailoken and her daughter, Angharad. She sits on the sidelines throughout the novel, which I was a little disappointed in. Still, this novel shows Languoreth as a grieving mother who yearns for her lost children. There are also some glimpses of her striving to be a good queen and leader. Still, I wish that there was more to Languoreth’s journey than what was offered in this novel. I loved Angharad’s story as she grows from a child to a confident priestess. She is the true hero of this story. I found Lailoken’s story to be my least favorite and unnecessary. You could skip his chapters and not miss out on anything in the story. Overall, this novel is about war, religion, and choices. The characters seemed to be very complex. The setting seemed very realistic and made medieval Scotland come to life. The Forgotten Kingdom was beautifully written and made me feel like I was walking alongside the characters. I also thought the ending seemed rushed. Still, I can’t wait to read the final book in the trilogy. I want to see what the next book has in store for these characters! I recommend this novel for fans of Queen of Oak, The Mists of Avalon, and The Raven Queen!(Note: I read an ARC copy of this book in courtesy of Netgalley.)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FrejaFolkvangar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJWQAA7C4MWPSXBQC5FNIMKCWZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R180UHLJHLLJGZ?ASIN=B084HMP7F5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Better than Mists of Avalon",
                "reviewText": "I LOVE this series and this book was even better than the first. I can’t wait for the third one. Fans of The Mists of Avalon, The Last Kingdom, and The White Queen take note.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lady Anne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEW7HPPE2Z5TZVZZ6UYV2QSFOVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LTGZOB0A3E1S?ASIN=B084HMP7F5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2021",
                "reviewTitle": "5.0 out of 5 stars Would It Were So!",
                "reviewText": "I am actually blown away by Ms Pike’s writing style. Her incredibly detailed research allows her to take a very few known happenings from Scotland’s 6th century and build a completely believable (historically based) novel detailing early days and the people that inhabited that land ! Kudos also go to the person(s) responsible for proofreading the manuscript, ensuring a minimal amount of typos or missing words or glaringly incorrect use of a more modern words. The fact that there are love relationships between characters without them being far too graphic for my taste is also much appreciated! Her descriptions of battle scenes was realistic enough to have me on the edge of my seat. Based on all the above, I certainly look forward to reading more by Signe Pike!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "W. Bissell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBETWEIC3MJKQXUCXPBKVEYBGEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B398ZEY3RUFM?ASIN=B084HMP7F5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 18, 2022",
                "reviewTitle": "5.0 out of 5 stars Wonderful series so far.",
                "reviewText": "I couldn't put the two books in this trilogy down, so there was very little sleep! Wasn't sure it was going to be a book I'd like, but as the story progressed, it draws you in with rich details. Everything from plants to clothing were described in lovely detail. The love for a horse, playing of instruments, and the use of different buildings, are important parts of the story. The knowledge at the end of this book was insightful and interesting. Just hope this truly is a \"trilogy,\" as it's been described!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Reynard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMGUP6RLGIZA6TOUXXAFKZ7GV7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BMOD3D3HKNM6?ASIN=B084HMP7F5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 13, 2021",
                "reviewTitle": "4.0 out of 5 stars The Forgotten Kingdom",
                "reviewText": "I really enjoyed the first book, so I leapt into this one to what awaited our protagonists. Especially since the first ended on such a cliffhanger.I wasn't disappointed. Although I'm glad it was a trilogy, as I was left feeling slightly dissatisfied and wanting to know what happened at the end. This book focuses more on Lailoken rather than his sister (of the first book), but it does include her at parts, and also her daughter, who goes on her own adventure. And this book is a lot bloodier, with battles and war. It does span over the years, although the chapters themselves take place in one time and then it will \"jump\" to a different time line throughout the book.I thought the different perspectives were good. I almost liked the first when it was more one narrator, but with all the stories being told in this book that just would not have been possible. It's just that I got connected to Languoreth and her tale, and I grew comfortable on her journey. It's not that her brother and daughter aren't interesting, I just like her.So all that said, I'm eager for the next book to come out. I want to see where this journey goes and what the final resolution is for our characters.Review by M. Reynard 2021",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPM7XGO2ZMHO3WWLKBEOHBW4AXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21LX5O9UATDI3?ASIN=B084HMP7F5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Interesting mixing truth with fiction.",
                "reviewText": "Wish green could be reunited with her love. Can’t wait for last book to come out!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DogMum21",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 22, 2021",
                "reviewTitle": "Excellent",
                "reviewText": "I read this in 24 hours, after finishing book #1. I highly recommend it if your enjoy reading historical novels, particularly those based on true events and people. It gives you a glimpse in to the world and life at that time which I found very interesting. There are a lot of characters but I was impressed with how well written the story is that it is not difficult to keep up with them all. The map at the start is very useful.I love coming across books like these - brilliant story telling, transports you to a different time and place, and leaves you feeling as though these characters are now friends. I am so looking forward to finding out the rest of the story in book 3 when that comes out. Authors notes at end are really helpful too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 31, 2021",
                "reviewTitle": "Love this book",
                "reviewText": "I really loved this book. Already looking forward to read the next one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "begosalem",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 21, 2020",
                "reviewTitle": "Hope is rising again",
                "reviewText": "I loved it... Set in 6th century Scotland (not yet Scotland as we know it now, actually), after the demise of the Roman Empire and before the threatening invasion by the Angles, once again Signe Pike takes us back in time to the dawn of Arthurian legend.As for now, these characters - Myrddin/Merlin, Arthur himself - are but sketches of the famous figures they will become, we only catch glimpses of their grandeur to be. Lailoken (the future Myrddin) is one of the main actors of the story, but the author interweaves his path with that of great women of his time: his twin sister Languoreth, the Lost Queen, his niece Angharad and the Wisdom Keeper Ariane, to name a few. After the Battle of Arderydd, when everything seems to be lost, we see hope rise again among the Britons, Scots and Picts of the Old North.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Kelly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 21, 2020",
                "reviewTitle": "A fantastic story!",
                "reviewText": "I received my copy as soon as it became available and dove right in. This is the perfect sequel to The Lost Kingdom by Signe Pike. It follows the journeys begun in the previous book by Languoreth and her twin, Lailoken. These are dangerous times for not only themselves but those they love.Signs is a fabulous storyteller, weaving fact with fiction into a compelling tale of human frailty, magic and survival in a pre-Medieval time in what is now known as Wales, Scotland and Briton. My ancestors are from the areas mentioned so for me, this series has been a compelling read. I didn't want to finish either book as it meant a wait for the next. I look forward to word of the third instalment of this trilogy and also look forward to many more books from Signe Pike.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Audrey Moulin ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 5, 2021",
                "reviewTitle": "The third book can't come quickly enough!",
                "reviewText": "Just as beautiful as the first book. Languoreth and Lailoken's story is an unforgettable one. I can't wait for the third book to come out!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}