{
    "remaining_requests": 111,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Monstrilio-Novel-Gerardo-S%C3%A1mano-C%C3%B3rdova/dp/1638931607",
    "body": {
        "name": "Monstrilio: A Novel",
        "price": "$15.30",
        "originalPrice": "",
        "rawPrice": 15.3,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Monstrilio-Novel-Gerardo-S%C3%A1mano-C%C3%B3rdova/dp/1638931607",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91idW+4A9EL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Gerardo Sámano Córdova",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Gerardo+S%C3%A1mano+C%C3%B3rdova&text=Gerardo+S%C3%A1mano+C%C3%B3rdova&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 419,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review A Best book of 2023NPR • Barnes & Noble • Elle • Book Riot • BookPage • GoodReads • Shondaland •The Observer • PolyGon • HuffPost • Powell’s“At once heartbreaking and unapologetically strange, this is a cross-cultural, syncretic, folksy, razor-sharp narrative about the horrors of grief and the eternal debate over nature versus nurture. . . . Monstrilio packs in a lot, and the author pulls it off brilliantly. It is at once dark and tender, at times bleak, but balanced with humor that borders on slapstick . . . an outstanding debut; for all the ground being broken in genre-bending horror, his is a distinctive, exciting new voice in fiction.” ―Gabino Iglesias, Los Angeles Times“Bizarre and brilliant, Gerardo Sámano Córdova’s Monstrilio is a sort of modern Frankenstein.” ―Lauren Puckett-Pope, ELLE“How to explain my love of this bizarre book? It is grotesque, heavy, gut-wrenching, and painful and I still loved it . . . There is a lot in this story to unpack around death, self-acceptance, unconditional love, and challenging social norms.” ―Cheri Anderson, Boston Globe“In his masterful and surreal debut novel, Mexican author Gerardo Sámano Córdova revels in the mire of grief, then lifts the veil and gets playful with it, like the Brothers Grimm ghostwriting Stephen King . . . Monstrilio is full of surprises and delightfully messed up―at once precise and inscrutable and horrifying.” ―Patrick Rapa, The Philadelphia Inquirer“This book is a slow-burning monster story incrementally creeping up on the unsuspecting reader . . . [and] a creative study on the process of mourning and the lengths people will extend themselves in order to preserve a loved one's spirit, presence, and essence.” ―Jim Piechota, Bay Area Reporter“An extraordinary act of imagination, an extended meditation that begins in grief, family, belonging, and moves past that, into a deeper discovery of the power of love―and the powerlessness of love, as well its strangeness. With Monstrilio, Sámano Córdova makes a remarkable, kaleidoscopic debut.” ―Alexander Chee, author of How to Write an Autobiographical Novel“Simply exquisite. Easily one of my favorite reads this year.” ―Sarah Gailey, bestselling author of Just Like Home and The Echo Wife“Gerardo Sámano Córdova’s dark, soulful magic puts me in mind of Kelly Link or Carmen Maria Machado (and further back, Mary Shelley). The horror of grief has rarely been so viscerally or movingly evoked.” ―Peter Ho Davies, author of A Lie Someone Told You About Yourself“Haunting and often bleakly humorous, Gerardo Sámano Córdova’s Monstrilio is a captivating tone poem of trauma, grief, and transformation. Córdova writes with the lyrical precision of a master surrealist and creates an uncompromising vision of literary horror that is so wholly unique and utterly his own.” ―Eric LaRocca, author of Things Have Gotten Worse Since We Last Spoke and Other Misfortunes“Heartfelt, bizarre, and unexpected, Sámano Córdova’s Monstrilio, which tells the story of a grieving mother who ends up raising a creature that grew from a chunk of her dead son’s lung as her child, is unlike anything else in contemporary horror. At once a novel about family and love, a creepy tale that questions what it means to be human, and a celebration of queer stories, Monstrilio is as shocking as it is profound, and as humorous as it is thoughtful. With any luck, this novel, which is rich in cultural context and ideas, will catapult its author straight into the radars of not only horror lovers but also all readers who enjoy great writing.” ―Gabino Iglesias, The Boston Globe“In Gerardo Sámano Córdova’s spare, soulful, and singular Monstrilio, a mother’s grief turns monstrous, literally taking on a life of its own. As tender and terrifying as its titular character, Monstrilio is just as likely to work its way into your heart as into your nightmares. Prepare to unhinge your jaw and devour it whole.” ―Maria Adelmann, author of Girls of a Certain Age and How to be Eaten“Monstrilio is the monster story about grief I've been craving. Bloody and full of longing, it gets under your skin and doesn’t let you go. A thrilling and heartbreaking ride from Mexico City to NYC to Berlin, brilliantly capturing what it means to lose someone you love with ferocious tenderness. Gerardo Sámano Córdova is an international revelation and one of the boldest new voices writing today.” ―Akil Kumarasamy, author of Meet Us by the Roaring Sea and Half Gods“Monstrilio is unlike any other book I’ve read. Genuinely scary at times, it moved me with its humanity, made me laugh, and ultimately, made me cry. Gerardo Sámano Córdova has written a stunning exploration of grief, belonging, and familial love in prose so beautiful you won’t want to rush through it―even as you need to know what happens next.” ―Ana Reyes, author of The House in the Pines“Part of a new wave of haunted house horror that continues to expand and redefine the genre, Monstrilio is about a woman who creates a monster from a piece of her dead son’s lung, feeding it bloody sacrifices as it grows into the image of her long-gone child. Her monstrilio is loved, cared for, and wholly monstrous. But are not the monsters among us also capable (and deserving) of love? Read this if you liked Sarah Gailey’s Just Like Home!” ―Molly Odintz, Lit Hub“What lengths would you go to get back someone you’ve loved and lost? Just for a bit, to look in their eyes one more time, or tell them what needed to be told? But play that possibility out to its inevitable conclusion and it’s difficult to envision anything good coming from it. In Córdova’s horror debut, a grieving mother in Mexico City goes to unimaginable extremes to bring her late 11-year-old son back to life, only to discover that there are worse things than death. Grief, she learns, is not something to be trifled with, or worse, avoided.” ―Il’ja Rákoš, The Millions“Sámano Córdova’s work is as devastating as its premise is whimsical.” ―Carl Lavigne, Ploughshares“Gerardo Sámano Córdova is hitting the ground running with his debut novel. . . . Stunning and horrifying.” ―Bob Pastorella, This is Horror“Sámano Córdova’s writing is piercing and intimate. Whether describing Monstrilio’s first, vicious moments of life or the subtle, strained romance between Magos and her childhood friend Lena, Sámano Córdova keeps readers breathless . . . his novel seeks to embody [grief], making this nameless, eternal pain something we can speak to and hold.” ―Eric Ponce, Book Page, starred review“Gerardo writes with the potency of a master, painting an image that takes feelings of genuine sadness and morphs it into a very disturbing situation. I read those first few pages with watery eyes and a grimace on my face, and from that moment on, I couldn’t put the book down. This genre-bender takes an incredibly sad tale of loss and grief and coats it in surrealism and horror, and the result is one of the most original and fascinating novels you’ll read this year. . . . An amazing read. Don’t miss it.” ―Akram Herrak, Independent Book Review, starred review“Sámano Córdova’s prose is beautiful . . . He captures the heartbreak in aching detail, and the strangeness of the tale only adds to the power of emotions here. He also does a fantastic job of using setting to support the story without overpowering. Bloody and tender, Monstrilio is a singular novel, elevating both horror and family drama into something universal and unforgettable.” ―Sarah Rachel Egelman, Bookreporter“In this wicked debut novel, Sámano Córdova combines queer themes touching on identity, kink, and consent with Latin American mysticism for an unusually visceral coming-of-age tale . . . There’s no doubt there’s nothing quite like it. A Promethean fable about reconstruction, reinvention, and the occasional human-sized snack.” ―Kirkus Reviews“Grief takes the shape of a monster in Sámano Córdova’s disturbing yet touching literary horror debut . . . Sámano Córdova creates complex characters who make difficult decisions that blur the lines between being human and being a monster. Fans of Eric LaRocca, Agustina Bazterrica, and Carmen Maria Machado will appreciate this unique take on the horror genre.” ―Verónica N. Rodríguez, Booklist“Córdova asks the reader to consider the limits of familial love and understanding. He provides no easy answers, and readers may find themselves touched and horrified in equal measure . . . An enthralling debut that packs a heavy emotional punch. Fans of domestic horror like Zoje Stage’s Baby Teeth or Ashley Audrain’s The Push will find a lot to chew on here.\" ―Colin Chappell, Library Journal“The beastliness of grief is heartbreakingly rendered in Córdova’s folklore-inflected first novel, which follows a bereaved mother taking the lung of her recently deceased son and nurturing it back into the boy she lost. But death can never be totally thwarted, and the son that returns isn’t quite the same.” ―Michelle Hart, Electric Lit“In this imaginative debut, one mother is going to discover the limits to maternal love―but not before lots of terrible stuff happens . . . Raising a piece of a corpse to love as your own child sounds like a good idea, right? Spoiler: No, no it does not.” ―Liberty Hardy, Book Riot“Gerardo Sámano Córdova’s novel Monstrilio is a surreal and haunting debut, a book I could not put down that exquisitely explores themes of love and grief.” ―Largehearted Boy“Sly and unsettling . . . Sámano Córdova does a good job elucidating the contours of grief and love. This creepy work of psychological horror gives readers plenty to chew on.” ―Publishers Weekly“Gerardo Sámano Córdova pens a creative, visionary, and fantastic examination of grief and love; parents and children; friends and lovers. Once you start the book, you won’t be able to un-read it. Unforgettable is the most perfect word here.” ―Barnes & Noble Editors, Most Anticipated Book Releases of March 2023“A debut novel like no other . . . This beautiful (yes, I said 'beautiful') novel will be the most talked about Horror book of the season.” ―Jules Herbert, B&N Reads“A literary horror tale that trudges through the gruesome, visceral parts of grief nobody likes talking about. With othering queerness at its core, Monstrilio won't hurt you, but will absolutely knock you around a bit. You've read nothing like it.” ―Stacy Wayne D., Powell’s“Queer author Gerardo Sámano Córdova is having a moment. The University of Michigan grad’s debut horror novel, Monstrilio, out now, is the talk of the literary community.” ―Sarah Bricker Hunt, Pride Source“Gerardo Sámano Córdova dives head-first into a complex blend of conventional literary fiction and disquieting horror . . . The book’s departures from realism only enhance this message of healing and introspection, giving the novel an insightful and deeply human quality. Stylistically, Monstrilio shines. An intimate stream-of-consciousness writing style places the reader directly in the mind of the narrator, yet the prose’s depth and beauty keeps the book a page-turner . . . Monstrilio is a wild ride that questions the limits of love, family, and what it means to be human.” ―Aiden J. Bowers, The Harvard Crimson“For readers with a soft spot for unconventional monster fiction, Gerardo Sámano Córdova’s debut novel Monstrilio is packed with metaphor and nuanced layers of horror and humanity. The novel draws the reader into the raw, intimate spaces of mourning and creates something distinctly original as the story effortlessly blends speculative horror with grief, sexuality, and what it means to be human . . . Córdova masterfully blends the elements of literary horror and folklore to create something distinctly modern and unique.” ―Corrine Watson, f(r)iction“An outstanding novel that . . . brings to the forefront elements of grief, loss, love, and loneliness. These elements, without compromise, are real and the most raw of human emotions. These emotions are easily explorable, just as they are. This read was a fresh take on horror . . . one that I had never seen before.” ―Mark Haskell, The Gatepost“Gerardo Sámano Córdova’s debut literary horror mix seems plucked straight out of a Guillermo del Toro film . . . a deeply wrought narrative that tackles grief with prose that is as beautiful as it is delightfully gory.” ―Brigid Flanagan, The Observer About the Author Gerardo Sámano Córdova is a writer and artist from Mexico City, where he currently resides. He holds an MFA in Fiction from the University of Michigan. He has studied with Alexander Chee at Bread Loaf as a work/study scholar, and with Garth Greenwell at Tin House. His work has appeared in Ninth Letter, Passages North, and Chicago Quarterly Review, and is forthcoming in The Common."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 13 hrs 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“Heartfelt, bizarre, and unexpected. . . . At once a novel about family and love, a creepy tale that questions what it means to be human, and a celebration of queer stories, Monstrilio is as shocking as it is profound, and as humorous as it is thoughtful.” ―Gabino Iglesias, Boston GlobeA “wholly unique” and “uncompromising” literary horror debut about a boy who transforms into a monster, a monster who tries to be a man, and the people who love him in every form he takes (Eric LaRocca, author of Things Have Gotten Worse Since We Last Spoke and Other Misfortunes)Grieving mother Magos cuts out a piece of her deceased eleven-year-old son Santiago’s lung. Acting on fierce maternal instinct and the dubious logic of an old folktale, she nurtures the lung until it gains sentience, growing into the carnivorous little Monstrilio she keeps hidden within the walls of her family’s decaying Mexico City estate. Eventually, Monstrilio begins to resemble the Santiago he once was, but his innate impulses―though curbed by his biological and chosen family’s communal care―threaten to destroy this fragile second chance at life. A thought-provoking meditation on grief, acceptance, and the monstrous sides of love and loyalty, Gerardo Sámano Córdova blends bold imagination and evocative prose with deep emotional rigor. Told in four acts that span the globe from Brooklyn to Berlin, Monstrilio offers, with uncanny clarity, a cathartic and precise portrait of being human. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Zando (January 30, 2024)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1638931607"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1638931607"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 0.75 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,533 in Books (See Top 100 in Books) #130 in Magical Realism #667 in Horror Literature & Fiction #1,191 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 419 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/899d529d-33ea-4f0b-9c0d-a6f490210860.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b38ae8c9-b987-4181-9393-f71224314929.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e18c9b1b-d768-49d9-a90c-046bda6012ff.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3aa398bc-9949-4955-85f7-96dd81181000.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/51aa2100-0758-4bf8-85bc-60c7c01b70e3.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ab90d2c3-af14-43d1-891c-2745280cebec.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cef06156-b466-4424-a74e-d54310f0bb5f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d0b05a7-9bf4-47bc-ac23-f5253eaee148.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stephanie Maness",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY5UE4YDROLXKZJ6OOTZQZVVUYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R389CXLCLIP4JF?ASIN=1638931607",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Read",
                "reviewText": "Amazing, weird, beautifully written piece of work about what it means to be a mother/OR just what it means to love unconditionally and what lengths you would go to for love or grief. Love it, 5 stars, can’t wait read more from this author.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBV4GRHWK5GUUN2E4NNAPJ3PO4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UAKJNY184KAP?ASIN=1638931607",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Creepy, well written, great Halloween/Muertos read",
                "reviewText": "This is unlike anything I have read previously. The writing is crisp and flows quickly. There are a few really gory scenes that were a bit tough to read, but necessary to the story. The POV switches in the novel were really interesting and well done, too. It was also refreshing to read because everyone in the book is queer, even the monster! Fun 3.5* novel!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amy S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6VSEZ2AXHPVJNSPNJGKDINPSPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WB2VUZFJA6G?ASIN=1638931607",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars incredible",
                "reviewText": "Beautiful and bittersweet. Loved every page… savored every word.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mick AlbrightMick Albright",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXYFEPQ6NFKXBXEWMTB2LSJ7EZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JG0DY7L5GC4I?ASIN=1638931607",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Don’t Miss This One",
                "reviewText": "#reading #Monstrilio (Zando 2023) by #GerardoSámanoCórdova. This is an #amazing #book. It’s #horrifying. And it’s #creepy. And it’s so #overthetop you’ll catch your breath. It’s also #human and #heartbreaking. I’ve even caught myself laughing in places. More a nervous giggle. This is a new #writer and a #novel to be reckoned with. And it’s his first one. The prose is #stunning and #colorful and lean and effusive, and #restrained while in most paragraphs, it sways heavy with meaning. The bookstore had it shelved with “#Horror” #fiction. I’ll say. Jesus. I jumped when the wind coming in through the back window met the air being sucked out the other end of the house by the front window—and a door in between about a foot from where I was sitting slammed shut like a coffin lid.—But it’s also not horror fiction. It’s dramatic and its characters are sharply drawn in just handfuls of words. It’s also folkloric and is run through with a feeling that just being there—anywhere near this story—is a risk. Like walking along the edge of a cliff is a risk; or going around in graveyards at night; or saying ‘Bloody Mary’ in a mirror three times. That keeps things tense. These are things we shouldn’t be seeing. Or overhearing. Private things. Couched in a gripping style. You’re going to wish you hadn’t seen or heard a damn thing once you’ve begun the arc of this tale. We have been reading it out loud in bits. It’s too #beautiful not to #savor. ⭐️⭐️⭐️⭐️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71AeIazGdqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Kelly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCV3BW2R3LFLY7TGEWIFPF7NSDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J1IL5GKU0OS2?ASIN=1638931607",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2023",
                "reviewTitle": "3.0 out of 5 stars A Gripping Tale of Grief, Desperation, and the Fragility of Second Chances",
                "reviewText": "Book Information\"Monstrilio\" is a novel written by Gerardo Sámano Córdova, a writer and artist from Mexico City. It was published on March 7, 2023, and spans 306 pages. An audio version of the book, narrated by Victoria Villarreal and Johnny Rey Diaz, is 7 Hours and 58 Minutes and is set to be released on June 13. \"Monstrilio\" serves as Gerardo's debut novel, following his previous works in the form of short stories.SummaryMagos, a mother overwhelmed with grief, resorts to a drastic and unconventional measure following the death of her son, Santiago. In a desperate bid to cling to a fragment of his existence, she removes a portion of his lung. Driven by maternal instinct and influenced by a folk tale, Magos assumes the role of caregiver to this bit of organ.The lung segment gradually acquires sentience, transforming into an entity known as Monstrilio. Concealing Monstrilio, Magos nurtures it diligently and in secrecy. As Monstrilio matures, it increasingly bears an uncanny resemblance to Santiago—a poignant reflection of Magos' enduring love for her departed child.However, beneath Monstrilio's outward resemblance to Santiago lies a primal nature, compelled by carnivorous instincts that jeopardize the fragile second chance at life granted by Magos. The collective support provided by Magos' biological and chosen family partially mitigates Monstrilio's destructive tendencies. Yet, the constant threat of losing control looms ominously.My Thoughts\"Monstrilio\" by Gerardo Sámano Córdova is a beautifully written and deeply powerful narrative that explores themes of grief, family dynamics, and self-discovery. The story begins with a mother's desperate grief over the loss of her child, delving into the different ways people express and interpret grief, which can create divisions within families. Córdova's raw depiction of a family grieving is both poignant and moving.In addition to the exploration of grief, \"Monstrilio\" takes readers on a transformative journey with the character M. M starts as a literal monster and gradually transforms into a teenager, navigating issues of sexuality, internal struggles, self-doubt, and the challenge of fitting into a world that feels alien to him. The book delves into GLBTQ relationships across various characters and explores kinks, sometimes non-consensual in nature. Readers who may be uncomfortable with these themes should be aware of their presence, as the book description does not provide insight into their inclusion.The narrative unfolds through multiple points of view, allowing readers to intimately connect with characters like Magos, the grieving mother; Joseph, the father who struggles to empathize with Magos' loss; Lena, Magos' closest friend; and eventually, M or Monstrilio. These diverse perspectives add depth and provide unique insights into the story.The audiobook version of \"Monstrilio\" is skillfully narrated by Victoria Villarreal and Johnny Rey Diaz. Their performances bring the story to life. However, at times, it can be challenging to distinguish between the characters when they are speaking.While \"Monstrilio\" is undeniably well written, readers expecting a horror-focused narrative may find themselves disappointed. The book leans more towards literary fiction, with elements of horror used more as a vehicle to explore the human condition, particularly grief, family dynamics, and sexual/kink exploration.One aspect that may divide readers is the book's resolution or lack thereof. The story concludes in an open-ended manner, leaving many questions unanswered. Readers accustomed to structured story arcs and a definitive resolution may find this aspect less satisfying. I know I fall into that category.Recommendation\"Monstrilio\" by Gerardo Sámano Córdova is a unique and moving story that combines powerful themes with beautiful prose. The exploration of grief, family dynamics, and self-discovery is handled with depth and sensitivity. While the book may not fully align with the expectations of horror enthusiasts, if you are looking for a literary fiction novel that offers a thought-provoking examination of the human experience….this book may be for you.Rating3 Monstrous Stars",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shelby koning",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXNDXFHFJIQV5IEAXU5XGVYTNJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R269XH7NYE77S0?ASIN=1638931607",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Surprising Depth",
                "reviewText": "Even though I read an ebook advance copy, I preordered the hardcover as soon as it was available, because this is a new favorite. The beauty of the writing drew me in, but the understanding of grief, and the different forms it can take was masterful.If someone is seeking traditional horror, this probably isn't what you're looking for. The book certainly has gore, but it's a very emotive and deeply layered work, no quick scares to be had here.How can we come to love a monster?What does it cost for a being to deny their very essence, is a monster ever just a monster? This book makes me think about many topics surrounding otherness, grief, masking, etc. I love a book that makes me think, but this one also made me feel deeply, examining elements of my own life with a child who's had a plethora of health issues, and yet it was not without humor (and body horror).I really enjoyed seeing the story unfold through the eyes of those who loved Monstrilio, the layers of symbolism and metaphor will stay with me, and likely continue to develop long after the book is closed. This stands out as my favorite read of 2022, out of more than 100 books. I would have read it in a sitting if life hadn't kept interrupting. Looking forward to more from the author, I'll be eagerly waiting for more! Thank you Netgalley and @Zando publishing for allowing me early access.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}