{
    "remaining_requests": 123,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Loner-Another-World-Light-Novel-ebook/dp/B095N2Z86D",
    "body": {
        "name": "Loner Life in Another World (Light Novel) Vol. 1",
        "price": "$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Loner-Another-World-Light-Novel-ebook/dp/B095N2Z86D",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81o554E9j2S._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "五示正司",
            "link": "https://www.amazon.com/%E4%BA%94%E7%A4%BA%E6%AD%A3%E5%8F%B8/e/B079KZT3YR/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 736,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B095N2Z86D"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Airship (Seven Seas) (July 1, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 1, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 12008 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 316 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#107,457 in Kindle Store (See Top 100 in Kindle Store) #114 in Teen & Young Adult Light Novel (Ranobe) eBooks #290 in Teen & Young Adult Light Novels #493 in Humorous Fantasy (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 736 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGANSCCS2BSPNDVOCWPAGVJRQF5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QZ7UYPK7FQ4O?ASIN=B095N2Z86D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 10, 2021",
                "reviewTitle": "5.0 out of 5 stars One of my favorite Isekai's!",
                "reviewText": "This is one of my favorite Isekai series. (Others I hold in the same regard are Death March and Moonlit Fantasy, for a frame of reference.) I've been following the JP version of the Web Novel (the \"rough draft\" version posted to a Japanese social media site for authors) for quite some time, and have enjoyed the Manga localized by Kaiten Books.The plot is simple enough for this sort of fare. Haruka is a loner, he likes to sit quietly and read in class, whereas the rest of his class is filled with eccentric personalities -- the fashion obsessed mean girls, the nerds, the jocks, etc. When a magic summoning circle appears under his classroom, Haruka, being a massive literature nerd, recognizes what's going on immediately and tries to escape rather than deal with it. This makes him late for the summoning -- and more importantly, late to pick out his reincarnation bonuses, which are first come first serve.Haruka is left with a massive bonus to luck -- which wasn't even one of the skills -- and the leftover trash skills that no one wanted. Like \"Villager A\"'s equipment set instead of a suit of holy armor, \"General Health,\" or \"Jack of All Trades.\"The comedy comes from the fact that Haruka is eccentric himself -- and being a loner, has difficulty communicating with other people. He's convinced he's weak, having gotten all the leftover skills -- but the thing is, they're still overpowered skills, they're just not automatic cheat skills like the others.If you like humor similar to Terry Pratchett's Discworld or Monty Python, you might like this series. The combination of seeing things through Haruka's point of view with reactions other people have to what's going on leads to many \"a-ha\" moments when you realize just what Haruka is doing and why the others are confused. There are many interlude chapters showing things from other character's POVs which explain things as well. There's an internal logic to all of it, but Haruka is also a bit of an unreliable narrator.This first book covers the first arc of the series, the \"Forest Arc\" for lack of a better term. The localization has some stylistic choices I question -- for example, the 白い変人 (\"White Weirdo\") Inn was renamed \"Laddy Flinger Boudoir.\" I'm guessing there's something there I missed. Also, during the \"carriage incident\" (the second one) the translation gets who gets the \"hair treatment\" wrong -- it's the other side that's attacking the carriage, not the guards.But yeah, nitpicks. It's still my favorite Isekai novel and I'm glad to see it licensed.So. Anime adaption soon? We'll have KyoAni do it? Sort of? 10 out of 10 stars, lets buy the BluRay?",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SlenderSera",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLXJXVOKPPKZCLVYMRJI5TLEYWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3S7AY2ZCX6HC1?ASIN=B095N2Z86D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2022",
                "reviewTitle": "5.0 out of 5 stars I absolutely loved it!",
                "reviewText": "Very entertaining. You'd think that him not remembering anyone's name would get old, but it doesn't. It's funny every time. Probably because it's something I do in real life. I barely ever remember names. For instance, my neighbors are The Dentist, Harry Potter's family, Tarzan, and Luke's father (Luke being the dog's name teehee). Even in books, I'll barely notice the first letter of a character's name. There are so many more important details to pay attention to in life, than to have to remember some random word that your parents picked out of a hat to call you.I found the main guy to be very likeable, he reminds me of me. Everyone else's problems with him usually result from their own unfounded expectations of how they think he should actually behave. If he was 'normal' they'd all be dead, who cares then about his bedside manner? Anywho, it's worth a read.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason V",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERFLPPYVPPOCRJULFS6LI4JH5AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QCJ4VVMMYB20?ASIN=B095N2Z86D",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 30, 2023",
                "reviewTitle": "4.0 out of 5 stars It's good",
                "reviewText": "It's a good story but mc lack of listening and forgetting everyone's name gets annoying sometimes. It's like I read a lot and I'm smart but everything he says and does is plain stupid.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSJG6NHUURCL6Q7GNAF3WCIRSSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VRS859RHY13T?ASIN=B095N2Z86D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 30, 2022",
                "reviewTitle": "5.0 out of 5 stars Comedic with a dash of adventure",
                "reviewText": "I read the manga a while back and honestly wasn't all that impressed with it. It was good enough to keep me occupied but that was it. Got bored again and saw it had a light novel so I tried it. I'm glad I did, this was great.One of the few Isekai novels that deal with an entire class being summoned and doesn't have their main character go through a large amount of suffering because he's a loner. MC has no issues with anybody and is just living his life how he wants. Or at least he would if his classmates would just let him be a shut-in neet.Has some decent amount of comedy with a running gag throughout the story.Grammar, while not perfect, is greatHas a good pace. Story is a little slow but the short chapters make up for itAll in all a great book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "clay hunter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXNOPEB7QCFO2AZWKSGIJJEWYAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7ZDF4G5FCOP?ASIN=B095N2Z86D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2021",
                "reviewTitle": "5.0 out of 5 stars Fun story, has tedious parts",
                "reviewText": "Fun book making fun of Isekai adventures. Main character literally just annoys and lucks his way into things. I enjoy it a lot, it's mostly comedy and hits all the tropes. It could be better, but still funTwo things annoy me about the story, everyone is completely oblivious about the main character. He makes impressive deductions, figures out plots with tangential evidence at best, has op powers, then shows these off to people. Immediately after whoever saw him do something says \"he's so weak and needs protected\" right after he shows he is significantly stronger than anyone in the parallel world. No matter how many feats people watch him pull off, it never changes.The other thing is he can't remember names, at all. It gets old fast. Calling people Nerd A, or constantly messing the name up because he can't remember a second after being told gets tedious as hell. It's not being mean spirited, it's just a part of his character",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David H. Simmons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKXPLMLC3WKU5TBWYWXIZ4HNKMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M9QRDU9A500?ASIN=B095N2Z86D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2021",
                "reviewTitle": "5.0 out of 5 stars Clever and funny",
                "reviewText": "Humor is subjective, so you might want to get the free sample first. In that, the prologue is a more serious flash-forward, but the rest of the novel is not serious at all.The MC looks at the world a little differently, reminding me a bit of Ryan Reynolds, Derek Zoolander (except smart) and a Monty Python sketch. He's a kind person, but has a off-kilter inner monologue and outer voice that I found hilarious.It's the funniest story I've read in years, but the humor is more from the dialog than from jokes or parody. To me it's much more clever and amusing than straight \"comedy\" titles like Suppose a Kid from the Last Dungeon Boonies which was not my cup of tea at all.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marko",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 27, 2023",
                "reviewTitle": "ok",
                "reviewText": "ok",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hisham",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 11, 2021",
                "reviewTitle": "Fun, but problematic",
                "reviewText": "This Isekai holds many of the usual tropes of its kind - teenagers summoned to another world by a mysterious deity, granting of cheatlike powers and skills, a fantasy world full of characters and monsters.But what sets this Isekai story apart from the rest is the neurodivergant main character. I'm still not sure how well this has been pulled off to be honest. In fact I'm pretty sure many neurodivergant readers will find some of the characteristics and characterisations laughable at best - insulting at worst.But for a first book in a series, it does well at setting up the worldbuilding and establishing the various characters - not so much at any kind of long term plot though for future books.I will definitely check out a volume 2 when it gets released - but this series is on probation for me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emmeric",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 11, 2021",
                "reviewTitle": "Un asocial dans un autre monde",
                "reviewText": "Acheté à l'aveugle et je suis énormément surpris, c'est la première fois que l'absurde m'ai fait mourir de rire dans un Light novel, curieux de voir dans quelle direction la suite ira.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 2, 2022",
                "reviewTitle": "Amazing",
                "reviewText": "This story was a real find. It has to rank as on of the best Isekai novels. A seriously amazing read. It is one of the novels where the characters act in the manner expected of them, so the story draws you in.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TF Radke",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 5, 2021",
                "reviewTitle": "When the \"special\" kid becomes the main protagonist....",
                "reviewText": "Well, it's hard to rate this book.... While the setting is the typical generic Isekai-setting, the MC is somewhat original. His quirks are entertaining, but might become more and more annoying to some readers (especially his inabillity to remember names even for just a minute).No unnecessary Ecchi-stuff and a likeable MC (Yes, Arifureta, i am looking at you!).My main complain is rather technical: The translation is... well... too strict and literal? E.g., if you are used to light novels, you might get irritated by reading \"racoon dog\" instead of tanuki.Nervertheless, in general i would recommend that you give it a try, as this book is a complete arc and can be read as stand-alone (though, as of now, vol. 2 and 3 are already up for pre-ordering)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}