{
    "remaining_requests": 388,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Calling-Slow-Dystopian-Fantasy-Novel/dp/B0C6KYX1KZ",
    "body": {
        "name": "The Calling: A Slow Burn YA Dystopian Fantasy Novel (The Calling Series)",
        "price": "$15.99",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Calling-Slow-Dystopian-Fantasy-Novel/dp/B0C6KYX1KZ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51EQ-h DPGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51KgKiYyj4L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "L.C. Pye",
            "link": "https://www.amazon.com/L-C-Pye/e/B0C6YKC1Q3/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 232,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            ""
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Answering the calling may be the last thing she does.For thirty years, the people of Landore have been segregated by the five callings, living in disunity and isolation.But for 18-year-old Talia Caffrey choosing one of the five is her hope at finding a place in a society that has rejected her. When her best friend, Jules, is kidnapped on the eve of her calling ceremony, everything changes. She walks away from her chance at belonging, becoming a fugitive who must hide her true self.Talia’s life becomes even more complicated when she encounters seven strangers who challenge everything she has ever known. Making her realize that there are more secrets in her kingdom than the ones she carries. And when one hostile but attractive member of the group becomes determined to uncover her secrets, she must hide more of herself to stay safe.Will Talia be able to find Jules? Will she be able to return home after becoming a fugitive? Will she ever find her place to belong?Perfect for fans of Dance of Thieves, Divergent, and The Remnant Chronicles. Get swept away in a coming-of-age story filled with secrets, adventure, and a clean slow-burn romance. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17466"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C6KYX1KZ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ LiftedLines Press (May 28, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 334 pages"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 979-8987974605"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 16+ years, from customers"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.25 x 0.84 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#394,923 in Books (See Top 100 in Books) #1,129 in Teen & Young Adult Coming of Age Fantasy #1,197 in Teen & Young Adult Dystopian #1,498 in Teen & Young Adult Science Fiction & Dystopian Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 232 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sarah S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHONMQ7EZNAI7V5HGKWZRVDM6OKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TE8Y8HIXLHYI?ASIN=B0C6KYX1KZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Such a great read!!",
                "reviewText": "I loved this book! It really hooked me from the very beginning. I felt like the whole time I was grasping for answers just like the main character! I loved the snippets of different POV to help the reader get a fuller picture of what was happening. I really enjoyed the main characters growth through the book, it felt relatable and my heart ached with hers at the end.I can't wait to read the second book!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dana & Richard Castleman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYRAJKQXL32L6S253YSWAZ5Y2EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROT20GOQ358M7?ASIN=B0C6KYX1KZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "4.0 out of 5 stars An Exciting New Fantasy/Dystopian World",
                "reviewText": "When Talia’s calling day approaches there is more than one issue with her choosing. When her best friend is kidnapped, her choice is the least of her concern, she has to fine her.What she finds is so much more. Meeting a group of strangers and traveling with them on the hunt for the kidnappers, Talia meets and learns so much about them and the world around her .She has also felt out of place and is just beginning to feel she might belong .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caitlyn Latson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJXW3AFWHS6TQXDWBW2IKVOJPTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9OLSINLM0772?ASIN=B0C6KYX1KZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "5.0 out of 5 stars A fun, light Fantasy read that doesn't wear you down.",
                "reviewText": "I really appreciated the romance, actually slowly paced where the MC doesn't just automatically fall in love at first sight. L.C does well ensuring the characters don't get too close for too long.I also loved the relationship with parents in this book, with so many books killing off parents/guardian figures, its refreshing to see one showcase a loving parent-to-child relationship.Certainly a start for found family, I was a bit overwhelmed with the amount of new characters at the start but L.C fleshes them out and I found myself really enjoying the female friendships! (We need more Female friendships in Ya Fantasy and Dystopian!!!) So I look forward to seeing how these new friendships develop in the next book.I enjoyed the ending! It leads nicely to the next book! A little bit of mystery is present in the whole book (in the best way) and I can't wait to see what L.C has planned!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hunter Duran",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5YYW4OEMNTAMYHZXSVBI3G3X5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZF52MWU1GHGN?ASIN=B0C6KYX1KZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Great YA story",
                "reviewText": "Oh boy, this would have been an all time favorite for teenager me. 30 year old me still enjoyed it immensely too.I loved that there were no content issues, everything was kept clean.The plot and worldbuilding had me hooked!Talia is a wonderful main character. She’s not the best at everything, but she has a big heart. Raph is your typical brooding and handsome young male character, but still likeable.The romance is clean. I’m not sure I would call it slow burn. I think I would just call it normal paced romance. The two love interests have pretty quick attraction to each other, but it’s definitely not an instant-a-love, which is always a huge plus.The writing is really good. I always knew what was going on and I could picture everything. At times the language was definitely YA. (For example “Something is going on between you and Mr. Hot and Steely.”) BUT this is YA so I’m not holding that against it. I know younger me would be in love with Mr. Hot and Steely 😂Content: clean, no swearing, slight violence but nothing overly descriptive.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy Steele",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHVLLSTYTUIYQASKF3SDYA5YSHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19WBG7IL2RA0P?ASIN=B0C6KYX1KZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars So much better than I had even hoped! Addictive!",
                "reviewText": "I absolutely loved this book! I couldn't put it down and read it straight through in one sitting. It was slow burn and kept me guessing at the corners! Would definitely recommend! I've been on the look out for clean stories that I can honestly recommend to my still growing siblings and this one definitely fits the bill!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jayden Jelso",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDCNZDNX2HSQHEMUJYUCFLFQEUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L261Q9OPMMCJ?ASIN=B0C6KYX1KZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2023",
                "reviewTitle": "4.0 out of 5 stars 3.75 Stars!",
                "reviewText": "I really enjoyed The Calling! It was a fast-paced read that keeps you interested the entire time, which I really enjoyed (being a fast-paced writer myself). People described it as a blend between Divergent and Robin Hood, and I couldn't agree more with that comparison. I thought the blend of fantasy and dystopian worked really well, though I would've liked even more of the dystopian elements as much of this book was more fantasy-esque.For the most part, I thought Talia was a great protagonist, but I had some trouble connecting with her. I didn't really understand her motivations until about halfway through the story. Jules was my favorite character, and I eagerly awaited her POV chapters as I read Talia's. The relationship between the Strangers and Talia was perfectly executed, and each of them had such distinct personalities and voices that I never had to guess who was talking (GIVE ME YOUR SECRETS L.C. PYE!).The plot was super intriguing and thrilling, though I will say I did guess the plot twist at the end. Still, that didn't make it any less enthralling.Some of the writing style wasn't my favorite, and I did notice that the book strangely seemed to switch from present tense, to past tense, and back without warning, often on the same page. It didn't pull me out of the story, but it was a bit jarring. That's just my opinion, and I can see many people enjoying that style.This book is advertised as part romance, which was one of the reasons why I was skeptical when I picked this up, as I don't usually enjoy romance. I was pleasantly surprised that it was actually a very small part of the story and didn't take precedence over the main plot. I'm sure the romance will become heavier throughout the series, and I'm looking forward to seeing how it's handled.Overall, The Calling was a fast-paced, exciting read that kept me on the edge of my seat! I read it in about 2.5 days, which doesn't usually happen with me. I'm really excited to see where Pye takes the story in the next three books!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lana's Broom Closet\\Witches BrewLana's Broom Closet\\Witches Brew",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 25, 2024",
                "reviewTitle": "Incredible",
                "reviewText": "I absolutely loved this book. I give this a 5 star It's a full 5 star as it was perfect. I loved how it was a slow burn. And I love the character growth. I love the fact that it's a slowburn romance and not full of spice cause. Sometimes there's only so much spice you can take.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61DHlqUOgLL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 13, 2024",
                "reviewTitle": "I love this book so much",
                "reviewText": "I love it! I read this book in one sitting and then instantly bought the second as soon as I saw it was out, and I have finished that one aswell, L.C Pye is an amazing writer and I if I could read this book for the first time again I would (not that I've not already started re-reading lol), I would 100% recommend this book to anyone who likes, romance or dystopian books!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 1, 2023",
                "reviewTitle": "Spannendes Buch",
                "reviewText": "Habe dieses Buch in kürzester Zeit durchgelesen, weil die Geschichte mich so sehr gefesselt hat. Wenn jemand die Divergent-Reihe und Robin Hood mag, ist das wirklich ein empfehlenswertes Buch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Catherine Leigh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 4, 2023",
                "reviewTitle": "loved this book",
                "reviewText": "This book is beautifully written, with such mystery and suspense. Love that unknown enemy aspect to the storyline.The characters have depth and you can’t help but be intrigued by each of them.The FMC is also so intriguing with her loving parents but with the rest of the village folk disliking her.I found all the rules mesmerising- the breadcrumbs of why they were implemented is fascinating.Overall a fantastic read, very unlike my usual steamy read as this has zero steamy scenes - even with that I thought it was great and I’m looking forward to reading the next book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Quinn T",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 21, 2023",
                "reviewTitle": "Amazing!",
                "reviewText": "This book was great! The story is clean and intense (hard to find these days). I couldn't put it down. 10/10!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$16.40",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            },
            {
                "price": "$20.55",
                "sellerName": "PGGEN Books",
                "sellerRating": "5"
            },
            {
                "price": "$20.73",
                "sellerName": "MT Rainier Store",
                "sellerRating": "5"
            }
        ]
    }
}