{
    "remaining_requests": 381,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Locklands-Novel-Founders-Trilogy-Book-ebook/dp/B09DP5YKRL",
    "body": {
        "name": "Locklands: A Novel (The Founders Trilogy Book 3)",
        "price": "$12.99",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Locklands-Novel-Founders-Trilogy-Book-ebook/dp/B09DP5YKRL",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81vDphQlq1L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Robert Jackson Bennett",
            "link": "https://www.amazon.com/Robert-Jackson-Bennett/e/B00CXLKR2K/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1762,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09DP5YKRL"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Del Rey (June 28, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 28, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3878 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 544 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1529414075"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#41,740 in Kindle Store (See Top 100 in Kindle Store) #441 in Action & Adventure Fantasy (Kindle Store) #991 in Epic Fantasy (Kindle Store) #1,542 in Fantasy Action & Adventure"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,762 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dcc9831d-aa1c-488d-b65c-ed4550527486.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/efb1e19f-cc7a-4e51-8302-d39f0a9ab357.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02e08cf7-3f9b-447d-ac3d-0803d1cd35f5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/71e54148-eede-41e8-9660-10e2843e4516.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3b9205fc-4bb3-4ea0-a7ea-e1d07007b3a4.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LA in Dallas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4AGB3JJOROF4KGTO62ONBLTS4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1K6JMKUZGROTJ?ASIN=B09DP5YKRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Clef's story",
                "reviewText": "In this corner we have Crasedes Magnus, the immortal heirophant -- oh, Heck, let's just call him a God -- who wants to enslave all of humanity for their own good. BOO!! HISS!! In the opposite corner we have Tevanne, which is the name we now use for the entity that came into being when Gregor Dandolo allowed the Artificial Intelligence known as Valeria to take him over, and together the two of them took control of all the scrived rigs of the city of Tevanne. (This, more or less, is analogous to taking over all the electronic devices of a modern real-world city.) Gregor's goal was to thwart Crasedes. But, alas. Valeria's intentions for humanity make Crasedes look like Saint Francis of Assisi. More BOO!! HISS!! In a third corner we have our heroes (OOO!! SIGH...) Berenice and Sancia and their good friends (not all of whom are dead). Tevanne has imprisoned Crasedes and has, for the last eight years, been making war on the collective Berenice and Sancia founded, Giva.Berenice and Sancia haven't exactly lost, but they sure as Heck ain't winning. They have reached the point where, as they themselves put it, \"there is no dancing through a monsoon\". That means, roughly, that when The Big One comes, you throw finesse to the winds and fight with everything you have.There is one important character I have not yet mentioned: Clef. Clef is a device -- a key that can open anything. We first met Clef in Foundryside, when Sancia stole him from Gregor. But Clef is not just a device -- he is also a personality. Sancia, because of her unique gift, could talk to him, so right from the beginning we were treated to conversations between Clef and Sancia, in which Clef revealed himself to be witty and clever and kind. In fact, near the end of Foundryside Clef enabled Sancia to see inside the key that holds him, where she saw him as a man once called Claviedes, who had been put in the key by Crasedes. At the end of the second book, Shorefall we learned that Claviedes was Crasedes father. At least, that's what they say, and if you can't trust a god and the person he stuffed into a key, who can you trust?On finishing Shorefall, it seemed obvious to me that Clef's story had to be told. I even hinted so in my review. And, indeed, we get Clef's history in Locklands! That is not the whole of the book, because Clef's history is revealed in the course of an ongoing war between Giva and Tevanne. It's a huge and exciting story, with battles of mountain-sized missiles hurled against floating city-size battle citadels, and eleven-dimensional chess-like strategies, and hackers scriving their way into secure places, and above all, an ideological conflict -- is humanity truly so irredeemably awful as Valeria and Crasedes believe, or is there hope for us? It is all told through the personal stories of Berenice, Sancia, Clef, Valeria, and Crasedes. It is grand and exciting and, above all, something NEW. It is rare that I read a new book that really tells a really new story. To me, this felt like one.I picked up The Founders Trilogy because it was the only finalist for the 2023 Best Series Hugo Award that I had not yet read.⬤ Children of Time Series, by Adrian Tchaikovsky (Pan Macmillan/Orbit)⬤ The Founders Trilogy, by Robert Jackson Bennett (Del Rey)⬤ The Locked Tomb, by Tamsyn Muir (Tor.com)⬤ October Daye, by Seanan McGuire (DAW)⬤ Rivers of London, by Ben Aaronovich (Orion)⬤ The Scholomance, by Naomi Novik (Del Rey)It's a great list -- I love all of them. But if I were voting, my vote would go to this one, to The Founders Trilogy. I am not predicting that it will win. Many readers will, I think, find The Founders Trilogy big and indigestible. It's a fantasy series about software development, and that's not going to be everyone's cup of tea.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erik S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOSVBDUDWWIIOX4H6MNHE7JZ3HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9NNRG68Y6SZ1?ASIN=B09DP5YKRL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2022",
                "reviewTitle": "4.0 out of 5 stars Good finish for the Founders Trilogy *SPOILERS*",
                "reviewText": "Overall, it was a lovely, poignant, sad ending that reminded me of times to Childhood's End or Accelerando. With how much of the series ended up revolving around their relationship, I thought it was apt to focus on them, and the situation also a natural outgrowth of how scriving \"technology\" had evolved. Being older myself, who has had feelings of \"falling behind\" from time to time in aspects of the culture and technology, it felt quite personal.All that said, I did feel it had some serious in-universe logical gaps. Surely there were other people who were permanently disconnected, right? We heard about the blades being used frequently during the war with Tevanne. Don't you think there would have been enough for a small community, even if Berenice chose not to live with them? The post-human minds clearly cared for their ancestors, so was there was no way to also loop them in? I was also expecting a bit more narrative exploring the levels behind the world, where Sancia was trapped, even if the novel ended more or less in the way it did, so maybe a little rushed in that way.Still, you can't complain that it didn't tie everything up nicely, as well as I think it could have.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6WLQKXPCSKWRLY3P4D4OD46ARQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HRDXBMPTSNXH?ASIN=B09DP5YKRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Wow. What an amazing finale.",
                "reviewText": "I just devoured this book in a few days. It was a fantastic close to one of the best fantasy series I've ever read. I never could have imagined this being the end when I first started this series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sotto voce",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPR3DAGWZHHNZW2LBMTXU3PLSLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17M0CFBSLRGFS?ASIN=B09DP5YKRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2022",
                "reviewTitle": "5.0 out of 5 stars Excellent! ... but then",
                "reviewText": "Interesting world-building and boundary conditions. Each installment of the trilogy pushes the magical conditions a step further. Ends well.It's attempted woke. Woke looks like it's been 'written-in' as a marketing afterthought. Absurd woke principles & applications are awkward. Patronizing. None of the attempts has relevance or value added to the interesting storyline.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ross E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZXIZ2LHP53UN6SWMCFKSDLEPDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RN9LK4NPJ90R?ASIN=B09DP5YKRL",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2022",
                "reviewTitle": "3.0 out of 5 stars Pacing and philosophical concerns do some damage *SPOILERS*",
                "reviewText": "If you are reading this last entry in the Founders Trilogy, you are well acquainted with Mr. Bennett's strengths: interpreting magic through an almost programming-like lens, gritty and down-to-Earth characters, and extrapolating social changes that would result from said magic systems all work well here (with one fairly large exception in the epilogue that I will speak to later).Before delving into specifics, I want to note one of my issues is that this final book of a trilogy feels FAR too similar to City of Miracles, the end of Mr. Bennett's first trilogy. It's not that the specific events are close (though one could talk about how in both series reality nearly is remade/unraveled by a singular entity), but that the scale of forces and thematic concerns are (e.g. the pain of being human is too great and warrants a re-creation, a kind of theodicy-related concern). I felt serious waves of Deja vu, and I don't mean in a \"cute callback\" way. I mean in a \"this kid plagiarized a paper he wrote for me previously\" way. It was significant enough I felt that I should mention it.In terms of pacing, I think that starting this book eight years later is drastic, especially since eight years of major technological changes have happened, particularly the development of Cadences (more on that later). We never get a chance to get comfortable with this new state of magical development, since every event is functionally humanity-ending. By introducing a time jump PLUS extreme developments PLUS no time to process, we are left feeling rushed as important concepts pop up. Also, if you need to draw a diagram to explain your concept in a book, I think there is a problem with the concept. To be sure, I like apocalyptic final books on which rests everything, but I would rather watch how these event impact our characters as opposed to seeing how brand new magic is changing, really, what it means to be human.This brings us to Cadences; in short, they are people who have Twinned, or completely connected so as to copy, their minds into large groups. They become gestalt consciousnesses in which there is no privacy or boundary from one person to the next. It is not so much that the concept is a problem. In fact, it seems like a fascinating subject for moral wrangling in a book. The problem is that it is treated as an unalloyed good. There are handwave moments in the text that mention everything is voluntary, but it should seem that there would be moral quandaries to the end of the individual as a singular person, that a group consciousness would, by definition, heavily influence and maybe overwrite the desires of a person. It is a concept that I want explored, but Mr. Bennett apparently doesn't want to explore, instead telling us \"nah, bro, this is great and we should all want this level of connection.\" It just seems like such a contradiction that in a gritty fantasy like this, we have something of a Pollyanna-ish solution to human suffering that is portrayed in the epilogue. Just off of the top of my head, I can't imagine how being in a cadence would impact a neurodivergent person, and how their presence would affect others in the cadence. It seems...wrong...to introduce something this new at the eleventh hour and not explore it.This novel does what Mr. Bennett is good at; if you are a fan, you will still appreciate his work here. These other issues do coarsen the overall work, however, and I think this makes for his weakest book in a long time.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 22, 2023",
                "reviewTitle": "Outstanding book",
                "reviewText": "A gorgeous finale for Sancia's story, broadening a lot the limits of scriving and convincing reality about things that were nota supposed to be...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marika hirtle-lewis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 12, 2022",
                "reviewTitle": "Strong finish",
                "reviewText": "Robert Jackson Bennett’s concludes with a strong final book to the Founders trilogy.I thought the earlier books lacked character development, but this final chapter makes up for it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sergey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 5, 2024",
                "reviewTitle": "Really good",
                "reviewText": "It was really good but RJB could have said who the person behind the bronze door was and he could have included Orso Ignacio more, Orso was my favourite character and after the second book ending, Orso never appeared which was really sad",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bilbaxo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 15, 2023",
                "reviewTitle": "Great",
                "reviewText": "Really greathalfway between quantum physics and AIa good story, good figuresNot mondanePlus les 5 mots qui manquent pour faire plaisir à amazon",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 27, 2022",
                "reviewTitle": "An epic finale that became a battle for the world",
                "reviewText": "Note: reading the last part of a trilogy without knowledge of previous events isn’t a good idea. So I strongly recommend to start at the beginning and read the books in the intended order.ReviewI have to admit that rating the book was rather hard for me. It wasn’t easy getting into the story, because eight years have passed after the enormous battle and the chilling end of „Shorefall“. And the world, the battle and even the opponents have changed so much that they are nearly unrecognizable.Yet the wonderful broken world with its astonishing magic is as awesome as it always was. And even though the POVs changed, too, I liked Berenice, even though I missed Sancia. She has noticeably less pagetime and everything that had happened to her has changed her (well, not her voice as a character, mind you). But yes, there were a great many changes in the setting from the first heist in „Foundryside“ to the battle for the whole world in „Locklands“.And it gets even bigger in the course of the story, when slowly the plans of the incredibly powerful enemy become clear and finally the story of Clef and Crasedes is revealed, as is its connection to the things that happen today.There is action, battles, scheming and some heart-wrenching moments that had me think of Sanderson‘s original „Mistborn“ trilogy. And that made me in the end give five instead of four stars. It may not be what I expected it to be, but it is a fitting and satisfying end to an incredible story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}