{
    "remaining_requests": 176,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Witchs-Lens-Novel-Order-Seven/dp/B0BZ13ZDDN",
    "body": {
        "name": "The Witch's Lens: A Novel (The Order of the Seven Stars, Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Witchs-Lens-Novel-Order-Seven/dp/B0BZ13ZDDN",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51gZXn6AoRL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Luanne G. Smith",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Luanne+G.+Smith"
        },
        "brand": "Luanne G. Smith",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 5426,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "As World War I rages, there are evils—both living and dead—that only a witch can see in a spellbinding novel by the Amazon Charts and Washington Post bestselling author of The Raven Spell.With her husband off fighting at World War I’s eastern front, Petra Kurková embraces her fleeting freedom, roaming the city at night with her camera. A born witch, she’s discovered that she can capture the souls of the dead on film. Her supernatural skills don’t go unnoticed by the enigmatic Josef Svoboda. He’s recruiting a team of sorcerers to infiltrate the front lines, where the bloodshed of combat has resurrected foul creatures. Petra’s unique abilities will be needed against the most dangerous enemies of all—those ever present, undead, and unseen.Deep in the cursed Carpathian Mountains, the ragtag team meets with an emissary of an ancient organization founded to maintain balance between worlds. Photographing the escalating horrors is beyond anything Petra imagined. So are the secrets among her fellow witches. But Petra can’t turn back. Not before she discovers her husband’s fate and the myriad ways her magic is manifesting. To defeat an occult foe, Petra must release the power she’s been concealing for so long, or risk damning a war-torn world to ashes. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Horror",
                "link": "https://www.amazon.com/Horror-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=49"
            },
            {
                "name": "Dark Fantasy",
                "link": "https://www.amazon.com/Dark-Fantasy-Horror-Fiction-Books/b/ref=dp_bc_aui_C_5?ie=UTF8&node=9803"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "8 hours and 41 minutes"
            },
            {
                "name": "Author",
                "value": "Luanne G. Smith"
            },
            {
                "name": "Narrator",
                "value": "Gail Shalan"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "October 01, 2023"
            },
            {
                "name": "Publisher",
                "value": "Brilliance Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BZ13ZDDN"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#213 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Historical Fantasy (Books) #1 in Historical Fantasy (Audible Books & Originals) #2 in Gothic Horror Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "5kidsrunningcrazy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFE5JMYTW5XDAC7SAZ23LYLI3NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GQNWH8HL630?ASIN=B0BZ13ZDDN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Thoroughly enjoyed",
                "reviewText": "This was a great adventure/mystery/historical fantasy with a dash of horror and romance. I liked Petra's strength and resolve in doing what's right and following the path fate had put her on. We often try so hard to fight the inevitable. She shows us that putting your strength into pushing forward instead of pulling back can make all the difference. I want to know more about Joseph and I hope we'll get to know him and the other survivors more in the next books.I liked the Jinni and wish I could have had more time to get to know him and Frau Konig and their stories. There were so many elements that were interesting and different than other stories I've read, but seemed to fit well into the WWI-esque war scene.I will admit I was a little glad when a couple of the people died so it wasn't so hard to keep track of who was who. There are a LOT of men with names I'm not used to and it makes it hard to keep everyone separate.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beth S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQVQVG234TA4M7AGV76LF3LPKRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRHDR8K4SG3XB?ASIN=B0BZ13ZDDN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "4.0 out of 5 stars Good Read",
                "reviewText": "Good Read.There was creative ways magic was being used, along with how its users were perceived in the world. The undead weren’t the typical kind which was refreshing. The book also had an overall eastern European style to it make it feel unique and different from other stories. This was the first book I have read in a while that left me wanting more.ReviewThe book does a great job of creating a world where its known people are able to use magic. Also, certain magic abilities have a lore among the average person and magic users. The book explores what life would be like for a magic user during a world war.All of the characters work well in the book allowing for conflict, love, and laughter to be easier brought out during their interaction with each other. The fact that people who can through fireballs can still get scared or struggle with spells during stressful time made it easy to worry for them during challenging times. However, the are many characters but yet they were all easily remember because they were all unique enough to stand out.The story is well paced and provided plenty of high and low moments. There are a few twists that keeps the reader on their toes while adding just a hint of romance that makes the reader wonder. The plot had many layers that did a good job building off each other.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5MKE4LIB4ZDANPFXIZHJYGQRYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NHKUYFF9HM67?ASIN=B0BZ13ZDDN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "3.0 out of 5 stars An Okay Read",
                "reviewText": "I’ve read the Vine Witch Trilogy and was interested in Luanne Smith’s new series, A Witch’s Lens. It was slow to start and I would say that the story became interesting in the final 7-8 chapters. It’s set in wartime Russia and a secret organization has recruited a small group of witches in an attempt to stop a growing band of fallen soldiers who have been turned into “upíri” or zombies. The characters, other than Petra, were not very well developed and any of them could have been killed off at any given moment without leaving a void in the story. I’m glad I stuck with it and finished this first in the series, but won’t bother reading the rest. As always, this is only one person’s opinion and another reader may love it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOUFK7H2KPQ5OXRFUWHG4B3N5JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIUWPGNHKNUCU?ASIN=B0BZ13ZDDN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Combination of History and Paranormal",
                "reviewText": "Petra Kurková has an unusual ability. Through her camera’s lens, she can capture images of souls on film, identifying presences that would not otherwise be seen. That was all I needed to know about The Witch’s Lens to convince me to read this book.Petra was born a witch and her unique talent attracts the attention of a man recruiting for the battle at the front. Josef Svoboda forms a team of sorcerers to be combatants in a secret society that is fighting a paranormal war that rages alongside the mundane conflict.Petra’s husband left for the war long ago and she does not even know if he is alive or dead. So, with nothing to keep her at home, Petra joins the team. At first the team doesn’t really know what they can do. But the dangers of the human war combined with the supernatural attacks inspire the team to action. As the story unfolds, the reader learns more about the talents of the team and of Petra, who is more than a mere photographer. I appreciated that there was no information dump of the team and the secret society. The readers will learn what is important – when it is important.Petra and Josef are drawn to each other, and while there may be a hint of romance, the focus is pretty much on Petra. Several paranormal players will be added to the story, adding complexity, intrigue, and danger for Petra and her team. This convergence of paranormal players leads to many heroic actions for the team and also provides fodder for future plots in this new series.The more I got into the story, the more imperative it became for me to finish the book. The story never dulls, and even though it takes place during war, it is not without some happier moments and hope. One of the nice things about this book is the price – $4.99. If you think the combination of history and the paranormal sounds intriguing, I recommend The Witch’s Lens.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUB4C5WRRWGDZEVS5M3DYEO5XDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6IB9UYBBXB6M?ASIN=B0BZ13ZDDN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "4.0 out of 5 stars good",
                "reviewText": "This story was not exactly what I expected. I did like all of the characters in this book, especially the main character. She had some very interesting witch abilities. Not only were the characters in this story forced to fight a war that they didn’t want to have anything to do with, but they also faced some very interesting things in the war. They also became decent friends I like the way the book ended. I will definitely read the next book in this series.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NJ Marshmelo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX53RFLTQMNURR4EQEQPTLOGS4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZYTNLX16HHJG?ASIN=B0BZ13ZDDN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Another wonderful story by Luanne Smith",
                "reviewText": "As always in Luanne Smith's books, the characters are so easy to care about. The backdrops are detailed and places we feel we have visited. The suspense is very real and the descriptions so beautiful, turns of phrase that are art themselves. I like this author so much and am always looking forward to her next book. I also have to say that her alluding to characters from previous books is very satisfying as it creates a whole world of people and places that give us an anchor, maybe a map, in this place and time that she has created. Not necessary but fun.My favorite open of any book or all time, is still The Vine Witch",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shelagh Howell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 2, 2024",
                "reviewTitle": "loved the rich story and characters",
                "reviewText": "Wish it kept going❤️ I thoroughly enjoyed the story and characters. I look forward to reading the next book. So exciting.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "suzys124",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 18, 2024",
                "reviewTitle": "The Witches Lens",
                "reviewText": "I enjoyed this book I enjoyed it that much I pre-ordered the next one which isn’t out till May. I wasn’t sure what it was at first but soon got into it. Loved it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Evelyn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 28, 2023",
                "reviewTitle": "A good read",
                "reviewText": "Kept me enthralled and wanting more, I was sad to finish but am waiting somewhat impatiently for the next in the series…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 12, 2023",
                "reviewTitle": "Good read",
                "reviewText": "A different sort of book that I usually read. Enjoyed it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charlene MacLeod",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 26, 2023",
                "reviewTitle": "Interesting read",
                "reviewText": "Interesting characters and interesting times, weaving in superstition and old wives tales, or stories told by parents to scare their kids. Held my attention to finish the book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}