{
    "remaining_requests": 211,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Forged-Blood-Novel-Tainted-Duology/dp/0063112620",
    "body": {
        "name": "Forged by Blood: A Novel (The Tainted Blood Duology, 1)",
        "price": "$15.00 $7.50",
        "originalPrice": "$30.00",
        "rawPrice": 15.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Forged-Blood-Novel-Tainted-Duology/dp/0063112620",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81JaTZ6WYEL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ehigbor Okosun",
            "link": "https://www.amazon.com/Ehigbor-Okosun/e/B0CBMV327K/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by HPB-Ruby.",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 76,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Okosun’s elaborate worldbuilding is lavishly detailed and meticulously constructed, but it never feels overwhelming. The result is an impressive and refreshingly original page-turner that will leave readers eagerly awaiting the second volume.\" — Publishers Weekly (starred review)“Ehigbor Okosun has called on the winds of worldbuilding and the gales of great writing to create a tempest of a novel. Forged by Blood is an enchanting tale of sacrifice and power. Found family, mated love and unexpected twists only add to its depth of heart.” — Saara El-Arifi, bestselling author of The Final Strife“Forged by Blood is a searing and thrilling fantasy, steeped in mythology and magic. Ehigbor Okosun weaves a gripping tale of power, sacrifice, and love—entwined in a captivating and intricate world.” — Sue Lynn Tan, bestselling author of Daughter of the Moon Goddess\"Forged by Blood is an intense, spellbinding debut from a vivid new storyteller. Ehigbor Okosun's lyrical prose effortlessly loops readers into a breathtaking adventure that keeps you on your toes and is set in a land as suffused with wonder as it is with heartbreak. Featuring a striking cast of characters with unbeatable chemistry, an inventive magic system, and rich, folkloric worldbuilding, Forged by Blood confronts history and captures the imagination with a gripping tale of tangled love, political intrigue, ancestral pain, and things worth fighting for.\" — Thea Guanzon, author of The Hurricane Wars“Dèmi is powerful, strong, and smart, with a kind heart—just the kind of main character readers will celebrate. While fighting the cruel Eingardians, she is also trying to figure out love and life. Add to that the spot-on world building and political complications and fantasy readers will find something to enjoy in this powerful work.” — Booklist (starred review)“Forged by Blood is a spellbinding coming-of-age fantasy that's one of my top reads of the year. It delivers everything a riveting fantasy serves best—mythology, magic, and powerful sociopolitical commentary. Dèmi is a character with a fighting spirit and tons of heart that you can't help but root for as she tackles injustices. Forged by Blood is an epic fantasy debut that'll keep you on the edge of your seat from beginning to end.” — N.E. Davenport, author of The Blood Trials“Forged By Blood is Black Girl Magic at its finest. Okosun offers a million little revolutions tucked into an intimate tale. If you like your fantasy with a dash of Nigerian mythology, look no further. This is a remarkable writer bound to flourish.” — Suyi Davies Okungbowa, author of Son of the Storm“An enchanting tale with a sharp critique on the brutal aftermath of colonization. Ehigbor Okosun weaved a magical story steeped in Nigerian myths and folklore, with characters of fierce conviction who jumped out of the page. Forged by Blood is an exciting debut filled with visually stunning, cinematic scenes, perilous fights of elemental magic, and a romance that kept me turning pages. This book is perfect for readers who long to be immersed in the mythos of a fresh new fantasy world!” — Gabriela Romero Lacruz, author of The Sun and the Void\"Rich, original world-building, found family, and a fast pace just serve to enhance a gripping story about the pain and conflict of revolution and resistance. Okosun is a writer to watch and I can't wait for the next book!\" — Martha Wells, author of The Murderbot Diaries and Witch King About the Author Ehigbor Okosun is an Austin-based author who writes speculative fiction for adult and young adult audiences. A British private school survivor turned Nigerian American immigrant, she hopes to do justice to the myths and traditions she was steeped in, and to honor her large, multiracial, and multiethnic family. She is a graduate of the University of Texas with degrees in Plan II Honors, neurolinguistics, and English, as well as chemistry and premedical studies, and was recently named a Cynthia Leitich Smith Writing Mentor Award finalist. When she’s not reading, you can catch her bullet journaling and baking."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 25 mins",
            "$3.99 delivery February 27 - March 4.",
            "Or fastest delivery February 23 - 28."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A brilliant new voice brings us a brilliant new epic fantasy novel: Ehigbor Okosun’s first book in an action-packed, poignant duology inspired by Nigerian mythology—full of magic and emotion and set in a highly atmospheric, complex world in which a young woman fights to survive a tyrannical society, having everything stripped away from her, and seeks vengeance for her mother’s murder and the spilled blood of her people.In the midst of a tyrannical regime and political invasion, Dèmi just wants to survive: to avoid the suspicion of the nonmagical Ajes who occupy her ancestral homeland of Ife; to escape the King’s brutal genocide of her people—the darker skinned, magic wielding Oluso; and to live peacefully with her secretive mother while learning to control the terrifying blood magic that is her birthright.But when Dèmi’s misplaced trust costs her mother’s life, survival gives way to vengeance. She bides her time until the devious Lord Ekwensi grants her the perfect opportunity—kidnap the Aje prince, Jonas, and bargain with his life to save the remaining Oluso. With the help of her reckless childhood friend Colin, Dèmi succeeds, but discovers that she and Jonas share more than deadly secrets; every moment tangles them further into a forbidden, unmistakable attraction, much to Colin’s—and Dèmi’s—distress.The kidnapping is now a joint mission: to return to the King, help get Lord Ekwensi on the council, and bolster the voice of the Oluso in a system designed to silence them. But the way is dangerous, Dèmi’s magic is growing yet uncertain, and it’s not clear if she can trust the two men at her side.A tale of rebellion and redemption, race and class, love and trust and betrayal, Forged by Blood is epic fantasy at its finest, from an enthusiastic, emerging voice.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Harper Voyager (August 8, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0063112620"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0063112629"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.11 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 1.15 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#102,313 in Books (See Top 100 in Books) #113 in Black & African American Fantasy Fiction (Books) #3,715 in Romantic Fantasy (Books) #5,930 in Epic Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 76 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cae308cd-1aed-465a-a084-316629a3b0c2.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/44038aa0-1cce-42e2-b9c5-7b5cda130851.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e6c6086c-ccb4-4632-8d67-63b8c9a50896.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John M Meyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBBVU7Y5O25DOPMRYX4NV6FF2OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OQOD5SOKOR5Y?ASIN=0063112620",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2023",
                "reviewTitle": "5.0 out of 5 stars brilliant novel offering a first-person perspective on a magical world",
                "reviewText": "I loved the mix of high fantasy and colonialism. Brilliant, challenging writing. The book is written from the perspective of a young magic user. A fully-realized and imagined world with passion and stunning adventure sequences.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPNNQENKQ2W5QQCFW6Q22FEPKWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V51EIT45TTEM?ASIN=0063112620",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Great storytelling!",
                "reviewText": "“Forged by Blood” was Fairyloot’s August adult subscription selection and I am so glad it was! The author, @EhigborOkosun, wrote the epic young adult (YA) fantasy inspired by Nigerian mythology - though no previous knowledge is required to read and enjoy the book, though being familiar with Africa’s geography and cultures will be helpful with the imagery. 🌍 I certainly was left wanting to know more about Nigerian 🇳🇬 mythology though!Dèmi is a complex character, introduced as a child during the most traumatic experience of her life (up to that point), and then after a time jump as a young adult. While much about Dèmi’s family and history is unknown, the story never feels confusing or lost. The characters are likable, relatable, and realistic - none are perfect and all are trying to do the right thing in the best way they can. I enjoyed the found family dynamics and was left wanting to know more about so many of the characters, hoping we get some in the second book of the duology. (Or perhaps some character spin-offs later) The story is full of magic and emotion, love and determination. The book addresses racism and discrimination in ways that do not feel overwhelming but recognizes the delicate and atrocious nature of such human experiences. One of the major themes of the story is staying true to oneself, even when it seems impossible. 🏠 ⚔️ 🧚🏿‍♀️There were a few spots in the story, as well as character dialogue, that I thought should have been addressed more thoroughly. There could have been a bit more complex world building, especially in the magical realms. However, I loved Dèmi’s inner dialogue as she worked through emotions, as well as her compassion and love for others while she was also angry and having to fight for survival. Overall this is easily a 4-star read and a book I will be recommending to others and even purchasing as a gift for friends.⭐️ ⭐️ ⭐️ ⭐️",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Highly Caffeinated Book Reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETFI25FYZ6OU5ZZ77QLGT6NN2CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJMENZPPPLOI0?ASIN=0063112620",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "3.0 out of 5 stars The Beginning of an Epic Tale",
                "reviewText": "**3.5 stars**FORGED BY BLOOD is a complex and carefully crafted fantasy filled with action, rich lore, and emotion. Okosun shines with the eloquence of her prose as the reader begins to understand the world they are entering.What I loved about this particular book is the multiple layers to the story. At the core, it is about a young girl’s struggles and quest to fight for what is right. However, there are also political power plays, discrimination, enslavement, complicated relationships, and a whole system of blood magic. All of these on their own would be compelling, but together, they form a vivid and well-crafted tale.Because this is the first book in a duology, I understand that there is a lot of background needed to set up the players and build the world. And yet, as the reader, there were I wanted more lore and more about the magic. You see it in action, but questions were lingering about all the facets which made things murky at times.FORGED BY BLOOD is a solid beginning to what could possibly be an epic second book. Okosun’s voice is strong with a wonderful balance of heart and action. I am looking forward to seeing what comes in the next book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "N. Egbuonye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE35MT55SEWCVB4W77CHEVSFAPPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH90GZFQLFTAI?ASIN=0063112620",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved it",
                "reviewText": "I loved this book and fell into it like i was watching a movie (being action packed also got me, lol). I felt homesick while reading it and it felt good reading somethings i'm culturally familiar with. Any book with west-African themes and mythology instantly grabs my attention, i want more POC and African books. Loved the creatures and magic system and prose. I will say i'm not a fan of love triangles as i like to know who's heart i'm following and don't like being torn, but it was okay, not a deal breaker at all. Also, Ehigbor's writing is beautiful and a breath of fresh air, i thoroughly enjoyed this book and look forward to the next book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Enola Henderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFLOULEZOQLXF52XHVI4ZLO7SQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7X3WX03ATOAE?ASIN=0063112620",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Whew! Let's get into this review",
                "reviewText": "Whew! Let's get into this review. This was absolutely wonderful. I can't lie I was pissed about the betrayal at the beginning of the book but it made me want to root for her even more. I cried, laughed, cursed, and screamed at my tablet, as she dealt with being betrayed, the twist the turns, and the world-building was done beautifully.I can say that this was more of a Ya fantasy but I still loved it. some feedback I can give the author is that although I loved this book it did feel a little rushed in some parts, I sometimes felt as if something was missing other than that I can't wait to read more from you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vickiec192",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 24, 2023",
                "reviewTitle": "Beautiful, powerful and gripping",
                "reviewText": "This is absolutely stunning. From the world building to the magic system to the imagery to the characters, everything is beautiful.The narrative from Demi regarding the colonisation of her people and the discrimination that she faces are really powerful. The raw emotion behind her words, towards the treatment she receives, from her 9 year old perspective in particular, is so striking. There is no way that you could not be moved by it. The way this affects her perception and treatment of Jonas is really interesting. The theme of friendship and family, and how that looks, is strong throughout.The slow burn romance smoulders away throughout.The plot is strong and so captivating. One of the most beautiful books I've read in a long time. I am absolutely in love with this book, there is nothing that doesn't work.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}