{
    "remaining_requests": 270,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Darkly-She-Goes-Hubert/dp/1681123134",
    "body": {
        "name": "Darkly She Goes",
        "price": "$25.99 $17.95",
        "originalPrice": "$29.99",
        "rawPrice": 25.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Darkly-She-Goes-Hubert/dp/1681123134",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/714vAWyDP6L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Hubert",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Hubert&text=Hubert&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by HPB-Ruby.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 7,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Starred review! Darkly She Goes is an exciting, engaging, and emotional grand graphic novel fantasy about self-discovery, romance, and redemption.\" —Foreword Reviews.\"Darkly She Goes is an exciting, engaging, and emotional grand graphic novel fantasy about self-discovery, romance, and redemption.\"—Foreword Reviews\"Both romance and adult fairy tale, Hubert provides believable reactions in what’s a heady emotional brew with ambition and deception as undercurrents. It’s admirably unsentimental, and Game of Thrones fans ought to love Darkly She Goes.\"—The Slings and Arrows\"Darkly She Goes is a riveting ode to redemption that pits free will against fate, and brought vividly and memorably to life by the collaboration of two true masters of the fantasy genre.\"—Midwest Book Review\"Alluring and mournful fable...Sublime fine line artwork by Mallié...Ardor burns bright but lights up past wounds in this elegant outing.\"—Publishers Weekly\"The Princess and the Knight are in love and in the end that is all that truly matters.\"—First Comics News\"A story of love, revenge, family strife, lust and power...There are no heroes or villains but larger than life characters with great flaws which lead to inevitable tragedy.\"—SFcrowsnest About the Author Hubert was born in 1971 in Saint Renan and studied graphic arts in Angers where he was led into the wondrous world of comics. He started at first making a reputation for himself as a colorist but soon turned to scriptwriting where he established himself as a leading voice in graphic novels for an adult audience. Hubert thus spoke of anorexia, gender, or even homosexuality in tales and stories that have become as essential as Miss Pas Touche or Beauty (both from NBM), drawn by the duo Kerascoët. He passed away, too early, in 2020. Vincent Mallié was born in Paris in 1973. He graduated in graphic arts in Paris. Since 1998 he has been a comic artist collaborating with many top French authors in the field and working on a number of bestselling novels and series. Renowned for the aesthetics of his semi-realistic line, the efficiency of his layouts and his gift for fabulous natural compositions, Vincent Mallié started collaborating with the late Hubert (Beauty, Miss Don’t Touch Me) on Darkly She Goes, which gave him the opportunity to offer an epic and seductive drawing, in a feminist tale as powerful as it is striking."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 2 hrs 33 mins",
            "$3.99 delivery February 26 - 27."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Once upon a time there was a fallen knight, who believed that saving a princess would allow him to atone for his crimes. Once upon a time there was a dark princess, who believed that it was up to her to atone for the crimes of her parents... Banished for a fault that forever taints his reputation, Arzhur wanders from tavern to field of battle in search of the next contract which will fill his purse. One night, three mysterious old women offer him to regain honor and fortune if he frees the daughter of a neighboring king, held captive in the ruins of an abandoned castle. But Islen is not the damsel in distress that he expected to save... Magnified by the virtuoso art of Vincent Mallié, under Hubert’s pen, the weight of family legacy takes the form of a stirring fairytale about facing inner demons. Darkly She Goes is an ode to redemption that pits free will against fate, brought to life by two masters of the fantasy genre.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ NBM Publishing (July 4, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 160 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1681123134"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1681123134"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.9 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 9 x 0.6 x 12 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#122,404 in Books (See Top 100 in Books) #159 in Literary Graphic Novels (Books) #542 in Fantasy Graphic Novels (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 7 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TheMogget",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD7J3GGZ3GGSDZNYEBUSW6ZZNMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QYO57YRY85RM?ASIN=1681123134",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Maidens, Mothers, and Magic",
                "reviewText": "+Art+Story+EverythingThis dark and gritty tale, while fairytale and short is not for kids. It is of a subgenre I call Maidens, Mothers, and Magic which is the female version of a Sword and Sorcery tale. Fantasy that is dark, serious, and uncut. This isn't a graphic debauchery though, it is a poetic and meaningful tale with a beautiful reversal of roles as well as love, betrayal, and dark magic. What's not to like?Oh and the art is amazing. The ephemeral monsters are almost as elegant as the crown of living butterflies.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher Lee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 7, 2023",
                "reviewTitle": "Wonderful!",
                "reviewText": "A fantastic comic with outstanding penmanship, pacing, and composition throughout.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$20.43",
                "sellerName": "TheWorldShopUSA",
                "sellerRating": "4.5"
            },
            {
                "price": "$21.46",
                "sellerName": "indoobestsellers",
                "sellerRating": "4.5"
            },
            {
                "price": "$21.99",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            }
        ]
    }
}