{
    "remaining_requests": 405,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Broken-Earth-Trilogy-Season-Obelisk/dp/031652719X",
    "body": {
        "name": "The Broken Earth Trilogy: The Fifth Season, The Obelisk Gate, The Stone Sky",
        "price": "$27.49$27.49",
        "originalPrice": "",
        "rawPrice": 27.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Broken-Earth-Trilogy-Season-Obelisk/dp/031652719X",
        "soldBy": {
            "sellerID": "A2WSPQVFF10DOJ",
            "name": "Half Price Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2WSPQVFF10DOJ"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51fskalrABL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51B4g9iYJcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51eEPZ0nZ3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jElRDmwJL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "N. K. Jemisin",
            "link": "https://www.amazon.com/N-K-Jemisin/e/B0028OIVC0/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Half Price Books Inc",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 2528,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs 56 mins",
            "$3.99 delivery February 27 - 28.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 14 hrs 56 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Orbit (August 4, 2015)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 1424 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 031652719X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0316527194"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.8 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.63 x 4 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,054 in Books (See Top 100 in Books) #118 in Dystopian Fiction (Books) #338 in Fantasy Action & Adventure #601 in Epic Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 2,528 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Matt DeFrancis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWJCEM45JF75EHCXD277L7IH6YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SVDOYSRWGX79?ASIN=031652719X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 10, 2022",
                "reviewTitle": "5.0 out of 5 stars It really will exceed expectations if you give it the chance.",
                "reviewText": "Alright, so, I got this trilogy on audible about a year ago on a crazy sale. I believe each title in the trilogy cost about 4usd at the time. AND each of them had the HUGO, so I figured, even if I don't get to them now, they should absolutely be worthy of the purchase. I just recently picked up the physical to add to my favorites collection alongside the Space Odyssey series, the Hyperion/Endymion series, The Rama series, The Scythe series, Imajica ect. I tend to do this, Ill buy audiobooks, and when they sufficiently please me I must own the physicals. Typically I tend to lean more towards the Sci-fi genre over fantasy, but I do enjoy a good fantasy. Though I do lean towards the darker side of this, with things like Weaveworld, Imajica, the Art trilogy, so this was a bit outside of my typical.I will start by saying, when I first started The Fifth Season, I got about 1.5 to 2 hours into it, and, surprisingly, hated it. Well, I'm not sure hate is the right word, but I was very much unimpressed and put this series on my back burner for over a year.About a month ago I pretty much dried up my library in audible, so I decided to give this series another chance. I mean, it couldn't have won all this praise for nothing right? What a good call.Once I got past that initial hump in the beginning, I couldn't stop. I cleared the first title in literally 4 days at work. I was in.I wont go into any spoilers or try and describe what happens in the books, as it would, 1. ruin it for you, and 2. not be able to do justice enough to it to justify point 1.At the end of book 1 I waited exactly zero minutes to start 2. Loved every second of it. And again, zero minute cool down between book 2 end and starting 3. Book 3 answers just about every question the series leaves you asking. I couldn't be more satisfied.I will say, from some of the negative reviews, I can understand where a lot of them are coming from. ESPECIALLY if you didn't give the series a chance, read the first 50 pages and decided you hated it. I was right there with you. But trust me, its so much more than they gave it credit for. I can understand where some might read into the \"agenda\" that the author is trying to \"push\" as overly aggressive with the racial overtones, and the powerful female protagonist aspects being heavy handed. I get why at face value it would seem like something you'd roll your eyes at. BUT, its not that at all. I am a 32 year old heterosexual white male and BOY if you can get over that initial feeling of some kind of PC propaganda, you'll see that these parts of the story are anything but superficial and are so integral to the story that no matter how much you might want to roll your eyes at first, YOU'LL GET OVER IT. And it rewards your time with such a deep story and amazing characters you'll be mad at yourself for being so quick to judge it as something its not.I will say, hands down, this will be in my top 5 for book series for decades to come. I cant even imagine the possibility of something coming along anytime soon that would surpass this for me. I was so anxious to learn more and see into the past with this series. I listened at work. I listened at the gym. I listened at home cooking dinner. This series is a 10/10 and you owe it to yourself to get lost in this world.",
                "reviewVotes": "66 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gtcharlie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2FXROSYJBR7FHEAVY7GAIVA27A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LVEWIKJM0OLW?ASIN=031652719X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent series",
                "reviewText": "Christmas gift for my son that I ended up taking as well!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Holly L. Harper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDCHE7PQYW7FHGZTH4ZFTHKN3IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31QL5JQ79PTPU?ASIN=031652719X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars not what you expect!",
                "reviewText": "I was inordinately pleased with this series, and I gave it to several people for Christmas! If you like your fantasy raw, read it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark Gunther",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERYFELXXRJCM5CLNQZQU7SXICKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QD8VQPKENXI4?ASIN=031652719X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2020",
                "reviewTitle": "5.0 out of 5 stars A potent world of invented science and palpable magic",
                "reviewText": "When I was about six, my reading obsession began with hard sci-fi. Tom Swift Jr and Mike Mars let to Asimov, Pohl, Dick, Heinlein, Clarke and a host of others. Fantasy was never really a thing, although [book:The Lord of the Rings|33] got me through middle school. But I fully engaged with <i>The Broken Earth</i> trilogy and its potent world of invented science and palpable magic, of four races of humans living on a conscious and somewhat malevolent earth. Earth’s malignant, seismically driven ‘Seasons’ are ash or wind or heat or earthquake or volcano or tsunami, over and over, with the Fifth Season often wiping out the civilization of the time along with most of its inhabitants. This pattern has been repeated for forty thousand years. How humans associate and evolve and behave in this unforgiving world lets Jemisin explore love, anger, generational resentment, oppression, racism, motherhood, parricide, duty and destiny. Human suffering is painful, real and repeated. Grief is woven into the character’s choices. The earth and its inhabitants are misanthropically bound together; the novels eventually explain why and offer a possibility of changing the outcome.Jemisin is interested in the moral quandaries that arise in her protagonists from having vast power, painfully conflicting duties and impulses, and having to then live with the consequences of any resulting decisions. She doesn’t baby her characters, always giving them greater challenges to overcome despair the burden of ever greater handicaps. Essun and Nassun are orogenes, a race of humans able to reach into the earth and control/manage seismic events. Orogenes are feared and hated by the mass of society, disowned or even killed by their families despite the fact that their skills are necessary for civilization to exist. A race of long-lived Guardians takes orogenic children to raise in a central location, in a way protecting them but controlling them with ruthless methods. The Stills, normal people, do their best to survive when they aren’t resenting orogenes or dying from seismic disruption. The mysterious stone eaters follow an agenda of their own. The tensions between all these races playing against the backdrop of the disintegrating earth give the plot plenty of momentum.Essun is all too human. She seeks love and connection, but being an orogene can require actions that have horrible consequences. She suffers unimaginably before she finds a purpose worthy of all her sacrifice. Her ten-year-old daughter Nassun, from whom she is separated for much of the story, just wants to feel safe, yet is faced with the same quandary as her mother. How each navigates their interlocking hero’s journeys kjeepts the story moving while illuminating Jemisin’s questions.Most of the trilogy is narrated in close third and alternates between Essun’s and Nassun’s points of view, though there are interludes of a first person narrator speaking in the second person. This adds to the unsettling quality, as we can only surmise who the narrator and the “you” are until fairly late in the tale. This is disquieting but feels mimetic of the shaky state of the Broken Earth. Many chapters end with historical asides that illuminate and provide greater context for the current action. Again, though, this tale is driven by character more than plot, and the empathy I developed for each of the characters was both surprising and salutary. A great read and fully deserving of all its accolades.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris Neville",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESHL2PQT7RWYENNCWE2AAEMRF4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31POBJV381D1B?ASIN=031652719X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2022",
                "reviewTitle": "4.0 out of 5 stars Rock Hard Fantasy",
                "reviewText": "Great fantasy reading that keeps you interested till the end of the 3rd. book. It does take some concentration to keep up with the characters and what the characters change into. Does have the tree/rock/nature above all else attitude in the writing, but just like EV's that is where all is headed.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Toronto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 27, 2023",
                "reviewTitle": "Love this trilogy",
                "reviewText": "Can't wait to finish it and read more of her work.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcio Paiva Reis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 4, 2022",
                "reviewTitle": "Melhor livro que li nos últimos anos",
                "reviewText": "Leio bastante syfy (pelo 6-8 por ano), normalmente premiados (Hugo e Nebula), e mesmo assim esses livros foram os melhores que li nos últimos 5 anos!Personagens profundos e envolventes, história empolgante e cheia de emoções a cada passo.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 7, 2019",
                "reviewTitle": "WOW",
                "reviewText": "amé",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NICO MOLINARIO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 16, 2020",
                "reviewTitle": "As described",
                "reviewText": "Great books",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mikael Lofjärd",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 12, 2020",
                "reviewTitle": "Amazing",
                "reviewText": "These books had me hooked from the first line to the last. A beautiful, tragic and greatly paced story in a universe full of mankind's best and worst.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}