{
    "remaining_requests": 373,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Court-Mist-Fury-Thorns-Roses-ebook/dp/B015FELXQ0",
    "body": {
        "name": "A Court of Mist and Fury (A Court of Thorns and Roses Book 2)",
        "price": "$8.21",
        "originalPrice": "",
        "rawPrice": 8.21,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Court-Mist-Fury-Thorns-Roses-ebook/dp/B015FELXQ0",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81X7G446iEL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sarah J. Maas",
            "link": "https://www.amazon.com/Sarah-J-Maas/e/B0070291GK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 156156,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B015FELXQ0"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bloomsbury Publishing; 1st edition (May 3, 2016)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 3, 2016"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 9922 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 641 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#32 in Kindle Store (See Top 100 in Kindle Store) #4 in Paranormal Romance (Books) #5 in Romantic Fantasy (Kindle Store) #5 in Fantasy Romance eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 156,156 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/cc3fa32e-fe9d-445d-ae27-45c0102a75af.__CR0,0,540,540_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/76af809c-c3a4-4c74-83be-d3b3f6802776.__CR0,0,540,540_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/944ff603-cf32-4386-9cda-43a0a1fd74f1.__CR0,0,540,540_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Taylor Hathcock",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXD54YEQIKR44DIVIDEPMEIEINQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U6690NOTNEAO?ASIN=B015FELXQ0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars One of those books I wish I could read again for the first time",
                "reviewText": "“To the stars who listen—and the dreams that are answered.”I think ACOTAR is the perfect first book but I think ACOMAF is probably the best book in the series. It is my absolute favorite for so many reasons. Maas does this amazing job of showcasing just how much Under the Mountain impacted Feyre. We have her clearly struggling with some serious PTSD... and Tamlin... well.. per the norm is oblivious. Ianthe, a new character, and a Priestess becomes an annoyance. Lucien... well he seems less like a friend and more like Tamlin's lackey. I think it's all these things... and watching Feyre beg to be let in and be a part of things that just makes you hate all of them.However, it's okay because all of this causes Rhys to enter the narrative in the most dramatic way humanly possible. We then get her visits which are a requirement of the bargain she made. Rhys begins to show us a side we didn't get before and quickly works his way into the reader's heart. Especially with the stark contrast to Tamlin in this one. We get the back and forth between Night Court and Spring Court, a dramatic shift for Feyre, and then an intense narrative. One in which romance is important, but like now we have the threat of war from Hybern.I adore this book because I think it has amazing character development and even shows us parts of characters we were blind to before. Feyre slowly goes from this broken creature to this powerful Fae. It's a beautiful transition to watch happen. Not to mention the found family vibes in this one. I think Rhys has a court which works so well together and one in which Feyre easily fits in. I have to say the Night Court is probably my favorite part of this story. Even as a reread this book had me in my feels. It turns out it was almost like reading it again for the first time.Maas really knows how to play on the emotions and she has the uncanny ability to hold it all until the end. I think this one is probably one of my favorites though because we get a lot of big reveals throughout and then the end is just this masterpiece where you are constantly ready to scream, cry, laugh and throw things. I think this one is high on my list of books I wish I could read for the first time again. I think it has all the elements you want in a romantasy.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yami's Bookshelf",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGB452UIHCYNIKO5FQI3F5IWKN4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DWW68A8SPFHX?ASIN=B015FELXQ0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Mesmerizing and Phenomenal Second Book",
                "reviewText": "\"A Court of Mist and Fury\" by Sarah J. Maas is an absolute triumph in the world of fantasy literature. The book picks up where its predecessor left off, with Feyre grappling with the aftermath of her harrowing trials and the dark deeds she committed to save Tamlin's people. The story explores the conflict between her newfound High Fae powers and her enduring human heart, and the weight of her bargain with Rhysand, the enigmatic High Lord of the Night Court.This sequel is a rollercoaster of emotions and a masterclass in character development. Building upon the foundations laid in \"A Court of Thorns and Roses,\" this second installment takes readers on a breathtaking journey of self-discovery, power, and love. Feyre's growth is nothing short of remarkable as she navigates the intricate web of politics, passion, and power in the Night Court. The tension in the story is palpable, and the book keeps you turning the pages in anticipation of those sweet moments and unexpected twists.What sets \"A Court of Mist and Fury\" apart is its ability to build deep connections between readers and the characters. The world-building in this book is exceptional, immersing you in a richly crafted universe. And of course, the romance is nothing short of spellbinding. Unlike the first book, everything in this sequel flows seamlessly, drawing you further into the intricate relationships and conflicts.\"A Court of Mist and Fury\" by Sarah J. Maas has garnered a devoted following, and it's easy to see why. It is a must-read for anyone who craves a compelling blend of magic, passion, and unforgettable characters.The tension in the story is not just good; it's masterfully crafted to keep readers on the edge of their seats, yearning for those sweet moments and unexpected revelations. The plot delivers a tantalizing mix of both surprising and predictable twists, ensuring that every chapter feels like an exciting adventure.What truly sets this book apart is the remarkable character development. Feyre's transformation is a triumph, and it's impossible not to feel deeply connected to her and the entire cast of characters. The relationships that evolve throughout the story feel authentic and are filled with depth, a stark contrast to the first book in the series.In addition to what's already been highlighted, the emotional depth of \"A Court of Mist and Fury\" is astounding. The trauma, the power struggles, and the heartbreak that the characters endure are explored with raw authenticity. This resonates deeply with readers, making the story not just about fantasy but about human experiences.Furthermore, the world-building is exceptionally vivid, transporting you to a realm filled with magic, beauty, and danger. It's a testament to Sarah J. Maas' storytelling prowess that she can make this fictional world feel so tangible and immersive.And, of course, the romance is nothing short of breathtaking. It's not merely a plot device but a central element that enriches the characters and their journeys. The chemistry between Feyre and Rhysand is electric, drawing readers into their complex and passionate relationship.In conclusion, \"A Court of Mist and Fury\" is a fantasy masterpiece that turns even the most skeptical readers into ardent fans of the genre. With a gripping plot, unforgettable characters, and a world so well-crafted it feels real, it's no wonder this book has become a cherished favorite for many. Sarah J. Maas has not only expanded the world of Feyre but also enchanted the hearts of countless readers with this stunning sequel. This book is a true gem, and it's bound to leave a lasting impression on your heart and mind.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adri lagunesAdri lagunes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 10, 2023",
                "reviewTitle": "Buen libro",
                "reviewText": "El libro es muy bueno, a mi parecer es de lo mejor que ha escrito SJM lo malo es que me llego maltratado",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61neQitnGFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-aAF3-eCL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TinyVenus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 1, 2023",
                "reviewTitle": "Amazing",
                "reviewText": "**Resume: \"A Court of Mist and Fury\" by Sarah J. Maas****Title:** A Court of Mist and Fury**Author:** Sarah J. Maas**Rating:** ⭐️⭐️⭐️⭐️⭐️ (5/5 stars)**Review:**\"A Court of Mist and Fury\" by Sarah J. Maas is a stunning masterpiece that captivates from the very first page, earning it a well-deserved five-star rating. This enchanting sequel takes readers on an emotional roller coaster, making it an unforgettable journey through the realms of fantasy and romance.From the outset, the novel proves to be a genuine page-turner, weaving a tale of love, sacrifice, and self-discovery. The author's vivid and imaginative prose draws readers into the intricate world of the Fae, where every twist and turn is expertly crafted. The character development is phenomenal, with each protagonist evolving in ways that will both surprise and resonate deeply with the reader.What sets \"A Court of Mist and Fury\" apart is its ability to evoke a wide range of emotions. It's not merely a story; it's an immersive experience that will make you laugh, gasp, and, most notably, ugly cry your heart out. Maas masterfully navigates the complexities of love and loss, tearing down emotional barriers and leaving the reader emotionally shredded.The depth of the relationships portrayed in the novel is unparalleled. The romantic elements are both passionate and tender, adding a layer of intensity to the narrative. The complexities of the characters' feelings are explored with such nuance that it feels as though you are experiencing the emotions alongside them.As the story unfolds, it becomes evident that \"A Court of Mist and Fury\" is not just a sequel but a transformative journey for both the characters and the reader. It challenges conventional norms, defying expectations and leaving a lasting impact. The world-building remains rich and immersive, expanding the boundaries of the already captivating universe introduced in the first installment.With a compelling narrative, well-developed characters, and an emotional depth that is both heartbreaking and uplifting, \"A Court of Mist and Fury\" is a triumph in the fantasy genre. Sarah J. Maas has proven once again why she is a powerhouse in storytelling, and this book is a testament to her ability to create worlds that resonate long after the last page is turned.In conclusion, if you're a fan of fantasy, romance, and emotionally charged storytelling, \"A Court of Mist and Fury\" is a must-read. Be prepared for a journey that will grip your heart and soul, leaving you eagerly anticipating the next installment in this spellbinding series.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janaína",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 25, 2023",
                "reviewTitle": "A Mesmerizing Journey into the Realm of A Court of Thorns and Roses",
                "reviewText": "I recently embarked on a literary adventure like no other, and it left me utterly spellbound. Sarah J. Maas' \"A Court of Thorns and Roses,\" Book 1 of the series, has taken me on an unforgettable journey into a world where fantasy and reality collide in the most breathtaking way possible.From the very first page, I was drawn into the enchanting realm of Prythian. Maas's vivid and immersive storytelling transported me to a place where magic, danger, and romance intertwine seamlessly. Her world-building is nothing short of awe-inspiring, with each court, be it Spring, Summer, Autumn, Winter, or the deadly Night Court, brought to life with meticulous detail and captivating lore.The characters in this book are nothing short of brilliant. Feyre, our fearless and resourceful protagonist, is a character you can't help but root for. She's a hunter, a survivor, and her transformation throughout the story is both empowering and heart-wrenching. And then there's the enigmatic High Lord of the Night Court, Rhysand, whose charisma and complexity make him one of the most intriguing male leads I've ever encountered in fantasy literature. The relationships, the alliances, and the betrayals that unfold are as compelling as they are unpredictable.The plot itself is a rollercoaster of emotions and surprises. It seamlessly weaves together elements of romance, action, and mystery, keeping you on the edge of your seat from start to finish. The twists and turns will leave you breathless, and the romance that blooms amid the chaos is nothing short of epic.What truly sets \"A Court of Thorns and Roses\" apart is its exploration of themes such as love, sacrifice, and the blurry line between good and evil. Maas delves deep into the hearts of her characters, making you feel every joy and sorrow right along with them. It's a tale that lingers in your mind long after you've turned the final page.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 5, 2024",
                "reviewTitle": "Loved it",
                "reviewText": "It was a rollercoaster but it was great I recommend 😌❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnonimoAnonimo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 4, 2024",
                "reviewTitle": "10/10",
                "reviewText": "Merece cien por cien la pena la tapa dura, es preciosa y por 20 euros está genial, es un libro de 600 páginas y otros están más caros con tapa blanda y son mas pequeños. Además de que la saga es una pasada, engancha muchísimo y están super bien desarrollados.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71rg0MGV1vL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61OAuic9lML.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}