{
    "remaining_requests": 137,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Servant-Crown-Heir-Book-ebook/dp/B076QLKDM5",
    "body": {
        "name": "Servant of the Crown: An Epic Fantasy Novel (Heir to the Crown Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Servant-Crown-Heir-Book-ebook/dp/B076QLKDM5",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81EcKNQaUxL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Paul J Bennett",
            "link": "https://www.amazon.com/Paul-J-Bennett/e/B076VWXM22/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1986,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An old warrior, too stubborn to die. A royal heir, hidden since birth.Can they save a realm on the brink of war?Tragedy tears Gerald's world apart and only his unwavering loyalty saves him. After serving as a soldier for years, a single act of self-sacrifice thrusts his future into the world of politics.Cut off from all he knows, he becomes no more than a pawn to those in command. Banished with little more than the clothes on his back, he seeks a new purpose, for what is a warrior who has nothing left to fight for?A fateful meeting with another lost soul unmasks a shocking secret, compelling him to take up the mantle of guardian. Bandits, the Black Hand, and even the king, he battles them all for the future of the realm.Memories of the past, secrets that shape the future; his adventure is only the beginning.Servant of the Crown is the series starter in the epic Heir to the Crown medieval fantasy series. If you like realistic fight scenes, compelling characters, and a gripping story, then you will love Paul J Bennett's tale of a warrior who refuses to retreat.Pick up your copy of Servant of the Crown, and discover the realm of Merceria today!Books by Paul J BennettHeir to the Crown Series:Battle at the River - PrequelServant of the CrownSword of the CrownMercerian Tales: Stories of the PastHeart of the CrownShadow of the CrownMercerian Tales: The Call of MagicFate of the CrownBurden of the CrownMercerian Tales: The Making of a ManDefender of the CrownFury of the CrownMercerian Tales: Honour Thy AncestorsWar of the CrownTriumph of the CrownMercerian Tales: Into the ForgeGuardian of the CrownThe Frozen Flame Series:Awakening - PrequelsAshesEmbersFlamesInfernoMaelstromVortexPower Ascending Series:Tempered Steel - PrequelTemple KnightWarrior KnightTemple CaptainWarrior LordTemple CommanderThe Chronicles of Cyric:Into the Maelstrom - PrequelA Midwinter MurderThe Beast of BrunhausenA Plague in ZeiderbruchWhat readers are saying about Paul J Bennett’s books:★★★★★ -\"Fantastic Fantasy!\"★★★★★ -\"Epic Battle Scenes!★★★★★ -\"I’m hooked on this series!\"★★★★★ -\"Exciting Sword and Sorcery\"★★★★★ -\"Fabulously written, loved it.\"★★★★★ -\"Outstanding work of fantasy\"★★★★★ -\"The most amazing adventure\"★★★★★ -\"Another excellent book series!!\"★★★★★ -\"I just could not stop reading them\"★★★★★ -\"Wow! Best book I’ve read in a LONG time!\"★★★★★-\"Thoroughly absorbing, exciting and mystical.\"★★★★★ -\"If you like fantasy fiction, then this is a must-read!\"★★★★★ -\"This story gripped me and kept me turning the pages.\"★★★★★ -\"Action, Intrigue, Adventure, Romance and some twists!\"★★★★★ -\"I love the book, had me on edge, could not put it down!\"★★★★★ -\"Full of suspense, intrigue and action throughout the story\"★★★★★ -\"The characters you love in the books come to life in such a fabulous way.\"★★★★★ -\"The tale flows effortlessly along, blending action, adventure and heartwarming scenes.\" Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Humor & Entertainment",
                "link": "https://www.amazon.com/Humor-Entertainment-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=156279011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B076QLKDM5"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Amazon Digital Services; 6th edition (October 28, 2017)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 28, 2017"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3577 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 318 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1775105938"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,107 Free in Kindle Store (See Top 100 in Kindle Store) #13 in Coming of Age Fantasy eBooks #16 in Sword & Sorcery Fantasy eBooks #16 in Epic Fantasy (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,986 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF736QWTT4C2H5UPDJXTLNWHTF4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R138RMD72V9QHW?ASIN=B076QLKDM5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Very good",
                "reviewText": "Their is sadness, but that is life. It is a well written story with lots of action and adventures. You get to see the characters grow strong and brave. It is almost like you are there. The adventure continues in the next book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tatyana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJ34CYNKOSNTMEYBTGMTDBPHP7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R167AHO8J34PXM?ASIN=B076QLKDM5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2024",
                "reviewTitle": "4.0 out of 5 stars Aaaahh!",
                "reviewText": "Brilliant, perfect, outstanding! I loved every moment of this, especially the dynamic between Gerald and Anna. Can't wait to read the rest of the series!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mjm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGORHJQQHAPQDARM4ZIXROV7QOIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJGZ2808USBZW?ASIN=B076QLKDM5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2020",
                "reviewTitle": "5.0 out of 5 stars A very entertaining tale!",
                "reviewText": "This series, starting with the prequel, “Battle at the River”, is my first exposure to Mr. Bennett’s writing - I’m very happy I decided to try it. Judging from some reviews from 2017 or so, it appeared that perhaps those readers didn’t realize the author’s intent. Having started this reading in 2020, I noted that this story covers a lengthy time line. It contains a prequel, then a pair of books followed by a volume containing additional information, then repeating for three more pairs with a separating volume each, for a total of four cycles so far.The series is entertaining, but it does unwind a bit slowly to establish the important early history between the first two characters we meet. The prequel introduces Lord Richard Fitzwilliam, Baron of Bodden, a completely down-to-earth and fair-minded master strategist, and Sergeant Gerald Matheson, unshakably loyal to the Baron, who had taken him in as a stable boy after his family was killed in an outlaw attack, and later accepted him into the army. Gerald was a firm believer in constant training and strict discipline to keep his troops ready for battle. The men learned to completely trust one another, which made them a great team in combat. This relationship saves Gerald from complete devastation after being severely wounded in a local skirmish, when an inexperienced royal leader botched the conduct of the mission. Gerald, a commoner, was held responsible, because ‘it couldn’t possibly be the fault of a royal’. The Baron asked Gerald to trust him as the Sergeant was cashiered out of the service with little means of support. The Baron arranged for Gerald to be hired as a groundskeeper for an estate in an outlying district, with undisclosed secret plans for his later services.In this first book, Gerald accepts his lot and tackles the work with his characteristic positive attitude. He meets Anna, a lonely six-year-old girl, later identified as the King’s illegitimate daughter, who has been exiled to the boondocks to keep her out of the Queen’s sight. The fellow exiles become allies and we watch as a strong, loyal father-daughter type of relationship develops as Anna come of age, with Gerald teaching her to take care of herself. The story has a few flat spots in following the daily routine, but there are frequent battles with raiders, so the people have to be constantly on guard, with daily training. New characters are added as the story progresses and we’re given hints as to what lies ahead.I read for escape and entertainment; I’m not put off by a bit of stretching the imagination. I thoroughly enjoyed the author’s adept mix of medieval life and fantasy as he presented a heart-warming coming of age story in which Anna and Gerald earned their respect for each other. He was straight-arrow and steadfast in his principles. She learned to cope with duty by seeing both sides of issues in the friction between classes, developed a sense of honor in the struggle between good and evil, and gained bravery through training in defending their homes against attack. The story is well-written, with strong characters and vivid descriptions, to keep the reader involved. I am eager to read the rest of the series.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3BOHA4K672FEWGRNQT55GRPNAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LT98MJ38C0WP?ASIN=B076QLKDM5",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 28, 2022",
                "reviewTitle": "3.0 out of 5 stars not a bad storyline, but…",
                "reviewText": "The writing is clunky, not as polished as I would like. I get distracted by extraneous words and descriptions. I hope the author would develop over time, because the story is engaging, but I find myself unwilling to pay for the other 10 books because the first is not quite up to snuff.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donald J. Nathaniel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKQDD3KH7W5GABNJ2U6WAEQ6BMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R141HSEW5U2DP0?ASIN=B076QLKDM5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Servant of the Crown, Book One. Excellent Read!",
                "reviewText": "This novel is very well written to keep the readers interest at a peak, turning page after page, to see what develops in this story of a young woman of Royalty, who has been displaced from her family because her lineage was not of the royals, but from an affair of the mother from her royal husband.The writer keeps the reader on their toes turning page after page as the adventure opens and digs deeper into the life of the young royal.Good read, interesting subject matter, great ending that doesn’t end, making the next chapter evident. I look forward to the next read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin Potter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4BPPPEIAJYHIDH5DXKTBNDGUVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KUEUTBE05HRJ?ASIN=B076QLKDM5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 24, 2019",
                "reviewTitle": "4.0 out of 5 stars Well written and interesting, if flawed",
                "reviewText": "Here we have an interesting and well written, if flawed, book.Greg Patmore's narration is quite good. He has a good assortment of character voices and is good with inflections. The only things keeping him from a 5-star performance are the lack of tempo variations and the fact that his voices don't change as characters age. (Anna, for example, has the same choice at age six as she does at age thirteen)Now, the story, such as it is.First and foremost, I really feel that this should be a prequel rather than book one. We spend a lot of time with Gerald and get to know him very well. But unfortunately, he is NOT the protagonist.Based on the events depicted in the story and how it ends, it's really Anna and Beverly's story. I have so many unanswered questions, largely because there is almost nothing herein about Beverly's journey. On account of that, her role in the end feels almost like Deus Ex Machina.That being said, I really love Gerald as a character. He reminds me a lot of Eddard Stark. He's this super idealistic and honorbound warrior who really struggles to figure out how the world really works. And every time we turn around, someone is double crossing him and he only just makes it out with his head still attached to his shoulders.That being said, the comparisons to A Game of Thrones pretty much end there. Here we have a world that, while brutal, is not nearly so dark and gritty as that in GoT.There is an argument to be made for things working out just a little too conveniently, but I don't feel it goes far enough to break my belief or immersion in the world.There is a problem though. Unfortunately, this is not, in the strict sense, a story. It is an episodic narrative. We get to see lots of little vignettes, but the only thing connecting most of them is that we're following the same character(s) throughout.There is no overarching plot. There is no continual building of tension. And there was no defined beginning, middle, or end. All three of those points came only arbitrarily as there was nothing connecting them that required them to be where they were.Similarly, this book does a lot of jumping through time without talking about what happened in the interim and it was very distracting.And I have to wonder, what was the point of the 8-chapter flashback to Gerald's past?Yes, it helped to get to know him better, but all the pertinent points of his past were addressed later. And I can't help feeling that certain elements from his past could have made a great secret for Anna to delve into that could have been used to build both of their characters even more.Now, the point of view.In fairness, this is largely a style choice and personal preference. But it's a pet peeve of mine.The omniscient narration of this book was detrimental to my ability to connect with the characters. Throughout the entire book, there was an unnecessary distance from the characters because we weren't really inside any character's head. We were told their feelings and motivations (bouncing between characters with no warning at times, which was quite jarring), but at no point did we actually see the inner workings of any character's mind.Now, before you go thinking in just ragging on this book, I'm really not. It was very skillfully written and I can see the soul of a born storyteller behind it. It just needs a little work to turn into something incredible.Finally, as I've touched on already, the ending was less than satisfying. It felt like an arbitrary, \"let's just stop here.\"All that being said, I do recommend this book to anyone looking for authentic or semi-authentic feeling medieval fantasy that is perhaps a little less dark (and adult) than Game of Thrones.And I am continuing the series. With a little work, this author could be amazing and I'm really hoping to see him step it up in the next book.",
                "reviewVotes": "69 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "john h",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "good",
                "reviewText": "An interesting and well written book. Plenty of interesting detail mixed in with a well built, moving plot. On to the next!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "coachjd",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 4, 2021",
                "reviewTitle": "Very Enjoyable Read",
                "reviewText": "I found the story and the characters very believable. The action was well described and exciting. On the whole well worth the time it takes to read the story. Well developed characters.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sagar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 12, 2019",
                "reviewTitle": "Too immature and not much of a story",
                "reviewText": "Frankly I could not finish it, read about 75% and gave up. Not sure why it has so many good reviews. It's too simple and hardly has a plot. I heard that the later books are better but why waste precious reading time on this. Lot of good medieval fantasies and even historical fiction out there.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nathan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 29, 2023",
                "reviewTitle": "Awesome characters and smooth writing",
                "reviewText": "Well paced writing with a captivating story and character list. Keen to read the next books as I finished this one toooo fast.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julius Nicholson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2023",
                "reviewTitle": "A nice start.",
                "reviewText": "I really enjoyed this story. This is not going to be your \"charge in and beat your enemy down\" style fantasy. But it is about a soldier that you grow to love. I genuinely felt for his misfortune. I also grew to like Anna who did nothing wrong but was treated as an embarrassing secret. The pacing is great and the characters have depth. I feel we all need a Baron Fitzwilliam in our corner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}