{
    "remaining_requests": 389,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/FantasticLand-Mike-Bockoven-audiobook/dp/B074PBM7LY",
    "body": {
        "name": "FantasticLand: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/FantasticLand-Mike-Bockoven-audiobook/dp/B074PBM7LY",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51dIguvgj L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mike Bockoven",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Mike+Bockoven"
        },
        "brand": "Mike Bockoven",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2499,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Since the 1970s, FantasticLand has been the theme park where \"Fun is Guaranteed!\" But when a hurricane ravages the Florida coast and isolates the park, the employees find it anything but fun. Five weeks later, the authorities who rescue the survivors encounter a scene of horror. Photos soon emerge online of heads on spikes outside of rides and viscera and human bones littering the gift shops, breaking records for hits, views, likes, clicks, and shares. How could a group of survivors, mostly teenagers, commit such terrible acts? Presented as a fact-finding investigation and a series of first-person interviews, FantasticLand pieces together the grisly series of events. Park policy was that the mostly college-aged employees surrender their electronic devices to preserve the authenticity of the FantasticLand experience. Cut off from the world and left on their own, the teenagers soon form rival tribes who viciously compete for food, medicine, social dominance, and even human flesh. This new social network divides the ravaged dreamland into territories ruled by the Pirates, the ShopGirls, the Freaks, and the Mole People. If meticulously curated online personas can replace private identities, what takes over when those constructs are lost? FantasticLand is a modern take on Lord of the Flies meets Battle Royale that probes the consequences of a social civilization built online. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Horror",
                "link": "https://www.amazon.com/Horror-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=49"
            },
            {
                "name": "Dark Fantasy",
                "link": "https://www.amazon.com/Dark-Fantasy-Horror-Fiction-Books/b/ref=dp_bc_aui_C_5?ie=UTF8&node=9803"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 1 minute"
            },
            {
                "name": "Author",
                "value": "Mike Bockoven"
            },
            {
                "name": "Narrator",
                "value": "Angela Dawe, Luke Daniels"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 01, 2017"
            },
            {
                "name": "Publisher",
                "value": "Brilliance Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B074PBM7LY"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#445 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #3 in Ghost Thrillers #4 in Science Fiction Anthologies (Books) #7 in Supernatural Thrillers (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Angela",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYMHZSETPQ46S5FAVT7TEZZ2WFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PVYKLKUQ5UCO?ASIN=B074PBM7LY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars A Fantastic Tale",
                "reviewText": "Fantasticland did not disappoint in the slightest. It was a page turner that I could not put down. I had to continuously remind myself that this story wasn't real. Some sick and twisted part of me wanted it to be real. I loved how the author presented the story. I loved how it didn't shy away from telling how far human depravity can become it such insane circumstances. When the apocalypse happens I damn sure don't want to be anywhere near an amusement park (or a bunch of teenagers for that matter). Truly and excellent read. Kept wanting more. Highly recommend. An easy 9.8 out 10 stars.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJTOTWH75UYSUJ6C57IN4SCU43Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IV7B1USGS2O6?ASIN=B074PBM7LY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2022",
                "reviewTitle": "4.0 out of 5 stars 4.5 Star Entertaining Quick Read",
                "reviewText": "Fantasticland was everything I wanted it to be and I enjoyed and gobbled up every minute of it.This book is actually far from my typical read, as I am not too keen on blood and guts and doom and gloom. Yet somehow, when my husband mentioned he was listening to the audiobook, I was instantly intrigued and downloaded and read it in one sitting.A modern Lord of the Flies, a skeleton crew of 300 or so theme park employees find themselves trapped in the park following a hurricane of epic proportions. Revealed in a series of interviews, the days following the storm are filled with chaos, paranoia, depravity, and some downright deliciously creepy stuff.What I loved about how this story was told is the uncovering of events gradually through various POVs and voices. In this way, we can see how something seemingly so outlandish could transpire so quickly. How one moment and our responses breed the next, and how these moments ripple and leave us scratching our heads, asking, “How did we get here?” There is a subtle insight into motivations, buried demons, and personality faults that are amplified when put into a vacuum.The only thing that kind of irked me was the repeated theme and idea of “what happens when you take away internet and social media from a group of young folks who have grown to depend upon it so desperately?” While I don’t disagree with the idea of a generation addicted to instant gratification, connection, and misguided purpose, I don’t think it was entirely necessary in this book or as an idea as a motivational driver for utter carnage and murderous teens.Rather, I think you can take from this a bigger picture, spanning all ages and generations, of what happens when you have a group of individuals who are isolated without information, scared and unsure of their future and wellbeing, lack purpose, and have no guiding force-and what happens based on WHO steps out ahead of the pack as the leader to create that guiding force and set the tone. How our differing perceptions, misunderstandings, and reactions to things can create a situation that grows quickly out of control. These same ideas shape and form politics, religion, cults, and the like…affecting individuals of all ages, place, and time…not just digitally addicted teenagers in Florida.For those reasons, I can also see how some might not enjoy this look into the darkest parts and the lowest of where our humanity can go while living during a period of time where perhaps we want to escape just how low we have seen society go in ways we thought not possible. For others who find solace in accepting the bleak and depraved and enjoy piecing together its motivations-Fantasticland offers a fun ride.For me, this book was simply and honestly a FUN, quick read. As I mentioned, I am no fan of gore, and for whatever reason my dark side showed up for this one and honestly didn’t find it all that bad? I found it had just the right amount of car crash you cant look away from and creep factor to keep me glued, entertained, and curious from beginning to end-leaving me nagging my husband to hurry up and finish his audiobook so we could discuss.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aylah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFCJCYBECPGACD4MBK4I2VNY6MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZJK1K555BGNU?ASIN=B074PBM7LY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Thoroughly enjoyed reading.",
                "reviewText": "I've never wanted a sequel or spinoff more than I do for this book. I loved the interview style it was written in, the difference in characters, the mysteries and questions readers are left with. I want more!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hanna Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHD7D2IU2LN6LZP5YJMIKR5RQVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RSSHDN20CIN8?ASIN=B074PBM7LY",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "3.0 out of 5 stars A Struggle for Fulfillment in a Quest for Horror",
                "reviewText": "This book fell short of expectations, lacking the depth and fulfillment I anticipated. The plot seemed promising, but character development was lacking, leaving the story feeling incomplete and unsatisfying. The potential for a captivating narrative was there, but the execution left much to be desired, ultimately leaving me wanting more from the novel. Around two-thirds into the book, it finally gained momentum, but by then, I had already faced considerable difficulty staying engaged. I found myself questioning if the premise aimed to critique America's youth, their detachment from reality and excessive reliance on phones and social media, leaving them ill-equipped to handle stressful situations. While this theme emerged belatedly, it wasn't enough to redeem the overall lackluster experience of the earlier sections. Despite containing mild horrific descriptions, \"Fantastic Land\" doesn't quite qualify as horror, in my opinion. It provides just enough to spark interest, but I found myself wanting more substance. The temptation to DNF the book was strong. I can see how some might appreciate its unique approach by being written in interview style, but personally, it didn't resonate with me. While not the worst read, it certainly doesn't rank among the best in my literary experiences.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Douthart",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5CRMZSKSUKKR3AVHZXFAS6XNCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O4I6DAF598T3?ASIN=B074PBM7LY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Wow",
                "reviewText": "Wow. Just wow. A modern lord of the flies and a disturbing telling of life as we know it! Well written",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark Chesnut",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBJIB73ICXKU3UN6B7PRHGTAYPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MNLJIVU9YCM4?ASIN=B074PBM7LY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Compelling, bizarre story, interestingly told",
                "reviewText": "I was drawn in by the imaginative and bizarre premise, and found the story engrossing and disturbing. The format, using the words of a journalist and direct quotes from lengthy interviews he did, helped to make the story seem more real. It probably also made it harder to paint a more vivid picture of the park and what happened there, since everything was through the words of witnesses, but nevertheless I found this an engaging read that could certainly translate to to the big screen.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mitch Scuzzarella",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJCONLEXVBJSGUU4T2CLNHQRXWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5JNU20JN1QWB?ASIN=B074PBM7LY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars A fun read",
                "reviewText": "While I occasionally found the material to be a stretch (its tone focused on realism) this was a fun and interesting read that had me going back through the material to revisit earlier chapters.The idea was interesting, frightening, and well thought out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Lynn Lada",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKT75IW5SOKCFQFB5MS6V6RN33Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ASLSL38HCRK7?ASIN=B074PBM7LY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars What a trip",
                "reviewText": "Though this book is pretty gory, and doesn't have any lessons to teach, it is highly entertaining. I read this in the span of less than 24 hours and would have enjoyed even more points of view. Well done! I will be looking into this author's other books for sure!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 13, 2023",
                "reviewTitle": "Schwachsinn",
                "reviewText": "Selten so einen Müll gelesen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric Mitchell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 6, 2019",
                "reviewTitle": "Keeps you guessing and leaves you judging yourself",
                "reviewText": "This book got to me. It's creepy and shows the worst actions of mankind. But i couldn't stop reading which is the point driven in the afterword. The author was able to put together a great tale that i could see making a great mini series with how he built the drama and suspense.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DaisyDaisy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 2, 2020",
                "reviewTitle": "Something different!",
                "reviewText": "I nearly gave up as soon as I realised the whole book was made up of \"interviews\" as I thought the whole subject would be skirted and not substantial at all. So glad I carried on as the writing is fantastic and I was really drawn into the story.The characters are developed so well, even just experiencing their snippet. The story moves along really well and just captivated me.The book is so well written.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 12, 2017",
                "reviewTitle": "Incredible",
                "reviewText": "It has been a long time since a book captured my attention as much and as quickly as this one did.Very thought provoking and over all an incredible read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 8, 2019",
                "reviewTitle": "I love twisted stories!",
                "reviewText": "Fun Read! Kept my interest all the way through. I love twisted stories!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}