{
    "remaining_requests": 346,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dragon-Mage-Rivenworld-Book-1/dp/B096CJW1SD",
    "body": {
        "name": "Dragon Mage: Rivenworld, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dragon-Mage-Rivenworld-Book-1/dp/B096CJW1SD",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51t48ZuGBNL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "ML Spencer",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=ML+Spencer"
        },
        "brand": "ML Spencer",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 4756,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Aram Raythe has the power to challenge the gods. He just doesn't know it yet.Aram thinks he’s nothing but a misfit from a small fishing village in a dark corner of the world. As far as Aram knows, he has nothing, with hardly a possession to his name other than a desire to make friends and be accepted by those around him, which is something he’s never known. But Aram is more.Much, much more.Unknown to him, Aram bears within him a gift so old and rare that many people would kill him for it, and there are others who would twist him to use for their own sinister purposes. These magics are so potent that Aram earns a place at an academy for warrior mages training to earn for themselves the greatest place of honor among the armies of men: dragon riders.Aram will have to fight for respect by becoming not just a dragon rider, but a Champion, the caliber of mage that hasn’t existed in the world for hundreds of years. And the land needs a Champion. Because when a dark god out of ancient myth arises to threaten the world of magic, it is Aram the world will turn to in its hour of need. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Science-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16190"
            },
            {
                "name": "Epic",
                "link": "https://www.amazon.com/Epic-Fantasy-Science-Fiction-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16197"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "27 hours and 18 minutes"
            },
            {
                "name": "Author",
                "value": "ML Spencer"
            },
            {
                "name": "Narrator",
                "value": "Ben Farrow"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "July 20, 2021"
            },
            {
                "name": "Publisher",
                "value": "Podium Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B096CJW1SD"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,394 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #243 in Dragon & Mythical Creatures Fantasy #685 in Dragons & Mythical Creatures Fantasy (Books) #1,241 in Epic Fantasy (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jennifer C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL5QWOIBMPENL7HKLGJYLOTO3KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS6H40JEXMSAY?ASIN=B096CJW1SD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2022",
                "reviewTitle": "5.0 out of 5 stars A truly epic story with fantastic elements!",
                "reviewText": "Aram Raythe has lived his life so far as the village misfit who can't seem to say anything right, bothers almost everyone he's around, and has a strange compulsion to learn how to tie as many knots as he possibly can. So Aram is definitely surprised when he opens up a rift, quite by accident. Unfortunately, doing so also brings Aram's existence to the attention of the military.When a bard, Ebra, attempts to save Aram - though from what is not really explained - and his best friend, Markus, along with him, things quickly begin to go sideways. A sorcerer shows up to the village while Markus is in town trying to get supplies for the three of them to escape, and the sorcerer and accompanying soldiers lay waste to the village - all to find Aram. For what Aram and Markus don't realize is that Aram is a source of essence, which is what the sorcerers of the world use to create magic. Unfortunately, the military and sorcerers within it are not nice about how they collect that essence.When Markus and Aram are captured by the sorcerer and his men, their lives are catapulted onto a path - that is both terrible and great - that neither one could have even imagined.There have been many books described as epic, when it is really the series that is epic. This book, on the other hand, is truly epic. Clocking in at 99 chapters, not including the prologue and epilogue, and at just under 1,000 pages in length, this is a book that could have easily been a trilogy all unto itself. Yet, it is actually the first book in a series.Yet, while the length would scare many readers off, I can tell you that it is a truly great story that is worth every page. As with other epic novels and series, there is a large cast of characters for readers to get to know, but Spencer does a wonderful job of developing those characters and not introducing random characters that are just there to take up space. Sorry Random Guard #3, you don't get a role here. That is a testament to Spencer's planning and writing ability because I have certainly read epic novels with characters that may have had larger, important roles until the editing process got ahold of them and scrapped a lot of their importance. While that may have also happened in Dragon Mage, Spencer did a great job of removing superfluous characters. That's not the say there aren't a lot of supporting characters in the background; there are. There's an entire army of them. They just don't get names or speaking roles with descriptions that will add to the list of characters for a reader to try and keep track of.The one thing that I absolutely loved about this book - aside from the dragons since that goes without saying - is the magic system. Not only is the system built on a relatively unique foundation with the use of strings and weaving (I can think of only one other series with similar magic, and in that case, it is only a single character that uses magic in a way that is similar, as opposed to the method underpinning all of magic), but I appreciated the limitations that Aram has in using his magic. I would get into spoilers a bit too easily if I talked about the specifics too much, and I don't want to do that, but I will say that the good and bad of the magic system as used by the sorcerers in Aram and Markus' world is both awesome and awful.Along with the magical system is the worldbuilding, which was incredible. For Spencer didn't just build one world, but two, and created their entire histories which we were given information on a bit at a time. At the same time, rather than info dumps to provide definitive information, I really liked how the information provided was colored based upon who was providing it, and because of the history, there was a lot of misinformation, which also plays into the story. That's not something that I have seen much in other books I have read. at least not outside of the standard political intrigues and games being played; and while that was certainly at play here, too, it wasn't the only reason, and I definitely liked it.And I can now see this review getting long, so I'll finish by also mentioning that the audiobook, which was narrated by Ben Farrow, was a great experience. Again, the length (27 hours and 18 minutes) could be off-putting to some listeners, but it is worth it. Farrow does a great job with the narration, and I found that listening to him actually kept my mind off just how long the book is. His performance pulled me into the story and time was passing before I even realized it - to the point that I finished listening to the entire book in just over 2 days. I am definitely looking forward to continuing this series, and will hopefully get the opportunity to listen to the next book as well.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brandon Lusk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEKXFXUKJHQFEOZ2GAKRTXQBF7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLWYDIMS1AZU?ASIN=B096CJW1SD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Beautiful story with incredible characters and detailed world building.",
                "reviewText": "This is one of my favorite fantasy epics I've ever read. It does a beautiful job of creating unwavering investment in the main character and his best friend, and making you feel immense satisfaction as they reach different points in their journey.There are very obvious parallels to draw between Dragon Mage and the Rift War Saga by Raymond E. Feist, but the author does a wonderful job creating an original story in an existing paradigm. The use of knots in the magic system is a unique twist and she obviously did no small amount of research on the topic ahead of time.If you're a fan of the fantasy genre, this is an un-regrettable purchase, and I intend of diving into her previous existing series as a result. Cannot wait for Book 2!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole Fragnaud",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWHXXJOQ6FVORX6IEODYWMZHHXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G3PX4PIXTZVD?ASIN=B096CJW1SD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "4.0 out of 5 stars it’s been a long time a hadn’t found such a great dragon book.",
                "reviewText": "Once I passed the first two chapters, I got absorbed into this world. One of those books you can’t put down, but you don’t want it to finish.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. R. Jackson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAYIJ3RCJ2D72ZDHBURGQUUY2BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5X1RDX3II67M?ASIN=B096CJW1SD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Wow just Wow",
                "reviewText": "I loved this story and the main characters etched dearly in my heart.I see this is book 1. What more can the Rivenword have in store for us?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF26ULQKSS6ALKF7KYED25IPABCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AYNEVB5QMMI5?ASIN=B096CJW1SD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome story and author",
                "reviewText": "This is an awesome story. It is worth reading this book. This author is fantastic. Enjoy 🌻 🥂 💕 🥰",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFFDIUALHNKI6DQTWRPHS6EIF5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RL97BR9WY8VK?ASIN=B096CJW1SD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Súper enjoyable read",
                "reviewText": "Loved the world building and the overall storyline. Enjoyed the characterization-interesting cultures and charters-both human and fantastical. Sorry when it came to an end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "coralreef",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZFPVIHQHBA2NGD3C2NZWMZ5MDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LIXVZTXPZOAB?ASIN=B096CJW1SD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2022",
                "reviewTitle": "4.0 out of 5 stars It's Definitely Worth Reading",
                "reviewText": "Ok, so first off: I liked the book. For an indie author, she's solid. The story line was pretty good and kept me interested, the world-building was cool, the character-building was realistic, and the magic systems were interesting.All that being said- I felt like I was reading an exceptionally talented indie author's first novel. Like, the writing is good, and the dialogue is good but... It's not great... YET. I feel like the author could be Sanderson-level AMAZING, she's just gotta keep studying & learning her craft. The flow is just not quite there yet. But she's got the psychology and charcter-building down, and she's got the world building down.One of the other issues I did notice was the lack of a completely logical explanation for the Overseers and why they needed slaves. I also didn't understand how some people made it out of the Trails as Champions because the explanation was they either became slaves and thralls or they went crazy or were killed ... Which didn't explain the ones that came out as Champions neither crazy nor dead.I also did not ever get a clear explanation of the Extraction process. We know it involves pain but other than that, I didn't see a description of how the essence is extracted- is it just a magical process? Like they put their hands on the body and magic starts siphoning off the essence? Or are there tubes they stick in the bodies to siphon it out? I dunno- it's a mystery.I'm also assuming the second book will explain how the destroyed Anchors have affected the world now and if it's possible to recreate them.Bottom line though is it's a solid fantasy book with dragons that's a worthwhile buy. In spite of a few minor issues and questions.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Megan Warschefsky",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNALIS6J7PPU3LDN46RITT7PHYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RENB20F49KB1U?ASIN=B096CJW1SD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "I liked this book because of the drawn-out plot that it follows. I look forward to another book in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 24, 2023",
                "reviewTitle": "Great Fantasy Read",
                "reviewText": "I really enjoyed the characters and their growth in this book. The depictions of childhood experience in this book were well written and thought out.The main characters are fun to watch grow, and I really enjoyed the friendships and how they were created and portrayed I'm this.As well as the great characterization, this book has a concept of worlds and dragons I haven't enjoyed as much since Pern or Temeraire.My only complaint about this novel is that the second book in the series is not out yet.Keep writing and I'll keep buying!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TomFR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on May 15, 2022",
                "reviewTitle": "Brilliant",
                "reviewText": "Everything I love in this type of book. Well written with a storyline that keeps you wanting to know what comes next.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cesar ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on August 30, 2021",
                "reviewTitle": "One word: Fantastic",
                "reviewText": "I never imagined to encounter such a wonderful book with dragons, characters and storyline. Can’t wait for the next one!Thank you",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anita",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 29, 2021",
                "reviewTitle": "Loved it",
                "reviewText": "Great for fantasy lovers and gobbled the book up, couldn't stop reading. Loved the pace and the characters. A really enjoyable read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jitesh yadav",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 19, 2021",
                "reviewTitle": "It is the classic fantasy that won't let you take a single breath in this huge book.",
                "reviewText": "So, I was very much intimidated by the sheer size of the book and couldn't gather the strength to read this, but I was also very sad that everybody I know was reading it or have read it. That's why I picked it up and just read the chapter 1 and then you won't regret anything this entire time. This book contains all the tropes like a boy from small village, a old mentor, dragons(obviously it's on the cover), and bone deep friendship.The book revolves around the boy named Aramon Raythe. And contains two more frequently appearing POVs, and here and there other characters giving their insights from their eyes. Our protagonist is, I don't know what the problem called but he can see in colour and that's the beauty of this book.The world building is the very prominent part of the book, as there are two worlds, the world above and the world below, where in above there are no magical creatures and in below, where all the magical creatures reside. And very good thing is the world below is not like the hell, all red atmosphere and there is nothing but despair and sadness and all, there is nothing like that. But it's more like the world of hope and love. And the world above is also not so bad. So don't worry you will enjoy both the world, I guess as I did.And magic system, damn that was very good. I mean, that's very cool part. The magic system in this book is infused with knots. And wow, ML Spencer did an excellent job at providing us the information about the knots and all, so people who want to enjoy the magic and lore, it's a treat.Ml Spencer was also successful in creating tension in times of war, chase and all. That's very good when it happens, that means you are connected with the characters and care about them.At last, you won't regret reading this book and the things are done with great precision.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}