{
    "remaining_requests": 401,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Assassins-Blade-Throne-Glass-Novellas/dp/B09168CSN3",
    "body": {
        "name": "The Assassin's Blade: The Throne of Glass Novellas",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Assassins-Blade-Throne-Glass-Novellas/dp/B09168CSN3",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51tZW5VMqeL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Elizabeth Evans",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Elizabeth+Evans&search-alias=audible"
        },
        "brand": "Elizabeth Evans&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 32523,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Bloomsbury presents The Assassin's Blade by Sarah J. Maas, read by Elizabeth Evans.The twist of a knife. The birth of a legend.Step into the world of the #1 bestselling Throne of Glass series by Sarah J. Maas with this collection of prequel novellas.Celaena Sardothien is her kingdom’s most feared assassin. Though she works for the powerful Assassin’s Guild and its scheming master, Arobynn Hamel, she yields to no one and trusts only her fellow killer-for-hire, Sam. But when Arobynn dispatches her on missions that take her from remote islands to hostile deserts, Celaena finds herself acting independently of his wishes and questioning her own allegiance.If she hopes to escape Arobynn’s clutches, Celaena will have to put her faith in her wits and her blade...knowing that if she fails, she’ll lose not just a chance at freedom but her life.A prequel to the New York Times bestselling Throne of Glass, this collection of five novellas explores the history of this cunning assassin and her enthralling—and deadly—world.Included in this volume:The Assassin and the Pirate LordThe Assassin and the HealerThe Assassin and the DesertThe Assassin and the UnderworldThe Assassin and the Empire Read more",
        "breadCrumbs": [
            {
                "name": "Audible Books & Originals",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_1?ie=UTF8&node=18145289011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18580606011"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18580607011"
            },
            {
                "name": "Paranormal & Urban",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18580622011"
            },
            {
                "name": "Paranormal",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=18580624011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "12 hours and 52 minutes"
            },
            {
                "name": "Author",
                "value": "Sarah J. Maas"
            },
            {
                "name": "Narrator",
                "value": "Elizabeth Evans"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "April 01, 2021"
            },
            {
                "name": "Publisher",
                "value": "Bloomsbury Publishing Plc"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09168CSN3"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#54 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #8 in Paranormal & Urban Fantasy (Books) #9 in Paranormal Fantasy #14 in Epic Fantasy (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jessica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5EJTIBO5EXXYDMOSUQVYBDJIJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HMZ300LDVFOL?ASIN=B09168CSN3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2015",
                "reviewTitle": "5.0 out of 5 stars Not only are these prequel stories AWESOME, you NEED to read them to understand everything in the main series. *crosses heart*",
                "reviewText": "~The Assassin and the Pirate Lord~First, I think it's important to recognize that one of--if not the--main purposes of these novellas to grow Celaena from an intolerably insolent and arrogant adolescent into a world-wiser (but still cocky) young adult.The #1 complaint about this series is that readers don't like Celaena.Personally, I love her, but I understand why others might not. She's a superlative character who some people can't handle her extremes, and that's only one of a dozen legitimate issues.BUT.There are several loudly voiced complaints that, as far as I'm concerned, don't hold water. I've already addressed my feelings in regards to the claim that she is too girly to make a believable assassin in my Throne of Glass review.The other assertion I cannot abide is that Celaena \"never does anything,\" or \"never kills anyone.\"That she's basically all talk.Maybe I'm confused, but I've never supposed that assassins are meant to go around killing EVERYONE indiscriminately. And she's not just an assassin. She's the King of Assassins' heir. Adarlan's Assassin.At least half of her identity is reputation, and it wouldn't behoove that reputation (or be good for business) to run around like a maniac slitting throats and eviserating passersby.In this novella, she's a sixteen-year-old girl who single-handedly disarms and disables the entire crew of a pirate ship. She easily defeats the Pirate Lord in combat, using his own weapons to do it.How is that nothing? How is that all talk? *mind is boggled*Beyond establishing herself as a seriously kick-ass heroine, the foundation for something that will shred your heart into teeny, tiny pieces is also laid. <------*WAILS*And, you know . . . there are pirates.Everything is better with pirates.SO. Not my favorite of the bunch, but a close(ish) second.~The Assassin and the Healer~This novella wasn't part of the original four. I chased down pieces of it on various blogs, over the course of several days before CROWN OF MIDNIGHT was released.Anyway, I liked this one a lot, too.So should anyone who thinks Celaena doesn't kill often enough. How about six or eight mercs in a dark alley after they try to rob and attack a barmaid?All I'm saying is that's an awful lot of bodies piling up for an assassin who allegedly doesn't assassin.Moving on.We also learn some Celaena background: that her country was destroyed by war, and she feels a kinship with others who have suffered similar fates. That as a child she had dreams that are in complete contradiction to her current status.Aaaannddd we (once again) get to observe the softer side of Celaena. The side that compels her to intervene on behalf of others when she can. many reasons I'm able to overlook her more abrasive qualities.Bottom line: a worthy addition to the canon.~The Assassin and the Desert~Oh, my FEELS. They hurrrrrrt *sobs*So what does is say about me that this is my favorite of the group? Hmm . . .In the inevitable aftermath of her actions in Pirateville, Celaena is sent into the blistering, unforgiving heat of the desert to train with the Mute Master, Arobynn's (infinitely more benevolent) Southern counterpart.She has one month to train with the Silent Assasssins. One month to earn the Mute Master's respect in the form of a letter to Hamel on Celaena's behalf, commending her efforts and abilities.One. Month.This is the novella that makes me determinedly profess that readers' NEED to read the prequels.There are people and places and events that have already begun to play a greater role in the main books, with half a dozen foreshadowings of things to come.You. NEED. To. Read. It.And it won't make sense, if you haven't read the first one, and after that . . . Well, why not just read them all?Besides . . . Don't you want to see Celaena fumble her way through her first friendship? And not just her first friendship, but her first friendship with a GIRL?Of course you do.And who could blame you?~The Assassin and the Underworld~This novella should have been called THE ASSASSIN AND THE TANGLED WEB OF AROBYNN HAMEL, but I guess it doesn't rollllll of the tongue the same way.I really wish I could give you an accounting of the events that take place here unhindered by the knowledge of what's to come.But I can't.I read it too many times and it broke my heart too completely.THE ASSASSIN AND THE UNDERWORLD is about what happens when Celaena returns to the Assassin's Keep after Arobynn beat her into unconsciousness and sent her to the desert.Celaena arrives full of confidence and more than a little bit of self-satisfaction.She succeeded in accomplishing her nearly-impossible-to-complete task. More than succeeded. Was sent home from the Red Desert with a fortune great enough to purchase her freedom.When she struts into Arobynn's office, she has every intention of telling him, and leaving him.Unfortunately . . . It doesn't work out that way.Instead, she allows herself to fall back under his spell. Not fully, she's been made too wary for that, but enough that she becomes an unwilling accomplice in his nefarious plans one last time.This is where we first see the depth of Arobynn's treachery.My thoughts on Celaena's lack of immediate response to said treachery upon her return to Rifthold in ToG: [Many think Celaena is being willfully obtuse about the role her mentor played in the events that led to Sam's horrific death and her imprisonment at Endovier, but this is something I understand: [for spoiler see Goodreads or blog reveiw]~The Assassin and the Realm~THE ASSASSIN AND THE REALM starts at the end. Celaena is suddenly a prisoner of we-don't-know-whom/we-don't-know-why.All we know is that she's shattered. She does not care that she's caged like an animal. She does not care that she's in chains. Cold, hunger, thirst, all things beyond her concern.And then . . . in the dark . . . she remembers.Maas is an expert at cultivating DREAD. It may not be as stealthy here, what with us already knowing that Celaena---in some context---has failed, but that doesn't negate the fear, the roil in your belly, as you push yourself to keep reading, to find out what happened, what went wrong, so that at least then . . . it will be over.As I said earlier, I read these before reading THRONE OF GLASS, so I can't state from experience that if you're having issues with Celaena, reading THE ASSASSIN'S BLADE will fix them. BUT. I can say that I've never had any issues with her character development, and the majority of readers who have taken my advice have found themselves understanding her better than they had previously. Beyond that, you need the background from Celaena's time in the Red Desert to fully appreciate what's happening in the main series (my favorite YA series, incidentally). <------FYI.SO. Read it. I'm so far passed \"recommending\" it that I'm brandishing it wildly.“My name is Celaena Sardothien,” she whispered, “and I will not be afraid.”",
                "reviewVotes": "69 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kate Baas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNYCFTCXYYOC25QR7JG5OKF4HRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z6MS6L85SZP5?ASIN=B09168CSN3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Quick Novella on Celaena's Past",
                "reviewText": "⭐️⭐️⭐️.75, 0 spice. I read this 3rd in the series (after Crown of Midnight) and I’m glad I did- it gave background on some things that happen in the first 2 books and you learn about Sam and more about her history with Arobynn! I don’t think I would have liked it if I had read it first in the series, as it is a compilation of different stories of her past that more so give depth to why she's the woman she currently is and why she is so scorned from the past. What I didn’t like was the fact that she’s so blind to Arobynn and what he does to Sam and how he treats her! How had the thought not came across her mind at least once?? I found myself wanting to skim the last 2 sections to get through it faster so I could get to Heir of Fire faster.Can’t wait to read book 3, Heir of Fire now!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ariana Ownbey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERLRHCGSFCOUYAPO4QHGB4GMFLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FXFEQN65QBEK?ASIN=B09168CSN3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved the Backstory!!",
                "reviewText": "I really enjoyed this book! I loved that you get to take a deeper dive into Celanas backstory. You got to understand the life she lived before Endovier and you got to meet the characters that were just mentioned in other books.I also love the fact that you get to understand what brought her to Endovier and why she did what she did. You also get to see a little more of her witty, funny side. I read this one between Heir of Fire and Queen of Shadows and it was a nice break in the story.Reading it this way gives you a chance to get go know the characters more and meet new characters that had a big effect on Celana.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brittany",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3EGZHIYJ4TPCBQUM7WUWGJWSNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PU2WDFJFFKFU?ASIN=B09168CSN3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2014",
                "reviewTitle": "5.0 out of 5 stars Wonderful addition to the series - Like a whole new book!",
                "reviewText": "Review originally posted on The Book Addict's GuideI had been meaning to start THRONE OF GLASS for a long time and was juuuust about to start it when Nikki from There Were Books Involved advised me to read the novellas first. See, this would haven’t been my first read of THRONE OF GLASS. I had actually tried back when the book first came out in 2012 and made it about 80 pages before my book was due back the library… But I hadn’t been really interested it in. I had found it a bit hard to get into and I think I wasn’t at a point in my reading life at that point in time where I could really appreciate fantasy as much as I do now. When Nikki advised me to read the novellas first because they actually helped her appreciate THRONE OF GLASS that much more, I decided that was definitely the best route for me.The funny story is… I was only able to borrow some digitally from my local library so I had to purchase the others… and ended up accidentally reading them out of order (I read the third one first and the first one third). It didn’t really affect my overall opinion too much, but more of a funny little story which obviously wouldn’t have happened if I was actually reading THE ASSASSIN’S BLADE. Oh well!THE ASSASSIN AND THE PIRATE LORD is the first novella of the bunch (and the one I ended up reading third. Oops) and I’m actually kind of glad I ended up reading it out of order. I really loved all of the novellas but I think this one was my least favorite. Since I read the third one first, I already knew essentially what happened here and it wasn’t that it was anticlimactic but more so that I had already seen a more mature Celaena — even two novellas later — so I grew a bit impatient with her at times. It wasn’t a huge deal for me, but I did notice it a bit. I also felt like the plot was probably the least interesting out of the four that I read and felt more like a string of sequences than something that really flowed. It did have quite a bit of important foreshadowing in there, though, and it was really great to get that foundation for both the world and the characters. This was also an extremely important story because it really sets to motion absolutely everything that leads up to THRONE OF GLASS.The second novella (skipping over the one that is only in TaB… so technically # 0.3) is THE ASSASSIN AND THE DESERT. I think I enjoyed this more than THE ASSASSIN AND THE PIRATE LORD because Celaena really starts to learn things about herself and is both mentally and physically pushed to the limits on so many levels. It’s easy to know who you think you are but once you’re put in extremely trying situations, you start to see the person you really are and what weaknesses emerge. It was heartbreaking too, because I think Celaena really opened up and discovered a lot about herself but then both of those things made her close herself off again. I really loved the relationships in this novella a lot and I think it was a really important piece of Celaena’s background that we got to know.The next novella was THE ASSASSIN AND THE UNDERWORLD (that I accidentally read first) and I just fell in love. It was so intriguing and so complex for a novella! I really felt like I got to know all of the characters so intimately and each of the characters — as well as the plot lines — really begin to grow. There were TWISTS and things I did not see coming and it was probably one of the best novellas I have read in a long time (maybe ever?)… That is until….THE ASSASSIN AND THE EMPIRE — HOLY CRAP, you guys. This novella BROKE me. It was flat out amazing and also set up a lot for THRONE OF GLASS but there were so many things I didn’t expect and so many things that completely floored me. If you read the main novels first — as goes for any of these novellas — you already know what happens in the end but I got to experience all of that backstory first hand and it was… well it was a wild ride. This is one of THE best novellas I’ve ever read and all of these are worth the read, whether you’ve already read all of the books so far in the series or not.My overall opinion of the novellas is that they’re must-reads for fans of this series. I know a lot of people actually aren’t a fan of novellas but these four (and I’m assuming the fifth that I haven’t read yet) all fit together to really kind of form a whole new story in one book. I read them all before I started THRONE OF GLASS which you don’t have to do, but I really enjoyed it because these are all prequel novellas and I really felt like I was reading the series in chronological order. Given what I’ve learned so far in CROWN OF MIDNIGHT, I think it’s important to read these novellas before book two because there is a lot of history explained there that really makes more sense and draws on more emotions if you’ve read the novellas first.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janaya Muise",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2024",
                "reviewTitle": "Loved this book",
                "reviewText": "Very much enjoyed",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MARTHA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 13, 2023",
                "reviewTitle": "muy buen libro",
                "reviewText": "perfecto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rayane BarbosaRayane Barbosa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on April 22, 2023",
                "reviewTitle": "A melhor série do mundo",
                "reviewText": "TOG dispensa comentários pois é a minha saga favorita, essas edições novas ficaram lindas e as capas condizem super com a história ❤livro é um paperback como qualquer outro, não é soft touch (glória a deus) e o mapa de dentro pisa no da edição brasileira.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81bzo0VbYCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7114u2t2KJL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fry-chan Fry-chan ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 14, 2023",
                "reviewTitle": "Super",
                "reviewText": "Très beau livre à couverture rigide pour le relié et très bonne histoire..",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81jL9PMMnAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71SEpN1RjEL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "May",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 1, 2023",
                "reviewTitle": "Perfecto",
                "reviewText": "Me encanta esta nueva edición de la saga. El libro llegó en perfecto estado. Y la historia es un 10/10 para mí.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}