{
    "remaining_requests": 186,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tidesong-Wendy-Xu/dp/0062955799",
    "body": {
        "name": "Tidesong",
        "price": "$10.79$10.79",
        "originalPrice": "",
        "rawPrice": 10.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tidesong-Wendy-Xu/dp/0062955799",
        "soldBy": {
            "sellerID": "A34MOU1WOG7LRW",
            "name": "Zoom Books Company",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A34MOU1WOG7LRW&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/517zCcKP8 L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51eTl7jJNrS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yPzidUgWS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511QN8TP8wS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bdU7so0OS.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Wendy Xu",
            "link": "https://www.amazon.com/Wendy-Xu/e/B07JCP14NZ/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Zoom Books Company",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 176,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 22 mins",
            "FREE delivery Thursday, February 29 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Growing Up & Facts of Life",
                "link": "https://www.amazon.com/Issues-Childrens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1084192"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Quill Tree Books (November 16, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 240 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0062955799"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062955791"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 12 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 3 - 7"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.75 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#332,291 in Books (See Top 100 in Books) #375 in Children's Fantasy Comics & Graphic Novels #4,411 in Fantasy Manga (Books) #6,798 in Children's Fantasy & Magic Books"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 176 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Victoria and Adrian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGKKMCUZBMJGVSHNXCPWWGETBTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GZJMT3VAFK13?ASIN=0062955799",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2022",
                "reviewTitle": "5.0 out of 5 stars a sweet friendship",
                "reviewText": "This was such a cute story about a girl learning to see more than just what she needs but the needs of others. This was an adorable book, and one that I will be putting on my bookshelf from my students.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Montana Gamez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOTUZ7KMK5E4S3YVFT4234O3JGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ERA93YS828J9?ASIN=0062955799",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 6, 2022",
                "reviewTitle": "5.0 out of 5 stars Beautiful Art",
                "reviewText": "The story is amazing and vary relatable for real life situations. The books art is great, almost reminds me of studio ghibli",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Utopia State of Mind",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECNSWIZBB6JV3THYTSJXOEGIW6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4GUCMYEABFZC?ASIN=0062955799",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 2, 2022",
                "reviewTitle": "4.0 out of 5 stars entrancing and gorgeous",
                "reviewText": "Immediately I was entranced by the illustration style. It reminds me so much of some art from Ghibli and is a must read if you love that style. Combined with gorgeous color work and really unique and memorable characters, the magic in this style is stunning. While I'm sure Xu could draw a phenomenal contemporary graphic novel, there's something about the line work that lends itself to fantasy. At the heart of Tidesong is the way we always think we can handle more than we can.When we are convinced we're all grown up. However Sophie's story is one of family and mistakes. Of letting the past and our guilt twist our present. Sophie feels like she's trying to live up to the pressure she puts on herself to be powerful now. To feel like everything is happening right now. How can anyone live under the weight of our own harsh standards? We can be so determined not to bend under pressure, when all we need is a little flexibility.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Whimsical Dragonette",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY6R7NMDF6FNNYQJICPAIP57W5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTL9UI5U94VY9?ASIN=0062955799",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 23, 2023",
                "reviewTitle": "5.0 out of 5 stars magical",
                "reviewText": "This is such a sweet and magical story! The illustrations are gorgeous and the characters come alive and just jump off the page.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katelyn L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGTFEFYPZGTZZFPPPMDTRVEOE4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SCDBPTBPMZA2?ASIN=0062955799",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2021",
                "reviewTitle": "3.0 out of 5 stars Adorable graphic novel",
                "reviewText": "Sophie is a young witch with a lot of pressure on her. Her grandmother and mother want her to attend The Royal Magic Academy, the best place to study magic. Even though her magic isn't the best. So she finds herself with relatives she's never even met, relatives who seem more keen on teaching her to do chores than magic. When Sophie tries magic on her own things go terribly wrong. She accidentally entangles her magic with a water dragon's magic, trapping him in his human form.With Lir's and her magic intertwined Sophie finally seems to be getting the hang of magic and just in time her entrance exams, but things aren't all sunshine and roses especially when they realize that the water dragon isn't just any water dragon. Can Sophie and Lir work together in untangle their magic all while proving themselves? And what will they learn as they do?This was such an adorable graphic novel. The story reminded me of a mix of Luca and Raya and the Last Dragon, so if you like those vibes I'd definitely give this one a go. The magic in this book was more subtle. It sorta relies heavier on the element of water to be able to tap into their magic. Also I got some major Water-bender vibes from the pictures. I also feel like the family dynamics were well done even for the short length of this book. Overall this is a super read perfect if you want something fast or more light-hearted to read in between books.Thank you to NetGalley and the publisher for sending me an earc copy of this book. All thoughts and opinions are my own.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cecelia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7YSWPOTAG5DUVPGLHWXNZRB4VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HXB9L3WX9VO1?ASIN=0062955799",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2022",
                "reviewTitle": "5.0 out of 5 stars A magical book with brilliant (& adorable!) illustrations. Must-have for graphic novel collections.",
                "reviewText": "I’ve been a fan of Wendy Xu’s art since I saw it one year at Small Press Expo (SPX), a mini comics conference held in the DC area each year. I was excited to pick up Wendy’s middle grade graphic novel Tidesong for the art, of course, but I was also intrigued by the incorporation of water dragons, a gorgeous color palette, and a Studio Ghibli-esque feel. Tidesong did not disappoint – it’s a charming fantasy adventure with lots of heart.Sophie is descended from a long line of witches who can control the winds and the tides, and she is determined to make her family proud, but the pressure to perform is causing some problems. First, learning the family magic is tough, and her auntie Lan is hard on her. Second, when she goes rogue and tries it on her own, she traps young dragon Lir out of his dragon form and memories. Figuring out how to untangle the mess she’s created will take patience, a change of heart, talking it out, and teamwork.Gosh, this book was cute! It also had solid messages and themes: dealing with family expectations (meeting them, bucking them, going your own way and owning your mistakes!), wanting to learn things right away and having to adapt and slow down when it isn’t easy, and how to respond in a healthy way to intrusive negative thoughts. Sophie is young, and while she thinks she’s ready for life’s challenges, she figures out pretty quickly that she still has quite a way to go. Her aunties Lan and Sage and family friend Eugenia make for by turns stern and supportive mentors, and the family chickens are an effective spy network. If that last phrase made you chuckle, this might be the book for you! It’s got humor and heart, and while the plot is fairly simplistic (no huge plot twists here!), it is worth the read.Of course, I mentioned dragons, and I haven’t gotten around to those yet! The first few pages of the book are a retelling of the legend of how the Wu witches got their power (wouldn’t you know, they are descended from a dragon who fell in love with a fisherman!), and this inclusion at the start of the story sets the stage for a fairy tale- and mythology-tinged tale. The illustrations tell most of the story here – there’s no extended exposition about how the magic in Sophie’s world works, no questions about different magical creatures – they just are, and they are darn cute. Tiny, fluffy chickens with teeth, a mini dragon, and a kappa all steal the show at various points as insanely adorable sidekicks. This was what felt the most like a Ghibli film to me: strange and cute sea and land creatures bobbling about on each page.Let’s talk about that art style! Xu is well-known for her previous graphic novel Mooncakes, and you can expect the same art style in Tidesong, both a bit more refined and a bit more open-feeling, if that makes sense. The cool color palette is appropriate for the setting (the sea! the seaside! an island village!) and the variation in panel sizes, shapes, and bleed on some spreads is evocative of whatever is happening in the story. This is a graphic novel that leans more heavily on imagery than on text, and it is 100% charming.In all, Tidesong is a magical graphic novel with brilliant (and adorable!) illustrations. A must-have for middle grade graphic novel collections.Recommended for: fans of the animated film Ponyo and Molly Knox Ostertag’s The Witch Boy, and readers ages 7 and up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Em",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 9, 2022",
                "reviewTitle": "Cute book",
                "reviewText": "Cute book but the book came already damaged...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}