{
    "remaining_requests": 380,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Powerless-Trilogy-Lauren-Roberts/dp/1665954884",
    "body": {
        "name": "Powerless (The Powerless Trilogy)",
        "price": "$14.12",
        "originalPrice": "",
        "rawPrice": 14.12,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Powerless-Trilogy-Lauren-Roberts/dp/1665954884",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91iRSL6ELDL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lauren Roberts",
            "link": "https://www.amazon.com/Lauren-Roberts/e/B0BSVMG1YY/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 8335,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Lauren Roberts's exciting story thrills with flirtatious banter, cutthroat battles, and searing betrayals...present[ing] a spin on the deadly game trope by incorporating multiple layers of complexity: dual POVs; fathers both admirable and problematic; hints of a love triangle between Pae and two brothers; sexually tense moments with 'a promise of passion'; fierce training and fight sequences enhanced by creative abilities; and an underground Resistance hungry for revenge. Powerless is a compelling tale of darkness and destruction, of a divide carved by a vicious king, and of the lure of freedom, choice, and power.\" -- Shelf Awareness\"As the Trials become increasingly deadly, Paedyn and Kai must reconcile their burgeoning romantic feelings for each other with their respective places in a brutal and discriminatory society...Paedyn and Kai’s alternating POVs skillfully juxtapose steamy romantic encounters with heart-pounding action and gory violence, delivering a tale of political and personal intrigue that capably kicks off an epic trilogy.\" -- Publishers Weekly About the Author When Lauren Roberts isn’t writing about fantasy worlds and bantering love interests, she can likely be found burrowed in bed reading about them. Lauren has lived in Michigan her whole life, making her very familiar with potholes, snow, and various lake activities. She has the hobbies of both a grandmother and a child, i.e., knitting, laser tag, hammocking, word searches, and coloring. She’s the author of Powerless, and she hopes to have the privilege of writing pretty words for the rest of her life. If you enjoy ranting, reading, and writing, Lauren can be found on both TikTok and Instagram @Laurens1ibrary for your entertainment. Excerpt. © Reprinted by permission. All rights reserved. Chapter 1: Paedyn CHAPTER 1 Paedyn Thick, hot liquid runs down my arm. Blood. Funny, I don’t remember the guard nicking me with his sword before my fist connected with his face. Despite being a Flash, he apparently couldn’t manage to move faster than my right hook to his jaw. The smell of soot stings my nose, forcing me to clamp a grimy hand over it to stop a sneeze from slipping out. That would be a very pathetic way to get caught. When I’m sure that my nose won’t alert the Imperials lurking beneath where I’m hiding, I return my hand to the filthy wall my back is currently pressed against with my feet planted opposite me. After taking a deep breath that nearly has me choking on soot, I slowly begin my climb upward once again. With thighs burning almost as much as my nose, I force my body to continue shimmying while stifling the sneeze. Climbing up a chimney isn’t exactly how I thought I would be spending my evening. The small space has me sweating, swallowing my fear before scrambling to the top of the cramped corridor, eager to replace grime-caked walls with a starry night. When my head finally peeks over the top, I greedily gulp down the sticky air, then climb up and over, immediately bombarded with a new concoction of smells far more unpleasant than the stench of soot clinging to my body, my clothes, my hair. Sweat, fish, spices, and I’m quite certain some sort of bodily fluid, blends to create the aroma that surrounds Loot Alley. Balancing atop the chimney, I strain my eyes on the shadowed roof to inspect my sticky arm. I’d nearly forgotten to examine it without the usual biting pain that accompanies a sword slash to remind me. I rip off a strip of cloth from the sweaty tank that clings to my body, dabbing at the gash with it. Adena’s going to kill me for ruining her stitching. Again. I’m surprised when I don’t feel the familiar twinge of pain as I rub at my arm with the rough fabric, impatiently sopping up the stickiness. And that’s when I smell it. Honey. The same honey that belongs to the sticky buns oozing out of the many pockets in my ragged vest and dripping down my arm—mistaken for blood. I sigh, rolling my eyes at myself. It’s a welcome surprise, nonetheless. Even honey soaking my clothes beats trying to wash blood out. I take in a deep breath and look out over the crumbling, run-down buildings cast in shadows by the flickering lampposts dotting the street. There’s not much electricity here in the slums, but the king generously spared us a few lampposts. Thanks to the Volts and Scholars using their abilities to create a sustained power grid, I have to work exceptionally hard to stay in the shadows. Farther from the slums, the more the rows of shops and homes slowly improve in condition and size. Shacks turn into homes, homes turn into mansions, leading up to the most daunting building of all. Squinting through the darkness, I can just barely make out the looming towers of the royal castle and the sloping dome of the Bowl Arena that resides beside it. My eyes flick back to the wide street stretched out before me, scanning the surrounding sketchy buildings. Loot Alley is the very heart of the slums, pumping crime and trade throughout the city. I trace the dozens of other alleys and streets jutting off from it, getting lost in the maze that is the city before offering a sigh and small smile to the familiar street beneath me. Home. Sort of. Technically, a home implies that one has a roof over their head. But stars are far more fun to stare at than a ceiling. I would know, seeing that I used to have a ceiling to stare at every night, back when I had no need for the stars to keep me company. My traitorous gaze sweeps across the city to where I know my former home lies wedged between Merchant and Elm Streets. Where a happy little family is likely sitting around the dinner table, laughing and discussing their day with one another— I hear a thump, followed by the murmuring of voices that drag me from my bitter thoughts. Straining to hear, I can just make out the muffled, deep voice that belongs to the guard I so kindly relieved of his duties a short while ago. “—came up right behind me, quiet as a mouse, and then… then the next thing I know, I get a tap on the shoulder and a fist to the face.” A very irritated and very shrill female voice echoes up the chimney. “You’re a Flash, for Plague’s sake—aren’t you supposed to be fast or something?” She takes a deep breath. “Did you at least get a look at his face before you let him rob me? Again?” “All I saw were his eyes,” the guard mumbles. “Blue. Very blue.” The woman huffs in irritation. “How helpful. Let me just stop every person on Loot to see if their eyes match your vivid description of very blue.” I stifle my snort as something creaks from the other end of the room, followed by a chorus of muffled footsteps. From the groan of rotting wood shifting beneath several new pairs of boots, I immediately deduce that three more guards have joined the hunt. And that’s my cue. I hop off the chimney and grab onto the raised ledge of the roof, swinging my legs over the side to dangle above the street. Blowing out a breath, I let go and bite my tongue against a yelp as gravity yanks me toward the ground. With a soft thud I drop ungracefully into a merchant’s wagon brimming with hay. The stiff straw pokes through my clothes like one of Adena’s pincushions, and a cloud of soot and hay rises on the night breeze when I jump out onto the street. Passing the time by plucking straw from my tangled hair, I begin my journey back to the Fort, weaving through beat-up merchant carts, all abandoned for the night, feet dancing over trash and broken trinkets. Looters slumped against alleys or tucked in between buildings whisper among themselves as I pass. I feel the weight of the dagger tucked into my boot and relax at the comfort of the cool steel as I pass groups of fellow homeless huddling together for the night. I can see the faint shimmer of purple force fields shielding some, while others don’t even have an ability strong enough to allow them to sleep peacefully, which is the exact reason they call the slums their home. I keep my steps swift and sure as my eyes sweep back and forth across the alleys, never letting my guard down. The poor don’t discriminate. A shilling is a shilling, and they don’t care if they jump someone worse off than them to get it. Several guards cross my path as I zigzag down streets, forcing me to slow down to steer clear of them. Every shop, corner, and street has been bestowed the gift of leering, white-uniformed law enforcers. These brutal Imperials have been stationed everywhere along Loot Alley by decree of the king due to an increase in crime. Clearly has nothing to do with me. I slip down a smaller alley, making my way toward the dead end. There, tucked in the corner, is a mangled barricade of broken merchant carts, cardboard, old sheets, and Plague knows what else. Before I’m even halfway to the pile of garbage we call home, a face obscured by wild shoulder-length curls pops up over the Fort. “Did you get it!?” Untangling her long legs from where she sits, she effortlessly stands and phases right through the three-foot wall of our trash barricade without a second thought, and then she’s bounding toward me with so much hope in her eyes that you’d think I’ve offered her a real roof over her head and a warm meal. And though I can give her neither of those things, I do have something far better, in her opinion. I sigh. “I’m offended you doubted me, Adena. I thought you’d have a little more faith in my abilities after all these years.” I sling my pack from my back and pull out the crumpled red silk from within, unable to suppress my smile as a look of awe settles on her face. She greedily claws the silk from my hands, running her fingers through the soft folds of the fabric. Peeking up through the curly bangs hanging in her hazel eyes, she looks at me as though I’ve just single-handedly eradicated the Plague rather than stolen fabric from a woman not much better off than we are. Like I’m the hero and not the villain. Adena’s smile could rival the sun over the Scorches Desert. “Pae, you and your sticky fingers work magic, you know that?” She throws her arms around my neck, pulling me into a crushing embrace that causes more honey to ooze down my vest and pool in my pockets. “Speaking of sticky fingers…” I peel myself from her hug to fish around in my pockets. I retrieve six smashed sticky buns, only slightly unappetizing with the hay now decorating them. Adena’s eyes go wide at the sight before snatching one from my hand just as greedily as she did the fabric. She turns midbite and uses her Phaser ability to stride right back through our fort without a second thought, plopping herself down on the colorless, rough rugs that lie on the inside of the barricade. She pats the spot beside her expectantly, and unlike her, I ungracefully leap over the wall before I can take a seat. “I bet Maria wasn’t too happy about her shop being looted. Again. Poor thing should really up her security,” Adena says between bites, a crooked smile joining the crumbs on her face. Despite my robbing the woman at least once a month for the past several years, she’s still only managed to conclude that I am a he. At least she’s trying. “Actually,” I say with a shrug, “she had two more Imperials stationed around her shop than normal. She must be getting tired of all the stolen sticky buns over the years.” Adena narrows her hazel eyes at the sight of my smile. “Thank the Plague you didn’t get caught, Pae.” As soon as the familiar phrase slips past her lips, my jaw sets instinctively while hers falls open midbite. She visibly cringes, her brow crinkling and throat clearing. “Sorry. Bad habit.” My fingers drift to the thick ring on my thumb, spinning it mindlessly while I muster a weak smile. This topic is one we typically try to avoid, though it’s my fault the subject became suddenly awkward to speak of in the first place. All due to a moment of weakness that I wish I wasn’t so relieved about. “You know it’s not the words that bother me, it’s—” “It’s the meaning behind them,” she cuts in with a smile and a shockingly accurate imitation of my voice. I nearly choke on my laugh and a piece of sweet dough. “Are you quoting me, A?” By way of answering, she takes a bite of sticky bun before declaring between mouthfuls, “And it’s not the Plague that makes you sick. It’s what came after.” I nod slowly while absentmindedly tracing the rug’s worn pattern beneath us, the feeling familiar beneath my finger. The idea of thanking the Plague that killed thousands of Ilyans makes me lose my appetite for even sticky buns. Thanking the thing that caused so much pain and death and discrimination. But all anyone cares about now is who the Plague didn’t kill. The kingdom was isolated for years to keep the sickness from spreading to the surrounding cities, and only the strongest in Ilya survived the disease that altered the very structure of humans. The fast became exceptionally faster, the strong became unbeatable, and those who lurked in the shadows could become the shadows. Dozens of supernatural abilities were bestowed upon Ilyans alone, all varying in strength, purpose, and power. Gifts given as a reward for surviving. They are Elite. They are extraordinary. They are exceptional. “Just…” Adena trails off, poking at her sticky bun while struggling to form words for once. “Just be careful, Pae. If you get caught and aren’t able to talk yourself out of it—” “I’ll be fine,” I state far too casually, ignoring the worry that washes over me. “This is what I do, A. What I’ve always done.” She sighs through her smile, waving a dismissive hand. “I know, I know. You can handle yourself with the Elites.” I feel that rush of relief once again, making me feel both guilty and grateful that she truly knows me. Because not all those who survived the Plague were fortunate enough to be gifted with abilities. No, the Ordinaries were just that—ordinary. And over the next several decades following the Plague, the Ordinaries and Elites lived in peace. Until King Edric decreed that Ordinaries were no longer fit to live in his kingdom. It was over three decades ago when sickness swept through the land. Due to the outbreak of what was likely a common illness, the king’s Healers used the opportunity to claim that Ordinaries were carrying an undetectable disease, saying it was likely the reason they hadn’t developed abilities. Extended exposure to them became harmful to both Elites and their powers, and over time, the Ordinaries were dwindling the abilities Elites are so protective of. I fight the urge to roll my eyes at the thought. My father believed that was bullshit, and I think no differently. But even if I had proof of the king lying through his teeth, it’s not as though a girl from the slums is in any position to be believed. But the king couldn’t allow his Elite society to be weakened, or worse, by mere Ordinaries. Extinction was not an option for the extraordinary. And so began the Purging. Even now, decades later, tales of the bodies that scattered the sand under the scalding sun are casually passed around campfires, scary stories whispered among children. Sticky fingers close over mine, the honey coating Adena’s hands as sweet as the spreading smile she shares with me. My secret is stowed in the glint of her eyes, in the loyalty lining her expression. I’ve spent so much of my life resigned to the fact that nothing would ever be real. Every friendship false, every kindness calculated. “Hide your feelings, hide your fear, and most importantly, hide behind your facade. No one can know, Paedy. Trust no one and nothing but your instincts.” My father’s gentle voice is oddly jarring as it echoes in my head, reminding me that every part of my life should be a lie and the girl sitting before me should be as deceived as the rest of the kingdom. Selfishness only stole my sanity for a single night, but that was all it took for me to endanger the both of us. “All right, enough talk of the Plague,” Adena says cheerily, scanning the alley before adding, “and your… situation.” I don’t bother stifling my snort. “It seems that two years haven’t been enough time for you to practice subtlety, A.” I doubt she even heard me. Doubt she can focus on anything other than the fabric now gliding between her fingers. With hazel eyes scanning over sewing supplies, Adena abandons our previous conversation to ramble about what pieces she’ll be making with the new silk. Her warm brown hands dig through scraps of fabric in the flickering lamplight, beginning to fold edges, pin corners, prick fingers, curse relentlessly. We fall into the type of easy conversation that only comes after spending years surviving on the streets together, making it easy to interpret Adena’s garbled words around the pins pressed between her lips. I roll over, finally falling quiet as I watch her steady fingers and furrowed brow, too engrossed with her work to sleep. A stabbing pain in my side has my drooping eyes flying open, drowsiness forgotten. The jagged stone jutting up from the alley floor has me groggily grumbling, “Mark my words, I’m going to steal a cot one day.” Adena rolls her eyes at me, just as she does every night I make the same empty promise. “I’ll believe it when I feel it, Pae,” she singsongs. I’ve rolled over about a dozen times before a scratchy, balled-up blanket collides with my head. “If you don’t quit your squirming, I swear I’ll sew you to the bloody ground,” Adena says with all the sweetness of a sticky bun. “I’ll believe it when I feel it, A.” Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 12 hrs 51 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A New York Times bestseller! This sparkling edition includes a special case stamping, bonus content, and a teaser to book two in this heart-pounding series! Perfect for fans of Sarah J. Maas, this young adult fantasy follows the forbidden romance between a powerful prince and an ordinary girl as they try to survive their kingdom’s grueling laws pitting them against each other.She is the very thing he’s spent his whole life hunting. He is the very thing she’s spent her whole life pretending to be. Only the extraordinary belong in the kingdom of Ilya—the exceptional, the empowered, the Elites. The powers these Elites have possessed for decades were graciously gifted to them by the Plague, though not all were fortunate enough to both survive the sickness and reap the reward. Those born Ordinary are just that—ordinary. And when the king decreed that all Ordinaries be banished to preserve his Elite society, lacking an ability suddenly became a crime—making Paedyn Gray a felon by fate and a thief by necessity. Surviving in the slums as an Ordinary is no simple task, and Paedyn knows this better than most. Having been trained by her father to be keenly observant since she was a child, Paedyn poses as a Psychic in the crowded city, blending in with the Elites as best she can to stay alive and out of trouble…easier said than done. When Paeydn unsuspectingly saves one of Ilya’s princes, she finds herself thrown into the Purging Trials. The brutal competition exists to showcase the Elites’ powers—the very thing Paedyn lacks. If the Trials and the opponents within them don’t kill her, the prince she’s fighting feelings for certainly will if he discovers what she is…completely Ordinary. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17466"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Simon & Schuster Books for Young Readers (November 7, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 528 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1665954884"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1665954884"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 16+ years, from customers"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 9 - 12"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.25 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1.6 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#155 in Books (See Top 100 in Books) #1 in Teen & Young Adult Dark Fantasy #4 in Teen & Young Adult Fantasy Romance #5 in Teen & Young Adult Sword & Sorcery Fantasy"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 8,335 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b8b14ee-4469-4bc1-8309-8c93119ea28d.__CR0,0,4042,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ff62e4fd-e47a-4492-8f04-d1a0d3ce03e6.__CR0,0,4042,1250_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jenna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI4JLCTKIHFJT6UIYUIJ66UBXOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32KTDK3B1APK5?ASIN=1665954884",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars ⭐️⭐️⭐️⭐️⭐️",
                "reviewText": "You need to read this book. It is SO good. I can’t believe it’s this authors first book 🤯 prior to reading the book I did read some of the reviews, and a common theme was that this book seemed similar to Red Queen and Hunger Games.. which the author has stated those books gave her inspiration on her book… I haven’t read either books but did watch the Hunger Games movies, and yes there were similarities… but this felt different at the same time.There isn’t any spice in this book whatsoever, but omg the tension and angst between the MMC Kai, and FMC Pae, was soooo well written. And even though there was not a single scene with spice, it was not needed with how well written the building of their relationship is. You can totally understand the reasoning for the Pae to hold back, but also feel for how much she wants the Kai…. It’s just so good.This book has the perfect amount of romance AND plot. It’s also dual POV, which I LOVED. My favorite parts were reading in Kai’s POV.There is no insta love in this book, but Kai definitely falls first and hard. He is truly a morally grey character…and the ending 💔 😭🙌🏼Can’t wait for the next book! My only regret is reading it so far in advance to the next book",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brittany DeMauroBrittany DeMauro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF263ZHWTYAJ4JPAP57IEGZYKMZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN4HPYXC65146?ASIN=1665954884",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "4.0 out of 5 stars Captivating YA Fantasy Romance with Skillful Pacing and Engaging Characters",
                "reviewText": "\"Powerless\" by Lauren Roberts is a compelling addition to the young adult fantasy romance genre, offering a blend of deadly trials, well-crafted characters, and a tantalizing slow-burn romance. While the story embraces popular tropes with skillful pacing, it might feel familiar to readers of Hunger Games or Red Queen. Roberts weaves an engaging narrative, introducing us to a world rich in fantasy elements and complexities.The debut novel doesn't shy away from delivering witty banter and tension-filled romance, making it a hit among its target audience. The characters, notably Kai and Paedyn, are imperfectly perfect, adding depth and life to the story. The slow start gradually gives way to a consistent and captivating pace, with the romance unfolding in a deliciously angsty manner.However, some readers may find echoes of The Hunger Games in the early chapters and the Red Queen series throughout, impacting the overall originality. Despite this, the narrative remains enjoyable, laying a solid foundation for the planned trilogy. The predictable ending, though anticipated, carries an impactful twist that leaves readers eager for the next installment.In essence, \"Powerless\" promises an enjoyable journey for romance and young adult enthusiasts. While it may not reinvent the genre, the book's strengths lie in its character complexities, engaging romance, and the potential for an exciting trilogy ahead. Dive into this world of trials and tribulations, and you might find a new favorite series in the making.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81GEMcI2XPL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alla L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWLOME57AVAESEQEUJ6RC73OEFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P1VY1OFIZEJB?ASIN=1665954884",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars 4.75 stars - SO GOOD.",
                "reviewText": "If you're looking for a fantasy book, rivals to lovers, flirting, slow-burn, tension, action, twists and turns, and a fierce MFC and a flirty MMC, then Powerless is for you.I LOVED this book SO. MUCH. It was pretty fast paced for most of it, but what made be take off some points was because the start was kind of slow and it didn't really show why the trials happened, even though you can search it and it's kind of obvious. If you're wondering, it's pretty much to kill the Ordinaries in the kingdom. But this book is so much more. It's a duel point of view, and the characters are amazing. It's funny and romacntic and the tension and flirting between Kai and Paedyn is MWAH. It was literally perfect and had me hooked the whole time. I feel so stupid for not picking up this book before because IT'S SOOO GOOD. I sometimes even got mad at the author (in a good way) because of the twist and turns and THE ENDING. The ending was a twist but not too much, and it was SO SAD too. I felt so many different emotions just WOW. I devoured this book. I first got it from the library but IMMEDIATELY ran to Amazon so I can get my own copy of it. I love this book SO SO SO much and I promise it won't leave you disappointed unless you're used to reading like REALLY REALLY fantasy and slow burn books. Also don't read it if you read Red Queen or Hunger Games. I haven't read either so the plot isn't so bad, but if you did you might find it boring because it's a mix of the plots from both books.Overall I LOVED and DEVOURED this book and I recommend it to anyone that's starting fantasy or YA romance. I LOVE LOVE LOVE this book and just O.M.G. PLEASE READ IT !!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kala",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 5, 2023",
                "reviewTitle": "Now THIS is how you write tension!!",
                "reviewText": "Now THIS is how you write tension!! Hats off to Lauren Roberts for physically having me on the edge of my seat while reading this book. This is an absolutely astounding debut novel, I found myself completely immersed, devouring it in practically one sitting because it was just that addicting!I felt very Hunger Games meets The Serpent and the Wings of Night vibes from the beginning, but don't be fooled, this is a masterpiece all in it's own!!This is a book is truly designed for those who crave a true romantic fantasy, it encompasses every element that I love with a few more that I didn't even realize I needed! As a devout fan of the forbidden love trope, this one hit all the right notes. Paedyn and Kai were utterly captivating, I couldn't get enough of their interactions. The tension and banter were not only fulfilling but also entertaining! There is the perfect combination of action, tension, romance and intrigue to keep the reader hooked the entire way through.Paedyn, as the leading female character, was a force to be reckoned with. Her storyline will have you on her side from the very beginning, she is courageous, tenacious and has a heart of gold! She embodied a refreshing and fun character, and I can't wait to see the twists and turns that this series has in store for her. Kai is intriguing and incredibly charming, his interactions with Pae allowed the reader to feel their palpable chemistry. His own intriguing backstory only adds to the excitement, and I'm eagerly anticipating more of his character's development. We also get to meet a host of side characters, some who I really hope are a larger part of the next part in this series!This book is a must-read for anyone enamored with romantasy! It seamlessly weaves together all of the essential elements while still feeling fresh and unique in it’s own way!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tatiana Kruger",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 15, 2023",
                "reviewTitle": "E celente escrita.",
                "reviewText": "Como assim acabou? Preciso da continuação.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 10, 2024",
                "reviewTitle": "Bien",
                "reviewText": "Ya llagado bien y rápido",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra Bineau",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 5, 2024",
                "reviewTitle": "Bien mais un peu lent!",
                "reviewText": "Après ACOTAR, la relève est dure. Bon récit mais trop lent, slow burn for sure il se passe pas grand chose (1 sur 5). Univers similaire a Hunger games.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ann",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 23, 2024",
                "reviewTitle": "I loved every second of it",
                "reviewText": "I read the book in two nights, recommended this book to my best friend, and she finished it in one day too. That's how good it was! The protagonist Pae is a really stubborn and strong young women, and it's very refreshing to follow her through the world. Peaking into the male protagonists head, Kai, left for a great shift of perspective. The tension the couple has... unheard!I cant wait for the second book and have already preordered.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}