{
    "remaining_requests": 254,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Snowlands-Blood-Moon-Book-1/dp/1737988704",
    "body": {
        "name": "Snowlands: A Blood Moon (Book 1)",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Snowlands-Blood-Moon-Book-1/dp/1737988704",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51sw7BsjWML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41EV7bWJm5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41GFt36esQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41e7MZIlEPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qFB6DIdhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Gy-0qwEjL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Morr Meroz",
            "link": "https://www.amazon.com/Morr-Meroz/e/B09K6PQPPF/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 125,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Sumptuous visuals and intriguing ideas will leave readers hungry for more time in the Snowlands.\" — Kirkus Reviews \"This long-form masterpiece is engaging until the very last panel. The ideas being explored are timeless and nuanced, explored with the impressive grace of a seasoned storyteller. Visually, the entire book is mesmerizing, and the full-page images of dramatic or action-packed moments are standalone works of art in themselves. A vivid, lesson-packed tale of friendship and perseverance, Snowlands is a visual feast, an emotional rollercoaster, and a powerful parable of finding peace with the past.\" — Self-Publishing Review ★★★★★\"Meroz and Fogel give a fully realized graphic novel treatment that creates a satisfying experience.\" — BookLife\"A phenomenal graphic novel that teaches an important lesson about accepting others and loving each other for our differences.\" — Reedsy Discovery\"Snowlands: A Blood Moon has a perfect balance of incredible storytelling, rich artwork, and a stunning conclusion. A tale of the true value of friendship in a world where survival is key is the thrilling start to what I hope will be a long-term series full of exceptional adventure.\" - Literary Titan. ★★★★★ About the Author Morr Meroz is an animation filmmaker, author, the founder of Bloop Animation and The Snowlands Company.After graduating from the School of Visual Arts, Morr worked as a character animator in some of the best NYC studios, such as Framestore, MTV, and Aardman Nathan Love.In 2013, Morr founded Bloop Animation Studios and started producing animated short films. His shorts were screened in film festivals all around the world, including a premiere at the Brooklyn Film Festival. In addition to making films, Morr launched Bloop Animation's educational initiative, which has become a leading animation learning platform with thousands of students that features dozens of courses, tutorials, and guidebooks about animation filmmaking.In 2020, Morr founded The Snowlands Company to create books and graphic novels, including the new Snowlands graphic novel series. His screenplay Snowlands, which this book is based on, is an Academy Nicholl quarterfinalist, a Second Rounder in the Austin Film Festival, and was the top animation screenplay on the Black List.He lives with his family in New York City."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A brand-new, full-color graphic novel series for animal fantasy fans that delivers a daring adventure and a mysterious threat that has animals-prey and predator alike-disappearing. An orphaned white wolf cub exiled from her pack.A lone snow leopard searching for her missing cub.A bumbling wild cat who can't hold a tune. In the midst of a brutal winter in the unforgiving Snowlands, famine plague the wolf pack. As the pack goes hungry, blame falls on Feba, an orphaned wolf cub whose white fur many elders believe is a bad omen. When the wolf pack's cubs vanish into thin air, the pack leaders vote to banish Feba, and perhaps worse. She escapes her fate and runs off into the icy wilderness of the Snowlands. Lost in the treacherous mountains, Feba stumbles upon Usha, a cold and unfriendly snow leopard mother on a personal quest. While Usha wants nothing more than to continue her journey alone, she grudgingly allows Feba and a skittish young mountain cat, Batu, to follow her. With a snowy trail full of deadly obstacles ahead, the unlikely trio sets out to find the Seeress, a magical being Usha hopes can find her missing son. Each step takes Usha, Feba, and Batu deeper into danger where they encounter other creatures-some helpful, some deceitful-and uncover a widespread peril in the mountains, the fate of the missing cubs, and what having a family truly means. Snowlands is an epic tale of survival and friendship full of wild creatures, magical mysteries, and dangerous terrain perfect for middle-grade fans of Erin Hunter's Braveland and Warriors series. \"Meroz's background as an animator shines through in this graphic novel's page-turning action sequences, and artist Fogel and colorist Comodo use their considerable skills to turn desolate landscapes into rich, engrossing images. The numerous adversaries that the main trio of characters encounters are truly sinister, and they're just the right amount of scary for middle-grade readers... Meroz successfully delivers intriguing characters and necessary worldbuilding for a series that promises to be as likable as its lead character. Sumptuous visuals and intriguing ideas will leave readers hungry for more time in the Snowlands.\" -Kirkus Reviews Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3014"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ The Snowlands Company (December 7, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 201 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1737988704"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1737988700"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 9 - 12 years"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.61 pounds"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#281,694 in Books (See Top 100 in Books) #339 in Children's Fantasy Comics & Graphic Novels"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 125 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sesaly Gean",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLOLFHFSRZFY2ZV5BEE7XMTUOOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT9RUTZBKZZ1R?ASIN=1737988704",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Adventure with a touch of spooky",
                "reviewText": "Some of the most fun I’ve had with a graphic novel in years. This story will resonate with anyone who ever felt like they were alone in their struggle, and will be wildly entertaining on the way. The themes are somewhat simplified and will be easily understood by young readers, but the story and characters pull no punches.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "krissycus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCTYLCTPXKWQQB432RQYWCKLYQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CWB8JBO18UBI?ASIN=1737988704",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Great, me and my 8 year old brother loved it",
                "reviewText": "It was so cool! I know some people think it is \"dark\" and \"graphic\", and I can see why they think that, but really it isn't that bad. My little brother read it when he was 8 and he didn't have a problem with it. Feba and her friends where amazing and I really hope there is a book two!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phil Bolos",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWTHDBUDDCQQG5K3RUZUC7UUAQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26MZB8IQHCXYU?ASIN=1737988704",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 7, 2022",
                "reviewTitle": "5.0 out of 5 stars Perfect for elementary age readers",
                "reviewText": "Snowlands: A Blood Moon (Book One) by Morr Meroz is a fantastic fantasy graphic novel for young readers. Feba, a young wolf cub, has been banished from her pack because her white coat is viewed as a bad omen. To make matters worse, the sheep have vanished and now members of the pack are vanishing as well. Alone in the wilderness, she befriends a wild cat and a snow leopard. The three of them each have their own missions, but they must come together if they are going to solve the mysteries they are surrounded by.The images and the characters are perfect for kids who are near the end of elementary school through middle school. I read this with my daughter, who is 9, and she really liked it. She was drawn to the characters because she liked the types of animals that were chosen, and she really wanted to know what was going to happen next because the story was engaging. This is probably too much for a read aloud with younger kids, and older ones may find it too childish, but fourth and fifth grade is probably a great target age for this.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V.E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWVK4NFK2BSN2ZMZ6ORLT26APQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SQFLYRHU6FF5?ASIN=1737988704",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2022",
                "reviewTitle": "5.0 out of 5 stars Fun Read",
                "reviewText": "Snowlands: A Blood Moon (Book One) by Morr Meroz (Author), Collin Fogel (Illustrator) is a well-put-together graphic novel that will appeal to kids between the ages of 9-12. The story itself is captivating and unique told through the eyes of animals. The illustrations are absolutely gorgeous and lovely to look at over and over. This is definitely a challenging tale with themes of survival and friendship. While overall a pretty benign read, there are elements of violence that may not be suitable for younger children. A solid adventure story and a great start to this series. Recommended.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KMB13",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQVWHUL4IHFBE3LYAWS67T4N3CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G5TVF2IO1Y67?ASIN=1737988704",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2022",
                "reviewTitle": "4.0 out of 5 stars A Tale of Survival and Friendship",
                "reviewText": "I recently read Morr Meroz's “Snowlands: A Blood Moon (Book One),” and I was impressed by the depth and beauty of the writing. Set in a post-apocalyptic world, this graphic novel follows the journey of a trio of animals looking for the Seeress to find Feba’s missing cubs.Meroz does an excellent job of weaving a complex and engaging story that is filled with conflict, heartache, and hope. His characters are all unique and compelling, from the fierce, brave Feba to other seductive Snowlands characters. Snowlands a thrilling and satisfying read with beautiful illustrations and people who feel real and believable.Snowlands is an impressive achievement. In this first installment, Morr Meroz has created a fascinating and engrossing world, and I can't wait to see what he does with the story in future books. The Kindle version is difficult to read because of the small print, but if you're looking for an exciting, thought-provoking read with well-developed characters and a captivating plot, then Snowlands: A Blood Moon (Book One) is the perfect choice.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J Armstrong",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5SVF75UQNN6QAO26PIT7XHA63Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UVK2CC60NRMQ?ASIN=1737988704",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 8, 2022",
                "reviewTitle": "5.0 out of 5 stars My 9 year old loved it",
                "reviewText": "three animals become unlikely companions on a journey to seek help in a brutal winter full of dangers both near and far. A snow leopard, a white wolf and a wild cat all seek something, from recognition, to a missing cub, these three band together through their journey and learn that differences can make for the strongest bonds.My 9 year old loved it, she devoured it in a day and told me the illustrations were the best part, followed by the characters of which Reba was her favorite. The illustrations in the back were a treat as well. She already asked me if there would be a second book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew Aaron RosenbergMatthew Aaron Rosenberg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGVIOAXQFO3C7U455FIIZWNEZSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38M7FWYFE8WLV?ASIN=1737988704",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 9, 2022",
                "reviewTitle": "5.0 out of 5 stars High Quality Graphic Novel",
                "reviewText": "I bought this graphic novel for my 10-year-old nephew. The book arrived and is of high quality. For one, it is larger than a lot of the graphic novels I bought my daughter. A little less than the size of a MacBook laptop. I haven't read the entire book as I want it in new condition for my nephew but I looked through most of it. The illustrations are great. The story is adventurous and has plenty of characters to meet. There is some violence so I would keep that in mind for younger kids. Overall a great graphic novel for 4th grade and up depending on the reader.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71dw5gAFHQL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheddar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7FWHEGGIHLFX6JEM62HDPHGRRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EIOZ2Z7OQ8D4?ASIN=1737988704",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Heartwarming and artistically engaging",
                "reviewText": "I really enjoyed this book! The story is feel good without being saccharine and the art is engaging and well done throughout the entire 200 and some pages. My only complaint is there doesn't seem to be a book two.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pierre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 10, 2022",
                "reviewTitle": "Captivating",
                "reviewText": "I highly recommend this book. Interesting story, well written and very nice drawings. Many thanks to the author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Bagley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 21, 2022",
                "reviewTitle": "An excellent graphic novel",
                "reviewText": "I have enjoyed this graphic novel very much.Clean line work and beautiful artwork. Looking forward to seeing more of this series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}