{
    "remaining_requests": 343,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Poppy-War-Novel-R-Kuang/dp/0062662589",
    "body": {
        "name": "The Poppy War: A Novel (The Poppy War, 1)",
        "price": "$12.31$12.31",
        "originalPrice": "",
        "rawPrice": 12.31,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Poppy-War-Novel-R-Kuang/dp/0062662589",
        "soldBy": {
            "sellerID": "A8146B9Q816MQ",
            "name": "Martistore",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A8146B9Q816MQ&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71ZVpkRIGsL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "R. F Kuang",
            "link": "https://www.amazon.com/R-F-Kuang/e/B0788VXRHP/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Martistore",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 17357,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “The best fantasy debut of 2018...This year’s Potter.” — Wired“I have no doubt this will end up being the best fantasy debut of the year [...] I have absolutely no doubt that [Kuang’s] name will be up there with the likes of Robin Hobb and N.K. Jemisin.” — Booknest“The “year’s best debut” buzz around this one was warranted; it really is that good.” — B&N Sci-fi and Fantasy Blog“A thrilling, action-packed fantasy of gods and mythology...The ambitious heroine’s rise from poverty to ruthless military commander makes for a gripping read, and I eagerly await the next installment.” — Julie C. Dao, author of Forest of a Thousand Lanterns“A blistering, powerful epic of war and revenge that will captivate you to the bitter end.” — Kameron Hurley, author of The Stars are Legion“In The Poppy War, RF Kuang draws on history and myth to tell a relentlessly unforgiving story of war, vengeance, power and madness, with larger-than-life characters that evoke sympathy and rouse terror. Brace yourself.” — Fonda Lee, award-winning author of The Green Bone Saga“Battles. Bloodshed. Drugs. Amazing, amazing characters. Read it!” — Peng Shepherd, author of The Book of M“An original and engrossing tale of the coming of age of a talented young soldier amid the horrors of invasion and genocide.” — Anna Stephens, author of Godblind“A powerful, emotional journey, compellingly written.” — Adrian Tchaikovsky, award-winning author of The Children of Time“Debut novelist Kuang creates an ambitious fantasy reimagining of Asian history populated by martial artists, philosopher-generals, and gods [...] This is a strong and dramatic launch to Kuang’s career.” — Publishers Weekly“The narrative is an impactful, impressive symphony of words that grant life to this incredible morality tale. Setting the stage for an epic fantasy is an understandably enormous undertaking, but Kuang does an exceptional job of world and character building.” — RT Book Reviews (4 1/2 stars, Top Pick!)“The book starts as an epic bildungsroman, and just when you think it can’t get any darker, it does [...] Kuang pulls from East Asian history, including the brutality of the Second Sino-Japanese war, to weave a wholly unique experience.” — Washington Post“[The Poppy War is] strikingly grim military fantasy that summons readers into an East Asian–-inspired world of battles, opium, gods, and monsters. Fans of Ken Liu’s The Grace of Kings will snap this one up.” — Library Journal (starred review)“This looks like a good match for readers of Red Rising.” — Omnivoracious (10 Highly Anticipated New Science Fiction and Fantasy Books)“The Poppy War is a masterful piece of fiction.” — S. Qiouyi Lu for the B&N Sci-fi & Fantasy Blog“A young woman’s determination and drive to succeed and excel at any cost runs into the horrors of war, conflict and ancient, suppressed forces in R. F. Kuang’s excellent debut novel, The Poppy War.” — The Skiffy and Fanty Show“Kuang ambitiously begins a trilogy that doesn’t shy away from the darkest sides of her characters, wrapped in a confectionery of high-fantasy pulp. [...] The future of Rin in this world may appear quite dark, but that of the series seems bright indeed.” — New York Daily News“A complex, sprawling, ambitious novel, part coming of age and part tragedy of power, that uses motifs and influences from the 20th century. It reminds me tonally of Lara Elena Donnelly’s Amberlough and Joe Abercrombie’s Half a King, [and] in setting of K. Arsenault Rivera’s The Tiger’s Daughter.” — Tor.com“A complex, challenging, and incredibly ambitious novel.” — Vulture (The 10 Best Sci-Fi and Fantasy Books of 2018)“If you have read and enjoyed George R.R. Martin’s A Song of Ice and Fire, or Sabah Tahir’s An Ember in the Ashes then you are likely to enjoy this.” — Sammy’s ShelfThis Summer’s Hottest New Books For Every Type of Reader — Popsugar“I can safely say that this will be the finest debut of 2018 and I’d be surprised if it isn’t one of the top 3 books of the year full stop. Spectacular, masterclass, brilliant, awesome [...] Simply put, R.F. Kuang’s “The Poppy War” is a towering achievement of modern fantasy.” — Fantasy Book Review“This isn’t just another magical, fantasy world with artificially fabricated stakes. Rin’s journey and the war against the Federation feel incredibly urgent and powerful [...] R.F. Kuang is one of the most exciting new authors I’ve had the privilege of reading.” — The Roarbots“[THE POPPY WAR] feels entirely immersive and rich in a way that kind of sucks you in [...] It’s a treasure trove.” — Utopia State of Mind“The Poppy War was a fun, engrossing, journey to a world I wish I could visit and a school I wish I could attend. With its strong characters, interesting world building, and intriguing plot it is a great read that I would recommend to anyone.” — The Quill to Live“The book kicks arse, and I couldn’t put it down. It’s a cracking debut, and one I recommend without reservation.” — Sci-Fi and Fantasy Reviews“This novel has already rocketed up to the top of my list of favorite fantasy reads of all time. It was everything I wanted and more.” — The BiblioSanctum From the Back Cover Peasant. Student. Soldier. Goddess.When war orphan Rin aced the Keju—the Empire-wide test to find the most talented youth to learn at the academies—she surprised everyone: test officials, the guardians who wanted to marry her off and further their criminal enterprise, and even herself.But being a dark-skinned peasant girl from the south is not easy at Sinegard, the most elite military school in Nikan. Targeted by rival classmates for her color, poverty, and gender, Rin discovers that gods long thought dead are very much alive, and that she possesses a lethal, unearthly power—an aptitude for the nearly mythical art of shamanism that could be the weapon the empire desperately needs.While Nikara is at peace, its enemy and former occupiers, the Federation of Mugen, bides its time . . . and a Third Poppy War is just a spark away. Rin’s shamanic powers may be the only way to save her people. Yet as she discovers more about the god that has chosen her, the vengeful Phoenix, she fears that winning the war may cost her humanity.And it may already be too late. About the Author Rebecca F. Kuang is the #1 New York Times and #1 Sunday Times bestselling author of the Poppy War trilogy, Babel: An Arcane History, and Yellowface. Her work has won the Nebula, Locus, Crawford, and British Book Awards. A Marshall Scholar, she has an MPhil in Chinese Studies from Cambridge and an MSc in Contemporary Chinese Studies from Oxford. She is now pursuing a PhD in East Asian Languages and Literatures at Yale, where she studies diaspora, contemporary Sinophone literature, and Asian American literature. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 3 hrs 1 min",
            "FREE delivery February 27 - 29 on orders shipped by Amazon over $35",
            "Or fastest delivery February 26 - 28",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Monday, February 19. Order within 12 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“I have no doubt this will end up being the best fantasy debut of the year [...] I have absolutely no doubt that [Kuang’s] name will be up there with the likes of Robin Hobb and N.K. Jemisin.” -- BooknestA Library Journal, Paste Magazine, Vulture, BookBub, and ENTROPY Best Books pick!Washington Post \"5 Best Science Fiction and Fantasy Novel\" pick!A Bustle \"30 Best Fiction Books\" pick!A brilliantly imaginative talent makes her exciting debut with this epic historical military fantasy, inspired by the bloody history of China’s twentieth century and filled with treachery and magic, in the tradition of Ken Liu’s Grace of Kings and N.K. Jemisin’s Inheritance Trilogy.When Rin aced the Keju—the Empire-wide test to find the most talented youth to learn at the Academies—it was a shock to everyone: to the test officials, who couldn’t believe a war orphan from Rooster Province could pass without cheating; to Rin’s guardians, who believed they’d finally be able to marry her off and further their criminal enterprise; and to Rin herself, who realized she was finally free of the servitude and despair that had made up her daily existence. That she got into Sinegard—the most elite military school in Nikan—was even more surprising.But surprises aren’t always good.Because being a dark-skinned peasant girl from the south is not an easy thing at Sinegard. Targeted from the outset by rival classmates for her color, poverty, and gender, Rin discovers she possesses a lethal, unearthly power—an aptitude for the nearly-mythical art of shamanism. Exploring the depths of her gift with the help of a seemingly insane teacher and psychoactive substances, Rin learns that gods long thought dead are very much alive—and that mastering control over those powers could mean more than just surviving school.For while the Nikara Empire is at peace, the Federation of Mugen still lurks across a narrow sea. The militarily advanced Federation occupied Nikan for decades after the First Poppy War, and only barely lost the continent in the Second. And while most of the people are complacent to go about their lives, a few are aware that a Third Poppy War is just a spark away . . .Rin’s shamanic powers may be the only way to save her people. But as she finds out more about the god that has chosen her, the vengeful Phoenix, she fears that winning the war may cost her humanity . . . and that it may already be too late.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Harper Voyager; Reprint edition (April 23, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 544 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0062662589"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062662583"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.1 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 0.87 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,634 in Books (See Top 100 in Books) #37 in Asian Myth & Legend #61 in Historical Fantasy (Books) #551 in Epic Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 17,357 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Poppy War The Dragon Republic The Burning God Babel Yellowface The Complete Poppy War Trilogy Boxed Set A powerful historical military fantasy, inspired by the bloody history of China’s twentieth century and filled with treachery and magic. Rin’s story continues in this acclaimed sequel to The Poppy War—an epic fantasy combining the history of twentieth-century China with a gripping world of gods and monsters. The exciting end to the Poppy War trilogy, R. F. Kuang’s acclaimed, award-winning epic fantasy that combines the history of twentieth-century China with a gripping world of gods and monsters, to devastating, enthralling effect. The instant #1 New York Times Bestseller from the author of The Poppy War that grapples with student revolutions, colonial resistance, and the use of language and translation as the dominating tool of the British empire. A chilling and hilariously cutting novel about identity, white lies, and ambition from R.F. Kuang, the #1 New York Times bestselling author of Babel. From R. F. Kuang, the #1 New York Times bestselling and award-winning author of Babel and Yellowface, this collection features all three novels in her historical military fantasy trilogy!",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cdbf8770-e217-4cc8-be94-00b1c5101068.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9dab93bd-657a-4cd4-af36-d149a58a49e9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fe4db0aa-a358-47f6-9cbe-a20082bdb936.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/753c3647-568b-4697-90b6-5380200ba124.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a8368cc-ee08-49f6-b55e-d1e4368a7ed0.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/24d1b04f-20dd-40d7-846f-33cc36ed8237.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/869723f5-ba29-428a-ad3d-c9286196577a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/79c32c63-b5b8-42d0-983c-8ff874e730cd.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/33ecf62a-d2f2-4679-aca7-b85905266a60.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a5463d31-ef4a-473f-b569-c2ead38902d2.__CR0,0,400,800_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7170470e-c2e9-4fa8-8493-7cdc9ef94a1c.__CR18,0,369,738_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "aizietaiziet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTS6HQ5Q4PN4DDQNHSQ2Q2FYKEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36APQXUA0D0WA?ASIN=0062662589",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars I'm speechless",
                "reviewText": "\"𝒀𝒐𝒖 𝒇𝒊𝒏𝒊𝒔𝒉𝒆𝒅 𝑻𝒉𝒆 𝑷𝒐𝒑𝒑𝒚 𝑾𝒂𝒓 (𝑻𝒉𝒆 𝑷𝒐𝒑𝒑𝒚 𝑾𝒂𝒓, #𝟏). 𝑾𝒉𝒂𝒕’𝒔 𝒏𝒆𝒙𝒕?\"𝑵𝒐 𝑮𝑹 𝒆𝒎𝒂𝒊𝒍 - 𝑰 𝒅𝒊𝒅𝒏'𝒕 𝒇𝒊𝒏𝒊𝒔𝒉 𝑻𝑷𝑾. 𝑰𝒕 𝒇𝒊𝒏𝒊𝒔𝒉𝒆𝒅 𝒎𝒆 😭☠️I want to praise this book but I have no eloquent words for it. FRTC?This coming-of-age military fantasy has plenty of v*olence (vividly gruesome scenes), so please be aware of this before you pick it up. Also - dr*gs..TPW is inspired by the Second Sino-Japanese War, sparked by a dispute between Chinese and Japanese troops, that escalated into a full-scale invasion. In 'Note from the Author' Kuang provides several titles/resources that introduces us to historic events between these countries. Some events that were written (like scenes from Golyn Niis, battle at Khurdalain) portray very real things that happened. Very little was made up.There was no time for me to be bored and I inhaled chapter after chapter like there's no tomorrow. War is not romanticized. And I'm glad for this brutality.Funny thing is, before I picked up this book (and I had bought the trilogy a while ago), I knew I would be enthralled by this. I don't know why. I knew it would make an impact on me and I can't wait to delve into the next 2 books (sadly after my current arcs). But man oh man, what a memorable book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LA in Dallas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4AGB3JJOROF4KGTO62ONBLTS4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P483PP2S6UDX?ASIN=0062662589",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "4.0 out of 5 stars A quarter turn towards revenge fantasy",
                "reviewText": "Last year I began a review of Guy Gavriel Kay's All the Seas of the World with these words:How to describe Guy Gavriel Kay's books? He is a genre of his own. His novels live somewhere between fantasy and historical fiction. He has borrowed the words \"a quarter turn to the fantastic\" from a reviewer to describe it.I was mistaken. Kay is not alone. R.F. Kuang's The Poppy War is a fantasy with a similar relationship to history as Kay's. There are many valid reasons to dislike or feel uneasy about this approach to historical fiction. Kay has eloquently explained his approach in an essay entitled \"On the Strengths of Fiction Done as Near-History\". I find it persuasive.Now, Kuang is not as self-aware as Kay. But The Poppy War was her debut novel, while Kay has been publishing novels since 1984. Without attributing Kay's thoughts to Kuang, it is not unreasonable to read Kay's essay with The Poppy War in mind and ask oneself how well it works as an explanation. I think it works well.The Poppy War is divided into three parts. Part I is a story you have read a hundred times before: the poor kid who somehow gets into a school for rich kids, is looked down on by almost everyone, but somehow through merit or spirit or plain intelligence transcends her underdog status. This one is a little more brutal than the average, but not outside the usual range.Parts II and III are the most recognizably historical. They are based on events of the Second Sino-Japanese War, most obviously the Battle of Shanghai and the Nanjing Massacre, and also on later events of World War II. The Nanjing Massacre was, no exaggeration, one of the most horrible things to happen in human history, so expect the story to become very, very dark. My title refers to The Poppy War as a revenge fantasy, because it feels to me as if Kuang is getting revenge for the horrors the Japanese inflicted on China. As an American, I also recognized a US World War II event. You will, too, and it will be obvious to you that Kuang intended it.Overall, I thought this was a good story, brutal but honestly so. I am not sure if I will continue with the series.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kerri McDonald",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM3EV7ZIFW7ACLC3MGJREER4XGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYFN1X5XROF59?ASIN=0062662589",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2020",
                "reviewTitle": "5.0 out of 5 stars This book destroyed me",
                "reviewText": "“When had she last been this scared? Had she felt this paralysis, this numbing dread before she stepped into the ring with Nezha two years ago? No, she had been angry then, and proud. She had thought she was invincible. She had been looking forward to the fight, anticipating the bloodlust. That felt stupid now. So, so stupid. War was not a game, where one fought for honor and admiration, where masters would keep her from sustaining any real harm. War was a nightmare.\"By now, I’m sure most people who are even remotely a part of the bookish community have heard about The Poppy War. This book came out in 2018 and has been talked about pretty much non-stop ever since! It appeared on my TBR after a severe case of FOMO had me adding a bunch of book community darlings on Goodreads. And there it sat… collecting dust and shaming me as I continued to pick up different, newer books. That was until I joined a buddy read with some awesome bookish folks on Twitter! It was just the push I needed to finally give this book a go and see if I would like it.Y’all. This book destroyed me. I was in such a book hangover after finishing it that I barely got through three other books in October. It was a struggle! After all that waiting, I finally realize why everyone was raving about this story!We’re following a young war orphan named Rin, who is in the care of drug dealers who use her to help them with their seedy business. When they decide to force Rin into an arranged marriage, she decides that she needs to GTFO. She starts studying for the Keju, a test used throughout the Empire to pick people to send to the numerous academies. Rin figures if she gets a good enough score, she can escape to an academy instead of being stuck in a marriage she does not want. Well, not only does she receive a good enough score, she aces the test and is sent to the most prestigious academy in the entire country: Sinegard. Once there, she has to fight against prejudice, her classmates, and her own mind to prove she’s more than what she seems.I always have issues writing reviews for my five star reads. All I want to do is scream at everyone to read the book! Of course, a lot of people already have read this book, so I suppose I should try and be a little more coherent 😂 So let’s try breaking this down into the main things I loved about this book. Besides everything.First, the writing. Oof, the writing! Talk about being captured in a narrative through beautiful writing alone! I’m not talking about purple prose… there’s nothing purple about Kuang’s writing. I’m talking about writing that flows and twists in such a way that you soon find yourself lost in the pages. There are so many quotable passages that it took me forever to pick a favorite! I just loved everything about her prose. It made the pages fly by! That and the incredible pacing. I was kept on the edge of my seat even when nothing particularly exciting was happening. I was so wrapped up in Rin’s development and her journey that even her running up and down a mountain with a pig on her back seemed fascinating, lol.Speaking of Rin, can we talk about how R.F. Kuang crafted such compelling characters??? I’m honestly in awe. Not only Rin, but Jiang and Kitay and Nezha and Altan and all of them practically leap off the page! Rin makes a lot of… questionable choices, but I connected with her so much. I was completely invested in her journey. I felt her anger and I felt her pain. I wanted to shake her and I wanted to hug her all at the same time! She’s just such a dynamic and vibrant character who will pull you even further to the world. And, as I said, the characters that are pulled into her orbit are equally brilliant and intriguing. They all have such depth and color that they can’t help but shine! I haven’t been so invested in a bunch of fictional characters in quite some time.Last, let’s talk about the world-building. I love when an author can weave the world-building into the story so that it doesn’t feel like you’re reading a textbook. R.F. Kuang managed this throughout The Poppy War. You learned about the world almost subconsciously, picking up tidbits of information as Rin goes on her journey from the Rooster Province to Sinegard to war. It made it really easy to fall into the world and lose yourself as you read. It made the scenes come to life in my mind, vivid and bloody and haunting. And I think this is the main reason I had such a massive book hangover! I was so trapped in the world that every other book I picked up felt boring and flat in comparison. Makes me nervous to finish the sequel, The Dragon Republic, this month before all the other books I’m reading…Overall, this book is incredible and I cannot wait to continue the series! Even if I’m scared to do so at the same time 😅😂",
                "reviewVotes": "46 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew T. Owens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSRLS4TYALPWYNKMX32TCDUWYPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3J1A9XJFCXJ97?ASIN=0062662589",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "3.0 out of 5 stars the poppy war",
                "reviewText": "looks like part history part fantasy chinese adventurestarts in ordinary life till shes summoned to a advanced military school where Rins life picks up some interesting experiences .the war part pf the story is dangerous and not something anyone should want to be a part of.be wary reader.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Prom",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "It was an amazing book",
                "reviewText": "I’m shocked at how easily I was hooked, but I can’t believe how this book was nothing I thought it’d be",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 20, 2023",
                "reviewTitle": "Llego sin daños y excelente libro.",
                "reviewText": "Llego en muy buenas condiciones, y se ve tal y como en las fotos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenny",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 23, 2024",
                "reviewTitle": "Unexpectedly stunning",
                "reviewText": "A gorgeous book with a great cover, nice font, and good-quality paper.The story took me by surprise in the best possible way—more graphically violent than I expected but it truly adds to the world building.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 21, 2023",
                "reviewTitle": "Super",
                "reviewText": "Livre en bon état",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amaranth",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 11, 2023",
                "reviewTitle": "Ganz klare Empfehlung",
                "reviewText": "Ich habe selten ein so gutes Buch gelesen. Wer auch mit graphischen Beschreibungen von Gewalt klar kommt sollte dieses Buch unbedingt lesen",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}