{
    "remaining_requests": 365,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Me-Moth-Amber-McBride/dp/1250833035",
    "body": {
        "name": "Me (Moth)",
        "price": "$9.99",
        "originalPrice": "$12.99",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Me-Moth-Amber-McBride/dp/1250833035",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91hcKDk0FtL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Amber Mcbride",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Amber+Mcbride&text=Amber+Mcbride&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 230,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review FINALIST FOR THE 2021 NATIONAL BOOK AWARD FOR YOUNG PEOPLE'S LITERATURE2022 Coretta Scott King John Steptoe Award for New Talent WinnerA 2022 Willam C. Morris YA Debut Award FinalistA BookPage Best Book of 2021A Best Book of 2021, Shelf AwarenessAn NPR Best Book of the Year, 2021A School Library Journal Best Book of 2021A Time Magazine Best Children's Book of 2021People magazine's Best Children's Books of 2021 \"This searing debut novel-in-verse is told from the perspective of Moth, a Black teen whose life changed forever the day a car crash killed her family. ... Each free verse poem is tightly composed, leading into the next for a poignant and richly layered narrative. The story builds softly and subtly to a perfect, bittersweet ending. Fans of Jacqueline Woodson won’t be able to put this one down.\"―School Library Journal, starred review\"McBride artfully weaves Black Southern Hoodoo traditions with those of the Navajo/Diné people, creating a beautiful and cross-cultural reverence for the earth, its inhabitants, and our ancestors. ... Written in verse, this novel is hauntingly romantic, refusing to be rushed or put down without deep contemplation of what it means to accept the tragedies of our lives and to reckon with the ways we metamorphosize as a result of them.\" ―Booklist, starred review\"If you think you know where this story is going, think again. Me (Moth) will surprise you.\" ―BookPage, starred review\"Written in gorgeous verse, Moth's painful story of heartbreak, connection, and learning to love again unfolds, thanks to a soul connection with cool guy Sani.\"―Girls Life Magazine\"With unmatched lyrical writing and a powerful plot, McBride is an absolute must-read author.\"―Buzzfeed\"Two years after a devastating car accident killed her family as they drove from New York to northern Virginia, aspiring dancer Moth, the Black granddaughter of a Hoodoo root worker, is still navigating the accident’s fallout... When a new student―talented Navajo musician Sani―shows up in her junior homeroom class, Moth finds a kindred spirit whose similarly painful past and physically abusive stepfather compound his depression.\" ―Publishers Weekly\"Recommended. McBride writes Moth’s narration in spare, wistful free verse that reads like Francesca Lia Block in poetry or a fragile, emotional E. E. Cummings; Moth’s pain at being “the guilty girl who lived” is keen and haunting, and the frequent evocation of her grandfather, a spiritual rootworker, adds a supernatural flavor. ... Readers may not see the poignant final twist coming, but it’s a satisfying climactic development that will leave them dabbing their eyes and turning to their own art in hope and gratitude.\" ―Bulletin of the Center for Children's Books (BCCB)\"Me (Moth) holds you like a gentle haint, pulling you in and out of song, and dance, and dreams until you are not sure where reality ends and memory begins. Amber McBride in her young adult debut has written a marvelous novel in verse full of ancestor wisdom and love that traverses crossroads that we must navigate to live.\"―Joanne V. Gabbin, Director, Furious Flower Poetry Center About the Author Amber McBride estimates she reads about 100 books a year. Her work has been published in literary magazines including Ploughshares and Provincetown Arts. Her debut young adult novel, Me (Moth) was a finalist for the National Book Award, and won the 2022 Coretta Scott King/John Steptoe Award for New Talent, among many other accolades. She is a professor of creative writing at University of Virginia, and lives in Charlottesville, Virgina."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 12 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "FINALIST FOR THE 2021 NATIONAL BOOK AWARD FOR YOUNG PEOPLE'S LITERATUREA debut YA novel-in-verse by Amber McBride, Me (Moth) is about a teen girl who is grieving the deaths of her family, and a teen boy who crosses her path. Moth has lost her family in an accident. Though she lives with her aunt, she feels alone and uprooted.Until she meets Sani, a boy who is also searching for his roots. If he knows more about where he comes from, maybe he’ll be able to understand his ongoing depression. And if Moth can help him feel grounded, then perhaps she too will discover the history she carries in her bones.Moth and Sani take a road trip that has them chasing ghosts and searching for ancestors. The way each moves forward is surprising, powerful, and unforgettable.Here is an exquisite and uplifting novel about identity, first love, and the ways that our memories and our roots steer us through the universe. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17466"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Square Fish (January 10, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 256 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250833035"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250833037"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12 - 17 years"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL750L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.3 x 0.8 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#115,672 in Books (See Top 100 in Books) #60 in Teen & Young Adult Ghost Stories #228 in Teen & Young Adult Coming of Age Fiction #382 in Teen & Young Adult Fiction on Girls' & Women's Issues (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 230 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Catherine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUN2D5ANARQUEMUSSDRR4OF3FGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34YVQICYNA9T7?ASIN=1250833035",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Haunting Story",
                "reviewText": "Me (Moth) by Amber McBride was published in 2021 and is a novel in verse. The poems are incredibly beautiful.This story combines Hoodoo and indigenous spirituality, which I found interesting.Moth lost her family in an accident and has stopped dancing. She lives with her aunt but feels invisible in her new home and at her new high school until she meets Sani - a boy who is struggling to live in his own skin.Their road trip will change everything they thought they knew.When I finished this book, I decided to read it again in order to understand their journey better. This is a hauntingly beautiful story.“Grandfather used to say, We light candles because they are lighthouses for the spirits of our ancestors to come sit with us.We give offerings out of respect.But what of other light? Like a sea turtle moving toward spotlit pavement instead of the moon-rippled sea.Who will answer for the sin of it being easy to get lost when so many orbs mirage the illusion of brightness?” (20).The cover art is incredible and this book won the Corretta Scott King award. If you want a touching yet haunting story of grief, you may enjoy this book. Ages 13 and up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claire",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2V7ZQ5SLZ2XONSUEQL6RR5SHYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19JGIIKKDGAD1?ASIN=1250833035",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful book",
                "reviewText": "I loved this book. The prose/verse is full of imagery. The story is thought-provoking, with the intertwining of native-American legends and spirituality. The characters evoke emotional attachments throughout their journey. The book is classified as YA, but this 72-year old was captivated by this saga.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynn Thurber",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5AMKDY64ARYCJX7BKYQNUV6SDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NHE0LDZ1DKBN?ASIN=1250833035",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 2, 2023",
                "reviewTitle": "4.0 out of 5 stars The Hidden Moth",
                "reviewText": "I have never worked harder to squeeze meaning from verse in my life. Strong images that must be dealt with on each page. Lovely cover that drew me in but did not fit the images of the main character in the end. All this work that meant dust in the ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bun Bun's Book Pick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECUCYREXWHONSJWFBTUIA7UUVAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VG8FKYNSO7ND?ASIN=1250833035",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2023",
                "reviewTitle": "5.0 out of 5 stars So Unexpected...",
                "reviewText": "What can I say about this book...Whew! The ending was cataclysmic! I did not see that coming! It was so beautiful though-- the poetry was lyrical and it dances in your mind for a long time afterwards. I think what really worked for me was the amazing use of white space and using poetry to tell a story. This book would not have worked in prose in my opinion. It literally HAD to be told like this.When I attended the Virginia Book Festival last year, McBride did mention that her editor(?) wanted her to turn it into a verse novel and that was the greatest decision to make. I just ordered her other novel, \"We Are All So Good At Smiling\". Such talent!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy G. Davis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXELELUL5MWLRIDJ4SCZ3C7NJDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DEKKPUXJKB62?ASIN=1250833035",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 17, 2021",
                "reviewTitle": "5.0 out of 5 stars Not a read, an experience!",
                "reviewText": "You don't just read Me (Moth), you experience it. Lyrical, haunting and wise, Me (Moth) is full of twists not only of the plot, but of the heart and mind, and left me deeply moved.And like its two characters Moth and Sani, Me Moth does not fit easily into typical categories.I had never read a novel in verse before, and thought maybe this would make the story harder to follow. But Amber McBride's literary artistry was not only a delight to savor, but her story flowed with flawless clarity. I felt many chapter verses could stand alone as elegant poems.Me Moth is a meaningful, magnificent story, and a treat for the soul. Highly recommended.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMPJQ4Q33OXGDJVR6NF24WK2VSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQGLFB9CHK4QE?ASIN=1250833035",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 22, 2022",
                "reviewTitle": "5.0 out of 5 stars So beautiful that I took my time.",
                "reviewText": "This story was so beautiful that I kept needing to stop and absorb before I could continue reading. I bought this on sale having never heard of it (but awed by the e-sample), and although usually I don't care, this time I'm glad it wasn't spoiled for me. I am not, generally, a poetry person. I'm delighted I made an exception.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGB5BOOCNQ4HLBKIOID46YYKSLSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34IZVEE4LUNZS?ASIN=1250833035",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 9, 2022",
                "reviewTitle": "5.0 out of 5 stars If you love beautiful langauge & stories that touch your heart this is your book",
                "reviewText": "Looking for something to read in YA? If you love poetry with beautiful language, you love romance, healing, learning a bit about spirituality (Black & Indigenous), & family bonds with a touch of magic, try Moth by Amber McBride. Teens will love it & so will adults.If you like this book try Laura Ruby's Bone Gap. If you liked Bone Gap, you'll like this book too.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dre'ya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBKXDSTXSB3HEGH6ZZWLMH4UNVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TOM4VMSZJNQJ?ASIN=1250833035",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 23, 2022",
                "reviewTitle": "4.0 out of 5 stars This Reads Different",
                "reviewText": "When I initially started reading I felt like I was reading poetry in a story format. It was a little confusing because I developed so many questions while reading; however, it all came together at the end. It's a different read, has a good storyline and it captures your attention.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}