{
    "remaining_requests": 163,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fire-Flesh-Novel-ebook/dp/B0BQ77BJFR",
    "body": {
        "name": "A Fire in the Flesh: A Flesh and Fire Novel",
        "price": "$7.99",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fire-Flesh-Novel-ebook/dp/B0BQ77BJFR",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Gg3GddBGL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jennifer L. Armentrout",
            "link": "https://www.amazon.com/Jennifer-L-Armentrout/e/B004E5J5N0/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 8963,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From #1 New York Times bestselling author Jennifer L. Armentrout comes book three in her beloved Flesh and Fire series…The only thing that can save the realms now is the one thing more powerful than the Fates.After a startling betrayal ends with both Sera and the dangerously seductive ruler of the Shadowlands she has fallen madly in love with being held captive by the false King of the Gods, there is only one thing that can free Nyktos and prevent the forces of the Shadowlands from invading Dalos and igniting a War of Primals.Convincing Kolis won’t be easy, though – not even with a lifetime of training. While his most favored Revenant is insistent that she is nothing more than a lie, Kolis’s erratic nature and twisted sense of honor leave her shaken to the core, and nothing could’ve prepared her for the cruelty of his Court or the shocking truths revealed. The revelations not only upend what she has understood about her duty and the very creation of the realms but also draw into question exactly what the true threat is. However, surviving Kolis is only one part of the battle. The Ascension is upon her, and Sera is out of time.But Nyktos will do anything to keep Sera alive and give her the life she deserves. He’ll even risk the utter destruction of the realms, and that’s exactly what will happen if he doesn’t Ascend as the Primal of Life. Yet despite his desperate determination, their destinies may be out of their hands.But there is that foreseen unexpected thread—the unpredictable, unknown, and unwritten. The only thing more powerful than the Fates…",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BQ77BJFR"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Blue Box Press (October 31, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 31, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2920 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 632 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,247 in Kindle Store (See Top 100 in Kindle Store) #17 in Paranormal Vampire Romance #25 in Vampire Romances #64 in Romantic Fantasy (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 8,963 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/f74c139e-23d0-49a5-8307-b911188c358b.__CR0,0,3880,1200_PT0_SX970_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/bb43af9b-efc7-478d-8e2e-f30bd03b6409.__CR0,0,3880,1200_PT0_SX970_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/1e7f1c56-9ea4-4be1-bb68-df2d36492763.__CR0,0,3880,1200_PT0_SX970_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/72deed7d-5657-4988-8288-bb3d890ba301.__CR0,0,3880,1200_PT0_SX970_V1___.jpeg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Rachel McDonald",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5UPE4T2GAEE4KO3O4VWUDGYLKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NSZUMAX103Q3?ASIN=B0BQ77BJFR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Pick a Pretty Poppy and…",
                "reviewText": "Every time I think JLA has exhausted her shocking twists in the plot line twisting through the Flesh and Fire series and the Blood and Ash series, she goes and proves me wrong! This book, once again, managed to blow my damn mind! And of course, it was absolutely incredible! Definitely the longest book, I think, of the series, it took me a full day and night of dedicated reading to get through the entire thing. But I ate up every bit of it. I never want these books to end. If they could go on forever, I’d be totally happy! The world encompassing both series is so amazing, and I love the characters and plot lines. This book gets Sera where we knew she had to be, but it did it in a way I absolutely adored!This book picks up with Sera in Kolis’s clutches. He’s tried to kill her to take the embers of life, only for Sotoria to stir and stop him. When Nyktos arrives to save Sera, things end up going badly. Very badly. Ash is imprisoned, while Sera is given her own public cage. Forced to interact with Kolis, who now believes her to be the woman he thinks he loves. She has to try to force herself to metaphorically don the veil once more, letting go of what she wants for the greater good. And to find a way to free Ash. But Kolis is…unhinged? Not right in the head? Disturbed? All of the above! The man is obsessed with a woman he killed, ripped from peace, abused, and forced to stay with him. He thinks that is love, but he truly has no concept of what love actually is or how it works.The first half of the book was similar to The War of Two Queens, in that Nyktos is out of commission. Sera is with Kolis during this time, and it truly tests her in new and horrifying ways. Kolis has no understanding of how to care about someone, or the concept of consent. Leaving Sera deeply afraid she’s going to be unable to put him off long enough to free both Ash and herself before Kolis tries to get intimate with her. In the meantime, she’s forced into awful situations within his court and with him directly. Sera’s always been a strong character, one able to kick ass easily. Who is never truly afraid. But we get another side to her here. A deepening of her character. We see what does make her afraid, and how she handles that. She struggles to go back to the hardened vessel she once was, fighting herself as she wants to truly live now, as she never got to before. Ash has helped her to realize how messed up she was treated and how she deserves so much more, and now she has to face that struggle again with Kolis. As hard as her time with Kolis is to read, it’s definitely important for her character growth as well as the plot itself.This is really the fist we get to interact with Kolis, outside his weird dream death threats to a literal child. And holy FFFFF!! The revelations!! We learn some stuff about Sotoria that completely blew my mind! Especially for what it means for the rest of the series! But finally getting to see how deranged Kolis’s thinking is, how pathetic his justifications and his sad boy want to be loved for the insane person he is…was fantastic. He works as a perfect villain. His larger backstory is objectively tragic. And I loved Sera having to grapple with that. The fact that he has reasons, and they could even have been good reasons once upon a time, but they were now too twisted, too far. And just because an abuser has reasons doesn’t take away from the harm they cause. I can’t wait to see how he’ll have changed over so many years in the main story timeline.Nyktos is largely absent from the first part, but he makes up for that by making quite the entrance after! His sheer determination and refusals to let anyone treat Sera like she isn’t the most important thing is so adorable. He puts her above the fate of all the realms, and who doesn’t want a man who will do exactly that?! I loved all of his and Sera’s scenes together. I truly hope we get more of them being a solid couple, because they’re just as cute as Poppy and Casteel! (Or…almost as cute!) We also get some intriguing revelations from Ash! Things that once again blew my mind. JLA manages to always surprise me in the best ways! But seeing how determined he was to save her, what we learn after the fact…it all just made my heart melt!We see time ticking slowly down. Sera’s on limited time with her ascension drawing ever closer. She’s in a dangerous position, and trying to come to peace with her fate. Even if others refuse to accept it. Now, her goal is to get the embers into Ash and Sotoria figured out before time runs out. There are some seriously heavy emotional scenes thanks to this! I cried for a solid fifteen minutes reading a whole section. But, ultimately, as this is a prequel, while we don’t know how things will go down—we do know what will go down. And I was so excited to see this happen. I wanted to see how we go from a girl trained to fight and kill—a girl some in the Shadowlands scorned for her original plans—to the Queen of the Gods.And oh boy, did we get exactly what I wanted! I was nervous she’d wait to leave it on a cliffhanger with Sera just waking up, as was done in A Soul of Ash and Blood, but thankfully it continues a bit past that! I think it needed to be different. We want Poppy and Sera’s stories to rhyme, but not be exact copies. This was perfect. And I loved how Sera’s POV was shown during her transformation. All the info being dumped into her head like where eather comes from, the ancients, and so much more. It seems like she has all the pieces necessary to put together what is going to happen with Poppy in the future. I loved all the small hints to this, to both Poppy and Cas really. And it was fantastic seeing both of their ancestors were in on this!There are of course the side characters as well. I really enjoyed Raihn in this book. He came so far and literally even made me cry! (JLA loves ripping out our hearts and stomping on them for good measure! But she always makes it up to us!) We didn’t get a whole lot of the others who live in Ash’s court, but we did get more of Attes and a new character. I loved having more Attes! It just feels like having more Casteel and I love that so much! Then there’s, of course, Callum. The horrible rev we hate from Blood and Ash. We get a shocking reveal for him as well! And now I’m more intrigued by his character in the present. His motivations and actions. He seemed so genuine in his words and the emotion behind them, that I couldn’t help but believe him. But how that ties into the present? Especially with the revelation we get before this about a certain pretty poppy…Is he just that far gone? Or is something else going on? I need to know!I’ll talk as vaguely as I can about the big climax. First, Sera kicks some serious ass and I love her so much. Then, Ash rips my heart to pieces as he refuses to budge. His very clear love for Sera, contrasted against his kardia being removed, has always been interesting. And here, we get some solid answers. Revelations, like I said before! But before that, we get the most gut wrenching scene! I cried so hard over these two! I couldn’t take what was happening even knowing the end result. And that is some damn good writing!!! JLA manages to make you somehow fall even more in love with her characters. More and more with each book that comes out in this world. Ash and Sera managed to sneak their way even higher up my list of favorite couples in fiction, for sure!I truly can’t recommend this book, and the overall series (both of them) enough. The world is phenomenal and I wish I could just always stay in it. I would read these books over and over forever if I could! The plot surrounding the embers of life, Sera, Nyktos, and Kolis (not to mention Sotoria!), is amazing. The characters are deep and intriguing and you can’t help but love or hate them passionately. They have layers you want to dig into and see what makes them truly tick. The surprises and revelations in each book manage to somehow never stop! JLA always outdoes herself with each installment. If you aren’t reading this series yet…what are you doing?!",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kimberly Michelle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5Q3SVHX52RVMZPFPFJOQZLV4GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17C0HELIKG0AL?ASIN=B0BQ77BJFR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "4.0 out of 5 stars Fun, Spicey, and Maybe a bit too long…",
                "reviewText": "I looked forward to this book for MONTHS, so I’m not happy I needed to give it three stars. I’ve read many reviews trying to see why others felt the way they did, but my irritation seems to be mine alone… so I’m going to talk about it.This book takes place exactly where the second book ended. Sera is with Kolis. Nyktos/Ash is there and trying to kill everyone. It’s some beautiful action and I enjoyed it. We then get 63% more book with Sera being Kolis’s prisoner. So, if you haven’t read the book yet, know 65% isn’t our main couple together. You’re also going to get 0 moments with Reaver or Jadis and 3 or 4 moments of dragon daddy Nektas.Before I get into spoilers, I would like to discuss how much I really enjoyed the first two books. Ash is one of my favorite male leads. He’s dreamy and sexy. Sera is also an Aelin (ToG) from top to bottom. She’s beautiful and knows it. She’s good at killing and knows it. She swaggers and seduces all males who look upon her. And she has a tragic destiny where she’s basically promised to die to save the world. Sound like Aelin? Yep. The plus about Sera is that she isn’t obsessed with clothing and dramatic flair and is never convinced she can lead and entire army with no experience before reaching adulthood. I’m not saying I didn’t enjoy Sera… just that I’ve read her character a few times.Either way, I still loved the first two books. I enjoyed the world. I enjoyed almost all of the side characters. I even enjoyed the banter filled romance.I went into this one with high hopes. What I wanted to happen: Kolis has Sera, but she manages to escape at about 25% of the book, she then saves Ash around 40%, they make a real plan to take down Kolis with the help of our wonderful side characters, Kolis is imprisoned or something around 90%, and then we get 10% setup and tension for the next book. This is NOT what we get, so here comes spoilers.******* SPOILERS *******Kolis has Sera because Attes handed her over. Attes explains he did this for the greater good and acts like he has a very interesting history with Sotoria (the girl Sera pretends to be and the soul she has inside of her with her own - dual souls and no one noticed).Ash wants to save Sera by killing Kolis. Attes tells Sera neither of them can die or the world ends and so Sera distracts them causing Ash to be captured and stabbed repeatedly going into stasis (coma).Sera decides pretending to be Sotoria but with zero memories is a very solid plan to seduce Kolis to kill him. Sera though can't keep her mouth shut in any situation she doesn't agree with and so her and Kolis fight constantly while she repeatedly tells him she just wants him to love her. Kolis buys this very shallow story but his right-hand-man/revenant Callum, who happens to be Sotoria's little bro, does not.As a reader, you know she's faking it, but it's also written so poorly to keep us from ever questioning her obsession with Ash we wonder constantly why Kolis is even entertaining her lies. Yes, we are told he isn't \"right in the head\" many many times, but he isn't written as a moron.During her time with Kolis and fighting him on everything he punishes her. This punish ranges from an almost rape scene Sera keeps telling everyone is nothing (which as a rape survivor seems legitimate) to mild torture to forced snuggles. Some of the scenes are so gross I can't deal with it and others just made no sense to me. Everyone else's reactions also seemed terribly written especially Attes who keeps saying Sotoria is just the most important thing ever... he didn't kick up a fuss over the abuse? Okay.Like I said above, this is 65% of the book. Yes, the author throws in back story... especially a lot of info to try and force sympathy for Kolis. (This upset me. I understand villains aren't just one dimensional evil characters. I also understand no reason is good enough for forced rape, murder, killing his brother's wife, baby killing, etc. Kolis deserved zero forced sympathy!)We also find out Sera needs the star, but the reader gets beaten over the head with the fact it's right above Sera's head her entire imprisonment and she's too stupid to realize it... but then Kolis shows it to her, gets upset it shows her him killing his Brother and tries to rape her again. THIS is when she FINALLY uses the power we've all known she has. (She was even told to use this power chapters ago!!!!!)She incapacitates Kolis, frees Ash, and everything is wrapped up from the entire book! I'm not kidding. Every single piece of side drama fixed in two chapters. Kolis is stabbed and sleeping. Ash is back to being Ash. The star is in hand. The previous primal of life's soul is freed. Sotoria's soul is removed from Sera. Bam! Done!Then we get one small chapter (37) with a bundle of side characters saying goodbye to Sera so she can go be killed by Ash. Very touching.Turns out Ash does love Sera. We all knew this. The only one who didn't was Ash. He decided he isn't killing Sera, just almost, then ascends her against her will. Then talks to her while she's sleeping.Sera sleeps. Sera wakes up from dreams of everyone talking and her seeing her animal form with two twin cubs. She then feeds from Ash and they have a great deal of sex.I know we read these books for the smut, but this is actually why I rated this book so low.Damn near five chapters of almost nothing but feral sex or sex acts. Dear god, this book just had a universe changing action take place and these two just curl up to do it. I know they've been through a lot. I know they have big feelings. I know Ash is very well equipped and Sera is glorious to look upon, but this was one time I desperately wanted to know what was happening in the world. I know the next book will go into the world and what is happening, but if you're on the brink of war and you've been asleep for days why aren't you getting up and doing something or anything?!?!?Maybe I'm just negative, but I felt this was an insane choice, even for a just-okay written fantasy novel.The last chapters, we find out nothing much. We get a tiny Kingdom of Ash moment of plants growing. We get a lovely moment of vulnerability and honesty from Ash and then more lying from Sera. It's a rather crappy ending.Am I going to read the next book? Yes. I'm going to read the next book AND I think it's going to be awesome. This book was a filler book and it could have been a novella. I still really enjoyed Ash and a lot of things, but the good moments did NOT weigh out the tons of repetitive useless moments. Fingers crossed the next book goes well! If it's worse, I will give up on this author. (Which I know won't affect anyone at all.)",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 9, 2023",
                "reviewTitle": "Perfeição",
                "reviewText": "QUE AUTORA PERFEITAAAAAAAAA NÃO ERRA QUASE NUNCA. Obrigada por esse livro maravilhoso, incrível e deliciosooooooooooooooooooo. Mal espero pelos próximos volumes",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julie M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 31, 2023",
                "reviewTitle": "A 5-star read that kept you glued through it all!",
                "reviewText": "I have no idea how to start this review and it’s often the case when it comes to Jennifer L. Armentrout’s (JLA or Jen) books. I swear while reading this one, I wanted to throw it as much as I wanted to hug it. After finishing this one, I could understand the need to be a 4th book because I can’t imagine how big it would have been considering we know quite a few things still needs to happen.Well, I’ll go with my usual disclaimer: if you haven’t read the previous books in the Fire and Flesh series, please do not read this review since it’s a big possibility that spoilers from the previous books will be mentioned. Also, I recommend highly to go read them if you haven’t read them because along with the Blood and ash series, it is my favorite JLA book series.The book continues where the previous one left us and honestly, from this moment to the next, there is not a boring moment. Even the fillers in this book are filled with information that you know will be useful later on in this series or the other.Honestly, I didn’t know what I was expecting when I went into this book because I knew that with Sera now being captured by Kolis, this book wasn’t going to be a walk in the park, and I was right as much as I was wrong.Jen has a way to make you feel through the characters even the ones you don’t want to. The way she wrote Kolis is something that I wasn’t expecting. I liked that I was surprised that I could feel things for him other than hatred (though still the strongest and main feeling hahaha).Sera’s strength in this book is once more shown throughout the whole book. I honestly felt for her through it all; from her fears to her determination, she powers through even in moments of doubts. I feel like this book is really the epitome of what Sera was always meant to realize she could do.Sera and Ash’s bond is so strong and as much as I would like to add more than this simple sentence, I feel I’m about to spoil something, but yeah, these two are just a new level of chemistry.And so many reveals are in this book and my mind was blown quite a few times through my reading. Some of them were something I wasn’t expecting at all, and I love that. I love how I am always surprised with these books.So much is said and done in this book and I feel like a lot of what’s to come in the blood and ash series were hinted in this book and as much as I would like to believe that I am good figuring them out (FYI I am not :P), I feel like whatever my mind can come up with, Jen will find a way to surprise us again by adding her own special twist into them.Overall, this book is a 5-star read and I’m just waiting on the fourth book now because I know a lot has happened in this one, but since she had to add another book; I feel we need to be ready to what else she’s going to put us through to get to the end of this series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kerstin Henning",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 19, 2023",
                "reviewTitle": "Superschnell",
                "reviewText": "Das Buch wurde super schnell geliefert, sehr zur Freude meiner Tochter, die sehnsüchtig auf die Fortsetzung gewartet hatte.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aleksandra",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Poland on November 19, 2023",
                "reviewTitle": "Absolutely incredible, JLA is definitely one of my favorite authors, I love this book!",
                "reviewText": "A Fire in the Flesh is the third and second to last book in the adult fantasy romance Flesh and Fire series by Jennifer L. Armentrout and I’m so obsessed with this series, these books are absolutely amazing!AFITF was my most anticipated release of this year and I literally cried when I got this ARC. Now, 2 rereads and countless hours spent thinking about this book later, I still can’t find words to describe how incredible this book is and how much I love it. This book picks up right where ALITF left and I don’t want to spoil anything, but like always you can expect a fascinating world building (we get to see so many new places and I loved it), perfectly paced plot, mind blowing plot twists, lovable characters and, of course, a beautiful romance.And speaking of romance… I already knew it, but after this book Sera and Nyktos are definitely at the top of my favorite bookish couples. These two are just so perfect for each other and I loved every single of their moments together, how they always supported each other and how they began to acknowledge their feelings more in this book. They grew a lot since the first book, both individually and as a couple, and it’s amazing to read about their journey and experience it alongside them. I love these two so much!We finally get answers to so many questions we’ve been asking since the first book in this series (and also FBAA series), but with everything we learn here, there are so many new questions I now have and need to know the answers ASAP. I had a lot of theories, and while some of them turned out right, it’s funny how wrong I was at times and JLA once again proved she is a genius because everything makes perfect sense and is even better than I thought.While reading I laughed, cried, wanted to throw my iPad across the room and then cried some more and finished this book in one sitting with the biggest smile on my face and ready to experience it all again. This book and the whole series is a masterpiece and I already can’t wait for the fourth and last book. I definitely recommend AFITF and the whole F&F series!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lila",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 16, 2023",
                "reviewTitle": "Nuovo capitolo superbo nella storia di Sera e Ash",
                "reviewText": "È stato un viaggio doloroso. Forse sono io troppo sensibile in questo periodo, ma questa parte della storia di Sera e Nyktos mi ha discretamente distrutto.I temi trattati sono difficili e in alcuni casi decisamente triggeranti (abuso, violenza, manipolazione tra quelli per me più duri). Gestiti bene ed elaborati, ma che comunque si sono portati dietro emozioni intense.A differenza della serie principale, che inizialmente mi aveva coinvolto maggiormente, alla fine di questo libro credo che questo spin off sia più maturo, meno \"leggero\". Non perché nella saga principale non ci siano temi importanti e ben sviluppati ma perché qui mi sembrano più intensi. Forse l'autrice stessa ha trovato la voce giusta per raccontarli e renderli più realistici.Pensavo, tra l'altro, fosse l'ultimo libro e inveve scopro che il 7 maggio ne esce un altro, questo sì ultimo di questa serie. E sì, non vedo l'ora di scoprire quali nuove vette emotive mi farà toccare quest'autrice che ho snobbato per anni 🥹(Comunque Nyktos >>>> Casteel, non lo credevo possibile e invece...😍)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}