{
    "remaining_requests": 162,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Heir-Frost-Storm-fantasy-romance-ebook/dp/B0CDQFPBPX",
    "body": {
        "name": "Heir to Frost and Storm: A steamy MM fantasy romance (Court of Broken Bonds Book 2)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Heir-Frost-Storm-fantasy-romance-ebook/dp/B0CDQFPBPX",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Yxk9X1XEL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ben Alderson",
            "link": "https://www.amazon.com/Ben-Alderson/e/B075TH23X1/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 178,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CDQFPBPX"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Second Sky (November 10, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 10, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3184 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 480 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#35,993 in Kindle Store (See Top 100 in Kindle Store) #63 in LGBTQ+ Fantasy Fiction #199 in Gay & Lesbian (Kindle Store) #231 in LGBTQ+ Fantasy (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 178 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Luciferian Reficul Satanas Morningstar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7R5NHD54B3D7OUTIINDACPUNOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37LEJEU2Y4AG?ASIN=B0CDQFPBPX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Not disappointed by the losses",
                "reviewText": "I’m gonna say I’m actually pretty relived that the main character keeps losing loved ones, so now he only has 2 people in that entire world that he loves. So many tragic deaths, his father, his mother, his world seems to get smaller and smaller. And I like that, call me a villain, a heartless monster. But I like when its streamlined like that, no more distractions, now he can focus all his energy on his boyfriend and his best friend that’s basically his sister. It works out better this way, plus all the other people had betrayed him in some way and I can’t stand betrayal. His mother lied, his father went along with it. Too many lies and betrayals, they needed to go.And with the story getting more interesting, its about time. Tho I am disappointed he didn’t bond with Oribon himself, I was expecting that and was disappointed it didn’t happen. I’m definitely buying the the third book, since I’ve been waiting for Max and Sim to actually get together for basically 2 books now.I’m still upset they did my man Cam like that, I still liked him more than Sim. But what can you do",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5J5ZJMI46J6ITBMQANSS5FZ2LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17AG9A8EPDCDL?ASIN=B0CDQFPBPX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Series",
                "reviewText": "So much fun. Great pacing that makes you want to keep reading to know what happens next. Can’t wait for the third book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina Wilson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5GM7VJXLNYU2SLJX65OOJTLEUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JZJ8BOAEPLIC?ASIN=B0CDQFPBPX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "4.0 out of 5 stars Like an old school high fantasy",
                "reviewText": "One of the greatest joys of following Ben Alderson's books from his earlier works to now is seeing how much he has grown as an author, and it is ever more apparent in Heir to Frost and Storm. I hesitate to call it a fun book, necessarily, because it hit on a few topics that felt a little close to home given the general state of the world over the past few years, but I meant it when I said that it felt like one of those old school fantasy books that we all grew up reading and adoring.Max is the quintessential fantasy hero, born to a great destiny but raised from nothing and fighting to find his way in the world. My complaint about him in the first book was that he was largely too wishy-washy about his wants and feelings, so it was great to see him finally have things he wanted to achieve and protect and actually stand up for himself throughout the course of this book. He grows throughout the story and by the end, leading into the finale coming with book three, we can see a genuine fantasy hero rising.Simion is just a precious bean of a character. I don't know how else to put it, y'all. He's sweet and needs to be protected at all costs. He's just the perfect fantasy love interest of old; magical and supportive and mostly just there to be good for Max. I'm excited to see where his story goes with the finale because he is fun.Leska and Bea and all of the other secondary characters also get their time to shine in this book. As with book one, it's hard to know who to trust throughout the story because truths and alliances are constantly shifting, but I found it much less frustrating this time around because at least we had a set Big Bad from the very beginning. And it's fun seeing how it all ramps up to that reveal at the end, leading into the final book!I'm genuinely excited to see where the next book goes (and with that stunning cover to boot!) and to see how Alderson continues to grow from here.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa Tobleman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLIXJ7HVEA5NAUPE3CYVJE7SB5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25MHMC80VDH40?ASIN=B0CDQFPBPX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars wow two five star books in a row",
                "reviewText": "I can not begin to explain how excited I was to see this was finally released. And yet I delayed reading it because well. Second book syndrome. I was worried book two would not level up and be just not quite as good as book one was. Nope. This one manages to pull, entice, cajole, giggle (it’s used several times to memorable effect), and wrench emotions. There are still dragons, phoenix minions, bitter mages, and not sure a better description can be used than star crossed lovers to describe Max and Simion. There is mild spice in this book (it’s more than just kissing but isn’t just endless pages of ahem. So maybe two spice packs of five?) but get your tissues ready. And maybe a pillow to punch. Because yeah this book made me feel all the feels and now I need a fluffy book and a large mug of coffee. So yeah go read book one, then book two and then we can sit for a bit and contemplate in that place a really good story leads you to.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE26JPAUP5BR7AEGAEYBOH4GYXWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BMCQNYLCJXD8?ASIN=B0CDQFPBPX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars You Must Read",
                "reviewText": "This series has been a refreshing find with a fantastic story that builds and keeps you reading through the twists and turns. Cannot recommend it enough. Thank you Ben Alderson for bringing this world into ours for the readers to enjoy I cannot thank you enough",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Flerdherd",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7KQVVOWCRCAB26T7BYSXGBHSNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R69EI8ZEIXOZ?ASIN=B0CDQFPBPX",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "3.0 out of 5 stars Weird Read",
                "reviewText": "I forget that I struggle with liking this series. The protagonist, Max, is very unlikable and a huge coward. He spends the majority of the books running away from all the logical answers to his problems until they become life or death situations for everyone around him. It makes it very hard to root for him. It also makes it unlikely that the levelheaded Simion, his lover, would put so much faith in his decision making when all Max does is lie, throw temper tantrum‘s and ignore obvious red flags. The writer also tends to seem to lose details when it comes to action sequences. It feels like everything is very coherent until something very important happens and suddenly The writing is damn near abstract and you feel like you have no idea what just happened no matter how many times you reread the paragraph. I’m hoping the third book shows a braver more likable Max, and we don’t lose out on the details in what is sure to be a showdown.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caleb James Cardosa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWVXYEXYS6ED56V7JC2LORHCO6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QJFTH7ELEXE3?ASIN=B0CDQFPBPX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Even better than the first",
                "reviewText": "This book takes everything from the first and just makes it even better. More dragons, more twists, and more romance! Can’t wait for the next one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RhiRhi 28",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 16, 2024",
                "reviewTitle": "The adventure just keeps on getting better!",
                "reviewText": "Fantastic book, I am absolutely loving this series and the writing is brilliant, it completely draws you in and a real page turner. I personally would have liked to have seen a bit more of Camron, more of his story, and explore the bond and relationship between him and Max before his demise and gaining forgiveness/peace, or potentially it could have been fun to have Camron be the God he's been transformed into and needed in the fight against Lilyth, that he isn't the mad monster Max once thought and explore more of the love triangle storyline? That's just my preference, this does not take away how brilliant this book and series is, it would make a fab tv series. Adventure, heartbreak, love, intrigue, action, this series has it all! On to the next book xxx",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samantha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 12, 2023",
                "reviewTitle": "So worth the read!",
                "reviewText": "I have never binged two books faster! I love the fantasy, romance and aura these books hold and the second book so did not disappoint, I can’t wait until book 3 😍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scarby_Doo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 12, 2023",
                "reviewTitle": "A whirlwind of emotions",
                "reviewText": "Ben Alderson has such a magical way with words. Both his character and world creation are beautiful. I felt every high, every low, every love and every heartbreak in this book.The pace was quite slow to begin with but then the book rocketed into a fast pace and thrilling ride. I experienced so many emotions on this roller coaster of a ride I think I’m suffering from vertigo.Max is a brilliantly written character who experiences guilt, anxiety and loss in such a relatable way it makes him more identifiable. His relationship with Simion is something I live for, despite the fact I was definitely team troubled prince, but I can’t wait to see how they progress in book 3.Questions were answered. More questions arose. Problems were solved. More problems arose. There were twists and turns. Betrayal and deception. Love and loss.If you love dragon trials, mages, elemental magic, m/m love interests and trust no one feels then I highly recommend this trilogy. If you don’t then just read them anyway because they’re incredible.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yvonne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 5, 2024",
                "reviewTitle": "This series as got whole lot better",
                "reviewText": "Following Max whilst he goes on an emotional journey. I have just calmed down after a rollercoaster of a read. The story was brilliant, with every step Max made whether it was for the trial or finding love had me gripped. The story was descriptive and made me feel that I was there. I do not want to give any spoilers but read it you will not be disappointed. Roll on book three",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wesley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 12, 2023",
                "reviewTitle": "I cried, I laughed, I pained, I LOVED",
                "reviewText": "Wow, wow, WOW. It has been ages since a book has affected me deeply and I am a devourer of them.This author's ability to make you connect to characters, emote through and with them is unrivaled!Just when you think you know or at least come to grips with an emotion/plot, he ruthlessly stabs you and then has the audacity to twist the knife!I can't count the number of times I put the book down and vowed I would not continue, only to be back at it a second later (I now totally get Max's inability to stop reading Cameron's diary lol)My one gripe and it's tiny is to reduce it to a steamy romance as a headliner. It does this masterpiece a disservice I feel. It is so much more!!!I cannot wait for the next instalment!!! To anyone reading this if you've got over my dramatics 😊 read this book. I cannot recommend it enough.Mr Alderson..... WOW and thank you!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}