{
    "remaining_requests": 169,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Snowflake-Method-Advanced-Fiction-Writing/dp/1500574058",
    "body": {
        "name": "How to Write a Novel Using the Snowflake Method (Advanced Fiction Writing)",
        "price": "$11.99 $11.15",
        "originalPrice": "",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Snowflake-Method-Advanced-Fiction-Writing/dp/1500574058",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61C8gyWzFUL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Randy Ingermanson",
            "link": "https://www.amazon.com/Randy-Ingermanson/e/B001IXMD5S/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Zoom Books Company and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 2370,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for the Advanced Fiction Writing series\"How to Write a Novel Using the Snowflake Method is a quick and easy read that demystifies the intimidating plotting process. Ingermanson's simple step-by-step instructions will have struggling writers everywhere saying, 'Bazinga! Who knew it could be this easy?'\" -- Becca Puglisi, bestselling author of The Emotion Thesaurus\"Ingermanson has acquired a huge following for his own unique method of planning a novel, which he calls \"The Snowflake Method.\" In this book he develops his system more fully. And his clever method of doing so is to present it in the form of a fairy tale, in which an imaginary, aspiring author in a writing class is learning the method as she goes. If you're a writer having trouble knowing how to develop your ideas into a cohesive and compelling novel, then you should definitely get this imaginatively written how-to guide. How to Write a Novel Using the Snowflake Method may be one of the best cures for \"writer's block\" ever published.\" -- Robert Bidinotto, bestselling author of the Dylan Hunter thrillers series\"Writing gurus come and go, but there will always be Randy Ingermanson at the center of that small universe of those who enter this arena. With his Snowflake approach having become an enduring and universally-valued window into the way stories are built, Randy has the unique claim to having changed the game for writers while raising the bar for aspiring teachers, as well.\" -- Larry Brooks, bestselling author of Story Engineering\"Randy's snowflake method has helped tens of thousands of writers formulate their ideas and get their thoughts on paper. With an engineer's precision, he pinpoints specific principles that identify weaknesses in stories and guides you through a process to solve them.\" -- Steven James, bestselling author of Troubleshooting Your Novel\"Randy Ingermanson knows the terrain of structure, and is a sure-footed guide to the mountain regions of solid, salable fiction.\" -- James Scott Bell, bestselling author of Write Your Novel From the Middle From the Author In the summer of 2002, one of my author friends asked what metaphor described my novel-writing process.I sat down and drilled out a quick list of the steps I use to write a novel. I used the metaphor of the \"Snowflake fractal\" that I learned when I was a PhD student in the UC Berkeley physics department back in the 1980s.Writing down my \"Snowflake Method\" took me about 30 minutes. It changed my life--and the lives of countless writers around the world. Tens of thousands of novelists have found inspiration from the Snowflake Method. Many of them have gotten published, and some have written bestsellers or won awards. People often tell me the Snowflake Method \"feels like magic.\" Let's be clear. It doesn't make you more creative. You already are creative. The Snowflake Method just guides you on what to be creative on next. About the Author Randy Ingermanson wants to teach you how to write excellent fiction. Randy is an award-winning novelist and he's become famous around the world as \"the Snowflake Guy\" in honor of his wildly popular Snowflake Method of writing a novel.Anyone can write a novel and get it published. The hard part is learning how to write fiction that sells ... and sells. If you've been dreaming since forever of writing a novel, make today the day you take action. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 19 mins",
            "FREE delivery March 1 - 7 on orders shipped by Amazon over $35",
            "Or fastest delivery February 29 - March 5"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A Magical Key to Unlock Your Creative WizardAre you writing a novel, but having trouble getting your first draft written? You’ve heard of “outlining,” but that sounds too rigid for you. You’ve heard of “organic writing,” but that seems a bit squishy to you.Take a look at the wildly popular Snowflake Method—ten battle-tested steps that jump-start your creativity and help you quickly map out your story. All around the world, novelists are using the Snowflake Method right now to ignite their imaginations and get their first drafts down.In this book, you’ll follow the story of a fictitious novelist as she learns to tap into the amazing power of the Snowflake Method. Almost magically, she finds her story growing from a simple idea into a deep and powerful novel. And she finds her novel changing her—into a stronger, more courageous person.Zany, Over the Top, and Just Plain FunHow to Write a Novel Using the Snowflake Method is a “business parable”—a how-to guide written in story form. It’s zany. It’s over the top. It’s just plain fun. It shows you how it’s done, rather than tells you.You’ll learn by example how to grow your story idea into a sizzling first draft.You’ll discover:How to define your “target audience” the right way, so you know exactly how your ideal readers think and feel. Forget what the experts tell you about “demographics.”How to create a dynamite selling tool that will instantly tell people whether they’ll love your story or hate it. And you want them to love it or hate it.How to get inside the skin of each of your characters—even your villain. Especially your villain.How to find a deep, emotively powerful theme for your story. Do you know the best point in your novel to unveil your theme?How to know when to backtrack, and why backtracking is essential to writing great fiction.How to fire-test each scene to ensure it’s high-impact—before you write it.ExcerptGoldilocks had always wanted to write a novel.She learned to read before she went to kindergarten.In grade school, she always had her nose in a book.In junior high, the other kids thought she was weird, because she actually liked reading those dusty old novels in literature class.All through high school, Goldilocks dreamed of writing a book of her own someday.But when she went to college, her parents persuaded her to study something practical.Goldilocks hated practical, and secretly she kept reading novels. But she was a very obedient girl, so she did what her parents told her. She got a very practical degree in marketing.After college, she got a job that bored her to tears—but at least it was practical.Then she got married, and within a few years, she had two children, a girl and then a boy. She quit her job to devote full time to them.As the children grew, Goldilocks took great joy in introducing them to the stories she had loved as a child.When her son went off to kindergarten, Goldilocks thought about looking for a job. But her resume now had a seven-year hole in it, and her practical skills were long out of date.The only jobs Goldilocks could qualify for were minimum wage.She suddenly realized that being practical had made her horribly unhappy.On a whim, Goldilocks decided to do the one thing she had always wanted more than anything else—she was finally going to write a novel.She didn’t care if it was impractical.She didn’t care if nobody would ever read her novel.She was going to do it just because she wanted to.For the first time in years, she was going to do something just for herself.And nobody was going to stop her. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ CreateSpace Independent Publishing Platform (July 18, 2014)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 214 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1500574058"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1500574055"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.49 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#57,101 in Books (See Top 100 in Books) #43 in Screenwriting (Books) #86 in Writing Skill Reference (Books) #151 in Fiction Writing Reference (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 2,370 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jonesy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBCVXKPMF67MPKRJVDTDIB673HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RELBF120YKLAV?ASIN=1500574058",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 27, 2015",
                "reviewTitle": "5.0 out of 5 stars Struggling Writer? Not Anymore.",
                "reviewText": "I bought this book on Sunday. I read through it once, then as I walked through the steps with the story kernel I had in my head, I read through it again. By Friday I had completed a first draft of 12,000 words, and by Sunday night I had published my book in the Kindle Store.Prior to this, the last story I finished was over 5 years ago (and that was about 2,400 words long). I always felt I was meant to be a writer, but I have always had trouble creating plot and keeping things moving forward. I was comfortable writing description, and I enjoyed writing dialogue, but I never knew what to make my characters say or do!I have attended multiple writing workshops, and read about a dozen books on writing, but none were as clear or as practical as this one. As Randy says, it's not for everyone. But if you have tried a bunch of methods and they didn't exactly get you rolling, try this one out.(On a side note, I had read Randy's popular blog post on the Snowflake Method a bunch of times over the years and tried to implement it, but the blog post is nowhere near as detailed or useful as the book. So buy the book.)With this method, you are not creating *plot*, you're creating story. There is a lot to this book, especially considering how short it actually is, but I want to talk about two sections that absolutely blew my mind and (I know this sounds like massive hyperbole) probably changed my life forever.1. When thinking about your characters, think about this: values --> ambition --> goal. This simple formula will create great characters. Let me explain why. You ever hear a writer say something like, \"the character came alive on the page\" or \"I just sat back and let the characters determine the direction of the story?\" Yeah, me too. I read this all the time, in great books like Stephen King's On Writing. That's all well and good, I always thought, but how the heck can *I* do that? This little values-ambition-goal thing does that for you. In particular, I have found that the \"values\" portion of this trick is the most useful for me.Here's what you do. You give your characters two values. As an example, off the top of my head, I'm gonna say my character believes that: a) Nothing is more important than upholding the law, and b) Nothing is more important than the safety of my family. Now, think of a situation that might put those two values in direct competition with each other. Say my character's teenage daughter is being stalked by some creepy older dude, and the authorities won't do anything about it. Now, does my character take the law into his own hands? Or does he sit back and let the situation play itself out? Either way, you know something is going to happen, and whichever way it goes (maybe my character kills the stalker, maybe the daughter gets abducted, maybe the character has an argument with the daughter and she runs away), it will lead to tons more story. And whatever happens then, we look to the values of the character to determine what they might do in that situation down the line. It leads to consistent characters and weirdly, focusing on the mind of the character gives us stuff for them to do!2. Character synopses. So, the Snowflake Method basically recommends the three-act structure. (To paraphrase poorly: three escalating disasters with the final one being the ultimate showdown and resolution of the central conflict.) But in this book, Ingermanson also recommends you not only write a synopsis for your book (i.e. your main character) but also do a one-sentence and one-paragraph synopsis for your other characters. Holy moly, this floored me. By looking at the central story from the perspective of the secondary characters, you get great ideas that add dimension to the world of your story.Even if you don't tell the reader everything about your secondary characters (and you shouldn't), it might be useful for you to know that the creepy stalker guy developed his crush on the teenage daughter at a daycare she attended and he worked at. Hmm, maybe that might impact your story in some way? YA THINK? It takes you into directions you didn't expect, and again, gives your characters well-rounded edges, instead of the paper-thin one-note characters you find in books like [redacted].Last night, I swear, I couldn't fall asleep because my head was overflowing with one story idea after another, all of which I could easily write into short story, novella or novel form.Also, while not exactly an outline, after I had completed the steps of the Snowflake Method the picture I had created in my mind of the story I wanted to write was so clear that I was writing upwards of 2,000 words per hour for my first draft, basically just dictating from my brain to the paper. It was magical. But it was because I had already thought through the important parts of my story.Alright, I have gone on long enough. Please buy this book. I have barely scratched the surface of its awesomeness. And anyway, it's cheap! And it's short, so if you don't like it, you didn't waste much time or money. But if, like me, you have always found it hard to find stuff for your characters to do, this book will likely help you. Don't worry about the Goldilocks/Three Bears/Big Bad Wolf story. It's just a dumb story Randy uses to illustrate the point of the book. Some people here are taking it way too seriously, like he meant for the story to be published in The New Yorker for gosh sake.I love this book. I love Randy Ingermanson. I feel like this book will be the main reason for igniting my writing passion and, spaghetti monster-willing, career.",
                "reviewVotes": "125 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abigail B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLSE5PMNLZAFNLTJIKUKBIHD6DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CHWMCWH49GGD?ASIN=1500574058",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Outstanding resource for fiction writers",
                "reviewText": "This book is an outstanding resource for fiction writers. The author clearly lays out a step by step plan to outline your novel. He also gives sound guidance to help with character and scene development. One of the best resources that I have read and studied to get that first draft of your novel done quickly and effectively. HIGHLY recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEID4JKXXIE6R5OPIU3NGVGMB7HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGCN1X49E7RM6?ASIN=1500574058",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2022",
                "reviewTitle": "4.0 out of 5 stars Snowflake method is a writing tool that you can use to supplement and/or replace other methods.",
                "reviewText": "Who is this book for? This book is for someone interested in finding an alternative writing method to (or extra tool to use with) 'outline writing' or 'discovery writing' methods that inherently helps them create a logically consistent story and world and thereby reduce revisions needed in the editing stages. I would say a person with some knowledge of writing, but you don't have to have a bunch of knowledge - someone with medium knowledge about writing a book. There are some terms and concepts that may be foreign and so confusing if you don't have knowledge of basic concepts of writing. But most everything is explained even for people with relatively little knowledge of writing theory and english, etc.If you wanted to read this book really fast, just skip to the step summaries at the end of the book and don't read the story - the summary goes over pretty much everything in the story - but if you have hard time understanding the summary of the steps, you may want to go read the story parts for the sections you don't understand. This being said, I read the whole book in a day and a half, so it's a very quick read as I would consider myself an average reader in terms of speed. The concepts in it are not very complicated.IMO the heart of this guide is centered on world building and the logical consistency of your world and story. I enjoyed the story with Goldilocks - it made it fun and easy to read and learn, and I found myself chuckling though out, which always helps.It was also a really interesting way to teach the method by using a story - it was totally different than Plato, but almost just as unique in how the dialogues between characters play out in order to teach the reader the entire 'snowflake concept' in a how-to book. Unlike Plato we are not left scratching our hands and wondering at the end of the story and its much easier to remember everything that was taught.Goldilocks often reflects the questions, insecurities, and concerns you may have yourself as a writer and student. The Big Bad Wolf, and Baby Bear, are pretty funny throughout adding even more humor to all of Goldilocks hilarious embarrassing moments.The snowflake method helps you imagine the world and settings and characters of your story and then to write your novel from that solid foundation. Once you have all your scenes of the book written (one sentence summaries aka step #9), and each scene of your story has motion (some type of conflict so its not boring - also part of step #9), you can begin to write your novel.In fact if you feel you really know your world and characters and settings and themes, you could just skip all the way to step #9, yet for most people they need time to learn and immerse themselves in their fictional world before step #9, hence steps 1-8.Maybe if you are a discovery writer, you might discover your scenes and try to build a logically consistent world as you write your scenes, and then further build the world and logical consistency of your world while your write the full novel. But this may lead to more revisions if you didn't really grasp your world as good as you originally thought.The point is: there are options, you are not trapped into the \"snowflake way of writing\" when you find a better way to tackle your next writing project. He mentions this method is very flexible, and the steps can change depending on what you're writing - freeing you to find your own 'best way' of writing in the end.So in summary the book teaches you how to immerse yourself in your fictional world (a world with characters, plot, settings, themes, and conflict, etc.), and then to write your one sentence scene summaries for your story, and finally to write the whole story from there.The reason it is a fun and useful way to write is because you can write out your entire book in 25-100 sentences, give or take, and then from these sentences and your understanding of your world and character(s) you can easily enjoying writing, what you KNOW will be, an AWESOME AND LOGICALLY CONSISTENT story. Why? Because you already preplanned for it and worked out most of the major kinks before hand.Of course you have to be creative enough and hard enough working to come up with all your scenes and make sure they are not boring and to be able to write the book from these scenes at step #10. But the author even mentions writing takes hard work and dedication. Yet with the snowflake method the hard work is in the preplanning stage of steps 1-9 and the writing at step 10 is mostly pure joy, in theory.He mentions how this method also makes editing easier if problems occur or revision is needed, etc.And the author says one of the main pulls of using this method is that you will typically have to do less revising than if you use either of the classic 'outlining' or 'discovery' methods while you write, and when you go to edit.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 22, 2023",
                "reviewTitle": ":) Great book and it came fast :)",
                "reviewText": ":) Great book and it came fast :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gaby Fraga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 17, 2022",
                "reviewTitle": "Simples e incrível!",
                "reviewText": "Mudou por completo meu método de escrita, e eu consegui ver uma evolução muito rápido, principalmente nos meus personagens. Explica de forma natural atravéz de um conto fictício, e depois coloca uma explicação prática no final, um bom guia de consulta. Recomendo 100% pra qualquer pessoa querendo melhorar o seu processo criativo. Muito bom!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ninja_Janine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 23, 2023",
                "reviewTitle": "Méthode pour débuter un roman",
                "reviewText": "Super livre pour qui veut débuter un roman et qui a besoin d'y aller progressivement. Tout en anglais, mais un anglais relativement facile à comprendre, pas de termes très technique.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francesco T.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on March 4, 2022",
                "reviewTitle": "Eccellente",
                "reviewText": "Libro educativo e divertente allo stesso tempo. Offre un metodo pratico differente dai soliti in circolazione per sviluppare la classica struttura in 3 atti. Mi è stato utile per mettere il focus su alcune idee che ho maturato leggendo anche altri libri sulla scrittura di romanzi.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chrissy’s Book Shelf",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 23, 2020",
                "reviewTitle": "A Well Thought Out Introduction To The Writing Process",
                "reviewText": "I heard about The Snowflake Method of writing on a NaNoWriMo forum post and thought it sounded interesting. I took part in NaNoWriMo 2019 and wrote 119K words and then fizzled out. I couldn’t do the whole outlining thing because it was dull to me and the pants method seemed to be unsuccessful so I decided to get the book and take a look.I have to say this method seems to fall into a happy middle ground between the two methods that I think I could employ when I come to start again with the abandoned book.The concept of the book is clever with it starting with a story about Goldilocks who wants to write a book after her children go to school and leaves her at home with no job because she’s been out of the market for 8 years. She decides to attend a writing conference where she is introduced to the Snowflake Method by Baby Bear the teacher.It’s a ridiculous story, which is why you focus on the lessons that Baby Bear teaches and it seemed to sink in quite well for me. The author then went on to show his method for writing the short story, which, though repetitive in places, was illuminating. It showed how to work through the method, illustrating it more clearly.If you are struggling with how to actually tackle writing a book, this is a very good purchase.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$12.44",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            },
            {
                "price": "$12.46",
                "sellerName": "Animal Crackers Originals",
                "sellerRating": "4.5"
            },
            {
                "price": "$12.49",
                "sellerName": "villagebookstore",
                "sellerRating": "5"
            }
        ]
    }
}