{
    "remaining_requests": 217,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Art-Prophecy-Novel/dp/B09LRD5CZ9",
    "body": {
        "name": "The Art of Prophecy: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Art-Prophecy-Novel/dp/B09LRD5CZ9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51TyI7kLDAL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Wesley Chu",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Wesley+Chu"
        },
        "brand": "Wesley Chu",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 492,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A “superb fantasy saga” (Helene Wecker) of martial arts and magic, about what happens when a prophesied hero is not the chosen one after all—but has to work with a band of unlikely allies to save the kingdom anyway, from the #1 New York Times bestselling author of The Lives of Tao“An ambitious and touching exploration of disillusionment in faith, tradition, and family—a glorious reinvention of fantasy and wuxia tropes.”—Naomi Novik, New York Times bestselling author of A Deadly EducationONE OF THE BEST BOOKS OF THE YEAR: Gizmodo, Kirkus Reviews, The Quill to LiveSo many stories begin the same way: With a prophecy. A chosen one. And the inevitable quest to slay a villain, save the kingdom, and fulfill a grand destiny.But this is not that kind of story.It does begin with a prophecy: A child will rise to defeat the Eternal Khan, a cruel immortal god-king, and save the kingdom.And that prophecy did anoint a hero, Jian, raised since birth in luxury and splendor, and celebrated before he has won a single battle.But that’s when the story hits its first twist: The prophecy is wrong.What follows is a story more wondrous than any prophecy could foresee, and with many unexpected heroes: Taishi, an older woman who is the greatest grandmaster of magical martial arts in the kingdom but who thought her adventuring days were all behind her; Sali, a straitlaced warrior who learns the rules may no longer apply when the leader to whom she pledged her life is gone; and Qisami, a chaotic assassin who takes a little too much pleasure in the kill.And Jian himself, who has to find a way to become what he no longer believes he can be—a hero after all. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Science-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16190"
            },
            {
                "name": "Myths & Legends",
                "link": "https://www.amazon.com/Myths-Legends-Fantasy/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10387330011"
            },
            {
                "name": "Asian",
                "link": "https://www.amazon.com/Asian-Myth-Legend/b/ref=dp_bc_aui_C_5?ie=UTF8&node=10387331011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "18 hours and 41 minutes"
            },
            {
                "name": "Author",
                "value": "Wesley Chu"
            },
            {
                "name": "Narrator",
                "value": "Natalie Naudus"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "August 09, 2022"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09LRD5CZ9"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#33,633 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #62 in Asian American Literature (Audible Books & Originals) #239 in Asian American Literature & Fiction #334 in Asian Myth & Legend"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Akonam Unachukwu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVKANAK7S57Y65Y3AWM4I3DYXUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VKHT2SX8DI8V?ASIN=B09LRD5CZ9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Story",
                "reviewText": "Well developed character.Taishi’s character has much debt and a hysterical view of the hero Jian.The introduction of The Shadowkill Qiasami was vividly written and calls up so many memories of traditional Chinese theatre fight sequences.This book was masterfully written. Already read the sequel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A Person",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSFQXOGEZLLVCEPPMBPYOQMNLSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KHNCDJ5CMB96?ASIN=B09LRD5CZ9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2023",
                "reviewTitle": "4.0 out of 5 stars A rousing martial arts fantasy adventure!",
                "reviewText": "I enjoyed this book a lot. It felt like I was reading a wuxia movie like Crouching Tiger Hidden Dragon or House of Flying Daggers. The intriguing plot had several twists and an ensemble cast of compelling (if not always likeable) characters. I like that one protagonist is an older lady; you don't see too many adults on epic adventures in fantasy. Even the one-and-done characters made an impression.I liked how the prose was descriptive without going overboard and removing me too far from the events at hand. The action scenes were a delight to read and they played out in my imagination like a good martial arts film. I got vibes of my favorite martial arts movies like Come Drink With Me, Crouching Tiger Hidden Dragon, and House of Flying Daggers.I love the creatively colorful way characters insult each other. It not only feels otherworldly, but feels \"smarter\" than simply using strings of curse words. Even the slur used against a certain group of people reminded me of the slur my parents told me they heard often when they lived in England during the 1970s. (My family is from India).One character named Sali had one of the most unique and original weapons I've ever seen in fantasy multimedia. Most fantasy novels I read give characters traditional weapons like swords, so Sali's cool weapon really just transported me to an otherworldly fantasy realm.Here are my Cons:This book is screaming out for a character guide and a lore glossary.Several characters have similar sounding names, so a character guide to help me keep track of who's who would have been wonderful.A lore glossary to deeper explain some of the worldbuilding would have been nice too, especially descriptions of the colorfully named martial arts techniques used by various characters.Oh, and the map in the book's preface needed to be better drawn. It was too dark, too small, and place names were difficult to read.I'm all in with this series and look forward to the next installment, since there are still some hanging plot threads that I need to know more about.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric Stallsworth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQBVEMIBPICLVSOOL2NRIF6LWDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD5TMMB9B47SV?ASIN=B09LRD5CZ9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars A fabulous book by Wes Chu",
                "reviewText": "This first book in the War Arts Saga is a great read! Wes Chu displays his usual exquisite skill in plunging the reader into an alien world, with an intricately detailed Asian cultural flair. The characters exhibit depth, and the plot is full of twists and surprises that kept me enthralled through the entire book. If you're a fan of Wes Chu's other novels, you won't be disappointed with this one at all. I can't wait to get the next one and continue the story.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin Kauffmann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGSDGJ2TJHH62ICU4KMXTDTS56A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X1CHAMLQH29M?ASIN=B09LRD5CZ9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 2, 2022",
                "reviewTitle": "5.0 out of 5 stars Not Your Hero’s Journey",
                "reviewText": "The heroics are sure to come, but what strikes me about the first novel of this series is how Wesley Chu subverts the typical Chosen One arc, yet still nods to the classics as he passes them by. Clearly influenced by the wuxia genre, Chu isn’t shy about name-dropping specific forms, but I was glad to find that almost all of his action is laid out in clean, cinematic fashion. There’s quite a bit of it, too, so if you’re an action junkie, you’ll find plenty to enjoy. Chu deftly weaves together some distinct styles into a tapestry that progresses so fluidly that it really does feel like you might as well be at a movie theater.Very little of this action involves the supposed Hero, who is ejected from his destiny by mere circumstance. Instead, Chu treats us to a wide cast of masters from different schools and traditions that not only provide a spectrum of dynamic characters, but also their opposing viewpoints over the fallout of this botched prophecy. Often, I found my favorite moments among the rest of this cast, and, inevitably, I would become excited to see how they would fare against each other if they were to match up. Then, just like that, Chu follows through and gives the reader exactly what they could want.I won’t spoil the fast-paced plotline, which unfolds unexpectedly, because that’s exactly the point. I won’t go over the characters you’ll get to meet, how each one is unique but somehow familiar. And I won’t mention the more… colorful sensory details that make up these fantastic locations.But I will say that for a genre so steeped in tradition, Wesley Chu found a way to make it feel new.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J Galt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMHCWXV3JJ6C7CNTCQXJRSJQYIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V60HRU1UVS0L?ASIN=B09LRD5CZ9",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2022",
                "reviewTitle": "3.0 out of 5 stars Is this a stand alone book?",
                "reviewText": "Really felt like it just ended...not a wrap up or a conclusion...writing was good, story was good and then it just ended. If there is a part 2 it will save this book...kind of a crappy ending even if there is a book 2 (which there is no evidence of to the best of my knowledge).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alan Hill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQZUPEHTOYUDOJ5AWI2EH25OVWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13CDHWGGNSNK7?ASIN=B09LRD5CZ9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2023",
                "reviewTitle": "4.0 out of 5 stars 4.5 Stars - Super fun and well developed",
                "reviewText": "Wesley Chu delivers quite the spectacular story with The Art of Prophecy. I was captivated the whole time, and often reminisced on favorite films like Crouching Tiger Hidden Dragon, and The Heroic Trio. Chu excels at capturing the feeling of adventure into the novel. You bounce around to eclectic cast of character of varying ages. Reminiscent of George R. R. Martin in its approach to perspective, but with the added bonus of creating chapter titles (a not so common art for adult fiction) that really keeps you guessing what will happen next. The story has a great rhythm and life to it. Although, I do think the “main character” or “hero” is kind of bland at the end. I hope he retains his spunk because I’m afraid his growth might have humbled him to the degree that it removes the personality that I actually liked. Some readers may think of this as an improvement, but I enjoyed the arrogance of him. Readers are sure to fall in love with the politics of Chi’s world full of gray characters and plenty of conflicting good intentions.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 10, 2023",
                "reviewTitle": "Twists and turns that give you whiplash",
                "reviewText": "If you like stories that, once the action starts, have twists and turns that give you whiplash, then this is for you. Especially in the last third of the book. There is much humour and camaraderie as well as excellent worldbuilding. Even the characters I didn't like, I cared about what was happening to them. The story kept me reading.I stopped reading about 90% of the way through, coming back to finish this months later, so my rating is closer to 3 and a half because the prose can go on a bit. But if dragged out scenes (it's not the description, just the thought processes of the characters) doesn't bother you, give this a read. You won't be disappointed.If you end up feeling like I did - intrigued but not emotionally invested - you might do as I'm going to do and avoid the sequel for a while. This gets a 4 star instead of 3 because of how much I enjoyed reading this BEFORE my siesta from it. Think of this as more of a 3 and a half.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}