{
    "remaining_requests": 138,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Queen-of-Fire-Anthony-Ryan-audiobook/dp/B00XQ10258",
    "body": {
        "name": "Queen of Fire: A Raven's Shadow Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Queen-of-Fire-Anthony-Ryan-audiobook/dp/B00XQ10258",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61Rqzm 17VL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Anthony Ryan",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Anthony+Ryan"
        },
        "brand": "Anthony Ryan",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 10706,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In this “deftly and originally executed” (Booklist) New York Times best-selling novel, Vaelin Al Sorna must help his Queen reclaim her Realm. Only his enemy has a dangerous new collaborator, one with powers darker than Vaelin has ever encountered...“The Ally is there, but only ever as a shadow, unexplained catastrophe or murder committed at the behest of a dark vengeful spirit. Sorting truth from myth is often a fruitless task\". After fighting back from the brink of death, Queen Lyrna is determined to repel the invading Volarian army and regain the independence of the Unified Realm. Except, to accomplish her goals, she must do more than rally her loyal supporters. She must align herself with forces she once found repugnant - those who possess the strange and varied gifts of the Dark - and take the war to her enemy’s doorstep. Victory rests on the shoulders of Vaelin Al Sorna, now named Battle Lord of the Realm. However, his path is riddled with difficulties. For the Volarian enemy has a new weapon on their side, one that Vaelin must destroy if the Realm is to prevail - a mysterious Ally with the ability to grant unnaturally long life to her servants. And defeating one who cannot be killed is a nearly impossible feat, especially when Vaelin’s blood-song, the mystical power which has made him the epic fighter he is, has gone ominously silent...Don't miss the continuation of this epic saga: The Wolf's Call, a Raven's Blade novel. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Horror",
                "link": "https://www.amazon.com/Horror-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=49"
            },
            {
                "name": "Dark Fantasy",
                "link": "https://www.amazon.com/Dark-Fantasy-Horror-Fiction-Books/b/ref=dp_bc_aui_C_5?ie=UTF8&node=9803"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "26 hours and 37 minutes"
            },
            {
                "name": "Author",
                "value": "Anthony Ryan"
            },
            {
                "name": "Narrator",
                "value": "Steven Brand"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "July 07, 2015"
            },
            {
                "name": "Publisher",
                "value": "Penguin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00XQ10258"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,351 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #68 in Sword & Sorcery Fantasy (Audible Books & Originals) #594 in Action & Adventure Fantasy (Audible Books & Originals) #836 in Sword & Sorcery Fantasy (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "4zdcZebra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSLJC5XFTM5BAC24GJSX7M4LPKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R103XNGCX3MFFW?ASIN=B00XQ10258",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2015",
                "reviewTitle": "5.0 out of 5 stars Queen of Fire Picks Up Where Tower Lord Left Off - Don't Pass Up - Excellent, excellent, excellent!",
                "reviewText": "For your adventure-fantasy reading pleasure add Queen of Fire to your summer-fall reading list. Make sure you read book 1 and 2 first because Queen of Fire picks up where Tower Lord left off. If you are in the habit of reading reviews before purchase, I strongly advise that you disregard the negative reviews found here. The truth is Queen of Fire is a 4-5 star read – bar none. I think the author of Queen of Fire is one of the best in his category. His battle scenes are explicit, personal and detailed to the point where you’ll be sweating the scene with the character. You’ll find yourself going back and re-reading the fight scene again to make sure you didn’t miss anything. But I must admit that due to the negative reviews, I kept searching the book for something obvious and confusing to pop up. All I found were well constructed scenes, well placed humor and memorable quotes. If you’re like me, chances are we like the same books and pine for more high quality and diverse authors to enter the adventure-fantasy arena. Queen of Fire was and still is on my top 10 reads for this year. I sat and waited for its release and now I am sorry I read those negative reviews and delayed buying it the first week.The truth is the negative reviewers do have a right to their opinion, but they shouldn’t use it to needlessly harm others. Again, Queen of Fire picks up where Tower Lord left off. Also, I just can’t get over the notion that most must have skimmed over the book in an effort to get paid, proffer the beliefs of an obscure religious cult or obtain hits for a blog by stirring controversy. I really don’t have an answer for why some of them wrote what they did and made such an effort to diss an adventure-fantasy book. Maybe they mistook Queen of Fire for a political treatise. Whatever the case, I do know from experience that errors happen in judgment when you hold deep seeded prejudices then read a book that may trigger a few of them. For the record, I was not paid. I read the book for the purpose of enjoying an adventure - fantasy read while commuting.Now let’s talk about why you would enjoy the book and the series. Queen of Fire is the culmination of a great personal journey for Vaelin, Lyrna, Reva, Frentis and Venier. In book one, Blood Song, we meet an emerging adult named Vaelin through the eyes of Venier. A lot happens, but Venier chronicles a very important part of the emerging adult Vaelin’s story – Vaelin kills a people’s living Hope! In book two, Tower Lord, each of our young adults meet-up with horrific odds that will have you up all night trying to identify the real enemy! Naturally, through suffering our heroes stop and question their lives and religious beliefs. They also find love in unconventional and strange places and with unlikely persons. Like the others, Vaelin suffers his own horror when he loses his mojo – the same mojo he used to kill Hope (Good Morning Alabama!). He too begins to question his life’s purpose and religious beliefs. In Book 3, Queen of Fire, we find our heroes overcoming challenging odds, evolving, maturing and applying a steady focus on learning about and defeating a ruthless, obscure enemy thus saving their world. Like the others, through love Vaelin recovers, learns to carry on, find wins without his mojo, embraces the path of normal men, and learns what it means to have … (must I spell it out?).If you like adventure - fantasy books that have a lot of action, blood, guts, and a clear moral to the story, you will like Queen of Fire. And, if you like those types of stories where the heroes and their friends don’t often emerge alive or untouched by their choices or circumstance, this series is for you. Just remember to read Book 1 and 2 first because Queen of Fire picks up exactly where Tower Lord left off. Again, the book is well written, worthy of a 4-5 rating and I highly recommend the series to average, commuting to the day job, adventure-fantasy fanatics like me.I'll be waiting for Anthony Ryan's next book!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rusty Dalferes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5MWBEBUIEI6CAHCXELKJAEH2FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RY4LAAF8HBPT2?ASIN=B00XQ10258",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2020",
                "reviewTitle": "4.0 out of 5 stars An action-packed end to the trilogy",
                "reviewText": "Another excellent entry in this series, with the stakes raised ever higher as the story progresses. The only reason I put this book down was because I had to take a trip to look at new places to live, but every other second of free time I had was spent tearing through this book. I give this novel, and the entire series, a strong recommendation for fans of high fantasy.The third and final entry in the Raven's Shadow series finds Lyrna, in previous books the Princess of the Unified Realm turned scarred captive of the Volarian empire after the death of her brother and family in a fiery attack, finding herself a freshly healed Queen after the Battle of Alltor, in which the combined strength of her armies, those of Vaelin al Sorna, and the defensive efforts of Lady Reva managed to defeat a large force of the Volarian armies attempting to besiege the city in the southwest of her Unified Realm. Having lost her capital city in the northeast to the Volarians, Lyrna consolidates her forces -- including the armies of Vaelin and Reva and their combined allies consisting of remaining Realm Guard and knights, secretive tribes inhabiting the isle and the frozen reaches to the North, brothers and sisters of the newly-revealed Seventh Order of the Faith strong with magical power, freed slaves, and even Meldenean pirates from across the southwestern sea -- to recapture the capital before setting her mind to bringing the fight to the Volarians on their home turf across the seas to the east. The Volarians, a civilization mired in brutality, blood, and slavery, find themselves ruled by the new body inhabited by the spirit of the darkly evil and insane woman who had magically bound Frentis for most of the second novel, and she seems to be commanded by an even darker force who has made itself known to Vaelin. As the Realm's armies split to take different routes to assault the vast Volarian empire, each of the main characters suffers tribulations, but makes allies along the way, eventually fighting through natural, man-made, and magical obstacles in order to meet in a final conflict of grand proportions, where the Realm's forces will either defeat the growing darkness or be lost forever.This book, and the whole series, is really hard to put down, and as the final book in the first trilogy featuring this world, the action begins early and continues often from the very first chapter. The characters are all well-crafted, each with his or her own emotional arc, and there is a welcome consistent theme of redemption, such that even the lowliest and basest of characters have the opportunity to make themselves into characters worthy of remembrance. As with the second book, there is a welcome acceptance in the narrative of some forms of non-standard love, although the lesbian version is given much more positive focus and more page-time than any form of male-to-male relationships. But the plot is engrossing, the action plentiful, the characters deep and rich, and the conclusion satisfying.As with the first two in the series, I have issues with Ryan's use or misuse of commas, and I noticed in this book his tendency to use \"myself\" too often instead of \"I.\" Those quirks aside, Ryan is a talented writer with a knack for descriptive turns of phrase and an impressive vocabulary, so the few punctuation or syntax errors I found did little to lessen my enjoyment of the book. Again, I'd probably give this 4.5 stars if I were allowed, because these issues are not really enough to take away a full star, but, alas, I can't bring myself to ignore them enough to give this a perfect 5-star rating.All told, I loved this series, and am already loving the sequel series (Raven's Blade) featuring Vaelin. I give it a huge recommendation to fans of high fantasy.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reader-718",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 23, 2022",
                "reviewTitle": "The Order is very much in disorder, you, however, must place this order…",
                "reviewText": "Queen on Fire.. Mr Ryan has surpassed himself! A feat I’d thought difficult, but, there you go. He did it, here!When a story within a story becomes greater than the story, that is something to truly behold. It becomes legends unto legends of all ages to all people. The dark that seeps into the light at its edges is pervasive and mordant like. It festers, eats greedily into all the rich goodness of a civil and beautiful world. But as goodness does then goodness will; the light spreads forth with all of its wonderful and powerful gifts. It becomes a parody of mordancy and slowly but surely attacks those dark and festering shadows; scorching them into oblivion with bright, white hot flame bringing the purity the goodness needs to thrive once again!The story line of this book has progressed rapidly from the very beginning. The scope covered in three books is awe inspiring, to me, a vastly read book-type! The depth of meaning, travels, battles, plots in plots, schemes to scheme and, dare I say, (Mr Ryan) becomes the best author I’ve read in a long time; and I’ve been reading: Jordan, Wolfe, Martin et al. Yes, to be ‘at’ and arguably ‘above’ this level is magnificent.The magics and deep seated themes in the series are complex, yet you get them. They’re world consuming, yet readable and the truth is; this is top, top fantasy at its very best, indeed. I cannot think what I’ll follow this series with. I have a plethora of Gemmell to read so, that’s a start to bridge the gap.I say to you, good ladies and gentlemen, go forth, buy these books, read them, & then - read them again.I demand a T.V serialisation of this stuff - forthwith, by the Queens word!Good Brothers, & Sisters of the Orders, good fighting folks and tribes people of the surrounding nations, gather your weapons, steal yourself, and be about your business destroying these filthy Volarian buggers, rid our world of them for good, say no to the endemic and systematic enslavement of all peoples, be stout in your faiths, your gifts and powers, be strong of heart and true to yourself and your peoples, most of all; do yourself a big, huge, massive favour - buy this series (and do what is sensible), and what I’m going to do next: buy all other books by this author, blind, read no further reviews, theres no need - it’s that good.BTW: Mr Ryan, I absolutely loved the Alucius-27 dialogue thing! This had me chuckling, full of mirth for the pure and wonderful sarcasm it engendered - wonderful stuff, sir. I say also, the romantic side of things was very well done, indeed. I admire an author who does not fumble around in the dark with awkward bed scenes, the false amor of relations between persons that only makes one envisage a scene of carnal disproportions and tomfoolery! (Possibly, dirty embarrassment)I look forward to your future books, indeed, I’ve pre-ordered next years release, already, without a clue what it’s about. This is when you know you’re onto a great author - blind loyalty to buy books like this!Highly distinguished is the author, in his services to literary creativity and entertainment - bravo!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Senthamizh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 30, 2021",
                "reviewTitle": "A fitting end.",
                "reviewText": "I have read the numerous bad reviews for the second and third books in this series. They even made me stop reading the Tower Lord the first time I completed Blood Song as I didn't want to spoil my memory of a good book. But when I read Blood Song the second time, I decided to read on and I am glad I did. The first book was a coming of age story, but that changed in the sequels. I think most people wanted this series to be like Harry Potter, where the story spans the coming of age of the protogonist. But this series is not that. The sequels are the continuation of the blood song, but it has grown too big even for Vaelin. The stakes are more. The story demands more POV and it is filled with melancholy which I think puts off a lot of readers. I found the Queen of Fire a sad tale, but a fitting end. It is not the series spoiling debacle most people say, instead it is a fine conclusion to a fine tale. I can't wait to read the second series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 22, 2020",
                "reviewTitle": "Great series",
                "reviewText": "Great conclusion to a great series. Can not recommend this book or this series highly enough. Best trilogy I’ve read in years.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arthur Sady Cordeiro Rossetti",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 4, 2019",
                "reviewTitle": "Conclusão",
                "reviewText": "Uma história dura cheia de provações que termina com diversas reviravoltas. Um livro que deixa evidente a participação de diversos personagens além de Al Sorna, mas que também evidencia, a fibra do protagonista até o fim.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Derrick Law",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 9, 2020",
                "reviewTitle": "Interesting storyline",
                "reviewText": "Have not read this book yet, but looking forward to it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}