{
    "remaining_requests": 386,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Court-Wings-Ruin-Thorns-Roses-ebook/dp/B01LOWN78Y",
    "body": {
        "name": "A Court of Wings and Ruin (A Court of Thorns and Roses Book 3)",
        "price": "$8.21",
        "originalPrice": "",
        "rawPrice": 8.21,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Court-Wings-Ruin-Thorns-Roses-ebook/dp/B01LOWN78Y",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81-2EciBFwL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sarah J. Maas",
            "link": "https://www.amazon.com/Sarah-J-Maas/e/B0070291GK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 143562,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The epic third novel in the #1 New York Times bestselling Court of Thorns and Roses series by Sarah J. Maas.Feyre has returned to the Spring Court, determined to gather information on Tamlin's actions and learn what she can about the invading king threatening to bring her land to its knees. But to do so she must play a deadly game of deceit. One slip could bring doom not only for Feyre, but for everything-and everyone-she holds dear.As war bears down upon them all, Feyre endeavors to take her place amongst the High Fae of the land, balancing her struggle to master her powers-both magical and political-and her love for her court and family. Amidst these struggles, Feyre and Rhysand must decide whom to trust amongst the cunning and lethal High Lords, and hunt for allies in unexpected places.In this thrilling third book in the #1 New York Times bestselling series from Sarah J. Maas, the fate of Feyre's world is at stake as armies grapple for power over the one thing that could destroy it.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B01LOWN78Y"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bloomsbury Publishing; 1st edition (May 2, 2017)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 2, 2017"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 10450 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 721 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#39 in Kindle Store (See Top 100 in Kindle Store) #5 in Paranormal Romance (Books) #6 in Romantic Fantasy (Kindle Store) #6 in Fantasy Romance eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 143,562 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/fcdd5b0a-6f7d-4e3f-8a9b-4067be0613ba.__CR0,0,540,540_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7ac8b516-d00e-47cc-8c94-d2ba9575776b.__CR0,0,540,540_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6d97eff3-03e0-44cf-9ed8-247be6fde107.__CR0,0,540,540_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ryan Harris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDGAT6EDI7FVQSSB3HA6OV5GTWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBH66UX7CTVXX?ASIN=B01LOWN78Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Spoilers!",
                "reviewText": "I loved every moment in this book. I was worried that after A Court of Mist and Fury that the rest of the series would not hold up. While ACOMAF is my favorite so far AOWAR definitely held it own.I love all the new characters that we got to meet in this book along with all the new relationships.I love the connection between all the high lords. We get to see a lot more of their history and the relationships that they all had prior to the current timeline.Many secrets were reveled in this book... or more so truths that have not yet been told.Mor and her secret that now only Feyre knows. I love this direction for her but I also am sadden for the relationship I was hoping for, for her and Azriel. I hope that in the future books we get to see more of their friendship. I hope they will both have new love interest in the future books.Herion and Lucian... Father and son. I Hope this is something that gets brought up again in the net book.The relationships that still have so much questioning and I cannot wait to see what happens.Obviously my favorite is Feyre and Rhys. Enough said.Cassian and Nesta. Are they mates? Not mate? WHAT? I need more. I need to know! There is something more there and I cannot wait to read more to find out.Amern and Varian. I just need more of these two. I love the little bits that we got in this book.Lucian and Elain. We know they are mates. Elain is still in love with her human ex fiancé Greyson. Ew. I love how gentle and understanding Lucian is and backs away when she needs him too.ALL THE TWIST AT THE END!3 that got me the most!1. Feyre, Nesta and Elain's father. I was in tears! \"He calls himself the Prince of Merchants\" “He told me he's got three daughters who live here. And that he failed them for many years. But he would not fail them this time.\" The ships at the front of the human armada became clear, along with the gold lettering on their sides. \"He named his three personal ships after them,\" Drakon said with a smile. And there, sailing at the front...I beheld the names of those ships.The Feyre.The ElainAnd leading the charge against Hybern, flying over the waves, unyielding and without an ounce of fear…The NestaWith my father…our father at the helm.I love this for these three so much. I completely forgot about their father and kind of just wrote him off. Then out of nowhere he has been battling and rallying for his girls. He didn’t know they were fae and was right in the middle of everything happening but he knew they were there and need help. I am sad that the King of Hybern killed their father. I would have really like to see more of his thoughts on becoming them becoming fae and what happened to them in his absence.2. Amren’s betraying/ not betraying Feyre. Let me tell ya I was so mad for a hot minute. I had to put the book down. I could not believe what was happening. I was thinking no way Amren is on the wrong side of this. She has helped and done so much. Then the twist.The Suriel left the message to Feyre for Amren. For Amren to release her true self so that she alone can defeat Hyberns army. The begging from both Feyre and Varian for Amren not to release her true self because she would not remember them. She would not be able to return. But she is able to come back but she now is different.She looked to Varian, a wry smile on her red mouth. “I watched them most—the humans who loved. I never understood it—how it happened. Why it happened.” She paused a step away from the Cauldron. “I think I might have learned with you, though. Perhaps that was a last gift, too.” Varian’s face twisted with anguish. But he made no further move to stop her. She turned to me. And spoke the words into my head—the spell I must think and feel and do. I nodded. “When I am free,” Amren said to us, “do not run. It will attract my attention.” She lifted a steady hand toward my arm.“I am glad we met, Feyre.” I smiled at her, bowing my head. “Me too, Amren. Me too.” Amren grabbed my wrist. And swung herself into the Cauldron3. Rhys dying. I did not see this coming! I have never had a book where one of my favorite characters dies. Or a main character die. I normally love the smaller characters more. Call me cheesy but I love, love. When he died and once Feyre noticed what had happened, my gut wrenched.Rhys was sprawled on the rocky ground, wings draped behind him. He looked like he was sleeping. But as I breathed in— it wasn’t there. That thing that rose and fell with each breath. That echoed each heartbeat. The mating bond. It wasn’t there. It was gone. Because his own chest … it was not moving. And Rhys was dead.The after math of this was just a much heart wrenching, maybe even worse. Feyre begging everyone to help Rhys and just when you think no one can help him. Feyre asks the high lords to bring him back like they did her. They need them all to do it, even Tamlin. Feyre says she would",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Velarisreads",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLGNKN4K7KEVBIE2RIFANNHWU7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9W74ZWB4CKM?ASIN=B01LOWN78Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 30, 2017",
                "reviewTitle": "5.0 out of 5 stars I will try my best to make this spoiler-free because SO MUCH happens",
                "reviewText": "Oh goodness. I will try my best to make this spoiler-free because SO MUCH happens!Now, this book came to me on its release day (thank you, Amazon). I started reading it almost immediately and then I had exams. This is why it took me so long to finish it. I would try to read it before work or before class, but I wouldn’t be fast enough.So, we know what happened in the second book. Feyre went back to Tamlin, but surprise! It’s just a little trick. She will find her way back to Rhysand.Duh, she does. That’s not really a spoiler.War is looming and she, as the High Lady, must work with the Night Court and her mate, Rhysand, in order to win this war and bring peace to all. Literally.So, I want to write this review differently. We love these characters so much, so I am going to break it down by character. No spoilers will be revealed for the characters. I will be careful.New characters are introduced in this book, but I will be letting you know about the familiar characters.- Feyre -So, the ending of the second book had us shook. For real. In the third book, Feyre is truly a badass. She is not taking any of Tamlin’s shit, let me tell you that. She is determined to find her way back to Rhysand and, yes she does, as noted above. When they reunite, of course there is the love-making. They wouldn’t be mates if they didn’t get it on, you know? Anyway...it’s a bit of an emotional reunion for Feyre, seeing her friends and such. Especially her sisters. We get a glimpse of them almost immediately, but I’ll talk about them lately. Throughout the book, Feyre is now a High Lady of the Night Court. She slowly learns how to control a room and she learns more about herself. This book really shows us how strong Feyre really is.- Rhysand -Right now, Rhysand is probably going through hell because he isn’t with Feyre and he isn’t sure when she will be back. It gets kind of worse when Feyre tries to get back to him. During that journey, their bond is silent. When they reunite, you get that giddy feeling reading their interactions again and I’m actually glad their separation doesn’t really last long. This is only if you ship them, though. In this book, I definitely got a sense of a struggle with Rhysand. It’s almost as if the ending of the second book and its events really made him vulnerable and he is definitely scared of losing Feyre and we learn more about his time with Amarantha when he was her icky love slave or whatever. We learn more things, too. I like this side of him, this vulnerable side. There are moments during the impending war where he expresses his fear of losing his family. I’m going to say that there is a moment with Rhysand where you stare at the book and you want to burst into tears. That’s all. No spoilers.- Lucien -Everybody wants Lucien. They wanted more of Lucien. I’m going to say, in my own opinion, that I was kind of disappointed in Lucien’s part of the story. I feel like there was not enough of him. He seemed to be absent, physically, for over half of the book. Before its release, I saw that people were excited to read more of Lucien and his POV. But, I was disappointed that it was lacking. I think his story isn’t over yet, though. There didn’t seem to be any closure for him. Hopefully, since this world continues, we will get more.- Nesta -Oh, Nesta. I think she is a love/hate character. We get more of her in this book and she becomes more likable, though still frustrating. Let’s just say the situation between her and Cassian drags and it just makes you roll your eyes. Not at Sarah, of course. At Nesta. She is so stubborn and it just annoyed me at times. However, with that aside, she definitely learns to become stronger and to accept herself as a Fae, which I find important. I mean, she doesn’t have much of a choice. She still has the attitude in her, but she has her badass moments.- Elain -Oh, man, It was heartbreaking to read about Elain and how she was handling things. I don’t know how else to describe it, really. It’s even worse when Lucien tries to interact with her with hardly any progress. In this book, Elain is stuck on Grayson. I mean, we know that isn’t going to happen anymore. But, it’s just sad. Again, with Lucien, I don’t think her story is finished. There are some unanswered questions. On a happier note, Elain learns to find her voice and her inner strength after what she went through. That made up for the rest of it.- Cassian -Oh, Cassian. He is still a smartass. But, something is definitely up with him here. I’m pretty sure it’s because of Nesta and her ignorance of him. He tries to hide the fact it bothers him, but you can tell it really does. We also see Cassian’s bond with Rhysand and how strong it really is; their fear of losing each other in this war. Cassian definitely wants to prove himself in this war and we see that, but some of the scenes were scary. Not sinister or anything. But, as a reader, you are very scared and worried something bad will happen to him. I’ll stop there, for your sake.I’m combining a few other characters together for one reason:- Amren, Azriel, Mor, Tamlin -Why are these characters combined? Well, let’s start with Amren. We only see Amren when she is helping Nesta and her connection with the Cauldron. There is a scene of betrayal, sort of. But, besides her AMAZING ending, she doesn’t feature that much.Azriel is kind of the same. He felt too much like a background character for me and, though there are scenes where you pray for him as you keep reading, I wish he was featured more. I don’t think he got much closure either.Which brings me to Mor. Oh man, we have a bombshell with her. I won’t reveal that, though. But, I wlll say her lack of closure goes with Azriel.Tamlin, Tamlin. I hate him, but I kind of don’t after reading this book. He spends most of the time just being pissy about what Feyre did, making innuendo jokes to get a rise, and just acting like a fifteen year old. However, there are moments where it seems he wants some kind of redemption or something. I will say that I do think he is still in love with Feyre, but I think his story is at an end. The closure is definitely there and hopefully he will find his own happiness.I want to reiterate that these opinions are my own opinions and how I felt about the book.Regardless of some of the negative opinions, I am still giving this book five stars. This book had me on edge and I’m glad but sad that this is the last full novel. Unless the book Gods and Sarah want to bless us with another full novel that isn’t a novella or something. I’m still praying.If you haven’t read this book because you are scared, don’t let that stop you. I was scared the whole way and I kept reading. I am very happy with this book and I loved entering this world again. This will probably be a series that I will definitely reread. That doesn’t happen often.Bottom line: You’ll always be wanting more of Feyre’s story.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maggie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHK2NMQGQWIWQM3CIOASA5PIYXJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19BPQ2XFOPF4X?ASIN=B01LOWN78Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars I Get the Hype",
                "reviewText": "5⭐️ | 1🌶️ (spice is questionable)Just finished ACOWAR and I have so many thoughts and feelings about this book. I get why people keep telling me that it’s their favorite or one of their favorites of the series. It’s like the past two books have lead up to this dense and complicated book.This book with which is crammed full of a little bit of everything. Which in turn makes you feel all the emotions, which I love from a book. Take me through the wringer and let me feel everything.There are some things that come full circle from previous book, which I’m a big fan of. And other things that just add to the lore and to the inevitable questions that arise throughout reading.I gave this a 5 star review because I really really enjoyed this book. I don’t know if I would put it on top past ACOMAF, but it is surely the second top for me. I also think that I gave it such a high ranking because of how enjoyable reading this series has been for me. Being able to talk and discuss with friends about it has made it infinitely a thousand times more fun.I ranked the spice low because I honestly don’t remember a whole lot of it. In the aftermath of finishing, the things that have stuck to me most is the calculating, the plotting, the revenge, the laughter, the sadness. So much happened in this book, it’s crazy to even try to separate what happened in acomaf to acowar. They seem to just blend together into one long story. But I loved it nonetheless.I will forever highly recommend this series to anyone who like romantasy, anyone new to it, and to those who have thought about it and aren’t sure. I say go for it, you won’t be disappointed I promise.I can’t wait to immediately start up reading ACOFAS!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C Blackburn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 15, 2024",
                "reviewTitle": "Beautiful",
                "reviewText": "Well, this series just keeps getting better. I had no idea how after the last one, but wow, Sarah did it! All the emotions, I cried, I laughed, I seethed, I loved. It was SOOOO good. Onto the next!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martyna KorzeniewskaMartyna Korzeniewska",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Poland on December 30, 2023",
                "reviewTitle": "Super",
                "reviewText": "Dotarła w dobrym stanie. Szybka wysyłka",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81EKNFuQtZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ugo Anzoino",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 11, 2023",
                "reviewTitle": "Bellissima serie di romanzi",
                "reviewText": "Bellissima serie di romanziConsegna perfetta",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shaljami",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 30, 2023",
                "reviewTitle": "Mesmerising Descriptions",
                "reviewText": "The third book in the series, Feyre returns to Spring Court as a spy and plays a ruthless game of deceit that does more harm than she intends. It is not long before Feyre finds herself in the middle of the war bubbling at the surface. While unlikely and likely allegiance take place, bracing for war never turns simple. Unexpected foes turn into friends, yet the enemy remains undeterred on war.The politics, gore, manipulations all web around this plot. The characters Feyre, Rhysand, Cassian, Mor, Amreen, Azrael along with many more hold impactful roles in the story. However, the character that stood out for me in this book, was definitely Tamlin, even though I would love to have read some more scenes with him in it. He turns more real for me than some other characters. His character arc is one, I will surely remember for a long time.The descriptions are detailed for each court mentioned and are so tastefully designed. It left me in awe of each of the seasons. Another masterfully crafted tale that carries themes like love, friendship, loyalty, war, humanity, loss and victory. So relevant to the present times, that it was quite unnerving.The climax has the right amount of revelations, confusions and subtle declarations and so much more. It perfectly knits together in the end. While this is the final ending to the series, the author has also penned two companion editions for the same. A series I recommend to all who enjoy this genre.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joanna TJoanna T",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 22, 2023",
                "reviewTitle": "The beauty continues….",
                "reviewText": "I mean, fantastic as always. Ate this one up in 3 days. Wish I spread it out to enjoy for longer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/610vV+SjHrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71yZhcGlAWL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}