{
    "remaining_requests": 115,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Book-Chaos-Starfell-Jessica-Renwick/dp/1775387100",
    "body": {
        "name": "The Book of Chaos (Starfell)",
        "price": "$12.16$12.16",
        "originalPrice": "",
        "rawPrice": 12.16,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Book-Chaos-Starfell-Jessica-Renwick/dp/1775387100",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41POa4Zl-0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Z-ktdIz0L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jessica Renwick",
            "link": "https://www.amazon.com/Jessica-Renwick/e/B07K61XG2P/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 572,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Renwick has designed an imaginative world for her story with rich details without letting description getting in the way of action. Book One of this series is a quick, delightful read that leaves you wondering what those kids will get up to next! - Goodreads reviewI thoroughly enjoyed this book. There was darkness, adventure, friendship, fantasy... it pulled me in from the first paragraph to the last. I can't wait for the rest of the series!! -Goodreads reviewThe story has wonderful characters in a charming setting that kept me wanting to read more. I myself can't wait for the next book in this series! - Goodreads review A must for children and adults who love Harry Potter and Hocus Pocus. I definitely will read Book Two and will buy a copy of BoC in paperback. Jessica Renwick has a magical talent for twisting words into an exciting adventure. -Goodreads review About the Author An avid reader and writer since she was a child, Jessica Renwick inspires with tales of adventures about friendship, courage and being true to yourself. She is the author of The Book of Chaos, coming this fall, the first in a fantasy series for middle-grade children. She enjoys a hot cup of tea, gardening, her pets, consuming an entire novel in one sitting, and her own outdoor adventures. She resides in Alberta, Canada on a cozy urban homestead with her partner, tiny monster dog, four chickens, and an enchanted garden."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 13 hrs 9 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 13 hrs 9 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"A FANTASTIC middle grade adventure that will keep your kids and even adults hooked from page one!\" ★★★★★Twelve-year-old Fable Nuthatch has something that nobody else in Larkmoor has—magic. But living under the roof of her overprotective aunt, she's forced to hide it from the world.When a strange book lands in her lap and her cousin vanishes into its pages, she follows, hurtling into an enchanted forest far from the rolling hills of her home. Starfell is filled with unusual people and mystical creatures. Here, she's accepted for who she is, and she's finally free to embrace her powers.But not everything is bright in Starfell. A darkness looms over the land, and her cousin is still missing. After following a trail of clues about other disappearances and the mysterious Fae Witch, Fable and her friends are confronted with a deadly secret—one that's connected to Fable and her family.With help from her peculiar new friends, Fable must learn to trust in herself or risk losing her cousin forever. Can she face the wicked secret hunting her and save him before it’s too late?\"Fantastic books to read to my girls. They are enchanted by these stories!\" (Amazon Reviewer) ★★★★★\"Zero sexual content. No gruesome, gory violence. Just a well written mystery/adventure book.\" (Amazon Reviewer) ★★★★★\"This is an awesome book for girls and boys alike.\" (Amazon Reviewer) ★★★★★\"She finished it in a week!!!\" (Amazon Reviewer) ★★★★★\"I am truly in LOVE with the world of Starfell!\" (Amazon Reviewer) ★★★★★\"Purchased for my daughter and she loved it so much we ordered the 2nd book!\" (Amazon Reviewer) ★★★★★Children's Literary Classics 2019 Middle Grade Gold Medal WinnerBook Excellence Awards 2019 Children's Fiction Gold Medal WinnerReaders' Favorite ★★★★★",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Growing Up & Facts of Life",
                "link": "https://www.amazon.com/Issues-Childrens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1084192"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Starfell Press (October 20, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 256 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1775387100"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1775387107"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 9 - 12 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ Preschool - 1"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 0.64 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#79,468 in Books (See Top 100 in Books) #527 in Children's Spine-Chilling Horror #2,277 in Children's Fantasy & Magic Books #2,991 in Children's Action & Adventure Books (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 572 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Frequent ONLINE Flyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3MXTVZ3MFBF73OQFYSXJZAV2AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1B4EELJRJUGG9?ASIN=1775387100",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Good for 10-18 yr olds",
                "reviewText": "Depending on how adventurous your young person is, this is a great adventure book for young people with parental guidance. It does deal with sucking the life out of people -- murdering them slowly - using others for your own gain, and various types of magic. If you are a Christian and you have children who are not solid in their Faith, you will want to wait a little bit to read this with them. You will want to be clear that this is an alternate world from ours so witchcraft in our world is not good since witches are pulling power from sources that are not Godly. However, this book has definitions that explain that Fable is a sorceress...meaning her magic comes from within. There is a clear good and evil side in the book. The witch in the book pulls power from nature. The wizard pulls power from unknown sources while learning to cast spells. The Lich is a witch gone bad. I read this as an adult. It has similar issues that Harry Potter had for parents of young Christians. While children can read stories with magic in it, as a Christian parent, you should always read it with them, ready to give an answer and explanation when needed. I think Jessica did a good job creating a unique world for her story. There were some unanswered questions by the end of this book, but since there are additional quest books, I assume the questions will be answered later. I highly recommend the book for readers who are able to enjoy the fantasy of the magical land without wanting to become a witch or wizard themselves. There is no sex in the book. However, there is a male gay couple. The gay couple is approached as matter-of-fact, but not glorified. As a Christian, I would have talked about this relationship with my children and explained that while we do not endorse a gay lifestyle and see it as simply another sin that people should not enter into, people have a right to choose their own path. If you are opposed to your children reading about openly gay relationships, you need to be aware that it is in there.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MK Tufft",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG46LAM6DZXN7FZ2R2M22VTQ55A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UD1CZ0P4RYOT?ASIN=1775387100",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2023",
                "reviewTitle": "5.0 out of 5 stars A magical story with notes of the Wizard of Oz",
                "reviewText": "This is a book of self-discovery with a magical twist. Fable doesn’t fit in. But when she’s tested, she finds a way to do the right thing. The alternate reality world has notes of Tolkien and the Wizard of Oz… let’s just say tons of creepy challenges to overcome. Along the way, Fable finds some true friends. This adventure is sure to become a classic.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sirah J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEPKKEIJE2GZZ2KBTARC4RN3LNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH73VFWR2E704?ASIN=1775387100",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 31, 2023",
                "reviewTitle": "4.0 out of 5 stars magical and a bit chaotic",
                "reviewText": "For her whole life, Fable has been forbidden from using the magic that sparks at her fingertips, but unbeknownst to anyone, an evil book has been waiting for the right moment to whisk her away. The magic goes wrong, and Fable’s little cousin is kidnapped instead, but finding herself in a magic land with a talking chicken, Fable is determined to save Timothy, no matter who gets in her way.I’m delighted to say that this book lives up to its magical cover and title. It had only a few copy editing errors, and while the plot was just a bit canned, it was still an engaging read with a lot of great ideas. The world building was creative, and the writing vivid and exciting. If I ever see the sequel available, I’ll be sure to pick it up.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLLIPVHBCO77NV7ZJA3BVPBPUEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PVGT3J0Q686S?ASIN=1775387100",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome",
                "reviewText": "A fun magical story about witches and a weird book. I enjoyed reading, so much that it didn't take long, as I was skimming to get to the end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4SERYO2EOYE2TXGTCQWSW2VD5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27UKJS9VIWXYZ?ASIN=1775387100",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderful tale",
                "reviewText": "This book would be great for middle school students who are intrigued by magic and mystery. This book was enchanting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynnzie6268",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCXRNNOJGY7ZCD5TPZHRJE3IP4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30DX6SYVWIH99?ASIN=1775387100",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2019",
                "reviewTitle": "5.0 out of 5 stars A captivating book, I truly like it!",
                "reviewText": "Wow! What a delightful and enchanting book this has been. A FANTASTIC middle grade adventure that will keep your kids and even adults hooked from page one. It's fast paced, great characters, lots of magic, some funny moments, well written and also with a heart, for family and sisterly/brotherly love which makes it even more appealing and charming.I truly had a lovely time while reading this wonderful book. I finished the whole story in just one day and wanting for more! Quite exciting and really enjoyed the twists and turns of the book as well. Highly recommended and can not wait to see the next adventures for Fable Nuthatch and her new found friends, very shortly. All in all, a five star review.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZIBJRBEWVSLCZNRMSVKVOS6EVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X9S1LO336ZAC?ASIN=1775387100",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2020",
                "reviewTitle": "3.0 out of 5 stars Fantasy adventure for ages 7 to 12",
                "reviewText": "This book is fabulous. I do have some feedback.Cons:1. Too fast-paced:Sometimes, quick reads are a good thing but not in this case. Before her final confronting with the antagonist, I feel they should have had more adventures and action to tell us about the characters in greater depht. We know very little about the personality of Fable and company, as the book felt rushed to the end.2. Don't stop it there!:The ending of the book felt incomplete. The overall storyline would have been much better if the author had added more on top of the ending. I'm not saying that I dislike the way the book ended because of a cliffhanger, I'm saying it wasn't satisfying to close the book as you finish it.Pros:1. The writing quality is so good!The writing was gorgeous and polished, the author's charm seeping into every page. The 'what happens next' feeling keep the pages turning, as you are submerged into a land of mystery and wonder.This is my honest opinion. I mean no disrespect to the talented, amazing being who wrote this, as me of all people know it is much easier writing a review than the actual novel.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2Z4FVCNJGGHCUDADEKNTFRAEYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA2LZYK81QYC4?ASIN=1775387100",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2022",
                "reviewTitle": "5.0 out of 5 stars A fun book for the family.",
                "reviewText": "We enjoyed reading this book and look forward to reading the rest of the series. Action, adventure and a lesson on the true meaning of unconditional love.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenna Bailey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 4, 2023",
                "reviewTitle": "Such a fun read!",
                "reviewText": "This is a perfect adventurous middle grade read. I loved it now, as an adult, and I would have adored it as a kid. Magic, friendship, and daring rescues… what more could you want?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LARA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 7, 2021",
                "reviewTitle": "Muy bien.",
                "reviewText": "Excelente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carrie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 15, 2018",
                "reviewTitle": "The Book of Chaos",
                "reviewText": "This is a true jewel amongst children's books. Fun characters, engaging plot, laugh out loud moments and poignant emotion. Fun tale, well told. Read this one to your children or, better still, have them read it to you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 15, 2020",
                "reviewTitle": "Read by my 8-year-old",
                "reviewText": "I got this book for my daughter, who read it in a few days. Despite an event she described as “scary,” she liked the book enough to read it more than once (and get over the “scary” part). These were her words: “I liked it and it made me want to read it again and again. And the book of chaos is cool because it’s magic and smoke tentacles came out of it.” She went on to ask me for the next two books in the series. I’d say she’s a satisfied customer.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tsarina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 3, 2023",
                "reviewTitle": "Good story but....",
                "reviewText": "Too sleazy and puerile for me. However his other series are crackingly good. So don't let this batch put you off or you will be missing out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.39",
                "sellerName": "symposia",
                "sellerRating": "5"
            }
        ]
    }
}