{
    "remaining_requests": 417,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Fairy-Tale/dp/B09R5ZPY6Y",
    "body": {
        "name": "Fairy Tale",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Fairy-Tale/dp/B09R5ZPY6Y",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ctosFnFiL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Stephen King",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Stephen+King"
        },
        "brand": "Stephen King",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 57718,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Winner of the 2023 Audie Award for Best Male NarratorA #1 New York Times Bestseller and New York Times Book Review Editors’ Choice! Legendary storyteller Stephen King goes into the deepest well of his imagination in this spellbinding novel about a seventeen-year-old boy who inherits the keys to a parallel world where good and evil are at war, and the stakes could not be higher—for that world or ours. Charlie Reade looks like a regular high school kid, great at baseball and football, a decent student. But he carries a heavy load. His mom was killed in a hit-and-run accident when he was ten, and grief drove his dad to drink. Charlie learned how to take care of himself—and his dad. When Charlie is seventeen, he meets a dog named Radar and her aging master, Howard Bowditch, a recluse in a big house at the top of a big hill, with a locked shed in the backyard. Sometimes strange sounds emerge from it.Charlie starts doing jobs for Mr. Bowditch and loses his heart to Radar. Then, when Bowditch dies, he leaves Charlie a cassette tape telling a story no one would believe. What Bowditch knows, and has kept secret all his long life, is that inside the shed is a portal to another world. Magnificent, terrifying, and “spellbinding…packed with glorious flights of imagination and characteristic tenderness about childhood, Fairy Tale is vintage King at his finest” (Esquire).“Good, evil, a kingdom to save, monsters to slay—these are the stuff that page-turners are made from.”—Laura Miller, Slate Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Horror",
                "link": "https://www.amazon.com/Horror-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=49"
            },
            {
                "name": "Dark Fantasy",
                "link": "https://www.amazon.com/Dark-Fantasy-Horror-Fiction-Books/b/ref=dp_bc_aui_C_5?ie=UTF8&node=9803"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "24 hours and 6 minutes"
            },
            {
                "name": "Author",
                "value": "Stephen King"
            },
            {
                "name": "Narrator",
                "value": "Stephen King, Seth Numrich"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 06, 2022"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09R5ZPY6Y"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#118 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #2 in Supernatural Thrillers (Audible Books & Originals) #7 in Supernatural Thrillers (Books) #7 in Dark Fantasy"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marilyn K.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKRBU22P3XWT364JDQVMOC6NFUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PLZ42OIOW2RB?ASIN=B09R5ZPY6Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Fairy Tale",
                "reviewText": "I am not usually drawn to books written by Stephen King but there was something that was very intriguing for me about Fairy Tale that made me want to read it. After I started to notice that so many of the people I am friends with on goodreads had given Fairy Tale such high praise, I decided to give it a try. I decided that if I determined that it was not for me I had at least given it a try. Within just a few minutes I was completely immersed into the plot of Fairy Tale. Stephen King created engaging and likable characters for the most part. I listened to the audiobook that was brilliantly narrated by Seth Numrich and Stephen King, himself. Since I had Fairy Tale downloaded on my kindle, I also read certain parts as well. It was fast paced, so creative and well plotted. I was glad that I decided to read/listen to this book since in my opinion it was a creative gem.Fairy Tale was told in the first person by twenty-four year old Charlie Reade as he looked back on his life the year he had turned seventeen. Charlie had been an only child. He lived in Sentry, Illinois with his mother and father. One afternoon when Charlie had been seven years old, his mother had decided to walk to town to buy a bucket of chicken for dinner. His mother left Charlie and his father watching a baseball game on the television. After buying the bucket of chicken, Charlie’s mother started to walk home. She was eating an extra piece of the chicken while she walked. As she started to cross “that G D bridge” on her way home, a truck came out of nowhere, hit her and she died instantly. Charlie and his father were devastated as they learned about her death. The only way that Charlie’s father was able to cope with his wife’s death was by drowning his sorrows with alcohol. Before too long, Charlie’s father was a certifiable alcoholic. Charlie was forced to grow up very fast. He became the caregiver for his father. When Charlie’s father’s drinking problems became so severe, he was fired from his job. Charlie envisioned that he and his father could potentially become homeless or worse. It was then that Charlie started to pray that his father would stop drinking. Charlie made a promise to G-d that day. If G-d would make his father stop drinking, Charlie would pay it forward and help someone else in need. Just in the nick of time, Charlie’s father’s friend stepped in. His father’s friend became his sponsor in Alcoholic’s Anonymous. Taking one baby step at a time, Charlie’s father found his way to sobriety.There was a house at the top of the hill on the street that Charlie lived that was known by the neighborhood children as the “psycho house “. One day, Charlie was walking home and as he was passing that house he heard a dog barking frantically. The man who lived there was quite reclusive. No one knew a lot about him and he seldom left his home. One of Charlie’s friends had warned him that he had seen the dog that lived there several years ago and that it was quite vicious. Charlie pondered about what to do. He thought that something was wrong. Charlie decided to climb over the fence to see. When Charlie got to the backyard, he saw that the old man that lived there had fallen off a ladder and was hurt very badly. Charlie called 911 and got an ambulance to come and help the man. The man’s name was Mr. Bowditch. It was just Mr. Bowditch and his dog, Radar that lived in the house. Mr Bowditch did not have a wife, children or any living relatives. Before the ambulance took Mr. Bowditch to the hospital, Charlie offered to take care of Radar and feed him for Mr. Bowditch. That was the beginning of Charlie making good on the promise he made with G-d. Over the course of Mr. Bowditch’s recovery, Charlie became his caregiver and the two formed the most unlikely but beautiful friendship that anyone could have imagined.Mr. Bowditch was not your typical neighbor as you might have already surmised. He hoarded lots of things in his house and he was opposed to modern day conveniences and technology. His t.v. was probably as old as he was. It had rabbit ears and an antenna on the roof. He was not in the possession of a cell phone or a computer and he had no desire to own one either. One thing was apparent, though. Mr. Bowditch loved Radar with all his heart and the same could be said for Radar’s feelings towards Mr. Bowditch. When Mr. Bowditch came home from the hospital, he began to confide in Charlie about some things. Mr. Bowditch had to pay the hospital for his stay and the surgeries he had. Charlie learned about the gold that Mr. Bowditch was in possession of and that strange noises that could be heard coming from the padlocked shed on Mr. Bowditch’s property. Mr. Bowditch revealed information to Charlie on a need to know basis. One day, while Charlie was at school, he got a call from Mr. Bowditch. Charlie could tell that something was wrong. Mr. Bowditch was having a heart attack. He needed Charlie to know some very important things. Probably the most important thing Mr. Bowditch revealed to Charlie had to do with the shed on his property. Mr. Bowditch told Charlie that within the shed was a well that led to the “other world” where the sundial existed. Years ago, Mr. Bowditch had gone on the sundial to make himself younger. Mr. Bowditch had shared this information with Charlie already. As Charlie continued listening to the all that Mr. Bowditch had to tell him, tears welled up in his eyes. Charlie knew that Mr. Bowditch was dying. By the time that the ambulance got to Mr. Bowditch’s house, he was already dead. Charlie took Radar to his own house. Radar became his dog on that day. Unfortunately, Radar was also quite old and didn’t have long to live. That was when a plan started to formulate in Charlie’s mind. He could not loose Radar too. Charlie would do whatever he had to do to find the sundial and make Radar young again.The next part of Fairy Tale took place in the “other world” known as Empis. The fairy tale characters were very creative yet believable. Charlie’s adventurous journey was full of discovery, magic, dangers, good, evil and monsters. Some of the scenes were gruesome and unpleasant but for the most part they were well plotted and even uplifting. The ending was quite satisfying and it tied everything up quite nicely. I found myself thinking about the characters long after the book ended. Charlie was my favorite character by far. I am so glad that I took a chance and read Fairy Tale by Stephen King. I highly recommend it.",
                "reviewVotes": "213 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "María J. Estrada",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRTXHKXAR67STMC55CMNYWSKK5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JU4RB83ZOH5?ASIN=B09R5ZPY6Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Who Says the King Can't Stretch Beyond Horror?",
                "reviewText": "Who Says the King Can't Stretch Beyond Horror? Nobody. Stephen King could probably write in any genre if he wanted to, and fantasy is one of them. Now, I had high expectations of this book because one of my all-time favorites is The Eyes of the Dragon which I always recommend to King fans. Fairy Tale wasn't exactly like that because the world-building crosses over from our world to another. The book is about 17-year-old Charlie Reade, who doesn't really think of himself as a hero (we will find out why at the end of the novel). Early on, he saves the life of Howard Bowditch, a crotchety cranky old cuss of a man. Soon the two develop a tolerant relationship, and Charlie discovers that Bowditch has an entrance to another world, Empis. Bowditch owns an aging female German Shepherd, Radar or Rades, who plays a key role in the novel.As the book description tells, the old man dies. He does so early on in the novel, which really upset me. He was one of my favorite characters, but that death and the information Bowditch reveals via a cassette tape impel Charlie to take Rades on a dangerous journey to save Rades, using a magical sundial to revert Rades' aging process. Sounds easy, right? Nope. Poor Charlie is going to go through hell before the story is over. In fact, I wasn’t prepared for the physical hardship he endures.Empis is not your typical fairy tale setting as a tyrant has cursed the land. Though there are beautiful aspects like red butterflies and overlarge creatures, many of the people are deformed and growing more deformed by a curse. Their skin is grey, and overall, the world is decaying. The only residents that aren't afflicted with this degenerative disease are the royals who will play an important role. I don't want to spoil the plot, but the royals are connected to the tyrant ruling the land. Charlie's quest grows greater than saving Rades, and he embarks on a coming-of-age tale to save the people of Empis. One of the royals he encounters is a princess, and yes, he falls in love with her, but this is not your typical love story.The novel is often dark because the kingdom has fallen so far from its former glory, and the people in the realm are dying a slow death. Charlie suffers through trials and tribulations along his journey which for me echoed the tone of the Talisman. It had the same depressing dystopian vibe to it. Nevertheless, I loved the characters he meets along the way like Dora who for all intents and purposes is the woman who lives in the shoe. There were many wonderful characters, including Hana who is one of the nastiest giants you will ever meet. The Snab was a magical cricket that is not what it appears, but even with all of these elements, the magic was twisted. Charlie reflects on how Empis is nothing like the fairy tales and definitely not Disney. It has many nightmare elements to it. There is a passage where he sees a caravan of refugees, suffering from the curse. There is another passage where he describes a dead mermaid in a fountain that was horrific.Another interesting aspect of the book is the way the chapters are titled which are accompanied by gorgeous illustrations; the titles are often elaborate. For example, chapter 27 is titled \"A Conference. A Snab. No Disney Prince. Prince and Princess. The Pact.\" Phew that is a lot. Many of the chapters have these engaging titles, and the illustrations accompanying them reminded me of old fairy tale books with ornate artwork. That in itself might nudge me to get the hardback if the price were to drop a little more, and I would love to see the art in color, but the Kindle versions are a treat.My one criticism is that throughout the novel, Charlie asserts that he has done horrible things and is no hero; when he finally reveals what he did, I was underwhelmed. He repeats this assertion so much, I thought he had killed someone or committed some heinous crime, but no, Charlie despite his being so hard on himself was a teenage jerk–one dealing with the death of his mother and a recovering alcoholic of a father. Was what he did bad? Sure, but not horrendous.This is not a horror novel, and it’s not a traditional fantasy novel, but it is a great coming-of-age tale. Plus, the ending is just beautiful, though bittersweet and realistic. Charlie is extremely responsible when it comes to the Empis portal and will not do as Bowditch did going back and forth between realms. There is a sadness to that choice because it’s not like CS Lewis characters that keep going back to Narnia. I mean who can resist a magical kingdom? Years after going to Empis, Charlie becomes a college professor, and as a college professor from Chicago who teaches composition, literature, and creative writing–that development was gold.I do recommend this book and hope Mr. King indulges his readers with more works of this caliber, using fantasy and/or magical elements (and like Eyes of the Dragon which should be a movie). In fact, I’ve been waiting for a sequel to Eyes of the Dragon for decades, but definitely read Fairy Tale.",
                "reviewVotes": "64 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noemie Lapierre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 4, 2024",
                "reviewTitle": "Great book!",
                "reviewText": "Stephen King strikes again. I don't know how he keeps writing great stuff with such consistency. Delivery was speedy and product was exactly as advertised.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leandro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 11, 2023",
                "reviewTitle": "Primeiras duzentas páginas são SK padrão. Depois, a história desanda",
                "reviewText": "A história começa interessante, King padrão. O autor sabe transformar o comum em interessante e consegue fisgar o leitor desde os primeiros parágrafos. As primeiras duzentas de Fairy Tale páginas não são diferentes. King consegue elaborar uma improvável história de amizade entre um adolescente e um idoso e seu cão. Depois que o protagonista desce a escada, as coisas mudam, e eu gostaria que a política de devolução da Amazon fosse ainda mais generosa.Se King consegue transformar o comum em interessante, ele também consegue transformar o que deveria ser interessante em banal. A motivação pro protagonista descer a escada e eventualmente arriscar sua vida é fraca, especialmente se comparada com a motivação do pai em Pet Sematary. É inacreditável que nenhuma das pessoas que o garoto encontra pelo caminho tente dissuadi-lo dos seus planos. O mundo que King cria é monótono; a jornada até a cidade é repetitiva (vá para a casa A, conheça Fulana, coma a sua comida deliciosa; vá para a casa B, conheça Sicrano, coma sua comida deliciosa; vá para C, etc); a gigante é uma piada de mau gosto; os guardas são genéricos, e a afetação do chefe deles é irritante; a vida na prisão, felizmente, me fez finalmente desistir da leitura. A sensação é sempre de que você já viu ou leu melhores mundos em outros lugares.Sugiro ler melhores obras de King (como The Body ou Dolores Claiborne) ou pular pra outro autor.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. GordilloJ. Gordillo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 3, 2022",
                "reviewTitle": "Apenas voy comenzándolo…",
                "reviewText": "Apenas voy comenzándolo, pero la voz principal con que está narrada (la del adolescente) y los personajes (el perro, el papá) se me hacen muy auténticos e interesantes. Me emociona seguir avanzando y descubrir cómo se desenvuelve la historia.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Tgb+uIChL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Siltone",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 28, 2023",
                "reviewTitle": "For two whole days I was totally engrossed!",
                "reviewText": "Oh boy, where do I start with this one? From the very first page this story pulled me in and never let me go. I’ve been reading Stephen King novels for well over 30 years and just love his style of writing, his character building, and his imaginative plot-lines. Some potential readers of this book may wrongly assume this is a retelling of traditional fairy tales (along the lines of Philip Pullman’s Grimm Tales) but they would be wrong. Yes, there’s a nod to characters such as Rumplestiltskin, but this really is an original story that revolves around Charlie, a seventeen year old student who gets the opportunity to enter a portal to another world - a place that just happens to have a ‘fairy tale’ feel to it, albeit with adult themes running throughout the storyline.As I’ve come to expect from Mr King, I didn’t quite know where this tale of his was going to take me, it certainly introduced me to some VERY weird, often grotesque, individuals, and the central character of Charlie found himself in all sorts of strange, dangerous and terrifying situations. I absolutely loved this book, which is why I found it difficult to put it down. In my humble opinion, for sheer escapism this book will take some beating. It had everything I could ask for from a King novel, it’s a superb, page-turner for sure, and it’s filled with intrigue, mystery, brilliant imagery, adventure, horror, poignant moments, and interspersed throughout with the author’s trademark humour. If you’re looking for a book to get lost in, then treat yourself to a copy of ‘Fairy Tale’ because I can highly recommend it. 👍📖 + 📚 = 😊",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heather",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on November 29, 2023",
                "reviewTitle": "Wonderful old fashioned storytelling with humor",
                "reviewText": "Finally Mr King wrote a real old fashion tale that is full of passion and humor. It is so well written and easy to read. There are small illustrations at the beginning of each chapter with short titles telling what is in the chapter. It feels like being a young teen again filled with the wonder and imagination of the worlds we secretly know exist and are depicted in this book. This might be my favorite and I am not finished yet. Savoring each chapter",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}