{
    "remaining_requests": 358,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Masters-Death-Novel-Olivie-Blake/dp/1250892465",
    "body": {
        "name": "Masters of Death: A Novel",
        "price": "$15.46$15.46",
        "originalPrice": "",
        "rawPrice": 15.46,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Masters-Death-Novel-Olivie-Blake/dp/1250892465",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81GCb6CIOSL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Olivie Blake",
            "link": "https://www.amazon.com/Olivie-Blake/e/B01MS0CF5G/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 947,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 13 hrs 47 mins",
            "FREE delivery Monday, February 26 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b?ie=UTF8&node=720360"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Tor Books (August 8, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250892465"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250892461"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.06 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.8 x 1.3 x 8.6 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,045 in Books (See Top 100 in Books) #979 in Romantic Fantasy (Books) #980 in Fantasy Action & Adventure #1,230 in Paranormal & Urban Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 947 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Heather R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4IOLMTISX3RYKE7JJZ3R3KDLVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JB3GPPFPFRHV?ASIN=1250892465",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Olivie Blake Never Misses!",
                "reviewText": "“Hello children. It’s time for death.”5 Brilliant Stars!I've said it before, but I'll say it again. There is something about Olivie Blake's prose that is so incredibly captivating and alluring that it demands attention. Her words live in my mind long after I finish one of her books and I find that I can't stop thinking about them. She's brilliant.In Masters of Death we follow Viola, a vampire and a struggling real estate agent. If she wasn't already struggling, the house she needs to sell is haunted. The ghost haunting the house was murdered and in order to move on, he needs to solve his murder.We have a lively bunch of characters that are a hysterical motley crew if you will - including a cranky ghost, a well-meaning vampire, a pair of annoying angels, a sly demigod and the godson of Death. Death with a capital D. While the characters are all supernatural and for the most part immortal, the book is really about humanity. They re all longing for feeling and human connection and the sensitivity of time.There is just something very interesting regarding discussions of morality within Masters of Death. The discussions around pain and how it ends up that it's life that allows us to feel anything at all was something that I really enjoyed reading about. Every theme explored was done so brilliantly, in beautifully constructed moments and captivating conversations.“I wish to feel something much, much larger than I am, the girl’s heart replies. I wish to stand on the edge of ruination and defeat, to leap into a chasm full of danger. I wish to feel my blood turn cold with fear and my cheeks burn bright with shame; I wish to feel joy that fills my lungs, and sadness that swells within me like a current. I wish to feel so much and so deeply that it washes over me in waves. I wish to drag myself towards something; I wish to lose pieces of myself along the way. I wish for hunger that drives me, for passion that fulfills me, for sensations of taking and having and losing and wanting, and I wish for all of it to come with a price, and a steep one—and then I wish for the courage to pay. Isn’t it all good because it’s something? she asks. Isn’t it all bad because beneath it—any of it, her wish sighs—I may collapse? Mayra”“But two centuries of anger had not served him nearly as well as one day of honesty.”“To love, to forgive, to lose, to live - it was always a choice, and thus, the fact that he was a mortal was finally one worth celebrating. Because it would end! Maybe that was the entire secret, and therefore the whole thing was actually astonishingly simple. That over and over, he was presented with the same impossible decision - live and suffer, love and grieve - but still, every time, with all his being, his answer was and would always be yes. It would be difficult and painful, and however it ended, it would end - but still, he could choose it. To live, to love; it was always a choice, and inherently a brave one, to face down certain doo, with open arms.”“Things are so much sweeter when they have an ending; things are so much more painful when they can be ripped away.”There is just something about supernatural and immortal creatures being thrown into the modern day world that, when done masterfully -I enjoy a lot. Masters of Death is a masterclass in showing, not telling, and I thoroughly enjoyed it from start to finish.✦•······················•✦•······················•✦✦•······················•✦•······················•✦✦•······················•✦•······················•✦Olivie Blake has so easily become one of my favorite authors- LOVE THIS.RTC - After work. 💗",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amber Garabrandt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB2UZSEAVENMKOZIZUZSSO6WWKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8UBX9QCABZLD?ASIN=1250892465",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars chaotic and jumbled... but what a ride!",
                "reviewText": "Honestly, I finished this one a while ago but have been on the fence about how I really feel about it. On the one hand, the premise is great and it has wonderful characters; however, it’s also a bit of a jumbled mess as far as writing style goes- I believe this was purposeful as it did add a little something. I like my stories to be more tidy, to have an even flow going from one part of the story to another… this isn’t that. This is drama and chaos and side stories that get tied up together toward the end when it seems like someone tapped the author and was like “wrap this up already, we wanna publish”. The part where we catch up with each of the characters seemed rushed considering the amount of time we took on everything else. It’s dialogue is often overdramatic (made even more fun with the help of the wonderful narrator that definitely understood the vibe here). That said, each side story was one I would have wanted to read as a full novel, each character was one I genuinely wanted to know. I was riveted by the going-ons with this group. Seriously, if we made little novellas about these characters, I would read them all. The cast of characters was unique and charming. What does a ghost, a demigod, a reaper, a sharlatan that can see Death, a demon and an unwilling vampire have in common? They all got roped into this. It’s fun and sassy with fabulous, often thought provoking lines… but it’s also sometimes exhausting. I saw one review that talked about how this wasn’t meant for people that wanted a plot laid out on a silver platter on page one. Lord, isn’t that the truth. The first third of the book you are enjoying the ride, but don’t really know where the car is headed… you’re just happy to be going. Or that was my experience. The chaos got to be a lot sometimes, but I loved it anyway. I enjoyed the ride, even if I still feel like the ending was rushed and maybe a tiny bit of a let down considering the amount of work we took to get here. The writing style is not one I would normally choose for myself as I can often get lost in the subplots and find the experience exhausting, but it was so good! Then there’s Blake’s portrayal of Death as a long suffering “papa”. I love when Death gets a bit of a makeover. You see them portrayed in a different light (my favorite is still “Suzy” from Reincarnation Blues by Michael Poore. I think about this book a lot, actually). The whole scenario was just charming. This is a fun read, but it is no way a fast or smooth one. There are twists and turns, much like a written roller coaster… but if you stick with it, it’s worth it. For me this was a four star book.⭐⭐⭐⭐Rating: 4 out of 5. As far as adult content goes…. well, this one has a bunch of foul mothed reprobates so obviously there is going to be a ton of language. There’s some violence and sexual content as well- not too very explicit, but something to think about. I would say it’s geared toward a mature audience but could actually be labeled as New Adult without it being entirely incorrect.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yen-Vy Le",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5RBBG45L6TH7GODRQQ6PYBKKZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37A9OM52SNLCN?ASIN=1250892465",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "5.0 out of 5 stars HOLY CRAP! INCREDIBLE IS AN UNDERSTATEMENT",
                "reviewText": "where do i even begin?firstly, this is the only book i have read from blake and i am blown away by her writing style. however it isnt for everyone as it is incredibly wordy and convoluted at times (however, i find that the charm of her writing i presume). the prose is fantastic.secondly, character-driven story lovers unite! their is certainly a character for everyone to root for. there is a ton of witty banter (done incredibly, i might add), and character backstories in the book. ALSO ROMANCE!!! it is sprinkled in the book and i adore the main love story (LGBT representation).next, this book will leave you confused and wanting answers. there are SO MANY twist and turns in the story. all to be sorted out for a great ending.lastly, this is nothing like i have ever read, and am confident will never find something like this again. the story itself is just incredibly unique. she manages to incorporate many known beings (creatures and entities alike) in a way that just works.this book made me feel so many different emotions and is truly a thinker. it was a little hard to start but abt 50 pages in i was HOOKED til the end. the themes of mortality and what it truly means to be alive and feel, wow. UGH I LOVEEEEE THIS BOOK",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maitê RodriguezMaitê Rodriguez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 18, 2024",
                "reviewTitle": "Lindo!",
                "reviewText": "Estava louca por esse livro, ele é ainda mais bonito pessoalmente. Apenas comprem!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81ltpvBduNL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81RxNF+fyTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81YbEsN9MOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81D7wa2nFAL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marjorie ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 22, 2023",
                "reviewTitle": "Excelente compra",
                "reviewText": "Llego en perfecto estado",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noyak",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 1, 2023",
                "reviewTitle": "What a treat !",
                "reviewText": "What a treat! I didn't expect to love it that much. The prelude hooked me up, and my love only grew as I discovered more of the story.I'm amazed my the structure, the storytelling. It is not a linear story, there is quite a lot of point fo view set in different moment in time, but I was never lost. And I loved all the characters! Huge love for Fox and Brandt, but Vi, Tom, Mayra and Cal aren't so far behind. Death was a good character too.The story is fun, with enough tension (internal and external) to keep things interesting as the charcters sort things out and finally get to the point where they can resolve one of the central obstacle, obstacle who help them resolve their other issues too.And let's not forget those love stories! I was fully invested in the three of them, even though, once again, I was more invested in Fox and his love interest. It was pretty clear from the start who would be involve with whom, but in a good way. Also, the relationship beside the love story ones are as interesting as the romance.This is definitly one of my favourite read ever, and I will gladly immerge myself in the story again.(And illustrations! So lovely!)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Enrique ROJO Bonillo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 10, 2023",
                "reviewTitle": "Excelente",
                "reviewText": "Excelente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ronnie the Robot",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 12, 2019",
                "reviewTitle": "BUY THIS BOOK",
                "reviewText": "I have read some of Olivie Blake's works before, but finding out that she had written full-length novels made me so excited that I bought two of them straight away. Master of Death is the first story I read and honestly, IT IS AMAZING. Olivie Blake has a style of writing that seduces you and puts you in a trance, and when you finish reading the world seems so much less than before. Key quotes will stick with you due to the beautiful and lyrical way they are presented to you. My favourite characters were Archangels Gabriel and Micheal, alongside the supernatural Alcoholics Anonymous pysedo affair going on (they NEED their own book!!!) and I keep rereading the sections they're in. Folklore and mythology and artfully woven in, and has made me extremely curious about the other forms of supernatural creatures there are in the world which differ from the mainstream ones. This is a book which is both heartbreaking and hilarious simultaneously - though I would say I was not invested in the main two pairings, that is more my preference than anything else - and the Immortal Game just... blew me away. Once I understood completely that is (a quibble which I address shall address now.The Immortal Game. An amazing conception, almost well executed. It makes totally sense why it was conceptualised, and why Immortals would play. And now, I understand why the only rule is \"Not to lose\".After reading the end section a few times, I mostly understand it. MOSTLY. I believe Blake has a background in philosophy, which really enhances her writing, but I think it would have been nice to have one precise down-to-earth (see what I did there) explanation that wasn't so artfully said that it was hard to fully comprehend. In other words, have one dumbed down explanation so us mortals understand! I love philosophical debates as much as the next person, and I totally get being very excited about your passion (I do the same with mine which is linguistics) but it slightly detracted from the amazing finale of the book where I STILL wasn't sure what exactly was happening. But tbf, I also was extremely stressed at the time with little sleep, so it is equally possible that I was just being stupid. Still.Another \"criticism\" (although this is more personal preference) is that (no spoilers) that one of the pairings seems a tad forced for me. I understand how it's nice to have a happily ever after ending (as that'll be a nod to the fairytale stereotypes) but I felt that two particular characters would be better off as friends. Perhaps if their relationship was expanded upon, the book was longer or there was a sequel (I don't think a direct sequel is needed, but one set in the same world with some of the background characters like Micheal and Gabriel, or the full story of the angel and the reaper? HELL YEAH!!!!!) then I would be okay with it, but I felt it was a tad too matchy-matchy. Male and females can be besties without romance!But honestly, disregarding those slight quibbles, this book was extremely good fun to read, and one that will stick with you for a while. Blake's humour is infectious, and it was full of laugh out loud moments whilst not diminishing the emotional rollercoaster characters will embark on. Also, whilst the front cover art confuses me (I'm not too sure what it depicts and I would have like to have a bit more cover) the character art inside is AMAZING. Seriously. And the way the key character had a portrait at the end of each chapter really did help for me to imagine the character, so thank you Little Chmura!In conclusion BUY THIS BOOK! You will NOT regret it :)",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$15.46",
                "sellerName": "Husband's Leftovers",
                "sellerRating": "5"
            }
        ]
    }
}