{
    "remaining_requests": 350,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ones-We-Burn-Rebecca-Mix/dp/1534493514",
    "body": {
        "name": "The Ones We Burn",
        "price": "$12.32$12.32",
        "originalPrice": "",
        "rawPrice": 12.32,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ones-We-Burn-Rebecca-Mix/dp/1534493514",
        "soldBy": {
            "sellerID": "A1QJ4UH6FW3UH1",
            "name": "ThriftBooks-Atlanta",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1QJ4UH6FW3UH1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Ub2u-ezYL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Rebecca Mix",
            "link": "https://www.amazon.com/Rebecca-Mix/e/B0BH53GNFK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ThriftBooks-Atlanta",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 227,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 46 mins",
            "FREE delivery February 27 - March 4.",
            "Or fastest delivery February 21 - 23."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17466"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Margaret K. McElderry Books (November 1, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 480 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1534493514"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1534493513"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 14 years and up"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL710L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 9 - 12"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.4 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 1.5 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#72,647 in Books (See Top 100 in Books) #104 in Teen & Young Adult LGBTQ+ Fiction (Books) #327 in Teen & Young Adult Dark Fantasy #331 in Teen & Young Adult Wizards & Witches Fantasy"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 227 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/efe9f655-ee99-4207-ad53-233a45945232.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/92adc68b-79ef-4fa1-a942-c7fd3e31ea0d.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kirsten ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV2G75HCCVDDHVC47KPOY6LKQFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33D9A4SFYKJ59?ASIN=1534493514",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars The Ones We Burn and the Ones We Pick Up",
                "reviewText": "Originally I was on the hunt for more LGBTQ+ books to read and I saw this and read that it involved witches. Two subject matters that I dearly adore and decided to pick it up! Despite these being my sole reason for starting this book, I found that the story offered a lot more which made it an enjoyable read. All of the main 4 characters are oozing charm and their interactions with one another really make them feel alive.If I had any issues it is that they didn't discuss the backstories of one of the other important characters in the book. They mentioned and talked about where they came from and strongly alluded/displayed that they were something far greater but it was never touched upon or explored. There was a time in the book when this character told our main character, Ranka, about their life in their homeland but we the audience didn't learn anything about them, we the audience were merely told that he told her stories. So we weren't given any details which I feel cheated out of. Though this is really minor in the overall story, just something I really wanted to know. Though if there was a sequel I would gladly pick it up in hopes that it did mention or focus its story on that character.I would highly recommend this book, it's a good story with solid characters and the artwork of the cover was so dreamy. I found myself imagining the whole book in that art style which really added to the experience in my opinion. (I know the style of the cover may not be important but this is how I ended up reading it and it played a crucial role in how I read the book.)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Naomi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUZLU6SJCRU6F34MW3REKFNFRLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B6B4F6464SVZ?ASIN=1534493514",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2022",
                "reviewTitle": "5.0 out of 5 stars Absolutely loved it!",
                "reviewText": "Ranka has known for a while now that she'll have to move south to marry the human prince, but she doesn't want to-- she doesn't want to leave her coven, she doesn't want to leave her home, and she doesn't want to reduce herself to the weapon she's been trained to be. But when her closest friend goes missing-- yet another witch mistaken for Ranka-- she embraces her duty. She'll go south, marry the prince, kill him, and rescue her friend in the process. But when she gets to Isodal, she finds a prince and princess at odds with her expectations of them. And there's something else, a rot that's brewing in the city, a concentration of the plague that's targeting witches all over the country. Ranka is forced to make a decision: work with the twin heirs to the throne in their pursuit to better the world, or work with the witches back home in theirs.From the beginning, I absolutely loved this book. Ranka's blood magic is fascinating and heartbreaking, and her position in both her coven and the world isolates her while elevating her above everyone else. The world, the magic, and the characters are lush, while being grounded in problems that feel very real. The group of people at the castle-- Ranka, the royal twins (Galen and Aramis), and Percy, the ambassador from one of the isles-- have a really wonderful dynamic that made me both laugh and cry at various moments.The Ones We Burn also does a beautiful job at tackling abuse, and what it means when the people we're close with, the people we love, the people who are supposed to love us, hurt us for their own gain. There are a few lines in particular that are exactly the words I wish someone had said to me years ago, and reading them both broke my heart and inspired me to keep choosing myself, to keep telling myself that I deserve to heal. The Ones We Burn is a fun read, but it is also a deeply powerful one, and I will forever be grateful to Rebecca Mix for writing it, and for putting it out into the world.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nikki",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4EK33AHIRHM5BLK5PJD6XJTNWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EPMVOBDHLS35?ASIN=1534493514",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2023",
                "reviewTitle": "4.0 out of 5 stars Good, Fast Moving Contained Story",
                "reviewText": "I was interested in LGBT fantasy novels and this one fit the bill perfectly. The witch covens have a weak peace treaty with the human based upon the witches offering up their strongest as wife to the king. A new king is to be crowned, and Ranka is the one to be offered.The entire story remains focused on this root conflict which helped keep it constantly moving forward and not meandering between a dozen different threads.While I enjoyed the story itself, the writing (specifically the editing) could have been better. My pet peeve with writing is when authors use the same phrases repeatedly, and while not super common, I was definitely pulled out of the moment a few times by it with this book. Everyone is \"holding back bile\" or cutting things into \"smaller and smaller pieces\".Still worth a read if you want a self contained novel with magic, violence, and people struggling to find what the right thing to do is.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Quinn Cas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5VGCVHMVYMQ6KYVNH43GPKPUHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZPWGSUYEVG5K?ASIN=1534493514",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2022",
                "reviewTitle": "5.0 out of 5 stars Fragile & Ferocious, one of my new favorites!",
                "reviewText": "Ranka will live in my heart forever.This book was exquisite. The exposition between monstrosity, gentleness, and vulnerability after abuse was so beautifully done, and Ranka’s slow unraveling towards her realization of the things she endured was so perfectly paced and agonizingly explored.It’s so evident that this is a story from Rebecca’s very bones, from some well of experience and passion deep inside her.This book is a rare jewel. 🥺 one written not just by a highly skilled author, but one who is also so passionate and invested in the story they're telling. This book will stay with me for the rest of my life, and while I wish I’d had it when I was younger… oh, I’m so glad I have it now.Note: I chose not to cancel my preorder but instead read this book critically after the infamous accusations of racism. Y’all… there’s just… no racism in here? I’m honestly so confused? There’s no black vs white theme, no atrocities committed against white peoples by black peoples; (minor, vague spoiler to follow) the twins are barely in control of their own city, and many of the dark and terrible things that happen are committed by white people pulling the strings behind the scenes.If you’ve been on the fence about this book for that reasoning, please give it a chance— read it thoughtfully and make that choice for yourself. I can’t imagine you’ll be disappointed.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2024",
                "reviewTitle": "DNF'd",
                "reviewText": "Could not get past the first couple chapters after she had to use her period to get more power. It gave me the ick which is upsetting because I was craving a queer fantasy story with a female protagonist. DNF'd",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joanna  P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 15, 2023",
                "reviewTitle": "I loved it very, very much",
                "reviewText": "I am not really the kind of person that writes reviews with like all these pros and cons and arguments about the plot or worldbuilding. When i read i can symply tell if I liked it or not in a subjective kind of manner. And ever since I saw a reel on Instagram from the author I couldn't wait to read it. It just has all of my favorite things. So i guess If you like the fantasy, the witches, the enemies to lovers, the family drama, the tension and the lgbtq+ your gonna at least find it okay.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}