{
    "remaining_requests": 354,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Shadow-Ember-Flesh-Fire-Book-ebook/dp/B08Z2ZJSR3",
    "body": {
        "name": "A Shadow in the Ember (Flesh and Fire Book 1)",
        "price": "$7.99",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Shadow-Ember-Flesh-Fire-Book-ebook/dp/B08Z2ZJSR3",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51r1jpA5DCS.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/51Bs20LQt3L._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jennifer L. Armentrout",
            "link": "https://www.amazon.com/Jennifer-L-Armentrout/e/B004E5J5N0/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 23493,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 New York Times bestselling author Jennifer L. Armentrout returns with book one of the all-new, compelling Flesh and Fire series—set in the beloved Blood and Ash world.Born shrouded in the veil of the Primals, a Maiden as the Fates promised, Seraphena Mierel’s future has never been hers. Chosen before birth to uphold the desperate deal her ancestor struck to save his people, Sera must leave behind her life and offer herself to the Primal of Death as his Consort.However, Sera’s real destiny is the most closely guarded secret in all of Lasania—she’s not the well protected Maiden but an assassin with one mission—one target. Make the Primal of Death fall in love, become his weakness, and then…end him. If she fails, she dooms her kingdom to a slow demise at the hands of the Rot.Sera has always known what she is. Chosen. Consort. Assassin. Weapon. A specter never fully formed yet drenched in blood. A monster. Until him. Until the Primal of Death’s unexpected words and deeds chase away the darkness gathering inside her. And his seductive touch ignites a passion she’s never allowed herself to feel and cannot feel for him. But Sera has never had a choice. Either way, her life is forfeit—it always has been, as she has been forever touched by Life and Death.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B08Z2ZJSR3"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Blue Box Press (October 19, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 19, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3406 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 647 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,582 in Kindle Store (See Top 100 in Kindle Store) #20 in Paranormal Vampire Romance #30 in Vampire Romances #80 in Romantic Fantasy (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 23,493 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/ab08ba2b-685a-4b38-82c0-785051e802f2.__CR0,0,3880,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/e734ec33-57f7-4fdc-881d-e133d14fbc8b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/9943e26c-23ab-437d-998a-6eda8974b083.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/e55588ee-da29-4bbd-b47b-d9867795eed2.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mac M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFSZ3FQJJT6SYCG7GHDMUDBXPMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMYFXG0A85DEG?ASIN=B08Z2ZJSR3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Absolutely Devoured This Book",
                "reviewText": "This book really adds to the other series by Armentrout - From Blood and Ash. Both series are exceptional. A Shadow in the Ember is so well-written; an amazing story line with plot twists and plenty of sauce. 100% recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Natalie Robbins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHKRAIHU7P2BMHMD4VB767RTMTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XISESVRR87LW?ASIN=B08Z2ZJSR3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic!",
                "reviewText": "I am currently reading this book in tandem with the Blood & Ash series, and I could not recommended both series enough. Can’t wait to see where the next book leads!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amands Braley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAQHZ6KTXIDL2ZK2WESC3DYDLZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IEBJ14Q10B67?ASIN=B08Z2ZJSR3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "4.0 out of 5 stars A Mesmerizing Dive into Darkness",
                "reviewText": "Rating: ★★★★☆ (4/5)Jennifer L. Armentrout's \"Shadow in the Ember\" is a mesmerizing journey that immerses readers in a world where characters, plot, and a forbidden romance are intricately intertwined.The Characters (★★★★☆):\"Shadow in the Ember\" introduces us to a fresh set of characters that bring a new dimension to the Blood and Ash world. Seraphena, the fierce and determined protagonist, is a captivating figure whose journey from vulnerability to strength is a testament to Armentrout's skill in character development. The enigmatic Primal of Death adds a dark allure to the story, and his complex personality keeps readers guessing. Together, they form a dynamic duo that propels the narrative forward, and their emotional depth makes their connection deeply resonant.The Plot (★★★★☆):Armentrout's storytelling prowess is evident in the rich and intricate plot of \"Shadow in the Ember.\" The book ventures into the realms of darkness and death, unraveling the mysteries and political intrigues of the Ascended world. The plot is laced with tension, action, and surprises, which makes for a gripping read. Armentrout's world-building continues to shine, offering a fresh perspective on her well-established universe.The Romance (★★★★☆):The \"non-romance\" between Seraphena and the Primal of Death is a central theme that sizzles with tension and allure. Armentrout has a gift for creating chemistry that sparks off the pages, and this pairing is no exception. The intensity and complexities of their relationship make it a compelling focal point of the story. The fighting nature of their attraction adds an extra layer of depth, keeping readers eagerly anticipating every stolen moment.In conclusion, \"Shadow in the Ember\" presents a captivating exploration of new characters and a forbidden romance within the Blood and Ash world. The characters are richly developed, the plot is engaging, and the romance will be well earned. This book is a must-read for fans of the series who are ready to embrace a new, thrilling adventure in the Blood and Ash universe.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4S4RARKCUDDXB37VVJ3S3LVR6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFDCM7ERU40ON?ASIN=B08Z2ZJSR3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars 💕",
                "reviewText": "Loveeeeee!!!I couldn’t put it down! Hands down one of my favorite books! I’m so excited to read the second book!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDGSDRC2AZXZIH2OSO2MOI26PKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA4MPWSVG15WC?ASIN=B08Z2ZJSR3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2021",
                "reviewTitle": "5.0 out of 5 stars Simply amazing!",
                "reviewText": "Actual rating is 4.5 stars.I got an E-ARC copy of this amazing story in exchange for an honest review by JLA, so I'm about to get real with you!It should come as no surprise to all of you that once again, queen JLA is releasing another book series and she killed it!I mean it's hard for me to describe to you how good it was, because it's like I've said this at least 20 times with Armentrout's books, they are great. There is nothing less to it, every story she puts out, it's just amazing (to me anyway.)A Shadow in the Ember is no exception.You might be questioning my rating if literally paragraphs ago I said it's an amazing book, and it is, but there were a couple of things I felt a bit repetitive.Sera and Nyktos remind me of a couple Armentrout already introduced us to. They are amazing on their own way, but at the beginning it felt like rereading one of her other books. Though it quickly changed, it still made the first like 20 percent of the book drag on a little bit.But I think the reason why it was a little bit slower to begin with is because of what was to come.I cannot explain to you how good this story is without giving you major spoilers, but I will try.Seraphena is a Maiden. She was promised to the Primal of Death as his consort. She has been trained, but not in the way you might think. She was trained to bring the Primal of Death to his knees. She is expected to end him. To use love as a way to end him and end with a century's old debt.Sera is ready for this task, but somehow she fails miserably, why you ask? Because the Primal of Death has no need or want for a consort. So it's her fault (not really, but that is what she believes,) everyone and their grandmother blames her for it. So now she is trying to fix it somehow, she has no idea how, but she is looking for a solution.She is a trained assassin, she can kill you in less time that you'd have to blink, so maybe that will help... if it doesn't get her in trouble first (spoiler alert, it does).This story is all about Sera, about her journey to accept what she really is and what she is worth. There is a silver-eye-god that's gonna be there and they will have a fun time learning all about her and what she is capable of doing.There is so much that happens in the first installment of this series that if I tried to describe everything about the book, this post would be infinite, so I'll just summarize a little bit some of my favorite parts.There is death, that is something you should expect a lot of, but also some of it it's not in the way you might be thinking of.A silver-eyed god.Banter.Ash.Exciting lake scene.Ash.Power, her gift is just… *chef’s kiss* but at the same time, could be dangerous.Banter.Asher.Sexy banter.Nyktos, ruler of the Shadowlands.Amazing entrances.Nyktos.Blood. Lots and lots of blood.Lives (that will make sense eventually).That ending. Oh gosh, I mean I was kind of preparing myself for that, I kind of had a feeling, but it was still pretty epic.But most of all, NYKTOS.I mean, you guys just got to read this story, it’s amazing, I think you will really enjoy it and it will bring a lot of joy to your life.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yuni AB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 15, 2024",
                "reviewTitle": "Para amantes de la Alta Fantasía (High Fantasy)",
                "reviewText": "Me gustó mucho este libro porque me encanta leer libros de Alta Fantasía (High Fantasy), dígase que el autora/autora crea un mundo ficticio muy diferente al nuestro, en donde vas aprendiendo más de este universo conforme avanza el libro (incluyendo sus países, costumbres, creencias, etc.). Lo recomendaría a personas que disfrutan del Romance-Fantasía y de leer mundos imaginarios, aprendiendo las reglas de estos para poder disfrutar del libro.En particular me encantó la protagonista, una mujer fuerte, y el interés amoroso, que es más del tipo misterioso.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lê",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 22, 2021",
                "reviewTitle": "Shadow in the Ember",
                "reviewText": "The first book in the series Flesh and Fire introduces Seraphena to a young woman who was created with only one purpose, to seduce Nyktos and kill him so that her kingdom can be saved. What I like about Jennifer's books is that she's in no rush to get the story started. I love big books, but I can't deny that while I was reading, I wondered if all that at the beginning of the book was necessary, but then it became clear that it was, I came to understand along the way that some plots were appearing that if she hadn't shown all the precarious reality of that realm, maybe we couldn't understand the true weight of Sera's actions as well as everything she discovers later. Sera reminded me a lot of Poppy, although I think the first one was even crazier and will definitely get more development, I already love her as well as Poppy. Nyktos is wonderful, a lot of people are saying that they prefer him to Casteel, but I honestly came to love them both on the same level (if that's possible). Like Poppy and Casteel, the couple in this book don't resolve their differences in the first book, there's a lot of DR out there, but I know that with the plot we were shown at the end of the story, this could end up resolving faster than looks. I think that's what I like best about this author, she's in no hurry to solve everything in one book, I think that's why she's the queen of the cliffhangers. I think of the authors I read And I'm a fan, Jennifer is one of the most creative when we talk about a plot twist, and not just one, her books are crammed with smaller plots and at the end of the book you practice freaked out with so much revelation. In addition to revealing a lot about their history, we came to understand more about Poppy's powers that I almost had a heart attack reading. I hope the second book doesn't take long to come out. Because you can't finish a book like that and make us wait another year to know the result. Looking forward to The war of the two queens.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julie M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 20, 2021",
                "reviewTitle": "Another 5 star read from the Blood and Ash world...",
                "reviewText": "Once again, I am at lost as how to start my review and this is often the case when it comes to Jennifer L. Armentrout’s books. I’m going to try and make this review as spoiler free as possible.I knew that I was going to love this new series from the Blood and Ash world, but I wasn’t expecting to be as enthralled as I was with the Blood and Ash series.A lot happens throughout this book and even if sometimes it doesn’t seem like a lot is happening, you still can’t put the book down knowing just how unpredictable Sera’s mind can go and you never know what she will do next (when you wish you didn't need to work, sleep, eat or that you always had energy to read).Which brings me to the two main characters…Once again, Jen has cooked up characters that are so interesting and entertaining. She always has some awesome sassy heroines and Sera isn’t the exception. I loved how she isn’t afraid to speak her mind even if it can get her in trouble; more often than not. She also has such a beautiful heart even if sometimes she tends to forget that. Often, she finds herself questioning everything and that reminded me so much of another book character *cough* Poppy *cough*.The Primal of Death is… Wow… He’s honestly such an intense character. I always felt like even if he will protect at all costs the people that he cares about, he has a lot of trouble demonstrating what he’s feeling probably due to everything that has happened to him and because of what he is. But he was such an interesting character to discover throughout this book and I cannot wait for the next book and see more of him.But Sera and him together were such an amazing duo. Honestly, their chemistry was off the chart bringing any arguments between them to another level. But like for a lot of characters Jen has written, she has a way to find characters that will both bring the best and the worse out of each other but who also fit so perfectly together somehow.A lot of characters come and go in this book and so many of them you will love, and others will leave you with the envy of slapping them across the face (I’m actually just being nice because let’s be real, I would have done more sometimes).Overall, this was such an amazing book and even if the ending leaves your mind blown and in need to have the next book in your hands; you can’t resist the pull of this book. I honestly loved it from the beginning to the end and there are so many things I can’t wait to discover along the characters and see where their journey will continue next.Also be prepared to go through an eruption of feels with this book as you are more than likely to invest yourself in these characters and what they are going through. You will be pulled from one to another to another and back to the first feel before you know it.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jozy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 2, 2024",
                "reviewTitle": "love",
                "reviewText": "Wow a first book amazing love the humour and the story line so far gripping! Hopefully there a journey to come I’m certain there is",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alice",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 12, 2024",
                "reviewTitle": "Une merveille !",
                "reviewText": "Ce livre est magnifique ! Il nous permet de rester dans l'ambiance du sang et la cendre.Si vous êtes français et vous voulez le lire en anglais, le niveau est assez ardu mais on s'en sort ! J'ai bcp aimé nyktos ! L'intrigue est bien amenée et le suspens nous maintient en éveil tout au long de l'histoire.Le gros plus à mon sens est le côté enquête de l'histoire.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}