{
    "remaining_requests": 311,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Court-Thorns-Roses-Paperback-books/dp/1639730192",
    "body": {
        "name": "A Court of Thorns and Roses Paperback Box Set (5 books)",
        "price": "$55.80",
        "originalPrice": "",
        "rawPrice": 55.8,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Court-Thorns-Roses-Paperback-books/dp/1639730192",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81h4xinmqmL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sarah J. Maas",
            "link": "https://www.amazon.com/Sarah-J-Maas/e/B0070291GK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 17837,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23. Order within 13 hrs 40 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bloomsbury Publishing (November 1, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 2896 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1639730192"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1639730193"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 5.6 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.62 x 7.45 x 8.31 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#19 in Books (See Top 100 in Books) #13 in Romantic Fantasy (Books) #17 in Fantasy Romance (Books) #23 in Epic Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 17,837 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNZCCMUKY7VI22GGKHVYSYF3HEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35ZWGDOJEBTET?ASIN=1639730192",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Great fantasy series, not feminist literature.",
                "reviewText": "If you like spicy romance novels and you like high fantasy novels, you will like this series. It is an adult series for adult themes and adult scenes, not just spice, but also gore/war/torture, and that is important to note. This series has its own magic system and mythologies, and is connected to other universes of the author including Crescent City and Throne of Glass but can be read on its own. I think it is a really good series.SPOILERS (not heavy spoilers but will talk about things which happen in the book in a general sense) for conversation about feminism/fascism/mental illness.Many people want a high fantasy series which is feminist in nature and the male love interests are feminist, this is not that kind of book. It definitely has feminist undertones and female empowerment undertones, it is written by a female author which historically high-fantasy books in a female lens have been shunned so I prefer to support female authors, but the love interest does many things which are not feminist.The male love interest in this book drugs her and dances inappropriately with her, and then claims there was no other way to make the villain think he didn’t care about the protagonist and put her in danger. That is pretty unbelievable, there are a million other options that do not include drugging someone in that situation.The male love interest “rescues” the protagonist and brings her to a place which only his friends and family, for hundreds of years of relational ties, are. This technically is a social isolation happening. This is apparent when 5 books later the love interest is not only still lying to the protagonist, but getting all the friends and family to lie for him about something that directly and drastically affects her life. She technically is supposed to be the same level of power that he is, but it is very clear that was a stunt to show symbolically how much he cared for her. Because if she truly had the same power as him then the friends and family would not have lied like that, the same way they would not have lied to him. The other thing about that is she was raised to her status without any well learned political or historical education of the people she is ruling, giving the male love interest good reason to be able to over-ride anything she put into place, and not giving her enough knowledge to truly do her job. What also goes along with this is that all education on those political historical topics will have to come through him or people whom he is employing/has these strong ties with.There is a race of people which the love interest rules over who are physically and sexually abusing females, and neglecting/abusing their male children to be warriors. The love interest claims to have put laws into place to prevent this, however, he does not enforce them. Similar to how he symbolically gave the protagonist a position of power, he seemed to have symbolically put a feminist law into place but then not follow through. It is claimed the abuse they are facing is culture, and to give the males more time to change, which is obviously untrue and harmful. “He will change” rhetoric harms women often. I think the way the fantasy race and issue of female violence was written was realistic, but I also think that realism is disturbing because of his unwillingness to be harsher in punishment towards males who are literally physically altering these females. It also is somewhat insinuated there is fascism going on because of his obsession with keeping one “good” city safe, and his distaste for the sexist race of warriors and the other city - which he oversees and is in charge of. It is almost like he believes their lives lost causes and something to be used to protect his favorite city and people, which is obviously harmful to the people who do not live in his favorite city because their ruler has abandoned them to harm in belief of culture.Again, this is a fantasy book, I do not believe this to reflect the authors beliefs on feminism or humanitarian efforts, but if you personally are looking for a high-fantasy book with a feminist love interest, this is probably not the one.Lastly, the last book has a topic of mental illness- specifically substance use issues. This book was so difficult to read as a researcher in psychology because of the abuse the protagonist faced and how she got better despite, in real life, this person would likely be far worse off. What I mean by this is the protagonist was unliked due to a disability she had in childhood, inadaptibility which is something that happens in children groomed to be married off (groomed meaning taught to be something very specific, particularly in a way of being sold to the highest bidder and marrying a wealthy male). Her sister took her meaning for life by marrying someone powerful and rich without any of the efforts and grooming which the protagonist faced in childhood, so all her trauma no longer had meaning and she no longer felt any reason to be alive. After this she developed an addiction to alcohol and began sexual risk taking behaviors. What her family did was ridicule and shame her but also enable her with money. Shame results in a cycle of wanting pleasure, so doing this was worsening her behavior. After the family got fed up with her wasting money, instead of setting boundaries and no longer buying alcohol, they threatened her life, took away her autonomy, verbally and emotionally abused her, isolated her, and then the person in charge of helping her developed a sexual relationship with her (which is supposed to be romantic but when she already struggled with risky sexual behaviors, this was taking advantage of her). On top it, a scene occurs where she essentially is noted as suicidal, and instead of helping her he continues to be short, rude, and mean to her and forced her to hike (???). And this was because she pointed out a lie which the whole family was keeping from her sister by her love interest, so the protagonist of this book was being punished for giving information which her sister had a right to know. It is just so incredibly hard to read.Of course, these people do not have psychology or mental wellness, however, I think the part I take most issue with is the unrealistic fact she gets better. Because this is a popular series I would also be concerned with people taking the idea that this sort of behavior towards someone mentally ill is romantic or okay in any way shape or form. This is fantasy, most people know that, but I feel compelled to state it anyway. Overall:I do like the books, I like the writing style, I even do not mind many of the character flaws and the big issues I mentioned occurring, it adds to moral/ethical calamity and makes you question who is the real villain or hero. But, I have seen people stating that this is a more feminist style high fantasy romance and I just wanted to point all the reasons I do not believe that to be the case.",
                "reviewVotes": "62 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah Lynch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQT63WUN7RFKDWDOA6QHKKTQ7EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KZMGEF61UYTF?ASIN=1639730192",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Just read them",
                "reviewText": "Yes - just succumb to the social pressure to read this series. Listen to the Tiktoks and your annoying friend who keeps telling you to read them. Don't let your pride or your desire to go against a trend get in the way of you enjoying one of the absolute best fantasy series I have read in years. Takes me back to when I was young and discovering Harry Potter, Percy Jackson, LOR for the first time. Except, for adults. As dark and sexy as you hoped. If I had read this during formative years I would have turned into an absolute menace. Maybe I found them at exactly the right time. You will not regret diving into this world. Enjoy the escapism. Enjoy the complex female characters. Enjoy the smut. Enjoy a world crafted by someone who clearly puts love into everything she creates. Can't wait to read SJM's other work now, she is a modern classic.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tanya Mynar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIYVNB24DVFQU6GV3UXB3VQLDBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P5XPB32Z7TH0?ASIN=1639730192",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars couldn’t get enough",
                "reviewText": "I heard about the series on a podcast that mentioned “what book is making women horny? And the answer was court of thorns and roses” so I read a sample. The writing was good so I bought the ebook bundle. I was halfway into the first book and loving the development of the characters but hadn’t really found any racy passages. But I had spent the money so I kept going. So glad I did, I fell in love with these imperfectly real characters. I laughed and cried with them. I couldn’t get enough and I kept reading into many nights, on my lunch breaks any spare chance I had. I will miss them, I hope she writes more, they have a so many more stories to tell.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGERTCRPQ2VMQMOZIPVEERS24ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P8UXY5UYMXJA?ASIN=1639730192",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect Condition",
                "reviewText": "About the box set: I snagged this box set on Black Friday and was a little concerned about the shipping. Turns out I had no reason to be, this was in perfect condition! No issues with the print of the books either.About the book: I almost stopped reading this series 40 pages into ACOTAR. Thanks to all my friends persistence, I pushed through. And LET ME TELL YOU I am SOOOOO glad that I did!! This series is full of love, adventure, mystery, heartbreak, and \"ick\" characters (trust me, it doesn't deter you).I will forever recommend this series, as well as the Crescent City series, to anyone (haven't read ToG yet). I know there's lots of mixed feelings on Sarah's work, but if you're looking for an exciting series that you can theorize over and simply just enjoy, this is it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yesenia RamosYesenia Ramos",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL4BEHWGJ6PZ7V4UUWGLW6IFH3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XLEHN6NEZBA3?ASIN=1639730192",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Gorgeous books, but damaged cover and some pages",
                "reviewText": "The book itself is a 5 stars. The feeling of the hardcover books and the smell of paper!The shipping sadly damaged my cover, a few of the pages were bend as well. It sucks paying almost $90 and to get a damaged cover and some pages. Other than that. I am excited to read the series and more of her books",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71FnTnmFfaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71X-ViEKTdL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71dIlZ9eteL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLKFA45ONN4WH4PHFJNM5ZTJXOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OC47228GFB73?ASIN=1639730192",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Exceptional Series!",
                "reviewText": "I have the paperbacks of this series, but when this deal came up for the hardcovers of the books, I had to have them. I enjoyed this series very much. Of all the books I have read, it is my favorite series. The fantasy world is so full of great world building and vivid descriptions. The characters are richly developed with strengths, weaknesses, vulnerabilities, and passions. You grow to deeply care about them and everything that they are dealing with. Sarah Maas writes so that you can see everything in great depth and feel exactly what the characters are experiencing. Picking up any of her books would be very rewarding for any reader.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mallori",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVXECR32K7GT3AYKBTP4RUHYRVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMFXXILD64RKO?ASIN=1639730192",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars Very Stiff Hardcovers",
                "reviewText": "Love this series, read it twice in 3 months. But these hardcovers are physically hard to read. It takes a lot of effort to keep the books open. And there's a gap between the back of the pages on the actual spine for all of them. So this seems to put a lot of strain on the end papers. I've noticed on the thicker books that it's starting to pull away from the glue on the insides. The books are also noisy and creaky when reading them because they are just so stiff. Kind of hurts my hands. But this series is worth the struggle. Hardcovers are a lot harder to break in than paperbacks, but I wanted them to last. Kind of wish I ordered floppy paper backs instead... I think the quality was lowered bc they are mass produced",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melanie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 31, 2023",
                "reviewTitle": "chef's kiss 5/5 <3",
                "reviewText": "**SPOILERACOTARThis was my first fantasy romance series, and OMG I’m hooked. Was I confused the entire time, yes, but that didn’t stop me from eating this up bc everything made sense at the end.I don't like the Beauty and Beast trope, but those last 100 pages were incredible.Tamlin wearing a mask, I got the ick.I couldn’t solve the riddle either, don’t worry Feyre.ACOMAFI laughed, I cried. I was mad, then happy. WOWACOMAF came and just flipped my whole world around. I was up till 5am reading.Feyre changed bc of what she went through under the mountain, but so did Tamlin, and because they are both struggling with their own separate traumas neither can communicate what they need from each other. The relationship became unhealthy and no longer compatible.There was a ton of additional world building and character introductions that I was just not prepared for. Feyre’s character development, incredible. Rhys brings out the best in Feyre, always treating her as an equal with autonomy and her own choices. Rhys has that dark edge, charm, wit and humour, but you also get to see his vulnerabilities, his huge capacity to love and found family of the Inner Circle.Also I love how SJM writes every character as the most beautiful.Despite a seemingly 'happily ever after ending,' the horrors of the end !!! The cliff hanger is making me need to read the third book ASAP.ACOWARI loveddddd the politics in this one! I’m so obsessed with this series. I was loaning the books out from the Library and after reading this buckled down bought the entire series knowing I was going to be re-reading this. There were so many tiny small details from ACOTAR that come back in ACOWAR.The last 100 pages are like being in a tornado of emotions - sad, happy, joy, anger, understanding, forgiveness, hope etcTBH, I kinda wish someone actually died in the battle :/ but SJM loves a ‘happily ever after’ ending after all.ACOFASI read this novella in 1 sitting. She’s small, but she throws punches! I really liked the domestic story and all the POVs. But they say “mate” 20 million times.I’m patiently waiting for the next part of the series: Nesta, Elain, Lucien, Cassian and Azriel.I really hope that Nesta and Elaine’s mates are not Cassian and Azriel tho. That would be too cliche if the 3 sisters were mated to the 3 Night Court warriors. SJM needs her happy ending.The sneak peak at the next book is, chefs kiss :* but seriously ofc Nesta and Cassian get together.ACOSFThere are drugs in this, and I couldn’t stop reading all 750 pages.I had to put this book down so many time and just stay silent with my thoughts.Cassian’s passion to train the women to fight back against anyone who attempt to hurt them like they had his mother, and Nesta still feeling nothing after having been Made against her will… woah it broke my heart.Nesta character development INCREDIBLE. She constantly was taking steps forward, but back tracking. The friendship with the House, yes. Building her found family of Gwen and Emrie, amazing. Her internal battle for her own self-worth is heartbreaking and inspiring all at once.I kinda hate how Rhys didn’t tell Feyre about the pregnancy scare and health risks… like this dude for 3 books (plus 1 novella) always gave Feyre autonomy and choices of what to do, and he took that away from her. It’s a no from me.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AleS.AleS.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 27, 2023",
                "reviewTitle": "En perfecto estado",
                "reviewText": "Llegaron un poco antes de lo establecido y venían sin ningún detalle. La envoltura protegió muy bien la caja con los libros y los mantuvo intactos. Vi otras reseñas donde llegaban dañados y me dio cosa que llegaran así pero nada que ver.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81fJTQDne3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zdIL5JGDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71uPhPJahPL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "rosemeri",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 27, 2022",
                "reviewTitle": "vale muito a pena",
                "reviewText": "produto lindo, perfeito, chegou mega embalado , já que é comprado por colecionadores do fandomacotar , tiveram o cuidado de não deixar nenhuma pontinha do box amassar....quem ganhou de presente amouuuuu.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ingela ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on February 9, 2024",
                "reviewTitle": "Allt fungerade bra",
                "reviewText": "Inte så lång leveranstid och levererad till bron.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Perrrrfeecct 💋Perrrrfeecct 💋",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 14, 2024",
                "reviewTitle": "Perfect condition of the product ☺️☺️☺️☺️☺️",
                "reviewText": "The media could not be loaded. 🥰🥰🥰🥰🥰🥰 love it 😊 perfect condition of the product...no problem in printing or none any kind of damage 🥰👍👍👍👍👍👍",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71lm1Lqsj6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71I3jYbVOjL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/E1BfVY81RcL.mp4"
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$54.14",
                "sellerName": "prime_saver",
                "sellerRating": "5"
            },
            {
                "price": "$54.99",
                "sellerName": "Apex_media🍏",
                "sellerRating": "5"
            }
        ]
    }
}