{
    "remaining_requests": 414,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Where-Forest-Meets-Stars-audiobook/dp/B07K4DLMJZ",
    "body": {
        "name": "Where the Forest Meets the Stars",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Where-Forest-Meets-Stars-audiobook/dp/B07K4DLMJZ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51icwKEZxoL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Glendy Vanderah",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Glendy+Vanderah"
        },
        "brand": "Glendy Vanderah",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 104366,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An Amazon Charts, Wall Street Journal, and Washington Post bestseller, and a Goodreads Choice Award finalist. In this gorgeously stunning debut, a mysterious child teaches two strangers how to love and trust again.After the loss of her mother and her own battle with breast cancer, Joanna Teale returns to her graduate research on nesting birds in rural Illinois, determined to prove that her recent hardships have not broken her. She throws herself into her work from dusk to dawn, until her solitary routine is disrupted by the appearance of a mysterious child who shows up at her cabin barefoot and covered in bruises.The girl calls herself Ursa, and she claims to have been sent from the stars to witness five miracles. With concerns about the child’s home situation, Jo reluctantly agrees to let her stay - just until she learns more about Ursa’s past.Jo enlists the help of her reclusive neighbor, Gabriel Nash, to solve the mystery of the charming child. But the more time they spend together, the more questions they have. How does a young girl not only read but understand Shakespeare? Why do good things keep happening in her presence? And why aren’t Jo and Gabe checking the missing children’s website anymore?Though the three have formed an incredible bond, they know difficult choices must be made. As the summer nears an end and Ursa gets closer to her fifth miracle, her dangerous past closes in. When it finally catches up to them, all of their painful secrets will be forced into the open, and their fates will be left to the stars. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Family Life",
                "link": "https://www.amazon.com/Family-Life-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11047977011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 57 minutes"
            },
            {
                "name": "Author",
                "value": "Glendy Vanderah"
            },
            {
                "name": "Narrator",
                "value": "Lauren Ezzo"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 01, 2019"
            },
            {
                "name": "Publisher",
                "value": "Brilliance Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07K4DLMJZ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,685 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #80 in Family Life Fiction (Audible Books & Originals) #131 in Literary Fiction (Audible Books & Originals) #166 in Women's Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Buzy_reading",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3BVTC6JBRNVN6ERT4RQN5O3CZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R374C5YXBEIGDF?ASIN=B07K4DLMJZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Star child meets bird ecologist in the woods",
                "reviewText": "Joanne is renting a house for the summer to study bird nests. Joanne studies bird ecology and conservation. Joanne is a cancer survivor. Before she began her research in the woods she slept with Tanner a guy whom she did research with. When she was diagnosed with breast cancer he became a man she no longer wanted or needed in her life. The realization that without breasts and a uterus she wasn’t the woman for him. When a young girl wandered onto the property claiming to be from the stars she grew curious about her life.…Joanne’s world became about finding Ursa’s home and learning more about where she came from. Along the way they bonded together accepting each other’s pasts. Joanne’s neighbor was united with them linking them together forming a friendship that the girl needed. Sometimes people can’t choose their family but they can choose who they want to be friends with. Sometimes these friendships become more important.…Glendy Vanderah writes a brilliant enchanting story about a young girl named Ursa who meets a bird ecologist living in the woods. It’s a magnificent story written beautifully well. I was encapsulated by her writing voice. Ursa was a wonderful nine year old who stole the show. I am looking forward to reading more books by Glendy Vanderah she has a writing style that I can immerse myself in.…Lauren Ezzo was the solo female narrator who absolutely made this story come to life. Her voice acting skills sold me on Ursa. I’m definitely going to look into buying more audiobooks performed by Lauren Ezzo.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBBESVSPEYR7M7DM3BY2YM7R24A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IFLUKY77Z47L?ASIN=B07K4DLMJZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "4.0 out of 5 stars Not What I Expected",
                "reviewText": "Jo Teale, research scientist and PhD candidate, is broken both physical and mentally, and she throws herself into her work studying bird nesting sites in rural Illinois to prove she isn’t. When a battered child shows up claiming to be from the planet Hetrayeh in the Pinwheel Galaxy and says she’ll return home after witnessing five miracles, Jo doesn’t believe her. Neither does Gabe Nash, the multilayered “Egg Man,” who owns the farm adjacent to the property Jo is renting for the summer and who is every bit as broken as she is.This novel was the January pick for my book club, and I wasn't happy about it. I'd read reviews, and the book sounded a bit too science fiction-ish for me. In fact, I started reading it New Years Day to be sure I'd finish before our meeting the middle of the month.I couldn't have been more wrong. After a few pages, I decided its genre was magical realism (my favorite), and I plowed right through it. I finished it in three days, which, if the child, Ursa, had witnessed, would've counted for one of her five miracles.The people in this book seem very real, and their past is doled out piece by piece as they gradually get to know each other. The relationship between Jo and Gabe is tentative and messy but strong, and their love for Ursa leads them to make some bad decisions because they believe doing the \"right\" thing would be even worse for her. The supporting characters have a few secrets of their own--and what a bombshell one of them is! The book is bursting with dialogue, which I loved. My only complaint is the ending. The author did her best to make it suspenseful, but it wasn't. It also left a few ends looser than I would've liked.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFE4MYLYVN5GUFID6KMHACDEC3XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30B05UYJ4B5HX?ASIN=B07K4DLMJZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Great twists, wonderful characters",
                "reviewText": "I was riveted, couldn't stop thinking of this story and what would happen next whenever I wasn't reading it. As a cancer survivor I also felt happy and represented, to find a story that was inclusive of several feelings I've experienced on my journey.Highly recommend reading this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie 3B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIVLUV3EMTWVDC3QC7XQ7PRCHFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OO852GJMGFWN?ASIN=B07K4DLMJZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Uniquely Delightful",
                "reviewText": "A most unusual book with diverse characters you’ll come to love. I’m so thankful I read this book. I found it uplifting and joyful. Relaxing with a good book is one of life’s greatest pleasures and this book filled the bill. I’ve already ordered another title by Ms. Vanderah.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emiland14",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEUB54GE2NAQEASBJPHYD3BKNUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R300Q94E09O6UZ?ASIN=B07K4DLMJZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "4.0 out of 5 stars Nice Quality Book, but Not a Fan.",
                "reviewText": "I’m an avid book reader and love finding new titles to read. This one peeked my interest after reading the summary. Unfortunately, it was not what I expected when I started reading it. I wasn’t a fan, but will pass it on to a friend who may enjoy it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFS3EPF66ASCBX6VBVTQVPAJTUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33XP40876YV5E?ASIN=B07K4DLMJZ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "3.0 out of 5 stars Slow and predictable",
                "reviewText": "Didn’t really like this book. Once I start I have to finish reading a book but I didn’t like the birdwatching and lots of the story lines were just boring and unnecessary. Would have been better as a short story rather than a novel.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIZUMZKWZSQ6COU3R2C6TWYVIVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXIGPICUXURT?ASIN=B07K4DLMJZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Engaging read",
                "reviewText": "This book captures my attention right away. I felt the storyline moved along nicely and captured different facets of real life nicely.Spoiler:In case anyone searches for this, the dog does die. There is also some mention of potential sexual assault on a young girl which could be triggering.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Tracy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSZW63H7DKFKD3DGCSH46TJWPWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R770C7ZGPMZS?ASIN=B07K4DLMJZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars immediately captivating",
                "reviewText": "Hard to believe this is her first novel. I was hooked from the first chapter. Very hard to put it down, & especially grateful she designed the chapters in small manageable bites. The story was magical and enforced the power of love and d forgiveness. Her writing was so vivid, this could easily be good suspense movie. Bravo.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pranav Sharma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 27, 2023",
                "reviewTitle": "An Enchanting Journey Where the Forest Meets the Stars",
                "reviewText": "\"Where the Forest Meets the Stars\" by Glendy Vanderah is a captivating tale that seamlessly weaves together themes of grief, healing, and the magic of connection. From the very first page, I was drawn into a world where the ordinary and the extraordinary collide.The story revolves around Jo Teale, an ornithologist who is grieving the loss of her mother to cancer, and Ursa, a mysterious young girl who claims to be an alien on a mission to witness five miracles. Their unlikely friendship forms the heart of the narrative, and it's impossible not to become emotionally invested in their journey.Vanderah's writing is nothing short of exquisite. Her descriptions of nature are vivid and poetic, creating a rich backdrop for the story. The characters are beautifully developed, each harboring their own wounds and secrets, and their growth throughout the novel is both moving and believable.As the story unfolds, it explores the themes of love, loss, and the healing power of human connection. It also delves into the profound idea of finding wonder and miracles in the most unexpected places. Vanderah's storytelling skillfully tugs at the heartstrings, leaving you with a sense of hope and renewal by the end.\"Where the Forest Meets the Stars\" is a literary gem that will resonate with readers who appreciate stories that are both heartwarming and thought-provoking. It's a book that reminds us that even in the darkest of times, there is light to be found, and sometimes, that light is as extraordinary as the stars themselves. This novel is a testament to the magic that can be discovered where the forest truly meets the stars.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julia J",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 15, 2024",
                "reviewTitle": "Read this NOW",
                "reviewText": "What a wonderful beautiful story, and I'm so happy I've found this bookIt's a book you can easily read again and again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chiara Elissa Torres Bayley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 28, 2024",
                "reviewTitle": "Beautifully written",
                "reviewText": "A novel.that has many subtle twists and turns. It will.have you s!smiling and crying. Imaginative and beautifully written. You fall in love with all of the main characters instantly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ron",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 23, 2023",
                "reviewTitle": "A must read!",
                "reviewText": "This book keeps you grappled till the end. It takes you on a tour to faraway wilds and country life, it leaves you questioning child safety, child services guidelines and most importantly it flashes light on human emotions and human mental health paradigms.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nino",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on April 5, 2023",
                "reviewTitle": "Unputdownable",
                "reviewText": "I read this in one day. I had to know how it ended. Cried a lot at the end. Beautiful",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}