{
    "remaining_requests": 184,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fantasy-Writers-Handbook-Richie-Billing-ebook/dp/B07RR37H9K",
    "body": {
        "name": "A Fantasy Writers' Handbook - The Complete Fantasy Writing Guide",
        "price": "$2.99",
        "originalPrice": "",
        "rawPrice": 2.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fantasy-Writers-Handbook-Richie-Billing-ebook/dp/B07RR37H9K",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/A1-V99hiqsL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Richie Billing",
            "link": "https://www.amazon.com/Richie-Billing/e/B0765772FM/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 165,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A Compendium Of Fantasy Writing Tips, Tools, Prompts, Help And AdviceWhen you buy this book you'll also get:Free access to a writing class on how to write a fantasy novel (worth $25)An invitation to our fantasy writing group (Discord) with 500+ membersWriting fantasy can be a liberating experience. Writers are free to create their own worlds, magic systems and creatures. But for many, the scale of the task can be daunting.Writing fantasy fiction is much harder than other genres because you need to take care of so many more elements—intricate worldbuilding, creating compelling characters, and tying everything together in a satisfying plot.And then there are the nuances between subgenres. Writing urban fantasy, for example, is much different to epic fantasy, and writing fantasy novels can be more complex than scribbling short stories.There can be so many questions, the answers so hard to find, that you just want to give up. But worry not, for help is at hand in the form of this comprehensive fantasy writing guide.A Fantasy Writers' Handbook is the guidebook I wanted when I first began writing fantasy fiction. It covers three main areas:Writing Fiction Generally – how to make characters, come up with a plot and theme, how to write dialogue, tips on writing fight scenes and battles, and advice on dealing with mental challenges, like procrastinationEpic Fantasy Writing Tips – worldbuilding, making monsters, guides on the likes of medieval swords, bows and arrows, and armour, and tips on subgenres, like writing urban fantasy and romantasyGetting Published – list of publishers of short and long fantasy fiction, how to write a cover letter, how to make a website.Above all, this fantasy writing guide offers an accessible take on some complex areas of the craft and has, over the years, been credited with helping budding writers land book deals and short story credits.About The AuthorRichie Billing is an author of a range of story types, though his passion is writing fantasy fiction, as well as helping his fellow writers follow their own passions and dreams.Richie's debut epic fantasy novel, the rip-roaring underdog story called Pariah's Lament, was published in 2021.Richie's move into education began as a blog to share helpful writing tips he learned as he studied the craft, and soon became a website visited by over 150,000 people a year. This led him to write his acclaimed craft book, A Fantasy Writers' Handbook, and begin the podcast, The Fantasy Writers' Toolshed, which many writers credit with inspiring them to finish their stories.Richie also teaches creative writing in his home city of Liverpool, as well as online, and occasionally speaks at writing conventions. Most nights you can find him scribbling away or watching the NBA.Praise For A Fantasy Writers' Handbook\"Very useful. Helped me land my first book deal.\" Jack Shannon, Fantasy Author\"Written in a friendly, uncluttered style, Billing has managed to accumulate and present a huge amount of useful information in a way that perhaps a favourite lecturer might do.\" Readers' Favourite\"An ideal, accessible source for tips and advice and practical resources for the aspiring fantasy author.\" Steph Warren, Vine Voice Amazon reader\"I loved how Billing included examples and advice from other authors like one of my favourites, Brandon Sanderson.\" Sarah Lillian Books",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07RR37H9K"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (June 12, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 12, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4660 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 372 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 109778133X"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#149,119 in Kindle Store (See Top 100 in Kindle Store) #112 in Publishing & Books #5,683 in Paranormal & Urban Fantasy (Kindle Store) #6,720 in Paranormal & Urban Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 165 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Athena ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ7QVT7NIEKZWZZBVG4I7HV4HGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XZUGP2FD8Z6H?ASIN=B07RR37H9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 21, 2022",
                "reviewTitle": "5.0 out of 5 stars Very thorough and helpful",
                "reviewText": "I ordered a few fantasy creative writing resources and to try out, and this one has been my favorite. I ordered it used and it was shipped within a week, and arrived in perfect condition without notes in the margins.For context, I have already had a few creating writing courses. This book does go back over a few beginning writing steps, but even so I found they were a refreshing perspective. There is reference to social media and the help of creative writers groups that I think blends well into the examples. This has turned out to be the accumulative and inspiring book that you might hope The Guide to Writing Fantasy and Science Fiction by Philip Athans might be. I found that, that book was a very simplistic introduction to the genre.A Fantasy Writer's Handbook would pair very well with Putting the Fact In Fantasy, a collection of essays with writing resources and character and world building prompts blended in. These two books have been what I was looking for to gear myself in the direction of writing fantasy and fairy tale.The word glean is used a lot. I feel like Holden Caulfield. I can't stand the use of that word. I cringe every time.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yazzie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFMS7AQZECQV2KALRCFGK7GNPQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U3DPFQONNOPK?ASIN=B07RR37H9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Wealth of information",
                "reviewText": "Great read, with loads of information. Well thought out, well researched, and presented in an “easy to follow” format. Will be one of my “go to” reference books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebekha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFTUWPWBZGBESDR3ZMZVXFUKAAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MVDPJD3E5KHM?ASIN=B07RR37H9K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2019",
                "reviewTitle": "4.0 out of 5 stars Interesting, but...",
                "reviewText": "Unfortunately for me, this is a reprise (sort of) of \"save the cat writes a novel\", and for some reason, I thought some cool illustrations, like those pictured, would be IN the book as well as on the covers. My bad.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angelo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDWXND3EQWUTFHXGWEWYFOMPHDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I1FM2UU34N1U?ASIN=B07RR37H9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2021",
                "reviewTitle": "5.0 out of 5 stars A great guide for us mortals",
                "reviewText": "I bought this book in hopes of understanding the writing process more and improving my own skills. In addition, I wanted to learn more about fantasy writing as it is a genre I would like to explore in the future.I found this book to be well written and simple to understand. The author provides simple ideas that anyone can follow and improve on. He gives examples using well know stories that drive the idea home easily.I myself learned a great deal from this book and feel anyone could learn from it.I highly recommend it to anyone looking for help with writing ( come on, you know you want a simple explanation for show don't tell) and dipping your feet into the fantasy genre.well done!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jay Veloso Batista",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMQWKIR5G5EYATJJGGLJKK2X4LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V1U1P0LIE6N7?ASIN=B07RR37H9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2019",
                "reviewTitle": "5.0 out of 5 stars Want to write a novel? BUY THIS BOOK FIRST!",
                "reviewText": "Every want-to-be author should own this manual! The first half of this book summarizes and synthesizes current literary advice for a publishable, successful and infinitely more readable novels. Despite comments to the contrary, this book goes beyond the article's on the author's web site by adding insightful and exceptionally useful details on the craft of modern fiction. Sections on setting your premise and the easy to understand explanation of active voice had an immediate impact on my work.The second half of the book is focused on the Fantasy genre and its many sub-genres with useful instructions on world-building and handling complex fight scenes, as well as the mundane such as typical word counts, editing chores and formatting a manuscript. If this is your genre, pay close attention to the list of publishers, which is very current as well as the information on writing a cover letter and the currently available marketing methods in our industry.Salted with pithy and relevant quotes and excellent references to continue your education, this manual is a great tool. Every aspiring author should own it.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHK5XHWEHLMKCWYNXTZSSZL33LEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LXO5L28VDZFI?ASIN=B07RR37H9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 27, 2022",
                "reviewTitle": "5.0 out of 5 stars Very helpful",
                "reviewText": "I know that everyone loves Wonderbook, and it is good, BUT I found this book more specific and helpful. I definitely recommend this book to beginner fantasy writers everywhere.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW3B6LS7IGUG62NHOVYR5O7Q6LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ECXVCZN41JNW?ASIN=B07RR37H9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 17, 2019",
                "reviewTitle": "5.0 out of 5 stars Great. Just great.",
                "reviewText": "This book is well written, thoughtful, and at times funny. Richie gives great advice on writing in general in part one and excellent fantasy specific advice in part two. Part three was also great but I haven't finished a manuscript yet so....Highly recommended.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JaneJane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPJC3YJKHYGMX5HJKUXOGLZ6VNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CXNYBDVW9E33?ASIN=B07RR37H9K",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2021",
                "reviewTitle": "1.0 out of 5 stars Poorly glued book falling apart",
                "reviewText": "After I read the book for 20 minutes, it started falling apart. Pages came off. I tried my best to tape them together, but it didn’t work well. I like this book, Richie has some great points of writing. But the production itself made me quite frustrating. I love my books, it’s heart breaking to see this one as this condition and it is still a new book!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51tMEJ+KzVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/619tsWI7X5L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61aCtYi4k7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61fVPtw4rTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61obzGCU-lL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71nOGX1L2wL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TLJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 23, 2023",
                "reviewTitle": "So Much Great Info",
                "reviewText": "This book is inspiring. It has a lot of useful information for writers and is written in a no-nonsense, practical, but entertaining style. It was just what I was looking for.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "joe greenslade",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 15, 2023",
                "reviewTitle": "Help For A Fantasy Writer",
                "reviewText": "It's a really useful book. Something to pick up and read through when the slog becomes a little too much. You can see the writer has been through exactly the same thing too.It's full of useful advice that's easily digestible - you don't have to wade through reams of prose to get to the good stuff. You can pick it up and within a few minutes feel refreshed with some easy and helpful reading - so that you're ready to go back to your manuscript.A fun, useful read. Would certainly recommend to not only fantasy writers, but writers in other niches too!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "UrioL",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 27, 2022",
                "reviewTitle": "Useful and really interesting approach",
                "reviewText": "This book just saves research time for you when trying to write a fantasy novel. Really good input for noobies like me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kris Jensen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 26, 2021",
                "reviewTitle": "Very good and informative!",
                "reviewText": "I have learned so much in the past few days reading this book. Highly recommend it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "john d duncan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 1, 2021",
                "reviewTitle": "Informative, inspiring and useful",
                "reviewText": "This book helped give me confidence, which is something you can’t buy. Whether it be active sentences over passive or showing your reader rather telling them this book had it all. Most importantly it helped with context in the fantasy realm. I was delighted and it has been very useful as both a resource and as a guide.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}