{
    "remaining_requests": 410,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Scarlet-Veil-Shelby-Mahurin/dp/0063258757",
    "body": {
        "name": "The Scarlet Veil",
        "price": "$10.99$10.99",
        "originalPrice": "",
        "rawPrice": 10.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Scarlet-Veil-Shelby-Mahurin/dp/0063258757",
        "soldBy": {
            "sellerID": "A3B6E79ULPISFM",
            "name": "B R Books LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A3B6E79ULPISFM"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91k9Ns8kcRL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Shelby Mahurin",
            "link": "https://www.amazon.com/Shelby-Mahurin/e/B07R3XL53C/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "B R Books LLC",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 297,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 56 mins",
            "$4.99 delivery February 27 - March 1.",
            "Or fastest delivery Thursday, February 22."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b?ie=UTF8&node=28"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Teens-Books/b?ie=UTF8&node=17466"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ HarperTeen (September 26, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 640 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0063258757"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0063258754"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 16+ years, from customers"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 9 and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.42 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.75 x 1.75 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,359 in Books (See Top 100 in Books) #87 in Teen & Young Adult Dark Fantasy #87 in Teen & Young Adult Fantasy Romance #88 in Teen & Young Adult Wizards & Witches Fantasy"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 297 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Serpent & Dove Blood & Honey Gods & Monsters Serpent & Dove 3-Book Paperback Box Set The Scarlet Veil Deliciously wicked romantasy books from New York Times bestselling author Shelby Mahurin A witch and a huntsman are bound as one to love, honor, or burn in unholy matrimony. Book one of a fantasy trilogy, this French-inspired tale of witchcraft and forbidden love is perfect for fans of Sarah J. Maas. The spellbinding Serpent & Dove series continues in the sequel, where the stakes are higher and the magic is darker, as Lou and Reid find themselves narrowly escaping death and on the run. The battlefield is set in the stunning conclusion to this enemies-to-lovers fantasy series, as Lou must emerge from the darkness and claim what is rightfully hers. The complete New York Times bestselling Serpent & Dove series, available in a paperback box set. Return to the world of Serpent & Dove in this dark and riveting vampire romance that follows a huntswoman on the case of a supernatural killer. And you thought witches were wicked…",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b9d40157-2d3f-463e-b7d9-9abb68383e1c.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/84bf2417-44ab-4636-8f82-18be890462e8.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0562af3b-fd7f-4a7d-b0db-1beacf2680ec.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/472161c8-5c1d-465f-b9cf-c01852e02730.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/50364ce9-3b50-4098-8c5f-97f5c35d6950.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3e0b14b0-66f1-4d8d-8ef2-887f26484157.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d41bb19e-5653-4d24-a634-1f3abae8a2b7.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5e2d7b19-9784-4b43-af1b-ad517385528b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e6d6acec-2c24-4c4a-9a89-4999721b1996.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/13f51ce6-9547-47b7-b2d4-6517f87b8496.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lia Carstairs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDNYELNTNMURXZUBP3B4ALCQAHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U9XNGBUWFYIX?ASIN=0063258757",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Fell in love with this world again!! Célie + Michal have my whole heart!!",
                "reviewText": "\"I realize Hell is empty, and the Devil is here.\"i saw that epilogue coming BUT THE MURDERER??? i never wouldve guessed that person💀 curse this cliffhanger because i dont want to wait until next year for book 2😭 im in desperate need of more célie and michal🥺🫶but guys shelby has renewed my faith in her books again!! after the mess of G&M i originally wasnt interested in TSV but i was convinced AND SO GLAD I DID BECAUSE IT MADE ME REMEMBER WHY I LOVE SHELBY'S BOOKS SO MUCH??? this wasnt just so fun but also heartbreaking, funny and gave me the \"i need more asap\" feeling. (i may or may not have neglected school life for this book oops)I smile--because I know, in this moment, my strength has never been like the others'. I am not cunning or fearless like Lou, nor am I strategic or disciplined like the Chasseurs. No. I am Célie Tremblay, Bride of Death, and my strength has always and will always be in my loved ones. My friends.célie's story is one i never imagined we'd see but im so so happy that shelby decided to write it because she deserved her own story!! from her acknowledgements: I still remember sitting down to write Gods & Monsters and hesitating when you asked, “What about Célie?” Though I’m ashamed to admit it, I’d already dismissed her as the jealous ex-girlfriend. You challenged me to see her differently—as a flawed character, yes, but also as a sheltered, grief-stricken young woman with a spine of steel truly this made me tear up🥺 i also never really thought twice abt her in S&D trilogy but oh if there's anything that TSV has done, it's made her one of my favourite MCs ive read abt this year (and maybe even ever??). her strength is in her love for others and cliché as that may sound i love that her optimism in situations and trying to see the best in others!! she's actually too pure.\"Perhaps the Célie you know never existed. Have you ever considered that? It can happen without us even realizing--we fall in love with an idea instead of a person. We give each other pieces of ourselves but never the whole thing, and without the whole thing, how can we ever truly know a person.\"no because when célie spoke of this... it hit HARD. like it really takes so much courage and strength to give all your pieces to someone because... what if they dont accept every part of you?? there's always that small possibility and to have to deal with the possible pain and heart break that would come with it?? so its safer to just not give someone all of you and avoid that chance of rejection😭🥹which brings me to MICHAL AKA NEW LOVE OF MY LIFE!! their start was truly an ACTUAL enemies to lovers (and actually to the lovers parts👀👀). he sees all of célie and doesn't shy away in disgust or pity from any of it. he's so sweet, tender, funny, and charming to célie GAHHH MY HEART🥺🫶 célie said it herself His smiles fades with it, returning him instantly to the cool and collected Michal I've always known. My muscles go weak with relief. I've witnessed his wrath, his grace, his power, and I've survived them all, but his charm? I don't think anyone can survive that. SPEAKING FACTS i swooned so many times like michal acting ruthless?? can totally handle that BUT HIM BEING SO CHARMING AND SWEET??? IM WEAK and so in love with my vampire king. when célie asked what he feared and michal's response was nothing but philophobia oh i just🫠🫠 IM IN LOVE WITH THEM YOUR HONOR i need more michalcélie🥹and may i just express my love for their conversations as well?? so many times i laughed like truly célie is so funny😭“We aren’t exactly being inconspicuous as it is, and”—I lower my voice—“and couldn’t you just compel a courtesan to tell us where to go?”“Doest my ears deceive me, or did the holier-than-thou Mademoiselle Célie Tremblay just suggest we take away free will?” He casts me a sidelong glance. “I had no idea you were so wicked, pet. How delightful.”“I don’t mean we should compel her,” I say hastily. “I’m merely asking, hypothetically, what would happen if we did.”“Hypothetically,” he repeats, his voice dry.“Of course. I would never actually suggest we force someone to do something against their will. I’m not”—I cast about for the right word, failing to find it—“I’m not evil.”“No, no. Just hypothetically evil.” He rolls his eyes again as I sputter indignantly.michal's response to celie helppp they had me dying actually these two🫶 also!! i adore the new characters we got to meet !! odessa, dimitri, d'artagnan, mila and monsieur marc <33 my favs were definitely mila and odessa i love those two queens. and i really want to see more odessa & célie moments because the potential for their friendship blooming more!! always saying yes to that.it was so fun seeing the old gang from S&D together also (not jean luc though, he can respectfully go to hell🤩. THAT ONE SCENE WITH LOU, COCO, AND CÉLIE??? IT WAS EVERYTHING🥹 the pride and love they hold dear towards célie makes my heart full of so much happinessi am so beyond excited for book 2 and truly cannot wait to see where things head, i can already see book 2 being very character driven and of course more romance🤭 michal and célie are my newest obsession and you're telling me i'll have to wait a year to see more of them??? i will do anything to get my hands on book 2",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Toni Stewart",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7IURQDZ5IZPSJF2BIM273EZBXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G6I463I38YIP?ASIN=0063258757",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Scruffed Up",
                "reviewText": "There was a lot of scruff marks on the back and front dust jackets, but other than that it looks good!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deanna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVVC2MMKEVAZEKELKE5DXQBJ3XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WQ9UDNFE7E3X?ASIN=0063258757",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars If you like Hozier’s Work Song You’ll love this!",
                "reviewText": "Honestly, I could NOT put this down (nor could I with the Dove and Serpent trilogy) but this just reminded me so much of Hozier’s Work Song with the “no grave can hold my body down, I’ll crawl home to her” I mean that song is perfection just like this book. I could not predict anything in this book and am beyond in love with it! Cannot wait for the next book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alyssa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG562O5VDA23YQN4FGAVQ5MGG4HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UW50Z6AKDES4?ASIN=0063258757",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars How dare you!",
                "reviewText": "With that ending…. I can’t even, and I have to wait until October…. Like no.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aspen Worsham",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYLNB32DN4YGGRELSH277TV6JTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SRUJR9B5GOR9?ASIN=0063258757",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars loved this book!",
                "reviewText": "Ugh, that cliffhanger! If anyone needs me, I’ll be impatiently waiting for the next book 😬I’m a sucker for vampires! I’ve been in a bit of a reading slump, and this book brought me out of it. Though it started off a little slow, it picked up after a few chapters and I was hooked! And dare I say, I liked it more than Serpent & Dove.I liked the old timey elements of vampirism like the aversion to silver, and watching Celie find herself, even though her decision making skills need some work 😂Ew, Jean Luc. Hello, Michal 🥰That’s all I’m gonna say about that.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSMHNQKBDX5BBD3IR7VSLO5MR4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RF6SNTVWGXGB8?ASIN=0063258757",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2023",
                "reviewTitle": "4.0 out of 5 stars Entertaining and excellent world building but.......",
                "reviewText": "So, its no S&D, but its good. Read it in a day. Interesting cast of new characters mixed with the old ones. But, sometimes, Célie was just all over the place. It fits her character, but jesus, running into so many obvious traps. She is a damn mess and it makes sense but dang.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark Elliott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMBDOZRETGLJNLDLFKVW7PKWXPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D4KMCYFVFWYH?ASIN=0063258757",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "3.0 out of 5 stars Too slow",
                "reviewText": "Too many non essential characters whose story never developed. A bad guy with no background or likability. Bad ending all around.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meg (what.is.life.without.dragons)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3JGBXMGCQBOUSNZFZBBZBYPT4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CEF2YZ7G4D2Y?ASIN=0063258757",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2023",
                "reviewTitle": "5.0 out of 5 stars a must read for all vampire lovers",
                "reviewText": "Wow. I can’t even. This book was amazing and I’m dying for book two. When does book two come out?!?!?!Ok, the first few chapters were rather slow and it took me till about chapter 5 to get into the story. I think, however, had I read the serpent and dove series first I would have been hooked from page one. There were a lot of characters- that obviously had a backstory - which I didn’t read so I was a little confused and almost gave up. But I so glad I didn’t. Once the story picked up I was hooked and binged read this in one sitting.You can read this book without reading serpent and dove - but man, I wish I had read serpent and dove first so I could understand all the Easter eggs and references.I love the magical world and the clash between the church and creatures. And the love interest - beautiful and can’t wait to see where it goes.4.5 stars",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Glyn Darby",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 12, 2024",
                "reviewTitle": "Enjoyable follow up to the Serpent and Dove series.",
                "reviewText": "Fab characters and a good pace.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BrunaBruna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 27, 2023",
                "reviewTitle": "This book is gorgeous",
                "reviewText": "Gorgeous hardcover! 5✨",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71BwHmv5JZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Urvashi kaushikUrvashi kaushik",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 30, 2023",
                "reviewTitle": "Review about the product quality💗",
                "reviewText": "This is the first time that I pre-ordered a book and I am so happy to receive the book in a best condition. Now I just can’t wait to read it!!!✨❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wb0GVlGIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vespa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 18, 2023",
                "reviewTitle": "Bloody perfection!",
                "reviewText": "Célie Tremblay is a beautiful, kind and privileged woman. She recently proved her bravery defying tradition becoming the first ever huntswoman. When blood-drained dead bodies start to pile up in Belterra her friends and fiancé hide the evidence to protect her from past traumas. She knows evil is lurking. Determined to prove her worth she decides to track and find the killer herself.As she enters the world of Les Éternals she catches the attention of a monster, a mysteriously dark yet charming man. As much as she loathes him she also finds herself compelled and drawn to his darkness. Célie struggles with her emotions and finds she hungers for more than she originally set out to do.I Liked:🌟 Célie’s progressive development. She is a flawed yet resilient young woman.🌟 The world building has substance. The comic relief offered by some of the supporting characters is amazing.🌟 Michal who has a repressed light within his dark nature.🌟 There is a plot and a sub plot that are perfectly in twined to create an enticing storyline.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yoni van't Zand",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 28, 2023",
                "reviewTitle": "Charming and enthralling",
                "reviewText": "The Scarlet Veil: A thrilling new YA vampire romantasy series from the author of Titkok sensation, Serpent & DoveI have come to the Scarlet Veil, perhaps in a way much different to others. I had never heard of the Serpent & Dove trilogy before now, and as such hadn't read those books.It's safe to say that I think that it would potentially be beneficial to someone getting into this universe to read those books first. However, even without prior knowledge this book is not unreadable, very far from it in fact.Do I think it will stand the test of time as high fantasy, similar to how Dune and Lord of the Rings have? Absolutely not. Do I think this was a highly exciting read that kept me hooked and wanting more page after page, absolutely yes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}