{
    "remaining_requests": 415,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/A-Court-of-Thorns-and-Roses-audiobook/dp/B00WXS68T4",
    "body": {
        "name": "A Court of Thorns and Roses",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/A-Court-of-Thorns-and-Roses-audiobook/dp/B00WXS68T4",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Ao F0 xvL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sarah J. Maas",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Sarah+J.+Maas"
        },
        "brand": "Sarah J. Maas",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 175978,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "When 19-year-old huntress Feyre kills a wolf in the woods, a beast-like creature arrives to demand retribution for it. Dragged to a treacherous magical land she only knows about from legends, Feyre discovers that her captor is not an animal, but Tamlin - one of the lethal, immortal faeries who once ruled their world. As she dwells on his estate, her feelings for Tamlin transform from icy hostility into a fiery passion that burns through every lie and warning she's been told about the beautiful, dangerous world of the Fae. But an ancient, wicked shadow over the faerie lands is growing, and Feyre must find a way to stop it... or doom Tamlin - and his world - forever. Read more",
        "breadCrumbs": [
            {
                "name": "Audible Books & Originals",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18145289011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18580606011"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18580607011"
            },
            {
                "name": "Paranormal & Urban",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18580622011"
            },
            {
                "name": "Paranormal",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18580624011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "16 hours and 7 minutes"
            },
            {
                "name": "Author",
                "value": "Sarah J. Maas"
            },
            {
                "name": "Narrator",
                "value": "Jennifer Ikeda"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 05, 2015"
            },
            {
                "name": "Publisher",
                "value": "Recorded Books"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00WXS68T4"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Fantasy Romance (Books) #1 in Epic Fantasy (Audible Books & Originals) #1 in Fantasy Romance (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Teisha @ Girl Writes Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRCJXN3FRUKFGYHSWYP5EFJVU6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23L305CH2KCNJ?ASIN=B00WXS68T4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 5, 2015",
                "reviewTitle": "5.0 out of 5 stars Bow Down to the Queen of YA Fantasy",
                "reviewText": "This book, with its magic, fairytale roots, and steamy hot romance, deserves ALL of the stars. I loved it!Here are the five reasons why I gave A Court of Thorns and Roses 5 out of 5 stars (and then some):★ FAIRYTALE RETELLINGI was a little wary of this story when I discovered that it was a fairytale retelling. I love the story of Beauty and the Beast. Growing up, I watched the Disney version all of the time (but not as much as I watched Pocahontas). However, in the past I have struggled to find enjoyment in Beauty and the Beast retellings. Particularly Beastly by Alex Flinn -- I did not enjoy the book or the movie.I think I was worried that A Court of Thorns and Roses wouldn't feel original, but it was the complete opposite. Maas has written an incredibly unique story that is grounded in the fairytale we all know and love, but is also independent and utter creative genius (Maas is definitely honing and owning her writing skills!). Yes, there is a curse, and magic, and a love story. But there is also dark magic, and steamy romance (and I do mean steamy!), and blood and gore, and court drama -- basically, all of my favorite things wrapped up in one neat, rose-colored bow.There were some twists on the original story of Beauty and the Beast that I really enjoyed. For example, in the original story, the residents/servants of the Beast's home are cursed and transformed into household items. However in ACOTAR, rather than being transformed into household items, Maas' cursed characters must wear masquerade masks, and have done so for 50 years since the curse was placed on the night of a masquerade party. I also appreciated that, though Tamlin was a beast, that quality did not factor into the curse that was placed on him. Rather, as a Fae, he has the power of shape-shifting, and takes the form of a beast (usually when fighting). So, throughout most of the book, Tamlin is portrayed as a glorious, chiseled, man of steel. Some readers believe that the fact that Tamlin is gorgeous retracts from the Beauty and the \"Beast\" story line. However, no one writes hot male love interests like Sarah J. Maas, so I am not complaining about Tamlin at all.Overall, I found that I loved the fairytale background of this story more than anything. I enjoyed drawing comparisons between Maas' story and characters, and the story I grew up with. Maas' world is so intriguing, engrossing you from the very beginning and never letting you go.★ GENREWhile we know that ACOTAR is a fairytale retelling, that is not to say that it is a children's book. I went into this book thinking that it was Young Adult. However, there is a particular scene that takes place after the Great Rite on Fire Night (such a good scene, by the way -- just wait for it) that made me take a step back and think \"Whoa! This is way too sexy and erotic for Young Adult literature.\"Looking back at Goodreads, I found that the book was listed as Young Adult and New Adult. But, I would personally classify this book as New Adult. Having read many New Adult novels, I found that the sex rating for ACOTAR resonates with that of a New Adult novel. I think that there is a lot of confusion about the genre of this book because we all know Sarah J. Maas as a Young Adult author. I personally have no problem with this genre. However, for parents who are giving this book to their young children, or for those readers who don't enjoy sex scenes in their books -- you have been warned.I love the New Adult genre, and discovering that ACOTAR fell into that genre made me love it even more. I appreciate the more mature content, and that the characters are closer to my age (Feyre is 19). And, hey, I appreciate the sexy times, too. (There is no shame in my game... Because, who am I kidding? I have no game.) I had also never read a New Adult Fantasy before, so I was glad to be exploring new territory.I'm absolutely impressed with Maas as a writer. She is not afraid to be different, to venture out to new places. I love that she is entering this new genre, and look forward to seeing what else she has up her sleeve for the future.★ FEYRE, THE PROTAGONISTWhen I started reading ACOTAR, I was sure Maas was going to give us another Celaena Sardothien: a badass girl who is nearly invincible, yet lovable and cool. However, Feye (pronounced Fay-ruh) is so different from other fantasy protagonists I have read, because she is so unapologetically human. She is normal, and she is flawed, and I found that I could easily relate to her character. Feyre is unlike the female protagonists we are accustomed to. She is no fighter, not outstandingly gorgeous, and she is also illiterate (a shortcoming that embarrasses her to not end).In the beginning, Feyre is not very likable. She is cold, harsh, stubborn, and hard-headed. But, readers begin to see how her situation of poverty has shaped her to be that way. Once at the Spring Court, where she is no longer burdened with the responsibility of taking care of her father and two sisters (all of whom are ungrateful of her efforts to keep them alive), the ice in her heart begins to melt as she lives in comfort and takes up her passion for painting. Readers witness her character develop as she begins to rediscover happiness and life's simple pleasures. Feyre easily becomes a character you can't help but root for and love.★ TAMLIN & AN IMPENDING LOVE TRIANGLESince we have discussed Feyre, I believe that it is only appropriate to take a glance at her love interest: Tamlin.Tamlin is a bae Fae warrior, with magical abilities. He is also gorgeous, kind-hearted, and strong. And, he places Feyre's happiness and well-being above all else. But, he is not perfect. He is flawed, haunted by his family's past, by his own mistakes, and the lives he has taken. But, through all of that, he still strives to do and be good.However, I admit that while I love Tamlin, I am worried that Maas has a love triangle in the works for Book 2 of ACOTAR.Because Rhysand.Rhys, a sexy, dangerous Fae, is a force of nature who seeks to dig his claws (or rather, talons) into Feyre. And, I can't say that I hate him. I actually like his character, although we witness him do some terrible things (even to Feyre). He seems edgy, fun, and is incredibly witty. (Maas does this thing where she makes you fall in love with all of her characters, even the morally ambiguous ones.) While Tamlin is all gorgeous and good, Rhys has that hot-but-tragic thing going for him.I am already struggling with the love square Maas has going on in the Throne of Glass series (between Celaena and her three love interests -- Chaol, Dorian, and Rowan). I don't think that I will be able to handle the emotional roller coaster of another of her love triangles. But, I think that as long as no one else is introduced, as long as this does not move into the quadrilateral stage, everything will be fine.★ SUPPORTING CHARACTERSWhile Maas' main characters are at the center of attention, her supporting characters keep this book afloat. With less focus and fewer appearances, Maas' supporting characters still manage to steal our hearts and the show.First, there is Lucien, the red-haired, one-eyed Fae who is Tamlin's best friend. He is initially rude to Feyre, but eventually warms up to her. They easily develop a sort of big-brother-little-sister relationship. I would consider Lucien to be the story's comic relief. He is humorous and sarcastic and I adore his character.There is also Amarantha, the story's evil villainess. She is a Fae ruler who has a particular hatred for humans, which is not good for Feyre. She is cold, calculating, and cruel. But she has a backstory (all the best villains have backstories). And, I don't want to spoil you all, so I will just say that, when you learn her backstory, you realize why Amarantha is so harsh and unforgiving. Although, while I can sympathize with her on some level, I find her evil ways to be too much at times. However, I still find her to be an interesting, well-written character.And of course, there is Rhysand, whom I mentioned earlier. He is incredibly important to the story of Book 1, and will have an even larger presence in Book 2. I cannot wait to learn more about his character, because he is so enigmatic and intriguing and I just know that I am going to love him.HONORABLE MENTIONSMaas' WritingI believe that ACOTAR is Maas' at her best. As I stated earlier, we are definitely seeing Maas hone and perfect her skill -- each book she releases is always better than the last. What I liked most about Maas' writing in ACOTAR was her use of first person. Throne of Glass is written in third person, and with changing character perspectives. I find that I can tend to get bored with certain characters. But, with ACOTAR, told from Feyre's perspective, I felt engaged throughout the entire book.Faerie WorldI literally want to live in Prythian, in the world of the Fae that exists beyond The Wall (just without all of the drama). Maas depicts the Spring Court so beautifully and vividly. It seems like a literal heaven on earth.Other than the beauty of the Fae world, there are the parties and festivities. I mentioned Fire Night and the Great Rite earlier, two very interesting festivities held in the Fae world. And then there are parties and gatherings celebrating the seasons, such as Summer Solstice and Midsummer. It is all so fantastical and fun, readers are just dying to step into the pages.***There is not much else I can say about A Court of Thorns and Roses. I LOVED this book! I have no idea how I am going to wait an entire year for the sequel. It's going to be excruciating, but I am sure that it is going to worth it. Because Sarah J. Maas is a fabulous queen of writing, and every word she writes turns to gold.",
                "reviewVotes": "383 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTAEDFFWERQNBXUOFG3QSLSVGUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMKJG4KVVSZZG?ASIN=B00WXS68T4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2017",
                "reviewTitle": "5.0 out of 5 stars Not a perfect book, but a good book 1.",
                "reviewText": "I bought the trilogy. All together they were the best books I've read in a while. Separately, they were not perfect but I'm okay with that. I read a lot and tend to dislike books that show no character growth, or have wishy-washy villains, or have insta-love, or have love result from H saving h from sexual violation, or suffer from deus ex machina. I don't particularly care if something is obvious because sometimes I want to read something that is easy and obvious. My brain doesn't want to be challenged 24/7. Also, I love good dialogue- dialogue makes a romantic connection feel real rather than insta-lovey. Is dialogue action-packed? No. Does it slow down pacing? You bet. At this point, you're probably wondering where this review is going? Well, I think that knowing more about me as a reader might make it easier to see/ relate to my views for this book.Now the fun stuff! ***SPOILERS***Feyre (the h):This character is complex and goes through several changes throughout the series. In this book, she has her ups and downs. Initially, she is hardened, street-smart and capable with a cynical eye toward romance and happiness and outright hatred and prejudice towards the fae. She also has love for a family who seems to dislike and neglect her. She is not very likeable. But does that make a book bad? No. (Hello, Wuthering Heights.) It is, however, more rare to write an h this way because readers in general tend to want to relate to an h, particularly when it's written in 1st person perspective. So many readers might not be able to get into the story because of their dislike for Feyre. When the far remove her burdens that largely drove who she was, Feyre changes. She doesn't have a purpose to keep her going, to shape her. The pacing of the book suffers a bit here while she tries to sort herself out. She tries to make love and painting her new purposes, and while she has the determination to do so, the fit just isn't right. Does this make the book bad? No. While many people won't like to read about an h that seems somehow \"less\" this downward arc was necessary to fuel the inevitable reversal toward a more fitting purpose. It drags a bit for sure, but makes the reversal feel more right, more true later on. Did she rush into something with Tamlin. Her feelings do feel a bit rushed but ultimately fit her as a character- going all-in has always been her style from the start. In that sense, the character is consistent. Also, her reluctance to voice her love made me think that deep-down she might have confused love with gratitude. Tamlin was her savior in many ways. For all of these reasons I liked Feyre.Tamlin (the H):Tamlin was the 1st high fae Feyre had any meaningful interactions with in the 1st book. I never really liked him as an H. He was pretty but basically hollow. He struggles with uncontrolled rage. He had just as much hatred for humans as Feyre did for fae, and his elitist attitude was hinted at throughout this book (though not substantiated until book 2). He also adheres to fae tradition in weird ways- his willing participation in the Fire Night ritual is distasteful because it borders on infidelity (especially since we later learn in book 2 that he can designate a replacement). Tamlin has from the beginning been primarily focused on Tamlin. When things get tough, he sends Feyre away; he doesn't consult or listen to her, but just decides, hinting at his desire to treat her like a possession rather than a person. When he gets a moment of freedom under the mountain he attempts to have sex with Feyre (his wants) instead of trying to escape with or save her (her needs). When Feyre is dying, he can only bring himself to beg for her life, he isn't moved into action. All of these things hint that Tamlin is not a good fit for Feyre. Many readers will not like to read about an H that is so lacking/ ill-fitted. The beautiful part is that these things are only ever hinted at in the writing, not outright stated so you will want to root for Tamlin while also feeling something inexplicably lacking in him. I thought about it lots before I picked up book 2, where my thoughts regarding Tamlin were cemented. Tamlin could not have been written more likeable though. If he was the perfect H then Feyre falling for Rhys in book 2 would have felt like a betrayal, instead of fated, and then Feyre would've been worse than unlikable but detestable as an h.Lucian:A secondary character who is both interesting and flawed. He hates Feyre at first, but ultimately warms up to her. He is loyal to a fault, siding with Tamlin over and again, even when he thinks it is wrong to do so. A trait that becomes more obvious as the series progresses. Lucian has potential.Rhysand (villain/other H):Rhysand was the most interesting character in the book (although Nesta was a close second). Rhys was the evil queen's right-hand man. He has done terrible things. Yet, when we meet him (not my favorite bit of the book because of the gross circumstances I do not favor, as mentioned above) there is evidence that he is not all that he seems. He appeared to be interested in Feyre romantically, but the \"why\" part is not there. Also, it is not 100% certain WHAT drives his actions. He is a mystery. Why did he decide to help her time and again? Why, if he likes her did he decide to put her through nightly humiliation? Why use her to torment Tamlin? He is clearly not 100% a good guy. He is complex.Other things people often talk about:The sex. There is a lot more sex in this book than in other \"YA\" books. It seems like that has somehow lead to some amount of controversy. I find that notion very strange as many eons ago when I was a teen, sex was a big part of being a teen- whether or not to have it, who had it, when they had it where and how, what type of birth control to use, etc. Suggestions that a book would have any type of influence on those things are just silly. Teens have sex. It's a fact. Wishing it otherwise does nothing productive. Also, the sex in this series is not \"explicit.\" Every time I see this adjective used, it makes me laugh. I have read many romances and even some erotica. If you truly want something \"explicit\" check out erotica- phrases like \"the apex of my thighs\" or the \"the length of him\" are not \"explicit.\"The copious dialogue. Lots of readers don't like the extended dialogue and also wish to have seen more of the fae world. I am just guessing here, but I am thinking that they are meaning that they wanted less talk and more fairy magic. But, fae are known for more than just their magic. Another key attribute of fae has to do with their words- being able to only speak in rhyme, only speak the truth, answer any question posed, etc. This attribute can be very interesting (see Mortal Instruments series or Dresden Files). And indeed it was put to use throughout the series, sometimes well done other times much too dues ex machina for my liking. Dialogue can be a type of action when done well enough. In this book, it probably could've been better but was good enough for me.The Fire Night and rape culture. Honestly, I am bothered by this one. I am never fond of rape or sexual violence as a plot device which is why I tend to avoid historical romances almost entirely. In this book, I think the Fire Nite ritual was used in part explain a bit about fae magic and in part to push forward the Feyre-Tamlin relationship while introducing Rhys. I think it both went too far and not far enough. Tamlin's participation cheapens his feelings toward Feyre, just imagine someone saying, \"I love you, truly, but I need to go have sex with someone else.\" And then he came back to Feyre AFTER HAVING SEX WITH SOMEONE ELSE, and bit her to clearly show his possession of her. It doesn't sit well, does it? Additionally, the three fae with bad intentions suggest to Feyre that fae tradition gives them the right to violate her just because she is present. That makes all fae seem brutal and detestable. Thus, it goes too far. But, what about the converse? The Fire Night ritual is supposed to be necessary to ensure the bounty of the land for the next year. But, the spring court is the only court that has/ observes this ritual en mass? That does not really make sense to me. The need for this ritual, especially considering mated bonds are a rare and extremely valued thing, is not properly explained. It really could've been omitted from the book and is one of the few things about the book that I truly did not like.The masks. Some people like them, some don't. The reason given for them was that they were yet another obstacle to a human girl falling in love with Tamlin. I really didn't mind them but I did not like Feyre's reaction to the removal of the masks. While it was consistent with her character (she always had an eye for pretty guys), I thought that it cheapened her character to have her feel relieved that Tamlin was so pretty without his mask. It was very superficial, and further proof that there wasn't much of substance to their \"love.\"While book 1 is my least favorite of the series, I still really liked it and will definitely re-read it again. Books 2 and 3 get even better and I am looking forward to further writings as well. Hopefully we will get to see what happens to Nesta, Elaine, the 6th queen, and Bryaxis.",
                "reviewVotes": "224 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 13, 2023",
                "reviewTitle": "buenísimo!",
                "reviewText": "No podía dejar de leer! Si te gusta HP, este te va a encantar. Fantasía más amor en un solo libro.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "geovana lima",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 26, 2023",
                "reviewTitle": "simplesmente perfeito.",
                "reviewText": "eu adorei, igual a foto. é tão lindo que eu até chorei quando abri.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Slou",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 7, 2024",
                "reviewTitle": "Enjoyable read",
                "reviewText": "Very enjoyable book. Found the series on social media and had to get them to my book shelve!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Afrodite",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on January 27, 2024",
                "reviewTitle": "Good!",
                "reviewText": "Good condition!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martyna Korzeniewska",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Poland on December 22, 2023",
                "reviewTitle": "Piękne wydanie",
                "reviewText": "Super wydanie, dostarczona w idealnym stanie.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}