{
    "remaining_requests": 391,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Uprooted-Naomi-Novik-audiobook/dp/B00XQBBRQQ",
    "body": {
        "name": "Uprooted",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Uprooted-Naomi-Novik-audiobook/dp/B00XQBBRQQ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/616WSKSsqLL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Naomi Novik",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Naomi+Novik"
        },
        "brand": "Naomi Novik",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 24222,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEBULA AWARD WINNER HUGO AWARD FINALIST “If you want a fantasy with strong characters and brilliantly original variations on ancient stories, try Uprooted!”—Rick Riordan “Breathtaking . . . a tale that is both elegantly grand and earthily humble, familiar as a Grimm fairy tale yet fresh, original, and totally irresistible.”—Publishers Weekly (starred review) ONE OF THE BEST BOOKS OF THE YEAR: NPR, BuzzFeed, Tordotcom, BookPage, Library Journal, Publishers Weekly Agnieszka loves her valley home, her quiet village, the forests and the bright shining river. But the corrupted Wood stands on the border, full of malevolent power, and its shadow lies over her life. Her people rely on the cold, driven wizard known only as the Dragon to keep its powers at bay. But he demands a terrible price for his help: one young woman handed over to serve him for ten years, a fate almost as terrible as falling to the Wood. The next choosing is fast approaching, and Agnieszka is afraid. She knows—everyone knows—that the Dragon will take Kasia: beautiful, graceful, brave Kasia, all the things Agnieszka isn’t, and her dearest friend in the world. And there is no way to save her. But Agnieszka fears the wrong things. For when the Dragon comes, it is not Kasia he will choose. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Action-Adventure/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10159265011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "17 hours and 44 minutes"
            },
            {
                "name": "Author",
                "value": "Naomi Novik"
            },
            {
                "name": "Narrator",
                "value": "Julia Emelin"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 19, 2015"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00XQBBRQQ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,204 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #78 in Fairy Tale Fantasy (Audible Books & Originals) #413 in Adventure Science Fiction #732 in Epic Fantasy (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Robin Snyder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLX434YT5VYRRJZIONOCQN2BJHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TCPP4IUPIALA?ASIN=B00XQBBRQQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 12, 2015",
                "reviewTitle": "5.0 out of 5 stars A New Fairytale for the Ages.",
                "reviewText": "' Our Dragon doesn’t eat the girls he takes, no matter what stories they tell outside our valley. We hear them sometimes, from travelers passing through. They talk as though we were doing human sacrifice, and he were a real dragon. Of course that’s not true: he may be a wizard and immortal, but he’s still a man, and our fathers would band together and kill him if he wanted to eat one of us every ten years. 'Occasionally right when you read the first few pages of a book you know intuitively that you will love it. That is how this began for me. I KNEW right from the first paragraphs that I was going to crawl into this world and not come out until the story was complete and maybe not even then.I got lost in the world created between the covers of this story. It’s a new kind of fairytale where the hero isn’t perfect, handsome and sweet. Our hero the Dragon is a cranky Wizard who is all logic, solitude, prickles and thorns.' But there was something unnatural in his face: a crow’s-nest of lines by his eyes, as though years couldn’t touch him, but use did. It wasn’t an ugly face, even so, but coldness made it unpleasant: everything about him said, I am not one of you, and don’t want to be, either. 'Our heroine Agnieszka is the complete opposite of him. She is utterly clumsy, always a mess, stumbles into trouble completely by chance and saves herself the same way with intuition and feeling.' “You’ll have to marry a tailor, my little Agnieszka,” my father would say, laughing, when he came home from the forest at night and I went running to meet him, grubby-faced, with at least one hole about me, and no kerchief. He swung me up anyway and kissed me; my mother only sighed a little: what parent could really be sorry, to have a few faults in a Dragon-born girl? 'She is an absolute contradiction to his life and he hates that he picked her to come with him to the tower. But no one was more surprised than Agnieszka on the picking day because she had known her whole life that her best friend Kasia was the special one and would be chosen. She was unprepared for her new life in every way.The main villain isn’t your normal everyday bad guy either. It is hard to describe the villain accurately as it is more of a presence in the wood. The forest is a living breathing character in this story and it has evil in it, evil that is forever pushing the boundaries of the forest outward. If you aren’t careful you might travel to close to it and be snatched up yourself…once the forest has you it will never let you go. The corruption can go down into your very soul and those that have walked out of the forest are not the same people as those who walked in. *cue spooky sounds*- \"There was a song in this forest, too, but it was a savage song, whispering of madness and tearing and rage.\"Uprooted has a very soft Beauty and the Beast feel to it, but do not be confused this is not a retelling of that story. This is a new fairytale full of wonderful imagery, magic, mystery and a touch of creepiness to it. No character is flat, every single important character in the story is intricate and complicated with feelings and motivations that are unfurled slowly throughout the story. This is a true journey through the world and each discovery is more interesting than the last.While there were so many things I absolutely adored in this story one of the main ones was Agnieszka learning how to use her magic and in turn how she was able to blend her magic with the dragons. Some of the most beautiful imagery in the book came out of them learning to work their completely different types of magic together to weave sometime even more beautiful, intricate and stronger than they could alone.' …our workings caught on one another, magic gushing into them. The rosebush began growing again, roots crawling off the table and vines climbing out the window. The bees became a humming swarm amid the flowers, each of them with oddly glittering eyes, wandering away. If I had caught one in my hands and looked closely, I would have seen in those eyes the reflection of all the roses it had touched. But I had no room in my head for bees, or roses, or spying; no room for anything but magic, the raw torrent of it and his hand my only rock. 'I don’t want to give too much of the story away because the journey is so worth it and should not be spoiled. Agnieszka’s devotion to her family, friends and valley made her one of my favorite heroines. She saw people for the imperfections that they have and loved them fiercely anyway. The relationship between Agnieszka and her best friend Kasia was absolute what a female friendship in a story should be. I loved them together and I am so greatful that the author didn’t make everything between them as friend picture perfect but it was real. Kasia’s fate in the story was unusual and fit perfectly into this fairytale.There are more characters and plots a foot but you must read it to find out about Prince Marek, who reminded me slightly of a more ¿likable? Gaston and I spent most of the book deciding if I absolutely hated him, just sorta hated him or possibly liked him. I did at least understand his motivations, no matter how misguided and selfish they seemed at times. Along with a King, a Queen, a Falcon (really another Wizard) and some other magical people to boot. So many fantastic characters I can’t even begin to touch on them all.This is everything I look for in a new Fantasy and while the entire story wraps up quite nicely I was sad when I looked and saw that this currently is a standalone novel. I would really enjoy spending more time here if the author is so inclined. Note: Even though the heroine is 17 don’t let that fool you this is not really a YA story (there is a non fade to black sex scene) and all the death and creepiness/horror factor I would say not really for anyone under the age of 16.Naomi Novik is now on my radar and I’m sure I’ll check out some of her other works.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tooters",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTBAORWBVVHFWJPRG5XRNYPKFEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19DK6USMQ9KAX?ASIN=B00XQBBRQQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "4.0 out of 5 stars Story is good, But…",
                "reviewText": "I give the story 4⭐️⭐️⭐️⭐️. It is entertaining. But an FYI, I like to read/ listen to my books. This is so on commutes or daily chores I can still enjoy the book. This book’s narrator is pretty awful. It seems to have a ‘staccato’ type rhythm and very unpleasant. So you may want to check a sample before you choose the audio version.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5EJTIBO5EXXYDMOSUQVYBDJIJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R363HZL75OJI2R?ASIN=B00XQBBRQQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 20, 2015",
                "reviewTitle": "5.0 out of 5 stars A brand new fairy tale for adults and the BEST BOOK I've read in YEARS.",
                "reviewText": "Imagine a powerful sorcerer living in a lone tower in the middle of a forest. He is over 150 years old, yet still has the appearance of a young man. Every 10 years he leaves his tower to pick a girl from one of the local villages and take her back to his tower. And the villagers allow this, b/c the sorcerer protects them from the Wood.The villagers don't know what happens to the girls during their time in the tower, only that they come back changed. Grander, more polished. Educated and dressed in fine clothes.The girls leave the sorcerer with a sack of silver to use as a dowry, but the girls always leave their former home, using the money to finance a fresh start somewhere else, rather than marrying and resettling into village life.This sorcerer, called the Dragon, is alone except for the village girl, and even with her, he maintains his distance. He will long outlive her, and the others like her, so he buries himself in order and precision, and the resulting beauty of a task well done.His nature is taciturn, impatient, and formal, so the villagers, despite their dependence on him for protection fear him, despise him:\"I had hated him, but I wouldn't have reproached him, any more than I would have reproached a bolt of lightning for striking my house. He wasn't a person . . .\"Agnieszka is the antithesis of this sorcerer, this Dragon.Left to his own devices, he would never have chosen her as his new companion, but Agnieszka has magic, and the King's Law states that any found with the talent must be trained, and so he does choose her.What happens after that is a compelling combination of growth and regrowth, misunderstanding and discovery, fantastical and horrifying, and all of it is utterly captivating.This is my first Novik, and hopefully the first of many. It sounds trite to say she has a gift--of course she does, she wouldn't be published otherwise--but I'm saying it nonetheless, and it is a multifaceted gift.Whether it was the occasional use of repetition for emphasis:\"She kissed me again and held me once more, and let me go. It did hurt more. It did.\"Or her vivid descriptions:\"I had forgotten hours and days by then. My arms ached, my back ached, my legs ached. My head ached worst of all, some part of me tethered back to the valley, stretched out of recognizable shape and trying to make sense of myself when I was so far from anything I knew. Even the mountains, my constants, had disappeared. Of course I'd known there were parts of the country with no mountains, but I'd imagined I would still see them somewhere in the distance, like the moon. But every time I looked behind me, they were smaller and smaller, until finally they disappeared with one final gasp of rolling hills.\"Or her ability to capture human nature so completely that you become a part of the story, an observer from within, rather than a simple reader from another time, from another place:\"I'm glad,\" I said, with an effort, refusing to let my mouth close up with jealousy. It wasn't that I wanted a husband and a baby; I didn't, or rather, I only wanted them the way I wanted to live to a hundred someday, far off, never thinking about the particulars. But they meant life: she was living, and I wasn't.\"And beyond the simple beauty of her words, she creates real, believably flawed people characters.Marek is a prince, not the crown prince, and he has no qualms about making his displeasure on that topic known, and upon meeting him the first time . . . I didn't know what to think. He behaved abominably, but in such a way that he himself wasn't absolutely abominable. Just self-interested. But redeemable. Until he isn't. But wait, maybe he's not completely horrible after all . . .It was a cycle that I completed several times, and in the end . . . I'm still undecided.But he was real. And he was one among many.Kasia is Agnieszka's best and only friend. She is also the girl that all the villages expected the Dragon to choose. So imagine my dismay when shortly after she escapes that fate, she is abducted by one of the Wood's foul creatures.Now imagine Agnieszka's dismay.If you want to know whether or not Kasia is saved, you'll have to read the book for yourself (which you should do anyway, b/c AWESOME), but I will tell you that Agnieszka finds something in the Wood, and that something reminds me of one of my favorite Christian Schloe paintings:[see blog or goodreads review for image]Fantastic(al), right? The whole book is like that.UPROOTED by Naomi Novik is part fantasy, part fairy story, and all parts wonder. I haven't been as enamored by this type of tale since I was child, but this is not a children's story, and still I found myself smitten like a girl with ribbons in her hair, twirling in her favorite dress in the sunshine. UPROOTED is a story that has carved it's place on the bookshelf-of-my-heart, and I enthusiastically endorse it as my top read of 2015 thus far.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nin Puppi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPP7WGCSZM5Q7HQALVNCS2HGDYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CCPT7K3LORHS?ASIN=B00XQBBRQQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved it loved it loved it",
                "reviewText": "This book drew me in the first few pages and absolutely devoured me. What a wonderful read. The characters were excellent the story was so sad but at the same time just exactly what I needed to read. Of making mistakes, of forgiveness, of learned to let a grudge go, of trusting yourself. And i just fell in love with it so so much. Going to be one of my top reads for the year for sure.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CV",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF57HQV3CEURZJJYJKDHLQ5FPZRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G8X9CB3FTATW?ASIN=B00XQBBRQQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars One of my favorite books. I wish there were more in this series!",
                "reviewText": "It is the perfect standalone novel. So satisfying! I just wish there were more books set in this world.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aradjha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 5, 2023",
                "reviewTitle": "A tight story about a land besieged by a nefarious forest.",
                "reviewText": "Beautiful, visceral, evocative writing and a timeless narrative with an eastern European flair. It skips neatly over the underpinnings of pointy hats and pointer swords common in modern fantasy. Heartily recommended",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CTHULHU",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 20, 2023",
                "reviewTitle": "Brilliant and fascinating",
                "reviewText": "I got swept away by the fable style of the book, the main character's wisdom despite her young age and the beautiful metaphors woven into this story. A wonderful, wonderful book that'll stay dear to my heart.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chumee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 7, 2021",
                "reviewTitle": "I devoured this",
                "reviewText": "This is the first, and so far, the only book I’ve ever read (on the Kindle) where I kept watching the ‘percentage left to read’ and hoping it would just go on and on!It’s 3am and I’m desperately searching for a sequel.I want more!!!It is by turns, beautifully written, exciting, intriguing and terrifying, while also managing to be sweet.I loved the characters, the magic, the monsters and the trees ♥️While there are bits that go slow, there is not one bit that is ever boring. Be grateful for the slow parts - you’ll need to catch your breath.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Visic",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 14, 2020",
                "reviewTitle": "wow just wow",
                "reviewText": "Loved it... from the first page... When I have finished it, bought the other book from the same author (Spinning Silver)... Thought it can't get better, but it did... My only problem- what to read now that I have finished this? What I liked here- well l, the heroine, her resilience, her courage, her love for others... a good feemale friendship bond...a dash of interesting romance...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 3, 2018",
                "reviewTitle": "Realmente sientes la magia.",
                "reviewText": "Un hermoso libro que te atrapa de principio a fin. El uso de la magia y la escencia de la misma me parecieron sumamente originales además de que logras sentir la magia gracias a la narración. Y me pareció un gran desenlace. Me hubiera gustado tardar más en terminarlo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}