{
    "remaining_requests": 299,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Outlander-Novel-Book-1-ebook/dp/B000FC2L1O",
    "body": {
        "name": "Outlander: A Novel (Outlander, Book 1)",
        "price": "$5.99",
        "originalPrice": "",
        "rawPrice": 5.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Outlander-Novel-Book-1-ebook/dp/B000FC2L1O",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91tjikkfB6L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Diana Gabaldon",
            "link": "https://www.amazon.com/Diana-Gabaldon/e/B000APXMEG/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 98607,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B000FC2L1O"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Dell; 1st edition (October 26, 2004)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 26, 2004"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3965 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 560 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0440212561"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,854 in Kindle Store (See Top 100 in Kindle Store) #3 in Historical Fantasy Fiction #3 in Time Travel Romance #5 in Time Travel Romances"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 98,607 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Outlander (20th Anniversary Collector's Edition) OUTLANDER BOX SET SEVEN STONES TO STAND OR FALL OUTLANDER COMPANION THE OFFICIAL OUTLANDER COLORING BOOK THE EXILE The first book in the Outlander saga, and the basis for the Starz original series. This special twentieth-anniversary edition features an original essay, a new map, and more. Blending rich historical fiction with riveting adventure and a truly epic love story, here are the first four books of the epic Outlander series: OUTLANDER DRAGONFLY IN AMBER VOYAGER DRUMS OF AUTUMN A magnificent collection of Outlander short fiction—including two never-before-published novellas—featuring Jamie Fraser, Lord John Grey, Master Raymond, and many more, from Diana Gabaldon Perfect for readers of the bestselling Outlander novels—and don’t miss The Outlandish Companion Volume Two! This spectacular adult coloring book features forty-five all-new illustrations! This Outlander graphic novel gives readers a fresh look at the events from Jamie Fraser’s point of view, gorgeously rendered by artist Hoang Nguyen.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/72701afb-5f48-4992-9511-14286ec7f7ab.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a94283c-6509-4cc3-af12-b531ef87e160.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d618bc26-e381-4a7c-b1ea-2102cb942e86.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/843f0bf2-acb9-41c3-965a-41c1f754cc6e.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/627a1475-b090-4c1f-bd32-d2f1329a6a1a.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f443d277-0b5d-4f65-a1d8-acf6e6a27e68.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4c80f163-d27e-4759-9c93-72a3017454db.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bec0f011-b001-469e-b64e-fa428599c0bc.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4798a678-de5f-4a3d-bc5a-daf18fe74e2d.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A. Gavin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFI75AWYJLRKKENZH4UQGS4DW6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AS7FV5XTWMAS?ASIN=B000FC2L1O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2014",
                "reviewTitle": "5.0 out of 5 stars Real Men Wear Kilts",
                "reviewText": "I’ve been meaning to read Outlander for years. Part time travel, part historical fiction, big best seller… it’s also fundamentally a Romance (cough). This last gave me pause, but finally, after checking out the show (to be reviewed later) I bit the bullet.It’s funny how bestselling series drive against the current of writing “shoulds.” This book is long. It’s detailed. The protagonist is often adrift without clear “motivation” or “agency.” The prose can be highly redundant. There are countless scenes that don’t serve the spine of the plot.But these “problems” also help make for a good read, and a good read it is. Fundamentally this is a novel about interesting, and well developed (if sometimes problematic) characters, caught in an unusual and fascinating blend of setting and situation.Setup: It’s 1945 and Claire Randall is a happily married nurse. On holiday in Scotland with her husband, a circle of ancient stones mysteriously teleports her to 1743. Stuck there, she meets and falls in love with sexy highlander Jaime Fraser against the backdrop of the coming Jacobite rising.This sounds fairly trite, and it is, but the historical detailing of 18th century Scotland is very well done. The author clearly did her research, and she builds a cast of interesting characters and a rather fascinating world on the edge of war. There is an intrinsic tension between Claire’s two lives. Her modern husband isn’t a bad guy at all, even if he lacks Jaime’s manly-man energy. But she finds herself in this new place and in love — so what does she do? This dilemma provides for most of the conflict during the first two thirds of the novel.Let’s back up and discuss prose and voice. Gabaldon is a good writer. Her prose is energetic and descriptive, often erudite. The voice is completely first person from Claire’s POV. She has an engaging, if a bit overly clinical viewpoint. I had small problems with repetition. Gabaldon often repeats words a sentence later without reason of parallelism and has a tendency to elaborate on a point more than necessary. This is a book where a great deal of the subtext is in the text. Claire spells it out. Sometimes twice. Sometimes thrice. This, by the way, is another of those writing “shoulds.” You’re not supposed to “tell,” but “show” (imply). That’s “better writing.” But as far as I can tell, bestsellers don’t tend to be subtle.There is a lot of Scottish accented dialog in this book, and it’s very well handled.Claire’s POV is generally excellent, but it does result in a few issues. Occasionally (particularly in the later part of the novel) some events occur “off screen” (when she isn’t there). Gabaldon then results to gratuitous retellings where other characters relate the event to her in unlikely detail. Occasionally, a briefer recounting leads to some reader confusion. Claire is also hyper aware and overly clinical. As the author likes to handhold us through her thought process, it sometimes feels like exactly this, author handholding rather than genuine cognition. This leads to one of my bigger “motivational gripes” with this generally excellent novel, that Claire often feels fairly selfish and overly analytic. Particularly in the middle of the novel, Claire is nominally still plotting to head back to the future, but this tell feels incongruous with the emotions the author has her “show” toward Jaime.As I mentioned, the historical details are good. The attitudes of the 18th century men and women are well handled and relatively free of anachronism. Things are properly grungy, sexist, and occasionally brutish. It is occasionally a little odd that Claire herself is not terribly discomforted by this. She points out plenty of good stuff, particularly having to do with justice, medicine, and punishment, but she doesn’t really seem to miss toilets, showers, medical care, comfortable clothes, or well preserved food. Perhaps her life as a nurse during WWII was grungy enough to prepare her. She occasionally mentions discomforts flipply, but less than I’d imagine. She never really complains (or seems to suffer) with regard to food, sleeping in haystacks, or walking barefoot across the chilly Scottish moors.The time travel element is very light SciFi/Fantasy in this first novel at least, but is used to good effect. There is no mumbo-jumbo explanation to gum things up.Being a romance, and a fairly erotic one, this is also a novel full of sex. Jaime and Claire go at it like rabbits — and things are often fairly explicit, at least in a literary way. I have no problem with most of this, as it’s actually pretty hot, and I imagine that for many women it’s insanely hot (see, word repeated deliberately for effect!). But there are aspects to the sexuality in this novel that are weird. Two huge ones (spoiler alert):1) In the middle, after Claire disobeys him, Jaime “punishes” her by strapping her bare ass (to put it bluntly). To tell the truth, his reasoning is perfectly typical by 18th century standards, but comes off as a bit twisted by ours. And some readers will be bothered by the otherwise very spunky Claire’s fairly rapid absolution of her wife-beating lover. In fact, it’s clear that Gabaldon has a bit of a “thing” for corporal punishment as it’s a constant theme in the book. Jaime goes way overboard to emphasize how much hiding her turned him on.2) More disturbingly, Gabaldon probably isn’t the biggest fan of Homosexuality. The novel’s villain (Black Jack) is not only gay, but she goes to great lengths to integrate his evil tendencies and his sexual proclivities. Otherwise, he’s actually a rather excellent villain, but she goes big time overboard in Jaime’s recounting of the intensely odd and twisted “final hours” between Jaime and the menacing Black Jack. It’s pretty darn nasty and twisted. This, along with a retelling of an older encounter between Jaime and a gay Duke feels like an overzealous attempt to demonize… to quote the novel: “poofters.”Overall, this is an excellent novel. None are perfect, and it’s engaging throughout. The place/time is vividly depicted, and the characters are boldly executed. Both stay with you — which is no small feat for any author.Andy Gavin, author of Untimed and The Darkening Dream",
                "reviewVotes": "60 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFE7DFOJZFEBCRUOHLIDQMFK2KDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7W9GQ5MZOGXS?ASIN=B000FC2L1O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 25, 2015",
                "reviewTitle": "5.0 out of 5 stars Outlander Revisited",
                "reviewText": "I love this book series so much, that I’ve been dying for an opportunity to read it again. However, since I’ve been so busy reading all the other books on my TBR Pile, my curiosity wasn’t piqued enough to pick up the novel again until the premiere of STARZ’s cable series, adapted from Diana Gabaldon’s best-selling novel, this fall. As I watched the cable network’s adaptation, I began to question certain small things in the episodes as to whether they happened in the book. Finally, my curiosity got the best of me, and I decided to read Outlander again for the first time in two years.The Good…:The world Diana Gabaldon creates in her Outlander series is so rich, that I want to savor every little detail. From the characters’ clothing to Claire’s medical applications, it’s hard not to get sucked into 1743 Scotland along with Claire Beauchamp Randall Fraser. Aside from the way of life during this time period, Gabaldon has created an interesting array of characters that keep you on your toes.At the heart of the story is Claire. She’s a former trauma nurse who served during World War II, and is on a second honeymoon with her husband Frank Randall in the Scottish Highlands, when Claire unexpectedly finds herself traveling back through time 200 years into the past. While there she meets the other man in her life, James Fraser. It’s hard to see which man Claire should end up with initially since they’re both kind and loving, but as the story progresses you begin to wonder how she can ever leave Jamie.“You’re mine, mo duinne. Mine alone, now and forever. Mine, whether ye will it or no. Aye, I mean to use ye hard, my Sassenach,” he whispered. “I want to own you, to possess you, body and soul. I mean to make ye call me ‘Master,’ Sassenach. I mean to make you mine.” – JamieJamie’s family, friends, and foes also add color to this magical story. His uncles Colum and Dougal are incredibly mysterious. Sometimes they seem like uncles anyone might have in their family, yet other times they seem like they may be enemies parading as friends. Trying to figure out their motivations add an element of mystery as Jamie and Claire begin to navigate the complicated politics of this time. That in Scotland itself, and within the clan system in the Scottish Highlands.As for enemies, Jamie and Claire seem to find them around every corner. The main villain in this story is “Black Jack” Randall, Claire’s husband Frank’s six-times great-grandfather. This British officer is a horrible, horrible person, and the fact he’s the spitting image of Frank carries complications of its own. For Claire, it means she miscalculates the horrors “Black Jack” is willing to inflict on others. For me as a reader, it means I find myself for hating Frank by association. I keep having to remind myself that they aren’t the same person.The Bad…:Since Outlander is set in the 18th century, many things that happen to the women in this story are fitting within the time period. When reading this novel, you must remember this fact, and that what the women go through was pretty common and accepted. However, it’s not only the women that run into a bit of violence in the book. Jamie, in particular, is a victim of violence that is quite graphic. So if you are a bit squeamish, you may want to skim those scenes. Then again, those events have lasting repercussions throughout the series, so… maybe not.“I gave you justice, it said, as I was taught it. And I gave you mercy , too, so far as I could. While I could not spare you pain and humiliation, I make you a gift of my own pains and humiliations, that yours might be easier to bear. ” – JamieAnother aspect of the story that may give readers pause is how homosexuality is viewed in the book by the characters. This viewpoint was also common for that time, so if you are a bit sensitive to LGBTQ issues, you may want to fortify yourself. One of the characters in the book is homosexual, and happens to be in the precarious situation of being in the British military. In the 18th century, not only would he lose his position and be ruined if his sexuality came to light, but he would also be imprisoned. This aspect to the character gives a certain light to his actions in the story which I won’t divulge due to spoilers. Sorry!Do I Recommend?YES! YES! YES! Outlander isn’t a world-wide best-selling novel for no reason. It’s a fantastical tale of romance that withstands time and space. It’s a mystery about a woman far from home who doesn’t know how she got where she is, or how to get back. It’s a paranormal romance of a woman in love with two different men separated by 200 years. It’s a historical fiction story set in 18th century Scotland during the Jacobite movement in the time of the clans, and witch trials. It’s and adventure story about a young man who acted rashly and nearly lost his life in lieu of his freedom. A wanted man who years to return home to his family, and be the man he was meant to be. This story has something for everyone, and will not disappoint. To date there are eight books (and counting) in the series, so now is the time to jump in and see what all the buzz is about. Since this novel is amazing, hard to put down, and somehow managed to be even more wonderful the second time around, I give it 5 out of 5 stars.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kentuckybooklover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBFUGAM2QK537OEJZZ3WLYRFYIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S0UHMRXKRE4D?ASIN=B000FC2L1O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars why did I wait so long to read this book?",
                "reviewText": "I am so happy there are 9 plus novellas as I am hooked. I enjoy historical fiction but more of the WWII eras and not the 1700s Scotland or so I thought. I found myself staying up late and getting up early to read whenever I could.I will say the last two hundred pages or so tore me up. I’m still shivering from what Jamie experienced.Yes, it has spicy parts. Yes, it has some gruesome, violent parts. Yes, you should 100% read Outlander!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "See Jane Run",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV4AZWWR2GAD72PEOWJJTAEKQLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKDY75QMLNVXG?ASIN=B000FC2L1O",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Interesting Historical Fiction",
                "reviewText": "I have never been particularly interested in the history of Scotland, so picking up this one was a bit of a stretch for me. In the end I found it held my interest, though a bit slower paced than I prefer. The characters were well developed, and the author created each scene skillfully. At this point I am undecided as to whether or not I will continue the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eli",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 10, 2024",
                "reviewTitle": "Ótimo",
                "reviewText": "Já vi todas as temporadas da série mas ainda assim vale ler os livros.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandy Manning",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 1, 2024",
                "reviewTitle": "How interesting it is",
                "reviewText": "This book is well written and a very interesting book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnnB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 8, 2024",
                "reviewTitle": "so captivating you can’t put it down",
                "reviewText": "How could you not be drawn in to the story and feel like you are part of the ancient world? Visiting but unseen in the trials and tribulations of Claire and Jamie’s time. A great book by anyone’s standards",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elodie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 31, 2023",
                "reviewTitle": "En anglais",
                "reviewText": "Cadeau pour offrir mais je me suis trompée de version. Livre renvoyé mais était arrivé en parfait état et dans les délais tout était parfait.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samyuktha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 30, 2023",
                "reviewTitle": "Incredibly Detailed",
                "reviewText": "If this was Diana Gabaldon's \"practice\" book, I am in awe of her writing prowess. As someone who is hooked onto the Outlander TV series, it took me a while to get around to reading the book. It is incredibly detailed—far more than the average historical romance—and makes others look shallow and poorly researched and whimsical in comparison. The relationship between Jamie and Claire is very REAL, with all its ups and downs fleshed out in detail, and Claire's character has been so beautifully constructed that I'm convinced Caitriona Balfe was an excellent choice for the role. Additionally, another beautifully written character was Jenny Murray, née Fraser, also perfectly cast and portrayed in the series. I learnt a lot about Scotland and honestly found myself glad at times that I live in times where women aren't so easily condemned as witches. My only grouse with the book is that it was a tad too long—I felt there were some details that could have been edited out to maintain the pace and stay on track. While the length per se isn't a problem, sometime too much detail takes away from the narrative flow. Nevertheless, it was a beautifully written and researched work and Diana Gabaldon is a gifted writer with a wonderful way with words. And I'm glad that the TV series has remained quite loyal to the original source material and has not changed too much, and has retained the soul of the work while adjusting to the need for brevity in each episode.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}