{
    "remaining_requests": 134,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Deadly-Education-Novel-Scholomance-Book/dp/B085LM5Z1F",
    "body": {
        "name": "A Deadly Education: A Novel (The Scholomance, Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Deadly-Education-Novel-Scholomance-Book/dp/B085LM5Z1F",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41g75wumgPL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Naomi Novik",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Naomi+Novik&search-alias=audible"
        },
        "brand": "Naomi Novik&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 15812,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "New York Times Best SellerFrom the author of Uprooted and Spinning Silver comes the first book of the Scholomance trilogy, the story of an unwilling dark sorceress who is destined to rewrite the rules of magic.Finalist for the Lodestar Award“The dark school of magic I’ve been waiting for.” (Katherine Arden, author of the Winternight Trilogy) I decided that Orion Lake needed to die after the second time he saved my life. Everyone loves Orion Lake. Everyone else, that is. Far as I’m concerned, he can keep his flashy combat magic to himself. I’m not joining his pack of adoring fans. I don’t need help surviving the Scholomance, even if they do. Forget the hordes of monsters and cursed artifacts; I’m probably the most dangerous thing in the place. Just give me a chance and I’ll level mountains and kill untold millions, making myself the dark queen of the world. At least, that’s what the world expects. Most of the other students in here would be delighted if Orion killed me, like one more evil thing that’s crawled out of the drains. Sometimes I think they want me to turn into the evil witch they assume I am. The school certainly does. But the Scholomance isn’t getting what it wants from me. And neither is Orion Lake. I may not be anyone’s idea of the shining hero, but I’m going to make it out of this place alive, and I’m not going to slaughter thousands to do it, either.Although I’m giving serious consideration to just one.With flawless mastery, Naomi Novik creates a school bursting with magic like you’ve never seen before, and a heroine for the ages - a character so sharply realized and so richly nuanced that she will live on in hearts and minds for generations to come.The magic of the Scholomance trilogy continues in The Last Graduate. “The can’t-miss fantasy of fall 2020, a brutal coming-of-power story steeped in the aesthetics of dark academia. ... A Deadly Education will cement Naomi Novik’s place as one of the greatest and most versatile fantasy writers of our time.” (BookPage, starred review)“A must-read ... Novik puts a refreshingly dark, adult spin on the magical boarding school. ... Readers will delight in the push-and-pull of El and Orion’s relationship, the fantastically detailed world, the clever magic system, and the matter-of-fact diversity of the student body.” (Publishers Weekly, starred review) Read more",
        "breadCrumbs": [
            {
                "name": "Audible Books & Originals",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_1?ie=UTF8&node=18145289011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18580606011"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18580607011"
            },
            {
                "name": "Paranormal & Urban",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18580622011"
            },
            {
                "name": "Contemporary",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=18580623011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 59 minutes"
            },
            {
                "name": "Author",
                "value": "Naomi Novik"
            },
            {
                "name": "Narrator",
                "value": "Anisha Dadia"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 29, 2020"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B085LM5Z1F"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,955 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #34 in Contemporary Fantasy #49 in Coming of Age Fiction (Audible Books & Originals) #115 in Coming of Age Fantasy (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Josh Mauthe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESESBLLG3ZZISQONG5SOAEUGC3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QSRXV7SL1W5X?ASIN=B085LM5Z1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2022",
                "reviewTitle": "5.0 out of 5 stars A deadly magic school + a surly outcast protagonist + an annoying chosen one = a great read",
                "reviewText": "“I decided that Orion Lake needed to die after the second time he saved my life.”That’s the first line of A Deadly Education, the first book in Naomi Novik’s Scholomance series, and like so many things in the series, it does a lot of things at once. It gives you a sense of the world we’re diving into (it’s obviously a dangerous place – lots of life-saving going on! – and also a place where apparently people are a big threat to each other), but also tells you a lot about our protagonist, El Higgins, an independent, surly, angsty student at the Scholomance who would just as soon kill someone as be helped by them. Although, honestly, with the Scholomance being the kind of place it is – a magical school where you graduate by surviving, and where graduation is a slaughterhouse full of monsters where you’re in a rush to get out, and who cares who else doesn’t make it? – well, maybe El should be getting some help.But that independence, stubbornness, and (quite frankly) bitchiness is part of what makes El such a great protagonist for the series, and gets at the heart of how A Deadly Education hooked me so effortlessly. The idea of a magic school full of monsters and threats, where students just have to survive…well, any time I’ve mentioned the series to anyone, they say “Oh, it’s like a blend of Hunger Games and Harry Potter.” And they’re not wrong…but it doesn’t capture the tone of A Deadly Education, as Novik approaches it all not with wonder at magic, not with horror at the cost of survival, but just with dry snark, casual apathy, and an inured sense of loss, because when this many people are dying, you can’t afford to be that kind and caring. And if you’re an outcast like El – already unpopular, plus there’s the fact that any time she learns a spell, it turns into a weapon of massive destruction and death – well, you know, screw these guys.And so, if you meet Orion Lake, who’s clearly the “hero”/”chosen one” of this story, and he wants to help everyone…well, screw him too.It’s that angsty teen surliness that makes A Deadly Education stand out from the pack of Hunger Games and Potter knockoffs. It’s snarky, and it’s funny, and it’s also rivetingly dangerous – from the walls of your dorms that open into the void to the little creatures that live in shower heads, Novik has created an absolute nightmare of a school, and manages it even better by fleshing out the unexpected details. Of course people wouldn’t shower without someone to watch their back; of course the first person to get food needs to watch out for the monsters lurking in the potatoes. And through it all, there’s Orion to save the day…but there’s also El, left out, grouchy, irritated, and just needing to survive – and doing her best to not become a villain of historic proportions.All of which makes A Deadly Education just a blast of a first book, and that’s before a dynamite climax that feels like a real game-changer for the world - and one heck of a last line. It all left me diving for the \"next book\" button, and let me tell you - the rest of the series more than delivers. What a treat.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gore and Tea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGT4ITJZXMWP2WDNJSUJRG4MZ5SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R1XF5KEV3SX7?ASIN=B085LM5Z1F",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2020",
                "reviewTitle": "4.0 out of 5 stars A darker version of Harry Potter",
                "reviewText": "It's nice knowing that books about witches aren't dead. The main idea of Naomi Novik's new novel, A Deadly Education - - - a new series with the second book already slated to release in 2021 - - - is about a school of magic that is focused on survival. Of course, this may bring about similarities of J.K. Rowling's Harry Potter series, but this story is no way the same, A Deadly Education is a much darker witch school story with young murderers and also monsters that eat the students alive.Yet this dark and morbid story is about a young girl who has been foreseen to possess powers that could destroy millions of people as our main character, and she can be quite off-putting at times. Her personality - - - a need to be liked, but refuses to allow anyone to like her, her need to show that she is always the smartest person in the room, and her blatant rudeness to a young man that saves her life more than once - - - makes it hard, as a reader, to root for this character. She does have moments of dark humor that made me laugh, moments of sarcasm that were pretty good, but she quickly assumes that everyone hates her and wants her to die before making it to senior graduation.Galadriel is her name, but she prefers to go by El, and both of her parents were students at this Scholomance. She begins by talking about different kinds of witches there are at the school, including ones that use malia. Malia is a form of magic that takes it's mana from living things, including people. One such student she knows that uses malia is Yi Liu. El describes how malia of this sort slowly kills the one using it by telling the reader that Liu's eyes are turning all white, and her nails have gone completely black (and it's not polish).Early on, readers are told about enclaves at the school, usually rich kids whose families have had more survivors from graduating classes than others. Students who are not part of these cliques know that it is very important to try to get an invitation to join one before senior year because your chances of survival are higher with a group than by yourself. El spends most of her time debating whether she wants to be part of one or not; her shifts in decisions are quite annoying. After she is saved by a student named Orion Lake, who is an enclaver from New York, she quickly decides to use him to obtain a seat in his enclave: \" I couldn't blame her, really. It wasn't stupid to want to be pals with Orion if that looked like a real possibility. Aadhya's family lives in New Jersey: if she got into the New York enclave, she could probably pull them all inside. And I couldn't afford to alienate one of the vanishing few people who are willing to deal with me. \"Throughout the story, El becomes angrier and angrier every time that Lake saves her from being killed (which ends up almost being ten times), but one such time that he isn't able to, readers finally get to see what her powers have taught her, and this is practically the only time that we do: while an attack is happening in the library, El decides to go after Lake and help him save other students, but you can easily get lost in the library due to the shelves constantly moving, or you can be eaten because of the dark areas the shelves create; this is when a giant creature appears called a maw-mouth: \"My whole body was clenched and waiting for it, and in the next flare of deep-red light I met half a dozen human eyes watching me, scattered over the thick rolling folds of the translucent, glossy mass that was just bulging its way out of the vent, many mouths open and working for air. \" El tells us that the only way to stop a maw-mouth is to give it indigestion. \"I stopped, and I used the best of the nineteen spells I know for killing an entire roomful of people, the shortest one; it's just three words in French, a la mort, but it must be cast carelessly, with a flick of the hand that most people get wrong, and if you get it even a little wrong, it kills you instead. \" She does it correctly and the maw-mouth is defeated.El believes that she saved a majority of the students from being killed by defeating the maw-mouth, but when she goes to breakfast the next morning, she finds out that a student had been 'poached' by a senior student. Every student's dorm room has a wall or spot that is nothing but a black abyss, where if anything that enters it will disappear forever. 'Poaching' is an act that has happened at the school before, and it's when a student pushes another student into the void, usually to take over their dorm room because the former's is unsafe. Oddly, this isn't surprising that it happened, when life at the school is life or death, people, especially teenagers, will make rash decisions without adults being present - - - yes, there are no teachers at this school, and everything seems to appear out of thin air.The novel finally picks up pace when the wall leading to the graduation hall, which contains two maw-mouths for the senior class, is starting to break away, threatening to release any and all creatures into the school: \"If a hole opened up to the graduation hall before the senior dorms were closed off, the seniors went from being the whole buffet to the toughest and most stale entrees on the menu. \"When the students decide to work together to patch up the hole, they soon find out that the senior students don't want it patched up: \" 'But we also don't want to let you buy your lives with ours. That's what I hear seniors saying. Not, let's rip open the school, but why don't we make you, your class, graduate with us. Your class are the ones Orion has saved the most.' Chloe flinched visibly, and a lot of the other kids at our table tensed. 'So? Are you all willing to do that, graduate early, to save the poor little freshmen? If not, you can stop ' - - - she waved a hand in a spiraling circle, making a gesture of drama - - -'about how evil we are because we don't want to die...' \"The atmosphere in the story makes the threat of death in the school very real, but Novik's main character isn't well-written; there are side characters that I found much more interesting than El, and were better written. Lake is even a better character - - - especially when readers find out why he has a need to save people - - - I honestly believe it would have been a better story from Lake's point-of-view. Also, the amount of explaining that Novik does in the novel really breaks up the flow of the story, sometimes stopping right in the middle of an important scene just to explain something about the school.I will be reading the sequel when it comes out because I do want to know what happens to a lot of the side characters and their senior graduation, but I can only recommend this book to people who love stories about witches and the occult. As for horror fans, I don't think you would get your fix from this novel.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jose",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 27, 2021",
                "reviewTitle": "A great start, and a grater tsunderere",
                "reviewText": "The main charachter is just such a lovely tsundere. The kind of girl with a resting bitch face and a death stare to make weaker boys to go running, but with a mushy lovable interior a penchant for always doing what's right, no matter the cost, and a great brave heart full of love for her friends and significant others.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "isabel Lima",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 7, 2023",
                "reviewTitle": "Bom livro",
                "reviewText": "Bom livro. Chegou rápido",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EmyEmy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 9, 2021",
                "reviewTitle": "Novo favorito",
                "reviewText": "No começo fiquei triste que paguei mais caro no livro e tinha o mesmo mais barato, porém valeu cada centavo. A história tem muitas explicações no meio pra você entender e cada reviravolta, o que vai acontecendo e como aquilo vai rolando, a atitude da Galadriel com todo mundo foi muito bem desenvolvido, eu adorei o livro e estou em choque com o final, muito ansiosa pro próximo, já reservei, com esperanças de que seja um livro bem maior pra eu demorar mais apreciando isso.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/819r5uU93GL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wilfried Tinkhauser",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 26, 2023",
                "reviewTitle": "++",
                "reviewText": "Tutto molto bene",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Literary Invertebrate",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 15, 2022",
                "reviewTitle": "I do NOT believe this book is racist.",
                "reviewText": "I'm suddenly noticing that a few people are levelling accusations of racism at this book. I don't believe these accusations are justified. IMO, all the complaints are attributable to the fact that a) El is very antisocial, meaning she struggles to connect/care about anybody, regardless of what race they are; and b) she grew up in Wales away from her Indian family. Of course she's not going to refer to them by their Indian names and think fondly of them! It's unfair to even suggest that she should. I was born in Bangladesh, but I only lived there six months before we moved to Hong Kong, and I call my grandparents/uncles/aunts by English terms, not 'nanijee' or 'khalamoni'. It makes perfect sense to me that El would do the same.Here is a rebuttal I wrote to the claims of racism.___Main review:OH MY GOD this book is bloody GENIUS.I've never been one of Novik's more rabid fans. I thought Uprooted was okay, and I actively dislike Spinning Silver. But this book blows them both of out of the water. It's smart, wicked, dark, and thrilling.Sixteen-year-old Galadriel 'El' Higgins is a sorceress. Like other magic wielders, at the age of fourteen she was bussed into the Scholomance, a magical school without any teachers or authority figures whatsoever. She hasn't left since. The only way a student leaves school is by graduating, and that involves a frantic race for life through a horde of ravening monsters. Only about half a senior class ever make it.These monsters - maleficaria, or 'mals' - are absolutely everywhere, and they love nothing better than consuming sorcerers. True, the school is infested with mals, but students still come to the Scholomance because your chances of survival are even worse if you pass through puberty on the outside. Every day, El wakes up, tries desperately to find someone who'll let her walk to breakfast or the bathroom with them, and then settles down to learning all the things you need to get out of the Scholomance alive.(In case you're wondering how this school works without teachers, Novik does a great job of explaining. Basically, you do the work, or you die).El is half Indian and half Welsh, but she doesn't fit in for more reasons than just her mixed ethnicity. She's a dark sorceress: she was born with an affinity for death and destruction magic, which she has to be very careful to keep herself from using. It would be far too easy for her to destroy the Scholomance - and everyone inside it. So, no matter how much she's ostracised for the weird vibes people get off her, and her abrasive personality, she keeps a tight lid on her self-control.Orion Lake is pretty much at the other end of the social spectrum from El. He's a wealthy New Yorker with access to almost limitless magic, and as if that wasn't bad enough, he has a hero complex. He's saved hundreds of students from mals... and she's one of them. She can't stand that. But he needs someone to save him from himself, and that someone looks like it might have to be El.I don't think there's anything about this book I didn't LOVE.✔️ El's character is perfect. She's prickly and snarky, because she's been hurt so much, but she's loyal, smart, and incredibly relatable. Her development over the course of the book - from furious loner to someone who lets Orion in, and realises that maybe she's garnering real friends too - is beautiful to behold. Oh, and also, she's hilarious.✔️ The worldbuilding is brilliant. It's clear Novik put an insane amount of thought into this series, and it really shows. I guess you might call some paragraphs infodumping, but I was so fascinated by this whole concept that I absorbed all of it greedily. Nothing seemed too much for me. I just wanted to know more about the whole world Novik has created here. The Scholomance is described exactly as I'd imagine it, and I'm so glad she's done justice to it.✔️ The romance is just right. It's barely even a romance, just the lightest touch of one, but it's set up very well for the next book. Orion is such a great character.✔️ I love the diversity. The Scholomance is very multicultural, taking in literally all the magical students from around the world. This is incorporated into the book without feeling like we're being beaten over the head with it.OverallGo read the damn book. I've been purposely vague on the plot, because this is something where you really will derive maximum enjoyment form going in blind.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}