{
    "remaining_requests": 383,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Night-Circus-Erin-Morgenstern-audiobook/dp/B005MM7F7W",
    "body": {
        "name": "The Night Circus",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Night-Circus-Erin-Morgenstern-audiobook/dp/B005MM7F7W",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51iML7T0PvL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Erin Morgenstern",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Erin+Morgenstern"
        },
        "brand": "Erin Morgenstern",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 46067,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The circus arrives without warning. No announcements precede it. It is simply there, when yesterday it was not. Within the black-and-white striped canvas tents is an utterly unique experience full of breathtaking amazements. It is called Le Cirque des Rêves, and it is only open at night.But behind the scenes, a fierce competition is underway - a duel between two young magicians, Celia and Marco, who have been trained since childhood expressly for this purpose by their mercurial instructors. Unbeknownst to them, this is a game in which only one can be left standing, and the circus is but the stage for a remarkable battle of imagination and will. Despite themselves, however, Celia and Marco tumble headfirst into love - a deep, magical love that makes the lights flicker and the room grow warm whenever they so much as brush hands.True love or not, the game must play out, and the fates of everyone involved, from the cast of extraordinary circus per­formers to the patrons, hang in the balance, suspended as precariously as the daring acrobats overhead.Written in rich, seductive prose, this spell-casting novel is a feast for the senses and the heart. Read more",
        "breadCrumbs": [
            {
                "name": "Audible Books & Originals",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_1?ie=UTF8&node=18145289011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18580606011"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18580607011"
            },
            {
                "name": "Paranormal & Urban",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18580622011"
            },
            {
                "name": "Contemporary",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=18580623011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 40 minutes"
            },
            {
                "name": "Author",
                "value": "Erin Morgenstern"
            },
            {
                "name": "Narrator",
                "value": "Jim Dale"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 13, 2011"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B005MM7F7W"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,817 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #10 in Metaphysical & Visionary Fiction (Books) #55 in Fantasy Romance (Audible Books & Originals) #96 in Literary Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MMM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI5YXEZOIFTVZRX6BMTRRPZOIHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NEJFL4H7RWGB?ASIN=B005MM7F7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars A magical tale about fighting to make a choice",
                "reviewText": "The Circus arrives without warning. I really liked this story with its imaginative flair, a flair for the wonderful and fantastical. It's a lovely fairy tale with a touch of well- placed romance but also about the fantastic in our lives. It's a well-structured meandering story, we visit the circus as events unfold in it and as it begins to unravel.It's storytelling where you are inside of things, a microcosm built of wonder and intrigue and the protagonists strive to find a way out to forge their own path, their happiness; in general to make their own choice at last. But to gain something, they must lose something else. Is the price too high? You decide.-the plot revolves around a bet, a game of wits between old adversaries who choose to imprison two young people in an impossible situation. it propels the story forward, we observe how the game affects not only the chosen ones, Marco and Ceila but others around them - I loved this-also loved how we travel with the circus in space and time , meeting ensemble cast, seeing how the lore of the circus spreads and grows, what it brings to people outside the circus-the descriptions of the circus are wonderful, you feel the sense of wonder- I love how Ceila and Marco fall in love, that was a very palpable connection between them, and I was happy they found their freedom from roles neither of them ever wanted and that freedom was in each other.-the ending brings more to the table and all in all I'd say it's a thoughtful fairy tale.Note that while Ceila, Marco and others were absolutely lovely, it's not a story you will remember for characters, but for the central idea and some considerations about storytelling and where events take the characters. The circus is central to everything, the circus is the main character as well as the field, where everything happens: the wonders, but also how those wonders affect others.The central idea was super and I loved meandering through the circus, loved observing the game and loved how the game turned into a desire to give and collaborate; that Marco and Ceila couldn't help but fall in love and that feeling helped them challenge the game and build a collaboration instead. It's a pleasant read, the game propels the plot and you are drawn into the night circus , enjoying all it has to offer, you cheer for Marco and Ceila and for the supporting characters.Ordered a physical copy and going to enjoy the love story in the night circus again. It's a good read for when you look for something magical and fairy tale like.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Evie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHROICM2XI5SHCN3N6LSWASJ5Q3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y9GDJNXGOUO0?ASIN=B005MM7F7W",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2011",
                "reviewTitle": "4.0 out of 5 stars A Lovely Debut, But Needed More Tension",
                "reviewText": "I put down Harry Potter and the Order of the Phoenix to read The Night Circus by Erin Morgenstern right away. Having both books in the forefront of my mind, the only comparison I can draw is they are both written in third person, and there's magic. Oh, and a train. So if you think you're getting a dose of dueling wizards battling it out to the death in the name of good against evil with bolts of electricity flaring from wands, you'll be sorely disappointed. The press is drawing the comparison for publicity and money. Let's all just admit that there will never be another Harry Potter, and move on to embrace the new.That's you, publishers and media!Erin Morgentstern's The Night Circus is not the traditional circus you know. It's a beautifully imagined, intricately detailed, magical place that enchants all who enter. The circus is as much a character in the story--if not more so--than all the other characters combined. I never use to understand people saying they wished they could live in a certain favorite fictional world. Until now. I would SO run away with this circus, easily donning black with a splash of scarlet to become a reveur, giving up my predictable life to follow the Night Circus to all its exotic and romantic locales: Constantinople, London, Munich, Sydney, Paris, to name a few. Morgenstern was sure to involve all the senses when describing the circus. It's such a disappointment that it isn't real.Two rival magicians--Prospero the Enchanter and a man known only as Mr A. H-- decide to throw down and have a contest to see who can produce the better student of magic. Chosen as children, Celia and Marco are kept separated, training their whole lives for the competition, but the rules are never explained.One sorta major detail left out in their education is only one can survive. (The Night Circus is as similar to The Hunger Games as fried chicken is to beignets. Just saying.) The circus venue is announced and the competition begins, although no one knows anything about it save student and mentor.There are cloud mazes in the air, a wishing tree, forests of sonnets. Practically everything is controlled by magic, but the beauty of it is it's real magic disguised to look believable. A person's grip on reality can be a fragile thing; it's best to leave others alone in their safe perceptions. Years pass as Celia and Marco keep adding more and more magical entertainment, learning to respect each other long before they meet. Once they do meet, their romance is slow to grow as both are aware it would complicate things if they collaborated on projects.I enjoyed how Morgenstern occasionally used the very rare second person POV, putting readers directly into the story, experiencing the circus for themselves:\"You feel the warmth of breath on your neck, but when you turn no one is there.\"Harry Potter feels like a wild, epic adventure whereas, to me, The Night Circus and its cast of characters is a controlled execution, proper and refined, just like the Victorians are often portrayed, and this absolutely fits the story.\"The silence that falls between them is a comfortable one. He longs to reach over and touch her, but he resists, fearful of destroying the delicate camaraderie they are building.\"Erin Morgenstern has a wild imagination, and I love her attention to detail. An example of her creativity: \"This woman's skin is shimmering and pale, her long black hair is tied with dozens of silver ribbons that fall over her shoulders. Her gown is white, covered in what to Bailey looks like looping black embroidery, but as he walks closer he sees that the black marks are actually words written across the fabric. When he is near enough to read parts of the gown, he realizes that they are love letters, inscribed in handwritten text. Words of desire and longing wrapping around her waist, flowing down the train of her gown as it spills over the platform. The statue herself is still, but her hand is held out, and only then does Bailey notice the young woman with a red scarf standing in front of her, offering the love letter-clad statue a single crimson rose. The movement is so subtle that it is almost undetectable, but slowly, very, very slowly, the statue reaches to accept the rose. Her fingers open, and the young woman with the rose waits patiently as the statue gradually closes her hand around the stem, releasing it only when it is secure. And then the young woman bows to the statue, and walks off into the crowd.\"Although I enjoyed Celia and Marco, my favorite character was Bailey (besides the circus itself). He was the only one that had any real palpable tension. I kept waiting for something to happen between Celia and Marco, but even they confess that the circus competition feels like an exhibition. Curious things happen, but rather than being hooked, I was merely nibbling at the bait. It is not until more than halfway through the book that Celia and Marco realize the consequences of losing, and this ratchets up the emotion, the tension, the suspense. The reader becomes invested.Having said that, Erin Morgenstern has still written an exquisite novel that will be treasured as creative genius. Imagining her actually making tiny models of the circus and other things--she's an artist after all--only contributes to the magic.This from USA Today:\"With a first printing of 150,000 copies, and rights sold in 30 countries, expectations are high for this first-time novel. Morgenstern says she didn't plan the book as a series, but enough questions dangle at the end to set the stage for a sequel.\"Through a short tweet session with Erin Morgenstern, she said she's not sure what they mean by \"dangling questions\" and said perhaps publishers are interested in tangential tales.This book is lovely as a stand alone. I'm not doubting that Morgenstern can pull off lavish tangential tales, but this book resonates as it is, and sometimes it's best just to say, \"That was a damn good story.\"\"He sits back in his chair and steadily returns the stare aimed at him. Taking his time as though he has all of it in the world, in the universe, from the days when tales meant more than they do now, but perhaps less than they will someday, he draws a breath that releases the tangled knot of words in his heart, and they fall from his lips effortlessly. \"The circus arrives without warning.\"",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDLMGYK3JPN3KAN3VJJYPITYEIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6CV7ESBWCFB8?ASIN=B005MM7F7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars A page turner, genuinely enjoyable read.",
                "reviewText": "So I am a huge fan of tarot cards, I liked the tarot deck this author created, it's whimsical and fanciful and mysterious in shades of black white and grey. So when I found out the creator of this deck wrote a book at the same time she was creating the deck, I had to read it. I didn't go into it with high expectations, yet felt myself drug deeper and deeper into it.The book twists, and turns, there's a surprise in the plot at every turn. It jumps around a lot, which some readers may not like but the chaotic feel just made it more enjoyable for me. You get half answers all through the book and it takes a while to put all the pieces together which kept me reading further and further until its 5 am and my eyes are bleary. The imagery the author creates with her words is fantastic. You can almost see yourself walking through the circus as an observer, smell the smells, feel the things, hear the sounds. You become invested in the characters stories even the supporting characters. There's no weepy heroine waiting for a knight in shining armor to rescue her. Filled with magic, fancy, and fantasy, this read is full of suspense that will have you on the edge of your seat.If you choose to pay admission to the book \"The Night Circus\" you will not be disappointed. It is a book I will love to revisit again in the years to come.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NatashaNatasha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 11, 2023",
                "reviewTitle": "Christmas present",
                "reviewText": "This book has been on my wish list for a while so I finally purchased it as a Christmas present for myself. Delivery was fast (as always) and I’m happy it arrived in good condition. I’m very excited to read this book!UPDATE - Review of the book itself: 5/5 stars given on Goodreads. Erin Morgenstern’s books are truly magical! She has a way of making you feel as though you are right there beside her characters. I first read The Starless Sea a couple years ago and fell completely in love with her story telling/imagination that I had to buy The Night Circus as well.. And it did not disappoint!! I will forever remain a “Rêveur”, captivated by the endless wonders of the Night Circus.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71nMbUjsy2L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pedro Souza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 4, 2023",
                "reviewTitle": "Bom livro de romance",
                "reviewText": "Não sabia que era inglês mas deu certo",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eveline Burciaga ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 5, 2023",
                "reviewTitle": "IT'S SO GOOD",
                "reviewText": "I love that there's no one main character, the circus on itself is a character, while you follow people involved with/in it, you get to know many characters and their perspective.It's written in a way that you can imagine everything and feel you're part of the world. The love story between the \"main\" characters is worthy of Aphrodite, 100%, is that love that's so strong it hurts, that's hard to keep because there are so many obstacles in the way but it's not just a love story, you still have this magic that all fantasy novels have and it's wonderful.You might get thrown off by the way you jump in the time line but it all makes sense at the end.I really enjoyed it, I picked it up after Ashley Johnson mentioned it in 4-Sided Dive and after knowing it was part of the inspiration for Candela Obscura... Let me tell you, I will never doubt Ashley's taste in books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sriram",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 23, 2024",
                "reviewTitle": "Nice read.",
                "reviewText": "A Pretty interesting and fun book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kitney",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 18, 2024",
                "reviewTitle": "Fantastic read",
                "reviewText": "This book is not your usual fantasy book. No dragons or other worlds. BUT it is a damn good read. I couldn't put it down! I only wish I could have visited the night circus. I'd have definitely worn black - with a splash of red, of course! Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}