{
    "remaining_requests": 413,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/House-Cerulean-Sea-TJ-Klune/dp/1250217318",
    "body": {
        "name": "House in the Cerulean Sea (Cerulean Chronicles, 1)",
        "price": "$10.94$10.94",
        "originalPrice": "",
        "rawPrice": 10.94,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/House-Cerulean-Sea-TJ-Klune/dp/1250217318",
        "soldBy": {
            "sellerID": "A137N5PCRAJMCA",
            "name": "Seattlegoodwill",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A137N5PCRAJMCA"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81b6ldMtxrL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "TJ Klune",
            "link": "https://www.amazon.com/TJ-Klune/e/B005LDJ9Z8/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Seattlegoodwill",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 47872,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review A NEW YORK TIMES, USA TODAY, and WASHINGTON POST BESTSELLER!A 2021 Alex Award winner!The 2021 RUSA Reading List: Fantasy Winner!An Indie Next Pick!One of Publishers Weekly's \"Most Anticipated Books of Spring 2020\"One of Book Riot’s “20 Must-Read Feel-Good Fantasies”\"I loved it. It is like being wrapped up in a big gay blanket. Simply perfect.\" ―V.E. Schwab, #1 New York Times bestselling author of The Invisible Life of Addie LaRue\"It will renew your faith in humanity.” ―Terry Brooks, New York Times bestselling author of the Shannara series“It’s a witty, wholesome fantasy that’s likely to cause heart-swelling.” ―The Washington Post“The House in The Cerulean Sea is a modern fairy tale about learning your true nature and what you love and will protect. It's a beautiful book.” ―Charlaine Harris, #1 New York Times bestselling author“1984 meets The Umbrella Academy with a pinch of Douglas Adams thrown in. Touching, tender, and truly delightful, The House in the Cerulean Sea is an utterly absorbing story of tolerance, found family, and defeating bureaucracy.”―Gail Carriger, New York Times bestselling author of Soulless“Sweet, comforting, and kind, this book is very close to perfect. The House in the Cerulean Sea is a work of classic children's literature written for adults and children alike, with the perspective and delicacy of the modern day. I cannot recommend it highly enough.” ―Seanan McGuire, New York Times bestselling author of Every Heart a Doorway“Is it possible to fall in love with someone’s imagination? If so, consider me fully smitten. TJ Klune creates worlds where fear and threat can be conquered by kindness, and a tender, queer heart is more valuable than any weapon or power.” ―David Levithan “Quirk and charm give way to a serious exploration of the dangers of complacency in this delightful, thought-provoking Orwellian fantasy from Klune.... This tale of found family is hopeful to its core. Readers will revel in Klune’s wit and ingenuity.” ―Publishers Weekly (starred review)\"Lambda Literary Award-winning author Klune (The Art of Breathing, 2019, etc.) has a knack for creating endearing characters, and readers will grow to love Arthur and the orphans alongside Linus... fans of quirky fantasy will eat it up. A breezy and fun contemporary fantasy.\" ―Kirkus“This is a sweet narrative about the value of asking questions and the benefits of giving people (especially children) a chance to be safe, protected, and themselves, regardless of what assumptions one might glean from, say, reading their case file.” ―Booklist“This inclusive fantasy is quite possibly the greatest feel-good story ever to involve the Antichrist.... The House in the Cerulean Sea will delight fans of Seanan McGuire's Wayward Children series and any reader looking for a burst of humor and hope.” ―Shelf Awareness“A beautiful little gem of both irony and, yes, kindness.” ―Fantasy & Science Fiction“TJ Klune is a master storyteller.” ―The Mary Sue\"A delightful tale about chosen families, and how to celebrate differences.\" ―Library Journal“If ever there was an author to watch out for, [Klune] is definitely that author.” ―Culturess Daily About the Author TJ KLUNE is the New York Times and USA Today bestselling, Lambda Literary Award-winning author of The House in the Cerulean Sea, Under the Whispering Door, In the Lives of Puppets, and the Green Creek Series for adults, the Extraordinaries Series for teens, and more. Being queer himself, Klune believes it's important―now more than ever―to have accurate, positive queer representation in stories."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 57 mins",
            "$3.99 delivery February 29 - March 1.",
            "Or fastest delivery February 26 - 29."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A NEW YORK TIMES, USA TODAY, and WASHINGTON POST BESTSELLER!A 2021 Alex Award winner!The 2021 RUSA Reading List: Fantasy Winner!An Indie Next Pick!One of Publishers Weekly's \"Most Anticipated Books of Spring 2020\"One of Book Riot’s “20 Must-Read Feel-Good Fantasies”Lambda Literary Award-winning author TJ Klune’s bestselling, breakout contemporary fantasy that's \"1984 meets The Umbrella Academy with a pinch of Douglas Adams thrown in.\" (Gail Carriger)A magical island. A dangerous task. A burning secret.Linus Baker leads a quiet, solitary life. At forty, he lives in a tiny house with a devious cat and his old records. As a Case Worker at the Department in Charge Of Magical Youth, he spends his days overseeing the well-being of children in government-sanctioned orphanages.When Linus is unexpectedly summoned by Extremely Upper Management he's given a curious and highly classified assignment: travel to Marsyas Island Orphanage, where six dangerous children reside: a gnome, a sprite, a wyvern, an unidentifiable green blob, a were-Pomeranian, and the Antichrist. Linus must set aside his fears and determine whether or not they’re likely to bring about the end of days.But the children aren’t the only secret the island keeps. Their caretaker is the charming and enigmatic Arthur Parnassus, who will do anything to keep his wards safe. As Arthur and Linus grow closer, long-held secrets are exposed, and Linus must make a choice: destroy a home or watch the world burn. An enchanting story, masterfully told, The House in the Cerulean Sea is about the profound experience of discovering an unlikely family in an unexpected place―and realizing that family is yours.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "LGBTQ+ Books",
                "link": "https://www.amazon.com/Gay-Lesbian-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=301889"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Gay-Lesbian-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10719"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Tor; Reprint edition (December 29, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250217318"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250217318"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL620L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.3 x 1.05 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#569 in Books (See Top 100 in Books) #11 in Humorous Fantasy (Books) #78 in Paranormal & Urban Fantasy (Books) #79 in Romantic Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 47,872 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/492ecb7b-4111-4533-be25-9743b3e00631.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4693e8c7-e242-42be-981b-33c5cadd3c1c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/14f0cb83-5f02-4a27-b688-f88d115ae56a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/10bfc71c-348c-40c1-93cc-cc06370fa2d2.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CarolDM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAIKSCOD4KCW6O2M667ABPA7AKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JY06RI71385J?ASIN=1250217318",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars A lighthearted lovely read for a tired mama.",
                "reviewText": "This is the type of book that leaves you smiling when you put it down.I have two kids, and had found myself only reading young readers or young adults books for the last 5 years as bedtime stories. By the time I was done reading to my kids, I was too tired to read a book for myself. I wanted to find something lighthearted that I could read after putting my kids to bed. I stumbled across this book, and decided to give it a try.What a lovely surprise this book was. The characters are witty, there's a morose sense of humor that I absolutely loved, and I found myself rooting for the characters. There's some foul language here and there, but it is well put within context, and I would even read this to my kids.As someone who also grew up bouncing around from home to home, this story really emphasis the beautiful nature of finding your own type of family where others may least expect it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jordan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFNMVYEOVQORABXEV6DLX7UDU5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22M409AIHYJFT?ASIN=1250217318",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2020",
                "reviewTitle": "5.0 out of 5 stars Beautiful, compelling, and perfect--this book is one of my new favorites!",
                "reviewText": "I absolutely adored this book!The first and most important thing about this book are the characters. I genuinely loved and cared about each and every one of these characters (and I sort of feel so protective of them that I swear I would die for any one of them). Linus Baker, our protagonist, is living a quiet life working for the Department in Charge of Magical Youth (DICOMY) as a Case Worker. He seems to mostly enjoy his job, but it's clear to readers that despite whatever Linus chooses to tell himself about his life, he isn't really living and to say he's 'happy' seems a stretch. Linus is one of those characters that you sort of just want to hug (although you probably wouldn't because he doesn't seem like the type to enjoy hugs from random people) and watching him embark on an experience unlike any he's ever been on, where he learns new things about himself and the world around him, was remarkable. I was so drawn to Linus' character and found that so many of the things he struggled with were applicable to my own--such as realizing that sometimes 'good enough' isn't really enough--and I couldn't have asked for a more wonderful character to follow. He isn't the most enthusiastic sort of person, but he has this fantastic dry wit for his sense of humor that I couldn't get enough of.In addition to Linus is the rest of our phenomenal cast of characters: there's Arthur Parnassus, the man in charge of the orphanage Linus visits; the magical youth living at the orphanage: Chauncey, Lucy, Sal, Talia, Phee, and Theodore; the resident island sprite, Zoe; and, of course, we can't forget Linus' cat, Calliope. I fell so hard for all of these characters and sincerely loved all of them. Each one was so carefully crafted with such distinct and wide-ranging personalities--it's rare to see such amazing characterization that holds strong and true for each and every character, but I can tell that characters must be Klune's strong point because they were all so well-written. I would try to pinpoint one of my favorites, but honestly, I think they are all my favorites. Linus' cat, Calliope, truly steals every scene she's in, though. Altogether, each and every one of these extremely varied and rather odd characters makes up the most perfect mismatched family and I have never want to be a part of a family as much as I wanted to be a part of this one!Klune also appears to be a master at writing dialogue, and the banter among all of the youth easily became of the most enjoyable parts of this book. I laughed out loud so many times while reading this book and I felt so fulfilled and happy every time I picked it up and put it down. The way that he captures what it's like for an adult like Linus to be interacting with such a wild and unpredictable group of magical youth was a true delight. Additionally, the more serious dialogue that occurred for more serious and difficult topics was also carefully done and felt both authentic and full of impact. Klune is really good at maneuvering within a huge variety of topics in such a deft way that never makes it feel difficult to get through or understand.I don't want to spoil anything specific about the plot, but I can tell you that one of the reasons that I think I liked this so much is because of it's sort of 'slice-of-life' feel, where there aren't really intense action-packed scenes or anything, but rather it is following Linus as he observes and tries to understand how things at Mr. Parnassus' orphanage work and about the youth that live there. The pacing was perfect for me and was what I would call very steady--not too slow, but not too fast, either, just very continuously moving forward while still taking the time to focus on certain topics and scenes whenever necessary. There is also a tiny bit of romance in this book and it is so beautiful and innocent and truly made my cold black heart just melt. It doesn't take over the story, but it fits in like the perfect final piece of a puzzle--small, but vital to the completion of the entire puzzle.This story handles some extremely heavy but very important topics and I think Klune weaved all of those elements into the story so smoothly so that they never felt overwhelming, but they were very clear and easily understood. Honestly, this book is just beautiful. I laughed and teared up (for both happy and sad reasons) and I also found myself subconsciously reading this book so slooowly because I don't think I ever wanted to finish. It was hard for me to move on from this book and get my headspace ready for another book after because it just made me feel so good to read this book. It spoke to me not only from a personally relevant standpoint, but because it's such a wonderful story of love, acceptance, and what it means to be a family.This is easily going to be a book that I re-read and re-read over and and over, especially when I'm struggling a lot with depression or anxiety because it made me feel so at home and content and happy. I really can't recommend this story enough--it's bittersweet at times, but also hilarious, relevant, and full of life and love and family.",
                "reviewVotes": "46 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cecelia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7YSWPOTAG5DUVPGLHWXNZRB4VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1U6USPPENUZZM?ASIN=1250217318",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 28, 2021",
                "reviewTitle": "4.0 out of 5 stars As promised: a cozy, quiet read with magic!",
                "reviewText": "This reading adventure began, as many do, with recommendations. The startling thing is that I followed through and read the book at all. In my life as an English teacher, I’ve learned that books are many, time is short, and during the school year I will get no reading done (unless forced). TJ Klune’s The House in the Cerulean Sea started popping up all over the place on Instagram first – and not just around its release date, but a swell of love and support over many months. That was fine, and I noticed it, but it didn’t prompt me to take action. Then I showed up to my book club’s Zoom meeting a couple of months ago and it was personally recommended by long-time reading friends. Their arguments were persuasive – I purchased the book then and there! And only 2ish months later, I read it all in one day. The House in the Cerulean Sea delivered on its promised cozy vibes, and reading it was a nice way to slide into summer mode.The House in the Cerulean Sea is the story of Linus Baker, a government worker in a fictional (and nominally magical) world who is desperately lonely, but keeps himself too busy fulfilling his job according to the draconian Rules and Regulations to think very deeply about his dissatisfaction with his life. The only bits of happiness he has are the sunflowers in his garden, his cat Calliope, and his record collection. Linus’ internal monologue is immediately hilarious, but his life overall is sad and dreary. This metaphor is extended even further in tragicomic fashion: Linus constantly misses the bus (or it is late), forgets his umbrella on rainy days, and engages in light self-hatred (about his weight), along with holding a seeming life-long goal of blending in with the wall paint. Luckily, the business of the book is to make him happy. Author Klune accomplishes this by delving into the fantasy portion of the novel, when Linus must make an unusual casework visit to a whimsical island and observe the family who live there. Over the course of his visit, Linus (or Mr. Baker, as he goes by at the orphanage he is “investigating”) slowly develops his capacity for happiness, and by the end of the book all’s well that ends well.What I knew going into reading the book: magical house/school, cozy vibes, quiet read, LGBTQ+ characters. What I got in the first several chapters: an absolutely miserable main character in an awful desk job that gave me flashbacks to some of my own worst working experiences. Let’s just say there was some whiplash between expectations and reality. I almost put the book down about 5 times in the first 5 chapters. I kept going because of the promised payoff from the recommendations of others. So, with that off my chest, I can say… this book IS lovely in many ways, as is Linus, but they both require a bit of patience from the reader to uncover their strengths and treasures.Author Klune’s task in this novel is a complex and delicate one: to start with a character that the reader can immediately identify as unhappy, unambitious, and with low self-esteem, and expose them to a combination of plot and character elements that will thoroughly change their outlook on life, actions, and future, all without seeming “out of character.” It is a masterful character study, but it doesn’t feel contrived – it instead is a story suffused with homey, magical details, and I think that is why it is so beloved.So, that’s the book. I think it was successful on its own merits, and a feat of engineering! And obviously, cozy vibes and quiet reads are nothing to shake a stick at. BUT DID I ENJOY IT??? That is a tough question, and one I’ve been asking myself over and over again in the last 12 hours or so since I finished the book. And I think the answer is, to use one of my favorite words, complex. On one hand: yes. I can appreciate the underpinnings that make this book art, and I appreciate the aura of it all, and of course I love magical stories. But one thing about being in the head of a character with such low self-esteem, and such a dreary outlook on life, is that is hard not to get trapped in the emotional transference. Other people in the book kept telling Linus he was worthy and delightful, and yet… on his side, he couldn’t see it. And thus, in a way, the reader (or at least THIS reader) couldn’t see it. As I said, complex. I feel satisfied that I didn’t waste my time reading the book, but it’s not a favorite, or even a “keep it on my shelf” book. It’ll go live instead in my classroom library at school!I do appreciate LGBTQ+ characters getting to live everyday lives, and being the centers of cozy books. I also appreciated that, while the book is marketed to adults, it will be very popular with younger readers and those who read YA and crossover titles. Because of the novel’s focus on children’s lives and children’s well-being through Linus’ line of work, the feel is quite innocent and light, even when it deals with heavier themes like prejudice and child abuse.In all, a perfectly satisfactory summer read, and one for when you need a dash of whimsy and warmth in your life.Recommended for: fans of Katherine Addison’s books (especially The Angel of the Crows, which I read and also enjoyed in a complex way last summer), those who enjoy quiet fantasy with hints of Diana Wynne Jones and/or Robin McKinley, and anyone who wants to see more LGBTQ+ representation in science fiction and fantasy!",
                "reviewVotes": "127 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marian L. Murdoch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2K2XMDHN432J24D2JJHVVXBHHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VCS20EMJSMW4?ASIN=1250217318",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars My best read of 2023",
                "reviewText": "This book was my favorite book of 2023. When I read the blurb about how this is about a home for children with special powers, I rolled my eyes. However, that is NOT even close to an apt description. The lead character is not one of the powerful kids, but an older man, rare in fantasy books, and his journey of self discovery just warmed my heart. The infrequent LGBTQ+ scenes were not forced and felt natural. The characterizations of the various children were well-written and I felt sympathy for all of them. This story is cozy, adorable, and has a wonderful message about overcoming differences and I would recommend it to anyone, it's that good. A couple of scenes were a little heavy handed, but the rest of the novel makes up for it in spades.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiago Kietzmann",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 3, 2024",
                "reviewTitle": "It's a delightful book!",
                "reviewText": "It's a delightful book! There are so many good things about it that it's hard to know where to begin. This isn't an action-packed fantasy book, and it doesn't aim to be one. It's a fantasy story about a lonely bureaucrat from a children's protection department (well, magical children) who goes to investigate an orphanage and discovers much more than just an orphanage.The environment is endearing, the characters are nicely described, and the story flows smoothly with good pacing and wonderful writing. I loved Linus and how he is totally believable—he's forty, overweight, and struggles with normal human challenges. The way he grows during his journey is definitely captivating.And his relationship with Arthur is great! No instant love and no overly sensualization. Just two people getting to know each other and building a meaningful connection.PROS:Great world-building, nice plot, and storyline.Well-built and consistent characters.Sweetheart vibes without being overly saccharine.Beautiful gay romance between two mature men.CONS:Sometimes, it veers towards something a little bit naive and juvenile. But I'm just saying that to include something in the \"CONS.\"All in all, it's a very, very nice read for those looking for a good, sweet gay fantasy story. I loved reading it and totally recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maribel Martinez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 12, 2023",
                "reviewTitle": "Misterio",
                "reviewText": "Libro recomendado para adolecentes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brandi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 7, 2021",
                "reviewTitle": "I fell head over heels in love with this book.",
                "reviewText": "The House in The Cerulean Sea by TJ Klune introduces us to Linus Baker, a forty-year-old man who lives a quiet, solitary life in a tiny house with a devious cat and old records he enjoys sitting and listening to. He works for the Department in Charge Of Magical Youth, and is given a highly classified assignment by Extremely Upper Management (who are as stiff and stuffy as they sound).As a Case Worker, Linus is sent to the Marsyas Island Orphanage, and has to set aside his fears to determine whether or not the Orphanage should remain open.It’s at this Island Orphanage that we meet the rest of our cast in the form of six magical children (a gnome, a sprite, a wyvern, an unidentifiable green blob, a were-Pomeranian, and the Antichrist), the charming (and handsome) caretaker Arthur Parnassus, and a lovely lady named Zoe Chapelwhite who is more than she initially appears.As weeks go by with Linus living (and loving) on the Island and getting to know the inhabitants better than he ever could have imagined, he finds himself facing a life-changing decision that will change more than just HIS life.After I got through the first three chapters—which were a necessary drag of world-building and plot setup that I honestly found boring but were Very Important overall—I fell head over heels in love with this book.Honestly, I don’t even know how to put my Thoughts and Feelings into words that make sense. I enjoyed this book in a bone-deep, forever-favourite type of way. I fell in love the way you fall asleep: slowly, and then all at once—and thank you, John Green, for some words that aptly describe how I feel about this book.While the first few chapters were slow-going, I was hooked from chapter four until the incredible end.Our main character, Linus, is written so vibrantly for such a dull man. He jumps off the page, and his voice is so strong. It’s a lovely lens to tell the story through, and I am so glad that Klune decided to tell it this way. From the start, Linus is a character that drew me in, even as I slogged through his world. He sees the world in such black and white lines, and he lives a drab, colourless life.He believes everything he’s always been told, and he doesn’t know anything else.That makes his arrival on Marsyas Island all the better, especially when we’re introduced to a bright, colourful cast of lively, eccentric, and loveable characters.Arthur is a joy. Prim and proper, kind and handsome, he’s swathed in an air of mystery from the start. Klune leads a trail of breadcrumbs throughout the novel that hints at something more that we aren’t privy to until the story catapults towards its climax (and what that is is something I had NOT seen coming).Arthur is a man filled with love, care and protection. While he’s been assigned as the caretaker of this Orphanage, it’s very clear that he’s stepped into a larger role in the children’s life. As we fall in love with Arthur alongside a bumbling, oblivious Linus, Arthur’s gentle, paternal nature just gets more and more clear (and, at a time, threaded through with a passionate surge of protectiveness that made me (and Linus) a little hot under the collar).The children themselves are absolutely lovely, and the individual relationships they all have with one another are so sweetly written. It’s abundantly clear, from the very first few scenes after Linus arrives at the Island, that this is a family.That’s important later on, too.I have a particular fondness for both Sal and Lucy, two of the children that have wormed their way into my heart and stuck with me for weeks after I finished this novel. Sal, the oldest, is a quiet, reserved, and shy boy who’s seen and experienced more evils than any kid of his age should and still holds out hope for better. Then there is Lucy, the youngest of the six kids, who is outspoken, brazen, and full of life while being all too aware of the way the world hates him and not caring at all since, really, it isn’t his problem that humans might fear him.All in all, I love this book. I laughed and cheered and sobbed.And when I say I sobbed? I mean I SOBBED reading this book. More than once. It sucker-punched me in the found family feels, it carried me along with a slow, gentle romance, and it breathed life into my heart with the protective love the book is steeped with. The House in The Cerulean Sea is now, and forever will be, a comfort book.I want to have things to critique, but I honestly… don’t. Beyond the fact that I would have enjoyed a little more on-screen romance (which is truly just a personal preference), this book filled my heart and fed my soul and made me feel so FULL of love and safety and hope.Now, do I recommend this book? Yes, wholeheartedly, but with conditions. This is an amazing YA fantasy focused around found family with a heavy central theme of kindness, and if that sounds like something you would enjoy, I think you'll love this book.Before you pick this book up and give it a read, however, I would suggest you read up on where Klune got his inspiration for this book, as there have recently been some (rightful) calls for accountability from the bookish community.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicolas Koy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 14, 2023",
                "reviewTitle": "A beautiful story about kindness and family",
                "reviewText": "It unexpectedly pulls on your heartstrings and doesn't let go.Many tears were shed. My heart kindled with hope. The blood in my veins boiled. Uncontrollable bursts of laughter. So many emotions packed within its pages.This is the most heart-warming book I've ever read. No, the greatest heart-warming, most delightful and brilliant piece of storytelling ever told across all formats.This story is about hopes and dreams. It's about prejudice and hatred. It's about celebrating our differences. Above all, it's about kindness and family.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MikukiMikuki",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 16, 2023",
                "reviewTitle": "PRECIOSO❤️",
                "reviewText": "El libro llego muy rápido y en perfecto. El servicio de entrega de Amazon es, casi siempre, excepcional. La historia es preciosa y resulta amena y fácil de leer. Este ha sido mi primer libro de TJ Klune y es un autor 100% recomendable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71dgQXMTP5L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}