{
    "remaining_requests": 407,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Midnight-Library-Novel-Matt-Haig/dp/0525559493",
    "body": {
        "name": "The Midnight Library: A GMA Book Club Pick (A Novel)",
        "price": "$13.48$13.48",
        "originalPrice": "",
        "rawPrice": 13.48,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Midnight-Library-Novel-Matt-Haig/dp/0525559493",
        "soldBy": {
            "sellerID": "A1N6INQ4SRJFXQ",
            "name": "Goodwill Michiana",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1N6INQ4SRJFXQ"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71rFBHcbWcL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Matt Haig",
            "link": "https://www.amazon.com/Matt-Haig/e/B001IO8C1Q/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Goodwill Michiana",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 243967,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review An instant New York Times bestsellerWinner of the Goodreads Choice Award for FictionA GOOD MORNING AMERICA Book Club Pick!One of the LibraryReads 2020 Voter FavoritesIndependent (London) One of Ten Best Books of the YearIncluded in best-of-year and year-end roundups by The Washington Post, Christian Science Monitor, New York Public Library, Amazon, Boston Globe, PureWow, St. Louis Public Radio, She Reads, Lit Hub, The Mary Sue, and more“Whimsical.” —Washington Post, named one of the 15 Feel-Good Books Guaranteed to Lift Your Spirits\"An absorbing but comfortable read...a vision of limitless possibility, of new roads taken, of new lives lived, of a whole different world available to us somehow, somewhere, might be exactly what’s wanted in these troubled and troubling times.” —The New York Times“Charming...a celebration of the ordinary: ordinary revelations, ordinary people, and the infinity of worlds seeded in ordinary choices.” —The Guardian“A brilliant premise and great fun.” —Daily Mail\"This book really makes you think all about our choices in life and that big question of “Where would I be if I had made a different choice?” It’s a book that definitely made me self-reflect.\" -- Millie Bobbie Brown actor and author of Nineteen Steps\"I can't describe how much his work means to me. So necessary...[Matt Haig is] the king of empathy.\" —Jameela Jamil, actor and host of I Weigh with Jameela Jamil“A beautiful fable, an It’s a Wonderful Life for the modern age – impossibly timely when we are all stuck in a world we wish could be different.” —Jodi Picoult, author of My Sister's Keeper“This brainy, captivating pleasure read feels like what you might get if TV’s The Good Place collided with Where’d You Go, Bernadette.” —People“Thanks to the storytelling chops of writer Matt Haig, The Midnight Library is an engaging read, full of gentle insights and soothing wisdom… This is a book about shedding regret by gaining perspective. It’s full of quirky plot lines, with glimpses of opportunities and potential in unexpected places and people.” —Psychology Today“A charming book.” —Dolly Parton, award-winning singer-songwriter“Although I don’t read fiction as much as I used to—because I’m always writing fiction—during these sad and difficult days in 2020 I broke that rule because I needed to ­escape into other people’s fictional worlds. One of my favorite books of the year was \"The Midnight Library\" by Matt Haig, a powerful and uplifting story about regrets and the choices we make.”—Alice Hoffman, author of Magic Lessons and Practical Magic “Clever, emotional and thought-inspiring.” —Jenny Colgan, author of The Bookshop on the Corner “Amazing and utterly beautiful, The Midnight Library is everything you'd expect from the genius storyteller who is Matt Haig.” —Joanna Cannon, author of The Trouble with Goats and Sheep “Nora’s life is burdened by regrets. Then she stumbles on a library with books that enable her to test out the lives she could have led, including as a glaciologist, Olympic swimmer, rock star, and more. Her discoveries ultimately prove life-affirming in Matt Haig’s dazzling fantasy.” —Christian Science Monitor“Would we really make better choices if we could step back in time? Matt Haig’s thought-provoking, uplifting new book, The Midnight Library discusses just that, exploring our relationship with regret and what really makes a perfect life.” —Harper's Bazaar (UK)“British author Matt Haig is beloved in his home country, and he’s a champion of mental health, which makes him a great person to follow on Twitter. He’s best known for the novel How to Stop Time, but he has a new novel just out on September 29 called The Midnight Library, which sounds equally intriguing. In this library, Nora Seed finds endless books which contain different versions of the life she could have lived. This is a must-read for those of us given to endless what ifs.” —BookRiot“Haig is one of the most inspirational popular writers on mental health of our age and, in his latest novel, he has taken a clever, engaging concept and created a heart-warming story that offers wisdom in the same deceptively simple way as Mitch Albom's best tales.” —Independent (UK) \"Just beautiful . . . Such a gorgeous, gorgeous book.” —Fearne Cotton, host of the BBC Radio 1 Chart Show \"A highly original, thought-provoking novel...\" -- Independent (London)\"[The Midnight Library] will follow in the bestselling footsteps of Haig’s earlier books . . . Part Sliding Doors, part-philosophical quest, this is a moving novel with a powerful mental health message at its heart.” —Alice O’Keeffe, The Bookseller “Haig’s latest (after the nonfiction collection Notes on a Nervous Planet, 2019) is a stunning contemporary story that explores the choices that make up a life, and the regrets that can stifle it. A compelling novel that will resonate with readers.” —Booklist (starred review)“Charming...[Matt Haig] will reward readers who take this book off the shelf.” —Publisher's Weekly About the Author Matt Haig is the author of the instant New York Times Bestseller The Comfort Book; two memoirs, Notes on a Nervous Planet and the internationally bestselling Reasons to Stay Alive; along with six novels, including How to Stop Time, and several award-winning children’s books. The Midnight Library, a number one New York Times Bestseller, is his latest novel and has sold more than six million copies world-wide. His work has been translated into more than forty languages. Excerpt. © Reprinted by permission. All rights reserved. A Conversation About Rain Nineteen years before she decided to die, Nora Seed sat in the warmth of the small library at Hazeldene School in the town of Bedford. She sat at a low table staring at a chess board. 'Nora dear, it's natural to worry about your future,' said the librarian, Mrs Elm, her eyes twinkling. Mrs Elm made her first move. A knight hopping over the neat row of white pawns. 'Of course, you're going to be worried about the exams. But you could be anything you want to be, Nora. Think of all that possibility. It's exciting.' 'Yes. I suppose it is.' 'A whole life in front of you.' 'A whole life.' 'You could do anything, live anywhere. Somewhere a bit less cold and wet.' Nora pushed a pawn forward two spaces. It was hard not to compare Mrs Elm to her mother, who treated Nora like a mistake in need of correction. For instance, when she was a baby her mother had been so worried Nora's left ear stuck out more than her right that she'd used sticky tape to address the situation, then disguised it beneath a woollen bonnet. 'I hate the cold and wet,' added Mrs Elm, for emphasis. Mrs Elm had short grey hair and a kind and mildly crinkled oval face sitting pale above her turtle-green polo neck. She was quite old. But she was also the person most on Nora's wavelength in the entire school, and even on days when it wasn't raining she would spend her afternoon break in the small library. 'Coldness and wetness don't always go together,' Nora told her. 'Antarctica is the driest continent on Earth. Technically, it's a desert.' 'Well, that sounds up your street.' 'I don't think it's far enough away.' 'Well, maybe you should be an astronaut. Travel the galaxy.' Nora smiled. 'The rain is even worse on other planets.' 'Worse than Bedfordshire?' 'On Venus it is pure acid.' Mrs Elm pulled a paper tissue from her sleeve and delicately blew her nose. 'See? With a brain like yours you can do anything.' A blond boy Nora recognised from a couple of years below her ran past outside the rain-speckled window. Either chasing someone or being chased. Since her brother had left, she'd felt a bit unguarded out there. The library was a little shelter of civilisation. 'Dad thinks I've thrown everything away. Now I've stopped swimming.' 'Well, far be it from me to say, but there is more to this world than swimming really fast. There are many different possible lives ahead of you. Like I said last week, you could be a glaciologist. I've been researching and the-' And it was then that the phone rang. 'One minute,' said Mrs Elm, softly. 'I'd better get that.' A moment later, Nora watched Mrs Elm on the phone. 'Yes. She's here now.' The librarian's face fell in shock. She turned away from Nora, but her words were audible across the hushed room: 'Oh no. No. Oh my God. Of course . . .' Nineteen Years LaterThe Man at the Door Twenty-seven hours before she decided to die, Nora Seed sat on her dilapidated sofa scrolling through other people's happy lives, waiting for something to happen. And then, out of nowhere, something actually did. Someone, for whatever peculiar reason, rang her doorbell. She wondered for a moment if she shouldn't get the door at all. She was, after all, already in her night clothes even though it was only nine p.m. She felt self-conscious about her over-sized ECO WORRIER T-shirt and her tartan pyjama bottoms. She put on her slippers, to be slightly more civilised, and discovered that the person at the door was a man, and one she recognised. He was tall and gangly and boyish, with a kind face, but his eyes were sharp and bright, like they could see through things. It was good to see him, if a little surprising, especially as he was wearing sports gear and he looked hot and sweaty despite the cold, rainy weather. The juxtaposition between them made her feel even more slovenly than she had done five seconds earlier. But she'd been feeling lonely. And though she'd studied enough existential philosophy to believe loneliness was a fundamental part of being a human in an essentially meaningless universe, it was good to see him. 'Ash,' she said, smiling. 'It's Ash, isn't it?' 'Yes. It is.' 'What are you doing here? It's good to see you.' A few weeks ago she'd been sat playing her electric piano and he'd run down Bancroft Avenue and had seen her in the window here at 33A and given her a little wave. He had once - years ago - asked her out for a coffee. Maybe he was about to do that again. 'It's good to see you too,' he said, but his tense forehead didn't show it. When she'd spoken to him in the shop, he'd always sounded breezy, but now his voice contained something heavy. He scratched his brow. Made another sound but didn't quite manage a full word. 'You running?' A pointless question. He was clearly out for a run. But he seemed relieved, momentarily, to have something trivial to say. 'Yeah. I'm doing the Bedford Half. It's this Sunday.' 'Oh right. Great. I was thinking of doing a half-marathon and then I remembered I hate running.' This had sounded funnier in her head than it did as actual words being vocalised out of her mouth. She didn't even hate running. But still, she was perturbed to see the seriousness of his expression. The silence went beyond awkward into something else. 'You told me you had a cat,' he said eventually. 'Yes. I have a cat.' 'I remembered his name. Voltaire. A ginger tabby?' 'Yeah. I call him Volts. He finds Voltaire a bit pretentious. It turns out he's not massively into eighteenth-century French philosophy and literature. He's quite down-to-earth. You know. For a cat.' Ash looked down at her slippers. 'I'm afraid I think he's dead.' 'What?' 'He's lying very still by the side of the road. I saw the name on the collar, I think a car might have hit him. I'm sorry, Nora.' She was so scared of her sudden switch in emotions right then that she kept smiling, as if the smile could keep her in the world she had just been in, the one where Volts was alive and where this man she'd sold guitar songbooks to had rung her doorbell for another reason. Ash, she remembered, was a surgeon. Not a veterinary one, a general human one. If he said something was dead it was, in all probability, dead. 'I'm so sorry.' Nora had a familiar sense of grief. Only the sertraline stopped her crying. 'Oh God.' She stepped out onto the wet cracked paving slabs of Bancroft Avenue, hardly breathing, and saw the poor ginger-furred creature lying on the rain-glossed tarmac beside the kerb. His head grazed the side of the pavement and his legs were back as if in mid-gallop, chasing some imaginary bird. 'Oh Volts. Oh no. Oh God.' She knew she should be experiencing pity and despair for her feline friend - and she was - but she had to acknowledge something else. As she stared at Voltaire's still and peaceful expression - that total absence of pain - there was an inescapable feeling brewing in the darkness. Envy. String Theory Nine and a half hours before she decided to die, Nora arrived late for her afternoon shift at String Theory. 'I'm sorry,' she told Neil, in the scruffy little windowless box of an office. 'My cat died. Last night. And I had to bury him. Well, someone helped me bury him. But then I was left alone in my flat and I couldn't sleep and forgot to set the alarm and didn't wake up till midday and then had to rush.' This was all true, and she imagined her appearance - including make-up-free face, loose makeshift ponytail and the same second-hand green corduroy pinafore dress she had worn to work all week, garnished with a general air of tired despair - would back her up. Neil looked up from his computer and leaned back in his chair. He joined his hands together and made a steeple of his index fingers, which he placed under his chin, as if he was Confucius contemplating a deep philosophical truth about the universe rather than the boss of a musical equipment shop dealing with a late employee. There was a massive Fleetwood Mac poster on the wall behind him, the top right corner of which had come unstuck and flopped down like a puppy's ear. 'Listen, Nora, I like you.' Neil was harmless. A fifty-something guitar aficionado who liked cracking bad jokes and playing passable old Dylan covers live in the store. 'And I know you've got mental-health stuff.' 'Everyone's got mental-health stuff.' 'You know what I mean.' 'I'm feeling much better, generally,' she lied. 'It's not clinical. The doctor says it's situational depression. It's just that I keep on having new . . . situations. But I haven't taken a day off sick for it all. Apart from when my mum . . . Yeah. Apart from that.' Neil sighed. When he did so he made a whistling sound out of his nose. An ominous B flat. 'Nora, how long have you worked here?' 'Twelve years and . . .' - she knew this too well - '. . . eleven months and three days. On and off.' 'That's a long time. I feel like you are made for better things. You're in your late thirties.' 'I'm thirty-five.' 'You've got so much going for you. You teach people piano . . .' 'One person.' He brushed a crumb off his sweater. 'Did you picture yourself stuck in your hometown working in a shop? You know, when you were fourteen? What did you picture yourself as?' 'At fourteen? A swimmer.' She'd been the fastest fourteen-year-old girl in the country at breaststroke and second-fastest at freestyle. She remembered standing on a podium at the National Swimming Championships. 'So, what happened?' She gave the short version. 'It was a lot of pressure.' 'Pressure makes us, though. You start off as coal and the pressure makes you a diamond.' She didn't correct his knowledge of diamonds. She didn't tell him that while coal and diamonds are both carbon, coal is too impure to be able, under whatever pressure, to become a diamond. According to science, you start off as coal and you end up as coal. Maybe that was the real-life lesson. She smoothed a stray strand of her coal-black hair up towards her ponytail. 'What are you saying, Neil?' 'It's never too late to pursue a dream.' 'Pretty sure it's too late to pursue that one.' 'You're a very well qualified person, Nora. Degree in Philosophy . . .' Nora stared down at the small mole on her left hand. That mole had been through everything she'd been through. And it just stayed there, not caring. Just being a mole. 'Not a massive demand for philosophers in Bedford, if I'm honest, Neil.' 'You went to uni, had a year in London, then came back.' 'I didn't have much of a choice.' Nora didn't want a conversation about her dead mum. Or even Dan. Because Neil had found Nora's backing out of a wedding with two days' notice the most fascinating love story since Kurt and Courtney. 'We all have choices, Nora. There's such a thing as free will.' 'Well, not if you subscribe to a deterministic view of the universe.' 'But why here?' 'It was either here or the Animal Rescue Centre. This paid better. Plus, you know, music.' 'You were in a band. With your brother.' 'I was. The Labyrinths. We weren't really going anywhere.' 'Your brother tells a different story.' This took Nora by surprise. 'Joe? How do you-' 'He bought an amp. Marshall DSL40.' 'When?' 'Friday.' 'He was in Bedford?' 'Unless it was a hologram. Like Tupac.' He was probably visiting Ravi, Nora thought. Ravi was her brother's best friend. While Joe had given up the guitar and moved to London, for a crap IT job he hated, Ravi had stuck to Bedford. He played in a covers band now, called Slaughterhouse Four, doing pub gigs around town. 'Right. That's interesting.' Nora was pretty certain her brother knew Friday was her day off. The fact prodded her from inside. 'I'm happy here.' 'Except you aren't.' He was right. A soul-sickness festered within her. Her mind was throwing itself up. She widened her smile. 'I mean, I am happy with the job. Happy as in, you know, satisfied. Neil, I need this job.' 'You are a good person. You worry about the world. The homeless, the environment.' 'I need a job.' He was back in his Confucius pose. 'You need freedom.' 'I don't want freedom.' 'This isn't a non-profit organisation. Though I have to say it is rapidly becoming one.' 'Look, Neil, is this about what I said the other week? About you needing to modernise things? I've got some ideas of how to get younger peo-' 'No,' he said, defensively. 'This place used to just be guitars. String Theory, get it? I diversified. Made this work. It's just that when times are tough I can't pay you to put off customers with your face looking like a wet weekend.' 'What?' 'I'm afraid, Nora' - he paused for a moment, about the time it takes to lift an axe into the air - 'I'm going to have to let you go.' To Live Is to Suffer Nine hours before she decided to die, Nora wandered around Bedford aimlessly. The town was a conveyor belt of despair. The pebble-dashed sports centre where her dead dad once watched her swim lengths of the pool, the Mexican restaurant where she'd taken Dan for fajitas, the hospital where her mum had her treatment. Dan had texted her yesterday. Nora, I miss your voice. Can we talk? D x She'd said she was stupidly hectic (big lol). Yet it was impossible to text anything else. Not because she didn't still feel for him, but because she did. And couldn't risk hurting him again. She'd ruined his life. My life is chaos, he'd told her, via drunk texts, shortly after the would-be wedding she'd pulled out of two days before. The universe tended towards chaos and entropy. That was basic thermodynamics. Maybe it was basic existence too. You lose your job, then more shit happens. The wind whispered through the trees. It began to rain. She headed towards the shelter of a newsagent's, with the deep - and, as it happened, correct - sense that things were about to get worse. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 12 hrs 56 mins",
            "$3.99 delivery Tuesday, February 27.",
            "Or fastest delivery February 22 - 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The #1 New York Times bestselling WORLDWIDE phenomenon Winner of the Goodreads Choice Award for Fiction | A Good Morning America Book Club Pick | Independent (London) Ten Best Books of the Year \"A feel-good book guaranteed to lift your spirits.\"—The Washington Post The dazzling reader-favorite about the choices that go into a life well lived, from the acclaimed author of How To Stop Time and The Comfort Book. Somewhere out beyond the edge of the universe there is a library that contains an infinite number of books, each one the story of another reality. One tells the story of your life as it is, along with another book for the other life you could have lived if you had made a different choice at any point in your life. While we all wonder how our lives might have been, what if you had the chance to go to the library and see for yourself? Would any of these other lives truly be better?In The Midnight Library, Matt Haig's enchanting blockbuster novel, Nora Seed finds herself faced with this decision. Faced with the possibility of changing her life for a new one, following a different career, undoing old breakups, realizing her dreams of becoming a glaciologist; she must search within herself as she travels through the Midnight Library to decide what is truly fulfilling in life, and what makes it worth living in the first place. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Books (May 9, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0525559493"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0525559498"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.1 x 0.81 x 7.7 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#169 in Books (See Top 100 in Books) #1 in Time Travel Fiction #38 in Literary Fiction (Books) #135 in Genre Literature & Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 243,967 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/10b94db9-4c6e-4459-b6d9-186a23d92b40.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29bfdd17-6a51-407c-8fc8-8156d96b408e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b09d734e-fae8-45a8-8a2d-6043db6a1d75.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/130cd29b-8dff-4654-9245-32d902ef8067.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a376615-92f6-40dc-8120-e929d7d41ef8.__CR0,0,1080,1080_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "imaloserdude",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZHTZOTXW5PWEANG7P6GS2O62WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PWQ1QL5YX23B?ASIN=0525559493",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2021",
                "reviewTitle": "5.0 out of 5 stars Full of philosophical aphorisms & lots of Easter eggs & ideas about happiness and choices and life",
                "reviewText": "So many options can be pursued when evaluating a book. Did the author create believable and consistent characters? Did the author manufacture vivid scenes and detailed locations? Did the author include Easter eggs for the reader to find, anagrams of names (like in the Series of Unfortunate Events) or a play on words or an alliteration or metaphors or similes or puns? Did the author include references to real world events or people or places that the reader can connect to? Did the author explore a familiar concept in a new way? Did the author give the characters words to say that connect with the reader and their view of life? Did the author overuse actual dialogue or internal monologue to explain the story instead of relying upon actual action.There are so many options for the reviewer, just as there are so many options for the main character in this book. Nora Seed finds herself in a library at the stroke of midnight, with lots of books around her and a librarian from her childhood, Mrs. Elm. Each book represents a different version of Nora’s life, a life of joys and sorrows, people and places, events and tragedies that spawned from a single choice, a decision, or in the case of this girl so full of regrets, something that didn’t happen because she didn’t make that choice.Of course, there is the root life, the life that Nora remembers living, a life full of disappointments and settling, that led to her attempted suicide and her visits to the Midnight Library. A moment in between, where she isn’t alive and in her body yet she isn’t dead (with the finality that means for self and others). And there are all of those other lives that she now gets to explore, lives where she doesn’t remember any of that Nora’s life, but finds herself plopped there with a kid yet no memory of this child, or as a wife with no memory of sleeping with her husband, or as a glaciologist with no memory of what such a scientist knows, or as a pop star with no memory of the words to popular songs, or as a pub owner with no memory of what to do when closing. Lives, but without the memories that led her there.An interesting thread running throughout the book is that of Hugo, another slider who explores his own lives. Hugo and Nora meet up several times, though find that the other isn’t what they want and each chooses to go back to their own terminal, hers a library and his a video store. I expected them to meet up at the end, as they had such a powerful connection through their sliding, both aware of themselves and of others, but no. it wasn’t to be. I’m not disappointed, just wondering if such a possibility exists, and if I will get this chance one day. And I wonder how Hugo arrived at this point, if his was also a suicide, and if it only happened to suicides or lives so filled with regrets.A question I still have is about the character of Mrs. Elm (for Nora) or the uncle (for Hugo) and the place where these shamans or guides or facilitators resided. Both sliders found themselves in an in-between place with a familiar character as the trusted one, not someone who used them but someone who in real life helped them find their own way. A good person. An older person who helped at a pivotal time in their life. I find it cool that the author (Matt Haig) crafted a god-like character, not one who superimposes her/his will on you but one who is limited in what they can do by the physics of the world (a library or a video store) they are trapped in. Not all-powerful. Not desiring worship. Not governed by human impulses (power and sex). But a personal god whose sole interest was in the needs and wants of a single person, a much better concept (to me) than the invented gods of the modern world that seem interested in humanity as a whole (and worship and knee-bending and blind obedience and all of that stupidity). If we could wipe away all of the old gods and create a new god for each person today, this would be the kind of god I would like to think about. Though there is that question about universality, and whether everything we think and feel isn’t just arising from our own experiences, including all of this god-talk.I enjoyed finding things in this book. Like the title, on page 31. And the name of the band, a variation of the Kurt Vonnegut classic, Slaughterhouse Five. And the name of the music shop that sounds like the idea behind all of the lived lives in this book, String Theory. And the references to Bedford and Pottersville, connecting readers to the classic movie, “It’s a Wonderful Life”. And life-fright being similar to stage-fright. And the role of chess in the book, from its beginning to its end, something that used to be a major part of my own life as an educator. And glitches in the library that stemmed from Nora thinking differently about death than she did in her root life. And I had to look up “grasshopper suicide”, because the character told me to, and how many forms of life there are (almost nine million), and Frank Ocean (“Moon River” was awesome).Another interesting concept is that of time. Time doesn’t pass for Nora in the real world as she pulls out numerous books from the library shelves, some exploring for a few minutes, others for hours or days or months. Yet the clock never moves past 12:00 in slide after slide, life after life, universe after universe, until her thinking changes in such a way that she no longer regrets the choices she made in her root life. And then the clock starts ticking and Mrs. Elm warns her that she must do just one thing in order to survive, pick that one book, and, wait, I don’t want to spoil it for you, but it gets to 00:03:48.If you want to know what happens to Nora, then read this book. It is really good and worth your time. And if you are the philosophical type (as I am), then keep a notepad and pen nearby so that you can write down the interesting thoughts and ideas that flow from the mind of Nora Seed, the questions she ponders, the truths she shares with the world. And I will end on a final thought, one found on page 137, about life and what it is: “…acres of disappointment and monotony and hurts and rivalries but with flashes of wonder and beauty.” Something to think about.",
                "reviewVotes": "231 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Letitia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWNHAYYDSHPROQYCPDSMT6K5ROQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN6O903UQPXN1?ASIN=0525559493",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "4.0 out of 5 stars A feel good read intertwined with some thought-inducing philosophy.",
                "reviewText": "\"Hmm, I don't remember buying this book, I guess I should read it....\" My experience with The Midnight Library was fittingly a journey in it's own right. It took me an embarrassing 14 days to complete, though to be fair I did read five other books in completion during that time. At first I didn't love it, it felt a bit trite, a la It's a Wonderful Life, but I did enjoy the philosophical jaunts. Some of the writing is absolutely delightful, highlight worthy even, but there were a few passages that had me scratching my head, and one that was so bad I literally had to stop, reach out to my dear best friend since preschool, and read it to her, juxtaposed to two brilliant passages that occured within the same two and a half pages, just to make sure it was really as bad as I thought it was, she concurred. Nevertheless, I found the overall story to be a pleasant read. Thought provoking at points, as previously mentioned, some great passages that I went back to savor a few times, it deals with real life issues in a sensitive and well thought out way. I would definitely recommend giving it a read, it is well worth the time.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erin Galvin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBI3REWIOFBIXNCMEUEHC67DFGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N8JKW3XA5Z86?ASIN=0525559493",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Read",
                "reviewText": "This isn't normally the type of book i would choose to read but I'm so glad my book club chose it! It was a captivating story and kept my interest from the beginning. A great story that also makes you think of your own life. I highly recommend this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexandra S. Morgan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQFNSM7UUKEANPOC57F2BA5453Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R121NSPUWFR1QR?ASIN=0525559493",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "3.0 out of 5 stars Interesting Perspective",
                "reviewText": "Everyone wonders about life after death, but this book allows us to wonder about life after life. What would we be if we had made different choices? Nora explores many different lives and finds out. The only reason I gave this book 3 stars instead of 4 is that in most lives, she is wildly, stupendously successful. That requires me to suspend disbelief a few too many times. But the author wants to keep the story moving along, keep the reader’s interest, so I understand that choice. All in all, I would recommend this book for readers who like this kind of book. It’s clean (little to no foul language, no sex), not violent (though there are repeated references to wanting to die or end one’s life, if anyone is triggered by that). I would say it’s fine for older teens and adults.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L. L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGZ6HJQWPXJNPNRXWYHSOEXFCHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNBU1GJNER1PB?ASIN=0525559493",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Everything we do can change the course of our lives.",
                "reviewText": "At first this was sad, but by the end of the first chapter, it hooked me when after she tries to kill herself she discovers, \"There's another place to go, and it's not some mythical after life.\" What if a lot of books, endless books of us, existed on our just making one different choice and it changed everything. What if we crossed a street at a certain time and met the love of your life, but what if you ignored him that day. It's all in here... What if we followed through on our childhood dream but realized it was only to get a parents approval, and you found out, it didn't make a difference anyway because other people aren't controlled by us and their lives and issues would have existed anyway... What if we followed any of the dreams we had of becoming, when we grew up, as a child, if we knew ahead of time what the outcome would be, would we choose another ending, or would we hold on to the life we have because every day we can decide to change just one thing and have a totally different life outcome than the one we have now. This was inspiring, and life changing in how it really made me rethink what I thought I knew.. What if we had made one simple change in our current life and we began to see we matter. Every person we touch, every word we say, every kind thing we do for others all does matter, and may have changed their lives, or saved them. Every day is precious and matters because we're here. In the end, as long as you have any time left, you can still make dreams come true and make it the life you want, or change someone else's life. Life affirming, and deep, this book will make you think, and see your existence matters more than you imagined, because of the lives you touched and may still touch yet. A great read, and a deep dive into our own \"what if\"..then read it again. I promise you'll think about this book for a very long time after you read it. BTW, it has a great unexpected ending.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cecilia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 29, 2023",
                "reviewTitle": "Hermoso libro",
                "reviewText": "Me encantó!!! Muy fácil de leer. En 8 días lo terminé. Es una buena historia. Va por pequeños capítulos. Es inglés británico. Muy lindo y bastante recomendable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "João Ernesto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 24, 2023",
                "reviewTitle": "Livro mto bom",
                "reviewText": "Eu o li em um dia",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kinga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 10, 2024",
                "reviewTitle": "Top 3 !",
                "reviewText": "Definitely a top 3 of my favourite books! Couldn't put it down, total page turner! I love the story so much I couldn't wait for the next chapters! I hope someone will make a film based on this !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashish sahoo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 8, 2024",
                "reviewTitle": "such a beautiful BOOK",
                "reviewText": "I did not expect to enjoy this book so much. I very much admire the writer's prowess in creating a beautiful and inspiring story out of a depressing premise and what I admire even more is the perspective he has given me about life.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "George Lazar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 4, 2024",
                "reviewTitle": "A Captivating Journey Through Choices and Second Chances",
                "reviewText": "\"The Midnight Library\" by Matt Haig is nothing short of a literary masterpiece that effortlessly weaves together the threads of life, regret, and the boundless possibilities that lie in our choices. This No.1 Sunday Times bestseller and worldwide phenomenon is a soul-stirring exploration of the human experience that lingers in the reader's mind long after the final page.The narrative revolves around Nora Seed, a character who finds herself in the Midnight Library, a place between life and death. Each book in the library represents a different life that Nora could have lived based on the choices she made or didn't make. This concept is both profound and thought-provoking, inviting readers to reflect on their own lives and the myriad paths not taken.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$12.81",
                "sellerName": "ZBK Books",
                "sellerRating": "4.5"
            }
        ]
    }
}