{
    "remaining_requests": 307,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Final-Fantasy-VII-Alright-Turks/dp/1975382366",
    "body": {
        "name": "Final Fantasy VII: The Kids Are Alright: A Turks Side Story",
        "price": "$14.00",
        "originalPrice": "",
        "rawPrice": 14.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Final-Fantasy-VII-Alright-Turks/dp/1975382366",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41TWndkksxL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41JjQ6LRHhL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kazushige Nojima",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Kazushige+Nojima&text=Kazushige+Nojima&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 609,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Tetsuya Nomura is best known as the character designer for the critically acclaimed Final Fantasy video game series, as well as the head developer for the massively popular, Disney-crossover, Kingdom Hearts video game franchise."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 12 hrs 39 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Wednesday, February 21. Order within 12 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "I thought my place in the world was gone, but the world is so much bigger than I ever realized. Evan Townshend is just one of many who lost everything during Meteorfall two years ago, and like the others, he has had to rebuild his life. In his case, this means working for Mireille's Investigative Services, a small company that tracks down missing friends and family. But when a case of mistaken identity drags him into a run-in with the Shinra Company's intimidating Administrative Research Department (better known as the Turks), Evan and his fellow investigator Kyrie Canaan begin ajourney to discover the truth-about both the world around them and themselves. And the truths they uncover may run deeper than they expect... Experience another side of the world of FINAL FANTASY VII with this prequel to Advent Children! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Yen On (January 22, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 228 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1975382366"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1975382360"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 13 years and up"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 8 and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.7 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.45 x 0.56 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#24,220 in Books (See Top 100 in Books) #60 in Teen & Young Adult Light Novels #74 in Teen & Young Adult Science Fiction Action & Adventure #1,217 in Science Fiction Adventures"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 609 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Brandon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ3VHRM76QHVGMN3HDJONDR65KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PYTG52V7ENJV?ASIN=1975382366",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 12, 2021",
                "reviewTitle": "5.0 out of 5 stars So much better than it has any right to be",
                "reviewText": "I bought this just because of its association with the popular video game. Being familiar with other video game tie-in books, I wasn't expecting much out of it. So, I was surprised when I found it was legitimately good! It's a well-told, mostly stand-alone book that introduces new characters, but it is integrated into the greater Final Fantasy VII canon and there is weight to what happens. Just a really great book. The story is better and more cohesive then Advent Children or Dirge of Cerberus. I say check it out!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mandy & Mason",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMU3TIVMLAKGWMCY2CJTY4HO4WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17JT0EO0Q27YJ?ASIN=1975382366",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 1, 2021",
                "reviewTitle": "5.0 out of 5 stars Loved it!",
                "reviewText": "My husband bought this for me as a Christmas gift and I absolutely loved it! I've been a FFVII fan since the game came out in 1997, so I was hoping to check this book out for a while. It's written by Nojima, one of the original writers of the game, and I couldn't put it down once I started reading. If you're a fan of Final Fantasy VII and you're looking for an interesting read, pick it up!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sisterhavoc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKKAHT3INVM5UJNTN6VWZGDEALQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R323FV3JVGZRO8?ASIN=1975382366",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 24, 2019",
                "reviewTitle": "5.0 out of 5 stars a perfect fit",
                "reviewText": "As most people who read (or are thinking of reading) this book, I love all things FF VII. So I had to check this out. It is an excellent fit between the game & the movie - most references to the story we all know & love are minimal & nothing has a non-canonical stink to it (even though some of the characters & events do make appearances throughout). Plus, I love Reno & Rude, so their parts in the story are a gem. Def a great way to spend a few hours & a great addition to your collection.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Psmith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBZRGVHEHBU35WKQGPIC4BAI6NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUJGBFRHHP6ZO?ASIN=1975382366",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 10, 2022",
                "reviewTitle": "5.0 out of 5 stars Great book.",
                "reviewText": "Loved this book. Huge fan of all FF7 sense I was a boy that could hardly read. If you like the original and have watched advent children it's a great read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FATfreakinDAD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6VGMRK4M47BDCOHZQC4A3SH57A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29EUH62GKV1A5?ASIN=1975382366",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2019",
                "reviewTitle": "5.0 out of 5 stars For hardcore FF 7 fans.",
                "reviewText": "I ordered this for my wife and she loves it. She played Final Fantasy 7 when it first came out and has been obsessed with it ever since. I've never played it through and I didn't read the book. I just like Tifa. Ummmmm...Tifa.... But, anyway, my wife was telling my daughter's boyfriend- who is, also, a fanboy-type- that the book explains a lot about the characters that the game and movies never fill you in on. It focuses on the Turks it seems and my wife enjoyed it. She's good people.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebecca",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCIN7K6C2RP2FHAOYEHZE7M2EXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJACL55XXDTBF?ASIN=1975382366",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2019",
                "reviewTitle": "5.0 out of 5 stars Its wonderful for fans of Final Fantasy VII and the Turks of the series",
                "reviewText": "This book is amazing and adds new detail and expands on the world of Final Fantasy VII. Its very nice to see how The Turks have been operating in this follow up to the original game and Case of Shinra from On the Way to a Smile, as well as see the events leading up to Advent Children. Plus Evan Townshend is just so entertaining to read about as a character along with his connections to the original characters. A must read for fans of Final Fantasy VII! It also arrived in wonderful conditions!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephen Pollard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIRNW63E6VBNO2IDWQG5SM6J5HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y8ZAM2KBMM1?ASIN=1975382366",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 18, 2019",
                "reviewTitle": "4.0 out of 5 stars This Book is Alright",
                "reviewText": "I will preface by saying most of this review will be spoiler-free. There will be mild spoilers that I will include toward the end, but I will add a warning before I reach that point.The Kids Are Alright was originally published in Japan in 2011 as part of the Compilation of Final Fantasy VII. Written by Kazushige Nojima, scenario writer of Final Fantasy VII and screenwriter of Advent Children (among many other titles), this novel tells the story of a previously unheard of character, Evan Townshend. Evan works with his friends, including love interest Kyrie Canaan, at a detective agency based in the slums of Midgar approximately two years after Meteorfall (the end of the game). His mother left him a few weeks before Meteorfall and is presumed dead, since Evan has not heard from her in two years.Of course, it wouldn't be a Final Fantasy VII novel without some of our main cast, and this is supplied primarily through the Turks (as the novel's subtitle makes obvious). Reno and Rude are major supporting characters, but for those disappointed by the absence of Tseng and Elena throughout most of Advent Children, you'll be pleased that they play fairly big roles, as well. And it mostly works. While the game showcased pretty dirty, evil individuals in the Turks and Advent Children mostly used Reno and Rude as comic relief and supporting good guys, The Kids Are Alright shows us both sides, where we see Reno and Rude beginning to transform into the Advent Children counterparts while still being pretty awful when the occasion calls for it.What doesn't work as well are a few of the other cameos. Tifa appears several times, which works as she runs Seventh Heaven and the main cast of characters frequent her bar. Cloud also makes a minor cameo which I thought would bother me but surprisingly felt natural (specifically because it is very short). But then we get a random Red XIII throw-in for very little reason, and toward the end Barret, Cid, and Vincent are all name-dropped in a pretty significant moment, which was obvious fan service that only served to distract. Even Aerith merits a few pointless mentions.SPOILER ALERTIn the third act, Kadaj is introduced (the antagonist in Advent Children, if you don't remember), and this is mostly out of necessity for filling in backstory for the movie as well as tying the novel into the film (so that calling it a prequel isn't a lie). The problem is, Evan's personal and emotional conflict in the story doesn't really relate to Kadaj, except that both characters are looking for their mother. Additionally, we received a ham-fisted reason for Kadaj, Yazoo, and Loz bearing those names. The entire thing feels way too much like Nojima and Square were trying to provide answers to questions that didn't necessarily need to be asked.END SPOILERSAside from those minor gripes (as well as a character previously thought dead having survived, a la Rufus Shinra in Advent Children), the novel is surprisingly good. The characters feel real, Evan is not your typical hero. He is a real person with character flaws, fears, and weaknesses. His love interest, Kyrie, is much the same, and even other original supporting characters avoid feeling completely one-dimensional. Additionally, the opportunity to spend more time in the world of Final Fantasy VII is an absolute delight, and despite some vague descriptions, it's obvious Nojima is familiar with and comfortable in this world.As far as the English translation (which received an official release this year), since I do not speak or read Japanese I cannot attest to its accuracy. However, at no point is there ever any question what is being conveyed on the page. I actually picked this up due to trying to read a fan translation that I couldn't follow very well, and I'm pleased that the translation is coherent and mostly free of typos.I would highly recommend this to fans of Final Fantasy VII who also enjoyed at least some of the Compilation (Advent Children, at the very least) and are eager to dive further into the world of FFVII. If you have never played the game or watched the movie, I don't see that there will be much value and newcomers likely would not be able to follow the story very well, as there is not much setup for anyone or anything outside of the original characters introduced.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brandon T.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3MSNIXSCQXTME3UFVYL5OWBNSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H0O5TF7EIYH2?ASIN=1975382366",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2021",
                "reviewTitle": "5.0 out of 5 stars Must have for Final Fantasy VII Fans",
                "reviewText": "This book tells the story from a different perspective. It includes all new characters and occasional approaches from those in the original. If you love this world of Final Fantasy, then I HIGHLY recommend it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bruno Gagné",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 5, 2024",
                "reviewTitle": "Great story, loved it.",
                "reviewText": "Wish there could be a small movie about it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 1, 2023",
                "reviewTitle": "Para fãs de FF7",
                "reviewText": "Um ótimo livro para quem procura por mais conteúdo de FF7 e quer saber mais sobre o que aconteceu após os eventos do jogo original e antes do filme FFAC.A entrega demorou um pouco por vir do exterior, mas chegou dentro do prazo e em bom estado.A great book to those who wish for more content on FF7 and want to know more about what happend after the events of the original game and before the FFAC movie.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rafal Wojcik",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 30, 2023",
                "reviewTitle": "The Kids Are Alright: A Turks Side Story",
                "reviewText": "Kazushige Nojima, one of Final Fantasy VII fathers, knows how to write a story in the world of FF7 and make it interesting. Great characters as well, new and returning. Some of the new characters introduced in this book, like Kyrie or Leslie appeared later in Final Fantasy VII Remake video game. Very good read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hyria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 21, 2023",
                "reviewTitle": "Amazing spin-off!",
                "reviewText": "I was somewhat sceptical at first since I had bad experiences with spin-off novels but this one is truly amazing. The characters are written very good, we get to know some more about post Meteorfall-Midgar and characters, the story overall is nice and reading about certain characters made me really nostalgic. I loved it and I'll read it again someday, a must-have for FFVII fans!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "daniel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 19, 2023",
                "reviewTitle": "Bel libro",
                "reviewText": "Se adori l'universo di final fantasy 7 acquistalo ad occhi chiusi",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}