{
    "remaining_requests": 149,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Book-Doors-Novel-Gareth-Brown-ebook/dp/B0C592691B",
    "body": {
        "name": "The Book of Doors: A Novel",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Book-Doors-Novel-Gareth-Brown-ebook/dp/B0C592691B",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/714OwORH4eL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Gareth Brown",
            "link": "https://www.amazon.com/Gareth-Brown/e/B0C5N57FVC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 152,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A debut novel full of magic, adventure, and romance, The Book of Doors opens up a thrilling world of contemporary fantasy for readers of The Midnight Library, The Invisible Life of Addie Larue, The Night Circus, and any modern story that mixes the wonder of the unknown with just a tinge of darkness.Cassie Andrews works in a New York City bookshop, shelving books, making coffee for customers, and living an unassuming, ordinary life. Until the day one of her favorite customers—a lonely yet charming old man—dies right in front of her. Cassie is devastated. She always loved his stories, and now she has nothing to remember him by. Nothing but the last book he was reading. But this is no ordinary book…It is the Book of Doors. Inscribed with enigmatic words and mysterious drawings, it promises Cassie that any door is every door. You just need to know how to open them.Then she’s approached by a gaunt stranger in a rumpled black suit with a Scottish brogue who calls himself Drummond Fox. He’s a librarian who keeps watch over a unique set of rare volumes. The tome now in Cassie’s possession is not the only book with great power, but it is the one most coveted by those who collect them. Now Cassie is being hunted by those few who know of the Special Books. With only her roommate Izzy to confide in, she has to decide if she will help the mysterious and haunted Drummond protect the Book of Doors—and the other books in his secret library’s care—from those who will do evil. Because only Drummond knows where the unique library is and only Cassie’s book can get them there. But there are those willing to kill to obtain those secrets. And a dark force—in the form of a shadowy, sadistic woman—is at the very top of that list. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C592691B"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ William Morrow (February 13, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 13, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2139 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 413 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1787637247"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,105 in Kindle Store (See Top 100 in Kindle Store) #10 in Alternate History Science Fiction (Books) #13 in Magical Realism #17 in Science Fiction Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 152 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/2f27bbd7-071c-440a-8df8-52efae44a94d.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/553e315c-a64b-408e-8836-1344a15174b6.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/07cd4e83-faac-4650-865c-3bf2aa57617c.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d95491dd-8e38-458e-9f61-f4dc929f8759.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Schizanthus Nerd",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFU7SGTPK3TWN4PIQYOPNYA3MV2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T74VVUN8UKD9?ASIN=B0C592691B",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2024",
                "reviewTitle": "4.0 out of 5 stars ‘Don’t let the world pass you by.’",
                "reviewText": "The first thing you learn about Cassie is that she works in a bookstore. So, basically, she’s a kindred spirit.It’s just beginning to snow as she’s getting ready to close Kellner Books for the night. Mr Webber, a regular, is mid coffee. He’s reading The Count of Monte Cristo again. Mr Webber loves the classics.‘A good story is just as good the second time around.’This is the night that Mr Webber gives Cassie a book. All books are special but this one is life-changing. I mean, more than other life-changing books. Cassie gets a glimpse of just how much when she gets home that night. You see, Venice isn’t usually in her bedroom.This is the Book of Doors and the possibilities are endless. It’s one of the most coveted books in the world and many who seek it have nefarious agendas.“Hold it in your hand, and any door is every door.”The heart of this book for me was Mr Webber. He was an absolute sweetheart. He could have been on every page and I still would have wanted to spend more time with him.I wasn’t a fan of the way two characters spoke at times. One of the baddies was misogynistic, racist and made light of domestic violence at one point. You can be the biggest Bad without resorting to any of this and, other than making me despise them more, it added nothing to the story. Neither did Izzy body shaming herself.I’ve decided I should never live above a cheesecake shop. I am, however, ready to move in to the Shadow House.This book contains a lot of magic. My favourite magic, though, was the ice cream that didn’t go off in ten years. Not that ice cream will ever have a chance of expiring in my home but I liked the idea that, if you were so inclined, you could go back and finish off that ice cream you started eating a decade ago. Although, now that I think about it, if you’re the sort of person who could leave ice cream unfinished for years, I’m not sure I trust you. This type of magic may be wasted on you.I don’t know if you can read this book without thinking about how you would use the Book of Doors. I’d be walking through my maternal grandparents’ front door in the 90’s. They were my favourite people and there are so many things I want to tell them about: what’s happening in my life, stories they’d laugh at, movies and books I know they’d love. I’d want to hear more stories about their lives and have the opportunity to have random conversations with them about whatever.I also thought about which book other than the Book of Doors I’d like to have in my possession. There are so many that wield enormous power, that could be used to change the world, for better or worse. I think the Book of Joy is the one for me, though. The possibilities alone make me smile.‘It’s always about the books, isn’t it?’Thank you so much to NetGalley and Bantam Press, an imprint of Transworld Publishers, Penguin Random House UK, for the opportunity to read this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda PfafflinLinda Pfafflin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKFUEJOXIGD27ZNXYBWUPJ4E7OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16VMZUEGK5NOD?ASIN=B0C592691B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Incredible debut and amazing book!",
                "reviewText": "This is an incredible book for a debut author — it re-created the amazement I felt the first time I read “The Night Circus” or “The Discovery of Witches.” It’s overwhelmingly phenomenal. And it’s a book about time travel — a genre that I usually avoid. Finally, a time travel book that, ahem, makes “sense.” I do expect “The Book of Doors” to be on my favorite books of 2024 list (and it’s only January).Imagine a library of books capable of creating magic: The Book of Illusion, the Book of Luck, the Book of Shadows, the Book of Destruction, the Book of Light, the Book of Despair, the Book of Joy, the Book of Safety, the Book of Speed, the Book of Pain, the Book of Matter, the Book of Health, the Book of Faces, the Book of Flame, the Book of Mists, the Book of Mirrors, the Book of Consequences, the Book of Answers, the Book of Control, the Book of Doors. Doors? What does that one do? Why do a group of greedy book hunters want that one so badly that they’ll kill for it?The Book of Doors has fallen into the hands of bookstore clerk Cassie, when sweet old Mr. Webber, a frequent customer who Cassie liked immensely, quietly dies in her shop. He leaves behind a small book, with an inscription meant for her. With her friend Izzy, Cassie discovers the book’s secret: hold onto the book and imagine a world no matter how far away behind a nearby door. Open that door, and you’re in that world — Venice, Paris, Egypt, a rooftop bar. Suddenly Cassie is living her dreams, using the book for travel, wonder and delight, although Izzy has her reservations. Is there a cost to magic?Of course, using the book means someone might realize the previously rumored Book of Doors is real and out in the open again, so pursuing Cassie and Izzy are Drummond Fox (the Librarian, who warns them about the book); Lottie and her thugs (The Bookseller, a black market middleman); Dr. Hugo Barbary (an awful barbarian living up to his name); and The Woman (once Rachel Belrose, a serial killer even more evil and cruel than Barbary, rejoicing often in the memories of the torture and murder of her parents).“The Book of Doors” is original, magical, and delightful, but not without tragedy and horror. The villains aren’t cartoonish — they’re ghastly and nightmarish and the action is non-stop. Cassie and Izzy and their newly acquired friends get entangled in a magical battle that enthralled me to the last page. 5 stars! I hope a possible sequel can maintain the amazement.Literary Pet Peeve Checklist:Green Eyes (only 2% of the real world, yet it seems like 90% of all fictional females): NO Only Gramps’ blue eyes are mentioned.Horticultural Faux Pas (plants out of season or growing zones, like daffodils in autumn or bougainvillea in Alaska): NO But every mention of flowers is a moment of joy among scenes that can often be despairing.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71veoYYk7yL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}