{
    "remaining_requests": 205,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Colour-Magic-Discworld-Book/dp/B09LZ36BHC",
    "body": {
        "name": "The Colour of Magic: Discworld, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Colour-Magic-Discworld-Book/dp/B09LZ36BHC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51wiNNsH2JL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Terry Pratchett",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Terry+Pratchett"
        },
        "brand": "Terry Pratchett",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 24114,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Brought to you by Penguin. The audiobook of The Colour of Magic is read by Colin Morgan (Merlin; Testament of Youth; Belfast). BAFTA and Golden Globe award-winning actor Bill Nighy (Love Actually; Pirates of the Caribbean; Harry Potter and the Deathly Hallows) reads the footnotes, and Peter Serafinowicz (Star Wars: Episode I - The Phantom Menace; Shaun of the Dead) stars as the voice of Death. Featuring a new theme tune composed by James Hannigan.'It was octarine, the colour of magic. It was alive and glowing and vibrant and it was the undisputed pigment of the imagination....'Somewhere between thought and reality exists the Discworld, a magical world not totally unlike our own. Except for the fact that it travels through space on the shoulders of four giant elephants who in turn stand on the shell of an astronomically huge star turtle, of course.Rincewind is the world's worst wizard who has just been handed a very important job: to look after the world's first tourist, upon whose survival rests the peace and prosperity of the land. Unfortunately, their journey across the Disc includes facing robbers, monsters, mercenaries, and Death himself.And the whole thing's just a game of the gods that might send them over the edge....You can listen to the Discworld novels in any order, but The Colour of Magic is the first book in the Wizards series. The Colour of Magic is the first book in the Discworld series and was published in 1983. Some elements of the Discworld universe may reflect this. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Action-Adventure/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10159265011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "7 hours and 58 minutes"
            },
            {
                "name": "Author",
                "value": "Terry Pratchett"
            },
            {
                "name": "Narrator",
                "value": "Colin Morgan, Peter Serafinowicz, Bill Nighy"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "July 07, 2022"
            },
            {
                "name": "Publisher",
                "value": "Penguin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09LZ36BHC"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,121 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #10 in Humorous Fantasy (Audible Books & Originals) #24 in Humorous Fantasy (Books) #68 in Action & Adventure Fantasy (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John P. Irish",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIR5LZL5DBVGO463JPSI46IUOIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KE9F048L6JSJ?ASIN=B09LZ36BHC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2021",
                "reviewTitle": "5.0 out of 5 stars The stories are great, I am going to focus on the different formats of the books!",
                "reviewText": "I had this book in my wish list for several years, finally took some time this summer to read it and it was very enjoyable. It reminds me a bit of Hitchikers Guide to the Galaxy meets fantasy. I have read several others in the series and I agree with many of the reviewers, the writing and stories get better as you go along (I think this is true with most writers, I liked the \"Voyage of the Dawn Treader\" better than the first two Narnia books). But I did enjoy both \"The Color of Magic\" and \"The Light Fantastic\" enough to keep going. \"Mort\" has been my favorite so far . . .I am going to focus on the different editions you can purchase.A+ - the hardback copies by Gollancz, very high quality. The paper is a nice feel, the print is very good, the covers are a soft cotton, they do not have dust-jackets (like all their hardback books), but the covers are designed very uniquely. I hope they have the entire series, looks like they have a lot of them.B+ - the paperback copy by Harper. This was the first copy I obtained, it is also very good, the paper, cover, and print are very high quality. The only down side to these, is there is no uniform editions. I believe they only printed the first three books, then after that another publisher stepped in and so the appearance of the books look very different from the others.C+ - the mass market paperback copy by Harper Collins. This was a very cheaply produced book. The first two books I got, were good quality (all ordered new from amazon, btw), paper was good, cover, and print were all good. Then the third and fourth books were definitely low quality. The print was poorly done, some passages appeared blurry, poor print job. The upside to these are the uniform look. The downside, terrible quality production.If you are looking for an interesting set of fiction, I absolutely love Pratchett's imagination and writing style, I bought all his other story collections, then I would definitely check out this series. I don't have any preference about where you start, some reviewers really are not fans of the first two, I thought they were good enough for me to keep going, but I definitely think they get better. I also like the stand alone nature of the stories, so I can pick the themes I enjoy the most to focus on and read.As far as which edition to buy, you might want to start with the mass market, they are cheaper, then if you like them, go with the other paperbacks. I have enjoyed the first five or so that I have read, I am now buying only the hardback editions.Enjoy! . . .",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dalton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDOKIPWOU3QME3KKGJNW6P3KKXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1C8SB51210X53?ASIN=B09LZ36BHC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Great Start",
                "reviewText": "Great start to one of the best fantasy novel series of all time. Gives a good idea of what to expect in later on books and a general outline of the world it takes place in while also introducing characters that will become favorites later on.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bill McCormack",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG54P4LOVFGJBN3CCZJCXQG6TZQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BHQIK6Z2TNT1?ASIN=B09LZ36BHC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Classic",
                "reviewText": "If you have never read Terry Pratchett, buy this book. You will never regret it. I miss his brilliant wit.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDC5DYPUEMVVDWCKKRCV7CTNXGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MEEAV7HAE0NJ?ASIN=B09LZ36BHC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "3.0 out of 5 stars It gets better! Just, not in this book...",
                "reviewText": "Terry Pratchett is my favorite author. That said, his earlier books are a struggle for me. As this is his first Discworld book, he's just developing his distinct writing style. Several things/people are mentioned here that are completely contradicted or changed in later books, so I believe he's buildimg/improving this world as he goes.Honestly, the only reason I finished this(second time through, just as much a struggle as last time) is because the series gets so much better, and I wanted to revisit it's roots. Some parts did make me chuckle, but man, this reread took some work...I would definitely not recommend it to anyone who hasn't already become emotionally invested in the Discworld series. Luckily, you do not have to read them in order, so maybe begin with Guards! Guards!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bryan Reagan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAZDWXWSOVXILVRIENUB7R3WOUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4X8OVKO6K87W?ASIN=B09LZ36BHC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Satirical Sword and Sorcery",
                "reviewText": "This is the first of Terry Pratchett's Discworld series. The setting and characters are standard \"sword and sorcery\" archetypes, exaggerated slightly for humorous effect. The tone and writing style are very similar to the late Douglas Adams.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bernie Gourley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6KA6ORMSRMC4GESVHR7GNIPFPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UI2HYGXKMDTA?ASIN=B09LZ36BHC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 25, 2016",
                "reviewTitle": "4.0 out of 5 stars One of Pratchett's most popular works, though not my favorite among his works. But, it's funny.",
                "reviewText": "“The Color of Magic” is a hero's journey tale done in comedic fashion. It’s the first book in Prachett’s disc world series. An incompetent wizard, Rincewind, becomes the guide to a goofy but wealthy tourist named Twoflower. However, as it happens the events that confront these two on their journey are part of a game being played between gods. I loved the humor, liked the story, but wasn’t a fan of the organization of the book.I should admit up front that fantasy is--hands down--my least favorite genre, and I can't say that view didn't jaundice my perception of this book. However, it’s a testament to Pratchett's humor and readability that I continued reading it.What is my beef with fantasy in general? First, once one introduces magic, how does one maintain tension in an environment in which anything can happen effortlessly? Obviously, fantasy fans find plenty of tension to keep them reading, but I just don’t get it personally. I know that one retort is that the same could be said of other speculative fiction genres. To the degree that is true, I also don't care for those other genres so much either. However, sci-fi (for example) has a basis for constraints that can be widely agreed upon. Second, the appeal of feudal society for setting perplexes me. I guess there is a certain romance to these periods for fans (perhaps because they imagine themselves in the statistically-unlikely role of king or knight as opposed to the much more likely position of serfdom, but whatever), but I see this type of society as backward and unsustainable (a ten millennia old kingdom maybe possible in a world of magic, but not in a world as we know it.)I know fantasy fans will be able to come up with examples of how their favorite authors avoid both of the pet peeves mentioned. In truth, Pratchett does a good job of negating these pitfalls. With respect to the magic problem, he makes the protagonist wizard really inept and, therefore, easily in situations over his head. Simply put, he makes his lead weak relative to those confronting him. With respect to the setting issue, Pratchett creates an entirely different kind of world, the disc world. This is not Charlemagne’s Europe with wizards.Prachett is often compared to Douglas Adams. In fact, if you Google “the Douglas Adams of fantasy,” you are sure to pull sites pertaining to Pratchett. One can see the same type of absurdist humor in Prachett’s work. Here’s a compilation of a few of my favorite lines:“Being Ymor’s right-hand man was like being gently flogged to death with scented bootlaces.”“No, what he didn’t like about heroes was that they were usually suicidally gloomy when sober and homicidally insane when drunk.”“Yah. I outnumber you one to two.”“He wondered what kind of life it would be, having to keep swimming all the time to stay exactly in the same place. Pretty similar to his own, he decided.”“But the captain had long ago decided that he would, on the whole, prefer to achieve immortality by not dying.”“Your affected air of craven cowardness does not fool me.”Pratchett appeals to the downtrodden in all of us. This can best be gleaned from the tale of Goldeneyes Silverhand Dactylos. Dactylos is a superb craftsman who is blinded, has his hand cut off, and suffers ever greater indignities because the Emir wants him to never again produce anything as lovely. It’s like the myth about Shah Jahan having the hands cut off Taj Mahal craftsman, except Pratchett’s Emir keeps asking the same man of increasing handicaps back to construct ever greater marvels of engineering.The book is arranged in just four chapters. This is a bit of an oddity for commercial fiction, and I don't really care for the sparse employment of breaking points in this book. Again, if I was enough of a fan of fantasy to read this in a single sitting (or even a few sittings) I would likely not find this to be an issue. However, I read it over time and interspersed with many other books (a lot of which were more captivating to me personally.) This might seem like a ridiculously nit-picky point, but for those of us who have a lot of reading up in the air at once, being able to readily put a book down and pick it up seamlessly later without losing the story is of great benefit.If you like humor, this book will appeal to you. If you like fantasy, I suspect you’ll doubly like it--as long as you have a sense of humor. If you don’t like either, this book will not be for you.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miudo Mna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 6, 2022",
                "reviewTitle": "Very good.",
                "reviewText": "Well packed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 10, 2021",
                "reviewTitle": "Hilarious and fun",
                "reviewText": "This book has encouraged me into reading more Terry Pratchett",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Simon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on September 26, 2023",
                "reviewTitle": "Great Start to a Great Series by A Great Author.",
                "reviewText": "Read it. Thank me later!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOSE JAVIER MARTIN DE LLANO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 26, 2021",
                "reviewTitle": "Todo perfecto",
                "reviewText": "Todo perfecto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bookmarked Reviews",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 26, 2021",
                "reviewTitle": "What a treat!",
                "reviewText": "How much magic, peril and adventure, how many wizards, heroes, dragons and trolls, how much wit and laughter is it possible to squeeze onto a disc carried by just four elephants standing on a single, albeit giant, turtle? The sky is the limit, but only if your name is Terry Pratchett.The Colour of Magic will take you out of the grim reality of the year of the pandemic and into multiple fantasy worlds where everything is completely other-worldly and belly-laughingly hilarious.Twoflower, a tourist who arrives in the city of Ankh-Morpork (on its rougher side) acquires special protection from a (failed) wizard Rincewind, primarily because of his Luggage which is filled with riches the criminal fraternity of the city has never seen before. Like a caterpillar, The Luggage travels of its own accord, using its many busy feet, and that’s not even the most puzzling thing about it . Rincewind and Twoflower meet villains, dragons, trolls and all matter of characters who either assist or obstruct them on their travels. And then they come to the edge of the disc. I can’t say anymore but the story doesn’t end there – not quite, not once, and not in the conventional sense of the word.I reached for The Colour of Magic to shake off the blues of last year. I remembered reading I Shall Wear Midnight many years ago with my daughter, and I wanted to recapture that old magic. I definitely achieved that.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}