{
    "remaining_requests": 353,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Luminaries-Susan-Dennard/dp/1250194040",
    "body": {
        "name": "The Luminaries (Luminaries, 1)",
        "price": "$11.99 $5.14",
        "originalPrice": "$18.99",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Luminaries-Susan-Dennard/dp/1250194040",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41l0Ut4VhWL.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/61LdwY75nZL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Susan Dennard",
            "link": "https://www.amazon.com/Susan-Dennard/e/B005YEU2VY/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by HPB-Emerald.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 651,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Will draw you in and leave you begging for more. Rich with tension, atmosphere, and finesse, you'll want to get lost in the world of The Luminaries again and again.”―Leigh Bardugo, #1 New York Times bestselling author of Shadow & Bone and Ninth House“I lost myself from page one in Hemlock Falls and its deadly forest, as vicious as it is inescapably alluring. Winnie Wednesday is the sort of outcast-turned-monster-hunter you can't help loving and rooting for.”―Marissa Meyer, #1 New York Times bestselling author of Gilded“Readers will want to don a motorcycle jacket and join the nightmare hunt.”―Kirkus Review“Enthralling from the first page, The Luminaries lures you into a misty darkness rife with thrills and romance. Living nightmares may stalk across the pages, but this book is a paranormal fantasy dream. The forest calls, and you will love every second of devouring its mysteries.”―Alexandra Bracken, #1 New York Times bestselling author of Lore“Dennard's newest begins with a triumphant success, heralding her third sensational series filled with delectable worldbuilding and dynamic characters.”―Buzzfeed“The Luminaries is exactly the thrilling, dangerous, heart-pounding fantasy I needed, with an incredibly original world and a heroine who knows and fights for her worth. Prepare yourself accordingly―I devoured this in a single sitting.”―Marie Lu, #1 New York Times bestselling author of Skyhunter\"Dennard’s newest is overflowing with action, adventure, and mystery with a sprinkling of romance that will keep readers turning the page.\"―Booklist“The Luminaries is your next obsession. Part family drama, part fantasy procedural, part helpful guide to monster hunting, all with a dash of romantic tension―this book is all my favorite things combined.”―Olivie Blake, New York Times bestselling author of The Atlas Six“A richly realized tale about monster hunters that explores family, community, and a whole lot of female rage.”―Paste“In The Luminaries, bestselling author Susan Dennard kicks off a darkly magical, action-packed new series and introduces a mysterious world filled with monsters. . . . Plenty of gasp-inducing thrills, monstrous gore and empathetic soul-searching―plus a little tentative flirting―bring The Luminaries to a satisfying conclusion.”―BookPage“The Luminaries is a chilling, gripping contemporary fantasy. . . . readers can only hope that the nightmares induced by The Luminaries will be vanquished by someone as brave and real as Winnie Wednesday.”―Shelf Awareness, STARRED review About the Author Susan Dennard is the award-winning, New York Times bestselling author of the Witchlands series (now in development for TV from the Jim Henson Company), and the Something Strange and Deadly series, in addition to short fiction published online. She also runs the popular newsletter for writers, the Misfits and Daydreamers. When not writing or teaching writing, she can be found rolling the dice as a Dungeon Master or mashing buttons on one of her way too many consoles."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 8 hrs 2 mins",
            "$3.99 delivery February 27 - 28."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From Susan Dennard, the New York Times bestselling author of the Witchlands series, comes a haunting and high-octane contemporary fantasy about the magic it takes to face your fears in a nightmare-filled forest and the mettle required to face the secrets hiding in the dark corners of your own family.An Instant New York Times BestsellerA Barnes & Noble YA Book Club PickAn Indigo Best Teen Book of 2022A Junior Library Guild PickAn Indie Next PickA Goodreads Most Anticipated YA BookHemlock Falls isn't like other towns. You won't find it on a map, your phone won't work here, and the forest outside town might just kill you. Winnie Wednesday wants nothing more than to join the Luminaries, the ancient order that protects Winnie's town―and the rest of humanity―from the monsters and nightmares that rise in the forest of Hemlock Falls every night. Ever since her father was exposed as a witch and a traitor, Winnie and her family have been shunned. But on her sixteenth birthday, she can take the deadly Luminary hunter trials and prove herself true and loyal―and restore her family's good name. Or die trying.But in order to survive, Winnie enlists the help of the one person who can help her train: Jay Friday, resident bad boy and Winnie’s ex-best friend. While Jay might be the most promising new hunter in Hemlock Falls, he also seems to know more about the nightmares of the forest than he should. Together, he and Winnie will discover a danger lurking in the forest no one in Hemlock Falls is prepared for.Not all monsters can be slain, and not all nightmares are confined to the dark.\"You'll want to get lost in the world of The Luminaries again and again.”―Leigh Bardugo, #1 New York Times bestselling author Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17466"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Tor Teen (November 1, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250194040"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250194046"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 13 - 18 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.08 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.55 x 1.2 x 9.55 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#55,200 in Books (See Top 100 in Books) #212 in Teen & Young Adult Fantasy Romance #263 in Teen & Young Adult Dark Fantasy #267 in Teen & Young Adult Wizards & Witches Fantasy"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 651 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0aff0310-7ef3-471f-8ec9-af860525a7c9.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4008981e-5b38-40b8-81a9-433428318dd7.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4d46c88b-1e18-49d1-909c-e9b541d9213d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/16bdfc9a-e8be-49fd-b1be-6f1626a5f970.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bcc149da-1941-41fd-8df3-7b93feeae129.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ann Turner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLX2BEYOC3DH4DKX7XYJUWJNVAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BO978YESUTUI?ASIN=1250194040",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Stumbled upon this book and so glad I did",
                "reviewText": "I found this book looking for a new audiobook to listen to. This is such a good story and I loved the twists and turns along the way. I finished it so quickly and can’t wait for book 2. 5.0",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lauren S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRHKG3OB33MTDYUIOVRZTD5MUMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JG3FG6N2UGGT?ASIN=1250194040",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2022",
                "reviewTitle": "4.0 out of 5 stars #ughJay",
                "reviewText": "One of my pleasant memories of the pandemic was participating in the “Sooz Your Own Adventure” aka the book whose plot was determined by a daily Twitter poll. So when I heard the author would be releasing a novel version of it, I had some hesitation. After all, Twitter hive mind led to some occasional, uh, interesting choices, as well as lots of #ughJay hilarity. But this book is mostly completely rewritten, not to mention it’s only part of the story.After her dad was revealed as a traitor to the Luminaries, Winnie and her family were banished from the order. The Luminaries are responsible for dealing with the creatures, called nightmares, that appear in the forest every night. Considering that nearly everyone in Hemlock Falls was involved in the secretive group, that made for a lonely past four years. Her only hope is to take the first of the Hunter Trials on her sixteenth birthday and convince them to take her back. But the forest is nothing like she remembers it and neither are the Luminaries. When Winnie sees evidence of strange things happening in the forest, no one believes her, except for Jay, the town bad boy and her former best friend. With a new nightmare lurking in the forest and little help, can Winnie survive the Trials?Some of the world building as definite promise. The hunters are divided into families, each taking the name (and corresponding hunting night) of a day of the week. Each family specializes in certain things, whether that’s training the next generation of hunters, developing new gear, or managing the bureaucracy. While the Luminaries are focused on containing the spirit in the forest by ridding it of nightmares every night, another group, the Dianas, seek to use its power for their own ends. The Dianas were the weakest part of the world-building for me, as it’s never quite explained why they’re so evil. The “never quite explained” bit is unfortunately true of the rest of the world-building, though. How do they manage to keep their towns so secret? How do they manage family trees when literally everyone has one of seven last names? Why is the position of Lead Hunter so important?“She belongs in the forest. She belongs as a Luminary. She belongs as a hunter.”Part of that could be explained by Winnie’s character. At times, Winnie read a lot younger to me than sixteen. Of course, she’s suffered without any friends for the past four years, watching her family fall further into poverty while her mother works herself to exhaustion. But the Wednesday line prides itself on loyalty and Winnie never seems to question her family’s banishment, instead rebuking herself for not realizing her dad was a Diana. She trains by herself in secret and refuses to accept any future for herself that doesn’t involve her being a hunter. Of course she accepts the Luminaries’ worldview without any questions as she’s never known anything else!“So what if last night didn’t go according to plan? So what if everyone was right and she hadn’t been ready for the forest? She still got what she wanted and what her family needed. There’s no reason not to keep going.”It’s only when she passes the first trial that her thinking starts to change. After four years of shunning, the rest of the Luminaries suddenly act like the intervening four years never happened. She’s welcomed back into hunter training, the kids who were bullying her a few days ago now act like her best friends and her mom and brother get job promotions. It’s exactly what she wanted to happen, but the whiplash is too much for Winnie. Why does she have to risk her life – because Winnie does nearly die, several times – before they decide her dad’s actions don’t matter anymore? How could her supposed best friends have turned their backs on her four years ago? Why is she so unhappy even though she everything she thought she wanted?“It is disconcerting that he can be so extremely well-proportioned while also being, ugh, Jay.”After she’s welcomed back, Winnie also starts connecting (or reconnecting) with some of the Luminaries. Some of the other prospective hunters reach out to her, but there’s still a distinct chilliness between her and one of her former best friends, Erica, that leaves Winnie hurt and confused. But the biggest chunk of time is spent with her other former best friend, Jay – who’s also her former crush. There’s the barest start of a romantic relationship, along with a lot of anger and confusion, because he falls somewhere on the enemy to friend spectrum but she still trusts him, even though it’s obvious Jay’s keeping secrets of his own.The plot was fine as well. What it says in the blurb? That’s exactly what you get, Winnie trying to make it through the three hunter trials. It felt like there was a lot of choreographing of future plot points. I’m not sure whether that’s because I knew the original plot (so I have a general idea of where this version might be headed) or if it really was that predictable. Some things were so blatantly obvious that I was banging my head against the wall going “ugh, Winnie”. All that – and the fact that it’s told in third-person present tense – could be forgiven because I honestly enjoyed the majority of the story, except for this last point. The ending was ridiculously abrupt, like I kept trying to turn the page on my ereader in confusion. In a way, it makes logical sense where the book ends, but the structure of the book and the pacing left me hanging. Most (almost all) of the subplots are unresolved, including one introduced near the end of the book. It felt unfinished in a way that really rubbed me wrong.“You either trust the forest or you don’t, Winnie.”Overall, 3.5 nostalgic stars. Without that nostalgia, this would be more solidly a three thanks to that ending. Either way, I know I’ll read the next book just because I want some resolution to, uh, any of the plot points.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Travis Hayden",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFCZ7XCEX5WIFH66QNTN2U5BN7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QMXBWKPM97QU?ASIN=1250194040",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2022",
                "reviewTitle": "5.0 out of 5 stars It is no surprise that I...",
                "reviewText": "It is no surprise that I am a huge fan of Susan Dennard, so I will purchase almost anything she writes. The Luminaries was no exception. I was around for the whole crowd source story when Dennard started this on Twitter. It really was a great way to get the community together and see how our choices would shape the story. So when Dennard said she was going to try and take the breadcrumbs of that project and recreate something new, I was sold. Dennard did not disappoint. I really liked the atmosphere and the vibe of the story. Dennard's writing has gotten so strong over the years. My one and only little gripe with this book was that the characters could act a little too childish at times. I know the age group is like teens in high school and I am now older, so maybe I just find it annoying, but that is why I am not going to punish the rating. The Luminaries is a strong start and foundation for this series and I look forward to seeing how this wraps up in the final book.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kari L.Kari L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG666QKQBY26Y7CSQ5RPTLSTZFQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FE11UNXZOF6S?ASIN=1250194040",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 14, 2023",
                "reviewTitle": "3.0 out of 5 stars Imaginative Concept",
                "reviewText": "“That’s why we’re called the Luminaries, Winnie: we are lanterns the forest can never snuff out.”✨✨The Luminaries focuses on Winnie as she fights to regain her place amongst the hunters of Hemlock Falls following her family being shunned due to her father’s betrayal.✨✨I loved the idea of The Luminaries. The premise of hunters going into a forest every night to eliminate monsters plaguing the forest sounds so amazing as well as the trials the potential hunters have to go through. However, the story itself felt a little flat up until the final moments. I enjoyed the trials themselves and thought they were hr most interesting element of the book. Although, I felt like the plot needed to be teased out more between the big baddie in the forest and the big reveal in the final pages. I’m hoping it was intentionally vague to help set up the next book in the series. I did enjoy it enough to read the next one in the series and see where Dennard goes with the characters.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81-2fxyxZ6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZYROTVCEMALXO4X5SO44OZT3CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21I50YYBVZNQ1?ASIN=1250194040",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars So far so good.",
                "reviewText": "I bought this for my wife and she’s suggested this to her friends, so I say it’s good!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cindeereads",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWXLCPSIZTI2M7M2EQRZT4AK2EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBKZYGTDNP8MF?ASIN=1250194040",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2022",
                "reviewTitle": "5.0 out of 5 stars Susan Dennard never disappoints",
                "reviewText": "I loved this book so much this author will always be an automatic read for me. I loved the characters so much I especially loved Winnie she was such a great character that just wanted the best for her family and to end the shunning they have done to her and her family for four years. I also loved Winnie's family her brother Darian his boyfriend Andrew and her mother I like that they didn't automatically embrace them being accepted back for them it was four years too late for them to accept it all at face value. I also liked Jay the potential love interest he was a interesting character looking forward to where that goes. I loved the plot it starts with Winnie telling how they were basically shunned for something her father did so she sets out to end that by entering the trails to become a hunter and end that shunning many things happen along the way looking forward to reading more.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blue Eyes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDVOUXEKZNRWDTH456RX7BXWJWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L3FOEMMGCBZQ?ASIN=1250194040",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2022",
                "reviewTitle": "5.0 out of 5 stars Winnie, her mother and brother are outcasts from their family, and the Luminaries",
                "reviewText": "They are outcasts for ten years because of their father. This means they are treated as traitors, ignored, reviled, and Winnie’s mom is no longer a Hunter.Winnie wants nothing more than to be a hunter, but she has not been allowed to train with the rest of the young people for the last 4 years. She has trained on her own as best she could and she is as prepared as she can be for the Hunter trials. Even as an outcast she can take part in the Hunter trials when she is sixteen.Winnie shows up for the first trial and things do not go as she had planned. There is something I. The forest, a Whisperer, a new nightmare, and no one believes her.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marlou Klijn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on September 23, 2023",
                "reviewTitle": "Holy Nightmares, this book was EPIC.",
                "reviewText": "Holy Nightmares, this book was EPIC.I was looking for a good Spooktober read and remembered I got approved for a The Lumanaries ARC so of course it became my next read. It was delightfully spooky and interesting and wowza! I still have soooo many questions so I sure hope we're getting sequel and SOON.This was an action packed adventure that was over waaaay too soon. I need MORE MORE MORE. GIMME GIMME GIMME.Sooz always sucks me into her stories and she's done it once again. Her writing is just unlike anyone else's. Any another author would have me annoyed at the fact we know so little still about The Whisperer and The Wolf, but Sooz just makes me crave that next book.I would looove to see Jay and Winnie's friendship / relationship grow. I already love their connection and wish we'd seen just a tad more of it.I'm giving The Luminaries 4,5 stars because there's a few things that irk me too much to give it the full 5 stars but DAMN, this book was so cool. I could really feel how much love went into writing this book.So book two... Can we strike a deal, Sooz? GIMME GIMME GIMMEThis book was provided to me by the author and Netgalley.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L Fishwick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 31, 2023",
                "reviewTitle": "Amazing",
                "reviewText": "The Luminaries left me with such a book hangover! It was so great that for days after I finished, I kept going to pick it back up before remembering that I'd already got to the end. I am SO looking forward to book two.Winnie Wednesday's life dream is to join the Luminaries and spend her nights destroying nightmarish monsters. But Winnie and her family have been shunned as traitors ever since her father betrayed Hemlock Falls, which means no training, no support, and no easy access to the hunter trials. If she's going to pass the trials and become a Luminary, she'll have to contend with more than monsters - an even bigger challenge than she expects given the new monster stalking the forest that only she has seen. Can she fulfil her dream, redeem her family and convince everyone that she's not making up the most deadly monster Hemlock Falls has ever seen, all while fighting for her life?I've been a long-time subscriber to Dennard's newsletter for her brilliant writing advice, but this is actually the first novel of hers that I've read (a few of the others have been waiting very patiently in the tbr pile on my kindle...) I'm absolutely going to have to rectify that this year because I loved The Luminaries so much! It was packed full of brilliant world building, non-stop action, tension and really high stakes. It also had brilliant characters who were flawed and made mistakes, with plenty of secrets still left to uncover in the next book.My Netgalley file was corrupted and kept skipping pages but I was so invested in what I had read that I went and bought the ebook so that I could keep reading.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Friederike",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 24, 2023",
                "reviewTitle": "Fantastischer Reihenauftakt!",
                "reviewText": "Dieses Buch war ganz genau das, was ich lesen wollte und ich habs geliebt. Ich will sofort zurück zur ersten Seite blättern und es nochmal lesen.2019 habe ich Susans Choose Your Own Adventure Twitter Thread entdeckt und begeistert wochenlang in den Polls gevotet und Winnie in ihrem Abenteuer voran gebracht (& auch umgebraucht, upsi). Jetzt eine weitere Version ihrer Geschichte zu lesen, die genau das verkörpert, was ich an dem Twitter-Adventure schon geliebt habe und immer noch neue Dinge zu entdecken und neue Blickwinkel, war eine wahnsinnige Freude. Susan Dennard hat mir genau das geliefert was ich lesen wollte und noch eins drauf gesetzt.Ich liebe die spooky vibes, die Nightmares, die Hunter (wenn auch nicht alle) und ganz besonders alle Szenen im Wald. Winnies Geschichte ist irgendwie cozy und auch voller Nervenkitzel und perfekt für den Herbst (auch, wenn das Buch im Frühling spielt).Ich finde, es ist noch Luft nach oben. Von Susans Witchlands-Büchern weiß ich, wie fantastisch sie Plotten und Welten bauen kann und ich hoffe stark, dass das in Luminaries 2 & 3 noch folgen wird. Allerdings habe ich mir an keiner Stelle des Buches gedacht \"hier noch ein bisschen mehr, bitte\", einfach weil der Hauptaugenmerk auf Winnies emotionaler Entwicklung liegt und zusätzlich Details in meinen Augen einfach zu überwältigend gewesen wären. Es herrscht eine schöne Balance zwischen Action und heartfelt Moments und Stress und Aufatmen, allgemein fand ich das Tempo sehr angenehm. Und Winnie hatte einfach keinen brainspace für noch mehr Infos, die sie mit sich rumschleppen muss, girl was in survival mode the whole book.Ich bin sehr gespannt auf Band 2, freue mich sehr die angedeuteten Verstrickungen aufgedröselt zu sehen und wie Winnie und #UghJay darauf reagieren werden und noch mehr zu der Welt zu lernen. Ein ziemlich guter erster Band, meiner Meinung nach.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria Pilar Albarran Ruiz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 2, 2022",
                "reviewTitle": "Atmospheric & fun, the perfect first book in a new trilogy!",
                "reviewText": "I was completely sure I was going to love this book because it is a Susan Dennard book and she is one of my auto-buy authors for quite a few reasons.But this is the perfectly creepy and dark but hopeful, fun and escapist fiction that I knew I needed & wanted after taking part of the 2019 Sooz-your-own-adventure on Twitter! Sooz never disappoints me and once again she's absolutely hit the spot with this story!It's creepy, a little angsty, with quite a lot more to dig into in the next books, about the forest, the nightmares, monsters or not, and all the secrets unknown between Luminaries and Dianas!Devoured this in a day, enjoyed every page of it and I cannot wait to get book 2, as soon as possible!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emma Anderson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 30, 2023",
                "reviewTitle": "Great read",
                "reviewText": "Great read from start to finish",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}