{
    "remaining_requests": 298,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Curse-Scales-Flame-Magic-Marvels-ebook/dp/B0CHGWDD4C",
    "body": {
        "name": "A Curse of Scales and Flame: A Magic and Marvels Novel (Magic & Marvels Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Curse-Scales-Flame-Magic-Marvels-ebook/dp/B0CHGWDD4C",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81k85NmBVrL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Max Walker",
            "link": "https://www.amazon.com/Max-Walker/e/B01CTMTSHM/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 516,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CHGWDD4C"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (November 10, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 10, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5875 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 344 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,731 in Kindle Store (See Top 100 in Kindle Store) #16 in LGBTQ+ Fantasy Fiction #56 in LGBTQ+ Fantasy (Kindle Store) #85 in Gay Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 516 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Linds S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBGDEW4F2HEIK5VE23SDVKBT5EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XDPDQM0UZ6FY?ASIN=B0CHGWDD4C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "5.0 out of 5 stars A super fun yet steamy banger of a start! All the stars!",
                "reviewText": "Oh my heck this story was so much fun to read!! Listen when I found this book on my IG feed with its magnificent cover art, I knew I had to read this immediately.Seriously we have dragons, vampires, other magical beings, a basilisk style subway system, laugh out loud moments, and girl yes EVEN SOME SPICEEEE… I mean come ON!?🐉 TROPES & THEMES 🐉✔️ protective, slightly broody dragon shifter 🥹✔️ forced proximity✔️ a magical Los Angeles✔️ a drag Queen legend named Starlight✔️ gay dragons!!✔️ curses, adventures, and action packed✔️ the sweetest love story + 🔥 spice✔️ HEA - open ended for MORE 😎✔️ dual POV✔️ literally the perfect binge worthy romantacy why are you still reading this and not the book smh (unless it’s not out yet then carry on)Our story starts out with Damien rushing home to discover the mysterious sickness that has plagued the dragons has begun to take his mom’s life. His entire family is a special type of dragon family, a Rainbow Flight. Which, I’m sorry but I about cried all over my kindle this is so beautiful to me, ok?! 🥹Devastated but adamant about finding the cure, Damien and his siblings meet with their friend Claire in her witchy store to discuss ideas when SUDDENLY Mr. sunshine barges through - Robby.Now Robby is just your average, normal dude just trying to get by and decides to ask if Claire is hiring while he’s here, being weirdly chased by vampires suddenly. Damien is instantly interested and protected of this human male.The rest of the story you must read to find out, so I’ll say that this book had everything I need for my romantacy check list. The story was refreshingly unique, and I had so much fun reading it! There were moments when I was laughing out loud from the situations or dialog, and moments when I couldn’t swipe my pages fast enough for answers. Max’s twist on LA and turning it into a literal magical place was so awesome and I loved seeing the ideas play out in my head! Seriously, imagine riding a BASILISK instead of the Marta?! HELLO?! That’s cool af.The romance was so sweet, and I totally got fated mate vibes. Heck, even one of the chapters said fated mates so my “wee woo wee woo 🚨” was going off. The spice was super hot and sooo well written! I honestly could have read several more chapters of this couple and been over the moon!! I didn’t want the story to end!!It definitely gave off a little bit of zodiac academy vibes with the lighthearted moments, the magical beings, and all the epic things in between. But gosh, this story is so special - you just can’t compare it to anything really! It’s in a league of its own!I’m for sure a new fan of Max’s, and I can’t wait for more stories in this incredible magical world he’s given us!! 😍😍",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jose Orlando Lopez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNECOOGXRIEQK6X4R644SMGPH2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TE700HLWFASK?ASIN=B0CHGWDD4C",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Captivating and delightful journey",
                "reviewText": "\"A Curse of Scales and Flame\" by Max Walker is a captivating and delightful journey into a magical world filled with dragons, vampires, fae, shifters, and other fantastical creatures. The story centers around Damien Blackthorne, a dragon shifter determined to unravel the mystery behind a curse threatening dragonkind. Enter Robby Diaz, a charming human with a penchant for trouble, who unwittingly becomes entwined in Damien's quest.What sets this spicy MM cozy urban fantasy apart is its perfect balance of high stakes and heartwarming moments. The author weaves a tale that keeps you on the edge of your seat while tugging at your heartstrings. The optimism and hope infused in the storytelling make it a cozy and uplifting read, despite the looming threats. The urban magical world described in the book is so vivid and inviting that I found myself wishing I could step into its enchanting realms.Damien and Robby make for an endearing couple; their sweet and romantic moments add a layer of warmth to the narrative. The scalding spice in the story is expertly tempered with these tender scenes, creating a perfect blend that keeps the reader engaged and emotionally invested. As the first book in the series, it introduces a host of intriguing characters, leaving me eagerly anticipating how their stories will unfold in future installments. \"A Curse of Scales and Flame\" is not just a paranormal adventure; it's a heartwarming and sexy escape into a world where love and magic meet.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5ZOPWT4GGOPPHB2LHE2RZGEX4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GY6H6YITUU8Z?ASIN=B0CHGWDD4C",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "3.0 out of 5 stars It wasn't bad",
                "reviewText": "This book was a little hard for me to get through. It was a simple story. Not much development happens between the characters' romantic relationship. There were no major twists and nothing really wowwed me.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kitt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDW3P5STWRB67MZ3NMKCW2YJ6DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXCXNI11UE1EA?ASIN=B0CHGWDD4C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Incredible fantasy romance!",
                "reviewText": "Oh my goodness, this book! I am a HUGE fantasy nerd, like read the Tolkien appendix level nerd XD It's pretty rare for me to find a new fantasy book that hits all the notes but ACOSAF knocked it out of the park!It felt like a blend of urban and high fantasy. The world building was top notch, some really unique concepts I adore (like the Snake Way and rainbow hatch). I was impressed with how complete the world felt without having to slog through a ton of lengthy descriptions (cough Tolkien cough). He painted a full picture while keeping the pace of the plot and dialogue going.The romance was not quite insta love but it did develop fast and without much drama outside the main plot conflict. If I have any criticism, it's that I wish we got to see a little more of their relationship develop. It had almost a fated mates feel to it. However, I can see why maybe the author chose to let their relationship be when there was already a lot of stress in the central plot. The few nit picks I have weren't enough to take away from my overall enjoyment of the story.I honestly can't wait for more in this series. There are still so many things about the world I want to know- not that he didn't give us enough in this book, just that I'm greedy because I fell so hard for the universe he created!Can anyone say fan art? I need to draw so many characters and scenes from this!! Starting with a certain nightmare queen... But I digress XDSpeaking of art, I cannot review this without GUSHING about that cover. It does so much and really makes this book stand out in the genre. Not only is it not the standard guy with abs photo, the illustrator he chose has a style that is more nuanced than some of the anime-esque covers that dominate the illustrated cover side of this genre. No shade to those, as they have their own distinct charm, but I really enjoy the painterly style of this piece.I highly recommend this one!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura Winter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQADBILM2EF5JPEXKVYGXXIG36Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U0T73F5A0DD8?ASIN=B0CHGWDD4C",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "4.0 out of 5 stars I want to be besties with Robby",
                "reviewText": "This was super cute and action-y and so very gay and I loved every second of it. The writing held me back a bit, just the style was a bit clumsy and timeline was hard to follow. But other than that I really enjoyed this with a smidge of steam and really wonderful characters",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dawn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 22, 2023",
                "reviewTitle": "A wild ride",
                "reviewText": "Robby and Damien's story has it all. Their journey wasn't without bumps but there is humour and fire and spice. I love the cast of characters with all their quirks. There is enough intrigue to keep you guessing. It is a wonderful introduction to a world I can't wait to visit again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "caroline",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 17, 2023",
                "reviewTitle": "Brilliant",
                "reviewText": "Love love this book .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Desi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 12, 2023",
                "reviewTitle": "Fantastic",
                "reviewText": "I love all of this author's books, but with \"A Curse if Scales and Flame\" he has outdone himself.An extremely thoughtful story, with many unexpected twists, tension until the last chapter, lots of exciting magical creatures and great protagonists",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 17, 2024",
                "reviewTitle": "Honestly kind of a disappointment",
                "reviewText": "I had pretty high expectations from this. I'm a fan of MM fantasy romances and reading the synopsis I was very much interested in reading this. The book started out fine but devolved way too much as it went on. The story had way too many plot holes. If Robby was a twin and he and his brothers were the ones required for the making and breaking of the curse, shouldn't the vampires have captured them both at the start and killed one and turned the other. Nobody was even aware about the curse until it started and the vampire matriarch clearly was aware of both the twins existence and location. The only reason it was written in such a way was to have the MCs meet each other. Apart from this Robby anyways turning into a vampire was an even worse plot point. It just made him seem selfish. If he wanted to save the dragons and knew that his death would break the curse, why would he ask beforehand to be turned in case he died. What if his turning into a vampire just cemented the curse forever. Also he seemed so grief stricken when he found out about his twins death, but he still consciously chose to be turned into the very thing responsible for his brother's death. All these made me like Robby less and less as the story went on. Similarly Damien seemed just as selfish as he not only gave the only cure to his brother but also outright disagreed to kill Robby. I get that yes that would be a very tough decision to make for anybody but isn't that why they are the protagonist of the story. The MCs seemed to have a character development on the negative side in my opinion. The only thing I did like about the book was the world building. The fantasy world setting showcased by the author was very fun to read. Especially transportation via basilisk seemed awesome.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bibliophiler Booknerd",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 1, 2024",
                "reviewTitle": "Cute, but also a little bit disappointed ?",
                "reviewText": "Der Anfang war echt stark. Ich mag Robbie, Damien und die anderen Charaktere, ABER der Mittelteil hat sich leider wie Kaugummi gezogen + die Zeitsprünge?Keine gute Kombination, insbesondere wenn in ihnen so viel von der Beziehung zwischen Robbie und Damien stattfindet. Show ist einfach so viel stärker als Tell. Deswegen habe ich nicht immer ihre Verbindung zueinander nachempfinden können. Was ich sehr schade finde.Leider kommen auch einige Logikfehler hinzu, die mir sehr stark aufgefallen sind (so etwas fällt mir eigentlich nur selten auf).Vielleicht bin ich auch einfach mit der falschen Erwartungshaltung an die Geschichte gegangen?Ich dachte, es wäre erwachsener, mehr Spice, mehr Action und dichter gepackt. Bekommen habe ich eher eine cute YA Geschichte. Cute, aber nichts, was mir für Jahre im Gedächtnis bleiben wird. Zumindest mochte ich die found family und die Charaktere so gerne, dass ich die Reihe weiterverfolgen möchte.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}