{
    "remaining_requests": 251,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Grey-Bastards-Jonathan-French-audiobook/dp/B07B7QJHV9",
    "body": {
        "name": "The Grey Bastards: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Grey-Bastards-Jonathan-French-audiobook/dp/B07B7QJHV9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51k-AliUdIL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jonathan French",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Jonathan+French&search-alias=audible"
        },
        "brand": "Jonathan French&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 3071,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“[A] fantasy masterwork.... A dirty, blood-soaked gem of a novel [that reads] like Mad Max set in Tolkien's Middle Earth. A fantasy masterwork.\" (Kirkus Reviews - starred review)Jackal and his fellow half-orcs patrol the barren wastes of the Lot Lands, spilling their own damned blood to keep civilized folk safe. A rabble of hard-talking, hog-riding, whore-mongering brawlers they may be, but the Bastards are Jackal's sworn brothers, fighting at his side in a land where there's no room for softness.And once Jackal's in charge - as soon as he can unseat the Bastards' tyrannical, seemingly unkillable founder - there's a few things they'll do different. Better.Or at least, that's the plan. Until the fallout from a deadly showdown makes Jackal start investigating the Lot Lands for himself. Soon, he's wondering if his feelings have blinded him to ugly truths about this world and the Bastards' place in it.In a quest for answers that takes him from decaying dungeons to the front lines of an ancient feud, Jackal finds himself battling invading orcs, rampaging centaurs, and grubby human conspiracies alike - along with a host of dark magics so terrifying they'd give even the heartiest Bastard pause.Finally, Jackal must ride to confront a threat that's lain in wait for generations, even as he wonders whether the Bastards can - or should - survive.Delivered with a generous wink to Sons of Anarchy, featuring sneaky-smart worldbuilding and gobs of fearsomely foul-mouthed charm, The Grey Bastards is a grimy, pulpy, masterpiece - and a raunchy, swaggering, cunningly clever adventure that's like nothing you've heard before. Praise for The Grey Bastards“Saddle up the war boar and set off on a wild, gory thrill-ride that ends in an awesome climax and begs for a sequel.” (Daily Mail, UK) “Non-stop action, though not for faint hearts.... The Grey Bastards live up to their name in all respects.” (The Wall Street Journal) Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Horror",
                "link": "https://www.amazon.com/Horror-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=49"
            },
            {
                "name": "Dark Fantasy",
                "link": "https://www.amazon.com/Dark-Fantasy-Horror-Fiction-Books/b/ref=dp_bc_aui_C_5?ie=UTF8&node=9803"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "17 hours and 47 minutes"
            },
            {
                "name": "Author",
                "value": "Jonathan French"
            },
            {
                "name": "Narrator",
                "value": "Will Damron"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "June 19, 2018"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07B7QJHV9"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#67,062 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1,855 in Action & Adventure Fantasy (Audible Books & Originals) #2,167 in Horror Fiction #3,082 in Epic Fantasy (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lora S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZL7PB4UL47R3E24ENBLOLK6DVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X17JQPPZVAJQ?ASIN=B07B7QJHV9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2018",
                "reviewTitle": "5.0 out of 5 stars Hog ridin' fools on actual hogs. Free Bastards too.",
                "reviewText": "Years ago I was introduced to some underground comic featuring an episode starring a motorcycle gang called the ‘hog ridin’ fools.’ When I first read a review of The Grey Bastards, I couldn’t help thinking of them.Of course, the Grey Bastards don’t ride motorcycles. They ride actual hogs – hogs that sound like a cross between a wild boar and a bison. They call their hogs ‘barbarians.’ They don’t just ride around looking for trouble, either, although they find plenty without having to look too hard.The Bastards, a small group of half-Orcs known as a ‘hoof’ patrol the area of Ul-wundulas known as the ‘Lot Lands,’ a mostly barren wasteland that serves as a buffer between the human kingdom of Hispartha and the country of the Orcs. Other hoofs of half-Orcs, centaurs, Elves, halflings, and a fortress of human soldiers also help patrol these lands – or fight among themselves for control of them.Jackal, Oats, and Fetching are members of the Grey Bastards. Jackal harbors ambitions of becoming the chief of the hoof. As time goes on, this wish becomes more urgent. But when the time comes to throw their axes to vote, it turns out that he doesn’t quite have the votes. He expects to be killed, but instead, he is exiled from the hoof. While he is away, he learns much about the history of the half-Orcs and the true nature of how they have protected the Lot Lands.This is definitely a book for adults. In Ul-wundulas as in other fantasy worlds, Orcs are not nice people, and half-Orcs are not much better. If you are offended by coarse language or nearly non-stop sexual innuendo, you should stay away from this book. There is also a pretty high level of violence.However, despite the tough front they put on, I think the Bastards are not, on the whole, a bad-hearted bunch. My favorite part was the time Jackal was sentenced to help out in the village of Winsome just outside the walls of the Bastards’ fortress, the Kiln, where the women and children and the adolescent Bastard trainees called ‘slopheads’ live, and his visit to the orphanage there where he was raised.What's up with this? I want to submit a review for the third book in the series, The Free Bastards. But I am put to my earlier review of The Grey Bastards. But here is my review for The Free Bastards tacked on to it:• This book focuses primarily on Oats, the third of the three childhood friends who have been the backbone of the Grey Bastards and then the True Bastards since they came of age. Many of the members of the hoof who we met during the days of the Grey Bastards are now dead. Frankly, it seems that most of the remaining members of the hoof are people who have joined from other hoofs, or who were, for whatever reason, not a member of any hoof before. Some of these don’t last long, but many, including several females who have persuaded Fetching, the female who is the current leader of the Bastards, to allow them to be full members, have proved to be good additions to the hoof.• In the previous book, The True Bastards, Fetching persuaded all the mongrel hoofs to unite to drive the humans (the mongrels call them “frails” because they are so comparatively weak) from the country of Hispartha out of the dried-up, scrubby country known as “the lot lands” where the mongrels along with several other marginalized races make their home. Uniting the hoofs was not easy, but it was done, and the war against the Hisparthans was not going too badly until things suddenly fell apart. Now the Hisparthans are bringing an all-out war into the lot lands.• A big part of this is interference from the half-Orc sorcerer who Oats’ friend Jackal called ‘Crafty’ when he showed up at the Bastards’ home in The Grey Bastards. Crafty is from another country, considers himself the rightful heir to the throne of HIspartha, and has already managed to betray the Bastards at least once. He does so again, and yet he is ultimately responsible for the years-long war coming to something like a peaceable end. Very confusing. Especially given how he goes about it.• In their efforts for the war, the Bastards are allied with, in addition to the other half-Orc hoofs, several other races, including some smaller groups of humans, some Elves, and the halflings, led by their high priest, Zirko. Zirko has his own agenda for the alliance and is not above several acts of betrayal himself.• Given the inconclusive results of some of the battles in the lot lands, Crafty finally persuades Fetching to send a small contingent of “ambassadors” with him into Hispartha. Fetching picks Oats to head this delegation knowing it to be, if possible, more dangerous than fighting them in open battle. While on this expedition they meet one of the most interesting people in the book, Manrique. Manrique is the older brother of the Queen and ought by the usual rules of succession to be the proper King. But he was long ago judged to be incompetent to be King, and anyway, he doesn’t want the job, being more at home with animals than people. But he is not as stupid as he has been made out to be, and Crafty plans to use him for his own purposes.• There are a lot of other moving parts too. There is a demon involved, who doesn’t seem quite as evil as he might have been. The plague makes a return appearance. And in between all the battles, traveling, and other commotion, Oats finally finds true love too – or so it seems.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Books Of Brian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAVRSFN5ADEBHT6A564MHDWRIJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T6MXJI5Q369Z?ASIN=B07B7QJHV9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2018",
                "reviewTitle": "4.0 out of 5 stars Missed It By That Much",
                "reviewText": "“Missed It By That Much”Maxwell Smart**Spoiler Alert**This is the second time I’ve used that Maxwell Smart quote this month and it’s going to be for similar reasons. I’ve just returned home from a three day trip – during which I was able to make a lot of progress on my June releases – finished this one, finished “Awakened” and have a few chapters left in “Revenant Gun”. I’m going to try and get reviews out for all three and finish with a quick vanity post inspired by something I saw on “Morgana’s Book Box” that featured reading nooks.I have to start by saying that just about everyone seems to love this book. It’s hard to find a negative review and those I have found seem fixated on the amount of profanity and sex / sexual banter the author throws at you. I don’t have a problem there. The characters in this book lead hard lives in a hard land and death is a daily event. If the profanity, sex and sexual banter weren’t there – I’d begin to wonder why.I’ve read a lot of reviews that describe this as a bit of a tribute to “Sons Of Anarchy” – I wouldn’t know. Never watched the show and I’ve never understood the appeal that motorcycles have for some people. Having said that, the society that French creates with the Hoofs – the bloody, male-dominated, warrior culture – is a fascinating one and there’s plenty there for a grimdark enthusiast to appreciate.I don’t have any significant criticisms of the book – I did really enjoy it. It’s well-written – French creates a dirty, brutal world in the Lots that you enjoy getting to know. For the most part, it’s well-paced – the narrative pulls you right along. There are plenty of intriguing characters – particularly the Jack/Oats/Fetch triumvirate. I’m just not one of those reviewers trumpeting its sheer “awesomeness”.The book truly shines in the first half – from the opening scene at Sancho’s brothel to the first leadership vote. For me, the book was at it’s best here – getting to know the Grey Bastards, their way of life, the way the Hoof was organized and run. It was hard to put the book down during this part of the story.It became a little less compelling during the second half – once Jack is out of the Hoof and learning more about the world outside the Lots and the backstory of how things came to be. It wasn’t that I didn’t enjoy it – the narrative just lost some of the visceral power that came with life inside the Hoof. I would have been perfectly happy with a book that kept me with the Hoof and within the Lots. Once you’re outside that small but fascinating world, it became less unique and slightly less special.Still – all was good enough until French decided to finish the narrative with two developments that – for me – just didn’t sit well. The first was the Hoof’s decision to go out in a blaze of glory – ten riders deciding to charge a party of 200+ orcs – and then have them saved by a last minute arrival of the Tines. Fine…but it felt a bit contrived to me and I couldn’t help but think there might have been a better way. The second was the elevation of Fetch to Chief. In doing so, the Grey Bastards basically jumped past three logical candidates for Chieftain – Warbler, Jack and Oats – and went for someone who – from the perspective of tradition – would have been the least likely choice. It’s not that I didn’t like Fetch as a character – she was fascinating and a great part of the book. It’s just that French gave us nothing about the Grey Bastards during any part of the story that would suggest a willingness or ability on the part the Grey Bastards to make that kind of break with their past. Jack was the center of the story from page one – his journey and his growth as a character left him ready and able – and his leadership during the final climactic battle all left him prepared to assume the mantle of leader. To snatch that away in the final couple of pages and drop it onto the shoulders of the character least likely to rise to the role in all too many ways – just didn’t seem right.Don’t get me wrong – great concept, great read, deserving of plenty of praise. I just felt a tiny bit let down when I turned the final page.As I think back across the month, I’ve read 4 books that more or less fall into the grimdark category – three of which have been debuts:The Poppy War by R.F. KuangThe Traitor God by Cameron JohnstonBlackwing by Ed McDonaldAnd one by a previously published author:The Grey Bastards by Jonathan FrenchHere’s how I see them breaking out – at least for me – you can check my reviews for additional perspective.“The Poppy War” was an enjoyable book but it was broken in too many ways. It’s not one I’d recommend, I regret having purchased it and I won’t continue with future installments should the author continue the series.Both “The Traitor God” and “The Grey Bastards” were fine reads – very well done. I enjoyed them both, I’m very glad to have purchased and I will continue with the series as the author continues to write. I just felt there were a few problems with books – largely involving the conclusions – that kept them from achieving their full potential.“Blackwing” stands out about all the others – an exceptionally well written book and a fascinating story. This one did get there for me in every way and I can’t wait for McDonald to bring us his next installment.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P.L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2023",
                "reviewTitle": "\"Sons of Anarchy\" and \"Mad Max\", infused with \"Lord of the Rings\", and \"A Song of Ice and Fire\".",
                "reviewText": "For the final of my #spfbowinners reads in the month of July 2022, I took on the blood-soaked adrenaline rush that is \"The Grey Bastards\" by Jonathan French. This book won 2016's Self-Published Fantasy Blog-Off (SPFBO), and is the first book \"The Lot Lands '' series, which has received plenty of acclaim, including a coveted Kirkus Star for the final book in the trilogy.I had heard this series was dark, bloody, and brilliant, so I got ready to saddle up and enjoy the ride.What a ride it was.\"Live in the saddle. Die on the hog.\"This is the mantra of the eponymous Grey Bastards. The Grey Bastards are just one of many outlaw bands of half-orcs who roam the wasteland known as the Lot Lands. The Lot Lands divide the realm of humankind from the full-blooded orcs, who are almost unbeatable killing machines, intent on wiping out all other races, especially humans.The half-orcs, for centuries, have been the protectors of humans. But it's a thankless job, as the humans detest their mixed-race protectors as much as their main enemies, the orcs themselves. Riding giant razorback hogs, who are as much pet and faithful companion as they are mounts, imbued with part-orc-like strength and fortitude, lustful, bloodthirsty, and cunning, the half-orcs live a brutal and often short existence in the Lot Lands, which is a place ravaged by orcs, powerful and mysterious elves, demented and terrifying centaurs, wizards, demons, and other deadly creatures.The protagonist, Jackal, is a young, charismatic, and clever leader in his band, but he has bigger dreams, and aspires to the overall command of the Grey Bastards. He thinks the current commander, the revered Claymaster, is past his prime, lacks vision, and is holding progress of the clan back. Thus, it's time for a new boss - Jackal.Backed by his friends, Oats and Fetching, Jackal plots his moves to oust the Claymaster, but a strange sorcerer, an elven girl, and Jackal's own friends may have other plans for the upstart half-orc.The characters, both human and non-human in this book were fabulously well-drawn, but you probably won't like many of them. Still, they are highly authentic, and will leave an impression. Among some of them, their love for each other - especially among those who are bound by clan ties - their sense of duty, honour, and fairness, and adoration of their beloved hogs will make them somewhat more endearing.Yet for the most part, they are all pretty ruthless, depraved, and many have no compunction at double-crossing to further their own ends. The Lot Lands is a difficult place to survive, and its inhabitants seem to be products of their environment. For the half-orcs, typically born of Orcs forcing themselves on humans, ostracized by both human and Orc parentage, obliged to protect the humans who look down on them, and fight the orcs who see them as prey, they don't have the easiest of livelihoods. Their motivations and actions seem more comprehensible when their background is considered.The protagonist, Jackal, is an interesting combination of naked ambition, guile, curiosity, passion, courage, and a streak of goodness hiding underneath a pretty messy overall character. Oats was my fav - he seemed to be, if not the smartest of the bunch, the most genuine, noble, and honest of the bunch.There were plenty of themes to keep me interested in \"The Grey Bastards\", such as love, loss, loyalty, family, devotion, and freedom. To be clear, this book is not for the faint of heart: it is bloody, violent, and there will be some moments that will rip your heart out, even for characters that you may not otherwise like. Of course, that is the skill of a great writer, to make a reader care about the fate of unlikeable characters, and French manages to do this very well.I loved the worldbuilding in the book, and the backstory of how the situation where the half-orcs became the last bastion of defence was very engrossing. The diverse creatures and races, the impenetrable fortress of the Kiln, the soft magic, were all features of the book that really worked for me.Here is what may or may not work well for some readers. First, the humour is often vulgar (but funny as hell), rife with obscenities. If you don't like your bawdy jokes, look elsewhere. The fight scenes are marvellous, and there is action aplenty. With marauding orcs and centaurs, dark magic, and massive razorbacks, the visceral clashes are unforgettable, and were some of my favourite parts of the book.Second, perhaps the most problematic part of the book is that there are a lot of crude, demeaning, and outright sexist and misogynistic terms and references to women, and sexual violence against women referenced, or inferred. Females do not fare well in the lot lands. They are essentially either prostitutes, chattel, or worse, with few exceptions. Even the main character, who would otherwise be likely seen as morally grey, in perhaps the book's most disturbing scene for me, at one time horiffically ponders raping another character.But I do not believe at all that this is the viewpoint of the author, or else I would not be allotting the book this type of high rating and endorsement - instead I would have likely DNF'd the book, which is something I rarely if ever do. Why don't I believe this? Because, out of concern, I had purposely watched interviews with the author, speaking about precisely this. It is my sincere belief that the author is actually attempting to counter sexist customs, and rather is commenting on how abominable such practices are, and how bleak the world he has created is.Further evidence would be the character of Fetching, who is indomitable, no man's plaything, and who I understand has the second book in the series as \"her book\", as the protagonist. I am certainly willing to give the series a chance, and check out the next book, to verify my beliefs, and see if the depiction of female characters improves in book 2. French's excellent prose, wonderful action scenes, and masterful worldbuilding were certainly enough to make me feel it would be worth it to read all three books in \"The Lot Lands\".This book was absolutely relentless in its pacing, yet this gritty, dark, tightly-wound tale managed to weave fascinating political intrigue, exceptional worldbuilding, and thought-provoking themes into the narrative.If you like \"Sons of Anarchy\" and \"Mad Max\", infused with \"Lord of the Rings\", and \"A Song of Ice and Fire\", in a less capacious book than your typical epic fantasy, \"The Grey Bastards\" is for you. I am definitely in for the series, and for the long haul with Jonathan French's writing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T Chandirasekar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 28, 2020",
                "reviewTitle": "Wild West meets Sons of Anarchy! Brilliant!",
                "reviewText": "Overall: +9Loved it. A refreshing read, which is wildly gripping and totally different from any other book I've read. A roller coaster adventures both geographically and plot-wise keeps moving to keep you stuck to the book.Freshness: +10The Lot Lands is a gritty hard place stuck between a semi-hostile kingdom on one side and wild orc hordes on other. A wild west meets sons of anarchy set in fantasyland! Both the setting and the characters plus they way book is written clearly sets itself on a level outside of most other fantasy book out there.Prose: +10An unapologetically disgusting and dirty prose that shreds modern political correctness and sensibility expectation on it's way to a wildly entertaining romp. A cascade of vulgarity and lewdness seeps through every page of the book topped with base jokes, that actually make you laugh rather than cringe, which is not an easy balance to achieve! Despite that the book has a nice flow to it and it drags you right in to experience the life on a hog in lotlands right with the characters.Plot: +8What starts off as a personal duel rapidly escalates into a far bigger conflict which the author keeps you from guessing till the end. The way the lead character plods through the events trying to find this way, but finding his beliefs yanked repeatedly makes this a obsessive page turner. I have dropped some points on this because of a minor gripe...the books focuses on the protagonist but fails to provide a view of other parties that will be impacted but are not properly covered.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Iris S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 13, 2019",
                "reviewTitle": "Best read within the last ten years",
                "reviewText": "My mothertongue is German. Even though I enjoyed this book tremendously. I grew fond of Jackal and Oats easily. The plot was catching like the plague. I found myself reading whenever I could snatch a moment of free time. I am looking forward to the second book, but I will miss Jackal being the center character.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TOMunro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 5, 2017",
                "reviewTitle": "A wild and exhilarating ride",
                "reviewText": "I try to observe a rule not to read other people's reviews of something that I've read until after I have written my own, lest there opinions should colour mine. So I am writing this review of The Grey Bastards in some haste so I can freely indulge my curiosity about what other friends and reviewers have thought of this brilliant and fascinating tale.Of the last twenty books I have read, The Grey Bastards will be the fourth that I have been introduced to via Mark Lawrence's Self-Publishing Fantasy Blog Off. This is, I think a testament to the competition's success in lifting some very good books above the noise signal and anti-self-publishing snobbery that has hidden some remarkable talents from a wider audience.The Grey Bastards came first in the 2016-17 contest and is an extremely well polished book - even if its protagonists are as rough as sandpaper toilet tissue. The story's feet appear planted in the Dungeons and Dragons milieu of my youth - huge birds called rokh and amorphous digesting blobs called black sludges could have sat quite happily between the pages of the Monster Manual. The Grey Bastards are themselves a troop (or rather a hoof) of hog riding half-orc cavalry who we see and bond with through our point of view protagonist - Jackal. Jackal himself, is young, ambitious and - if not exactly handsome - at least less intrinsically ugly than others of his kin.Make no mistake, this is a brilliant book, that challenges the reviewer only in knowing where to begin tackling the task of describing it, much as one might wonder how to bring down Jackal's brother in arms the mountainous and formidable thrice blood - Oats.Thrice bloods are one of French's many linguistic, cultural or even biological developments that add a deep and rich additional dimension to what - in other hands - might have been a mere parade through a flat role playing campaign. The half-orcs are all bastards, beget by orcish rapes - fierce and formidable fighters the various hoofs have become part of the Empire's defense against orcish incursions. Thrice bloods are the most formidable half-orcs, born of a half-orc mother and an orc father. The half orc hoofs - and other re-purposed denizens of familiar myth - each patrol their own parcel (or lot) of the near lawless borderlands between the orcs and the empire. The lots are a barren dangerous place - home only to those who have no other place to turn to - a wild land that makes the wild west look like a kindergarten's playground - where the only safety is in the mutual loyalty and reliance of belonging to a group.I daren't say too much more of the plot - this is a book to discover for yourselves.It is perhaps fair to warn you that - from the very outset - the tone and language of our half-orc hero and his friends is beyond bawdy, beyond coarse and yet all the more believable for it. These are the roughest of rough soldiers bound by the close knit camaraderie and carnal preoccupations of many a troop of specialist mercenaries operating under near constant duress. I have seen the like of their crude language previously only in Jeff Salyards' coarse-tongued Syldoon soldiers who rode through the Bloodsounder's arc trilogy. However, the fluent variety of the Grey Bastard's cursing might raise a blush even in Lieutenant Muldoos.However, the story is no testosterone driven male monopoly. The female characters - Fetching (the half-orc warrior), Beryl (sometime nursemaid, sometime director of the half-orc orphanage), Delia (the whore who dares) amongst several others are all given agency and screen-time aplenty and you come to love and fear for them as much - if not more so - than for Jackal himself.French's half-orcs are eloquently, entertainingly, crudely, witty, but his writing is also skillfully evocative in its descriptions. Some of the lines that caught my eye include\"... there was a threat buried in the thick folds of politeness.\"\"The morning sky was newborn, still jaundiced before a proper sunrise.\"\"... the wet defeat in her eyes betrayed she did not know how to proceed.\"The action scenes are gripping, the technicalities of hog cavalry warfare absorbing, the pacing brilliant. I consumed the last 43% of this book in a single evening - breathlessly borne along through a sequence of ascending climaxes (of the plot variety). The various threads of the story wound round and through each other to an ending that was so beautifully perfectly fitting that I put down the kindle with a sense of utter satisfaction.This is a tale of the fellowship, of the loyalty that each individual must bear to the greater whole - and in the final analysis due recognition must be and is paid to the one willing to sacrifice everything for the others,",
                "reviewVotes": "77 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LF",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 16, 2016",
                "reviewTitle": "Absolutely brilliant!!!",
                "reviewText": "The Grey Bastards is a brilliantly written little gem and I'm very sad this is only a standalone book because I would've loved to read more about this fantastic world and its equally fantastic charachters.If you're easily offended by some swear words and sexual banter, this is not the book for you. But what do you expect from half-orc warriors... surely you wouldn't expect them to have some polite conversation while sipping tea. They're tough warriors who fight hard and play hard, living in a harsh and dangerous world.And the hogs... I have to mention them! The half-orc warriors ride these big hogs with 2 sets of dangerous tusks. I loved those hogs! So fierce, loyal and courageous... I would trade my car for one in a heartbeat but it might be a bit hard to keep one in a small city garden.Although there is 1,5 month left in the year I already know this is going to be my favorite book of the year.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}