{
    "remaining_requests": 416,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fourth-Wing-Empyrean-Book-1/dp/B0BVDJ293G",
    "body": {
        "name": "Fourth Wing: Empyrean, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fourth-Wing-Empyrean-Book-1/dp/B0BVDJ293G",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61D7uTS7-TL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Rebecca Yarros",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Rebecca+Yarros&search-alias=audible"
        },
        "brand": "Rebecca Yarros&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 168485,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An Instant New York Times BestsellerA Goodreads Most Anticipated Book\"Suspenseful, sexy, and with incredibly entertaining storytelling, the first in Yarros' Empyrean series will delight fans of romantic, adventure-filled fantasy.\"—Booklist, starred review\"Fourth Wing will have your heart pounding from beginning to end... A fantasy like you've never read before.\"―#1 New York Times bestselling author Jennifer L. ArmentroutEnter the brutal and elite world of a war college for dragon riders from New York Times bestselling author Rebecca YarrosTwenty-year-old Violet Sorrengail was supposed to enter the Scribe Quadrant, living a quiet life among books and history. Now, the commanding general—also known as her tough-as-talons mother—has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre: dragon riders.But when you’re smaller than everyone else and your body is brittle, death is only a heartbeat away...because dragons don’t bond to “fragile” humans. They incinerate them.With fewer dragons willing to bond than cadets, most would kill Violet to better their own chances of success. The rest would kill her just for being her mother’s daughter—like Xaden Riorson, the most powerful and ruthless wingleader in the Riders Quadrant.She’ll need every edge her wits can give her just to see the next sunrise.Yet, with every day that passes, the war outside grows more deadly, the kingdom's protective wards are failing, and the death toll continues to rise. Even worse, Violet begins to suspect leadership is hiding a terrible secret.Friends, enemies, lovers. Everyone at Basgiath War College has an agenda—because once you enter, there are only two ways out: graduate or die.The Empyrean series is best enjoyed in order.Listening Order:Book #1 Fourth WingBook #2 Iron FlamePlease note: based on listener feedback, we have updated the audio of this edition. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Action-Adventure/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10159265011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "20 hours and 43 minutes"
            },
            {
                "name": "Author",
                "value": "Rebecca Yarros"
            },
            {
                "name": "Narrator",
                "value": "Rebecca Soler, Teddy Hamilton"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 02, 2023"
            },
            {
                "name": "Publisher",
                "value": "Recorded Books"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BVDJ293G"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Dragons & Mythical Creatures Fantasy (Books) #1 in Action & Adventure Fantasy (Audible Books & Originals) #1 in Sword & Sorcery Fantasy (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sarah B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEEZK55D4Y2KTHYKL6FAMXZ4ROQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1B8HFCJFF2G3M?ASIN=B0BVDJ293G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Totally Captivating!!",
                "reviewText": "Wow! It has been a LONG time since I have actually felt tension while reading a book. I can read the biggest action scenes at the end of various books and the majority of the time they just don't affect me at all - because I don't care that much about the characters. But THIS - this was different. I felt the tension. And it was real. Plus the author is very willing to kill characters so there is some uncertainty there as well. And the battle at the end of this most excellent book - it was hot and raging. Plus the enemy leaked danger as well. True menace. Very rarely does some enemy in a book impress me at all but this one most certainly did.. Right from the description I just KNEW there was something different about these mages called venin. They seemed impressive too. And very memorable. I wanted to draw them based off of the description. Very rarely do I get that urge.But what a battle at the end! It was touch and go. What would happen? Would the heroes win or lose? I didn't know. And I felt concern.This book has made me feel things. Earlier it had made me cry - tears of joy.And the book has surprised me too. The plot twists! I guess I should have seen it coming but I didn't so I was quite surprised. But it certainly makes the story way more interesting! And I am certainly eager to read the sequel too! This is a massive book and worth reading every word! And rarely do I feel that way. But its exciting and the characters face so many challenges. And there is death too. In fact there is a lot of death in here. Its a very violent world, a tough world of dragons and griffins and things that are supposed to be only legends to scare kids to eat their vegetables...But what I love the most in here in the main character Violet. She has a connective tissue disorder. I have one too (its called Ehlers Danlos Syndrome - EDS - and I am pretty confident that Violet actually has EDS). I have never run across a character in a book before that has EDS. And certainly not one that is bold enough to be in a fantasy world where she rides a dragon. How cool is that? So yes I certainly can relate to her very well! And so much of the stuff in here is quite accurate too. Exercise is the best way to protect the joints (and personally I find diet matters a ton too). And yes it certainly can make many things way harder. The joints are all wonky and they naturally hyper-extend so doing things - even just balancing - is way harder. But riding a dragon!!! I remember when I was much younger I used to read this other very popular fantasy series that included dragons and I used to try to imagine what it would be like to ride a dragon. Of course I never thought about the issues of staying ON said dragon... But since I ride horses these days I have a better idea of some of the issues. But wow this book is totally AMAZING! it totally captivated my attention. The first evening I started it I got 50% through. And I certainly would have powered through the second half yesterday but unfortunately I have packing to do as I am moving at the end of the month.If I could I would rate it 6 stars!The characters are just so real. And they go through character arcs too. They change. They face obstacles and have to find solutions. And there is certainly a bit of romance in here too. The story moved so smoothly. Never a dull moment at all. None. And I just loved the first person writing in here from Violet's viewpoint.But the story is about a young woman named Violet who has been forced by her very powerful mother to become a dragon rider. That is a warrior. But her body is weak and ill suited for it. So she was training to be a scribe (but all of that writing would be a huge strain on her too - in fact I cannot write very long at all by hand anymore without pain + numbness going down my arm and I get horrid shoulder pain) but that changed - she had to go be a dragon rider or die trying. But its not that easy in fact its very dangerous. Most people who try to become a rider end up dead. And you can be killed by your own classmates! Yes, its a very brutal school. And after all of these difficult obstacles - which Violet is ill suited to pass - she has to hope that a dragon will pick her. But what dragon will pick someone with a body that doesn't work right due to genetic mutations?And all of that is near the beginning of the book! For a huge mysterious and dangerous problem is brewing in the Kingdom! And poor Violet will run smack into it - err - fly into it. If she can stay on the dragon that is...You definitely should read this!",
                "reviewVotes": "69 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CrazyAboutBooks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPTEV6KONHYWPYKIADV3SYFJE5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WX5HGH9FW6EX?ASIN=B0BVDJ293G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Highly, highly recommended!!",
                "reviewText": "I discovered this book, \"Fourth Wing\" by Rebecca Yarros, while searching for new books to read. Right away the extraordinary number of five star reviews stood out. The reader number itself is shared by other authors/books as well as great reviews too but not so much with overwhelming 5-star reviews. Curious and always willing to add another book to my Kindle, I read the description and the sample pages, then ordered it right away. Now that I have read the book I can promise it deserves 10 stars at least.Once I finished this book, right at the end of it Kindle gave me the option to buy the second book, \"Iron Flame\" an offer I promptly took advantage of. I reviewed that book as soon as I read it covering this one as well to some extent. However, since this book deserves all the stars it can get, I will now try to do justice to this marvelous and wonderful book as well. I love both of them so much.\"Fourth Wing\" is full of likable characters, human as well as dragons. It is a fantasy tale but the dialogue and actions of the characters is fresh and modern. In fact, we learn most everything we need to know about the well-developed characters and the events affecting them through their actions and their intelligent and charming conversations. The dragons can communicate with their riders and that dialogue is clever as well. Any descriptive material only adds to the enjoyment of reading the book. This is true of both books.The story in \"Fourth Wing\" mostly takes place at Basgiath War College, a training academy for dragon riders. The main female character, Violet, is sent there by her Mom (a General in charge of the college) even though she is small and has either a bone or connective problem or both. How Violet survives through her own resourcefulness and cleverness is totally entertaining. Written mostly from Violet's viewpoint, she indeed becomes quite a character to cheer on throughout her brutal \"course\" studies! Along the way she meets Xaden the second main character. The chemistry between those two will eventually set the page on fire.In addition, it is equally impressive at how the development of a brand new world in which the characters and looming challenges, including hints of revolution and possible wars, all fit together perfectly. Everything ties together in this book from the characters names to the descriptions of the \"course work\" at the college to the names of the outer settlements. I sure hope to get across how truly great this book is so even more of you will give it a try, then move on to \"Iron Flame\" which picks up where \"Fourth Wing\" leaves off. These two books are two to remember for a very long time. I repeat: I loved both books. We anxiously await a third book!",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnaAna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 10, 2024",
                "reviewTitle": "Excelente libro",
                "reviewText": "Llego en tiempo y forma. La trama de este libro está increíble, 100/10 recomendado!!!Si viene protegido el libro, pero igual no es mucho la protección y si termina llegando con las esquinas un poco dañadas, pero muy leve.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71vJ4VH4GlL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Renata Maria Andreoni Barcat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 14, 2023",
                "reviewTitle": "Empolgante",
                "reviewText": "Este é um daqueles livros que realmente prendem a atenção. Leitura super agradável. Adorei o enredo e os personagens. Estou ansiosa para comprar o segundo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shaysshelf",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 30, 2023",
                "reviewTitle": "The perfect romantasy",
                "reviewText": "I never wrote a review after reading Fourth Wing the first time back in May, shortly after its release, and I think that's because I was both stunned into processing the magic that is this story AND because I was so excited about it I couldn't find the words.Months later, I continued to think about this book, these characters and of course, the man himself, shadow daddy Xaden.This time, I decided to reread Fourth Wing before diving into Iron Flame now that it has been released, and it. Still. Holds. Up.There was nothing about this book that I didn't absolutely love. We have a wonderfully diverse cast of characters with chronic illness, disability, 2SLGBTQIA+ and BIPOC representation.We have incredibly witty banter that had me cackling. We have an amazingly strong FMC, who pushes herself to persevere any obstacles - physical or otherwise. We have a swoony MMC who doesn't coddle or baby her, allows her to shine, gives her tough love and affection depending on what she needs and makes her stronger.We have dragons. WE HAVE DRAGONS.I've never really been that person who is obsessed with fantasy books with dragons, but I'm obsessed with these dragons. There's nothing better than an animal in a book with a massive personality in my mind, and Tairn, Sgaeyl and Andarna give us that in spades.This book gives us tender moments, delicious spice and scorching hot tension. It gives us laughs and tears, heart ache and betrayal, friendship and loyalty.It has literally everything I could ever want from a romantasy book and I'm so happy I get to experience it all in real time with so many other readers.This book is without a doubt, easily in my top three favourite books of the year - probably number one if I'm honest.I'm really happy I decided to reread this book before jumping into Iron Flame. The first time I read through, I read it purely for enjoyment. The second time through I was reading a little more critically. Noticing foreshadowing and looking for information I thought might be helpful to remember or make a mental note of before reading Iron Flame.I've had two people tell me that after reading iron flame they immediately wanted to go back and read Fourth Wing to find things that were said or foreshadowed and I cannot wait to dive on in.Also, I'd like to make note that I predicted the ending (like the very very end - think last few lines) the first time I read this book and I was SO excited to be right. I'm really looking forward to where this book, characters and THAT storyline in particular is going to take us.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 12, 2024",
                "reviewTitle": "Excellent",
                "reviewText": "This book was absolutly perfect, I loved it start to finish. I can't wait to read Iron Flame to know the rest of the story !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pedro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 4, 2024",
                "reviewTitle": "Muy entretenido",
                "reviewText": "La historia engancha y es muy entretenida. Yarros crea un mundo en el q los dragones y humanos luchan juntos, y en este primer libro cuenta como Violet entra en la escuela para ser ginete de dragón.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}