{
    "remaining_requests": 220,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Girl-Drank-Winner-Newbery-Medal/dp/1616207469",
    "body": {
        "name": "The Girl Who Drank the Moon (Winner of the 2017 Newbery Medal)",
        "price": "$9.89$9.89",
        "originalPrice": "",
        "rawPrice": 9.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Girl-Drank-Winner-Newbery-Medal/dp/1616207469",
        "soldBy": {
            "sellerID": "A1BBNKFMCEM1Z8",
            "name": "tLighthouse Books",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1BBNKFMCEM1Z8&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91kPVuEBUjL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kelly Barnhill",
            "link": "https://www.amazon.com/Kelly-Barnhill/e/B001JRVGH4/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "tLighthouse Books",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 26705,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 13 hrs 26 mins",
            "FREE delivery Tuesday, March 5 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 29"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b?ie=UTF8&node=4"
            },
            {
                "name": "Growing Up & Facts of Life",
                "link": "https://www.amazon.com/Issues-Childrens-Books/b?ie=UTF8&node=1084192"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Algonquin Young Readers; Reprint edition (April 30, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1616207469"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1616207465"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 12 years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 640L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 5 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.45 x 0.88 x 8.75 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,666 in Books (See Top 100 in Books) #4 in Children's Multigenerational Family Life #104 in Children's Fantasy & Magic Books #128 in Children's Action & Adventure Books (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 26,705 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Ogress and the Orphans The Witch's Boy Dreadful Young Ladies and Other Stories Also by Kelly Barnhill A National Book Award finalist and instant fantasy classic about a town, an ogress, a dragon, fifteen orphans, and the power of community, generosity, and books. “The wrong boy will save your life, and you will save his.” When the daughter of the Bandit King meets the son of a witch, can they trust each other enough to cross an enchanted forest and stop the war between their kingdoms? A sasquatch. A witch. An astronomer. And those dreadful young ladies. This exquisite collection of magical stories and a novella is perfect for teen and adult fans of Neil Gaiman, Kelly Link, Angela Carter, or Alice Hoffman.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e148605d-13dd-468a-a587-4fcffd37fc10.__CR0,0,4042,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de48a70b-6cb4-4988-acc1-9ba9a1dacab2.__CR0,0,4500,4500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/976ff8f6-1e05-4b59-9a70-5bab8251a188.__CR0,0,4500,4500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e8075db0-fe0c-4435-bc93-ceacde753486.__CR0,0,4500,4500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0071ac20-ddef-479a-852a-0a2399c70f47.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/920c61f6-d9f7-496b-abd0-b990f8276eb2.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62452af0-a517-414f-9a2d-36a95e6c3dab.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQBSRAQUBD7RZJP75COOZANU4VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23IML0MO3GPX9?ASIN=1616207469",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars The best book I've read in a long time!",
                "reviewText": "I loved this book so much. It is a great fantasy book with hope and love and magic. I couldn't put it down. It is great for both kids and adults. Its a very creative plot with unique characters. Very original and will be a favorite for a long time.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kimberly J. Boyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6EVCKPFNLM6AX56SJR5QBRRPLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T5ESHPD2NU4Z?ASIN=1616207469",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars slow start for me, but so glad I finished",
                "reviewText": "This book is beautiful. I put it down, a few times, in the first few chapters, but when I decided to pick it up again, it was magic. Literally 😂, but also just so heartbreaking and hopeful.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ajs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGQICCQ5ESXC67G5QJSFYZHPAAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BO6T4AUS605N?ASIN=1616207469",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2018",
                "reviewTitle": "5.0 out of 5 stars Sorrow is a dangerous thing",
                "reviewText": "This may sound crazy, but “Sorrow is a dangerous thing” indeed.Upon reading the chapters which makes this novel begins to be interesting (where Luna starts searching for her Grandmama / Xan), at Sunday afternoon I was trying to accompany my youngest daughter to take a nap, she usually will get cranky if she is lack of sleep, so I tried to persuade her to sleep all the while I was sleepy too. But like any child at her age, two and a half years old, she was still full of energy and never even close her eyes, instead she jumped on the bed all the time and asked me to play with her.Of course I was angry, I was sleepy and had a small headache, I was furious at her. But she kept smiling at me, she kept asking me simple little questions like: what is this thing father? In the end, she was awake and kept playing, while I left her with my wife and I went to the store. I was still mad at her.Mad is close to sorrow.At night around 10:30PM, while she was sleeping, she suddenly awaken and started crying without the usual reasons (hungry for a milk, wet her bed, etc.), she just cried and cried asking for her mother to lay in bed next to her. My wife tried sleeping besides her, but my daughter kept crying until my wife mad at her and raised her voice at our crying daughter.I was reading the thrilling part of the book where Luna met the Head Sisters (Ignatia the Sorrow Eater) for the first time, I didn’t notice it first while my daugher was crying, but it hit me shortly after: she must be really sad, she must have had a very bad nightmare, she didn’t know how to explain it to us, and we didn’t realised that too.I realised it because I was reading the part where Xan just realised why the sorrowful fog is hanging on the Protectorate all this time, after Antaine told her the story of the Witch in the woods while Xan is transformed as a swallow.It just hit me, at that moment at that time when I was watching our daughter cried and sobbing next to her angry mother. Why didn’t I see it, is what I said to myself just like what Xan said to herself in the book.Sad is sorrow.She was just extremely sad, most probably because of a very bad nightmare, and she needed our touch of love. So I lifted her up into my arms, held her and kissed her, she was still sobbing and kept asking for her mother instead. After a little while she was calming down a bit, and I told my wife all of those that hit me, she felt so sorry and held our daughter while sleeping together.Our daughter stops crying instantly after my wife kissed her and carressed her, and she slept instantly in the arms of my wife. After that she slept so soundly until morning.“Sorrow is a dangerous thing”, how that is so true.My little daughter was trying to cheer me up at noon, I wasn’t aware of that, instead I was mad at her.She was sad and cried because of it when she was sleeping, me and my wife didn’t realised it, but thank goodness I read this book and somehow an angel whispered to me so that we may understand and hold our youngest daughter with our arms, blanketed her with our warm love and care.Just like how Xan loves Luna, Glerk and Fyrian. And how they loved her back, unreserved and whole heartedly too.Thank you for the book, the story, and especially the love you put to write it down. It reached me, ever so subtly, and now I’m going to pass it along to my family too. Hopefully other readers will be touched too.My only critic for this book is it could be so much better, the author has created stories and characters (with their background story) that intrigued me to see how they’ll reveal more of themselves. Like Ethyne, how she can become so fierce and influential to the other Sisters, I thought she’s a witch too, but the story ends without any further explanation…And my credit for this book is even for a short time the author is able to make a genuine affection between the characters, and the readers will feel it too, especially the ending.“Sorrow is a dangerous thing,” this isn’t just a made-up phrase for a novel, it’s true in real life.",
                "reviewVotes": "65 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teeker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYLVU7JBYZDYNKUU4M5XN7QHIYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17C1VFHR0M0O1?ASIN=1616207469",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Fantasy with a Plot and Symbolism",
                "reviewText": "This book assumes the reader will find dragons, giants, monsters and witches as \"normal\". If you don't like magic, don't read this book. It's a Newbury winner for sure. In my opinion, it got the award because it crafts in symbolism, hidden meanings, \"karma\" and so much more. There's mystery that you (as the reader) can figure out, plus some that you might not have guessed along the way. The book was not always a \"can't put it down\" type of chapter book, but it kept me entertained while I was sick and bed. I would recommend this book to kids in late elementary or middle school who like fantasy, female characters, and a little bit of mystery.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P. Blevins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5OZRDARE5O55VBCRBHWGYCO5WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NTOFCO0O898Z?ASIN=1616207469",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars good book",
                "reviewText": "great gift",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Estes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRZ3W72BWDLG3PNBEQXYXT7VVGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNPMFSK0UNCYD?ASIN=1616207469",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Very deep and surprising story",
                "reviewText": "This story talks about a theme that I don't find often in fantasy. A lot of fantasy is about miracles, hope that comes in the nick of time. This one is about resurrection, redemption, and forgiveness... Hope that comes too late... Or how we all support and love each other well, even when the damage is already done. How to love well and turn bad into good.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nina Levine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEAWT4PT4HUF2QM2K6N535NNJRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1C9I7WSOEFBBJ?ASIN=1616207469",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Spunky girl on a quest",
                "reviewText": "To save her family, a young girl sets out on an impossible adventure. With a huge heart, an imagination to match, she finds friends and hope along her arduous journey, a journey fraught with dangers and challenges at every turn.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Xela",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJ2C4URL6ZCCEXXLF6NBEMKRZQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR8LPQTSF71KH?ASIN=1616207469",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 18, 2018",
                "reviewTitle": "5.0 out of 5 stars A wonderful book for all ages",
                "reviewText": "At the San Francisco Writer’s Conference 2017, I heard this book repeatedly recommended by the agent Mary C Moore whenever discussing middle grade fantasy. After the conference, I put it on my reading list. In the past, I had the opinion that the best books are children’s books: an opinion that had faded of late. This book reaffirmed that faded opinion.The first thing that struck me was the writing. It’s frequently said, of course, that every line must serve a purpose, drawing the reader in. Yet I can’t remember the last time I read a book that executed that theory so well as this one did. From the start, the characters and their conflicts are crystal clear; and with a baby being sacrificed to a witch that the Elders know does not exist, the stakes are high. I only felt the story slow down as the writing took time with characterization in chapter two, when we meet said non-existant witch and her magical companions.The second thing that struck me was the diverse age range of our cast of characters. There is the elderly witch; the child that she adopts; the teen-turned-young-man that defies the culture of sorrow of the town in which he was born and raised; and the middle-aged woman who lost her daughter. Each of these characters is confronted with problems of their age. The child wants to find out who she is. The young man learns to push past his mother’s expectations to find a vocation he loves and the love of his life. The middle-aged woman has lost sight of the young woman she used to be in the face of the soul-rending grief of losing a child. The elderly witch is faced with her own mortality.I was also struck with admiration by the time course of this book, which takes place over the course of thirteen years. Of course, there are many stories that do this: Harry Potter and In Malice, Quite Close are only a few examples of books that begin with a set up a decade or more before the meat of the story begins. However, I am accustomed to such stories dedicating only a chapter or two to the set-up before diving into the main meat of the story. This is not so in The Girl Who Drank the Moon. Here, we are nearly half way through the book before we hit the “present,” or the meat of the story. Yet the first half of the book—covering nearly 12 years in the lives of several characters—felt neither tediously lengthy nor overly rushed.Barnhill doesn’t necessarily elaborate at length about her characters or her world. Yet she chooses her words with exceptional skill, weaving a simple world infused with depth to the reader who cares to look beneath the surface.This, I thought as I read, is what truly makes a children’s book ageless: a story so simple that children can enjoy it, but infused with so much depth and complexity that it can be meaningful at any age.The foremost theme from the onset of this book is Sorrow. The people of the town live their lives buried in sorrow and grief; meanwhile, the witch does not allow herself to feel sorrow. In the book, of course, there is a supernatural reason behind this. Taken at face value, one might interpret the story as a manifesto against the human tendency to sink into sorrow or grief. However, I don’t choose to see it that way. At the end of the book, sorrow has ceased to be a liability as it was in the past. The town is no longer perpetually sunken into grief, but nor is there a need to prevent oneself from feeling sorrow for the sake of self-preservation. I choose to see the theme as demonstrating the futility of either extreme: for while they do not wallow, there is still sorrow in the end, though it is presented in a form more complex than any previous form.The world and the story, though original, had a familiar feel to them that made them highly accessible and an easy read, but nevertheless one that made me think.I highly recommend this book.",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Excelente ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 4, 2024",
                "reviewTitle": "Exatamente",
                "reviewText": "Adorei",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kimberlyn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 3, 2024",
                "reviewTitle": "Review of The Girl Who Drank the Moon, by Kelly Barnhill",
                "reviewText": "Format: HardcoverGenre: Fantasy/YA/Childrens/MagicReview: I started reading this book with my 11 year-old daughter. She, like her mother, loves magic, fantasy, the moon, and the stars, and this book seemed like the perfect one to capture her attention (she isn't big on reading). And for awhile, it was. We made it to chapter 13 (about 1/4 of the way through the book) before some more violent descriptions, blended with my, ahem, rather dramatic reading style, scared her too badly for her to continue wanting to read the story. Despite being very into it myself at that point, I put it to the side in the hopes that she would come around. She never did.So, months later, I picked it back up on my own and binged the rest of it.The Girl Who Drank the Moon is a perfect blend of darkness and light. We see both the good and the bad in humanity, the love, the kindness, the care, but also the fear, the decisions made from places of desperation, and the decisions made from places of control. There are no one-dimensionally \"good\" or \"bad\" characters in the story. All of them are \"flawed\" to some degree. They are all so very human. Even the very worst of the worst show gentleness and warmth towards certain characters, care and love that they may not want to feel but undoubtedly do. That raw humanity is what makes the book so powerful.Not that alone, of course. Kelly Barnhill is a great writer. I probably don't need to mention that - after all, she won the Newbery Medal for this novel. But I will reiterate it. She's a great writer. Her style draws you in and keeps you reading, which is especially important in books aimed for children since their attention spans can be incredibly limited. The skill she has when weaving her words together, blended with the strength of her characters, makes this a powerhouse of a children's novel.Am I upset that my daughter couldn't finish it? No. Perhaps disappointed, but not upset. I hope that in time, she'll come back to it on her own. She'll decide when she can face the darker aspects this book brings to the fore. Until then, it will sit on my shelf, a lovely reminder of time spent reading with my little girl, and a story that I won't soon forget.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "San",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 3, 2024",
                "reviewTitle": "pageturner",
                "reviewText": "Excellent read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pravin Periwal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 25, 2024",
                "reviewTitle": "Amazing book",
                "reviewText": "It's a great book I love it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mario GranaMario Grana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 27, 2021",
                "reviewTitle": "Superó expectativa",
                "reviewText": "Seré honesto: compré este título por desenfado y por consecuencia de verlo continuamente recomendado. No tenía expectativa aunque sí un par de prejuicios que, agradezco ahora, han sido eliminados.Esperaba de esta obra la historia típica orientada a pequeñas niñas o jóvenes adolescentes, donde el factor mágico de la historia se explotaría a niveles \"cursis\", utilizando el factor \"mágico\" como elemento sobrenatural de la narrativa, más como un atractivo de gancho que cumpliendo su papel en la estructura del mundo ficticio. Estuve equivocado.Kelly Barnhill presenta inmediatamente una narrativa limpia y un universo literario bien cimentado, esto es, congruente y coherente. El factor mágico no es sólo un \"atractivo\" sino medio para desarrollar la muy agradable, y lo digo con todo énfasis, historia en que se desenvuelven y desvelan los personajes.Fue tan grata sopresa verme equivocado en mis prejuicios que, si acaso tengo un \"pero\" que decir de la historia, es que personalmente considero que Barnhill debió entregarnos esta obra en 2 volúmenes, para satisfacer esa \"inevadible\" necesidad por más: más y más todos los lectores, me atrevo a decir, querrán saber sobre este gran universo, sobre sus personajes, sus antecedentes, los paisajes y la historia de ellos. Por ello esta novela se me antojaba y se me sigue antojando para explorar más el mundo que construye Barnhill... sin duda una sequela o precuela será tan exitosa como éste título.Sobre el libro en sí, tengo un par de quejas... La selección de hojas de bajo gramaje en la edición de tapa dura, es una situación de gusto personal, porque la mancha de la tinta se trasparenta mucho, debido a este gramaje, es decir a que las hojas son ligera pero notablmenete muy delgadas.Otra queja es que la caja tipográfica pudo haber sido un poco más amplia y permitir así un puntaje mayor de la letra, que no es muy pequeña en sí pero los márgenes interiores, como se observa en una de las imágenes compartidas, son muy pequeños.Algo muy satisfactorio de esta maquetación fue la elección de la tinta en el \"cubre portadas\" o \"guarda polvo\" o \"fondo\" según lo conozcan. Se utilizó una tinta cuyo nombre no conozco pero de textura \"mate\", de esa que es mucho muy agradable al tacto por su sensación suave y \"afelpada\" ¿quizá? Pero l o contraproducente de este cubreportada, como con todas en ediciones de tapa dura, es que (personalmente) me dificultan sostener el libro por constantemente resbalarse. Pero esas son nimiedades.El libro es altamente recomendado para todos los amantes de la literatura fantástica. Y como en toda obra bien escrita, la edad es irrelevante: tanto adultos como jóvenes o niños, se encontrarán completamente inmersos y no podrán fácilmente dejar la lectura.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91kDsZF+ZEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81tY+KfEM0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81wiVbvAzgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81yV2Yz0SBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81gD3FECcHL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.40",
                "sellerName": "ZBK Books",
                "sellerRating": "4.5"
            },
            {
                "price": "$9.59",
                "sellerName": "bookmasters444",
                "sellerRating": "5"
            }
        ]
    }
}