{
    "remaining_requests": 271,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Babel-Necessity-Violence-Translators-Revolution-ebook/dp/B09MD95S5V",
    "body": {
        "name": "Babel: Or the Necessity of Violence: An Arcane History of the Oxford Translators' Revolution",
        "price": "$15.49",
        "originalPrice": "",
        "rawPrice": 15.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Babel-Necessity-Violence-Translators-Revolution-ebook/dp/B09MD95S5V",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/A1lv97-jJoL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "R. F. Kuang",
            "link": "https://www.amazon.com/R-F-Kuang/e/B0788VXRHP/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 12324,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09MD95S5V"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Harper Voyager (August 23, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ August 23, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 9770 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 557 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,468 in Kindle Store (See Top 100 in Kindle Store) #10 in Historical Fantasy (Kindle Store) #12 in Alternate History Science Fiction (Books) #15 in Magical Realism"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 12,324 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Poppy War The Dragon Republic The Burning God Yellowface The Complete Poppy War Trilogy A powerful historical military fantasy, inspired by the bloody history of China’s twentieth century and filled with treachery and magic. Rin’s story continues in this acclaimed sequel to The Poppy War—an epic fantasy combining the history of twentieth-century China with a gripping world of gods and monsters. The exciting end to the Poppy War trilogy, R. F. Kuang’s acclaimed, award-winning epic fantasy that combines the history of twentieth-century China with a gripping world of gods and monsters, to devastating, enthralling effect. A chilling and hilariously cutting novel about identity, white lies, and ambition from R.F. Kuang, the #1 New York Times bestselling author of Babel. From R. F. Kuang, the #1 New York Times bestselling and award-winning author of Babel and Yellowface, this collection features all three novels in her historical military fantasy trilogy!",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28fd312e-dde1-4ba3-af69-8fcf4792bdaf.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1857ab89-1355-4753-8c81-8de2396e6823.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ece9fe9-bf25-4e64-b539-996dca0ec791.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cc07abb6-a8d7-4f62-a807-7b6f644f216a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a20c3d7-128c-4d28-b742-0d7d30ddfe53.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a8368cc-ee08-49f6-b55e-d1e4368a7ed0.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3dcf5cd6-e7ef-414f-b1df-23ef266f5f78.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c30f1a3-e145-4126-832e-0d2bc82a0ad6.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/113c6079-1322-4432-9440-91973b7ee15f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b4df3089-7b9d-4e1d-a36c-1a965271ed85.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7170470e-c2e9-4fa8-8493-7cdc9ef94a1c.__CR18,0,369,738_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dalton O",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMLWT5Q7NPUTTCCEYVYPVZFFCOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OO0HVBQJMQCF?ASIN=B09MD95S5V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Well Worth The Hype",
                "reviewText": "\"Babel: Or the Necessity of Violence: An Arcane History of the Oxford Translators' Revolution\" is a remarkable literary work that delves deep into various facets of translation, colonialism, and their real-world implications. I saw this recommend on TikTok so many times and was going to ignore it because TikTok recommendations are a very specific brand of content that I don't usually enjoy, but the recommendation for this one was so remarkable that I felt I had to see for myself. One of the standout features of this book is its insightful commentary on colonialism. The parallels between translation and colonialism are clear and obvious, without being condescending. I found it to be a beautiful and thoughtful workup that really encourages the reader to explore what it means to exist in the systems we've created. Even though the book is obviously fictional, the principles are real and current. Through well-researched examples and analysis, the book sheds light on the complex relationship between language, culture, and colonialism, making it an invaluable resource for understanding this historical context. Beyond being a historical account, \"Babel\" demonstrates the real-world applicability of its themes. It draws parallels between past colonial practices and contemporary issues, emphasizing how the legacy of colonialism continues to influence our global society, which isn't a new idea for some people but needs frequent reminding I think. The book's narrative is infused with a sense of tragedy, as it explores the injustices and suffering caused by colonialism and this emotional depth made personal through the unique and nuanced characters of the story adds a powerful layer to the storytelling, making it a thought-provoking and emotionally resonant read. I cried a lot but mostly felt a consistent heartache throughout that literally never got better. The whole story is so tragic and yet so understandable- so realistic- which makes it all the more devastating. I felt incredibly resigned throughout the whole book. The author's incredible talent for foreshadowing and painting parallels gives you a very clear idea of where the book is going from the beginning and even so, like any incredible writer, you are still devastated when you get there. I couldn't help but invest myself in hope, even knowing where things would end. \"Babel\" also impresses with its meticulous research and intellectual rigor. The author's depth of knowledge and scholarly approach shine through in every chapter. The book is not only informative but also intellectually stimulating, inviting readers to engage deeply with its content. I enjoy all the context for actual translations.To summarize, \"Babel: Or the Necessity of Violence: An Arcane History of the Oxford Translators' Revolution\" is a masterful exploration of translation, colonialism, and their lasting impact on our world. Its excellent commentary, real-world relevance, tragic undertones, and scholarly depth make it a must-read for anyone interested in the intersection of language, power, and history.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Em",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVVGTNKR3H3WPCE3JXS5KZEA3KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSG6MHHQFGM57?ASIN=B09MD95S5V",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "4.0 out of 5 stars must read",
                "reviewText": "This books was amazing. As someone who doesn’t care too much for reading history (this being a historical fantasy book), the first half of the book was a bit slow paced for me. Which isn’t to say I wasn’t immediately intrigued, my interest was quickly grabbed. But this is the only reason I’m rating it 4/5 stars. EVERYTHING ELSE ABOUT THIS BOOK WAS AMAZINGThe characters and their relationships with each other were so multi-dimensional, I truly felt like I knew these characters myself. The fantasy world building was insane to read. RF Kuang has written this story at a pace which allows the reader to really understand the integral parts of Silver Working, and show how it’s created, how it’s implemented into society, how it fails, etc etc etc.The translation aspect was mind blowing. As I was reading, I just kept thinking to myself “how much research had to go into writing this book?!!” I really enjoyed how the nitty-gritty parts were written in the form of lectures. I also learned a great deal about how connected languages are (which of course I knew languages evolve from one another, but I never realized how linked they ALL are). The footnotes were really interesting (read: good) additions to the story. I liked how Kuang used these to provide a backstory/support to some scenes, as well as just plain remarks on what was happening.The colonialism aspect to this book…. was just insane. The way Kuang wrote everything (and I mean EVERYTHING) to relate back to the systemic oppression that stems from colonialism was just so impressive. I mean, every single mark was hit with this.I know this book won’t be for everyone, just with how heavy handed the history part is, but I truly believe everyone needs to read this book.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXIVJMDXROT6ZAKWXBSXZICNZUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLLSCN70K4W1T?ASIN=B09MD95S5V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars The necessity of violence...",
                "reviewText": "When the Empire meets its conquered inferiors, the Empire's superiority is never doubted. That there may be value in the conquered, non-white inferiors, is not considered. That is why violence is the only path for the interiors to be seen, to make change, and to convince the Empire of its vulnerability.Robin is half-Chinese, raised in China until the sort of illness born of poverty kills off his family. A benefactor, an English professor who had paid for his education, whisked the boy to England. There Robin, who looks English, continues his education and is prepared to go to Oxford, to study in the Tower—Babel. The secrets of language are unearthed there, meanings and connotations prodded and molded to be understood fully. Once the student is ready and the words are fully examined, the words are combined in pairs to be inscribed on polished silver bars. In 1820 England the bars power rail lines and carriages, passenger ships, and warships Permanent lanterns light the dark. Mills are powered to produce more cloth which causes massive unemployment. More production requires more cotton—which requires more slaves—not in England, where abolitionism has won the day—but in the Americas. All over the world, Britain's colonialistic power draws riches to the Crown but also to the great companies that thrive under the system. And it is all built on the silver that Babel needs to use the words to run the Earth in Britain's image. Under it all lie the colonized lands and their oppressed peoples, all of whom work to support the Empire.Robin and three other scholars enter Oxford together, cohorts in their studies, companions who enter the world of Oxford unaware of how much will be demanded of them.Themes of world power, colonialism, racial inequity, class, and most of all, superiority and inferiority based on blood and money—all weave their way through the story, leading to an inevitable clash of destructive interests.Because the well-chosen historical facts are combined with well-crafted twists and inventions of near-history, it is so simple to slide into a world that is familiar but also exotic and bizarre, a world when casual cruelty is perfectly acceptable unless you are of the wrong class or color. The genre is a blend of science fiction/fantasy based in historical fiction that verges on brief moments of horror when British civility slips into moments of brutal inhumanity.This is not an easy read. It takes concentration and the ability to just suspend disbelief in a slightly more bizarre intensity than one might be prepared to do. The author is Chinese and studied linguistics and languages in elite British universities. One wonders how much of the anguish of intense study was her true experience.I found the book fascinating. I recommend it to those who will approach it with the resolve to understand the four young scholars as they learn to love and then hate the place that brought them together to study language from the inside out.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carollizc",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 8, 2024",
                "reviewTitle": "Great book!",
                "reviewText": "Babel: Or the Necessity of Violence is not only a great book, it is great literature. It deserves to stand with such classics as Oliver Twist and Uncle Tom's Cabin.The book itself is not a difficult read, although difficult to put down. The characters are real human people, as they begin to learn the world around them. They begin in adolescence, as we all do, struggle just as modern students do, with coursework, and the burden of trying to get the best marks they can, and the terror that they won't.Robin Swift, the protagonist, is the half Chinese son of an Oxford professor, plucked from poverty and despair after the death of his mother from cholera. This man will never treat Robin as a son and will never acknowledge him, but that just makes Robin work all the harder in hopes of pleasing him.At Oxford, he meets the other three members of his cohort, an Indian boy, Ramy, a Jaitian creole girl, Victoire, and Letty, who is upper-class English, but estranged from her family because she is attending university. They are there because they are destined to become Translatorthosefew who can understand multiple languages well enough to work the magical silver bars that keep everything in the Empire running as it should. Gradually, they all learn of the injustice the British Empire has inflicted not only on them, personally, but their countries of origin. Three of them become willing members of Hermes, a clandestine group of current and former members of Babel Tower, where translators study and work. They learn that without the translators, the Empire would collapse. Among the Hermes members Robin encounters is Griffin, his half brother, now disoen3d by the professor who brought them both to England.I loved this book. Becoming an adult is never an easy thing. Adolescence is a chrysalis time, when who we are is yet unformed, but we have already become more than our parents' children. We learn many of the same difficult truths as Robin and his cohort do, that the world we thought we grew up in is not the real one. And the author lets us experience that with them. There is plenty of action and plenty of tender moments besides.R.F. Kuang leads us into asking ourselves who must suffer to produce the things we need and desire and who profits along the way. We learn to question ourselves as the four friends do, and if the answers are not comfortable, that's the price of growing up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LL ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 2, 2023",
                "reviewTitle": "Great book",
                "reviewText": "It looks a bit cheap but it’s reasonable for the price",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 5, 2023",
                "reviewTitle": "Maravilhoso!!!",
                "reviewText": "Intrigante demais e muito bem escrito, difícil ler um capítulo só, a história prende demais!!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Isabella D.Isabella D.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 10, 2023",
                "reviewTitle": "Il a l'air bien",
                "reviewText": "Je ne l'ai pas encore lu mais le livre a l'air bien et il a été emballé avec soin",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71tYxtmbWtL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peer Sylvester",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 17, 2023",
                "reviewTitle": "Historic Fantasy",
                "reviewText": "Ein Junge wird aus einer schweren Kindheit herausgezogen, um an einer Schule in England Magie zu lernen. Zusammen mit seinen Freunden bekämpft er das Böse.Nein, mit Harry Potter hat Babel nichts zu tun - und das ist auch gut so. Wo Harry potter eher einen \"Make up as we go\"-Ansatz verfolgt, merkt man bei Babel, dass eine enorme Menge Recherche in das Buch eingeflossen ist - und das World Building ist entsprechend dicht und kohärent:Babel spielt in einem viktorianischen England zur Zeit der Industrialisierung. Nur wird diese nicht durch Watts Dampfmaschine getragen, sondern durch Magie. Die Magie basiert auf Silber, das aus den Kolonien stammt, und auf Ungenauigkeiten in Übersetzungen zwischen zwei Sprachen. Entsprechend sind auch Englisch gebildete Übersetzer aus den Kolonien wichtige Bestandteile der Maschine - und genau das ist das Problem. Wo Sexismus und Rassimus reagieren, gehören auch die wichtigsten Säulen nicht dazu.In diesem Umfeld bewegt sich das Buch, entsprechend politisch wird die Geschichte. Dabei ist die Story nicht nur dicht, sondern auch spannend, denn die Autorin kann sehr gut schreiben.Ich finde es immer ein bisschen Schade, dass \"Alternative Geschichte\" fast immer bedeutet \"Jemand anderes hat eine Schlacht gewonnen\", gerade weil Geschichte so im allgemeinen nicht funktioniert. Babel erzählt wirklich in einer alternativen Geschichte und macht gerade deswegen wichtige Aussagen zu unserer. Und ist nebenbei ein verdammt spannendes, originelles Buch.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}