{
    "remaining_requests": 379,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Blood-Ash-Book/dp/B08CZXLBSQ",
    "body": {
        "name": "From Blood and Ash: Blood and Ash, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Blood-Ash-Book/dp/B08CZXLBSQ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51M TIzXbdL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jennifer L. Armentrout",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Jennifer+L.+Armentrout&search-alias=audible"
        },
        "brand": "Jennifer L. Armentrout&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 66538,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Captivating and action-packed, From Blood and Ash is a sexy, addictive, and unexpected fantasy perfect for fans of Sarah J. Maas and Laura Thalassa.A Maiden...Chosen from birth to usher in a new era, Poppy’s life has never been her own. The life of the Maiden is solitary. Never to be touched. Never to be looked upon. Never to be spoken to. Never to experience pleasure. Waiting for the day of her Ascension, she would rather be with the guards, fighting back the evil that took her family, than preparing to be found worthy by the gods. But the choice has never been hers.A Duty...The entire kingdom’s future rests on Poppy’s shoulders, something she’s not even quite sure she wants for herself. Because a Maiden has a heart. And a soul. And longing. And when Hawke, a golden-eyed guard honor bound to ensure her Ascension, enters her life, destiny and duty become tangled with desire and need. He incites her anger, makes her question everything she believes in, and tempts her with the forbidden.A Kingdom...Forsaken by the gods and feared by mortals, a fallen kingdom is rising once more, determined to take back what they believe is theirs through violence and vengeance. And as the shadow of those cursed draws closer, the line between what is forbidden and what is right becomes blurred. Poppy is not only on the verge of losing her heart and being found unworthy by the gods, but also her life when every blood-soaked thread that holds her world together begins to unravel. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23"
            },
            {
                "name": "Paranormal",
                "link": "https://www.amazon.com/Fantasy-Futuristic-Ghost-Romance-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13356"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "19 hours and 46 minutes"
            },
            {
                "name": "Author",
                "value": "Jennifer L. Armentrout"
            },
            {
                "name": "Narrator",
                "value": "Stina Nielsen"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 08, 2020"
            },
            {
                "name": "Publisher",
                "value": "Brilliance Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08CZXLBSQ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#135 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #3 in Paranormal Romance (Audible Books & Originals) #9 in Fantasy Romance (Audible Books & Originals) #19 in Paranormal Romance (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "diana jaycox (my friends call me DJ)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTD6EBTYNRGCUPIYJRTNB664LFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25GGAVV3DG54W?ASIN=B08CZXLBSQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars An epic fantasy romance with lots of tingles, thrills, and chills--WHAT A RIDE!",
                "reviewText": "I only picked up From Blood and Ash by Jennifer Armentrout because I was completing a reading challenge. The challenge was to read a book on the Goodreads Choice list, and frankly, From Blood and Ash was the one selection I thought I might tolerate! I like fantasy romance but find most seem written for the YA audience, a group I left behind many decades ago!I admit I was pleasantly surprised to discover how much I enjoyed this novel. Let's start with the incredibly designed cover art. The brilliant red roses on the black background immediately drew my attention away from the rather pedestrian covers of the other book selections. The large three-dimensional font was hard to ignore. The map drawn on the first page gave the world an old-time, Tolkien feel to the story. Though it is hard to see in the Kindle version, it was helpful to refer to as the story progressed. Some reviews mentioned that a glossary and character list would have been a welcome addition. I would agree I would have liked it in the beginning, but as I continued to read, I was so connected to the kingdom, the characters and the plot, I no longer needed the reference tool. I was as familiar with the people and places as I was with my own backyard!From the very first page to the last Jennifer Armentrout had complete control of my emotions. Her wonderous word choices had me in tears at times, laughing at other times; on an emotional roller coaster experiencing all the highs and lows as her characters did! Jennifer magically transported me into her beautifully created world. I went from being a reader to being a participant, totally immersed in her story.The main characters, Poppy and Hawke, were intriguing. Poppy's transformation from a powerless tool of the ruling class to a determined warrior woman gave me chills. The tension and suspense as she took back her right to self-determination had me clenching my fists, as I prayed for her success. Hawke, with all his sexy devil-may-care personality, kept me guessing the entire book. Was he good or too good to be true? I confess I am still not sure! But the pairing of these two strong characters amped up the energy levels, to the point I was surprised that the electricity between them did not set the pages on fire.What started as a challenge to read something new became a wild, twisted ride through the author's creative imagination! An epic read, well worth the hours I spent reading it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tlozo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJT55XDKDBKBRDLGMSGRGQDCI6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT0JNC2E7QO9P?ASIN=B08CZXLBSQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Epic Storytelling",
                "reviewText": "This is by far one of the best book series I've ever read. I'm currently midway through 2 Queens. The detail to the characters, scenery, events and story plots is simply exceptional. The storylines unfold with so much intrigue, to keep you the reader completely captivated!!! And the characters, oh they are just so everything, each one multidimensional. I have found myself laughing out loud. Slapping my hand over my mouth in shock and sighing in awe. I've been an avid reader for 40 years and this is some of the best story telling I've read. I hope someone picks this up as a screen play it would be epic!! Well done Jennifer!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sydney Fowble",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUK7J6MGE2HSWQRDHOTRMO3OKOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FEQ3O2O4RA16?ASIN=B08CZXLBSQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Pleasantly surprised!",
                "reviewText": "⭐️⭐️⭐️.75/5🌶🌶.75/5I admit, I was hesitant to read this book. It seems like people either love it or hate it, and I was worried I'd end up in the latter camp. I love fantasy romance, but one thing I've noticed is that a lot of the popular books and series have rather lackluster writing, and that was my biggest concern going in.From Blood and Ash is the first in a fantasy romance series and follows our narrator, 18 year old Penellaphe (Poppy) Balfour. She is a Maiden, and is destined to 'Ascend' as a gift to the gods, and ultimately, save the Kingdom of Solis. Poppy also has a gift, she can sense a person's physical and mental pain, and by touching them, relieve them of some of it. The Ascended are essentially the ruling class over the kingdom, however they are very mysterious. Poppy lives a life where she is expected to be sheltered; speak only to a few, remain completely covered, never leave the castle, never be touched, etc. However, she is not so good at playing this role. She knows how to fight in hand-to-hand combat, and carries a dagger (we love a stabby woman) and often sneaks out. At the beginning of the book, she leaves the castle one night and ventures to The Red Pearl, a notoriously debaucherous tavern. There, she meets a royal guard who ends up kissing her, and thus begins Poppy's internal investigation on whether or not she truly wants to become the Maiden.There is strife in the Kingdom, because another group, The Atlantians, led by \"The Dark One\" are said to have plagued the earth with dangerous creatures called Craven. A group called The Descenters are supporters of The Atlantians and want to see the downfall of the Kindom. Each group believes the other is responsible for all their issues. The Descenters/The Atlantians would also like to see the Maiden killed.After one of her personal guards is killed by a masked man, Poppy is assigned a new guard, Hawke (they guy from the Red Pearl). Poppy is practically instantly in love with him and decides to essentially throw all of her Maidenly duties out of the window for him. She is forced to decide if she should fall to temptation and live her life for herself and risk being found unworthy of the gods, or give up all of her freedoms. Fast forward, after a deadly attack on the castle by the Descenters, Poppy is called by the queen to arrive to the Capital sooner than anticipated, and likely to speed up her Ascension. During the treacherous journey from the castle to the Capital, it is revealed that not everything (or everyone) is truly as it seems.Alright, on to my review. I was pleasantly surprised that the writing was better than I was expecting. Was it fantastic? No, but it wasn't bad enough to the point where it drew me out of the story over and over. There were a few grammatical and syntactical errors that were a bit confusing, so the editing could have been a bit better, yes. I also wish that there had been a map (every fantasy needs a map; they look cool and are super helpful) and perhaps a glossary because there are A LOT of different people, events, groups, etc. etc. and that was difficult to keep straight in my head. I wish there was a little more world-building to make things a little clearer. The political intrigue was interesting.Overall, the characters were pretty good. Poppy is interesting, although she is not nearly as sheltered as JLA tries to make her out to be. She's an excellent fighter, she's witty, and swears. She is definitely naive, but I think that's because she's 18. Hawke was of course hot, but his idea of consent was definitely in the grey area.The 🌶 were not over the top and were written well. There was a loooot of tension between Poppy and Hawke which I loved.My one petty gripe was the names she used for people and places. Penellaphe instead of Poppy. The Atlantians. A black character named Tawny. Things like that.Overall, I did enjoy this book. It's not perfect, but most books aren't. It definitely has some faults. I am definitely planning on reading the rest of the books in the series and the FBAA world, and I'm looking forward to them, feeling hopeful.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer C📲📱🔖📚📖",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHR7QDRVSY4OPBD6WQXOLO6PZZVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AB59W4XYHTKY?ASIN=B08CZXLBSQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Penellaphe or Poppy",
                "reviewText": "Poppy is asset. A maiden. Poppy is a useful or valuable person regarding her values, her powers, A maiden savings others , a whole kingdom with her gifts, her heart, and soul. That securities she gives the people. She is well known as a gifts from the gods.She Will get mixed up in a military fight & be kidnapped by her personal guard Hawke Flynn, but it more twists. With the fighting between others Kingdoms of different biological kingdoms. This story is amazing as you continue reading. I didn't know how much I would enjoy this book delightful plot, but, I really want to go into the next one called ,\"A Kingdom of Flesh and Fire.\" Second book by Author Jennifer L. Armentrout. The Blood and Ash series.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bry",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 17, 2024",
                "reviewTitle": "Great book!",
                "reviewText": "I really loved this as a first book and it got me hooked to read the second one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tay_LT",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 15, 2022",
                "reviewTitle": "Uma fantasia diferente, envolvente e com boas surpresas na parte final!",
                "reviewText": "Depois de ler as fantasias escritas por Sarah J Maas, é muito difícil gostar muito de outros livros do gênero, tendo em vista que ninguém sabe construir um mundo tão complexo e com criaturas e personagens tão distintos como ela ou trazer aquelas reviravoltas inimagináveis pelo leitor.Entretanto, a autora desse livro surpreende ao chegar perto do nível de Sarah, pois consegue criar um enredo muito envolvente a cada capítulo, interessante, diferente de tantos outros e com elementos bem inesperados.Em um mundo dominado pelos Ascendidos, seres escolhidos pelos deuses para serem abençoados a viver por muitos anos com habilidades sobre-humanas, conhecemos Poppy, a donzela do reino, também abençoada pelos mesmos seres para ascender e permitir a ascensão de tantos outros nobres.O grande problema é que esse papel que parece ser tão honroso vem acompanhado de uma intensa repressão, já que ela não pode mostrar seu rosto ou conversar com ninguém além de seus guardas e dama de companhia, ir a qualquer lugar que queira ou usar seu dom para ajudar outros, atividades tão normais a outras garotas.Quando ela conhece Hawke, seu novo guarda, tudo muda, porque ela começa a querer ser muito mais do que é e realmente ser capaz de escolher como viver, o que leva a escolhas inesperadas e descobertas impactantes sobre a verdade do mundo que nunca questionou.É um enredo muito bem construído, que instiga a cada momento e acaba se tornando algo muito diferente e maior do que aparenta ser em boa parte da história, sendo capaz de intrigar e surpreender bastante o leitor. Muito bom!Obs. c/ spoilers dos próximos livros: Como já li os quatro livros disponíveis da série e tive uma grande decepção, adianto para quem interessar possa que a autora destrói no quarto livro totalmente o relacionamento de almas gêmeas dos personagens principais construída nos três primeiros livros para transformá-la em uma relação a três deturpada e totalmente incoerente com tudo que havia sido escrito e desenvolvido anteriormente.Ela vendeu uma mentira nos três primeiros livros da história, porque o tipo de relacionamento que ela construiu jamais poderia incluir uma terceira pessoa em qualquer nível.Infelizmente, ela conseguiu estragar uma das principais premissas da série, desperdiçando uma história com um enorme potencial.Não vale mesmo a pena gastar tempo e dinheiro lendo os outros livros para ver esse rumo infeliz que ela dá ao enredo e aos personagens. Uma grande pena!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 18, 2024",
                "reviewTitle": "the name princess is my weakness",
                "reviewText": "That was honestly the main reason to why I even ordered it, the amount of times Poppy is called princess. One of the main characters reminds me a lot of Damon from Vampire Diaries, you'll know once you read it.Great book, finished it in under a week after not reading a single book in 10-15 years. Ordered the 2nd book in the series already.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ugo Anzoino",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 11, 2023",
                "reviewTitle": "Bellissima serie di romanzi",
                "reviewText": "Bellissima serie di romanziConsegna perfetta",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 7, 2023",
                "reviewTitle": "Oh boy",
                "reviewText": "I can’t stop screaming. I have no words about how much I loved this. The world building is complex and I absolutely love that. Hawke? I love him despite what happens. If you like slow burn romantasy, betrayals, touch her and you die MMC…read fbba",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}