{
    "remaining_requests": 376,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tress-Emerald-Sea-Cosmere-Projects-ebook/dp/B0BPNB19CL",
    "body": {
        "name": "Tress of the Emerald Sea: A Cosmere Novel (Secret Projects Book 1)",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tress-Emerald-Sea-Cosmere-Projects-ebook/dp/B0BPNB19CL",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71cGx5w0TxL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brandon Sanderson",
            "link": "https://www.amazon.com/Brandon-Sanderson/e/B001IGFHW6/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 9235,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BPNB19CL"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Dragonsteel, LLC (January 10, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 10, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 17090 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 443 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,053 in Kindle Store (See Top 100 in Kindle Store) #2 in Sea Adventures Fiction (Books) #3 in Romantic Action & Adventure #11 in Fantasy Adventure Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 9,235 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/4e1527c5-13bb-46e2-9b64-92c9fdb07843.__CR0,0,2696,1668_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/6266f2e1-63af-4840-bfce-4a60a76a25fb.__CR0,0,2696,834_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/0c759e9f-e5ee-4b2f-aff1-27f1ebbcbc37.__CR1,0,2695,1667_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A. J. Luna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFTMH74TVJDG4EFHEPH7IM564EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T8HE8K7V2OBT?ASIN=B0BPNB19CL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars A different perspective on a well known character",
                "reviewText": "What happens when you have an unassuming girl who loses the love of her life, and she chooses NOT to wait for him to save himself? Find out in this great take on a well known story about trying to save the one you love. Reverse the rolls, put them onto a strange and alien planet, and add in a touch of magic that lays just below the surface.Brandon Sanderson once again brings to life a great story from the fertile folds of his mind. This book, one in a long Cosmere series, can be read completely by itself, or as part of the larger series. The story stands by itself, and you will fall in love with Tress, Charlie, Huck and Hoid, if not for the first time, all over again. Grab a book and take a seat for a great story.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "a. h. maxwell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD4RI5WKQ4ARZA2U5FN6BB3RNEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R355C0SYOOEQW7?ASIN=B0BPNB19CL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars I wasn't sure about this at first ...",
                "reviewText": "Brandon Sanderson is, by far, one of the most talented & creative writers today. S I was looking forward to this book. But when I started, I was a little disappointed - it seemed very ... simple, almost appropriate for a pre-teen. I considered putting it down several times. But, it's Brandon Sanderson!! So I forged ahead, and am I glad. As I read, the story became more complex, the characters, more alive. Soon, I couldn't put it down, & now that it's over, I feel very, very full & satisfied. The simplistic writibg at the beginning was a metaphor for Tress, who starts the story as a simple girl. As she grows, as her life expands, so does the writing. So, it's more that just the story. It's the story structure that emulates the characters' growth. This is an amazing story, excellently written.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. A. Solinas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVIMKECEZDXXK5QIGX7KWJPN6DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T0R5NZ98U89I?ASIN=B0BPNB19CL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Sailing the sea of spores",
                "reviewText": "While the rest of us were gaining weight and getting depressed during the Covid-19 lockdown, Brandon Sanderson was doing what he does best: churning out books.And the first of these four surprise books is “Tress of the Emerald Sea,” a Cosmere novel that mingles quirky fairy-tale quests for a true love with the rough’n’tumble life of a pirate. Sanderson gives us a extraordinarily ordinary heroine who stumbles and triumphs on her quest, along with a talking rat, seas of colorful spores, and the occasional zombie doctor.Tress is a seemingly ordinary girl on a small rocky island in the green spore sea – she collects teacups, washes windows, loves her family, and regularly meets with the local duke’s son, Charlie. When the duke realizes that his son is in love with a window-washing girl, he whisks the boy off the island to marry a princess. When the duke returns, he’s got a brand new heir with a new wife – and Charlie is nowhere to be seen. He’s been sent off to the realm of the Sorceress in the Midnight Sea, which means he’s effectively doomed.But Tress is determined to get him back, so she smuggles herself off the island… and finds herself the prisoner first of smugglers, and then a crew of pirates ruled by the bloodthirsty Captain Crow. She also acquires a talking rat friend, Huck, who becomes her best friend and ally, especially since he knows some things about the Sorceress. Though the situation isn’t ideal, Tress believes the ship can get her to the Sorceress, and manages to work her way into the crew.But her plans are complicated when she becomes friends with several of the pirates, and learns some disturbing facts about Crow. How can a simple window-washer girl defeat a pirate captain, sail the deadly Crimson and Midnight Seas, escape a dragon and defeat the terrible Sorceress – all while learning the true nature of spores and aethers?“Tress of the Emerald Sea” is one parts fairy tale, one part pirate adventure, and one part Cosmere story (especially since the narrator is none other than Hoid, who plays a pivotal role). And the world Sanderson conjures is a fascinating one, where twelve moons produce a steady downfall of spores that form whole seas that wooden ships can sail on. But, much like a mogwai, never expose them to water, or very bad things happen.Since Hoid is the one telling the tale, the entire story unfolds in a quirky, laid-back narrative style, reminiscent of William Goldman or a more modern fairy tale. It’s arch, snarky and very omniscient third-person (Tress’s hair is once described as an “eldritch horror” bent on “disintegrating reality, seeking the lives of virgins, and demanding a sacrifice of a hundred bottles of expensive conditioner”). The only major flaw, ironically, is that self-same snarky tone – it sometimes becomes kind of overbearing, especially during the more serious parts of the story, and sometimes it feels like Hoid is hijacking the story.It also has Sanderson’s exceptional world-building, especially in the idea of the spores, which will immediately erupt into SOMETHING – air, vines, crystals – upon contact with water. And while Sanderson weaves in elements of the Cosmere, creating a more science-fiction-y world, there are elements of magic included in it, such as Huck. No, I will not explain what is up with the rat, only that not all is as it seems… as you’d expect with a talking rat.Tress herself is an exceptional heroine – smart, resourceful, determined, good-hearted and practical, with a nimble brain and a love for collectible cups. Her relationship with Huck is very wholesome and sometimes heartwrenching, as are her friendships with other members of the crew – a seemingly-zombie doctor, an assistant cannonmaster who never successfully hits anything, a cheery deaf man with a writing board, and the deadly, nihilistic Captain Crow. There are also Dougs, but we don’t care about them.“Tress of the Emerald Sea” is a charming, well-paced story that is a little too suffused in Hoid for its own good. For those seeking a rollicking pirate adventure with some wild fantastical twists, this is a must-read.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bradley Ouellette",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWFAOBWGMBAG2CAPWUNBOTPVUWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JFCA1HEJRDKY?ASIN=B0BPNB19CL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars I love Tress, It's cute, I've read it to my 2 year old daughter three or four times already.",
                "reviewText": "I love this book, I bought a second copy to give to a friend to get them to read it. I've read this while my daughter was falling asleep three or four times, she isn't really paying attention to the words, but I think its a great book for her to hear anyways.The character of Tress is not some extraordinary person like most books. She says over and over that she's just a normal girl, that takes on the task of saving her love from a witch. If you read Sanderson's books regularly the references to Hoid are great, but if not it doesn't really take away from the book, cause he's just a quirky background character then.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aurora Read",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI3T5GLV7EBPDXRNWUNC4ZHXWXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J5P5QRBOFT53?ASIN=B0BPNB19CL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Great world building and whimsical tale",
                "reviewText": "I loved this book! It’s my intro to Brandon Sanderson and the immersive world he created where the oceans are made of explosive spores instead of water took a while for me to visualize. But I could relate to Tress and her motives and the humorous narrative along with in depth explanations were enjoyable. I can’t wait for version of Hoid’s story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSE7GJW7THFNRM4A3ZY4T4NWVBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMS2TIHCRMX48?ASIN=B0BPNB19CL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars A great adventure!",
                "reviewText": "This book was wonderful! Such a unique storyline and perspective. I have been craving more adventures on the high seas since I finished. The journey was enjoyable and the twist! Brandon Sanderson has several novels on my TBR list and I am excited to start reading more of his work!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chari",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4ENNYB6BVULN7NQTUKOO7D7SYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R238KDRRUSVCK6?ASIN=B0BPNB19CL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful, Whimsical Story",
                "reviewText": "I've enjoyed some of Brandon's other books, but this one is a lot different. The tone is intelligent and witty and the story is a delight to follow. It does have a bit of violence and death, but it's an enjoyable adventure in a unique world and I think many will thoroughly enjoy it - I read via my public library first and then went on to purchase a copy to keep in my personal collection to read again later.As an added bonus, the end sheets are beautiful and the whole book is a work of art!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maureen Burgy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXSKR452M4VJFXQHOVAJOQ77NPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REWP02GT2PZTA?ASIN=B0BPNB19CL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "4.0 out of 5 stars Whimsical and fun",
                "reviewText": "This was my first Brandon Sanderson novel. I am usually a Romantasy reader. I enjoyed this - I felt like it did get slow at times with more \"technical\" explanations of the world and the way of things. I enjoyed the magic of the spore sea - not something I have ever read. And I did get sucked in after 1/3-1/2 and wanted to finish to find out what happened. Definitely recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G & M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 4, 2023",
                "reviewTitle": "superb",
                "reviewText": "Just a gentle yet rollicking ride. Wonderful brain treats interspersed with adventure, love, hope and excitement.Great. Book. Read it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brandon Perea",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 14, 2023",
                "reviewTitle": "One if my favorite books ever!",
                "reviewText": "I'm quite familiar with Sanderson's work, but this one has become a favorite of mine very quickly.His humor really comes through, if you have read Alcatraz vs the evil librarians, it's just like that but a bit extra. And I love it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ISL",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 25, 2024",
                "reviewTitle": "Amazing",
                "reviewText": "Brilliant absolutely brilliant I've read the 1st 2 books of this series and ther absolutely 1000% amazing. This book is strange to say the least but highly entertaining and the characters are well written. I'm in book 3 know and thisnkust shows his imagination is truly unique",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis Garcia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 19, 2023",
                "reviewTitle": "Libro muy entretenido",
                "reviewText": "Buen libro para disfrutar de una lectura entretenida",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 4, 2023",
                "reviewTitle": "Liked it very much",
                "reviewText": "Brandon sanderson delivers again.Great storytelling and a fantastic world with old friends on it.. great for fantasy fans as always.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}