{
    "remaining_requests": 166,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tools-Ghost-Urban-Fantasy-Novel-ebook/dp/B0BMGXPZ5F",
    "body": {
        "name": "The Tools of the Ghost: An Urban Fantasy Novel - Book One: In the Path of the Ghost",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tools-Ghost-Urban-Fantasy-Novel-ebook/dp/B0BMGXPZ5F",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91+FilqALnL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Hemant Nayak",
            "link": "https://www.amazon.com/Hemant-Nayak/e/B0BN7TRYR8/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 285,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“A thrilling and utterly original fantasy.”- George Jreije, author of Shad Hadid and the Alchemists of AlexandriaIn a world where monstrous threats loom, the only defense is to bring your own monster.FBI Special Agent Kiran Patel finds herself thrust into a nightmarish whirlpool when eleven children disappear in the boldest kidnapping in US history. The quest to find the kids leaves her partner and best friend in a body bag and Kiran without an ally in sight. Kiran quickly realizes that the antagonist she faces isn't your run-of-the-mill criminal. This diabolical puppeteer is a force far darker, far more sinister. Agent Patel's lone ace? An elusive phantom known as the Ghost.. But there are two things she must never do: Never make him a promise, and don’t trust him for a second.Heaven rejected him. Hell fears him. His crime is the only one God will never forgive. Yet as the sands of time trickle down and the lives of eleven children hang by a perilous thread, Kiran must fight fire with fire and unleash the Ghost.Immerse yourself in this riveting urban fantasy saga that tackles deeply profound themes of justice, redemption, faith, and the darkness in the human soul. Packed with high-octane action and larger-than-life characters, The Tools of the Ghost is a tour de force certain to satiate of the Dresden Files and Rivers of London.Don't wait a moment longer. Elevate your reading experience and seize your copy now...",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BMGXPZ5F"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Endless Earth Publishing Mil (November 14, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 14, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4006 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 314 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#142,198 in Kindle Store (See Top 100 in Kindle Store) #333 in Contemporary Fantasy Fiction #1,036 in Fantasy Adventure Fiction #2,196 in Dark Fantasy"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 285 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "From the Publisher A Rookie FBI Agent is going to have to lead a team made up of The World's Greatest Hero Reborn, a man with too much Ego His Mighty Friend, A man with too Many Fears And History's Worst Monster Who Doesn't Care!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/c077569d-5ca3-479c-b56f-83987e5101d2.__CR0,0,512,512_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/b3300e38-54f4-4624-9698-4c9552ddb81b.__CR0,0,512,512_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/0b7616d3-6b28-4e2d-b29f-a10a3cf38506.__CR0,0,512,512_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/2839df2d-713b-452d-8034-fdb899074b5b.__CR0,0,1024,1024_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Now They've got to Save The World BEFORE They TEAR THEMSELVES APART !!! THE MUST-READ NEW URBAN FANTASY",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/ddf30596-4b45-4615-b63d-3bcf11340ae7.__CR0,195,1024,633_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/c077569d-5ca3-479c-b56f-83987e5101d2.__CR0,0,512,512_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/b3300e38-54f4-4624-9698-4c9552ddb81b.__CR0,0,512,512_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/0b7616d3-6b28-4e2d-b29f-a10a3cf38506.__CR0,0,512,512_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/2839df2d-713b-452d-8034-fdb899074b5b.__CR0,0,1024,1024_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/ddf30596-4b45-4615-b63d-3bcf11340ae7.__CR0,195,1024,633_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer IWAmazon Customer IW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQ7FZZ7Y7DCUZUE7POTWIGIUCNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D7V0KDMYSJK6?ASIN=B0BMGXPZ5F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2022",
                "reviewTitle": "5.0 out of 5 stars The Tools of the Ghost is much deeper than it seems",
                "reviewText": "What a treat to discover a new book that is wonderfully original, slyly transgressive, cartoonishly violent, and by turns humorous, gross, and empowering. The Tools of the Ghost is much deeper than it seems, and fathoms more profound than many other books in its genre (sword and sorcery/urban fantasy). I was thrilled when the author, who is a friend, announced its publication.At the outset, we're plunged into a frightening scene in a cathedral a half-century ago in Poland. An otherworldly being has arrived to obliterate everyone present for reasons unmentioned, but one altar boy earns a life-saving escape for the children. Notably, he doesn't save his priest; it's understood that the priest doesn't deserve to live.The book re-opens as a young Indian-American woman in the FBI, Kiran Patel, is caught between her unstoppable desire to search for and save a group of kidnapped children, and the clear orders from her boss to stand down. She's already been failing at work, and she's reconsidering her career options at the recommendation of her boss and her mother. Then, ailing after an attack in their last mission together, Kiran's mentor-partner unexpectedly bequeaths his supernatural powers to her.Action ensues as this ordinary woman crosses over into a supernatural subterranean world, a bit like Alice going through the looking-glass. Details of the myriad injuries that characters subsequently suffer are fantastical in nature, but quite realistic in their descriptions, likely due to the author's real-life experience as an emergency room doctor.The pacing wavers a bit in the gooey center of this cookie, but keep eating. This book is packed with insights about the discovery of friendship, the lasting guilt of betrayal, the nature of honesty, the intersection of different religious beliefs, and more. Corny comments and one-liners keep the the writing at a faux-dark level and prevent it from ever becoming truly scary, so I would call this book appropriate for teens and tweens as well as adults, despite the plentiful curse words and graphic fight scenes. Woven throughout are references to multiple faiths from the perspective of other faiths. The three main characters were brought up Hindu, Muslim and Catholic; they are Americans of Indian (from India), African, and Mexican-Zapotec descent. It's particularly worth mentioning that this book holds a story that predates all three religions as its foundation.Nayak roguishly mixes graphic depictions such as, \"The Ghost twisted and there was a sickening crack. The man screamed as his left shoulder popped out of its socket and hung limp at his side,\" with cheesy meme-worthy wisecracks in the dialogue, and undeniably cute memorable little sentences like, \"She had no doubt the papers, left to their own devices in a dark drawer, would conspire against her and have little paper babies to further waste her time.\"The novel, set in Seattle, seems ready-made to be turned into a movie, complete with spectacular scenes of the Space Needle ablaze and crumbling, demon fights deep in the bowels of the Underground passageways of Pioneer Square, severed hands, fire-breathing toads, guitar-wielding warriors, and gelatinous tentacles. Its caressing introduction to Seattle's topography makes it a perfect gift choice for a Seattle native or tourist.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61QS7rdxLyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason P Strayer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERMMKYUX4ECKLNZJD7IPK4WYEAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI6KWDY195PH2?ASIN=B0BMGXPZ5F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2022",
                "reviewTitle": "5.0 out of 5 stars Breakneck plotting combined with smart & sassy characters",
                "reviewText": "Ever get the sense you're holding the future in your hands? With this purchase, you're buying a front-row ticket to the first of a lifetime of solid fictional works from the brilliant, glacially cool and debonair Mr. Nayak. At many points during the scrolling of this debut work, you'll get that itchy, electric feeling of holding nascent literary thriller mastery in your virtual hands.Tools of the Ghost builds from a strong dark/paranormal/urban/fantastical cross-genre premise into a densely plotted page-turner rife with explosive action, gritty characters fighting against world-destroying odds, and pithy one-liners. The world is full of gritty crime drama pairings of odd couple characters, but until now, no one has seen a match-up with a demon-slaughtering monster. Turner and Hooch has nothing on this book!Bonus points for this book's setting: the sparkling, sunny city of Seattle. Even as a non-native from a faraway town, he accurately captures its unique character, from its dark crevices to its iconic skyline. Where else can you find the Space Needle \"lit up red like a monument to Hell?\"",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kmart",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHAFJ3EJMI2X52SGOIOCDW34INQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R292TZHIWSMN7J?ASIN=B0BMGXPZ5F",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Hilarious!",
                "reviewText": "Thank you to the author for sending me a review copy so that I could leave an honest review.The Ghost, a demonic-like entity from somewhere in history, fights for the bearer of the mark. When eleven children are kidnapped from their homes and taken by a cult, this mark ends up passing to Kiran. Suddenly, the Ghost has to work with a rookie FBI agent and two SPD officers to save the children across an urban fantasy landscape tangled with different cultures and religions.This was delightful and hilarious. The humor was irreverent, there were puns and dad jokes, and I deeply enjoyed all of the characters. This is a book unlike any other that I've read and Nayak is a refreshing new voice in the genre.I hope there is more to come.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Avalon Sky",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWT7PX7A5YRITKUH2ZAXXN22AZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E2MWQXIUTHX0?ASIN=B0BMGXPZ5F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Why We Love The Villians",
                "reviewText": "This is Ghost Rider and Jonah Hex and and a Strangely Sweet Sillence of the Lambs mash up that is amazing. The Lore is deep and Action Sequences are amazing. This will not disappoint. Looking forward to every sequel, prequel and anything out of this Heaven and He'll of a Book!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeanie G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJGYLOQXYWFJUIVXDDLG3TVTE2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24TOG3XUMFUQ4?ASIN=B0BMGXPZ5F",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 9, 2023",
                "reviewTitle": "3.0 out of 5 stars Long and somewhat repetitive battles.",
                "reviewText": "I read this on and off after the first few chapters. Had some difficulty with characters and skipped thru many pages of battles but the premise of the book was interesting even if I was left hanging at the end.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ElizabethF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHPNL4PLJOVEAHB4QEQDPUILI7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZLC34N9CKZQU?ASIN=B0BMGXPZ5F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Imaginative beyond belief.",
                "reviewText": "If there is one thing I do not do in reviews is to dissect the story. I believe the reader needs to read it for themselves to find their own meaning and enjoyment of a story well told. But I will tell you that I thoroughly enjoyed this book and found it to be filled well in its weaving of many myths and faiths in the plot to ponder over and savor. It is a book in which I read the last page with a sigh, sorry the experience of being immersed in a great story had come to an end. I look forward to more stories of this trinity of unlikely heroes along with their Ghost.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Montzalee Wittmann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDX66BRR74GD3TQ4EWR44444YUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35TF1E8YGRTA8?ASIN=B0BMGXPZ5F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Fresh fantasy!",
                "reviewText": "The Tools of the GhostBy Hemant NayakThis is a fresh, exciting fantasy that drew me in right away and held me there til the very end. Then I was wanting the next book right away! I hope it will be out soon! Wonderful characters that may be far from perfect but I grew to like them, even the \"bad\" guys. Fun dialogue, great plot, love the dog, and need more now! Don't miss this hidden gem!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole S. ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIRQV7RMH7Y4TVIDPAXRXLBUAUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V9LK2PICEK43?ASIN=B0BMGXPZ5F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2022",
                "reviewTitle": "5.0 out of 5 stars Shocking, vivid, and engrossing",
                "reviewText": "I was lucky enough to read this novel in its early days, and I’ve been obsessed with it ever since.FBI agent Kiran makes for a compelling protagonist as she gets sucked into a horrible, desperate situation that never should have come to be, the lives of innocent children at stake. I found myself bonding with her very quickly as she struggled to get her bearings and navigate a new reality that she never knew existed.As for the titular ghost…I don’t want to spoil anything, but the writing there was AMAZING. As much as I like Kiran, he completely steals the show, and I hope the author writes more novels about his previous exploits.5/5 recommended. I will be reading it again.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Silvia1",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 12, 2023",
                "reviewTitle": "A-AMAZING",
                "reviewText": "I can’t even begin to say how amazing this book is. It kept me on the edge of my seat. Well written…..I highly recommend this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Random Robin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 30, 2022",
                "reviewTitle": "One Hell of an Adventure!",
                "reviewText": "What happens when a misanthrope from another world (dimension?)---certainly someone who isn't human---a smart as a whip and sarcastic FBI agent and team of forever underestimated street detectives who are so much more than they appear, join forces to save group of children from the powers of hell?A hell of a lot of fun, that's what.I loved The Tools of the Ghost! It's a fast-paced action adventure, where you get the unlikeliest team coming together to save the day. This action packed book is part-mystery, part-thriller but so much more. It's about finding your humanity, which can be a tall order when you are literally the undead. I adore books about found families, so this was a huge plus for me. The highlight of the writing in my opinion was the crackling dialogues. There were so many laugh-out-loud moments. The characters have great chemistry between them, which makes for a very immersive reading experience. By the end, I couldn't wait to embark on another adventure with this team!Bonus points to Hemant for showing the complicated dynamic between Indian mothers and their daughters with so much humor and pathos. I would love to see Kiran's mom join the team in future books! She would be a great addition!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 24, 2023",
                "reviewTitle": "Excellent",
                "reviewText": "A truly original book, such a rarity. I loved the characters, the plot was superb and the whole thing was just an exceptional read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 22, 2023",
                "reviewTitle": "Fantastic story",
                "reviewText": "Absolutely loved this story. The characters are fabulous. The Ghost grew on me to the point I desperately want to know more. Action packed and also made me think. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P. Matthews",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 16, 2023",
                "reviewTitle": "Interesting story, different",
                "reviewText": "This was different. A story about friendship and courage and being \"other\". At the core of it, redemption. A little too dark for me but very well written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}