{
    "remaining_requests": 258,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Twig-1-Skottie-Young/dp/1534323465",
    "body": {
        "name": "Twig Volume 1",
        "price": "$12.60$12.60",
        "originalPrice": "",
        "rawPrice": 12.6,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Twig-1-Skottie-Young/dp/1534323465",
        "soldBy": {
            "sellerID": "A365C2XG0O7B0H",
            "name": "ThriftBooks-Chicago",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A365C2XG0O7B0H"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71CMIpp7rjL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Skottie Young",
            "link": "https://www.amazon.com/Skottie-Young/e/B00D2MMPN8/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ThriftBooks-Chicago",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 47,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Twig may rank up among Image Comics' best series of all time.” -ScreenRant“A richly detailed fantasy land in the vein of The Dark Crystal, Labyrinth, or Jeff Smith's beloved Bone comics.” -io9/Gizmodo\"The fantastical setting is brought to life by a vivid, enchanting art style with exquisite colors by Jean-Francois Beaulieu and clean, easy-to-read lettering by Nate Piekos... Twig’s journey provides plenty of daring escapades to please the adventurer at heart. A charming romp through a visually stunning world.\" —Kirkus Reviews\"Concocts a beautiful assembly of colors, ranging from calming magenta to creepy absinthe, to depict the ever-changing topography...ends on a wild note, taking a simple journey to cosmic heights.\" -Comic Book Resources\"The narrative’s gentle tone smartly contrasts the art’s occasionally grotesque visuals; in brilliantly hued palettes, Strahm renders distorted landscapes populated by innovative technologies, anthropomorphic ruins, and softly rounded critters sporting an astounding array of teeth. While Young’s plot follows a well-trod quest trajectory, clever tweaks and subversions keep it feeling fresh.\" —Publishers Weekly Review PUBLISHERS WEEKLY -- After his father’s death, blue-furred, bipedal creature Twig is reluctantly designated the new Placeling, whom “this world and all the ones beyond are depending on,” in this lightly creepy graphic novel series opener by Young (The Me You Love in the Dark) and Strahm (Into Radness). After arriving late to his first assignment, Twig and his snarky, yellow slug-like companion Splat are given a glowing red gem and instructed to take it to the Pathsayer, a diviner of mystical objects’ origins. But when the pair show up at the Pathsayer’s residence, they find him dead. Using the Pathsayer’s tools, Twig determines the gem’s destination, severely damaging it in the process, and the duo embark on a series of side quests to repair it before a “darkness covering all things” descends upon the world. The narrative’s gentle tone smartly contrasts the art’s occasionally grotesque visuals; in brilliantly hued palettes, Strahm renders distorted landscapes populated by innovative technologies, anthropomorphic ruins, and softly rounded critters sporting an astounding array of teeth. While Young’s plot follows a well-trod quest trajectory, clever tweaks and subversions keep it feeling fresh. Ages 12–up. (Nov.) Review \"Concocts a beautiful assembly of colors, ranging from calming magenta to creepy absinthe, to depict the ever-changing topography...ends on a wild note, taking a simple journey to cosmic heights.\" -Comic Book Resources \"The narrative’s gentle tone smartly contrasts the art’s occasionally grotesque visuals; in brilliantly hued palettes, Strahm renders distorted landscapes populated by innovative technologies, anthropomorphic ruins, and softly rounded critters sporting an astounding array of teeth. While Young’s plot follows a well-trod quest trajectory, clever tweaks and subversions keep it feeling fresh.\" ―Publishers Weekly “Twig may rank up among Image Comics' best series of all time.” -ScreenRant“A richly detailed fantasy land in the vein of The Dark Crystal, Labyrinth, or Jeff Smith's beloved Bone comics.” -io9/Gizmodo\"The fantastical setting is brought to life by a vivid, enchanting art style with exquisite colors by Jean-Francois Beaulieu and clean, easy-to-read lettering by Nate Piekos... Twig’s journey provides plenty of daring escapades to please the adventurer at heart. A charming romp through a visually stunning world.\" ―Kirkus Reviews About the Author Skottie Young got his start at Marvel on titles like Spider-Man: Legend of the Spider Clan, Human Torch, and Venom. He soon began adapting the L. Frank Baum Land of Oz novels at Marvel with Eric Shanower. He is best known for writing and drawing the hit series Rocket Raccoon, illustrating the children's book Fortunately, The Milk by Neil Gaiman, and the Young Marvel variant covers. He's also the cartoonist of I Hate Fairyland and writer/co-creator of Middlewest and The Me You Love in the Dark with artist/co-creator Jorge Corona, and artist/co-creator of Twig with writer Kyle Strahm.Kyle Strahm has been a freelance comic book creator since 2006. In that time he has had work published by Image Comics, Marvel Comics, DC Entertainment, Aftershock, Todd McFarlane Productions, IDW Publishing, Dark Horse, Dynamite, Valiant Entertainment, Black Mask, and others. As an adjunct professor, Kyle teaches Illustration to seniors at the Kansas City Art Institute. He lives and works in Kansas City, Missouri. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 1 hr 2 mins",
            "FREE delivery February 27 - 28.",
            "Or fastest delivery Thursday, February 22.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 9 hrs 32 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "DARK CRYSTAL meets BONE in this delightly high fantasy middle grade/YA adventure\"The fantastical setting is brought to life by a vivid, enchanting art style with exquisite colors by Jean-Francois Beaulieu and clean, easy-to-read lettering by Nate Piekos... Twig's journey provides plenty of daring escapades to please the adventurer at heart. A charming romp through a visually stunning world.\" —Kirkus Reviews \"The narrative's gentle tone smartly contrasts the art's occasionally grotesque visuals; in brilliantly hued palettes, Strahm renders distorted landscapes populated by innovative technologies, anthropomorphic ruins, and softly rounded critters sporting an astounding array of teeth. While Young's plot follows a well-trod quest trajectory, clever tweaks and subversions keep it feeling fresh.\" —Publishers Weekly I HATE FAIRYLAND and MIDDLEWEST Eisner Award-winning writer SKOTTIE YOUNG and artist KYLE STRAHM (SPREAD, UNEARTH) come together for an all-new epic fantasy/adventure mini-series! Join Twig on the first day of his new job, a Jeff Smith's Bone-esque journey to save a The Dark Crystal/Labyrinth-style world. Join our hesitant hero for an inspiring and imaginative tale of hope, heartache and the determination to overcome insurmountable odds! Collects TWIG Issues 1-5\"A richly detailed fantasy land in the vein of The Dark Crystal, Labyrinth, or Jeff Smith's beloved Bone comics.\" —io9/Gizmodo\"Twig may rank up among Image Comics' best series of all time.\" —ScreenRant\"Concocts a beautiful assembly of colors, ranging from calming magenta to creepy absinthe, to depict the ever-changing topography...ends on a wild note, taking a simple journey to cosmic heights.\" —Comic Book Resources Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3014"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Image Comics; First Edition (November 15, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 128 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1534323465"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1534323469"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.3 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.4 x 0.3 x 9.9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#137,889 in Books (See Top 100 in Books) #156 in Image Comics & Graphic Novels #199 in Children's Fantasy Comics & Graphic Novels #623 in Fantasy Graphic Novels (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 47 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Pilot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENMQB5MXAMXJY2KFUESJHDL7HRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TAED6C3URWAO?ASIN=1534323465",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Shot to the top of my list",
                "reviewText": "Absolutely LOVE this comic series. The writing tone is curious, earnest, sincere and creative. The resilient lil’ guy on pursuit of his quest took me on a brilliantly colorful journey of science fiction euphoria.What surprised me most was how engaging the writing was. It paired perfectly with the imagery into a crescendo of entertainment in its pure form. I disappeared into the story — smelled the smells, felt the temperatures and experienced the feelings.I really, really hope this series is brought back for a second round. I bought it for my son because I’ve followed Skottie on Instagram for years and love his work, but now it’s for me and my son can read it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon customer :) ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2ODMJKJNQZQG5XK7HOC7F55IAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JDFKBKW5UIL7?ASIN=1534323465",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Absolutely loved it.",
                "reviewText": "I absolutely loved this comic book. Loved the art, the world the writer created, and the story line. I’m bummed the other volumes are on kindle though, I wish so bad they were in print!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "El",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFS7VFCYU4K3G4LCDSWPBEQSQPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M8IRRBGTRBIH?ASIN=1534323465",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Loved it",
                "reviewText": "Amazing art work",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caleb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSYDOQXAXE44ESGYY56OD5NFQWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OQ6MY8CDFM07?ASIN=1534323465",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2023",
                "reviewTitle": "5.0 out of 5 stars cute and charming",
                "reviewText": "This was a cute and charming little story. It wasn’t anything crazy or world bending but it was a nice quick read on a relaxed evening.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JBJB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRARRHLHNSXPS5ZQHN74LA6ZILA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9S15OSM32JDR?ASIN=1534323465",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2022",
                "reviewTitle": "3.0 out of 5 stars Minus 2 stars for the creases!",
                "reviewText": "Bought this for the art so it's a bit frustrating to receive a creased copy. I hope books like this are packaged with extra care in mind so mintness is preserved. Arrived earlier than expected though.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/614UkoO1I0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61WuhI1L+8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61dU7q4WsBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-NbOQjfTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Norris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJMBW6H7NOE32O33VVA73NDWLIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O1XFZQOGFSBZ?ASIN=1534323465",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Fun and exciting family read",
                "reviewText": "My 16 year old son and I read TWIG together on a road trip. The art is gorgeous. The writing is adventurous, funny and the story pulls you in within the first minute. TWIG and Splat are so lovable and likable as are all the worlds they venture through. I hope there will be more!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Evren A.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJPAT5OJERDS6CTJNS35PV7KBEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZTHGRHCYK75?ASIN=1534323465",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2022",
                "reviewTitle": "5.0 out of 5 stars Great",
                "reviewText": "Great compact comic. Art and colors are fantastic and the glimpse of this world Twig is in on each page packs in a lot of creativity. I thought it was a unique take--its not \"complete the quest\" but \"complete the quest so that the main hero can complete the quest\". Of course, wish it was longer, more fleshed out, but I think you should buy it, it's a neat little book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRWUFWYYLYI4PDDGH7MSDHY4X2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RWHENLLEWNE9?ASIN=1534323465",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Twig comic book",
                "reviewText": "Beautiful imersive world of fun and love. It inspires hope and to dream. Cute fluffy characters teach important life lessons. You can give it to young adults tweens and feel good about it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr.WoolleyMr.Woolley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2024",
                "reviewTitle": "Such A Great Book",
                "reviewText": "First Thinga First, this book is comprised of all 5 books from the current series.- My Thoughts:This book is great to put it plain and simple! The artwork & story is very creative.I bought this book as I liked the artwork on some of the comics so I gave it a chance and turned out to be one of my most favorite reads to date!This is great for all ages. If you're like me, you're around 38 and enjoy Art, Animation & Cute Stories such as the \"Stray Dogs\" series, this book is for you!If you're young and just like a good story with imaginative fantasy like artwork, you will absolutely love this book!No adult themes or anything, this is purely cute & awesome!If there is more to the series later, I will definitely be keeping up on it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71WrfPYOEkL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charlie Bray",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 30, 2023",
                "reviewTitle": "Fantastic fantasy - art is incredible",
                "reviewText": "Brilliant artwork to a good hart warming story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica LucasJessica Lucas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 15, 2023",
                "reviewTitle": "Amazing artwork, absolutely beautiful but..",
                "reviewText": "I am in love with the art of this story and the world created within it. My only issue was with Twig himself. I honestly couldn’t get connected to him. I felt more emotion from Splat and Lobee. It also felt a little empty in the sense that the comedy didn’t quite hit - but I am a 22 year old so it’s probably because I’m a young adult reading a childrens book 😂Other than those things, this was a really cute and intriguing read. I absolutely adore Lobee to my core !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/6181u0EM9AL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71xWM3C4t-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "@comicsvstheworld",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 3, 2023",
                "reviewTitle": "Worth buying for the art alone!",
                "reviewText": "This is a beautifully imagined and illustrated world that they've created here, and I'll happily buy more books exploring it.The story is a little basic and linear, but it still makes for a fun read while you take in the gorgeous artwork.A great all ages book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}