{
    "remaining_requests": 352,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Coraline-Graphic-Novel-Neil-Gaiman/dp/0060825456",
    "body": {
        "name": "Coraline: The Graphic Novel",
        "price": "$10.39$10.39$3.50$3.50$10.39",
        "originalPrice": "$15.99",
        "rawPrice": 10.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Coraline-Graphic-Novel-Neil-Gaiman/dp/0060825456",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51VCICg0szL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51GtH7mV vL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41w820xlWbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lDXNzieyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YYtfQXRbL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Neil Gaiman",
            "link": "https://www.amazon.com/Neil-Gaiman/e/B000AQ01G2/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by Goodwill Industries of Southern Nevada.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 2709,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 12 hrs 46 mins",
            "$3.99 delivery February 28 - March 5.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 12 hrs 31 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Mystery-Horror/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3013"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ HarperAlley; Reprint edition (May 5, 2009)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 192 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0060825456"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0060825454"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 12 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 3 - 7"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 14.1 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.5 x 9.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#17,685 in Books (See Top 100 in Books) #21 in Children's Fantasy Comics & Graphic Novels #31 in Comic Strips (Books) #590 in Children's Fantasy & Magic Books"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 2,709 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kelly Gunderman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESXZRB4WKRTK7RGPB7ESVEF36UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REZ27T4TU8KQD?ASIN=0060825456",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2018",
                "reviewTitle": "5.0 out of 5 stars Gripping, Exciting, and Absolutely Beautiful",
                "reviewText": "This review originally appeared on herestohappyendings.com.I really loved the original Coraline - I'll admit that I saw the movie before I read the book, but the movie prompted me to buy and read it, and I guess over the years I have read Coraline so many times it's got to be in the double digits by now.I also didn't realize that a graphic novel adaptation of Coraline existed. I'm not sure how I didn't know this, but I didn't. I managed to come across it on Goodreads one day when I was browsing graphic novels, and as soon as I saw it, I knew I had to have it. I purchased it the same day, and waited rather impatiently for my two day shipping from Amazon Prime. When it finally got here, I read it all in one sitting. And then I read it again.\"Spiderwebs only have to be big enough to catch flies.\"Coraline and her family buy part of a big house and move in - in the flat below live two elderly women who used to be actresses, and in the flat above lives an elderly man who is busy training a mouse circus. The flat next to theirs is still empty.Coraline feels bored often - there aren't any other children and school didn't start up yet, so she finds herself wandering the house and the ground, exploring and entertaining herself. When she comes across an old door in her flat, she wonders where it goes, only to find out that it is old and bricked up, going nowhere.Except one day, the door isn't bricked up, and Coraline ventures through - only to find the world quite like her own, but incredibly different. Her parents aren't there, but her Other Mother and Other Father are - and everyone has button eyes. Things seem better there at first, but then Coraline realizes that it's a true nightmare, and she tries to escape from the Other Mother's clutches, only to find that she has kidnapped Coraline's real parents in an effort to make Coraline stay with her forever.Coraline fights for her parents back, because she wants to leave this place with the Other Mother and go back home.The novel Coraline is incredibly different from the movie, and I honestly thought it was much creepier. The graphic novel? Even creepier. The way that the illustrator, P. Craig Russell, has depicted the Other Mother and Other Father, as well as the decaying \"other world\" that the Other Mother created, is, to be frank, downright terrifying. But I loved it (as did my daughters, who frequently borrow this book).The story is fully laid out, illustrated in a charming and colorful way - it's such a great graphic novel adaptation of one of my all time favorite reads. The illustrations depicting the Other Mother are hair-raising; the way the amount of detail is put into every character in the book is amazing. The story itself is not only gripping, but it's the original story, not just a random adaptation. I love that so much - my favorite quotes and parts of the book were all there.I bought the hardcover format of this book (it's also available in ebook and paperback), and it's so gorgeous. There is a dust jacket with the book, and the cover under the dust jacket features the same art. The inside is just as beautiful, the glossy pages really add to the reading experience.I can't get over how beautiful and detailed the artwork is and how it really complimented the story. I wasn't sure what it would be like, and if it would ruin the way I feel the characters look when I read the original Coraline, but if anything, I believe that it only enhanced the way I saw everything in the book when I read it. It was definitely a great companion to the novel.Here's a bonus: if you haven't read Coraline or saw the movie (which doesn't do the original book or this graphic novel justice, in my opinion, because it's so different), you will definitely be fine with picking this one up, because it follows the novel perfectly. It's essentially the Coraline novel, only fully illustrated.My older daughter, who is about to turn nine, is a bit of a reluctant reader, and I'm trying to get her to read new books. She loves anything with pictures, and she is obsessed with Coraline after seeing the movie, so she loves this book, as well. I have to recommend picking this up if you're a fan of Coraline, or even if you've never heard of the book before and want something that will add a bit of adventure to your bookshelf.",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Everson Greene",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQWDD7K7RVCPI7XG6IF5J3YLIEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NZ3WM121SOMZ?ASIN=0060825456",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome",
                "reviewText": "Even better in hardback.My daughter loves the animation.Now she loves the book.Thank you",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frequent User",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXR474PE7JQDTDW7THBMQEGV5CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R875XQARH77K0?ASIN=0060825456",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Great",
                "reviewText": "I received the graphic novel in perfect condition. This graphic novel is based of the original BOOK of Coraline, not the movie. So various things look and happen differently. Just a heads up for anyone thinking it will be just like the movie.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7RKI2AHYK4GVPH7MS7CLYBTOTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FLQ9PT66PX1A?ASIN=0060825456",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Classic Neil Gaiman",
                "reviewText": "Was a pleasure to read (even though this was the illustrated version). Everything I've read by Gaiman has been a delight to read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeremiah D. Ostrosky Sr.Jeremiah D. Ostrosky Sr.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRG2BFBXQJ3QLXDPLNMZPSSF36A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3A5BCZPUBT4SG?ASIN=0060825456",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice hardback picture book",
                "reviewText": "Would make a nice gift for a fan. Or even a tween girl to become one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717B3tK8oHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71V+rZeShZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71xwzE4FepL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marti Ross",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRDV5WIXQSGJGUNA3X3XFAT34UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R203OH5IMTKUUR?ASIN=0060825456",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Quality",
                "reviewText": "Came in Great shape. It was a gift.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Olivardia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFREGV7FEJLZ6KRMCJAVPX66P2PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D82ORF75UFAE?ASIN=0060825456",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy read for Dyslexic child",
                "reviewText": "My daughter has dyslexia and has struggled with reading from day one. She’s never shown interest in reading because it frustrates her beyond words and ends up with severe anxiety.She loves the movie Coraline and her cousin told her there was a book that is even better than the film. I knew the traditional novel wouldn’t work for her but we decided to give this graphic novel a shot.When I tell you I cried happy tears because this child read through this book with so much excitement. She was enthralled, even though she struggled with a lot of the words, it helped that things were broken up into small sections so she can focus on one speech bubble at a time.Since reading this we’ve purchased 2 other graphic novels and she’s thriving. Reading is still hard but she’s actually looking forward to it now as opposed to the anxiety it would induce before.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patricia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOAT3WPTB7E4D5MT2FNTAO3UQIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16L6JRHP69PMC?ASIN=0060825456",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 15, 2011",
                "reviewTitle": "5.0 out of 5 stars M__U__C__H.....B E T T E R....T H A N....T H E....M O V I E..!",
                "reviewText": "\"CORALINE\", by NEIL GAIMON, is basically out in three different formats. This GRAPHIC NOVEL version, a novelized, (non-graphic) version -- and the movie version.The regular, novel, book version is definitely great for those whose attention spans are still intact, (unlike mine, which has been blasted to smithereens by a life-time of watching TV -- with commercials ruining my concentration every 10 -15 minutes! A sense of concentration I am TRYING to recover!) That leaves the movie version and the graphic novel version for most people over 21.....This is a story about a young girl who discovers an alternate universe in the strange old house she and her parents share with tenants in two other apartments.These tenants are strange enough -- but the \"Other Mother\" and \"Other Father\" that Coraline discovers are distinctly far more weird --and far more frightening --than the dwellers in the other two apartments in the normal, (real?) world. The \"Other Mother\", and \"Other Father\", LOOK (more or less) like Coraline's real-world mother and father -- but they have buttons for eyes, and -- especially in the \"Other Mother's\" case, are definitely up to NO GOOD.The movie version of this novel, sadly, is NOT populated by any live actors. IT IS ACTED ENTIRELY BY STOP MOTION-PUPPETS! While stop-motion puppet movies are amongst my favourites, (LOVED \"Chicken Run\"!), the heart of the story of \"Coraline\" is that a normal, real-world girl finds herself face-to-face with evil, \"other-world\" characters that look ALMOST like their real-world counterparts -- but not exactly enough. IN THE MOVIE, CORALINE, TOO, IS A STOP-MOTION PUPPET! The contrast between her, and her \"Other\" parents is thus totally lost -- and so is much of the impact of the movie!In this geaphic novel, however, very (VERY!) realistic drawings, (by artist P. CRAIG RUSSELL), show up the difference between real, and \"Other\" people. These differences are very subtle in the beginning....but are greater and greater as the story continues. By making Coraline look human, and the \"Others\" increasingly less so, the story gains impact and thrills. The movie -- where ALL the stop-motion puppet characters look far less than human, totally loses impact here.CORALINE is a mesmerizing story of one girl's horrific and scary adventure, and her fight to get back to the real world and her real parents. In the end, she actually rescues them. That kids CAN make a difference is one of the lessons in this by-now clasic book. And the reality-vs-unreality of the situations Coraline finds herself in is far more accurately done in this graphic novel, than in the movie version, which reduces ALL characters to stop-motion puppets!THIS is the version to buy!",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2024",
                "reviewTitle": "I didn’t realize this was an illustrated ‘children’s’ book",
                "reviewText": ". . .but it held my interest and I quite enjoyed it! Indeed, Neil Gaiman is again “spot-on” with a tale of an adventuresome young girl who, moving with her parents into a multi-unit apartment building, finds a secret passage to another though eerily similar life. All the characters - the good and the ‘bad,’ are fascinating (their personations depending on which end of the passage you find them is really quite marvelous.All that said, however, I must offer my greatest praise to P. Craig Russell for his truly wonderful illustrations that served to give “life” to the story itself. This collaboration between author and illustrator is a grand one, and I’m so glad that an ordering “mistake” (on my part) put this colourful and quite delightful book in my hands.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cristiane Roncoletta Nunes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 13, 2023",
                "reviewTitle": "Super recomendo",
                "reviewText": "O livro é lindo, as ilustrações dão perfeitas, veio bem embalado e super rápido.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ChristianChristian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 5, 2023",
                "reviewTitle": "Muy buen libro",
                "reviewText": "El libro llegó sin ningún daño y del lado de la historia creo que es bastante buena y entretenida.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71iHit5rrHL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 19, 2024",
                "reviewTitle": "Enjoyed",
                "reviewText": "My 9yr old grandson devoured this in one day! He enjoyed it very much",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 6, 2023",
                "reviewTitle": "Nice",
                "reviewText": "I love it. It arrived in perfect shape. Paper and print quality are also nice.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}