{
    "remaining_requests": 366,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Narrow-Road-Between-Desires-Kingkiller/dp/B0C9P2B3K9",
    "body": {
        "name": "The Narrow Road Between Desires: Kingkiller Chronicle",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Narrow-Road-Between-Desires-Kingkiller/dp/B0C9P2B3K9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51bDKyreUJL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Patrick Rothfuss",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Patrick+Rothfuss&search-alias=audible"
        },
        "brand": "Patrick Rothfuss&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2859,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 New York Times-bestselling phenomenon Patrick Rothfuss returns to the wildly popular Kingkiller Chronicle universe with a stunning reimagining of \"The Lightning Tree.\" Expanded to twice its previous length and lavishly illustrated by Nate Taylor, this touching stand-alone story is sure to please new audiences and veteran Rothfuss fans alikeNo one taller than the stone. Come to blacktree, come alone. Tell no adult what’s been said, Lest the lightning strike you dead.Follow the Kingkiller Chronicle’s most charming fae as he schemes his way through the small town of Newarre. While Bast cares nothing for the laws of man, he is beholden to older, deeper laws. And despite his cleverness and care, Bast finds himself forced to choose between betraying his master and helping a hated enemy.Playful, sweet, and sly as Bast himself, The Narrow Road Between Desires explores a previously unseen part of Temerant, and shows a side of Bast we’ve only glimpsed before. Learn more about Bast as he goes against his better judgement and follows his heart’s desire.For after all, what good is wisdom if it keeps you from finding your way to danger and delight? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Action-Adventure/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10159265011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "4 hours and 15 minutes"
            },
            {
                "name": "Author",
                "value": "Patrick Rothfuss"
            },
            {
                "name": "Narrator",
                "value": "Patrick Rothfuss, Nick Podehl"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 14, 2023"
            },
            {
                "name": "Publisher",
                "value": "Recorded Books"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0C9P2B3K9"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#521 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #35 in Action & Adventure Fantasy (Audible Books & Originals) #45 in Fantasy Action & Adventure #74 in Epic Fantasy (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Be Moore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTOW4AZZOUWUVJU42XCTNODSKPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ5FQKJUZ1H5Y?ASIN=B0C9P2B3K9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars As Always, Or Course",
                "reviewText": "It is not \"what did I like about the story\" but what didn't I like about the story! Seriously I could not find a single thing I did not like about the story! It was delightful!However there was an extra special surprise about the size of my pinky! Literally the tiniest surprise! It pleased me so when I was clever enough to zoom in on it! And thank you whoever decided to display this intimate art in such a discreet way! It added a deeper truth to that part of the story. I am not sure how to describe the sounds that came with my spontaneous reaction at the discovery. The pleasantly of it amazed. I will definitely let other readers discover this treasure for themselves and hope that they do. It is such a gem!The whole story is magical and I so enjoyed Patricks exploration with his children that inspired the refining of The Lightning Tree. Thank you Patrick for another wonderful read!!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Shade",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGKNPFOXC2ER7MBJWM4HNLRPZHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B4YTGW0UCD9W?ASIN=B0C9P2B3K9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Rothfuss remains a genius with words",
                "reviewText": "I love this book. I read \"The Lightning Tree\" when it was released, but with this book, it has become a complete story. I love how intertwined it is and how he teaches some very serious life lessons. It's a good reminder to \"be careful of what you ask for.\" The story is has a subtle warning, but it is forgiving and sweet at the same time (I love the part about the kitten). I enjoy the concepts wrought in the mind of Pat Rothfuss. He infuses his characters with life and motive so quickly. I feel he actually breathes life into them and sends them on their way. I don't know how to describe it, this power to create. He has been blessed wth an incredible gift. Even his blog is a joy to read. Amazing!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer in VB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3ZYVLVEANG2KGLKQDVZXWM422Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34NCCVS8OTMW2?ASIN=B0C9P2B3K9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Old and New together",
                "reviewText": "Let's put the most important thing out there first for those still in the dark, as I was: this is a revision of his short story \"The Lightning Tree\" from the Rogues anthology. I can remember buying the anthology just for that Bast story. So in one way this is old material.In so far as the new-and-improved aspect, it has a few things going for it. First, he did change some things/words a bit. Other reviewers give some very good concrete examples of the revisions; I'm not going to get into that here. Next, this story is a little longer than \"The Lightning Tree\". In the Forward, Rothfuss said it's 15k words longer. Third, the illustrations made this worthwhile. I really enjoyed those! The illustrator did a great job. And finally, Rike. I really felt a lot of compassion for that boy.After reading the Afterword, I really doubt that we'll be seeing Doors of Stone anytime soon. I had hoped that working on this would have put him in the right frame of mind, but it really doesn't sound like it's going well book-wise. I'm still glad that I bought this book.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas S. Trias",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQG2RDHFEUXGPG2ONMAWYNGEXVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3A5E9FG8PTZCA?ASIN=B0C9P2B3K9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Read the authors notes!",
                "reviewText": "Seriously. They offer insight to the man behind the story. I know everyone is awaiting The Doors of Stone. Honestly, I am too. But, in some ways, I think I would be just as happy to hang out with Patrick Rothfuss, share a meal, maybe play a board game. I especially recommend the author’s notes if you are one of those awesome parents that read to your children. I read a The Name of the Wind, The Wise Man’s Fear, and The Slow Regard of Silent Things to my kids, eliding some of the overtly adult themes from the first two. They absolutely loved them. Had this been available at the time, we would have read it, and they would have loved it. Sad to say, they are quasi-adults now, and are more enamored of screens than books, but I think this might prove to be the exceptional exception.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBMGXOCVLY3SDYDTWI6GKAP3YAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLP3I5F0V2Z2Z?ASIN=B0C9P2B3K9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars The revisions made it better",
                "reviewText": "I read and loved the original of this story, but this version made me laugh, and cry, and cry. The original was clever, but it wasn't heartbreaking. It wasn't generous. You had to really work to see the beauty in it and half the time I worried that I was projecting ideas onto it that I just wished it contained.This story was perfect.I hope JK Rowling reads it. Maybe she'd learn something.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DB reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHLIWTBLXHMJGWHZJBOZN6TON2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FVLO13RECQDL?ASIN=B0C9P2B3K9",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "3.0 out of 5 stars Nice Story",
                "reviewText": "I have enjoyed Rothfuss's work to this point.This novella is no exception; however, the use of passive voice here slowed down the story sometimes. (There were also significant typos toward the end of the volume, which was surprising - I only mention them because they were so jarring.) Slowly enough that I had to re-read several sections to be sure I was gleaning the author's meaning. In a few spots, passive seems acceptable, yet its constant usage was somewhat jarring.The story is touching and emotional. Bast is an interesting character who deserved his own story, and I look forward to reading more about his tale.The use of artwork is well-done throughout; however, some images were likely unnecessary given the written description. But I do think the additional artwork will hopefully prompt other authors to add art to their works.Suggested reading only if you've read at least Book 1 of Rothfuss's trilogy. If you've read that book, then be prepared for a treat.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sean B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEELSMAU5QECGAYJHIFL7LWCONA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHH8XQXO0E4RG?ASIN=B0C9P2B3K9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars this man is a poet.",
                "reviewText": "There’s some authors that crank out a book, every six months and they’re good to to read, a good yarn. There are authors that make you wait years for books, because they have to be perfect, and there are books that if the author only writes one it will have been worth the entire weight. This is one of those and Patrick Rothfuss is a true artist.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jane Wiseman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIWJAGF6UWJ7DAMFWAU632E4J2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32WASMIPLJ469?ASIN=B0C9P2B3K9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "4.0 out of 5 stars I liked this novella a lot",
                "reviewText": "Bast is one of my favorite characters, and I did enjoy “The Lightning Tree” when it was first published. This enlargement of the story is engaging. I do think it raised more questions about Bast than it settled, and felt oddly incomplete. I was glad I read it, though.I should just add: Bast frequently speaks in a very subtle verse. I enjoyed that part immensely. The fae WOULD speak in a kind of heightened language. It rang true.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rylan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 20, 2024",
                "reviewTitle": "Charming",
                "reviewText": "This was a very enjoyable read, definitely worth the purchase. This book was like a small slice of dessert, I want to eat more- but I am happy I got to taste it. The illustrations were cute, very expressive faces that add to the playfulness of the story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Clara Luz López Rincón",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 19, 2023",
                "reviewTitle": "¡Excelente!",
                "reviewText": "me llegó rápido y justo a tiempo, he querido este libro desde que se anunció y estoy ansiosa por leerlo, no me pude esperar a la edición en español. Amo los libros de Patrick Rothfuss. Espero mucho más de él, es mi autor favorito sin duda.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda Dosatti",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 9, 2023",
                "reviewTitle": "Bom",
                "reviewText": "É um livro bom, que prende a atenção. Muito bem escrito. Porém, eu achei que o autor distorceu o personagem do Bast no final. A sensação que dá é que é um personagem com mentalidade meio infantil, que age e se preocupa exclusivamente com seus desejos. Não é um personagem necessariamente ruim, mas tão pouco é um personagem bom. Ele é neutro e guia seus passos a partir de seus desejos. Mas no final, o autor passa a impressão de que quer fazer o mundo um lugar melhor e transforma o personagem numa pessoa boazinha. Achei que o autor se perdeu nesse final. Leitura interessante de qualquer forma.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 11, 2023",
                "reviewTitle": "like coming home",
                "reviewText": "I read this story ten years ago and liked it. I read this in a day and loved it. The words and story feels like coming home.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pietro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 9, 2023",
                "reviewTitle": "Lovely book",
                "reviewText": "Amazing writing as always. The book talks about one of my favourite characters of the series and I love it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}