{
    "remaining_requests": 402,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Divine-Rivals-Novel-Rebecca-Ross/dp/1250857430",
    "body": {
        "name": "Divine Rivals: A Novel (Letters of Enchantment, 1)",
        "price": "$11.99 $10.99",
        "originalPrice": "$18.99",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Divine-Rivals-Novel-Rebecca-Ross/dp/1250857430",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/510DvZ1WuQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51QqBFzD0eL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Rebecca Ross",
            "link": "https://www.amazon.com/Rebecca-Ross/e/B0758FP8X1/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by GW Norman Books and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 42431,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 13 hrs 55 mins",
            "FREE delivery March 30 - April 29 on orders shipped by Amazon over $35",
            "Or fastest delivery March 26 - April 25"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17466"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Wednesday Books (April 4, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 368 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250857430"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250857439"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 13 - 18 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.2 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.5 x 1.06 x 9.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#125 in Books (See Top 100 in Books) #2 in Teen & Young Adult Magical Realism Fiction #3 in Teen & Young Adult Fantasy Romance #4 in Teen & Young Adult Sword & Sorcery Fantasy"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 42,431 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "A River Enchanted A Fire Endless Also available Elements of Cadence, 1 Elements of Cadence, 2",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b59aa0a5-3c65-420d-be5b-0a0a40c142da.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bdbabb55-9def-41f7-a4e4-753cb33a2dff.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/85cac39f-4c20-4500-8130-87512da8108e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1165fdbd-9207-44e4-8a4d-c83759d1ea3b.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c49a237c-e605-461e-97cc-b502814013a3.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6028bf7b-c30c-4378-9ee8-251684338a7b.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Addicted to Romance Book Blog",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZFU7532AEOGKAJ3PWQCFNQEP3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32BTHG8TV5URI?ASIN=1250857430",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars A stunning mythological fantasy romance that leaves you yearning for more!",
                "reviewText": "This review may contain spoilers, so fair warning, upon reading the review.Book Evaluation:Plot: 🎞️🎞️🎞️🎞️🎞️World Building:🌎🌎🌎🌎🌎Cover:📔📔📔📔Hero: 🦸🏻🦸🏻🦸🏻🦸🏻🦸🏻Heroine:🦸🏻‍♀️🦸🏻‍♀️🦸🏻‍♀️🦸🏻‍♀️🦸🏻‍♀️Intimacy Level: 🔥🔥Relationship Building: 💒💒💒💒💒Heart & Feels:💞💞💞💞💞Witty/Banter/Reaction of Laughter: 😂😂😂😂Page Turner Level:📖📖📖📖📖Narration:🎧🎧🎧🎧🎧Ending:🧧🧧🧧🧧🧧Overall View: ✨✨✨✨✨First ImpressionsDivine Rivals is the first book in the duo series \"Letters of Enchantment\" and I wasn't sure that I was going to read this one, but after receiving many recommendations from those that have similar reading tastes as I do, I decided to pick this up. So I first want to say that Divine Rivals was an incredible read. I have no clue why its categorized as YA though, they are adults in this book, most likely for just marketing purposes most likely. I had really high expectations for this one and it definitely lived up to those expectations. I can see why this one is so well loved. My largest impression is that this had some of the most unique world building I have ever read. It had a quality to it that just drew you in slowly and I really appreciated the delicate nature in the author in being able to deliver that aspect to the reader.First LineCold fog had settled over the depot like a burial shroud, and Iris Winnow thought the weather couldn't have been better.SummaryIris and Kitt are rival journalists that are both fighting for the same position. Iris is struggling with her brother being missing in the war and her mother is a alcoholic. She needs to win the columnists promotion. Roman Kitt has his own home struggles. His father is forcing him into a marriage he doesn't want and going to use anything to his power to get Kitt the position but he is determined to make his own way without his father's aid. When he starts writing letters with a special typewriter and figuring out its from his work nemesis, he is curious to discover what he can but the more they exchange words, the more intrigued he becomes and determined to be the man that she needs. When their ways keep running into each other, they discover a powerful love. But there is a war happening with an enemy that wants to destroy them at all costs. Will they lose each other just when they find a love worth fighting for?What I LovedDivine Rivals is a book I wasn't expecting. I couldn't seem to get enough of and I did this mostly in audiobook and then at the end I physically read it in my kindle. So I absolutely had a blast with the chemistry between Kitt and Iris and it was off the charts. The rivals to lovers aspects was written perfectly. There was such a easy flow from rivals to friends to lovers. They have a powerful connection in their letters and when the truth comes out .....the romance BLOSSOMS in a way that is so epic and beautifully captured. But the angst between them isn't too overpowering either. Its handled with a delicate writ that pulls you further into the story. The atmosphere that is created is so cozy at times but in other times has a more majestic feel to it. It definitely has a 1940's war era type of feel with the technology and clothing and culture of the time. Its a blend of magical realism and historical mythological fantasy mixed together. The magical elements are slowly inforced, so you don't need to worry about being overwhelmed by the world building. The fantastical elements really build in the third act with so much mystery being hinted at in the first half of the story. Rebecca Ross really captured the beauty of love so brilliantly. I was on board with these two as a couple and how they were willing to fight for each other in the third act finale was so precious and captured my complete attention. Its a story of devotion, of healing and redemption and the transcendent beauty of love in the most dangerous of circumstances.What I Struggled WithThe ending was a cliffhanger, not a fan of this but it didn't change my rating or overall enjoyment of the story.NarrationI absolutely adored the narration. There is a bit of an accent so that took some getting used to. But once you get used to it, it really flows so naturally.Overall ViewI found this to be a journey of mystery, connection and magic that will stir the senses and keep you captivated all the way through!Book Details (also in my shelves)Sub Genre: Historical Mythological Fantasy, Magical RealismCharacter Types: JournalistsThemes: Angst, Whimsical, Lyrical WritingTropes: Forbidden Love, Enemies to Lovers, Epic LoveBook PerspectiveDuo POVRelationship Conflict vs Plot ConflictBothSong This Book InspiresThe Power of Love by Celine DionRecommendation For Reading OrderYes",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jazelle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJSLBZEVKQOD3XUURAZJS2EMYKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RDGVFQKONNMA?ASIN=1250857430",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "4.0 out of 5 stars A Story of Magical, Mythology, and Longing",
                "reviewText": "🦇 Divine Rivals Book Review 🦇Rating: ⭐⭐⭐⭐❝ I think we all wear armor. I think those who don’t are fools, risking the pain of being wounded by the sharp edges of the world, over and over again. But if I’ve learned anything from those fools, it’s that to be vulnerable is a strength most of us fear. It takes courage to let down your armor, to welcome people to see you as you are. ❞❓ #QOTD Have you ever had a pen pal OR what book do you want to read before the end of the year? ❓❝ Perhaps it begins with one person. Someone you trust. You remove a piece of armor for them; you let the light stream in, even if it makes you wince. Perhaps that is how you learn to be soft yet strong, even in fear and uncertainty. One person, one piece of steel. ❞🦇 For centuries the gods have slept, only to drag mortals into their feud upon waking. After her brother leaves to fight, 18-year-old Iris Winnow strives to support herself and her mother. She'll need to win the columnist position at the Oath Gazette to do so. Only one problem: her rival, Roman Kitt, who seems to have everything handed to him. In her brother's absence, Iris drafts letters to him on her nan's old typewriter. After slipping them under her wardrobe door, they vanish―unknowingly, into the hands of Kitt. As they write back and forth to one another, they forge a connection stronger than any war. Can the kindled hope between them survive this world?💜 The mingled scents of black tea and smeared ink, the clatter of an old typewriter, and the vulnerable longing left by loss. Add a dash of magic, wailing sirens, the echoes of bombs exploding...it all seems like a recipe for disaster, not an enemies-to-lovers romantasy novel, and yet, these key ingredients set Divine Rivals apart as one of the must-read novels of the year. Rebecca Ross has crafted a clever, enthralling love story that perfectly balances whimsy, fear, longing, and mystery with this deeply emotional, spellcasting first installment. The shared heartache for those they miss and lost unites Iris and Roman in ways they don't even realize from the start. The magic of their typewriters and the vague mythology behind the war mix well with the historical setting. It's the almost-lyrical, poetic prose of their love letters that is perhaps most striking. With each letter, they both shed a bit of the armor they hide behind, revealing scars and vulnerabilities underneath. What starts as an enemies-to-lovers romance full of sass, wit, and charm becomes so much more. By the last few chapters, this story will take grasp of your heart, seep into your bones, and trigger intense feelings of longing until the second novel is in your hands.💜 Iris is a heroine you can stand behind and root for from the first page, but it's Roman who holds the cards in the first half of the novel. Watching him fall first (initially through the love letters), while struggling with guilt, grief, and his familial debt was a beautifully painful experience. I've experienced part of Iris' journey, falling for someone through pen and page; Ross captures that enamorment perfectly. For the most part, the story is more historical fiction than fantasy. The magic seeps into the roots of the story, adding bewitching elements without stealing from the star of the show: the growing feelings between Iris and Roman. They find love in the dark, a spark of happiness in moments of fear and despair. Iris experiences so much loss, only to gain a found family (also, sapphic ship alert!). I rarely, rarely say this, but this is the type of story I'd love to see on screen.🦇 Since this is a slow-burn romance, the pacing does drag at times, especially in the first half. While Ross' choice to sprinkle hints of the mythology and magic throughout the story leaves readers to focus on the character development and romance, it does keep us entirely in the dark. Though the rivalry between the gods started centuries ago, it seems strange that there's little known about its origins. Even the snippets Roman finds (which paint Darce and Enva like Hades and Persephone) feel incomplete. The world-building holds us at arm's length from the fantasy side of the novel until the very end, causing the final chapter to feel nearly out of place. It seems the mythology was restricted only for the shock value of that final chapter.🦇 Recommended to fans of VE Schwab, Sarah J Maas, Jennifer L Armentrout, Lore, and Fourth Wing.✨ The Vibes ✨🖋️ Rivals to Lovers/Dual POV💌 Found Family🖋️ Love Letters/Witty Banter💌 Historical Fiction/Fantasy/Romantasy🖋️ War Setting💌 Magic, Myths, and Gods🖋️ He Falls First💌 Slow Burn",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2024",
                "reviewTitle": "Transcendent, Divine, Sublime",
                "reviewText": "I loved this book. It was real, heart wrenching, a mix of well-worn tropes with mystical, gruesome, enchanting twists. There were moments in this book that left me completely spellbound, rushing to read like every turn of the page was air I desperately needed. While other moments were quiet, small, luminous moments in slow motion. Self-reflection, transformation, dual POV, grief, resilience, mythical intrigue. So much of this was just UGH perfect. I really appreciated that the battles were accurately but not complexly or too gruesomely overwhelming. Ross does a beautiful job of capturing the visceral experience that leaves you just terrified enough to catch yourself gasping and wiping sweaty hands on blankets. I loved this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bobbie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 26, 2024",
                "reviewTitle": "Magical romance!",
                "reviewText": "There is nothing worse than being pumped for a book and then let down so I am very happy with how this book made me feel and that it lived up to the expectations. I say I'm happy because I do NOT want to think about what the second book has got in store for us I just need my precious Iris and Roman to be well!!! Their story and their journey was so wonderful and the way they feel for each other can make you ache and shiver and melt. Roman Kitt THE MAN THAT YOU ARE. I love him so! This book took me on a journey that I haven't expected and it made me want to pick up more ya books I haven't had the desire to pick up before. There is something about the books which aren't explicit that makes the pining and yearning in them somehow better and realer. The best part about this book (aside from Roman and Iris naturally) is the fact that they are just regular people caught in a war. She isn't the chosen one, she isn't magical or special because of it, they are both just young and lonely people who hide behind their armor and, through the letters they share, they manage to take that armor off piece by piece. It gives us as readers a way to connect with them better. However, the story is just beginning and while we don't know much about the gods and this world I assume we are going to learn more in the next one. And honestly the lack of thorough world-building worked for me because I get overwhelmed in fantasy books (and yeah this isn't really fantasy but something in-between)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariana LimaMariana Lima",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 15, 2024",
                "reviewTitle": "very good book delivery",
                "reviewText": "the book came in extremely good conditions, as you can see there are slight bends on the edges but it's expected from a dust cover.It arrived 5 days before it was supposed to so thanks for that.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61x0JNcP0UL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61m0V68hBhL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7184Vcp1ipL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shaljami",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 18, 2024",
                "reviewTitle": "Enchanting Tale",
                "reviewText": "A tale about a girl Iris Winnow who writes letters to her brother Forest, who has volunteered to fight at the war. She pours her heart out about her life, her worries in these letters. Only they are never read, received or replied by her brother. One day she receives a reply. She starts communicating with this stranger. A stranger she suddenly seems to have a mystical connection with.Roman Kitt her rich, handsome and annoying rival at work, never leaves an opportunity to make snide remarks at her. They both compete for the same position of a columnist at the leading newspaper Gazette.Set in a mystical city called Oath, where Gods are at war. I found myself engrossed into this world that somehow runs parallel to our present times. War and its sufferings sends chills down my spine and to be reading it with the present scenario we are facing, it was eerie and heartbreaking. The amount of research the author has put into creating the war scenes are especially inspiring It is a delicate story about themes like love, loss, war, humanity, grief.The letters almost immediately turned into one of my favourite elements in the story.They are honest, intimate and heart wrenchingly poetic delight. The characters Iris, Roman, Marisol and Attie seem easily relatable and exude warmth in their own ways. The love story is definitely accentuated by the letters and develops seamlessly. For all those who enjoy this genre, it is a must read. I can't wait to read the next part of this duology.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "latoya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on December 20, 2023",
                "reviewTitle": "PRACHTIG BOEK!",
                "reviewText": "Zo een mooi verhaal en prachtig geschreven.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}