{
    "remaining_requests": 261,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lapvona-Novel-Ottessa-Moshfegh-ebook/dp/B09GW3P1KJ",
    "body": {
        "name": "Lapvona: A Novel",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lapvona-Novel-Ottessa-Moshfegh-ebook/dp/B09GW3P1KJ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Rf7V8aQuL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ottessa Moshfegh",
            "link": "https://www.amazon.com/Ottessa-Moshfegh/e/B00MC7025W/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 2455,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An Instant New York Times Bestseller!“Lapvona flips all the conventions of familial and parental relations, putting hatred where love should be or a negotiation where grief should be . . . Through a mix of witchery, deception, murder, abuse, grand delusion, ludicrous conversations, and cringeworthy moments of bodily disgust, Moshfegh creates a world that you definitely don’t want to live in, but from which you can’t look away.” —The AtlanticIn a village in a medieval fiefdom buffeted by natural disasters, a motherless shepherd boy finds himself the unlikely pivot of a power struggle that puts all manner of faith to a savage test, in a spellbinding novel that represents Ottessa Moshfegh’s most exciting leap yetLittle Marek, the abused and delusional son of the village shepherd, never knew his mother; his father told him she died in childbirth. One of life’s few consolations for Marek is his enduring bond with the blind village midwife, Ina, who suckled him when he was a baby, as she did so many of the village’s children. Ina’s gifts extend beyond childcare: she possesses a unique ability to communicate with the natural world. Her gift often brings her the transmission of sacred knowledge on levels far beyond those available to other villagers, however religious they might be. For some people, Ina’s home in the woods outside of the village is a place to fear and to avoid, a godless place. Among their number is Father Barnabas, the town priest and lackey for the depraved lord and governor, Villiam, whose hilltop manor contains a secret embarrassment of riches. The people’s desperate need to believe that there are powers that be who have their best interests at heart is put to a cruel test by Villiam and the priest, especially in this year of record drought and famine. But when fate brings Marek into violent proximity to the lord’s family, new and occult forces upset the old order. By year’s end, the veil between blindness and sight, life and death, the natural world and the spirit world, will prove to be very thin indeed.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09GW3P1KJ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Press (June 21, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 21, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2097 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 314 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,336 in Kindle Store (See Top 100 in Kindle Store) #14 in Psychological Literary Fiction #56 in Historical Fantasy (Books) #92 in Historical Literary Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 2,455 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stephanie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHY4KE7YNLG6ZUUS2OHW5JPV3VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLDCIQU9PPWA0?ASIN=B09GW3P1KJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Disturbing Book for Historical Fiction Fans",
                "reviewText": "Before writing this review, one thing I want to address is the disturbing scenes. If you're a fan of horror, specifically extreme horror, this book won't be a big deal for you. But if you're more of a general fiction fan, there are some rough scenes in here. Most of the violent scenes happen off-camera, but there are enough details to where they may be triggering. I was specifically concerned about the cover; it shows a lamb with its hooves tressed, and I figured that implied animal abuse (my only trigger). Lambs are a big part of the story, but any abuse happens off-camera (such as selling lambs to slaughter).Now onto the review. This book takes place in a fictional town called Lapvona. Moshfegh doesn't go into too many details but hints that it takes place in Medieval Times around the modern-day Eastern Europe region. The book immediately introduces a boy Marek, his father, Jude, Marek's \"deceased\" mother, a blind midwife named Ina, and the emperor of the land, Villiam. Moshfegh introduces more characters, but they're all connected and have a pivotal role in the story.The most disturbing parts of the book center around the time period. It's the Medieval Period, so everyone is surrounded by starvation, stink, abuse, sickness, death, and poverty. Not surprisingly, religion dominates the city, but Moshfegh doesn't go into that detail as much as the corrupt priest who's in cohorts with Villiam.What this book proves is the Medieval Period isn't much different from the one we live in today. Villiam, the one in charge of the city, hogs the water, food, and all luxuries while the people suffer from hunger and thirst during a drought. Religion is the centerpiece of the town, and even the priest barely knows the Bible since he doesn't speak Latin (remember, this is before the day of widespread translations) and is only in the position for the power.This is the type of book where you think you know what comes next, and Moshfegh takes a sharp turn. I saw this book promoted within the horror community, so I expected it to be more depraved than it was (why I made that note in the beginning). But I like where Moshfegh took the book and made it more unsettling in a way I wasn't expecting.As I mentioned, there are many characters in this book, and they all change. Some characters started off poor and ended up rich. Greed took over their minds and morals--again, much like the way it is today. There are no \"good\" and \"bad\" people in this book. Everyone is flawed in many ways; some do great things in one part, and in the next, they commit a despicable crime. It's one of the many ways that Moshfegh keeps you on your toes.I 100% recommend this book. I was unsure about it and took it on and off my TBR. But I'm glad I read the reviews because it's one of the best books I read in a long time.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew Holtz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEBMFSDOHJ7TMIX6236PZQ6JOWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P9GKY8QW1PYH?ASIN=B09GW3P1KJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Bleak",
                "reviewText": "I really liked this book but wow was it bleak. I enjoyed the author's writing style and descriptions and, although I was hooked pretty quickly, it was difficult to read at times. Brutal themes in a brutal setting which created feelings of sadness, hopelessness, anger, sympathy, and, quite frankly, fascination. Although a very different plot, it reminded me of how I felt while reading The Road by Cormac McCarthy. I read another review that stated the reader felt like they needed a shower after reading it. I said those exact words to my wife while I was in the middle of the book. This is anything but an uplifting read...but I enjoyed it thoroughly.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexander Boland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AET2226RT2MEXK7EHXBY77OAVRAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12COY7W6EDTIB?ASIN=B09GW3P1KJ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "3.0 out of 5 stars Grotesque",
                "reviewText": "Deeply unpleasant, author delights in ensuring that at every possible turn something worse than you could expect would happen does happen. Requires 10 foot neon trigger warning. Some extremely sharp and beautiful passages though.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTWTM3EIQ3GLPMTVSN4EGTC5ETQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S3KR5FRJ7B6E?ASIN=B09GW3P1KJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Interesting novel taking place in a cruel little world",
                "reviewText": "The book takes place in a medieval setting (I think), in a small village run by an indulgent lord. The main character is a disfigured, pious, unloved boy. We see him interact with his cruel and pious father, the rich son of the lord, the villagers who ignore him, and a witch who also services the village. The book feels to me more like a slice of life in that cold world with twists rather than a straightforward story. Though some actions end up having bigger consequences.I've seen some people put off with some of the cruelty and gross things that happens in the book but I didn't find it too much. You may want to consider sampling the first chapter on Kindle, it sets the tone of the book well.The author seems to be interested in critiquing some of the types of thoughts a performative religious person might have. One particular example I thought was interesting was when one person prayed for another and the author pointed out that he was more concerned that God saw him pray for another than really caring about the person in question. Calling into question the motivation of someone who does good things for the sake of their eternal soul rather than a true love for their fellow man. For instance, some Christians may say that without God they would be awful people since there would be no consequences after death, raising the question if they truly love their fellow man in their heart of hearts or just covering their asses. Would God care, could He tell? Are they fooling themselves? Little things like that happen in the story several times and can inspire introspection as to how I see the world or consider how others might.I strongly recommend it",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Crystal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 4, 2023",
                "reviewTitle": "never read anything like it",
                "reviewText": "addictive book, couldnt put it downlots of horrific acts but it manages to have a good sense of humour about its extravagencerecommend it to anyone who can stomach it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AmazonCustumerAmazonCustumer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 26, 2022",
                "reviewTitle": "The book was good but pretty much half of the pages seemed to be glued together or torn",
                "reviewText": "",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71UHb3i4GUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61BdTJvuUVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61tCdjjnmTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mauricio Montiel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 26, 2022",
                "reviewTitle": "Un fascinante delirio medieval",
                "reviewText": "Celebro que haya voces tan audaces e incómodas como la de la escritora estadounidense Ottessa Moshfegh. \"Lapvona\" (2022), su novela más reciente, es un delirio medieval guiado por la aberración y la escatología que compone un cuadro digno de Hyeronimus Bosch. Un talento dispuesto a correr riesgos que normalmente no se corren en la actualidad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Isabella Shorrock",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 29, 2023",
                "reviewTitle": "Torn between pity and disgust",
                "reviewText": "I loved this book. I think the first half was (for me) stronger than the second, but throughout it was visceral and graphic. Every emotion, landscape, and struggle was beautifully and explicitly painted. I was drawn into feeling pitiful for characters time and time again only to be revealed a disgusting darkness to their character; this book toys with your emotions. Everyone here sucks, but still I wanted to know more about them. It was a little harder to persevere through the second half as I mentioned earlier but I think this was simply because I personally did not care for the politics of Villiam's house and being trapped within his mansion. Overall, enthralling, dark, enticing, and very enjoyable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Len",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 22, 2023",
                "reviewTitle": "Verstörend, aber schön geschrieben",
                "reviewText": "Mein persönlicher Favorit von Moshfegh",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}