{
    "remaining_requests": 384,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Coven-Witch-Urban-Fantasy-Novel-ebook/dp/B0C85WY8W6",
    "body": {
        "name": "Coven of the Witch: An Urban Fantasy Novel (The Other Witch Series Book 2)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Coven-Witch-Urban-Fantasy-Novel-ebook/dp/B0C85WY8W6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91ebDIdZDJL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Heather G. Harris",
            "link": "https://www.amazon.com/Heather-G-Harris/e/B097ZP5J8S/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1683,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Teen-Young-Adults-Kindle-eBooks/b?ie=UTF8&node=3511261011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C85WY8W6"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Hellhound Press Limited (October 27, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 27, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4603 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 254 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,801 in Kindle Store (See Top 100 in Kindle Store) #5 in Teen & Young Adult Magical Realism eBooks #8 in Teen & Young Adult Magical Realism Fiction #9 in Teen & Young Adult Wizards & Witches Fantasy eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,683 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Laurel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWMI2JVAVXDSSIA7ARJNNFQ62GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R118G6F9KBMZ3J?ASIN=B0C85WY8W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Hex of the Witch is brilliant!",
                "reviewText": "Hex of the Witch is the second of the Amber DeLea books, a grumpy but endlessly helpful side character from the Other Realm and Other Wolf series. It's clear in those series that Amber has a heart of gold and a heartbreaking backstory. We've seen more than a little of that story in Rune and Hex of a Witch, in Coven Amber really starts to shine and we learn even more of her secrets, and those being kept from her.Amber is out to put a stop to the Black Witches and track down those in her Coven and the Liverpool Coven. With Bastian by her side, she really stirs up trouble. I love the layers of mystery and intrigue that Heather Harris weaves throughout her tales. This one is just as un-put-downable as the rest.I loved this part of Amber's story and am immediately starting Familiar of the Witch to find out what happens next!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHESLTFMJXLV4Y2M7CIJZJIOTGVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7LDC7FCGDPCK?ASIN=B0C85WY8W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Great..except the ending",
                "reviewText": "I almost took off a star from the abrupt cliffhanger. It was a cr@ppy way to leave the book. Out of all The Other World Series books, I think Amber's storyline is the absolute best. It's well written and Amber is a character you can get behind. A strong yet vulnerable main female lead who also admits when she is wrong. She has such a sweet soul that she hides behind a tough exterior. Her moments with Benji make me tear up.First, if you are thinking of starting with this series. Stop!!! Read Jinx and then Lucy's story first. I made the mistake when I read the first book. There needs to be a better time-line somewhere. Jinx's storyline breaks down The Other World very well.Now, back to the business at hand. This second book was better than the first, and I am so excited for the next book to come. I finished this in hours, sneaking in a read here and there.This starts off not too long after the last book. Amber is still trying to root out more black coven members, and while she does this, you see growth in her as she learns to delegate, trust, and lower her barriers. We learn a bit more about Amber's Mom and get some very shocking revelations. I don't want to say much as it might spoil the story. But twists and turns, sad happenings, and progress. The banter between Bastion and Amber here..chef's kiss.I feel as if with her other female characters in this series, she made her main leads come across as teenagers crushing and blushing. You still get some of that with these two, but it's definitely much more mature. Lucy and Greg were a bit frustrating for me as Lucy was coming across as some school kid when dealing with Greg. And I'm normally shy, but some it was just ridiculous and kiddie.Overall, this was great and a must read!! I may just read both books over again.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Spinneretta",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPBAFBVKOIYW2MKRQBEDBTB6QKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LA8ZKQDIFALL?ASIN=B0C85WY8W6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Good",
                "reviewText": "Amber and Bastion investigate a death at the hands of the Black witches, while trying to avoid assassination attempts.Amber begins to learn a little more about the secrets that are being kept from her.An enjoyable, and action packed tale, this one has a number of revelations that brings to light a rather big mystery in Amber’s background- that has me all agog to know exactly what will happen in the next book.This one ends on a book-hook type cliffhanger, that’ll have the reader eager to know more!It’s a great series, and it’s been fun getting to know the mysterious and ever so scarily competent Amber, and of course learning a very little more about Bastion too.Recommended for the Urban fantasy fan and those who’ve enjoyed other books in Heather G. Harris’s Other World.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole Cunningham",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUUBGI4U4SO3XWXEUAIVHUSNZDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26U3PP5B02UB8?ASIN=B0C85WY8W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "5.0 out of 5 stars So good! I swear I won’t complain about the cliffhanger ending",
                "reviewText": "I won’t mention the cliffhanger ending. Not the fact that it ends in an “Oh crap” moment. Not that Heather is a freakin T E A S E for the entire last chapter, nor the fact that I’m so frustrated right now that I’d have thrown this across the room if it had been an actual book instead of my Kindle. Noooo, not gonna mention any of that.Y’all, this was a great, solid, awesome story until she dumps us on our bums at the end. It has all of our favorite characters doing our favorite things. Lots and lots of tension, near-death experiences, potions, mysteries, explosions, and one notable meeting with the ogre king.I mean, I was racing through it as best as I could, what with needing to work and sleep and stuff. But man, the story was intense! If you liked the first book, I guarantee you’ll LOVE this second one. Like, a solid money-back guarantee. Except for the last chapter. I will not refund your money if you’re as unhappy as I am at the ending. In fact, I don’t even want to talk about it. See? This is me shutting up about the %+^#?! cliffhanger ending.Mostly because I’m going to get started on book 3 in about 2 seconds…",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kimi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4IX5HADWEQWJWPCDDZZCGWCJYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FUW1I82N50NI?ASIN=B0C85WY8W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Epic & exciting adventure",
                "reviewText": "This book brought new adventures. There are still people after Amber and there are new discoveries about who she can and can’t trust. More truths about Amber and her life are uncovered. And she’s discovering more about Bastion. He is right there for protecting Amber from harm throughout. I love how their relationship is growing. I can’t wait to see how it develops further. Loving this series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angelia Drew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6IOE7P76IGCW5C67AUPFO4RCVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V6DTR5ZWMIZ8?ASIN=B0C85WY8W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent book and series",
                "reviewText": "Love how the main character, Amber is written. You get to see her flaws and strengths. The growth of the character through this book and series has been fantastic. The book keeps you suspended in drama as the main character goes from one dramatic moment to another. While the book references characters from her other book series, it isn't necessary to read them if you haven't. Although I do recommend it! They are awesome! I can't wait to see what happens next in the series. I devoured this book in one day. I do wish the author didn't keep telling the same little bits of information in every book, over and over. If we have made it to this book, then we know who Benji is, who Bastion is and that griffins have to kill or go insane. It almost feels like fluff and filler information to make the book appear longer. However, it doesn't necessarily deter away from the storyline. I highly recommend reading this series. It draws you in from the get go and keeps you there.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tlc87",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELGQ5V3YYKQKELRGY2M2JV5Z6BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JIX26JFRUDZO?ASIN=B0C85WY8W6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful!",
                "reviewText": "It was really cool to see a character with fibromyalgia as I've been struggling with it for the last 25 years! As usual, Heather has written a terrific book and I highly enjoyed it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 27, 2023",
                "reviewTitle": "great book",
                "reviewText": "I love that she’s not 20 something, that she’s had to work for her confidence and success. The story line is interesting and the characters well developed. Slow burn romance and no misogyny at all. Amber is likeable and relatable. I can’t wait for the whole story on Bastion",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jackie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 3, 2024",
                "reviewTitle": "brilliant",
                "reviewText": "Love the interaction between the characters. Really enjoying this series. Can’t wait to start the next book and see who ambers father is.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna S. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on January 5, 2024",
                "reviewTitle": "Loved it!",
                "reviewText": "It was just as perfect as the other two, Bastion and Amber are perfect together , and Benji is great!I do wish I knew what went through Bastions mind, we need a Bastion book/s!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 2, 2023",
                "reviewTitle": "Wonderful Characters",
                "reviewText": "I love the people the characters Heather builds in the Other World series. And I especially love a good slow burn, so that's a win in my Books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stacey M-V",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 3, 2024",
                "reviewTitle": "I’m in love!",
                "reviewText": "The second book in this series kicks off with a blast!The threat of the black witches is quickly rising to the top of Amber’s worry list, as her Coven, and the Witches Crone, are targeted. Thankfully Bastion remains Ambers protector, and between him, Oscar and Benji, a golem with a heart of gold, they keep her alive as she hunts down those responsible for the attacks.There’s no relief from the fast pace in this book and it’s a testament to Heathers skill that it doesn’t reach a level of fatigue. She perfectly weaves in moments of intimacy with Bastion, friendship with Benji and family with Oscar in a way that kept my heart on pace with my mind.I loved the little easter eggs that Heather planted in this book, especially the ones that created more questions than answers. It had my brain working over time to see if I could work it out before Amber did.There wasn’t really anything that I didn’t like, to be honest, which is a common theme for me with Heather’s books. It’s no wonder she’s an auto-buy for me!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}