{
    "remaining_requests": 187,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/How-Bite-Your-Neighbor-Wager/dp/B0CCQ8B38V",
    "body": {
        "name": "How to Bite Your Neighbor and Win a Wager: Guides for Dating Vampires, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/How-Bite-Your-Neighbor-Wager/dp/B0CCQ8B38V",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51 XbiLzopL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "D. N. Bryn",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=D.+N.+Bryn"
        },
        "brand": "D. N. Bryn",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1113,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Vincent Barnes has suffered four years as a vampire, and they've been the most miserable years of his pathetic life. Too poor for black market blood, he feeds from sleeping humans to survive. He tries to never intrude on the same prey twice, but after a single delicious taste of a long-lost childhood neighbor, he can't help returning for seconds.Wesley Garcia has been waking up with fang marks. Lucky for him, he needs a vampire—to use as bait. He's certain Vitalis-Barron Pharmaceutical killed his mother, but to gain access to their covert research labs, he has to bring them a bloodsucker for their experiments.Step one, a dramatic offer: Stay, and you can bite me.Vincent leaps at the chance to gobble Wesley up.Wes's plan is perfect. He'll befriend the vampire, then trick him into coming to the lab. No fighting, no fuss. But Vincent is more than Wesley has bargained for: sweet and shy, with intoxicating fangs that awaken new desires in Wes. As the two bond, Vincent believes he might have finally found someone worth putting his trust in . . . and Wes fears neither of them will survive the betrayal he has planned.Contains mature themes. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Books/b?ie=UTF8&node=23"
            },
            {
                "name": "Paranormal",
                "link": "https://www.amazon.com/Fantasy-Futuristic-Ghost-Romance-Books/b?ie=UTF8&node=13356"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "8 hours and 32 minutes"
            },
            {
                "name": "Author",
                "value": "D. N. Bryn"
            },
            {
                "name": "Narrator",
                "value": "Simon Dornet"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "August 08, 2023"
            },
            {
                "name": "Publisher",
                "value": "Tantor Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0CCQ8B38V"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#23,645 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #161 in LGBTQ+ Romance (Audible Books & Originals) #742 in Paranormal Romance (Audible Books & Originals) #3,361 in LGBTQ+ Romance (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Aimee Pieper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBOAGLDLPSGFO3JVW67R7BEGCSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EIFREW8U8RYC?ASIN=B0CCQ8B38V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Top Notch Slow-Burn with a Touch of Espionage",
                "reviewText": "How to Bite Your Neighbor & Win a Wager is a slow-burn romance novel by D.N. Bryn, that also happens to include side-plots regarding vampire rights and committing espionage against an evil pharmaceutical company.“Wesley didn’t tell his legs to move, but neither did he tell his lungs to breathe or his heart to beat. They did so because they were born to, and he was born to run into Vincent’s arms.”This quote occurs very late in the book, but I feel it perfectly describes the dynamic chemistry and slow burn relationship Wesley has with Vincent. Also, I didn’t think it was possible for two characters to be so horny and yet so wildly oblivious.This book was fantastic. I got the horny, vampire fantasy that I bought the book for, but I also received the gradual build to a true, romantic relationship between Wesley and Vincent, as well as an enthralling mystery about the shady pharmaceutical company, Vitalis-Barron, that pretty much owns the town.Without spoiling anything, I want to touch on some key things I really liked about the book. For example, I really liked how morally grey Wesley’s character is, as Kendall, his best friend, describes it. His whole character arc as well is very satisfying as he comes to terms with a lot of his trauma and learns to redeem himself.I liked all of the meta/self-referential moments in the book in the form of comics and video games, and how it was made a part of the world-building instead of being too jokey or fourth wall breaking. The same thing about the true villains, Vitalis-Barron - it wasn’t too jokey, no “dur-hur evil pharmaceuticals” - no man these people are evil and have a deep rooted history in being evil, as most corporations do.The world-building and the politics about being a vampire in general and how vampires live on thin, marginalized lines on the edge of society was also incredibly well done. I love books that take classic vampire myths and decide what to keep and kill from them, as well as recontextualizing them with what it may look like today in a more modern society. Vincent’s experience being a vampire and a semi-closeted gay man explores a lot of what that would look like, but also draws an excellent parallel that gives poignant insight on what it is like to be disabled and LGBTQIA+ in today’s society. I’m sure this was an on-purpose parallel done by the author, and it was incredibly well done.One more excellent thing D. N. Bryn does with the storytelling is how the miscommunication as a romance trope is executed in a way that is believable and moves the story along. Each character has an incredibly valid, albeit dubiously ethical reason to not tell each other what they really want to. I never once felt taken out of the romance, the intrigue, or the suspense of the plot by the miscommunication issues. It was so well done, I had to put the book down and calm down at the blowup/reveal point, because of how stressed out I was about it.Overall this was a fantastic book! I give it 5/5, and I can’t wait to read D.N. Bryn’s sequel to this, How to Sell Your Blood and Fall In Love, when it comes out.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MaryMary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHQA6BTVKLKPPT2AYPWUETJBQ4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMI3KK3NTJUXD?ASIN=B0CCQ8B38V",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Amazing book!",
                "reviewText": "“𝐕𝐢𝐧𝐜𝐞𝐧𝐭 𝐁𝐚𝐫𝐧𝐞𝐬, 𝐖𝐨𝐮𝐥𝐝 𝐲𝐨𝐮 𝐰𝐚𝐠𝐞𝐫 𝐞𝐯𝐞𝐫𝐲𝐭𝐡𝐢𝐧𝐠 𝐨𝐧 𝐮𝐬?”My Rating-(⭐️⭐️⭐️⭐️)Spoiler Free ReviewAfter seeing this book multiple times on Instagram/bookstagram I had finally caved and bought the first two book from the guides for dating vampires, How to bite your neighbor is a dual perspective between Wesley Garcia and Vincent Barns, After Vincent gets one taste of Wesley’s blood he keeps coming back for more, this leads to a funny and wholesome friendship with lots of tension as we see these two sweet idiots fall in love with each other.There are plenty of sweet moments between the two and it really makes you feel for them, as Wesley’s plan for betrayal came around I was nervous to see how it would play out but @dn_bryn did an excellent job at showcasing the true feelings and raw emotions from both characters. This story never had any flat/boring moments, I’ve found myself entertained throughout the whole story. Vincent is really a cinnamon roll who deserves the world 🥹💕-Warnings for this story--Violence including manslaughter/murder-Medical experimentation (not conducted on main characters, in pointer view of characters, or detailed)-Non-consensual blood sucking-non consensual drug-induced sleep-Implied and contemplated semi-explicit sexual",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710RYukfOKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81YOnzxSIbL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ashley kover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE56RAUQEBGHJGUZX2QRGPDWEZQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1K4MWM99L54WU?ASIN=B0CCQ8B38V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars I just loved this",
                "reviewText": "Pretty sure I read this in a single sitting. The *yearning* and the *angst* were impeccable. Also so much tension, I really enjoyed the use of dramatic irony it did so much for the story overall. I wanted to smack each of these incredibly loveable characters at one point or another, though. But only because I wanted the best for them.Also, as somebody who has consumed a lot of vampire stories, this was among the first that pulls off the vampires-as-allagory thing well.Definitely worth the read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chene",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEM2ZGRBPMUKUFH4YTKPX5ASDVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QBWMBXCE9OQB?ASIN=B0CCQ8B38V",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 21, 2023",
                "reviewTitle": "3.0 out of 5 stars A perfect mm vampire read to keep you company.",
                "reviewText": "🧡🏳️‍🌈 Book Review 🏳️‍🌈🧡Title: How to Bite Your Neighbour & Win A WagerAuthor: D.N. BrynPages: 396⭐⭐⭐~Vincent has had a tough four years, not only was he broke, basically homeless and clinging to a job where he's not even sure his boss likes him - he's also a vampire. Without the funds to sustain himself, but he found a solution, to break into houses and feed off humans that won't even realise what happens. That is until Wesley's house of course.Wesley wasn't sure what life had planned for him - but he was sure it wasn't living in an empty house and being fed on by a vampire. However, this can work in his favour if he plays it right.~Guys this book was sad, funny, beautiful and utterly charming. I enjoyed it so much and read it in one sitting. Vincent is honestly too pure for this world and deserves protection from everything and anything. Wesley is Vincent's perfect counterpart - strong, determined and emotionally fragile.Their slow start from strangers to friends to eventual lovers was done perfectly and fit into the plot seamlessly. Also THE PLOT - I loved it and it added the perfect hint of intrigue to this story.It was filled with action and scenes that broke my heart and left me in tears. But the author always made up for it with softer scenes and humour.I think this might have restarted my love for the vampire genre 🤣 and I cannot wait for book 2 in this series!!!🧡",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "m",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 30, 2023",
                "reviewTitle": "Adorable gays",
                "reviewText": "I love a good urban fantasy romance and when the main characters are oblivious gays falling for each other it just makes it that much more delightful. Very cute romance and the plot was fun and interesting too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diana L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 12, 2023",
                "reviewTitle": "Amazing",
                "reviewText": "It was a super great book.I love it cover to cover. I enjoyed it a lot, and im going for the next one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 27, 2022",
                "reviewTitle": "Maravilindo",
                "reviewText": "Esse livro é simple,ente maravilindoooooo!Os personagens são caóticos e apaixonantes!A narrativa é envolvente e fluída de forma que o livro se torna viciante!Recomendo a todos!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cristina matteazzi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 21, 2023",
                "reviewTitle": "Ottima offerta",
                "reviewText": "Era un regalo, molto apprezzato",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L***",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 16, 2023",
                "reviewTitle": "Más de lo que parece",
                "reviewText": "Lo he leído pensando que era un romance entre dos compañeros de piso, pero ha sido más. Hay una trama detrás que hace que la historia sea más interesante. Hay un giro que puedes intuirlo o no, pero que le da dinamismo y me gusta que los personajes tengan conflictos internos en algunas de las situaciones, sin duda, lo hace más cercano al lector.I just read it thinking that it was a romance between roommates, but is han been more. There is an plot that makes the story more interesting, it's not only a romance. Also, it has a little plot-twist, you can guest it or not, but makes the plot more dynamic.The characters are adorable and the have inner conflicts making them more reliable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}