{
    "remaining_requests": 374,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Throne-Ruin-Deliciously-Dark-Fairytales-ebook/dp/B09GZTSY2K",
    "body": {
        "name": "A Throne of Ruin (Deliciously Dark Fairytales Book 2)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Throne-Ruin-Deliciously-Dark-Fairytales-ebook/dp/B09GZTSY2K",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/914UQEKL8+L._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "K.F. Breene",
            "link": "https://www.amazon.com/K-F-Breene/e/B00DJESXNU/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 19207,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09GZTSY2K"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Hazy Dawn Press, Inc. (November 12, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 12, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3848 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 620 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1955757143"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,868 in Kindle Store (See Top 100 in Kindle Store) #24 in Fairy Tale Fantasy (Kindle Store) #30 in Folklore (Books) #161 in Fantasy Romance eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 19,207 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "The Papaya Mama",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3BOMCO5D3UCBHVMXU35WNGDBBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R196GP3PGCO71C?ASIN=B09GZTSY2K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2023",
                "reviewTitle": "5.0 out of 5 stars • Game Changer •",
                "reviewText": "| shifters | SPICY | LIKE, VERY SPICY | dark fairytale | enemies to lovers | fated mates | dragon shifter | humorous | strong FMC | forbidden love | star-crossed lovers | beauty and the beast | alpha |Okay, so listen- I had criticisms of the first book. Nonetheless, I was intrigued so I kept reading. THIS SERIES TURNS UP. Worth it. If you can get with dark fantasy and you like spice, you’ll love this. Keep reading.This book cleared up the two things I took issue with, fully resolved them. I love this series, I am so needy for me. I think the plot has really made some big moves in this book and I can’t wait to see where this takes us.I also adore Finley. I think she is strong and not one to be crossed. I love her strength, I love her attitude, cunning, and absolute appetite for knowledge. She is putting this kingdom on her back, cashin’ checks, and breakin’ necks- literally.I also love the world, it is quite unique, and full of crazy quirks and characters. It is definitely giving utter chaos in a fun and exciting way. If you are a fan of Katee Robert, you will like this.This is my first time reading K.F. Breene’s writing and I am a fan so far. Granted I did take some issues with Book 1, but thats the beauty of a series, it grows.I am so excited to read the rest of this series and hopefully some other series by this author.What a ride!!Happy Reading Friends xx",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "erinaf",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGT2WA5P5M5NTWFT5CF6JUX2KXLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I811D65XSTOU?ASIN=B09GZTSY2K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2021",
                "reviewTitle": "4.0 out of 5 stars Still a great read but a little repetitive",
                "reviewText": "I enjoyed Book Two in this series - probably more than Book 1 as the reader got to delve a bit more into the kingdom created by the author - but I found it a little repetitive and missing some of the excellent writing and world building that's made Breene a one-click author for me. I like smexy times and am not adverse to dirty talk in my books so it's definitely not this that stopped it from being a five star read from me, however when this overtakes the plot? Not so much. I know this is a darker and raunchier book from this author (so don't bother coming at me with the whole 'that's what kind of book this is and it was supposed to be different') so I guess what I'm trying to say is that this aspect took over the story and some of the character and plot development I was probably expecting to see more of. It was still a great read with a lot to like and I'll definitely be pre-ordering the third book, but I probably would have liked a bit more content/substance as the characters and premise are fabulous.Book Two picks up virtually straight after its predecessor concludes so if you haven't read the first installment, you need to as they're not meant to be standalones. While the end of A Ruin of Roses made me a bit stabby (I won't spoil anything), it was remedied fairly quickly at the start of this one and didn't drag on, for which I was grateful, as it quelled my frustrations at Nyfain's actions for the most part as he and Finley entered a somewhat uneasy truce. Thankfully, they don't spend the book apart and when Jedrek pops back up on the scene and makes trouble with the demons, Finley and Nyfain are drawn back together. They go from heavy petting to finally heating things up even further and taking the next step, spurred on my their animals who have it bad for each other. But of course, things can't be that simple. As Finley tries to set things right throughout the kingdom by using her healing skills to cure the constant sickness that's still creeping in on the most vulnerable, trouble is afoot and the demon king finally makes an appearance.While I enjoyed the story, like I said above (being repetitive myself - the hypocrisy isn't lost lol), some of the repetition took the shine off some solid world building. Similarly to the first book, there was constant and astonishingly quick arousal flying off the pages so frequently, I had to wipe my face occasionally to check it wasn't gushing out of the pages and slapping me in the face. While I appreciate dirty talk, especially when done well (and in my opinion, it was good in this book), the words chosen certainly got a frequent work out. One of the ones that stood out for me and certainly took the shine off a lot of moments in question was 'wet'. It was used a lot - I think around 40 times - and to the extent that after the first section of the book, I was equating it with authors using 'moist'. I was questioning whether or not Finley had a medical condition because she was doused with wetness, had wetness sliding down her thighs, gushing wetness, had wetness trickling out of you can probably guess where, wet depths, being suddenly incredibly wet...you get the picture.... Sooooo much wetness that Finley could have opened a wet and wild theme park for the summer months.There was also some laugh aloud moment for me during the detailed smexy times: warmth running down thighs, intense arousal, nostrils flaring, cores pounding, body parts begging for a pounding, Finley desperately wanting to be used (there was lots of this), desire soaking them and a couple of gratuitous raunchy scenes including a random one where Finley shows a bit of self-love. Oh, and the scene where she begs him to put something hard in a lesser-used body part? I found this funny, rather than hot, because it came across as a really bad 70s adult film industry production.It went from the repeated heavy petting in the first book to repeated arousal in this one. There was also a lot of Nyfain trying to pull himself back even though he was aroused and wanting Finley but knowing he can't have her. This contributed to me taking a star off because while this is a well-used trope, having it repeated a lot on the pages didn't help. There was also a lot of Finley pining for Nyfain and wanting him, but then being cranky at him (and having the willpower of a flea when it came to him which kind of went against her personal traits that built her up as a strong female lead - why make her a wilting violet when it came to her beau and her attraction to him?). To be honest, there seemed to be quite a bit of sulking. I get why it was there - it just got a bit old. I also found the tense used in the initial down and dirty scene where their animals were front and centre a bit weird. While I appreciated the sentiment and what the author was trying to get across the pages, i.e. their animals were in control, it read a bit strangely.I loved how jealous and possessive Nyfain was. For Darkness fans (a series by this author) there was a scene where Nyfain could feel Finley's arousal through their bond and became insanely jealous and out of control that really reminded me of a scene between Stefan and Sasha. A lot of the scenes in this book were a bit darker, dirtier and certainly rougher than the norm and this also got a big tick from me as they really suited Nyfain's persona. One of my favourite spins, however, was the emphasis on how sensitive Nyfain was a young man. I loved this and think there should be more of this with male characters in all novels.So to sum up, while it was a good read, I found it pretty repetitive in parts and the plot played out in a predictable way. I enjoyed it, but the bits I mentioned above stopped it from being five stars for me because although I love darker reads with a rougher, jealous and possessive hero (and I lurve Nyfain), I personally would have liked a bit more of a focus on the plot/world to really smash it out of the park. To finish, one of my favourite lines from the book that actually had me laughing out loud: 'Ink before kink' in reference to Finley telling Nyfain to be careful of the books in the library during a smexy scene. Books come first, I get it gurl. And a line I'll be stealing for my own repertoire of insults: 'Don't play dumb... You're already stupid enough'. Gold.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYO5E3QWYHTSBAG2DAQWFOV2AMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MS55IC058U0P?ASIN=B09GZTSY2K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars oh the smut!! I mean woah...",
                "reviewText": "This book is SPICY and holy hotness Batman... just wow... none of it was repetitive, and I was Seriously good. But what even better is the fact that even beating as spicy as it was, this book has a strong plot that is still carrying me into the third book. Yes, it's a retelling of beauty and the beast, but it is a completely original take on it. I LOVE this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Javelin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOA6HIKTYIGD5NU7STKOXI3DVRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y196ZOYGA356?ASIN=B09GZTSY2K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Dark, Dangerous, and Delighful",
                "reviewText": "Every Book by K.F Breene is a treat and this series is no exception. The stories are witty, fun, dark, sexy, nasty, and fantastic. The story lines are unique and fulfilling. I am and will always be a fan of K.F. Breene. Do not sleep on this incredibly talented author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claire thiese",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBJYQYT4UOSLZVOX5TTT57MBCHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AGHJHF8RSA1A?ASIN=B09GZTSY2K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Absolutely delicious",
                "reviewText": "Loved the taunting and teasing of both characters. Had to stop and giggle just from the heated scenes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noodle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAN7SYSEQDUHXCW4CN3FKSV7G7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VKO5Q7EVJ711?ASIN=B09GZTSY2K",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "3.0 out of 5 stars story retelling is good",
                "reviewText": "It’s just too much sex. Lol. Easy reading and you’ll save about 1/6 of book skimming over all the raunch. 😂. Truly don’t think all the graphic sex is needed. We get it. They like to f@&%. Move on. Tell their story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "busy_mom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRWWYF73NDRHFYELHNRHO6OO3JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SEALGTOS2S85?ASIN=B09GZTSY2K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Spice level detracts from the story line",
                "reviewText": "The underlying story continued from Book 1 (brainy Beauty finds and helps the Beast and kingdom) is actually quite interesting and good. But the spice level is almost too much and takes away from the otherwise really good storyline. There is so.much.sex. Not just between the main characters, but seemingly every castle inhabitant. It almost feels forced. (And yes, I do get that it kind of is - thanks to the curse!)It’s almost to the point that it seems the author just wanted to make sure to play out as many different sexual fantasies and kinks as possible in this book.Thankfully Breene is great at world building and story telling! Because the actual story was pretty good. And I do have to hurry this review along so that I can finally start book three. Because extremely-spicy or not, I want to see how this story continues.(And don’t get me wrong I do not mind spiciness in books, this one just seemed kind of over the top, forced and IMO detracted from an otherwise interesting plot.)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4NIOZRD4AVXP4EL6VZJXDBPUGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4ONNGT0FVAUT?ASIN=B09GZTSY2K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars amazing",
                "reviewText": "When I first started the series, I was skeptical but just within the first few chapters I could not put the book down. Amazing, spicy, and overall wonderful.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Talita N.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 19, 2022",
                "reviewTitle": "Muito quente",
                "reviewText": "Esse livro é definitivamente muito quente e inesperado! Amazon por favor traduza ele! Ler em inglês e meio lento p mim mas tive que continuar! E sim vou ler o terceiro!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Poetic Puppy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 31, 2023",
                "reviewTitle": "Keep it coming",
                "reviewText": "‘A Ruin of Roses’ set the stage and now ‘A Throne of Ruin’ is going to lead us on a merry dance.Book 2 picks up right where book 1 left off. Nyfain has done the noble thing and left Finley with her family. Obviously, she’s not too happy about this, but their push-and-pull relationship is far from over. The fate of the kingdom is in their hands, and despite the distance Nyfain wishes to keep between them, they will need to work together to help the sick and the dying. Fate, and their animals, won’t allow them to stay apart for long.I loved watching Nyfain and Finley fall for one another throughout this leg of their journey; even if the end of this novel does end in heartache. That’s a small spoiler I suppose, but it’s also a warning. You won’t want to stop reading, so be ready to move straight on to book three. That said, enjoy the ride while you can. The couple learning to work together, supporting one another and respecting the other is a beautiful thing. We aren’t watching two weak, lost characters strengthen and grow into new and better people, we are watching two strong, independent people, learn how to lean on one another and push each other higher. We’re watching the kingdom strengthen and grow, despite the crushing oppression of the curse.It also bears mentioning that, as I suspected, the heat level goes right up throughout this novel with some very imaginative and filthy scenes. So if erotica is not your thing, I would definitely advise you proceed with caution. We see a little of the “castle’s delights” but I would say that the main focus is upon the leading characters, who are on a very physical journey that strongly ties in with their emotional one. It’s sweet, sexy, filthy and at times down right depraved. Sex in this book definitely runs the gamut. But, and this is the important part, it doesn’t detract or take the place of the plot. There’s just as much going on when the characters are fully clothed, as there is when they aren’t.Cheers!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Radhika Bansal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 2, 2023",
                "reviewTitle": "A heroine who never quits",
                "reviewText": "Finley is not the heroine but the HEROine the story. She will not appreciate Nyfain distancing himself from her and will fight tooth and nail for the relationship they share. i think that this book may have led me to some letter writing myself...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miss MT",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 18, 2023",
                "reviewTitle": "Loved it!",
                "reviewText": "Great story and writing. I thoroughly enjoyed it and didn’t even have to clutch too many pearls.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lady Morrigan De Glencoe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 7, 2022",
                "reviewTitle": "Probably one of the best story I've ever read so far",
                "reviewText": "Ok,I'm a huge fan of fantasy and dark fantasy (and spicy fantasy as well). And this series combines all of them.The story is brilliant, there's love, darkness, blood, plots I didn't see coming, and I'm just longing to know how it will ends.I read a LOTS of book, around a hundred each year (with some re-read), in a large variety of styles (thriller, horror, fantasy, fantastic, and so on). I'm not a huge fan of romance, except when the plot is good, fresh, new (and at leasr a little kinky, i'm honnest).This series combines all my favs. Can't wait to read the next one. And since I've discovered this series throught the kindle rent, i'll buy them to make sure they're always in my library.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}