{
    "remaining_requests": 195,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Death-Jane-Lawrence-Novel/dp/1250769582",
    "body": {
        "name": "The Death of Jane Lawrence: A Novel",
        "price": "$11.89$11.89",
        "originalPrice": "",
        "rawPrice": 11.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Death-Jane-Lawrence-Novel/dp/1250769582",
        "soldBy": {
            "sellerID": "AE733LH9LN58Y",
            "name": "Tranquility Trading Company",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=AE733LH9LN58Y&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41LGuTazqXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51eVCV-Tp4L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Caitlin Starling",
            "link": "https://www.amazon.com/Caitlin-Starling/e/B07HDTSY4C/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Tranquility Trading Company",
        "customerReview": "3.6 out of 5 stars",
        "customerReviewCount": 1031,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 23 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 10 hrs 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ St. Martin's Griffin (October 4, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 368 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250769582"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250769589"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.3 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.4 x 1 x 8.15 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#276,956 in Books (See Top 100 in Books) #1,252 in Gothic Fiction #2,256 in Historical Fantasy (Books) #6,754 in Romantic Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.6 3.6 out of 5 stars 1,031 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Donna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4APU47C63CJZNIKS7UMZN25X7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13TV9IEF9IQ8T?ASIN=1250769582",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Prompt delivery",
                "reviewText": "Book in good condition",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Victoria",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW6QI5JWFMLKE2PI7ES6ZCGJPZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8UFZWL4JAK7B?ASIN=1250769582",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 10, 2023",
                "reviewTitle": "4.0 out of 5 stars Impeccable Vibes",
                "reviewText": "I just finished all of Shirley Jackson’s work and I wanted more of the same vibe this wasn’t spot on, but enough for me to be satisfied.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda @ Literary Weaponry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGF3EL46Y32ZIXUYIU3W4QEGW22A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19QI430BCFGUM?ASIN=1250769582",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2022",
                "reviewTitle": "3.0 out of 5 stars First half was great, second half went a little off the rails",
                "reviewText": "Do you ever get to the end of a book, having read the entire thing, and find that you just don’t have anything truly definitive to say about it? I find that most often happens with books I’ve rated 3 stars and this time is no different.Sadly, I did not expect, in the slightest, to be giving this book such a middle ground rating resulting in that lack of feeling. I was excited to read it and, as soon as I was in the mood for a bit of horror, immediately snatched this one off my shelf.For the first half of the book, it did actually live up to what I hoped. We have the main character Jane who is looking for a husband as her guardians are moving away and has a very clear set of expectations of that husband. She has compiled a list of eligible men who would, in theory, allow her to continue working, would not expect the time-period appropriate wifely duties of baring children, and for the most part would just leave her alone. Jane finds that match in the local surgeon Augustine.During that first half of the book, Jane learns more about Augustine and the dark secrets he is quite obviously hiding. She is also learning about herself, her own curiosity, and her willingness to push boundaries. Watching Jane sink farther and farther into the mysteries hiding in Augustine’s mysterious house is wonderful! Her questing and intelligent mind was fun to be in and I was very much looking forward to seeing what came of the ghostly apparitions and Augustine’s erratic nightly behaviors.Then, the roots of the mysteries start unravelling and Jane begins losing who she is in her obsession with them. At this point, the book kind of lost me. The answers and information that unfold just didn’t feel right to me. Jane’s actions that follow these revelations were equally baffling. It is difficult to follow along and be swept up in a story when the actions the lead character takes cease to make sense with the structure that character had been built with. The conclusion was equally frustrating and, honestly, at that point I had stopped caring.In a nutshell, the first half of the book was entertaining and kept me engaged and looking forward to picking the book up. The second half, I had stopped caring about the characters and the story just didn’t feel right with the information the reader had been provided previously. If I were rating the two halves separately, I would give the first four stars and the second two stars (hence my overall average of three). Would I pick something up by the author again? Maybe, but it wouldn’t be high on my priority list.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lauren Peterson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYXAUFEMITXGZWLXZW2HPCERATA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCE7V0P5E2C8O?ASIN=1250769582",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2021",
                "reviewTitle": "2.0 out of 5 stars Not what I expected...",
                "reviewText": "Caitlin Starling’s “The Death of Jane Lawrence” was one of my most anticipated October reads. I’m a huge fan of gothic horror and the premise of the book promised a delicious mix of the elements from the genre I love most. Too bad the elements combined resulted in a mess.Jane proposes a marriage of convenience to Dr. Augustine Lawrence. It won’t be a marriage of love, but a calculated one based on mutual respect, convenience and security. Jane will continue with her love of numbers helping the doctor with his books and he will keep his secrets surrounding his family manor Lindridge Hall. No questions, no jealousy, nothing more than a business deal. Jane promises Augustine she will never visit the manor—ever. Their agreement works until Jane and the doctor fall for each other. Despite their deepening feelings, Augustine insists Jane keep her promise to stay away from the manor but when an evening accident forces her to stay the night, she is startled to find Augustine in a state of confusion, fear and erratic behavior. In the morning, he his back to his normal self. Jane soon realizes the man she’s married has far more dark secrets than she could’ve possibly imagined and all of them seem bound to the seemingly haunted manor.The story started off strong with good pacing, good character development and an intriguing plot. About a third of the way through though, it turned into sludge. It went on and on, became repetitive and dense. Halfway through, magic took over the entire story diluting character development and plot. We were literally stuck in time with Jane and nothing was happening day after day and anything that did happen was usually written off as a dream or hallucination by the next page. I liked Jane starting out—she was independent, smart and calculating only to completely unravel and behave totally against the character qualities we were initially introduced to. Suddenly she was dependent, illogical and helpless. The setting was also jarring. It takes place in a made-up time and location supposedly mirroring post-war England. I’m not sure the reason for that as it added no value to the book and in fact read as much more Victorian London than post-WW2. It was odd, confusing and not the gothic horror I had hoped to read.",
                "reviewVotes": "46 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Gilbert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDSKVPLEMTURH242TFKQIAPHAMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ECPN7CUBX04T?ASIN=1250769582",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2021",
                "reviewTitle": "5.0 out of 5 stars Uniquely Gripping",
                "reviewText": "It's interesting - though not surprising - to see so many divided reviews on this book. I've noted a few talk about how it \"changes\" a lot midway/60% of the way through the book. That's definitely true!I didn't know a thing about it when it was recommended to me (on the strength of my affection for Crimson Peak, but my disdain for Crimson Peak's ending), so I began it initially thinking that it was a perfectly pleasant and enjoyable gothic romance that would likely have some sort of unique twist, but was not totally sure until the first mention of magic.I think that, for some, if you go into this book expecting a fairly straightforward gothic romance/horror story in terms of typical tropes, you'll definitely be half-satisfied. If you go in knowing that there's a very unusual turn partway through, and that it eventually becomes a very interesting sort of approach to coping with trauma and shame, you'll likely be more forgiving/less shocked when suddenly it's not really a ghost story as you thought it was.I'll be thinking about the end for a while; I think I get it, but I'm not sure, and I may re-read just to see ---- but all the same, it was highly enjoyable and so engrossing that I read most of it in one night. I appreciated the unique spin, the interesting characters, and the unusual take in terms of incorporating discussions of \"magic\" and the way in which the mind operates. Definitely a fun, spooky fall read. I just again emphasize that it's a good idea to adjust expectations if all you're looking for is a story about a crumbling mansion haunted by someone's dead wife!",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kaitlin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 14, 2023",
                "reviewTitle": "Came dirty",
                "reviewText": "I was really excited to get this book and it came intact however there was some sort of oil on the front and back. I used an alcohol swab to clean it which seemed to do the trick. However I wasn't impressed. Otherwise no other damages.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 29, 2023",
                "reviewTitle": "Genius!",
                "reviewText": "WHAT….THE….HECK!!!! What did I just read? It’s like a Laura Purcell gothic horror story but on steroids!!! 😱This gothic tale of madness, loss, grief and black magic will destroy your mind! At times, it was so “out there” that you kind of lose track of what the heck is going on! Some of it I had to go back and re-read as it so confused me that I couldn’t get my head around it. This authors imagination is like the Stephen Hawking of the Supernatural! Genius but eccentric, confusing but brilliant, simple yet bat poo crazy….. and I LOVED it!!If ever there was a moral for using black magic or dabbling in the occult, then this book would be it; you reap what you sow, would be it’s epitaph! Remember that when next thinking about using black magic to bring something into being!Read this book until the end, don’t give up when it gets a bit “far-out”….. it’s pure supernatural, crazy, GENIUS!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fobce_982",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 16, 2021",
                "reviewTitle": "Wonderfully atmospheric read",
                "reviewText": "The Death of Jane Lawrence is one of the most atmospheric books I’ve read in a while. I loved the increasing paranoia and how neither Jane nor Augustine were always likeable characters. Some of the scenes were very vivid in all their gory glory, so a heads-up if gore is not for you.A few of my questions about the exact details of how the story unfolded and about the properties of magic were left unanswered but that might have been because the worldbuilding was quite complex and I was too dumb to catch the answers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brida",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 25, 2023",
                "reviewTitle": "A bit of a mess, in the end",
                "reviewText": "Sitting down to write my thoughts about this novel is hard. I'm not sure if I liked it, or not. For the most part, I'm not even sure that I understand everything that went on. This is a novel that feels like it is a novel of two halves: the first drew me in, but then the second seemed to turn into a bit of a mess. I felt that the novel was too long winded, and perhaps if it had been a shorter tale, it would have had more impact. Instead, I found this one turning into a chore to get through. Any horror element lost its impact, as I felt that I had to trudge through the later parts just to get it over with.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.29",
                "sellerName": "Yakutstore",
                "sellerRating": "4.5"
            }
        ]
    }
}