{
    "remaining_requests": 357,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hell-Bent-Novel-Alex-Stern-ebook/dp/B09W14K6JB",
    "body": {
        "name": "Hell Bent: A Novel (Ninth House Series Book 2)",
        "price": "$12.99",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hell-Bent-Novel-Alex-Stern-ebook/dp/B09W14K6JB",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71Ovi8nl0gL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Leigh Bardugo",
            "link": "https://www.amazon.com/Leigh-Bardugo/e/B005ZZ8XQS/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 9935,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09W14K6JB"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Flatiron Books (January 10, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 10, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 10078 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 486 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ B0CC2RQFP4"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,940 in Kindle Store (See Top 100 in Kindle Store) #31 in Occult Horror #51 in New Adult & College Fantasy (Kindle Store) #53 in Occult Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 9,935 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3d17f065-a6ee-4c5e-b7c4-4e4a7a4fdc53.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cfb129eb-9fee-419b-82b9-2c91bcd20bed.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45e1eaf8-b62d-41e3-872c-70767e8e84ec.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0647a47f-f6d7-417a-8d76-5fdc185110c6.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/833f4438-b3c1-4a53-996a-8a5dbc3de13c.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Becket Hampton Warren",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4O7YWEED6AI7LWYJCWTEXNNO6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTU0XKUPXJMIF?ASIN=B09W14K6JB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Complex, Tense Journey to Hell and Back",
                "reviewText": "The follow-up to Ninth House, Hell Bent tells the story of Alex Stern’s determination to restore the Virgil to her Dante at Lethe. Lethe is ninth house introduced in the first novel, the oversight house at Yale University, where long standing tradition means that eight powerful houses, or societies, use the arcane and magic to alter reality or prognosticate or otherwise guarantee their alumni continue to live lives of privilege and prosperity. Lethe observes their rituals and workings to keep them both unobserved by outside eyes, and also undisturbed by the occult, any ghostly forces that would interrupt or play havoc with the magic integral to the ceremonies and rites being conducted in secret by these eight houses inside Yale University’s venerable tombs and classroom buildings.Alex Stern’s mentor at Lethe,Daniel Arlington, is sucked through a portal of some kind in the middle of the first book. With the assistance of Lethe’s Oculus, Pam Dawes, Alex is determined to rescue Darlington and bring him home. The circumstances surrounding this random accident are suspicious and Alex isn’t having it. Working against this goal are many obstacles, ranging from past to present. There’s blowback from Alex’s lurid and unsettling past as a strung-out teen in California; there’s the distrust and resistance Alex and Dawes encounter from the adults in the Lethe organization, from the Lethe-liaison police detective with whom they worked to solve a murder in book one, Ninth House, to the faculty and university administrators within whose imprimatur they must work, who discourage investigation and sadly shake their heads and write off a young man’s loss—his assumed death—as an unfortunate hazard of the job.Determined as Alex and the reluctant team of other characters who join the quest are to bring Darlington home, their objective becomes enormously daunting, nearly unthinkable, when it becomes clear that they must steal back Darlington’s soul from hell itself, and that they won’t be the first Yale students to make the trip to the underworld and back. What price will they pay to save Darlington, Lethe’s “golden boy” who was intentionally sucked into the demonic realm? The action is fast-paced, urgent, and suspenseful. It cost me as a reader to go slowly, to savor the story instead of devour it. This novel builds a rich and layered world with a strong central narrative objective (getting Darlington’s soul back) which is further enriched by all sorts of extraneous and intertwined complications:—like the reappearance of Eitan, the West Coast Israeli drug kingpin who ensures Alex’s compliance in working for him by obliquely threatening her mom’s well-being;—like Alex’s realization that the spirits of the dead, the Grays she’s always seen, can speak to and through her and can even momentarily hijack her body to talk to living people;—like the fact that human souls can be ripped out of bodies, and a such a body can return to the regular world, sans soul, to hang out in a warded circle in his childhood home, naked, beautiful, bearing glowing golden badges of demonic indenture, featuring horns, and a robust erection;—like the fact that vampires actually exist(!);and—like the inclusion of Alex’s roommate, Mercy, who has not hitherto been aware of the magic suffused into the fabric of her university, into the elaborate Darlington rescue plan— all these twists and turns, make the story both more relatable—life throws complications at us constantly, even when we are in the midst of Big Things—and also more complex, lending the book the wonderful, fully-developed richness that readers so love and expect from Leigh Bardugo’s novels.This second Alex Stern novel is an easier read than Ninth House, I thought, because the time line is relatively straightforward. I reread Ninth House before launching into Hell Bent (I often reread a novel before I read its sequel), and I was once again struck by Leigh Bardugo’s use of a wildly fractured narrative time line. The reader has to piece together what has occurred to get to Alex’s enrollment at Yale, then figure out Daniel’s a sense and what caused it, and how the past has shaped him almost as much as Alex’s has shaped her. Reading it feels disjointed, complicated, disassociated, something like being in a fugue state—like waking up on a stained mattress and not knowing how one’s best friend could be no longer alive, or how the room around one became splintered and wrong and littered with the blood-splattered remains of people one knew, all while one was apparently unconscious.I loved this novel, its predecessor, and I am eager to find out what happens next, though the wait for book three will no doubt be agonizing. I recommend this novel—and this author—wholeheartedly. Hell Bent is 100% great read.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LA in Dallas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4AGB3JJOROF4KGTO62ONBLTS4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LA6EFE74F2C0?ASIN=B09W14K6JB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Yale University hosts another fantasy",
                "reviewText": "Hell Bent is the second, and (as of 25-Jun-2023) last published book in Leigh Bardugo's Alex Stern series. (There will be spoilers for Ninth House, so stop reading now if that is a problem for you.) These novels take place mostly at Yale University, and almost entirely in the neighborhood of New Haven, Connecticut, the city in which Yale is located. Bardugo graduated from Yale, where she was a member of Wolf's Head, one of Yale's notorious secret societies, and she is still associated with the university. This feeling of place and history is one of the best things about the books.The fantasy premise of the series is that the Yale secret societies, particularly the most prominent, which Bardugo refers to as \"The Ancient Eight\", conduct secret magical rites in order to enhance their wealth and power. Furthermore, because these rites are dangerous, there is an even more secret ninth house called Lethe, whose job is to monitor and police the Ancient Eight. Galaxy (Alex) Stern was recruited to Lethe at the beginning of Ninth House as its newest and most junior member and was given a full scholarship at Yale, because she had the ability to see ghosts.We learned in Ninth House that Alex's abilities go far beyond this. In fact, the book ends with a \"Yer a wizard, Harry!\" moment in which Alex's gift is named and defined in terms of a longer tradition. Alex is a Wheelwalker. She can communicate with the dead. More, she can take possession of the souls of both dead and living people.Hell Bent is a quest novel. Ninth House ended with Alex's senior and mentor Daniel Arlington (Darlington) being sent to Hell. Alex and her Lethe colleagues' quest is to go to Hell (thus, they are \"Hell bent\") and bring Darlington back. It's a great story and I thoroughly enjoyed it.At the same time, Hell Bent lacks something that made Ninth House special. It was clear to me as I read Ninth House that fantasy was only a transparent mask over real problems -- the exploitation of vulnerable girls and the barely licit means used by powerful people to perpetuate their power. Ninth House is scarcely a fantasy. Hell Bent, in contrast, is full-on fantasy. Although there are connections to reality, they are less central in Hell Bent. The moment in which Alex's superpowers were named really weakened the story, for me. Hell Bent is still, however, an excellent fantasy novel, even if it does not quite measure up to the outstanding Ninth House.While Hell Bent doesn't exactly end on a cliffhanger, it does leave some loose ends dangling. I am confident for this reason that Bardugo plans a sequel. Indeed, she has confirmed that she plans it to be a trilogy. I certainly intend to read it.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LDJordan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA63CWNDMEC3QPQZKXHUVT2ILKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJVTAPYZ7O9LY?ASIN=B09W14K6JB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Could Not Put It Down!",
                "reviewText": "Loved the second book in this series! The imagination of this writer to create a secret world of hell behind the living with a bent on the origin of vampires is intriguing. I have read so much over my lifetime of fantasy that most storylines become formulaic and predictable. Not this! It’s unique and engaging. The characters become companions as I read. Definite thumbs up!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Darby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWRCEVYK72D6SM5YXXNBCTW7REA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSHYN0C2X3VK2?ASIN=B09W14K6JB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing again!",
                "reviewText": "Started a little bit slow for me, but that maybe because it had been a while since I read the first book. Once once the pace got going, I was hooked again, and pleasantly surprised and enthralled!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heather Szentimrey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 26, 2023",
                "reviewTitle": "YES.",
                "reviewText": "This book was everything and I need to re-read it asap so I can live in this world a little longer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Netely",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 7, 2023",
                "reviewTitle": "Uma sequência incrível",
                "reviewText": "Amei esse livro, ele chegou em perfeito estado e apenas um dia após a compra.A capa é linda, a edição é muito boa e a história é maravilhosa. Hell Bent é agitado do começo ao fim de uma forma muito boa, é impossível ficar entediada durante a narrativa pois embora o livro seja grande ele te prende desde as primeiras páginas.A relação dos personagens é maravilhosa de se ler, eu ri em vários momentos por causa do Turner, a Dawes continua sendo a minha protegida e eu amo a relação da Alex com o Darlington (mas ainda sobrevivo de migalhas com esse casal). Os outros personagens tbm são incríveis é o universo desse livro é muito perfeito.Por fim, recomendo demais!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 13, 2024",
                "reviewTitle": "Fantastic!",
                "reviewText": "I don't leave reviews but, fantastic! I read this book in a day!! It's well written, the characters are fleshed out, and it's fast paced and full of twists and turns. The ninth house was good, although it took me a while to get into it, but the second book, (hell bent)....loved it, way better than the first.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "adityaaditya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 19, 2023",
                "reviewTitle": "Not a library binding",
                "reviewText": "It's a good quality paperback but not a library binding as mentioned in the webpage.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Oh+MCL8UL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 8, 2023",
                "reviewTitle": "Bardugo never disappoints.",
                "reviewText": "What can I say? I loved it. It was my most anticipated book of the year and I had a blast reading it. It's just...good. I can't wait for book 3.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}