{
    "remaining_requests": 309,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Final-Fantasy-XV-Dawn-Future/dp/1646090004",
    "body": {
        "name": "Final Fantasy XV: The Dawn of the Future",
        "price": "$17.59",
        "originalPrice": "",
        "rawPrice": 17.59,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Final-Fantasy-XV-Dawn-Future/dp/1646090004",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81uwTCaOtML._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jun Eishima",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Jun+Eishima&text=Jun+Eishima&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 2314,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Jun Eishima was born in 1964 in Fukuoka Prefecture. Her extensive backlist includes stories set in the Final Fantasy, Nier:Automata, and Drakengard universes. Under the name Emi Nagashima, she has also authored The Cat Thief Hinako's Case Files, among other works. In 2016, she received the 69th Mystery Writers of Japan Award (Short Story division), for the title Old Maid."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 2 hrs 10 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 10 hrs 40 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A volume of all-new, character-driven stories expanding on the world of the hit video game Final Fantasy XV. This deluxe, hardcover edition includes full-color inserts featuring concept art and exclusive content.To oppose the gods or yield to fate? That is the question confronting each of the characters in The Dawn of the Future. Ardyn, having saved countless lives from the Starscourge, means to become the Founder King of Lucis and instead is cast into tragic exile. On the day the Empire falls, as the imperial capital collapses around them, Commodore Aranea is entrusted with the life of a singular young girl. The Oracle Lunafreya, upon awakening from the slumber of death, discovers that her body has undergone an extraordinary transformation. And after gazing upon the eternal, Noctis, the True King, finally comes to terms with his destiny. Herein lie the stories of the dawning of a new world in Final Fantasy XV.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Square Enix Books (July 14, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 384 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1646090004"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1646090006"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.49 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 1.45 x 8.6 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#60,967 in Books (See Top 100 in Books) #562 in TV, Movie & Game Tie-In Fiction #2,654 in Science Fiction Adventures #2,996 in Fantasy Action & Adventure"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 2,314 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joseph",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPPVS4K7P3SELGH423N5W7RD2OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJZR395C7AGEF?ASIN=1646090004",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 17, 2020",
                "reviewTitle": "5.0 out of 5 stars Walk Tall, My Son",
                "reviewText": "WARNING: There are potential spoilers ahead, but I am attempting not to be specific with them. Hopefully you are here reading the reviews because you’ve played the game and are looking for the “true” ending. You’ve found it.ALSO WARNING: This is long. TL;DR at the bottom.Final Fantasy XV began production when I was a teenager. I purposely did not do any research on the game before it was released. I wanted a completely fresh experience with no bias except that it was going to be awesome simply because of Square Enix being Square Enix.I was not disappointed.When the game released in November of 2016, I did the “normal” thing and took a week off work to experience the entire story from beginning to end at my leisure. One of my best friends actually bought this game for me as a birthday gift, being that my birthday is in November. My wife did NOT take a week off work, so I was able to play this game entirely by myself.Big mistake.One thing I’ve been doing with my wife over the past several months thanks to COVID-19 is replaying some of the great games that actually left an impact on my life. Final Fantasy XV is one of them, but I haven’t started it yet due to it being both long and extremely emotional (for me, anyway). My wife didn’t cry one bit at the end of FFX, so I assume she must be a sociopath or something. Anyway, watching me play the games of my past has helped my wife to better understand me as a person and to get a glimpse into my nerdy side. I can be anyone to anybody, but I can only be myself with my wife. It’s both wonderful and embarrassing at the same time. That’s one reason we haven’t started this game yet.I can count on one hand the number of games that I feel do justice to portraying fatherhood. Final Fantasy XV is at the top. I was not a father at the time of this game’s release, but I learned early on to take lessons in parenthood from every source available. And yes, that includes (some) video games. Let me explain:The way the development team displays the relationship between King Regis and Prince Noctis is subtle. Regis knows exactly what is going to happen to his son, and he knows it’s the right thing to do (or rather, let happen). But that doesn’t make it one single bit easier on Regis. In fact, it makes it harder. If there were another option to “ending the crisis” of the world, he’d take it in a heartbeat. Instead, Regis sent Noctis out into the world knowing full well what would happen to him. Instead of being depressed and remorseful, Regis took pride in Noctis, even though Noctis literally had no idea of what his fate would be. Noctis viewed his father with respect and love, and the events that took place after his departure from Insomnia would only serve to bolster those feelings.What the hell does this have anything to do with the book? Everything.I mentioned that Regis would have taken any other option presented to him in order to prevent his son’s fate from happening. This book IS that option. But rather than Regis choosing it, Noctis did. And that shows how sometimes parents can be “rightfully” wrong. Regis had accepted Noctis’ fate, and he carried that weight since the moment of Noctis’ birth. And instead of feeling sorry for himself, Regis chose to become the father his son would need, not his savior. In doing so, Regis taught Noctis how to become what his people needed, despite the pain of loss and heartbreak. He taught Noctis how to push through everything and choose the right path, even when that path deviated from the clearly-defined rules. Noctis went with his heart in his decisions, and it not only changed his fate, but the fate of everyone.When I joined the Army, my father kept his views to himself. I knew he wouldn’t like it. Actually, if it weren’t for the fact that my mother had sole custody of me and signed the release form allowing me to swear in (I was 17 at the time), I wouldn’t have been able to. My dad didn’t accept my decision. A lot of his friends went to Vietnam and never came home. He viewed the War on Terrorism the same way. That is, until he got over himself. He was never eligible for the draft due to a pre-existing medical condition (which I inherited, thanks Dad). He told me later on of the guilt he felt for not volunteering to go after his friends were “voluntold” to. He told me he was jealous of my decision to join the Army because of the shame he felt in himself. I would never have guessed that, coming from him. My dad is tough, and he isn’t the kind to talk about his feelings. But he did teach me to do the right thing, and I felt the right thing to do for myself was to serve my country. It’s a feeling that less than 0.5% of our population actually acts on.I’m a father now. I have two children, a boy and girl. My son is the eldest, and he’s adopted. We brought him home from the hospital one month after he was born. His mother was addicted to drugs throughout the pregnancy, and he almost died because of it. He spent his whole first month of life in the ICU. You’d never know looking at him today. My daughter is biological, and thankfully looks nothing like me. She’s tough, like Dad. She and my wife both almost died during labor. I’ve never been so scared in my life, not even when being shot at. And now my girl is taking her first steps. Both of my children had near-misses with “fate”, and neither one of them gave in.The original ending to FFXV was good. I was “sad”isfied. This book changed that. It made all things right in the end, and I hate that the production of the DLC was cancelled. The public deserved to play and experience the events that happened in this book, but at least we get to read about them. Yes, everyone really is happy in the end.I chose my fate, and I’m still choosing it to this day. That’s why I relate to Noctis. I am so proud of my children, and I’d do anything in my power to protect them. That’s why I relate to Regis. I’ve held a lot of professional titles, and I’ve been called many things. But by far, the best title I’ve ever held and the best thing I’ve ever been called is “Daddy”.TL;DR: Stop reading, buy it. Worth every penny. Those with minor annoyances such as typos and \"loose ends\" can get the Starscourge for all I care.",
                "reviewVotes": "86 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eisah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMUMHGB2CVXWKZWE5SEIH5MLCWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LM5U7ATKFO7E?ASIN=1646090004",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2020",
                "reviewTitle": "5.0 out of 5 stars Like a blueprint for the DLCs we didn't get",
                "reviewText": "The first 25% mostly rehashed the Ep Ardyn DLC, though there's a few little tidbits. One thing I thought was hilarious was that while most of it was translated with the English version in mind (for example, Verstael has a distinct way of speaking in English), there are little bits where you can tell the Japanese voice actor was who it was written for.Example: Just imagine the English language version of Verstael letting out a \"shrill shriek\". I'd pay good money to hear that.When you read the book you can basically picture how the DLCs were supposed to go. This is the cutscene that was meant to be. This would have been the mini boss. This was the big end boss. Etc etc. You can definitely tell what was planned and I feel disappointed that we missed out on these DLCs. I would have loved to do Aranea's jumping and see Solara in action. Especially after Ep Ardyn - controlling Ardyn felt so good.Spoilers:For people who are worried about it like I was: no, Ardyn's character is not ruined. It stays true to his character to the end, just like you see in the game, without feeling the need to change him to make him necessarily a 'good guy'.I liked how they solved the ending with one having to fight Bahamut in the great beyond and one fighting him on Eos. I thought that was a clever way to end it, giving them both something to do that made sense for both characters.I think a few plot points got brushed aside and forgotten quickly, but overall I'm glad I got the book and I just wish we had actually gotten to play this. Some of this would have made for pretty epic gameplay. If you want to see where things would have gone, it's pretty good.",
                "reviewVotes": "55 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tony K Le",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6LIVVA3A6GXMV5ITYHC5YDVTZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5D3O1KJLVYSP?ASIN=1646090004",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 13, 2023",
                "reviewTitle": "5.0 out of 5 stars An ending that we never got to see realized",
                "reviewText": "FFXV might be the most tragic ending I’ve ever played. The novel and the game showed that.Just kinda sad that this never got turned into episodes but at least we can read it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NBMTXNBMTX",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLGSW5L5FJAGRTWW5T65UU7GEMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V67JYR9ET1I1?ASIN=1646090004",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2021",
                "reviewTitle": "5.0 out of 5 stars Basically Final Fantasy XV-2",
                "reviewText": "Wow, what a good book!Considering how to-the-point it generally is, it sure does create a very vivid telling of what could've been a sequel portion to the game itself. Although action is not it's emphasis, those moments are told so that you can easily imagine what the gameplay, and even level design, would have been.I guess to some extent, I regret not getting the episodes themselves, but I'm still so glad that they published this book, because it really would've been a shame to have never known what could've been. I mean, who didn't want more Aranea, and the addition of Sol, and their relationship, only made Aranea that much better. And then Sol and Lunafreya's relationship make Luna that much better as well. Just great momentum the whole way through.With everything put together: Kingsglaive, the game and it's updates and expansions, and now this book, I really have to say that Final Fantasy XV is among my favorites from the iconic series. Flawed as it may have been at launch, I can't help but feel like every flaw in it is more than made up for by some other aspect I adore.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91sN5oEAWtL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hunter Harrison",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP4LU3MNGQF7A2H5ARODKTE5P4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTAFMH29V0UH2?ASIN=1646090004",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2022",
                "reviewTitle": "5.0 out of 5 stars A VERY good read",
                "reviewText": "I've given the main game (FFXV) and all of its subsequent releases a lot of grief over the years for being a disjointed and DLC heavy mess. However, the book is VERY well written, it tells four compelling narratives (Aranea's had me on the edge of my seat the entire time), and is an incredible follow-up to (what I'm sure) what would have been mediocre season 2 DLC for the game. If you are interested in the concept ideas for said DLC or you were unsatisfied with the games ending proper, definitely give this book a read. For me personally, I actually can't wait to reread this book. With the game for context, I am certain this standalone will do quite well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2024",
                "reviewTitle": "Great wrap up",
                "reviewText": "I enjoyed being able to read/see more of the FF15 lore and story. I am happy that there was somewhere that had an official closure to the story. It’s a good and easy read and it was great to see the characters I love back in action.Recommended to all those Final Fantasy 15 fans! I got mine via Amazon Kindle.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cesar Alejandro Fernández Betancourt",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 19, 2023",
                "reviewTitle": "llego en perfecto estado y antes de lo previsto",
                "reviewText": "excelente libro y me gusto los detalles que tiene",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caesar NascimentoCaesar Nascimento",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 23, 2022",
                "reviewTitle": "Verdadeiro",
                "reviewText": "O livro é pequeno em altura e largura , vem no tamanho de um livro padrão e não no formato de livro de ilustrações alto, é compacto e super grosso, são 377páginas com as histórias que seriam as dlcs de lunafreya, aranea e noctis. Também se fala de ardyn.... No final tem algumas páginas de ilustrações mas são poucas (foto em anexo das páginas finais). É um livro pra quem realmente esta interessado na leitura das dlcs. Produto original com o menor preço (130) que vi no brasil. É possível retirar a luva de papel e a hardcover tem a mesma ilustraçao. Esse livro esta sendo vendido por quase 20 dolares na amazon.us, ficou mais barato que importar e pagar em dolar, estou muito feliz!!!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CRxc0MIxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71oeD4B9VJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/718NIINTZGL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71rOWJ1pXJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61IxgP-9W1L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71O7z4smEEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71u8O22LejL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71S+HX7K4oL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71g0LzgmaDL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "F",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 10, 2023",
                "reviewTitle": "Una pena por el videjuego",
                "reviewText": "Este libro simboliza muchas cosas, pero sobre todo, la pena que es que un Final Fantasy que tiene una buena historia, unos buenos personajes y un gran potencial, se haya visto abocado a un batiburrillo de merchandising para poder comprenderlo.El libro recoge el contenido que debería haber salido en forma de los 4 últimos DLC del videojuego: el de Ardyn (que fue el único que llego a producirse), el de Aranea, el de Lunafreya y el de Noctis (estos 3 últimos fueron cancelados porque el director se largó del proyecto). La narrativa, como es de esperar, no es la propia en sí de una novela sino que sigue una línea muy adaptada para el medio del videojuego.Aquí se profundiza en personajes que se tocaron en el juego principal de forma muy superficial (como Aranea o Lunafreya) y a su vez, narra la línea temporal que llega a una de las secuencias post-finales que más desconcertante fue en el juego base (el final feliz).Si quieres entender buena parte de algunos personajes y una parte muy importante de la trama, es de obligada lectura puesto que el juego con el contenido actual está incompleto. Pero esto a su vez hace, que si quieres entender esta novela, tienes que jugar al videojuego por obligación. No es un libro de expansión de lore, ni spin-off, ni precuela, ni secuela. Son DLCs canónicos que contienen trozos de historia principal trasladados a texto.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "patrizio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 15, 2022",
                "reviewTitle": "ottimo",
                "reviewText": "LIBRO ARRIVATO IN PERFETTE CONDIZIONI",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}