{
    "remaining_requests": 412,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-City-of-Brass-S-A-Chakraborty-audiobook/dp/B075KWZZWR",
    "body": {
        "name": "The City of Brass: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-City-of-Brass-S-A-Chakraborty-audiobook/dp/B075KWZZWR",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51-Kz3gM9FL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "S. A. Chakraborty",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=S.+A.+Chakraborty&search-alias=audible"
        },
        "brand": "S. A. Chakraborty&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 11417,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Named one of The Best Books of the Year by Library Journal | Vulture | The Verge | SYFYWireStep into The City of Brass, the spellbinding debut from S. A. Chakraborty perfect for fans of The Golem and the Jinni, The Grace of Kings, and Uprooted, in which the future of a magical Middle Eastern kingdom rests in the hands of a clever and defiant young con artist with miraculous healing gifts.Nahri has never believed in magic. Certainly, she has power; on the streets of 18th-century Cairo, she’s a con woman of unsurpassed talent. But she knows better than anyone that the trades she uses to get by - palm readings, zars, and a mysterious gift for healing - are all tricks, both the means to the delightful end of swindling Ottoman nobles and a reliable way to survive.But when Nahri accidentally summons Dara, an equally sly, darkly mysterious djinn warrior, to her side during one of her cons, she’s forced to reconsider her beliefs. For Dara tells Nahri an extraordinary tale: across hot, windswept sands teeming with creatures of fire and rivers where the mythical marid sleep, past ruins of once-magnificent human metropolises and mountains where the circling birds of prey are more than what they seem, lies Daevabad, the legendary city of brass - a city to which Nahri is irrevocably bound.In Daevabad, within gilded brass walls laced with enchantments and behind the six gates of the six djinn tribes, old resentments run deep. And when Nahri decides to enter this world, her arrival threatens to ignite a war that has been simmering for centuries. Spurning Dara’s warning of the treachery surrounding her, she embarks on a hesitant friendship with Alizayd, an idealistic prince who dreams of revolutionizing his father’s corrupt regime. All too soon, Nahri learns that true power is fierce and brutal. That magic cannot shield her from the dangerous web of court politics. That even the cleverest of schemes can have deadly consequences.After all, there is a reason they say to be careful what you wish for....This audiobook includes an episode of the Book Club Girl Podcast, featuring an interview with S. A. Chakraborty about The City of Brass. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b?ie=UTF8&node=10177"
            },
            {
                "name": "Cultural Heritage",
                "link": "https://www.amazon.com/Cultural-Heritage-Fiction/b?ie=UTF8&node=8946929011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "20 hours and 1 minute"
            },
            {
                "name": "Author",
                "value": "S. A. Chakraborty"
            },
            {
                "name": "Narrator",
                "value": "Soneela Nankani"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 14, 2017"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B075KWZZWR"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,515 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #43 in Historical Fantasy (Audible Books & Originals) #47 in Cultural Heritage Fiction #49 in World Literature (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Corey Beth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHO7LKCFNGOBMAOFG4D4CQEV7ZRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R126RQIA74WGP3?ASIN=B075KWZZWR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Book! 4½ Stars!",
                "reviewText": "I have had The City of Brass sitting on my bookshelf for a long time. I don't really have an excuse for why that is; the blurb was highly intriguing & I don't think I've seen one bad review on any blog or website that mentioned it. I think the glowing reviews responsible for drawing the book to my attention were also at least partially responsible for why I put off reading it. It was one part \"saving the best for last\" (which is just crazy, considering the size of my TBR pile/list & the fact that I'll probably never read every book on it), & one part \"afraid it won't live up to the hype\"— I've read plenty of books that didn't live up to my high expectations & ended up disappointing me.Well, I am glad to say that in the case of TCoB, I was not disappointed. Instead, my opinion is that for the most part, this book lives up to the hype. I say \"for the most part\" because the beginning seemed a bit slow to me, or maybe it just took me awhile to warm up to the story. I'm not sure why, because it didn't take long for things to start happening. The pacing was a bit uneven, at least at first, but I felt like that evened out at the end. The writing was consistent throughout, a third person voice that was straightforward & easy to read while at times also lyrical & poetic.Chapters bounce between two different characters' stories: a scrappy conwoman called Nahri, & the young, opinionated second son of the current djinn king, Alizayd (Ali). At first I struggled because their stories seemed so far apart, & I had a hard time reseting my brain when switching between them. I warmed up to Ali first, something I attribute to my being a fan of political intrigue, considering that Ali is drowning in court politics. His world was fascinating & damgerous right from the jump. With Nahri... its not that I disliked her, just that at the beginning I kind of found her part of the story slow, as well as a bit formulaic— she accidentally summons an ancient magical being who tells her she is the last member of djinn royalty & whisks her away to a magical city... Pretty typical Chosen One trope.I was probably a third of the way into the book when I realized that the reservations I'd been having had disappeared. I attribute the skill of Chakraborty's writing for drawing me in. I felt as though each additional chapter pulled layers off of the story, letting me see the world & it's people just a bit more. Soon I could see Nahri's growth arc unfolding, as well as the hints of a bigger story layered beneath the one being told. By the time Nahri & her self-appointed djinn protector, Dara, got to Daevabad, I was all in. This is also the point at which Nahri & Ali's stories began to truly intertwine, & the politics & history of Daevabad combined to make the city a character in its own right.Without a doubt, the worldbuilding is my favorite aspect of this book. The detailed history of the djinn people, the distinct cultural differences between tribes, the perilous political landscape; all combined to bring Daevabad, the City of Brass, to gorgeous, vivid, three-dimensional life. I have read a couple of fantasy novels with an Arabic-inspired culture, but none of them carried the depth & breadth of realism portrayed in this book. Each successive chapter revealed something new about the city & the djinn way of life. I am a sucker for well-drawn worlds, & the one Chakraborty created here took my breath away. I can't wait to explore more of it in the rest of the trilogy.Bottom line, The City of Brass is the type of fantasy story all fantasy readers long for. It offers multifaceted characters with realistic hopes & dreams, flaws & failures. It offers organically grown, completely believable relationships between those characters. It offers a vibrant, glittering jewel of a setting, complete with such rich culture & detailed history that it could easily be based on fact. It offers a plot that starts off with a simple Chosen One trope before quickly evolving into something more, a true epic high fantasy replete with action & adventure, political machinations that would make our American government jealous, & twists & turns that come out of nowhere to leave your jaw hanging open in shock. It was worth the (self imposed) wait, & I heartily suggest to fellow readers not to make my mistake & put off reading this beauty of a book!",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHFALAHJLRXO2YB6QSZU3ASIYWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FT2XIUC8PDNJ?ASIN=B075KWZZWR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2018",
                "reviewTitle": "4.0 out of 5 stars Complex Characters & World-Building + Fantastic Portrayal of Djinn",
                "reviewText": "I have been on a djinn kick lately, ever since learning a bit about the actual beliefs and mythology of them, and this was exactly the kind of portrayal of djinn I was hoping it would be! It was everything I wanted from the djinn and more. I sometimes read this author's [really interesting] Twitter threads about djinn-related stories, so it doesn't surprise me that she created a great version of them. But not only did she have different types of djinn with different abilities, she created this whole complex and well-thought-out history and society for them that included war, religion, tribes/families, economy, prejudice, and more.As for the characters themselves, they were just as amazingly well-written. They were complex and believable and three-dimensional. I found myself rooting for so many of them, even when they did bad things, even when they were on opposing sides. In fact, I want to talk a little bit (or a lotta bit) about some of them in particular. I won't share anything I consider a true spoiler, but you can skip the next four paragraphs if you haven't read this yet and don't like to know anything.*POTENTIAL MILD SPOILERS*DARA! Dara was *such* an interesting character. You know how sometimes in books we get this brooding love interest character, and we're constantly told what a monster he is, but we're never actually shown anything bad? Or he does things that seem bad, but then it turns out there's a perfectly good explanation for them? (Sorry for the mini rant, I get really frustrated by that.) Well, this was the perfect example of a character who really had done awful things, and the author didn't try to cover them up, and the reader even got to see some of his darker side firsthand. And you know what? *I still liked him.* He was a character who was not all good, but not all bad. You had this caring side of him and his side of the story about the past, then you had this cruel side of him and the opposing side of the story that made him out to be a monster. He had a lot of prejudice against shafit and the other djinn tribes, and he was a troublemaker sometimes. He never just laid low and kept his head down; his beliefs and desires were too strong for that, and sometimes his temper got the best of him. But the thing is, for the other djinn, the war and the things that happened were over a thousand years in the past. It was something that happened to their ancestors, not them. For Dara, it was like it just happened since he didn't remember his time as a slave. And his hatred of the Qahtani family was kind of understandable when you consider how they killed his whole family. And I think he regretted, or was starting to regret, some of his past. I also felt terrible for him, having been made a slave. He just had all these layers and all this complexity that I loved.I liked Prince Ali too, even though he and Dara were basically enemies. He was so caught in the middle between his family and his desire to do what was right and help the shafit. I felt like he actually did make the best choices possible, and yet no one on either side was happy with him or willing to understand, and it completely blew up in his face. I felt really bad for him, and I felt like he had a lot of realism and complexity too.I even liked Muntadhir. He liked to drink and fool around and avoid responsibility, but, in his defense, he didn't ask to be king one day. I think the poor guy just wanted to have a life with you-know-who, but he knew he never could. And he defended his brother and seemed to really care about him. I think he also had more depth than Ali realized. I don't like the decision he made at the end, but, when I consider things from his perspective, I can understand it.Last but not least, Nahri. She was believable, and I could completely understand her desire to stay in the place she called home, to not be forced into an entirely different lifestyle, culture, and religious faith. I felt for her when bad things happened. I thought she great when she took charge with that list of demands from the king. She was strong-willed, and I liked her.*END SPOILERS*I also liked the romance, but I feel it was overshadowed by the amazing characters and all the intrigue and complexity of the plot, which is not necessarily a bad thing, just the reason I almost didn't even think to mention it. I would've maybe liked to see a little more of Nahri and Dara's time together as their feelings were developing, but I still thought their feelings were believable enough, and they had a cute dynamic sometimes.What I loved most about this book though was that nothing was simple or black-and-white. The characters weren't perfect, and they were biased, and they didn't always know what was best, and they made mistakes, and they did bad things sometimes, but they also did good things sometimes. Their motivations, their desires, their backgrounds, their feelings, their relationships---none of it was clear-cut. And the whole situation in Daevabad with the Daeva and the shafit and all the characters involved was complex in a very realistic way.This book was a little long and somewhat slow-paced, and I may have skimmed some of the descriptions of rooms and gardens, but those were my only issues, and they're such small ones.I'm so glad Danya @ Fine Print and Becky @ A Fool's Ingenuity wrote such amazing reviews for this book because I'm pretty sure they were the ones who convinced me I needed to give this book a try!To wrap this up, if I had to pick one word to describe this book, it would be 'complex'. I'm pretty sure I used it like ten times in this review. Seriously, the history, the society, the djinn, the backstories, the characters, their relationships---all of it was so well-thought-out and detailed and well-written, and I definitely plan to continue this series!Rating: 4 StarsOriginal Review @ Metaphors and Moonlight (link in profile)",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mirella Monteiro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 11, 2022",
                "reviewTitle": "MEU DEUS!!",
                "reviewText": "assim que comecei esse livro entendi completamente porque tem tanta gente obcecada nele, ele simplesmente é MUITO bom, é um daqueles livros que o melhor é trajetória que você faz acompanhando os personagens. o caos dos últimos capítulos? IMPECÁVEL. não vejo a hora de ler o restante!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnujaAnuja",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 19, 2023",
                "reviewTitle": "One of my favourites!",
                "reviewText": "This is how you write a fantasy. Love how the author's writes the world and her characters. Great character arcs. Beautiful cover.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71MjCl0RfqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica Suarez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 8, 2020",
                "reviewTitle": "Amazing",
                "reviewText": "Hace cientos de años seis tribus fueron creadas luego de una terrible guerra, Nahri está a punto de conocerlas. Por accidente ella convoca a un guerrero Djinn durante una de sus presentaciones, ahora ambos deben escapar del Cairo por el inminente peligro en el que se encuentran, el único lugar seguro es Daevabad, la legendaria City of brass. Nahri no sabe que ella está unida a esta ciudad y que su presencia ahí será toda una revelación.A pesar de los cientos de nombres de tribus que tuve que aprenderme, de ciudades, de criaturas míticas, de dialectos, de armas, de vestimenta, de palabras que se usan específicamente para algo, sin contar que tenia que estar adivinando si ciertas palabras eran inventadas o las podía traducir, realmente disfruté este libro. No saben lo bien construido que está el mundo en el que se desarrolla, todo es asombroso, quedé maravillada por el world building. La historia es realmente buena, porque en ocasiones se crea un buen universo pero la historia no es convincente, City of brass no es uno de esos libros, los personajes se ganaron mi corazón, la historia me mantuvo súper enganchada de principio a fin, y hace mucho no me pasaba eso, reí, sufrí, gocé, me enamoré. Tienen que leer este libro.Cabe aclarar que este es un libro introductorio a todo lo demás que sea que vaya a ocurrir, nos ponen en contexto con acontecimientos del pasado y con todo el mundo que conforma está trilogía, eso no quiere decir que sea un libro aburrido donde solo se enseña la historia de Daevabad.Yo le doy 4.8 de 5 ⭐ porque me hubiera gustado que se desarrollara un poco más la interacción de ciertos personajes antes de crear una amistad, digo, con 4 veces que interactúen no pueden crear un súper vínculo.La mala noticia es que este libro por ahora solamente está en inglés, si leen en inglés no duden en comprarlo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Georg Egger",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 1, 2020",
                "reviewTitle": "Absolutely FANTASTIC, best book in 10 years I have read",
                "reviewText": "There has been a recent slur of books especially YA that really lacked quality. Don't get me wrong easy reads are ok but the same story girl discovers strength , love story blah and some magic on top is getting VERY old. Some can deliver better than others. obviously writing style can potentially make a weak story better. When I read the synopsis of this I was like hmmm not another girl magic story paleeese but I promised a friend I read it.This book completely blew me out of the sky.Writing style: MATURE, intricate, definitly Adult.Story: AAAA++++Reading a book is different than a movie, shallow entertainment rushing over you CAN be fun. Bookshowever should engage you and boy this one does. There is SO much going on storywise you really haveto think, imagine and anticipate. I don't get this very often in this intensity but this book was gripping.There is a lot of story threads to observe and keep in the back of your mind, they all come together thoughand none is just a filler, amazing really. The point of view story telling does work well in this book.One story line feels very much like GOT style, don't get me wrong this has nothing to do with GOT but the quality of writing is on par, honestly. This is about politics and gray characters, history past and how the future can develop because of it. Someone REALLY researched where this story was going before writing it down. Kudos to the author.The other story line does have that girl/magic element I have come to detest from the gray mass of books all following the same recipe BUT but but but...this is told in a much more adult, rational way, also touching history and political aspects of the world around, making it fun to read and wonder where this is goingWorldbuilding: GRANDIn the sense of it. I always detested the word worldbuilding, since im reading a book about characters not a world.So my personal opinion is the world builds around the characters, since this is what carries the story and not the other way around. I hate books where the author clearly constructed a world and then put some characters in it the actual story suffering.Here the sense of the story creating the world is strong and superbly executed. It is lush and rich you can imagine the surroundings so well. The world does build around the characters easily by itself ( guess that goes to writing style ) just as it should be and every now and then some extra bits of information are mixed in without creating the feeling of unnecessary information. It sure feels like the author had a plan beforehand but the creation of her wold comes naturally with the story and it is a fantastic world on top of that.Overall I can't stress enough what a GEM of a book this is if you are willing to be lead in this story. Sure there is a lot of terminology ( also explained at the end ) but this is just one of those books that's not like yeah I can skip 2,3 pages fast read and it doesn't hurt my understanding of the story.Im still ..amazed at this, such a clever clever well written book that completely engrossed me.if you are tired of FAE fantasy stories and incompetent stereotype heroines..this is for you.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 22, 2019",
                "reviewTitle": "Read it twice! Amazing world building and interesting characters.",
                "reviewText": "Took this out from my local library. As a general rule, because I live in an immensely small space, I only buy a book if I find myself re-reading it 2-3 times first. On my third read of City of Brass, I decided it was time to buy it for my collection.I really enjoy the world building here; there's a clear divide between worlds within the book, but their coexistence is explained simply and wonderfully. I found the characters rich and diverse, their motives interesting and less predictable than other novels of the same \"found fantasy\" genre, and though there IS a romantic subplot, it was not the main focus of the plot itself, and it didn't feel too forced.Read this book if you enjoy character-based journeys in richly cultured fantasy lands, a little political intrigue, and a lot of magic. If you like other, similar fantasy novels, you will love this one.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}