{
    "remaining_requests": 398,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Traitors-Son-Path-Ranger-Book/dp/B083XTDBR3",
    "body": {
        "name": "The Traitor's Son: (Path of the Ranger Book 1)",
        "price": "$13.54$13.54",
        "originalPrice": "",
        "rawPrice": 13.54,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Traitors-Son-Path-Ranger-Book/dp/B083XTDBR3",
        "soldBy": {
            "sellerID": "A1SYE57IZFNXCN",
            "name": "LuxuryMerchandise (Veteran Owned)",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1SYE57IZFNXCN&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "Available to ship in 1-2 days",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41AdcXguEdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Pb2r83P7S.jpg",
            "https://m.media-amazon.com/images/I/51ZhtYTM1RL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Pedro Urvi",
            "link": "https://www.amazon.com/Pedro-Urvi/e/B00ODEUEAU/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "LuxuryMerchandise (Veteran Owned)",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 6326,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews From the Author Book One in the international bestselling coming of age epic fantasy series.A series for the whole family: children, teens and adults. From the Author with Nº1 hits in:★★★★★ Epic Fantasy ★★★★★ Sword & Sorcery★★★★★ Coming of Age★★★★★ Action & Adventure★★★★★ Magic & Fantasy The adventure awaits: Immerse yourself in this adventure, packed with mystery and action. Discover a vast and fascinating universe, filled with lively, unique, entrancing characters. Experience adventures, intrigues, spying, treachery, fights and relentless action. Live an adventure with a group of misfits you will fall in love with. Fantasy, Steel, Magic, and Love. _____________________________________________________________________About this series:Genre: Epic fantasy, sword & sorcery, action & adventure, coming of age, fantasy & magic.Audience: Middle-grade, teen, young adult, adult.Setting: Continent in quasi-medieval times and with magic users.Reader age: 8+Explicit language: None.Completeness: It is an ongoing series.Similar/influenced by: The Ranger's Apprentice, Lord of the Rings, Harry Potter, Dragonlance..._____________________________________________________________________Path of the Ranger Series: 1. The Traitor's Son 2. The King's Secret 3. Mystery in the Tundra 4. Treason in the North 5. The Secret Refuge 6. Path of the Specialist 7. The King of the West 8. The Turquoise Queen 9. Power Conspiracy10. The Great Council11. Frozen Origins12. Dragon Spirit_____________________________________________________________________A saga that will keep you gripped!Epic fantasy for the whole family!"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 55 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 13 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The international bestselling epic fantasy series with over 1 million books sold worldwide!#1 Bestseller in epic fantasy and children fantasy in English, German, Spanish and Italian.Fantasy full of action, adventure and magic for all ages: from 10 to 100+A kingdom in danger, a great betrayal, a boy seeking to redeem his father's honor. Will he succeed in exonerating him and saving the realm from an enemy in the shadows before it is too late for the whole North?By the age of fifteen, Lasgol has endured a hard childhood and lives, cornered and hated, in a small village in the North. He is the son of the traitor, the man who betrayed the kingdom and tried to kill the King. His only companions are the mountains and the snow, ever-present in the region. Yet he refuses to believe that his father is guilty, even though the King himself was a witness to the betrayal.Lasgol is determined to clear his father's name and to do this he has only a single option: the School of Rangers, a secret place where the respected and feared defenders of the lands of the kingdom are trained for four years. Going there is insane, hate and death await him. But as the son of a Ranger, he is entitled to attend.At the Camp he will find himself involved in political intrigues, disloyalties and fights. He will encounter hatred and fearsome enemies, but also a handful of friends, novices as much out of place as he is himself, determined to do whatever is necessary to pass the first year... without dying in the attempt.Will Lasgol survive the first year of instruction at the Rangers' Camp? Will he find out what happened to his father? Will he be able to clear his name?Find out while you follow fascinating adventures with a group of characters you will fall in love with.Epic fantasy full of adventure, action, magic, mystery and some romance for all ages: children, teens and adults.Enjoy this book with your kids and family.The adventure begins right now!_____________________________________________________________________About this series:Genre: Epic fantasy, sword & sorcery, action & adventure, coming of age, fantasy & magic.Audience: Middle-grade, teen, young adult, adult.Setting: Continent in quasi-medieval times and with magic users.Reader age: 10+Explicit language: None.Completeness: It is an ongoing series.Similar/influenced by: The Ranger's Apprentice, Lord of the Rings, Harry Potter, Dragonlance..._____________________________________________________________________Path of the Ranger Series:1. The Traitor's Son2. The King's Secret3. Mystery in the Tundra4. Treason in the North5. The Secret Refuge6. Path of the Specialist7. The King of the West8. The Turquoise Queen9. Power Conspiracy10. The Great Council11. Frozen Origins12. Dragon Spirit13. Arcane Call14. Mission in the East15. Rise of the Immortal16. The Druid Queen17. The Secret of the Dragon18. The Throne of the North_____________________________________________________________________A saga that will keep you gripped!Epic fantasy for the whole family! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17466"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B083XTDBR3"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Independently published (January 18, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 341 pages"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 979-8600420458"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 10+ years, from customers"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.11 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.86 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,304 in Books (See Top 100 in Books) #228 in Coming of Age Fantasy (Books) #383 in Sword & Sorcery Fantasy (Books) #970 in Epic Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 6,326 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOEF2PHVBR6O75TFE7NPEFYYSVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7F7A307Y69IN?ASIN=B083XTDBR3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing",
                "reviewText": "Totally recommend it easy to read and surprisingly at every chapter go and buy it worthy 100%Super happy 😊",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marty",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAICNIULSGSUEKTQBT4LOLAI2ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22OZ6G57KJBXF?ASIN=B083XTDBR3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Action Adventure and a Touch of Magic",
                "reviewText": "This book is full of fun, fighting and fantasy. The characters are well developed and relatable to fans of this genre. I look forward to book two, hoping that the characters fearful of magic, begin to accept and embrace it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trish Black",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEK7LENWPS5QBLCY2DASF3ZOSTVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30EHRQ92IJ90T?ASIN=B083XTDBR3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars contains some profanity and a murder",
                "reviewText": "I bought it to pre-read before recommending it for a 14m. The story was interesting and I may read more of the series myself. I'm not recommending it for the particular child I mentioned due to how the complex emotions of the teens involved in the murder were discussed so superficially - although I understand that it was not the main point of the book. Overall, it was a quite enjoyable read.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randy Bryson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGESTWUYSXDFIRLPUYSOVM62BVSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FIUQ0OB2HN53?ASIN=B083XTDBR3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars a fun journey through overcoming adversity.",
                "reviewText": "At times a painful read of a boy’s challenges, but a good story and it kept me anxious to find out what would happen next. I enjoyed it. Can’t wait to read the next book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas Manchester",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZCRVJRIBT2VSHCAPBJELORWKOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FXH3ZVQCYXK9?ASIN=B083XTDBR3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy reading",
                "reviewText": "Very interesting. Easy reading. Draws you in quickly",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deannana Johncox",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF56RUSK3XMNVUIGH3Z7HIEL3VJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSJYC6X8W30NG?ASIN=B083XTDBR3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "4.0 out of 5 stars It's a good book.",
                "reviewText": "Reading this book to my grandson. He likes that it has magic and super powers in it and lots of Army Ranger special forces in it.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maine Ah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIL5RUALWC4HX7HV2PAYKO4DUNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LTRKORL6PJYK?ASIN=B083XTDBR3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2020",
                "reviewTitle": "5.0 out of 5 stars It Kept Me Up Way Past My Bedtime",
                "reviewText": "Lasgol is the orphaned son of an Elite First Ranger who was killed three years previously as a traitor to the king. Small for his age, especially compared to the large boys in his village, he is scorned by nearly everyone where ever he goes. Taken in by an old, alcoholic, one-eyed veteran who frequently berates him and punishes him, the boy remains optimistic that life is good and someday he will clear his father’s name. Lasgol never waivers in the belief that his father, who taught him the ways of the Forest, archery, tracking, trapping and a belief in himself did not betray his king who was also his close friend.During his 15th year Lasgol is offered the opportunity to go to Ranger school as is the right of those whose parents or grandparents served as Rangers. The recruiter who comes for him warns him that accepting will be far more difficult than what he experiences in his village as everyone will hate him as the Traitor’s son. It is a very difficult choice but Lasgol decides this presents a path to clear his father’s name. Before he leaves, he discovers the old veteran had hidden away a package that had been sent to him 3 years before after his fathers death. When he finds it, amongst his fathers clothing is a box with an egg which is quite mystifying. He ends up packing this box with an egg with his meager belongings on the two week trek to the boats that will take them to the Ranger Camp.When Lasgol and his recruiter arrive to where the boats are waiting to take all 80 initiates to the camp the mood of the story shifts from somber to laugh out loud funny as it describes 40 teenage boys and girls with their first experience of rowing a longboat, two teens per bench and per oar. I laughed until I had tears as I remembered my own childhood experiences learning how to row my grandfathers’ old, heavy, wooden rowboat at the lake.The introduction of his new friends and roommates with the indomitable Ingrid as the leader of their group of six expands the book into an adventure where they all must successfully learn various skills as well as physical fitness to earn their placement to graduating their first year. The story increases in tension and plot twists as hate filled looks and insults are flung Lasgol’s way and murderous attempts are made on his life. There’s sort of a Harry Potter kind of feeling to the camaraderie of the fifteen year old group and their trials and tribulations which I enjoyed tremendously. Of course, that mysterious egg plays a vital and unexplainable role in helping Lasgol clear his father’s name.This book is awesome, I couldn’t put it down and stayed up way past my bedtime last night. And thank you, dear editor, for your amazing job. I so appreciate a well edited book which seems to be hard to come by on Kindle Unlimited in this type of genre. This was a suggestion in my Kindle Unlimited list and I am SO glad there is a second book I can read right away.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFLUJEF4DA4J67KHIWKRGMCCDZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39BIDLPRX1Y5E?ASIN=B083XTDBR3",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "3.0 out of 5 stars Uses the word 'Arcane' a lot",
                "reviewText": "I bought this book for my wife because she enjoys a good fantasy story. This one looked promising. According to her, the prose leaves a bit to be desired but the plot is well structured and promises an engaging and epic narrative. We are currently on book three, and are enjoying the series!One thing she told me is that Pedro likes to use the word 'Arcane' in his writing. Now that it's been pointed out, I can't unsee it!All in all, an enjoyable read. Keep churning the books out Pedro!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Book Time",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 6, 2024",
                "reviewTitle": "Complex world, plots & characters. No good/ bad",
                "reviewText": "I really enjoyed this book and immediately bought the rest of the series. There is a fairly large group of very varied characters rather than a small group it is clear that plots in different timelines are coming to fruition and the world itself is complex. Not quite up there with Kurtz and her Dhryni, Mercedes Lackey and her Heralds etc and Andre Norton with her Witch WorldBut it is the first book I have read by this author and I have high hopes. They have even made a totally new type of academy setting and set of priorities work incredibly well with a large group of protagonists who are not just good and evil.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michaela Lynes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 5, 2022",
                "reviewTitle": "Kurzweilige Unterhaltung",
                "reviewText": "Der Plot, dem das Buch folgt ist unterhaltsam. Sehr gut geschrieben und die Charaktere sind lebendig.Manche Szenen sind etwas langatmig, aber immer noch unterhaltsam.Wer Fantasy mag, eine gut erzählte Story liebt und unterhalten werden möchte, ist mit dieser Serie sehr gut beraten.Werde auch das nächste Buch lesen.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Traci",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 3, 2020",
                "reviewTitle": "Amazing. Magical. Captivating.",
                "reviewText": "Love this book. I read it in two days. The characters are well designed. You know the type of comment they each would make or what they think. I got pulled into the story. You will fall in love with each characters personality. I feel like you are there in the scenery and with the characters. It is easy to read and follow along with. After blazing through the first book I have now purchased the entire series.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 30, 2021",
                "reviewTitle": "Really good: Must read",
                "reviewText": "I like the book it is like hunger games but much more intresting. The secrets which Lasgol had were not even imaginable. The book hasn't much content but every first book of any series. The concept is totally different from any other books I have read. The hate given to Lasgol is pitifullA recommended book you must read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Klobato",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 28, 2020",
                "reviewTitle": "Wonderful reading",
                "reviewText": "I loved the adventure and the characters in this epic fantasy tale. A story full of core values like friendship, honor, courage, love and respect. Recommended for children and adults looking for a good read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}