{
    "remaining_requests": 393,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Night-Market-Standalone-Fantasy-Forbidden-ebook/dp/B0CJP3N88J",
    "body": {
        "name": "The Night Market: A Standalone Fae Fantasy Forbidden Romance (A Bound By Ravens Novel)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Night-Market-Standalone-Fantasy-Forbidden-ebook/dp/B0CJP3N88J",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81-DdViqGQL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jesikah Sundin",
            "link": "https://www.amazon.com/Jesikah-Sundin/e/B00HXRTOSW/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 85,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A mortal seer enslaved by a traveling faerie market.A Raven shifter forced into marriage to save his Caravan tribe.And a future not even the cards could predict . . . Some children dream of running away to join the Night Market. I did so to escape a nightmare.Still, being forced into an overheated tent to read fortunes until sunrise has its trials—naturally. But when he visits me, I suffer for entirely different reasons.Stars above, Rhylen Lonan is the most beautiful faerie I’ve ever known. A Raven shifter with long black hair, dark purple eyes, and magic that stirs my own. Each Night Market, in exchange for a generous slice of cake and a delicious morsel of gossip, I read him three cards. And before the gates open, he breaks my heart with the same question.“Does my mate love me back?”Every time, I'm taunted with visions of Rhylen in love . . . with her. His mate. Until tonight’s reading, that is, when Fate takes a sudden dark turn. I see a devastating fire. He will be forced to marry to save his tribe or face banishment. She will be hunted by other fae in a wedding game.I do not see her face. I never have. Nor do I know her name.But as Rhylen’s destiny continues to grip my Sight, I start to suspect it's me. That I have always been his forbidden future. And I don’t know what terrifies me most—that I might be his downfall or that he might be mine.THE NIGHT MARKET is a new adult fae romantasy set in the Bound by Ravens world and perfect for fans of:mutual piningbrother's best friend forbidden romancefated mateswitty banterband of brotherscourting ritualstouch her and diegrumpy fox familiarspocket hedgehogsmagical comfort cakeBe sure to check out the prequel novella, BOUND BY RAVENS, part of the Starry Kingdoms of the Fae multi-author collection, now in Kindle Unlimited.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CJP3N88J"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Forest Tales Publishing (January 15, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 15, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 12962 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 547 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,659 in Kindle Store (See Top 100 in Kindle Store) #12 in Fairy Tales (Kindle Store) #15 in Fairy Tales (Books) #90 in Fairy Tale Fantasy (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 85 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/9b69013f-44dc-494c-842d-a88de9052323.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sarah Jordan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG474HSPZ37EA2RWZRPJ4N7KZL5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIZM8VVNCAVE2?ASIN=B0CJP3N88J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Captivating and Swoony - A MUST-Read!🖤",
                "reviewText": "“Filena, the ancestors would say, you will only see in part unless you change the view.”Has there ever been a book where you felt like you almost highlighted the entire thing??? That is THIS book for me. THE NIGHT MARKET by Jesikah Sundin is a romantasy like no other. This is a childhood friends-to-lovers forbidden romance with fated mates, trickster fae, the most adorbs forest friend familiars, and heavy folklore woven into a #superbingeable novel that I could not put down. Jesikah is a master wordsmith and every detail has a beautifully intricate meaning to it. I cackled, cried, yelled, swooned, and felt ALL the feels from the very first line.This book follows shortly after the events of Bound By Ravens (which was also AMAZING), but you don’t have to read that one to enjoy this delicious morsel (though you might miss some fun Easter eggs if you skip it).The world-building is spectacular as you are practically pulled into a caravan night market with all the gypsy goodness. Characters (both heroes and villains) are interesting, compelling, and utterly enthralling. The story is so unputdownable and will have you on the edge of your seat! I promise you will crave cake infused with happiness, the cuddles of an adorable forest creature or two, and be tempted to tickle the feathers of a gorgeous Raven lad. But don’t take my word for it, run and grab this book!FAVORITE QUOTES (you guys, this was SO hard to pick!)I never refused cake. Or berries. Or handsome, dangerous lads with boyish smiles sweeter than honeyed icing.I ached for her to feel every singing beat of my heart. To freefall through a midnight sky that was made just for us and then know what it felt like to fly beneath the stars.I didn’t want ale; I wanted to drink him in and him alone—his beautiful, kind heart and vibrant soul, the smooth, hard lines of his sculpted body, the musical sound of his deep laugh, the heady, intoxicating taste of his lips.I had never wanted to be a drip of sweat so badly as the one rolling down his chest.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Mueller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMK4YDMGOIHUURB3RQEKC7BCYDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26L21UR5W86DJ?ASIN=B0CJP3N88J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Heart Officially Claimed",
                "reviewText": "The Night Market is a standalone set in the same world as Jesikah's \"Bound By Ravens\" world which, if you haven't read yet, consider this your low-key peer pressuring to do so. (You're welcome in advance).Writing a review for this book is kind of like giving a thank you speech where you are all worried about leaving someone out😅. There were soooo many things I fell in love with in this story.Should I mention the ah-mazing banter between the characters that will have you grinning?The blood and found familial ties that will make you laugh and sometimes get teary-eyed?The utterly adorable animal familiars that will simultaneously make you want to snuggle them while also hiding all your cake and clothing?How about the complete and total annihilation of your heart and soul as you fall in love with the burn-the-world-for-those-he-loves-while-also-being-amazingly-tender, fae raven shifter Rhylen?Or how you'll be sure to crush hard on the absolutely heartbreaking strength of mortal seer Filena?(Oh the mutual pining/angst and blazing chemistry between these two!🔥🥵)Long review short--if you are looking for a new swoony obsession with a robust world and characters that feel like old friends, make a cozy reading nest and prepare to fall in love at first sight with Rhylen and Filena.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shelby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5UT3J2BILP5JTNETCKP36MEULA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH89QBCDRPFI4?ASIN=B0CJP3N88J",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "4.0 out of 5 stars A Swoon Worthy Romance!!!",
                "reviewText": "Filena is known as a seer, one who can see other’s futures. Years ago, her and her brother Cian escaped their abusive father and started a new life under the ownership of the Lonan’s. Now Filena works at the West Tribe’s Night Market. There she tells the future for those who pay coin. Every Night Market before opening a fae comes and visits Filena: Rhylen Lonan, a Raven Folk who Filena has fallen in love with. But with West tribes rules they could never be together. Besides she has seen his future, and he is soon to meet his ‘true mate’. Little does Filena know that she is actually Rhylen’s true mate. He has known for a number of years and has courted her in secret. One night the Night Market catches fire and Rhylen saves Filena just in time. This set off a chain of events which leads Filena and Rhylen not only together but changing the way the raven folk have lived for centuries. The Nigh Market is a beautiful romantic fantasy that kept me wanting to keep turning the page to see what would happen next. Whether from the fun interactions between characters, the swoon worthy romance between the two main characters, or the interesting world building, I couldn’t get enough of this story. The characters are wonderful to read about. I loved how animal loving and imaginative Filena was. She thought up the best curses, even if she didn’t think she could cast them. Her interactions with her brother, Cian, were fun and sweet. They taunt each other and are they’re for the other when needed most. I would have loved more of Filena and Glenna interacting as they were supposed to be the best of friends. Just seemed it more of Glenna with Cian than Filena page wise. The romance! Oh! The romance. I was squealing so much though the romance in this book. Filena and Rhylen are my new favorite couple. The way Rhylen would do anything for Filena is beautiful to read. I also loved how the two would not fall into the trope of getting angry with the other for holding a secret. They thought through them logically. The treasure between them being buttons is so cute. If I could get another book of just them doing things together, I would be so happy! The world building in this is interesting. I liked how the raven folk live and love as a family. The class system and traditions were interesting to read about, and I wish the book went into more detail. I also liked the mentions of Seren, the city present in the pervious novel Bound by Ravens. But luckily you don’t need to have read it to understand this story at all. But if you have fun finding Easter eggs though out the story. In closing the Night Market is a great book with hilarious characters and a swoon worthy romance. So, if you like great character interactions, beautiful romantic scenes, great world building, and racoons who love to steal gloves, the Night Market is the read for you. I give this book a four out of five!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Moon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 20, 2024",
                "reviewTitle": "Loved it!",
                "reviewText": "I definitely would loveee to see more books in this world! Excited for the books coming soon!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}