{
    "remaining_requests": 395,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fable-Novel-1-Adrienne-Young/dp/1250254388",
    "body": {
        "name": "Fable (The World of the Narrows, 1)",
        "price": "$9.49",
        "originalPrice": "",
        "rawPrice": 9.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fable-Novel-1-Adrienne-Young/dp/1250254388",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41gCNcuTk2L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Cv16vsGQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/315T672oxHL.jpg",
            "https://m.media-amazon.com/images/I/514vli4eY1L._SX35_SY46.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Adrienne Young",
            "link": "https://www.amazon.com/Adrienne-Young/e/B079TCMS6S/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 7084,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Young (The Girl the Sea Gave Back) blends adventure and intrigue in this lush nautical duology opener, crafting a flinty world in which danger lurks at every turn.\" - Publishers Weekly \"An exciting tale of lost treasure, love, and survival.\" - School Library Journal\"A vividly drawn maritime setting, dramatic sea dives and daring rescues, not one but two formidable villains, and a swoony romance make this a treat for seafarers and landlubbers alike.\" - The Bulletin of the Center for Children's Books\"A dark maritime fantasy...immersive...and rich in sensory details. For readers who can’t get enough of strong female protagonists...\" - Kirkus\"As an author, Young’s strength is in her ability to craft both strong female protagonists and worlds that are filled with realistic details.\" - Culturess\"The salty sea and the promise of something hidden in its depths, had me reading this book at a furious pace. You don’t simply read Fable, you are ensnared by it. This is Adrienne Young’s best work of storytelling yet!” - Shea Ernshaw, New York Times bestselling author of The Wicked Deep\"Gripping, immersive, and absolutely masterful, Fable reels you in with the promise of beauty, and holds you tight with Young’s signature grit. I couldn’t turn the pages quickly enough.\" - Adalyn Grace, New York Times bestselling author of All The Stars and Teeth \"I could taste the salt in the air and feel the waves beneath the Marigold. In a brutal world Fable shines as tenacious yet vulnerable, unafraid to do what she must to survive. This story caught me by the throat and refused to let go!\" - Shelby Mahurin, New York Times bestselling author of Serpent & DoveEpic Reads, The 23 Most Anticipated YA Books to Read in September About the Author Adrienne Young is a foodie with a deep love of history and travel and a shameless addiction to coffee. When she’s not writing, you can find her on her yoga mat, sipping wine over long dinners or disappearing into her favorite art museums. She lives with her documentary filmmaker husband and their four little wildlings in the Blue Ridge Mountains of North Carolina. She is the author of the New York Times bestselling Sky in the Deep duology and the World of the Narrows series."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 4 hrs 25 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "LIMITED FIRST PRINT RUN―featuring spray-painted edges, while supplies last. Welcome to a world made dangerous by the sea and by those who wish to profit from it. Where a young girl must find her place and her family while trying to survive in a world built for men. As the daughter of the most powerful trader in the Narrows, the sea is the only home seventeen-year-old Fable has ever known. It’s been four years since the night she watched her mother drown during an unforgiving storm. The next day her father abandoned her on a legendary island filled with thieves and little food. To survive she must keep to herself, learn to trust no one and rely on the unique skills her mother taught her. The only thing that keeps her going is the goal of getting off the island, finding her father and demanding her rightful place beside him and his crew. To do so Fable enlists the help of a young trader named West to get her off the island and across the Narrows to her father. But her father’s rivalries and the dangers of his trading enterprise have only multiplied since she last saw him and Fable soon finds that West isn't who he seems. Together, they will have to survive more than the treacherous storms that haunt the Narrows if they're going to stay alive. Fable takes you on a spectacular journey filled with romance, intrigue and adventure.A REESE WITHERSPOON x HELLO SUNSHINE BOOK CLUB YA PICK Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Wednesday Books (January 2, 2024)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 368 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250254388"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250254382"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12 - 18 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.3 x 0.92 x 8.15 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,749 in Books (See Top 100 in Books) #39 in Teen & Young Adult Sword & Sorcery Fantasy #40 in Teen & Young Adult Fantasy Romance #79 in Teen & Young Adult Epic Fantasy"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 7,084 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Victoria A. Woodard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGL2FKPIUDZU3AKUAU3JYDLAZHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V4FGP3AWHQNC?ASIN=1250254388",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Can’t wait to find out what's next.",
                "reviewText": "Ok first of all… HOW DARE YOU end this book like that! WOW.For me this was a slow build, I had a hard time pushing past the first 12 or so chapters but once I got through the slow start I couldn’t stop turning pages.I went into this with no idea what this book was about which was kind of cool because I was surprised a few times.One thing I for sure was shocked by was the eventual romantic connection between Fable and West. I guess I just saw her as much younger than she really was? Or him as much older? Not sure - but I loved the sort of full circle of that and its similarities to Fables parents.But again, the end… holy crap didn’t see that coming! Can’t wait to find out what's next.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQAS2GUEKYMLUFWG6YXON46V5JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IEC0MIK09FWJ?ASIN=1250254388",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 19, 2021",
                "reviewTitle": "4.0 out of 5 stars Good YA Pirate Fantasy, different from what everyone else is writing.",
                "reviewText": "I have to be honest when I say I picked up this book really not knowing much about it and having never read any of Adrienne Young’s books before. But I kept seeing it everywhere on Instagram and the cover was too beautiful for me not to own it. I went in knowing very little. I knew it was YA and it was about pirates. That’s all. I haven’t read a YA novel in quite some time so it was a little hard to get back into that mindset. I’ve been reading a lot of historical fiction, so very different. It took me at least 25-40% of the way through the book to really get into it.There was not enough scenery description for me to actually envision Jeval and Dern and the places she went. Even the ship. There was also very minimal character description beyond hair color, scruff, and occasionally skin color. I’m a reader that likes a lot of detail to be immersed.The story itself was a good one. When it was to the point where it looked like Fable was actually going to find her dad I was into it and ready to see that play out. I was not so much into the romance part of the story. I think if there had been a little more depth to the characters then I would have been more excited to read it. I did enjoy it, though, especially toward the end, and I will be picking up Namesake to continue the story when it comes out.For those of you that don’t know what Fable is about the story follows a teenager named Fable. At fourteen she was abandoned by her pirate father on a dangerous island the day after her mother went down with his ship (great guy, eh? Why she would even want to find him is beyond me). For two years a ship crewed by equally aged teenagers came into port and bought gems from her, which she dives to the bottom of the ocean to recover. This crew has helped to keep her alive. Otherwise she would have starved to death there on Jeval, the pirate island. She has saved her coin and finally at eighteen she has enough to pay for passage to find her father. The ship that takes her is the same teenage crewed ship that’s been buying from her. Not to give too much away but they have some adventures as they stop on an island called Dern and then make their way to Ceros where her father is doing business with his ship empire. She has come for her inheritance, a spot on his crew. The entire time I was reading I was like “WHY? WHY WOULD SHE WANT TO CREW FOR HIM?” I think if I were in her position and he did to me what he did to her, I’d rather starve to death than work for that man, but that’s just me. Because of this I found it hard to relate to Fable.The book was worth a read, and I do think if you are more in the YA novel/teenager mindset it would be a fast-paced, action-packed pirate read for something different!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lillian @ Mom with a Reading Problem",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCS74WXN77DZX4CC3RO7NQYKG6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T4QJ52GBS4JX?ASIN=1250254388",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 10, 2021",
                "reviewTitle": "5.0 out of 5 stars Exciting Adventure on the High Seas",
                "reviewText": "I received an eARC of this book via Netgalley. This does not affect my opinion of the book or the content of this review.I adored this book! Fable by Adrienne Young is the first in a duology about a young woman who is just trying to survive and find her own way in the world. This was my first time reading Adrienne Young, and I could talk for days about her writing. I love it! I will definitely be reading everything of hers I can get my hands on from now on. But I digress, let’s talk about Fable.Fable is 17 at the opening of the book and barely surviving as a dredger on the fictional island of Jeval. The daughter of a notorious trader, Fable keeps her identity a secret to protect herself and the father who dumped her on the island four years earlier. He told her if she could find her way off the island that it would prove to him she could survive life as a trader and he’d give her “what was hers.” So Fable works daily to survive with the goal of getting off the island. With the help of a young trader, Fable gets off the island and sets a course to find her father.West is the captain of the Marigold, a small trading ship with an even smaller crew. Fable doesn’t really know him. She only knows that if it wasn’t for him, she’d have died a long time ago. Trading with him is the only thing that kept her going the last four years. Now she is on his ship. I like West. He’s loyal to his crew, but beyond that we don’t really know. It’s clear that he has feelings for Fable from the start (why else would he let her on his ship?) and he’s hiding something. Beyond that, West is a mystery to me. I like him, I want to love him, but we will see.The rest of the crew on the Marigold I love, Willa especially. Each of the crew members bring something different to the story, and each bond with Fable in their own way. I found myself rooting for them to all get along and for Fable to just stay with them, but her goal is not the same as theirs. She is determined to find Saint, her father, the notorious tradesman who rules the Narrows.Let’s take a sec to just talk about the world-building here. This world seems to be based off the Carribean and time period that revolves around pirates and traders. The best way to describe the traders here are as pirates, at least that’s my opinion. I really pictured them as cutthroat and ruthless. The markets they trade in remind me a little of the markets described in port towns during the colonial days of America. The vivid imagery used to describe both the ports and the diving that Fable does as a dredger put me right in the action. I could feel cool breeze coming off the water and smell the salt in the air.Overall, I really enjoyed this one. I decided to give it 4.5 stars (rounded to 5). The only reason I knocked it down a half star is predictability. I had most of the story figured out well before the end. However, that did not lessen my enjoyment. I adored this story and cannot wait for more set in this world. If you enjoy fantasy, slow burn (and I do mean SLOW) romance, and adventure on the high seas, you are in for a treat.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hanlie Pienaar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNZWDGEPVRH32UQE4MEH2LSA2PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HYAG3KPW23IQ?ASIN=1250254388",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Fable",
                "reviewText": "This is the story of a remarkable young lady, who not only has to fight to survive, but has to prove herself worthy to everyone!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebecca Betts",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBNSLVMER5RKKQIVCUX5EHDQYZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3C6V034PFKKRH?ASIN=1250254388",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2023",
                "reviewTitle": "4.0 out of 5 stars A fun adventure",
                "reviewText": "While I wouldn't place this in the category of being one of the epic fantasy novels of this age, it sure is a fun read.The characters are relatable and the relationships unique. I did find the building into the romance was non-existent. One minute you've only seen brief displays of the possibility of something, and the next there is a love that burns as bright as the sun. It left me feeling awkward about it, not to mention there was no anticipation built that the admission of feelings satiated.I would recommend this book to the younger YA community.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sophie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 26, 2022",
                "reviewTitle": "I love a good ship book",
                "reviewText": "I flew through this book in less than a day.I love the Pirates of the Caribbean movies - yes, even the last one - so a book about ships and diving for gems and treasure is right up my alley.I didn't realize how much I loved a ship setting, especially since I've read other books on ships and pirate books (which I also loved) so I'm glad I figured this out, cuz wow, love.The pace was great, I didn't feel like it dragged anywhere, and I like the characters and the world/island setting.I wish the dredging of the Lark was a little more detailed but other than that, *chefs kiss*I hope that Saint and Fable have a relationship, but I have a feeling he's gonna die 😬I ship West and Fable - See what I did there??*crickets*Fest? Wable? Oh, no, Wable is bad 😂",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 10, 2024",
                "reviewTitle": "5 stars",
                "reviewText": "This book was written so beautifully. This is my first ever pirate read and Ingrid not disappoint. The storyline had me hooked from page 1. The characters are great. The tension and drama throughout this book had me on the edge of my seat I cannot wait to get started on book 2 as the cliff hanger from book 1 left me shocked",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AlexiaAlexia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 29, 2021",
                "reviewTitle": "Muy Bonito",
                "reviewText": "Muy bonito, de tapa gruesa y en la portada del libro (sin su cubierta) tiene un diseño muy bonito azul metálico <3 Nada más me hubiera gustado que en su papel que lo cubre no tuviera el sello (al menos así de grande) de “Reese’s Book Club”",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1zCsiWhHZS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1tMpN7mZnS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nonya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 24, 2022",
                "reviewTitle": "ABSOLUTELY LOVED IT",
                "reviewText": "Adrienne Young's writing style and her way of storytelling is fluid and is driven by fascinating characters.It is amazing how much knowledge about ships and their construction is incorporated here. The author seems to know exactly what she’s talking about.In FABLE,Adrienne Young tells us a story about the various stages of survival, of being abandoned, neglected, and the importance of being at home. The love of a daughter for her father, father for daughter, between siblings, and about a boy and girl. Fable's world is so dark and brutal just like the deep sea on a stormy night.Fable, by Adrienne Young, is a quick and fun read! I can’t wait to read the second part NAMESAKE next.I absolutely loved it!Highly recommend!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sophie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on April 9, 2022",
                "reviewTitle": "thrilling",
                "reviewText": "Honestly amazing, opened it and woke up from a fantastic dream about pirates and badass-ness 4 hours later.Loved it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}