{
    "remaining_requests": 337,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Good-Green-Romantic-Fantasy-Wilderise/dp/B0CTTH537D",
    "body": {
        "name": "The Good and the Green: A Cozy Romantic Fantasy Novel (The Wilderise Tales)",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Good-Green-Romantic-Fantasy-Wilderise/dp/B0CTTH537D",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51R6vBgkxFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51ptI85a1sL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Amy Yorke",
            "link": "https://www.amazon.com/Amy-Yorke/e/B0CS26PZ37/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 26,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            ""
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 12 hrs 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A city girl trying to make the rent finds something priceless in a cozy cottage in the magical kingdom of WilderiseWhen Alison Lennox learns of her surprise inheritance of a country estate, she knows exactly what to do: sell it. Her late father set her on the path to career success and gleaming dwarven highrises, not backbreaking labor and leaky thatched roofs.All she needs to do to keep her life on track is get in, flip the cottage, and get out, hopefully with a pocket full of coin for the effort.The only problem? Everything in the nearby village is annoyingly charming. The quaint shops, the sweet little old ladies, the adorable talking cat.And reclusive doctor Keir Ainsley is the worst of them all. At first, he’s good and irritating, and he’s definitely wrong about where his property ends and hers begins. But then he has to go and save her life from a DIY disaster. And then he shows her that under his bristly exterior, there’s a tenderness that feels familiar and right.But the town does have a problem. A mysterious vine is spreading through the land, choking out everything in its path. “Cute cottage; minor overgrowth issue–probably not poisonous” isn’t going to work as a real estate listing, but that’s not all that’s wrong. The deeper her connection to Keir and the town grows, the further she strays from the life her father wanted for her.And she’ll have to dig deep into the town’s thorny past to have any hope of stopping the vine.Fans of Travis Baldree's Legends and Lattes and Heather Fawcett's Emily Wilde's Encyclopaedia of Faeries will love this heartwarming tale of finding love and coping with loss in the beautiful (and magical) kingdom of Wilderise.The Good and the Green is a romantic and cozy fantasy with deep personal stakes wrapped in the comfort of warm tea, feisty felines, and good friends. It is the first novel in the planned four-novel series The Wilderise Tales. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Mythology & Folk Tales",
                "link": "https://www.amazon.com/Mythology-Folk-Tales/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5391238011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CTTH537D"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Glasslook Press (February 2, 2024)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 309 pages"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 979-8989873913"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.5 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.25 x 0.78 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#162,011 in Books (See Top 100 in Books) #2,103 in Folklore (Books) #4,928 in Romantic Fantasy (Books) #8,522 in Fantasy Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 26 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A. Singrey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESRAGPR522VNSQUKPQUG6DCTJ2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LZD7K3LI62CI?ASIN=B0CTTH537D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Simply delightful cozy fantasy",
                "reviewText": "A simply delightful cozy fantasy that combines an unexpected inheritance, a misanthropic nobleman and a village cursed by a spreading poisonous vine.In a world where dwarves, elves, orcs and humans all share a city, Alison, a human, lives with an orc roommate in a tiny apartment, barely scraping by. When their elvish landlord announces a rent increase, it appears they may lose the little they have, until Alison receives an unexpected inheritance. She's the new owner of a cottage in Wilderise, the wilderness land across the sea that's still filled with traces of old magic.Alison is determined to gain a profit from the cottage, so she makes the journey. However, she finds that a poisonous vine is taking over the village, including Alison's property. Together with the villagers, she needs to find a way to save her cottage - and everyone else's.The characters were fun, especially the talking cat named Willow who becomes Alison's guide through the village. Alison also quickly attracts the attention of the reclusive Mr. Ainsley, a lord's son, who needs someone to help him overcome the tragedies of his past. Their romance adds a touch of sweetness to the book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna Darelli-Anderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA6KJYMSVT2WLDM7BPCG32KCIPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R278JGC62QNPWB?ASIN=B0CTTH537D",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Cute Little Cozy Fantasy",
                "reviewText": "Nature can be cruel. Nature is a beautiful and wild thing. It cares not for good or evil, for light or darkness. It just is, and we are at its mercy.Book 1 of the Wilderise Tales series, “The Good and the Green” by Amy Yorke is a cozy fantasy with a touch of romance and cottagecore feels. A story about found family, small-town living, and personal growth, the novel features a grumpy-sunshine trope, magic and mythology, and a talking cat!In a world inhabited by magical beings, set in a time that feels like a mix between the 18th century and modern era, Alison Lennox is a city-living human living paycheck to paycheck, fighting to progress in her career as a number-cruncher. Following the death of a distant cousin, she unexpectedly inherits some property in the country, far away in the land of Wilderise. Hoping to rent out the property for some extra income, Alison is surprised to find it in an… extreme state of disrepair caused by the town’s “overgrowth” issue. Even more, her reclusive neighbor, the mysterious Keir Ainsley, is an interesting enigma, swinging from irritating to charming at the flip of a switch. With the help of newfound friends, Alison works to help the town solve their vine problem and restore her cottage, uncover the man beneath the mask, and truly discover what makes her happy.While I savor the unhurried pace inherent to narratives of this genre, immersing myself in this particular book took a bit longer than expected. At first, the world-building is intricate, yet insufficiently explained, and initially, the narrative and dialogue struggled to captivate. However, the story gained momentum around the quarter mark, and despite some awkward moments, the interactions between the main characters resonated with a charm reminiscent of a Gregorian historical romance novel. As the story unfolded, it became fairly wonderful, particularly after the halfway mark, warranting a 3.5-star rating. I can’t wait to read the stories to follow!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aubri Warminski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGH52BMAVLAI4WAJ53KFNIVLFFXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR0BIYG2CI5H1?ASIN=B0CTTH537D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Hallmark Meets Fantasy",
                "reviewText": "“These people are a community. And it isn’t perfect because nothing made by people ever is, but they care for each other. They help each other without asking for anything in return. And I would love to be a part of that.”If you’ve ever wondered what it would be like if a classic Hallmark movie took place in a fantasy world with magic, fey folk, talking cats, and all the cozy cottagecore vibes, then this is a great book for you.The Good and the Green follows Alison, a human, as she navigates inheriting a cottage overgrown with magical vines in a foreign kingdom. Join her as she makes new friends who become like family, solves the mystery of the vines (as well as some stolen ink), and falls in love with the handsome recluse next door.This was a sweet read with easy to follow world building and a closed door romance. It does deal with healing from the loss of family members and some past child abuse so keep that in mind and be sure you’re in the right headspace for that kind of content.I look forward to seeing what’s next for Wilderise. 🩵🌸🌿",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Seraphia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVVDAH5G4HTM5XNEJG2WBQZ2PZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU6T7ZG0DAIZK?ASIN=B0CTTH537D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars 4.5 Star Cozy Fantasy",
                "reviewText": "The Good and the Green is the first book in the Wilderise Tales series, and for readers who enjoy cozy stories and fantasy, then this is the book for you!The Good and the Green depicts a fantasy world where humans and other fantastical creatures live together. There are some modern technologies, but not the same amount that we are accustomed to. But these characters make it work. Alison, the main character of this story, is barely scraping by. Her landlord is raising the rent, and she needs a windfall...and soon. Well, she gets her wish...but not in the way that she expects.What did she get? A cozy cottage in a distant town. The catch? She can’t sell it. Well, there goes that idea of earning some coins from that. When she travels to see about the cottage, well, the town manages to endear itself to her...minus one not so tiny problem...weird vines crawling around the countryside.This book is slow-paced, but it’s really a sweet and fun story at the end of the day. You get a nice cast of characters who bring so much to the story, and a slow budding romance that just works. You’re going to enjoy your stay in Wilderise and look forward to returning hopefully sooner than later.4.5 out of 5 stars",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}