{
    "remaining_requests": 314,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fires-Dead-Fantasy-Novella/dp/B081SDN6Y6",
    "body": {
        "name": "Fires of the Dead: A Fantasy Novella",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fires-Dead-Fantasy-Novella/dp/B081SDN6Y6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61cDqZ5ObrL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jed Herne",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Jed+Herne"
        },
        "brand": "Jed Herne",
        "merchantInfo": "",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 67,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Fire can’t be tamed. Wisp is a pyromancer: A magician who draws energy from fires to make his own flames. He’s also a criminal, one job away from retirement. And it can’t come bloody soon enough.Leading his misfit crew, Wisp ventures into a charred and barren forest to find a relic that could change the realm forever. But they aren’t the only ones on the hunt, and the forest isn’t as barren as it seems....A jaded gang leader longing for retirementA bloodthirsty magician with a lust for powerA brutish fighter who’s smarter than he looksA young thief desperate to prove herselfA cowardly navigator with secrets that won’t stay buriedTogether, they must survive fights, fires, and folk tales that prove disturbingly real - if they don’t kill each other first.A dark fantasy novella with a unique magic system, perfect for Joe Abercrombie or Brandon Sanderson fans wanting a fast-paced book. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Horror",
                "link": "https://www.amazon.com/Horror-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=49"
            },
            {
                "name": "Dark Fantasy",
                "link": "https://www.amazon.com/Dark-Fantasy-Horror-Fiction-Books/b/ref=dp_bc_aui_C_5?ie=UTF8&node=9803"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "2 hours and 51 minutes"
            },
            {
                "name": "Author",
                "value": "Jed Herne"
            },
            {
                "name": "Narrator",
                "value": "Jed Herne"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 21, 2019"
            },
            {
                "name": "Publisher",
                "value": "Jed Herne"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B081SDN6Y6"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#132,945 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #4,132 in Horror Fiction #4,975 in Epic Fantasy (Audible Books & Originals) #6,725 in Dark Fantasy"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Luis Dall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKU5G5SGJX6LL6HKMEPII5JRQKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U319PSFTD6HW?ASIN=B081SDN6Y6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2022",
                "reviewTitle": "5.0 out of 5 stars Great Novella",
                "reviewText": "A great debut novel(novella) from an exciting author. Such a cool, unique magic system. I would really enjoy reading more books set in this world! Fast paced and a quick read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rosa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF22XSA2ZIBWSU6VMIQLQ75VRM4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G695RMT2U5VK?ASIN=B081SDN6Y6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 7, 2020",
                "reviewTitle": "4.0 out of 5 stars Great",
                "reviewText": "Great fast paced piece of work. I couldn't put it down. The only qualm I have is that it wasnt longer but I appreciate the author not filling it with fluff. Waiting for the next book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Megan Richards",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEC4QUCRI34WNTE7L6YSTKIRQWSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z8THRN5Y6L91?ASIN=B081SDN6Y6",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2019",
                "reviewTitle": "3.0 out of 5 stars Recommended for those wanting a face-paced, quick read with magic.",
                "reviewText": "\"Crouching was murder on the knees.\"Wisp is a pyromancer: a magician who draws energy from fires to make his own flames. He’s also a criminal, one job away from retirement. And it can’t come bloody soon enough.Leading his misfit crew, Wisp ventures into a charred and barren forest to find a relic that could change the realm forever. But they aren’t the only ones on the hunt, and the forest isn’t as barren as it seems…I'm not usually a fan of shorts, as I never feel there is enough time to sufficiently get a feel for the world building or characters, but this one was surprisingly engaging enough. The pyromancy and ancient flames were an intriguing concept...paired with rivaling gangs and things could get super interesting for future iterations.The novella is broken into four POV: Wisp, Black Eye, Marogan, and Fleetfoot. While I found this distracting, it did nothing to interrupt the non-stop action of their mission and did allow for a more personal feel of the team. (However, Breeze + Fleetfoot? Come on.)Regardless, Wisp was probably my favorite since he was a grump and his various aches and pains were humorously littered throughout the narrative.Recommended for those wanting a face-paced, quick read with magic.Thank you to Book Sirens for providing an ecopy in exchange for an honest review.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dylan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERCRC2WVKJ2GSRCXYWRLYII754Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4FDICOSGL8WU?ASIN=B081SDN6Y6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 23, 2020",
                "reviewTitle": "5.0 out of 5 stars Dark and gritty",
                "reviewText": "I really enjoyed this shirt story. It was fast and entertaining the whole way through. I would recommend to anyone who likes dark fantasy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S43",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYZBOAQ23Y2I44WZ7GUYYXTHCOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QM5IG3UPT4FI?ASIN=B081SDN6Y6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 9, 2020",
                "reviewTitle": "5.0 out of 5 stars Hot read",
                "reviewText": "Criminal group follow through an area that suffered fires burning to ashes. Prize is won by returning with item from burned area.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katelyn Dickinson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRH6TS3GYLSKXQMJVVUUGWKD5MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1C7XLEKHWS94H?ASIN=B081SDN6Y6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 23, 2019",
                "reviewTitle": "4.0 out of 5 stars Fast-paced Novella",
                "reviewText": "I typically do not read a whole lot of novellas, unless they're connected to a series I'm reading, but this one was definitely worth my read! I really enjoyed the character. Each one had such different personalities, so I actually really enjoyed the multiple perspectives. There were characters I really liked, and characters I didn't like, but still liked reading from them. I'm kind of always a fan of the \"love to hate\" type characters anyway though, so I enjoyed that character in this for me. Fleetfoot was my favorite just because he's just so cute. Maybe a little too much of a scaredy cat, but still so cute, haha!I thought the writing was really great. I enjoyed it a lot. The story kept my attention. I honestly did not put this one down til I finished. Yes, it was short, but still. I was so interested in the story and needed to know what was going to happen by the end.For a novella, I think that Herne did a good job of still touching on the characters' history. I would have liked a bit more of each one, especially Breeze, but I think being able to even add in a little for each without it getting too long-winded for a short book was really good writing. I also really loved the pyromancy aspect, it was really interesting to me! I liked that Wisp had the Sight. That was a cool unique ability as well.Overall, I thought this was a really enjoyable novella. Fast paced, interesting plot, good characters. The only thing I'd suggest would be to build the romance a bit (I didn't totally believe it, but only because I didn't feel like it had the time it needed to build a bit) and a little more world building. I would have loved to have read more in the story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allison J. Springer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2KSMRCUZIVVO3WFBUVELDWC3BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A26MPSB5B1X4?ASIN=B081SDN6Y6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2019",
                "reviewTitle": "4.0 out of 5 stars Fires of the Dead, flames of the living",
                "reviewText": "I received this book as an ARC and am giving it my honest, voluntary review.This was a quick read and a good introduction to anything that might follow. The synopsis I read sounds like a D&D campaign: a group of adventurers with varied skills trying to complete a quest. It didn't play out like a game campaign. I was definitely reading a story.The group of five are led by a pyromancer named Wisp. Wisp is in his early 50's, which is quite a lifespan for someone such as he; a pyromancer and a criminal for hire. The remainder of his group are people much younger. There is another pyromancer, a 'thief', a large man of great fighting ability and a navigator. They have been hired by a local noble man of considerable power to retrieve an artifact which will bestow even more power.The group must navigate through a forest which succumbed to a great burning several years earlier. The fire not only destroyed the forest, but also the castle/stronghold of another noble man. That noble's entire family perished in the flames. Wisp and his companions are seeking an item that should be found in the ruins of the castle.Along the way, they encounter another group which is definitely seeking the same item. They must figure out a way to eliminate the competition and then move forward to the castle. At this point, telling more of the plot would reveal spoilers.The tale was well written. The characters could have been better fleshed out, but the author revealed enough to whet the appetite for more. The obstacles to completing the quest were believable and kept me interested in seeing how the story would resolve. There are twists along the way. I certainly hope this is a prequel to a larger tale.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rob Di Giovanni",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 11, 2019",
                "reviewTitle": "A fantasy debut dripping with sweat and fire",
                "reviewText": "Fires of the Dead is the debut novella Perth, Western Australia writer Jed Herne. It's a heist book wrapped in a sweaty fantasy world of fire and death where a rag-tag group of thieves, miscreants, thugs and liars try to pull off an almost impossible task for a Baron in a far-off city. Each chapter is told from the perspective of a different character and as you progress through the novella, hearing more about the world and the people in it, the diverging motives of each character become clear. So much attention was poured into the first character's narrative that I was almost disoriented by the sudden perspective-shift when I reached chapter two, but I quickly discovered that all of the characters are given this kind of loving limelight, at least for a little while.My only critique is that I wish the narration was told in first-person for each character rather than in third. I feel like that small adjustment would have deepened my connection to each character and really allowed me to sympathise with these morally-questionable people. All in all though, Fires of the Dead is a terrific fantasy debut that takes bold risks and delivers a thoroughly enjoyable romp through a strange world of magic and thievery. Jed also hosts an excellent podcast on writing which I highly recommend!Fires of the Dead is a super quick read (I actually read the whole thing while up all night because I slurped down a mega-strong coffee at 11 p.m.) and there's enough meat on its bones to finish it in one session. If you're looking for a fantasy read that's quick and digestible or if you want to support Australian artists, give Fires of the Dead a read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}