{
    "remaining_requests": 315,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/House-Sky-Breath-Crescent-City-ebook/dp/B093WB84G1",
    "body": {
        "name": "House of Sky and Breath (Crescent City Book 2)",
        "price": "$8.21",
        "originalPrice": "",
        "rawPrice": 8.21,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/House-Sky-Breath-Crescent-City-ebook/dp/B093WB84G1",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/911OwVymo3L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sarah J. Maas",
            "link": "https://www.amazon.com/Sarah-J-Maas/e/B0070291GK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 68494,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The #1 New York Times bestseller!Sarah J. Maas's sexy, groundbreaking CRESCENT CITY series continues with thesecond installment.Bryce Quinlan and Hunt Athalar are trying to get back to normal-they may have saved Crescent City, but with so much upheaval in their lives lately, they mostly want a chance to relax. Slow down. Figure out what the future holds.The Asteri have kept their word so far, leaving Bryce and Hunt alone. But with the rebels chipping away at the Asteri's power, the threat the rulers pose is growing. As Bryce, Hunt, and their friends get pulled into the rebels' plans, the choice becomes clear: stay silent while others are oppressed, or fight for what's right. And they've never been very good at staying silent.In this sexy, action-packed sequel to the #1 bestseller House of Earth and Blood, Sarah J. Maas weaves a captivating story of a world about to explode-and the people who will do anything to save it.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B093WB84G1"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bloomsbury Publishing; 1st edition (February 15, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 15, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 9664 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 807 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 163973175X"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#64 in Kindle Store (See Top 100 in Kindle Store) #2 in Demons & Devils Paranormal Romance #10 in Romantic Fantasy (Kindle Store) #10 in Fantasy Romance eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 68,494 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "A Court of Thorn and Roses Crescent City Throne of Glass Also available from Sarah J. Maas",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a8209df0-aeea-44f8-87d2-b13984bbf75f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6f5be3ae-ef32-4a81-a55a-b52cf0e075fd.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/57472f75-3519-420b-aa4e-94b0b2eb9855.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/439c0bb6-7ebb-4ba9-a413-b2d64d0f9c24.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f6629061-9285-4c5d-ba04-e913d48d56c8.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/defce483-4c4a-49cc-8907-20d7be8ef9c9.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c1f8c4a2-cf5d-45af-ac0f-15fda1b9b39b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/223d5a2e-d129-4f86-b7b1-96e2802aabf9.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TayTay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEEGEOFN4RVLJ6ATFBTMIRRCZSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18G5100KLMSVK?ASIN=B093WB84G1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Thrones, Courts, and Now a Dash of Sky – Sarah J. Maas, the Queen of Chokeholds!",
                "reviewText": "Hold onto your bookmarks, fellow bookworms, because Sarah J. Maas has unleashed another literary beast upon us – \"House of Sky and Breath,\" the second installment in the Crescent City series. It's like she took a sip of creativity potion and said, \"Watch me conquer your soul with words!\"First things first, if you haven't devoured the ACOTAR books, you might be wandering through Crescent City with a perplexed expression like a lost tourist. Trust me; you'll want to visit the Courts before taking this scenic route. And if you haven't feasted your eyes upon the Throne of Glass series, well, buckle up, because you're in for a royal treat. But hey, if you're feeling rebellious, you can jump straight from ACOTAR to Crescent City – just be prepared for a magical rollercoaster that might leave you questioning your life choices.Now, let's talk about the chokehold this book has on your emotions. If \"House of Earth and Blood\" left you gasping for air, \"House of Sky and Breath\" will have you clutching your heart, desperately trying not to spoil anything for your fellow readers. The Asteri have kept their word – mostly – but rebels are rebellious, and the threat of chaos looms like a storm cloud over a cozy reading nook.Bryce Quinlan and Hunt Athalar just want to Netflix-and-chill their way to a normal life, but when you've got rebels stirring up trouble, staying silent is about as likely as convincing a cat to take up ballroom dancing. The choice is clear – fight for what's right or risk the wrath of fictional characters who've never been good at keeping quiet. Spoiler alert: They choose the epic battle route.In this 27-hour-and-42-minute epic audiobook experience narrated by the enchanting Elizabeth Evans (seriously, give this woman all the awards), Maas weaves a story so captivating, that it's like she's playing a symphony on your heartstrings. Move over, Netflix and Hulu – audiobooks are the new binge-worthy entertainment, and Elizabeth Evans is our auditory goddess.\"House of Sky and Breath\" isn't just sexy and action-packed; it's a literary explosion that makes you rethink your life choices. Maas doesn't just write books; she crafts immersive universes where love is the key, and everything – and I mean everything – is possible. The wait for the third book? It's like waiting for a magician to reveal their final trick – torturous and exciting all at once. This will leave you spiraling for all the theories you can get your hands on, I know I have.So, grab your headphones, dive into the world of Crescent City, and prepare to be mind-blown by the queen herself, Sarah J. Maas. Through love, all is possible, and through Maas, all is enchantingly unpredictable.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kari L.Kari L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG666QKQBY26Y7CSQ5RPTLSTZFQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R300RBEQ3TI4QJ?ASIN=B093WB84G1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing Sequel",
                "reviewText": "“Our love is stronger than time, greater than any distance. Our love spans across stars and worlds. I will find you again, I promise.”✨✨After the events of HOEAB, Bryce and Hunt are trying to live their lives while staying under the Asteri’s radar. However, rebel activity is on the rise, and they want Bryce, Hunt, and their friends to join the cause. With their home on the precipice of war, Bryce must choose who to fight for and how far she’s willing to go as secrets unravel and her world gets turned upside down.✨✨At this point, if Maas writes it, I will read it. I love her writing and House of Sky and Breath was no exception. Maas has a particular talent for dropping seemingly irrelevant details that often come back in a big way. This book is full of those details, and you could lose yourself in theory boards trying to sort it all out. One of the elements in this book that I loved was getting a broader range and more page time of characters being focused on outside of Bryce and Hunt. There are so many different groups, fae, shifter, mer, etc., that I appreciated the extra insight into their political workings. I especially found the interactions between Ruhn and agent Daybright fascinating while trying to puzzle out her identity. Also Bryce is starting to develop some Aelin worthy plans, and I’m here for it. The amount of times she’s thinking 10 steps ahead of everyone else it has already figured out the clues, I love it. The vibe of HOSAB had a darker and more tense vibe than HOEAB at least for me. There are lighter and comedic moments to help offset this, though. One of my favorites being the ‘that’s not a cat’ scene. Once you pick this book up, it’ll be a struggle not to want to finish it in one sitting. I will warn you though, there are so many twists, turns, and mind blowing revelations towards the end that you’ll want book 3 immediately. I highly recommend reading this as well as Maas other work.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81CKpAmY6VL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emily Hill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2OY7ZQQK2WMU2OBYT6BAL2XWLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27VSVB1AW5UQ?ASIN=B093WB84G1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars I LOVE THIS SERIES!",
                "reviewText": "January 2024 Reread:This book. This freaking series. The entire Maasverse. I don't know how to function after finishing this book and I'm so grateful book 3 is coming out next week, but I'm terrified of what it will do to us because there are FOUR Houses - so will we be left in limbo for 2 years until the next comes out???Some things I noticed on the reread.The Emile plot line didn't really DO anything. It sort of was a dud. Unless it picks back up, but I don't think it will. It was weird.Hunt. HUNT. I think I love Hunt more than Rhys, more than Rowan. More than Cassian and Az and Lorcan and Aedion. He's my favorite SJM male. And he and Bryce are perfection. Not perfect, obviously, but they UNDERSTAND each other. It's the dream to be that understood. THAT seen.If my friends get picked off in the next book, I'm gonna be mad. Hunt and Ruhn must live. Everyone must be safe. I can't handle losing any of them!***************************I am wrecked.I need to know what happens. I need to know NOW. If SJM does me dirty on the good guys, I'm going to go find her and tattoo a halo on HER head.This book is chaos. This SERIES is chaos. There is so much, there are so many different TYPES of people, so many underlying stories that all need resolved in the January release.Bryce and Hunt are a delight. Their sarcasm and irreverence and love make me laugh. I like Ruhn even more in this book. I love seeing the depth of characters come to light. I hate the Asteri more. I yelled more at the characters or situations.I NEED MORE. Like... right now.Spice warning - it's there! Enjoy or skip!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 11, 2024",
                "reviewTitle": "Muy bueno!",
                "reviewText": "Llegó en excelentes condiciones, muy bien empaquetado!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah LuisaSarah Luisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 3, 2023",
                "reviewTitle": "Perfeito",
                "reviewText": "The media could not be loaded. O livro é perfeito, a jacket tem a textura aveludada e dentro do livro tem uma ilustração da capa. O livro sem a jacket é lindo. Estava com medo de chegar amassado mas veio apenas com um pequeno amassadinho em cima e o miolo um pouco sujo mas nada que me incomode. As páginas são um pouco mais ásperas e grossas que a edição brasileira pela Galera Record mas isso não incomodou. Acho que essa é a edição dos Estados Unidos mas não tenho certeza. A única coisa que me incomodou um pouco foi o modo como as páginas ficam quando o livro é aberto, e parece que o livro é frágil pois sempre que eu pego ele sem a jacket, a madeira (ou seja lá do que a capa é feita) fica rangendo e isso incomoda um pouco. Tirando essas coisas, amei e não me arrependo de ter comprado.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81RZDn3vpkL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/810TtLd92JL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81KRLTyZxwL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81exSCPi+uL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81PpuDCUjpL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81FwCGNDlkL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61YK2szrqHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/518TZli03EL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/E1fEpfHtdzL.mp4"
                }
            },
            {
                "reviewerName": "Angeline O.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on February 13, 2024",
                "reviewTitle": "Those three things life rent free in my mind",
                "reviewText": "I feel so bad for all the readers who had to wait YEARS after this one because I had to wait two weeks and let me tell you, it was AWFULL!So this one ends on a maaaaaaajor cliffhanger and wrecked me yet again. I just fell in love with Cresent City. Like, madly, deeply in love. I want more and more and more and more.And like, I hate Danika but I like miss her at the same time, does that make sense? And I don't want to be a spoiler so I can't like elaborate SO JUST BUY THE BOOK OKAYThose green hills man, those green hills.And Ruhn. Ohhhh Ruhn. Y'all can have that angel. Give me the Crown Prince baby.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 9, 2024",
                "reviewTitle": "Tolles Buch.",
                "reviewText": "Fortsetzung zum Teil 1. Spannend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Liz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 6, 2024",
                "reviewTitle": "Une lecture incroyable",
                "reviewText": "Quel lecture incroyable. J’avais été subjuguée par le tome 1 et je suis estomaquée par le 2. La plume de SJM est vraiment incroyable et cet univers si vaste est si riche, si vibrant, si obsédant. J’ai eu du mal à poser le livre pendant ma lecture, étant très attachée à chacun des personnages de cette histoire. Mon cœur a battu très très fort pendant la plupart des événements de ce tome 2 et cette fin--, cette fin !!!! Je comprends mieux pourquoi le tome 3 est la sortie plus attendue de l’année et pourquoi je ne fais que le voir sur les réseaux sociaux!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}