{
    "remaining_requests": 306,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fantasy-Fiction-Formula-Deborah-Chester/dp/0719097061",
    "body": {
        "name": "The fantasy fiction formula",
        "price": "$18.99$18.99",
        "originalPrice": "",
        "rawPrice": 18.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fantasy-Fiction-Formula-Deborah-Chester/dp/0719097061",
        "soldBy": {
            "sellerID": "A3LP6WFLG3L883",
            "name": "HPB-Ruby",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A3LP6WFLG3L883"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81b2XzjgNeL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Deborah Chester",
            "link": "https://www.amazon.com/Deborah-Chester/e/B001IO9W38/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "HPB-Ruby",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 552,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Listen carefully to what Debbie has to say about telling stories, aspiring writer. She knows exactly what she's talking about.Jim Butcher, New York Times bestselling author of The Dresden Files Book Description A guide to the nuts and bolts of fantasy writing that illustrates techniques with examples drawn from published fantasy fiction and offers plentiful drills and exercises to help students hone their writing skills From the Back Cover There's more to writing a successful fantasy story than building a unique world or inventing new magic. How exactly is a plot put together? How do you know if your idea will support an entire novel? How do you grab reader attention and keep it? How do you create dynamic, multi-dimensional characters? What is viewpoint and do you handle it differently in urban fantasy than in traditional epics? What should you do if you're lost in the middle? How do you make your plot end up where you intend it to go? From the writing of strong, action-packed scenes to the handling of emotions, let award-winning fantasy author Deborah Chester guide you through the process of putting a book together. Convinced there's no need to shroud the writing process under a veil of mystery, Chester supplies tips that are both practical and proven. They are exactly what she uses in writing her own novels and what she teaches in her writing courses at the University of Oklahoma.Along with explaining story construction step by step, Chester illustrates each technique with examples drawn from both traditional and urban fantasy. The technique chapters include exercises to assist novices in mastering the craft of writing fantasy as well as suggestions for avoiding or solving plot problems. More experienced writers will find tips for taking their work to the next level. With an introduction by author Jim Butcher, The fantasy fiction formula provides the information you need to gain skill and proficiency in writing fantasy like a pro. About the Author Deborah Chester is the John Crain Presidential Professor at the University of Oklahoma, teaching Professional Writing Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 38 mins",
            "$3.99 delivery February 27 - March 4.",
            "Or fastest delivery February 23 - 28."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "There’s more to writing a successful fantasy story than building a unique world or inventing a new type of magic. From the writing of strong, action-packed scenes to the creation of dynamic, multi-dimensional characters, fantasy author Deborah Chester guides novices and intermediate writers through a step-by-step process of story construction. Whether offering tips on how to test a plot premise or survive what she calls the dark dismal middle, Chester shares the techniques she uses in writing her own novels. Examples drawn from both traditional and urban fantasy illustrate her nuts-and-bolts approach to elemental story design.With a foreword by New York Times best-selling author Jim Butcher, who studied writing in Chester’s classes at the University of Oklahoma, The fantasy fiction formula delivers a practical, proven approach to writing fantasy like a pro. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Manchester University Press (January 1, 2016)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0719097061"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0719097065"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.4 x 1.1 x 8.4 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#67,596 in Books (See Top 100 in Books) #11 in Science Fiction & Fantasy Writing #67 in Authorship Reference #190 in Fiction Writing Reference (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 552 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sherry B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVN6JG7FPD3Z2NHIKWGT4IDTYVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT0V0HN7NAYS4?ASIN=0719097061",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Book",
                "reviewText": "My son enjoyed it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brad Parks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCANWDEOFHKWLAC3DUOPZ3P5X4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZXPTIQK9W6RS?ASIN=0719097061",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Solid, actionable advice",
                "reviewText": "The author’s straightforward tone and practical advice is paired with thoughtful exercises that help you work through the guidance you’ve received and solidify it in your mind. One of the parts I enjoyed the most, because it simply isn’t addressed often enough in writing books, is the scene-sequel structure of story composition. It’s so basic, but hardly anyone goes into the same depth of explaining what a scene is. Great stuff, and especially great that the book is focused on fantasy specifically. I will be putting this book to extensive use!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "samjerom2001",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYUWSV3LDE22XTJ2GSI6RDKRJTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33C7VPEWLH6U9?ASIN=0719097061",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 11, 2019",
                "reviewTitle": "5.0 out of 5 stars Repetition is the father of learning- Zig Ziglar",
                "reviewText": "I'm on chapter 2 in this book. i read the same chapter 2 to 3 times a day, everyday for a week. because i know repetition is the father of learning and Repetition is required to change the Subconscious paradigm.edit 10/12/2019I still believe repetition is the father of learning but I stopped reading this book. I was halfway through it but stopped reading it. I Started reading the blue books by William c Martell. I really enjoy reading martell's book and I read one chapter a week over and over again then go back and rereading what I read the previous week. i'm moving slowly through the books. there are like 16 of those blue books and i'm reading all of them. I plan to keep reading William martell but I did enjoy what I read in this book and will come back to it. maybe in a year or two10/20/2020I have finished reading the fantasy fiction formula twice. I'm currently almost finished reading for the third time.By the fourth time reading I will start practicing some of the techniques in the book.I saw on Instagram that Naomi osaka, the tennis player, spent over 10 years losing at tennis to her big sister but she didn't give upI plan to do the same thing with the fantasy fiction formula. I plan to read it over and over again over the next 10 years and practice the techniques8/22/2023I haven't read this book in a long timei learn a lot during that time. the most important thing is repetition is key to learningbut the rarest of human qualities is consistency. so 97 percent give up in 1 yearthat's me right there. i gave up reading this bookbut i am back at it. i will take like 4-6 months reading one chapter because repetition is the key to learningif i don't give up maybe in 5-8 years i will have a noveltake your timerepetitionrepetitionkeep going for yearsnever give upthat's the key to success in anything",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam Knight",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF52RAIUUKHBWGODQHCGWU2OW2TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDR2CUC9P4PZ0?ASIN=0719097061",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2016",
                "reviewTitle": "5.0 out of 5 stars This is the one I will recommend.",
                "reviewText": "I heard about this book from Jim Butcher when he was speaking at a conference. Yeah, I know, his name is dropped in the book several times. Yeah, I know he knows Deborah Chester. Well guess what? I am jealous he knows her and learned from her. I wish I had. As an author, I attend numerous (generally 8 to 10 a year) conventions and often speak on a wide variety of panels on numerous topics. There are some questions that I always get asked. One of them is: What book(s) do you recommend about writing? That question comes in many different shapes and sizes, but that is the meat of it. Here is my new answer: The Fantasy Fiction Formula by Deborah Chester. This book is more valuable than any writing class I have ever been to. Probably all of them put together, if you take out the human interaction factor. If you need to know something about the craft of writing (not the silly grammar rules, but how to make a good story) and it isn't in this book, then there are one of two thing going on: Either you are a super Pro + level author experimenting with something new or you are wasting your time fooling yourself into thinking something is important when you should be concentrating on learning what Deborah Chester has so clearly laid out in this book. This is going on my shelf as a reference book, a refresher course, and, honestly, probably the only book about how to write, other than Stephen King's On Writing that I actually enjoyed reading. Really? I enjoyed reading it? Yeah. That part is a little weird, because this really is a text book on how to craft a good story. A text book. I never enjoyed reading one of those before. I would argue that I am biased because I am a writer and writing fascinates me, but the truth is, I don't usually enjoy reading books on how to write. On a personal note: Deborah, if you read this review, I just wanted to say thank you for writing this book. Everything I write from here on out will be the better for having read this.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JANINE BRAY-MUELLER",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 1, 2023",
                "reviewTitle": "Great! Worthwhile buying the printed book",
                "reviewText": "This book targets fantasy writers but contains excellent information for all fiction writers. It certainly helped me to start writing my first fantasy book. :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Connor Caple",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 18, 2020",
                "reviewTitle": "No idea why anyone complains about this book.",
                "reviewText": "I gave been writing for many years now and still managed to pick up some new ideas from this book. I dud nit find the introduction, or the author, to be condescending. Jim Butcher and the author both have many books published and both plan and work hard to ensure their next book sells.Hard work creates good stories. As JS Bell has said in other books: fiction that breaks all the rules to be speculative is also called \"fiction which doesn't sell\".This book will go a long way to teaching you the art and craft of producing good fiction, the hard work is the part you must provide.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 2, 2017",
                "reviewTitle": "Great Book",
                "reviewText": "An excellent book, it explains in detail with good examples and easy to followone of my favorites for sure!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nathalie S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 20, 2019",
                "reviewTitle": "Sehr zu empfehlen!",
                "reviewText": "Sehr gutes Buch - jedem, der selbst Fantasy-Romane schreiben möchte wärmstens zu empfehlen.Die Autorin weiß, wovon sie schreibt. Alle Lektionen sind mit vielen Beispielen erläutert.Einer der besten Schreibratgeber, die ich kenne.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ewyn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 15, 2017",
                "reviewTitle": "Best writing book I’ve ever read",
                "reviewText": "I have read a lot of books on writing. Yet so many of them just felt like repeats of each other. More than that, I had a strong feeling that they were incomplete. That there was a piece of the writing puzzle that no one was talking about. I finally found the information that I was looking for in this book. And it is suitable for any type of writer not just fantasy. Highly recommended",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$16.99",
                "sellerName": "Sams-Books",
                "sellerRating": "5"
            }
        ]
    }
}