{
    "remaining_requests": 208,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Assassin-Dark-Fantasy-Novel-Darkblade-ebook/dp/B097P16R1Q",
    "body": {
        "name": "Assassin: A Dark Epic Fantasy Novel (Darkblade Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Assassin-Dark-Fantasy-Novel-Darkblade-ebook/dp/B097P16R1Q",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81A2VPy9CHS._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Andy Peloquin",
            "link": "https://www.amazon.com/Andy-Peloquin/e/B00J9008MC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 3865,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B097P16R1Q"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ The Fantasy Fiends Publishing Inc. (July 6, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 6, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1736 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 672 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,334 in Kindle Store (See Top 100 in Kindle Store) #5 in Classic Fantasy eBooks #266 in Sword & Sorcery Fantasy (Books) #282 in Sword & Sorcery Fantasy eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 3,865 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The best assassin in the world doesn't come cheap...",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/c0b9cfed-cc33-4da8-bbeb-a0a0a926c563.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Betraying him will cost your soul",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/554e0e11-5055-4c42-bdcd-5ff1bf97f236.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Darkblade Queen of Thieves Heirs of Destiny The Silent Champions Genre Dark Epic Fantasy Grimdark Young/New Adult Military/War Epic Fantasy About All in Voramis know the legend of the Hunter. Relentless. Immortal. Death walking. The greatest assassin who ever lived. Pay the master killer his due and the Hunter will execute any target, carry out any contract, no matter how impossible. They killed her family. They ripped apart her home. But to repay her debts, she'll have to sacrifice her innocence. In a cutthroat den of thieves, can Viola rise to power and outrun a brutal death? A kingdom of death. A war for power and profit. Young heroes caught in the crossfire. The fate of a nation rests on their shoulders—are these young heroes strong enough to seize their destiny? Captain Aravon's march toward glory dissolves into pain as ruthless barbarians massacre every last one of his soldiers. Burning for vengeance, he leaps at the chance to spearhead a specially-trained company and pay back his tragic defeat with blood. # of Books 6 (and counting) 3 (+ prequel) 5 (+ prequel novella) 6 Audiobooks ✓ ✓ ✓ Series Complete ✓ ✓ ✓ Crossovers With/Links to Other Series Queen of Thieves, Heirs of Destiny, The Silent Champions Darkblade, Heirs of Destiny, The Silent Champions Darkblade, Queen of Thieves, The Silent Champions Darkblade, Queen of Thieves, Heirs of Destiny Suggested Reading Order 1 2 3 4 Cool Easter Eggs to Spot The Silent Champions (indirectly) save the Hunter's life. Ilanna steals something of particular interest to a familiar assassin. Keep an eye on that dagger. Familiar faces from all three other series.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/c0b9cfed-cc33-4da8-bbeb-a0a0a926c563.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/554e0e11-5055-4c42-bdcd-5ff1bf97f236.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/bdee2447-4314-4c49-8231-ab7072723ae0.__CR398,0,692,1383_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/e6361827-93c8-498c-8205-ee3f164e754c.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/75d4a468-ac38-4d17-badd-ec25a5c5921c.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/757b3ff1-0a64-4403-94bf-7d687e9e48a4.__CR404,0,692,1383_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SCAreads",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCLCC23ZTZ2Q3S37OTVWSDKIJZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZD12F7SVUIGH?ASIN=B097P16R1Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Kicks off with speed and holds on to you for the rest of the ride.",
                "reviewText": "Voramis’ assassin for hire is a master of arms and disguise. No one knows his true face. Armed with a soul-stealing dagger, the legend of the Hunter inspires fear, and yet he shelters and tends to the poorest and the sickly of Voramis. For years, he has avoided the Bloody Hand crime syndicate, but times have changed, and the crimes against the innocents of Voramis are growing steadily worse. In one night, they take everything from him. Now, the Hunter is out for blood, and everyone in the way of his vengeance, be it human or demon, must be cut down.From the very first paragraph, the reader gets shoved into the action and it doesn’t let up. The author has such a vibrant writing style that the sentences just flow off the pages seemlessly at an alarming speed. The world was focused on the city of Voramis with its slums, markets, rich quarters, and palace. The worldbuilding though was far more extensive, especially as the book progressed, detailing the history of the religion and the origin of demons. All of it was very immersive. Especially all the sensory details. This book has to have the most potent olfactory use that I’ve read to date, which helped to not only imagine this world better but to establish an important aspect about the Hunter. And beyond all that was the fun and disconnect from the real world I had while reading it.I did worry early on that the Hunter would be a Marty Sue type character because he is just so fantastic at everything between such traits as acting perfectly on cue in each of his disguises, his unparelled fighting skills, and not particularly struggling, but then around 30% in, the Hunter’s vulnerability comes out : weaknesses and internal struggles aplenty. From then on, the character grew and I got attached.4.5 ⭐ rounded upHonestly, if you love non-stop action in your reading with demons, cutthroats and world-ending threats, this book will deliver for you !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SteveA66",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNCZRR7WE7CC7OJX6IVIIBUY7YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S2B4FYHLNMZN?ASIN=B097P16R1Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Excellent character",
                "reviewText": "Loved the characters in the book. Not an easy read but worth the extra poo patience to get the whole feel of the story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher Russell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI3QLGX3MQAVCDFL3377XECLD3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMKFQ2HZ9QOSU?ASIN=B097P16R1Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 14, 2021",
                "reviewTitle": "5.0 out of 5 stars The Hunter is Peloquin's John Wick, and Voramis is his King's Landing",
                "reviewText": "Peloquin has achieved the impossible: dragging my rent and bloody heart through 750 pages of pure heartbreak only to leave me grinning like a fool through the final pages. Yes, heartbreak. Darkblade: Assassin is not for the squeamish, and every twist and turn of The Hunter's tale is bound to leave shredded pages or bent plastic (for you Kindle readers) beneath your white knuckles. Let's dive into this dark fantasy masterpiece.The Hunter is one of the three pillars of power in the festering sore that is Voramis. King Gavian might rule in broad daylight, but a vicious criminal syndicate, the Bloody Hand, owns everything else. The flesh trade, the brothels, the black market. If it's worth even an offal-caked bronze drake, they have a finger in it.A tenuous peace exists between the Hunter and the Bloody Hand. He ignores their wanton degeneracy and corruption, and in return they give him free reign to carry out assassinations—ones he is forced to execute to sate the ravenous bloodlust of a magical dagger inexplicably bound to him. It is not a tranquil relationship, but there is peace. For now . . .What follows is grim, bloody slaughter. Peloquin is a master of sensory storytelling, rooting you in the Hunter's unstable mind as he battles through reeking back alleys, incense clogged parlors, musty catacombs, raucous taverns, and elegant soirees. I cringed at every blow the Hunter struck and received. Tasted the coppery blood in his mouth and curled my noise up at the stench of death he was so Keeper-damned efficient at doling out. Every thrust, stab, slash, hack, chop, and any other method of dealing immense bodily harm was accounted for, and I reveled in the amount of detail I was being given.But for all Peloquin's emphasis on action, does his world-building and characterization suffer? Hardly. If anything, these are the true strengths of Darkblade: Assassin. In the middle of all the death, despair, and suffering, my favorite segment was three subsequent chapters that consisted of nothing but the Hunter and a side character talking about lore while climbing a seemingly infinite staircase. Peloquin's mythology is riveting. The talk of gods, demons, ancient civilizations, lost continents, frozen seas, forgotten wars, and alchemy could be ripped from the twitching muscles of this book and would still be fascinating on their own. Bravo, well done!And characterization? The Hunter is, quite frankly, a mess. But for all his brutality and bloodlust, he is a compelling, likeable mess. He must kill, but he chooses who, why, and when. Even in the midst of his long-term amnesia and despondence at the unending cycle of death and mayhem he must engage in, the Hunter has a code he follows. And, perhaps, even people he cares about. I fell in love with the brooding bloke, and my heart ached when the vicious Peloquin inflicted the unthinkable upon him.\"In these quiet moments, the Hunter became the prey, and he could never escape the lifeless eyes and accusing faces.\"This low point in the novel might receive criticism from other reviewers, but not from me. Depression is not something that evaporates with one minor success or simple kindness. Guilt and shame are not overridden by direction or purpose—at least not entirely. They are ever present, like ghosts lurking just out of sight, waiting to drag us back down into the darkness at the slightest weakness or crack in our armor. The Hunter encapsulates this perfectly, and I applaud Peloquin for not shying away from these hard truths.I could gush for hours about this book, but the highest praise I can give it is this: read Darkblade: Assassin for yourself. It will hurt you. Yet, at the same time, it will also give you hope. Hope that we can rise above our heritage, our circumstances, and our past. Hope that we can be the light in the darkness; the good that doesn't yield to evil. And we don't have to be pure ourselves to take up that fight. We have all sinned, we have all fallen, but as long as we rise to our feet once more, we will never truly be beaten.Just like the bloody Keeper-damned Hunter of Voramis.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TomB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFSVEFJ62IQRO7CAWVYMPL6PQOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHTB7EU614ZPE?ASIN=B097P16R1Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Half & half",
                "reviewText": "Very enjoyable read for me. What I found most fascinating was the very well done mixture of characters and violence. Goes right along with the half and half nature of The Hunter. There's conflict everywhere, from his inner demons, literary, to the multitude of well done fight scenes. The fight t for the soul of the city and his own soul. Assisting, protector of the weak. I liked all of that and more. There's closure and the purpose for the next chapter in the story. Good read for sure.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C.K. MacLeod",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZOZEU6ZWBA2RT7JA2S4YVMEHWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KNK7WOIKVMJH?ASIN=B097P16R1Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2023",
                "reviewTitle": "4.0 out of 5 stars Fantastic novel somewhat buried in repetition",
                "reviewText": "I wanted to love this book. I really did. However, there are some things that keep me from giving it five stars. There are many moments through the 600+ pages that seem to drag on needlessly. I enjoy exposition to an extent and descriptive writing, but there comes a point when it becomes excessive (a la Stephen King at times). I could push past that. However, there is a great deal of repetition that litters the book. Internal battles within the main character are repeated, indicating little actual growth. The character seems to make repeated mistakes as well. It also feels at times that the author belabors the intended emotional impacts by repeating them as well. And the final conflict(s) are drawn out over multiple chapters to the point where it is exhausting. I can understand that the foe is meant to be nearly impossible to overcome, but it is done in a way that is not quite necessary. I don't want to call the writing amateurish or derivative, but it does come across that way at times, though the writing is done quite well on a whole. I think a bit of refinement could have turned this book into the blockbuster it has the potential to be. I do intend to continue the series as I am interested in the character and the story, but I do hope to see some growth in the composition of future novels as well as within the character himself. Definitely worth a read if you have the patience for it.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rob Wilson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 6, 2023",
                "reviewTitle": "Supurb",
                "reviewText": "What a great story having a part demon be the hero. I really enjoyed reading about his passing from a blood thirsty assassin to a protector of the downtrodden. Can’t wait to read more of this series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KarlMKarlM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 8, 2024",
                "reviewTitle": "Fast paced and action filled",
                "reviewText": "Assassin is the first instalment of the Darkblade series. This book strikes you from picking it up as it has THICC boy status, with a nice page count that promises death and depth it hits on both accounts.This book starts off with a bang. A full blown atomic explosion of action which picks you up by the collar and drags you right into it. With a white-knuckled grip it then continues to guide you through the carnage and destruction that follows the Hunter.The Hunter reminds me mostly of Etzio Auditore. With a grand arsenals of weapons and an enjoyment for rooftops the character was easy to imagine from the get go. Just like Assassins creed the enjoyment and the fights are enjoyable all around. Scenes of this book would not be out of place reenacted by Micheal Fasbender on the big screen. What gives the Hunter depth, and changes him from a 2 dimensional killing machine, is the humanity Andy Peloquin is able to infuse into the very core of the character. A moral assassin, with inconceivable skill can only mean a bad time for the underworld of Voramis.Yet what if his moral compass is destroyed? If his moral north no longer guides him. What will the Hunter find himself contemplating with his morals in chaos?I followed this book up by reading the 0.5 Novella Life for a Life. With nice insights into some main series relationships it would be a perfect start to anyone thinking about Darkblade but wanting to test the waters before commiting to the 8 book series of awesomness that I’m now enveloped in wanting to complete.Both Life for a Life and Assassin were hands down 5 Stars and an incredible time from the first page.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711KUUCHuoL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lara R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 17, 2023",
                "reviewTitle": "Fantastic first book in a great series",
                "reviewText": "Love the well written characters and the backstory they all have. The Hunter with his lost memories and his dagger Soulblade is a great anti-hero and I quite enjoyed finding out more about his past and his secrets.The world building is excellent and full of details, same goes to the history of said world.The battle scenes are brutal and bloody, and grimdark fans will enjoy them a lot.Also there's quite a few twists and turns, some really unexpected, which makes this book a real page turner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lord rascal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 28, 2021",
                "reviewTitle": "I loved it",
                "reviewText": "I loved the book.. liked the hunter. It was a grisly ride through and through and yet as refreshing as a fresh breath of air.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luke",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 27, 2023",
                "reviewTitle": "100% recommend!",
                "reviewText": "Any book with the word Assassin in the name will always draw my attention, though in truth I hadn’t read something like this in a good while so it was quite refreshing to read actually!This book was much darker than I expected, in a very good way. Andy doesn’t shy away from the gory details and is very good at creating that mysterious ‘I don’t know anything about this character but I want to read on and find out’ kind of vibe.The story reminded me of a cross between Assassins Creed and that show Dexter. The ‘hero’ is more of an anti-hero, and (much like Dexter) the Hunter has this kind of moral code that he sticks to which justifies the ridiculous amount of blood he spills. I really enjoyed this aspect as well as his special weapon that harnesses the power of his victims and makes him stronger for it.100% recommend! ⭐️⭐️⭐️⭐️⭐️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}