{
    "remaining_requests": 272,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sapphire-Eruption-Swords-Choice/dp/8409178419",
    "body": {
        "name": "The Sapphire Eruption (The Sword's Choice)",
        "price": "$15.99$15.99$12.57$12.57$15.99",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sapphire-Eruption-Swords-Choice/dp/8409178419",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41p4Y2f3SXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51r40RmEDpL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "I.M. Redwright",
            "link": "https://www.amazon.com/I-M-Redwright/e/B0846PYB3S/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by The Virtue Vendor and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 237,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review ★★★★★ \" I stayed up half the night just to finish it.\" - L. Burns.★★★★ \"Do you like The Last Airbender and Final Fantasy? Then this is definitely a book you want to read.\" -Matthew J. Swiontek★★★★★ \"What a great read. I can't wait to read the next book in this series\" -J. Michael. From the Author Get to know I.M. Redwright!Let's start talking about your amazing new Ya fantasy book series, how long is The Sword's Choice going to be?I plan it to be a four volume series, each taking place in one of the four kindoms. But you know how this works, you never know for sure... but that's the idea at least.Do you write your books for tweens, teens, or adults? do you write for a specific target?I don't actually have a target in mind, however, anyone that is older than 11 year old will enjoy my stories. Lots of adults have read my first young adult book and have really enjoyed it, and same goes for teenagers, so I'm happy about it!If you didn't write fantasy adventure books for teens and adults what would you write?That's a good question, I would probably write scifi, and I probably will at some point. However, I don't plan to do this until I have my Young Adult fantasy series finished.Let's get serious now, where would you rather write: a noisy coffee shop or a quiet library?Uh, I am quite used to writing in the most awkward places, so I would go for the noisy coffee shop, as long as they serve a decent coffee with milk of course.Do you listen to music while you write?I usually do, It's way more fun that way!"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 33 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 33 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 13 hrs 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"Thrilling and action-packed, easy to read.... my 13 year old boy couldn't put it down.\"\"This book has action and adventure, twists and turns, and so much more. I definitely recommend it for anyone over the age of 11 that likes fantasy.\"\"A fascinating medieval world, with magical swords, elemental kingdoms, and contains positive messages about never giving up.\"What is it about:But once a year, the skies burn red. Upon this day, the Fire Kingdom’s priests perform their ritual: each newborn’s palm is lacerated, opened with a sacred sword, for Firia’s next ruler will be seen to shed no blood. Long ago, Noakhail had been driven from the Fire Kingdom as an infant—forced to escape with his noble father. They’d wanted to kill him simply because he was next in line for the crown . . .Now, Noakhail has grown, and the swordsman won’t give up until he claims the throne and his birthright. But pure resolve may not be enough. He first must face grave danger as he cuts across the four kingdoms with his fire sword.Meanwhile, Princess Vienne is mistreated by her elder sisters. Shy and soft-spoken, she couldn’t be more unsuitable to rule the Queendom of Water. Alas, the Aqua Deus can be capricious, and the fates aren’t clear. Vienne will have to prove that she is capable of mastering the sacred water sword if she should hope to reign with pride. Unbeknownst to Noakhail and Vienne, their tales run parallel . . . and only one result can lie ahead: a ruthless battle. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17466"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ I.M Redwright (January 23, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 375 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 8409178419"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-8409178414"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 13 - 18 years"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.21 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.94 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#86,787 in Books (See Top 100 in Books) #434 in Teen & Young Adult Coming of Age Fantasy #1,382 in Coming of Age Fantasy (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 237 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "An epic adventure An action and adventure story set in a medieval fantasy world. Gripping, fast-paced, and lots of combats.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/84978a41-bcbc-4d4b-a88d-747c013e2344.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Discover why people love The Sapphire Eruption Magical Swords Noakhail's fire sword has an incomensurable power, however, such a breathtaking power comes at a high cost: for the sword will try to wrest control of his body and will turn into a frenzy during combat. Amazing characters The characters in this series will leave you no indifferent. You'll love some, you'll hate others, and you'll even want the most despicable ones to rot in a prison cell. A unique fantasy world Welcome to the Queendom of Water, where only women can reign. The Sacred Sword of Water will soon choose the heir to the crown, and it may choose the one princess who nobody expects to be chosen... Epic battles This medieval world is full of powerful monsters and well-versed in combat warriors, and let be no doubt that they will stand in the way of our protagonists' arduous journey.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/6c007ff4-a7ae-448a-b15f-cb1292fc2e27.__CR45,0,605,605_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/f8cb222f-28b9-4b77-bcb9-bf2fab0b95d0.__CR95,0,570,570_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/74bda67e-113e-4ef0-8c45-61ec1fea572e.__CR297,0,597,597_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/186afadf-5a78-48a3-bfe2-63398c258eb8.__CR258,0,526,526_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Is this book for teens or adults? The Sapphire Eruption is recommended for ages 12 and up, beyond that, you can enjoy this Ya fantasy story whether you are a teenager or an adult. Likewise, this action - adventure series is enjoyable for both boys and girls. Did you know that in the medieval world of The Sword's Choice skin color is not a reason for discrimination at all? Instead, the citizens in each of the 4 kingdoms have hair and eye color of a different color. That's right, in the Queendom of Water (so called because it can only be ruled by a woman) they all have blue eyes like the sea and blond hair, while in the Kingdom of Fire their hair is coal black and their eyes are brown, so it is easy for them to detect if there are any foreigners infiltrating their domain. And what happens if a baby is born from the love relationship of citizens of two different kingdoms? Good question, welcome to the engaging lore of the world of The Sword's Choice.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/f2639d30-e8f5-4b58-a3f8-fa09dbe92d24.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/84978a41-bcbc-4d4b-a88d-747c013e2344.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/6c007ff4-a7ae-448a-b15f-cb1292fc2e27.__CR45,0,605,605_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/f8cb222f-28b9-4b77-bcb9-bf2fab0b95d0.__CR95,0,570,570_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/74bda67e-113e-4ef0-8c45-61ec1fea572e.__CR297,0,597,597_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/186afadf-5a78-48a3-bfe2-63398c258eb8.__CR258,0,526,526_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/f2639d30-e8f5-4b58-a3f8-fa09dbe92d24.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sybrina Durant",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL5FWDG4FZD3X4MFH3PQA7IL34A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PPAAR1TM518D?ASIN=8409178419",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 23, 2020",
                "reviewTitle": "5.0 out of 5 stars Don't Give Up",
                "reviewText": "My first thought, as I read the last words of The Swords Choice – The Sapphire Eruption by I.M. Redwright was, “What? It’s over??? Oh man, what a bummer.” That’s because I absolutely loved this author’s story-telling and did not want to stop reading. Luckily, the story continues in Book 2 so I will have an opportunity to read the full accounting.There’s so much depth and history throughout this book that it was easy to feel like I was immersed in Noakh, the phoenix’s world. Being a fan of Piers Anthony, I absolutely love it when an author assigns special meanings to words. In this case, the main character’s name, Noakhail, means “Don’t Give Up” and through many trials and tribulations, he completely lives up to that admonition.Don’t get me wrong, there are many times when he is on the verge of throwing down his sword, so to speak. Wondering whether he will or won’t is what keeps the story moving along so swiftly. There are so many perils and situations that are full of action and adventure that there’s not a moment of boredom in the entire book. It reminded me a lot of The Sword In The Stone by T.H. White amongst many other rich, epic Arthurian fantasies. I also loved the idea of a world containing four separate elemental kingdoms.Oh yes, I forgot to say, Noakh comes from the Fire Kingdom where a “phoenix” is chosen to become the new king. Since it happens so early in the story, it’s not really a spoiler to say that he is chosen to be that phoenix when he is a little baby and things go so awry that he must be spirited away to a safe place to avoid being murdered.There are many other characters to be admired in the book but I have only concentrated on Noakh, here, because he was my favorite. The review, itself, would be as long as a book if I delved too deeply into the others. Suffice it to say, this is a great read. Check it out for yourself.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tonja Drecker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJOKSJE3KPYSUXT6TCKRRD4RO2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R206XSLXQP2J3H?ASIN=8409178419",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 14, 2020",
                "reviewTitle": "5.0 out of 5 stars A fantasy to sink in to",
                "reviewText": "It's been awhile since I read a pure, sink-into-the-world fantasy, and this one was a treat.Noakhail has grown-up alone with, what he thought, was his father. Every day, he's been trained to become a mighty warrior...for as long as he can remember. When his father presents him with a magical fire sword and discloses that Noakhail is actually the chosen king of the fire nation, Noakhail soon finds himself on a dangerous and adventure-rich path to save more than just his kingdom. At the same time, the twin sword, a water sword, needs to chose the future queen, and everyone in the kingdom believes it will be the current princess in Aquadom, but the choice has yet to be made. With the growing threat of Noakhail's presence, things are even more unsure.This tale pulls in from the first page and drives forward the entire way through. While the first pages grab the reader in and make the danger of the situation immediately clear, the world-building and character depth isn't far behind. Noakhail's personality holds all that a great hero needs, and his uncertainty makes him instantly likable. His relationship and the occurrences with his so-called father seal the deal before the adventure and action really kicks in.Secrets and dangerous intrigue keep the tension high as both Noakhail and the princess try their best to do what they see as being right. It's a nicely done weave, which keeps the reader bound to the pages. Add this to the more direct writing style, and it makes for a read which is easy to pick up and settle in with. It will be exciting to see where the adventures go next.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAH3U4737LFHDS2H5Q3OQ7Y7M7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VBTANRKSIDE4?ASIN=8409178419",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "4.0 out of 5 stars Good",
                "reviewText": "It was overall a good book. There were some parts that did not seam important, but it was, so be careful with that. The amount of cliff hangers kept me on edge and while it was sometimes annoying, it kept the book intresting. Definitely recommend for middle schoolers due to reafing leavel and interest.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "beany",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4CYYKCWSULCR5IB3HFYTKJBIGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMFAKZD7PR1NL?ASIN=8409178419",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 7, 2020",
                "reviewTitle": "5.0 out of 5 stars Great book of magical swords",
                "reviewText": "Irate this book a 5.0. This is the first book in a series. It is a science fiction -adventure story based on four kingdoms. This book focuses on Water and Fire and the magical swords needed to rule their countries. In the Fire kingdom a sword has chosen a baby to be the next king. Around the same time Water ahs chosen a young girl to be the next Queen to follow her mother. This book has some wonderful characters with interesting names. Noakhail trains to be the next King under the tutelage of Lumio his adopted father. During the journey Noakhail meets many interesting characters who all play a part in his growing up and development in his sward skills. Some of these characters die while trying to help NoaKhail. By the end of the book Noakhail seems ready to meet whatever foe he faces.At the same time the Water Kingdom has chosen a young girl to be the next Queen. She also faces many challenges. In the development of her own skill with the magical sword. The book is excellently written and easy to follow. There is a lot of action throughout the book.I can’t wait to read book 2 and see what happens to Noakhail and the future queen as their fates are bound to meet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RJS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBTZNKUWM53QEOQCO7ZSPSFVO3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EMEHJ2KU3MV8?ASIN=8409178419",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 12, 2020",
                "reviewTitle": "5.0 out of 5 stars Vibrant, detailed fantasy.",
                "reviewText": "It only happens one time a year. The sky turns red and the Fire Kingdom’s priests have their cutting ceremony of infant’s little palms. However, when young Noakhail proves his calling, an evil opponent attempts to kill him. A soldier intercedes, and runs away with Noakhali to a place called Aquadom. Years later, Noakhail’s truthful self is revealed which is enthralled with a strong, fiery nature. There is a lot taking place in this story. The author has a great imagination and has utilized it well in writing such a complex tale. There were numerous twists and turns in the plot which were great surprises. The theme concentrates on four kingdoms, initiated on four foundations: Earth, Water, Fire and Air. Also, there is an interesting concept of the great nations, Fieros, Aquos, Thirhans and Aertians. The Sapphire Eruption: An Epic Adventure (The Sword's Choice Book 1) is unique but at the same time in the category of classic. Not a single character was boring. All played a vital part. The magnificent setting of an innovative fantasy novel was brought vibrantly to life with detail and descriptions, intricately woven into the textile of the realm.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcos Ramos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 4, 2023",
                "reviewTitle": "Wonderful!",
                "reviewText": "I Really Liked the story of Noakh and the crew. Amazing story Where you get involved deep in the adventures. Looking forward to reading the next book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sonia Discher",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 10, 2020",
                "reviewTitle": "Lots of Adventure",
                "reviewText": "The cover drew me in at first and then when I started reading it was easy to keep going. With the red sky calling for the ritual to be held by sword to determine the next ruler of the kingdom and the fight to protect the chosen one gives a great pull to the reader. The story included lots of adventure and was greatly descriptive. I felt like I was in the book. I will be looking for book 2 in this series and will definitely recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sonia K",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 4, 2020",
                "reviewTitle": "A classic fantasy novel with action, adventure and bloodshed!",
                "reviewText": "The Sapphire Eruption is an excellent fantasy novel with many classic elements. It is an exciting escape into a perilous world, populated by four warring lands ruled by ruthless kings and queens, who do not deserve to wield power. Surprising new rulers are anointed in mystical ceremonies in which the powerful and possessed swords chose their heirs to the kingdom. But these choices come at a price, as the swords don’t automatically offer allegiance and control to their owners; who have to earn the right to possess these potent weapons.Noakhail survives the ascendency ceremony by a narrow escape and develops his swordsmanship skills with the help from his adopted father, Lumino. His relationship with the sword is always fraught and double-edged. Vienne is chosen as future Queen of Aquadom. However, she is unsure of herself and sceptical of her powers, leaving others in her kingdom, including her own sister, to take advantage of her weakness and plot against her.These two unlikely heirs to the supreme power of the swords are set on a dangerous collision course in the first book of a very promising series.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "山下",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on June 15, 2020",
                "reviewTitle": "Deeply immersive start of an Amazing Saga!",
                "reviewText": "Deeply immersive start of an Amazing Saga!Such a gripping epic tale, that you can almost hear the rich symphonic theme music play in the background as Noakhail’s dramatic story unfolds. From page one, you are instantly immersed in a very descriptive fantasy world filled with amazing places, dozens of memorable characters, and centuries of detailed history and political intrigue as each faction wrestles for power, from both inside and outside each of the kingdoms. This reminds me so much of Avatar the last airbender with the four kingdoms of Earth, Air, Fire, and Water.No words have been wasted. Every intricate detail holds some significance, all the way down to the tiniest droplet of water, but you’ll want to discover that on your own. Impressive Battles and Tournament scenes incite a rush of emotion as the reader cheers for their favorite heroes, or some rather dastardly villains! It was honestly difficult to set this book down. The action and adventure forces you to keep flipping pages deep into the evening. I literally finished the final page at 2a.m. I can’t wait for the story to continue in volume 2!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Violeta Bagia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 19, 2020",
                "reviewTitle": "Brilliant characters!",
                "reviewText": "Fantastic story and even better characters. I'm transported into a world of magic and intrigue. Wonderful read, highly recommend!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}