{
    "remaining_requests": 152,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/House-Earth-Blood-Crescent-City/dp/B082YHJS14",
    "body": {
        "name": "House of Earth and Blood: Crescent City, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/House-Earth-Blood-Crescent-City/dp/B082YHJS14",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61ulpSkaMmL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sarah J. Maas",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Sarah+J.+Maas&search-alias=audible"
        },
        "brand": "Sarah J. Maas&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 86772,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Number one New York Times best-selling author Sarah J. Maas launches her brand-new CRESCENT CITY series with House of Earth and Blood: the story of half-Fae and half-human Bryce Quinlan as she seeks revenge in a contemporary fantasy world of magic, danger, and searing romance. Bryce Quinlan had the perfect life-working hard all day and partying all night - until a demon murdered her closest friends, leaving her bereft, wounded, and alone. When the accused is behind bars but the crimes start up again, Bryce finds herself at the heart of the investigation. She'll do whatever it takes to avenge their deaths. Hunt Athalar is a notorious Fallen angel, now enslaved to the Archangels he once attempted to overthrow. His brutal skills and incredible strength have been set to one purpose - to assassinate his boss' enemies, no questions asked. But with a demon wreaking havoc in the city, he's offered an irresistible deal: help Bryce find the murderer, and his freedom will be within reach. As Bryce and Hunt dig deep into Crescent City's underbelly, they discover a dark power that threatens everything and everyone they hold dear, and they find, in each other, a blazing passion - one that could set them both free, if they'd only let it. With unforgettable characters, sizzling romance, and pause-resisting suspense, this richly inventive new fantasy series by number one New York Times best-selling author Sarah J. Maas delves into the heartache of loss, the price of freedom - and the power of love. Read more",
        "breadCrumbs": [
            {
                "name": "Audible Books & Originals",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_1?ie=UTF8&node=18145289011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18580606011"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18580607011"
            },
            {
                "name": "Paranormal & Urban",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18580622011"
            },
            {
                "name": "Urban",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=18580625011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "27 hours and 50 minutes"
            },
            {
                "name": "Author",
                "value": "Sarah J. Maas"
            },
            {
                "name": "Narrator",
                "value": "Elizabeth Evans"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 03, 2020"
            },
            {
                "name": "Publisher",
                "value": "Audible Studios"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B082YHJS14"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Urban Fantasy #2 in Fantasy Action & Adventure #3 in Fantasy Romance (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ari",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNFF5VVLACBYEO6A6RQHJPV53WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36KWRNCUQ28HQ?ASIN=B082YHJS14",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 23, 2020",
                "reviewTitle": "5.0 out of 5 stars Stellar",
                "reviewText": "Being the fan of an author's work is both a blessing and a curse. You count down the days until their next—usually hyped up—release is to be published. You talk about it more and more the closer that said release day approaches. You try to enter any possible pre-order special is available, in the hope of getting a lovely exclusive pin, or a poster, or a print.And then the book releases...I don't know about you, but once that book hits shelves, I am violently torn between a crazed eagerness to read it, and a nearly crippling fear that I am going to hate the book no matter how much I have loved this author's stories in the past. Which, let's face it, is one of the worst things to happen in a reader's life.Thank you, Maas, for delivering the goods once again.House of Earth and Blood is not a perfect novel. I'm not even sure that such a thing is possible, to be frank, because our love of books is a very personal thing. But, this novel is a punch to the heart, in the best possible way. I absolutely fell in love with the story, with the characters, with the world that was created. And it is definitely a complex and intricate world of which we get a glimpse, but that is sure to open up to us even more, and I cannot wait to continue exploring it as the series progresses.I'm a huge fan of badass female leads in novels. What can I say, I live vicariously through them. Ironically, I usually don't like so-called “badass” female leads in novels, because most of the time what we're given are annoying females that try too hard. I initially read the sample for HoEaB that NetGalley provided, and I was a bit unsure about Bryce. She came off a tad strong for me, and I was instantly worried that this meant negativity throughout the rest of the novel. Maybe my mindset was not in its proper place then, but I am so glad that I decided to read the full novel from the first chapter again, because my opinion of Bryce completely changed.I love this woman.Despite the fact that we are reading a fantasy, despite the fact that Bryce is half-Fae, she is very human in her actions and emotions. She makes her mistakes, she suffers through them, she learns, she picks herself back up, puts on a new pair of teal-colored panties, and she keeps going. She's believable and realistic in who she is, and it's very easy to become connected to her.This is actually true of the rest of the characters. They don't always connect right away—I was unsure of Hunt at first, of Ruhn, of Jesiba even—but once they do, they stick and you root for these people. You suffer with them, you are excited alongside them, you want them to kick ass and come out winning on the other side.Hunt—or as I like to think of him in my head, Orion...such a gorgeous name—had one of the best evolutions. I can see that Maas wanted to make him this dark, introverted being at the beginning, and I saw hints of it, but I couldn't quite see him that way full-force. I think that's one of the things that made me question him for those first few chapters of his appearance in-story. I see what you want me to see, because you're telling me what to see, but that's not really who he is, and that's coming out more so than the facade he's portraying. Athie is a deep, tortured, sweet and loving male who slowly opens up to the reader, and he swept me right off my feet.That's probably why the sudden twist at the end of the novel's third part was such a slap to the face, and the biggest problem that I had with this book.We're navigating a story that's centered around the death of Bryce's best friend, Danika, and her pack of shape-shifting wolves—one of the most heartbreaking moments of the book, by the way, even if the synopsis warns us about it (the writing in this piece, at the start, was wonderfully done and it tore through me). Eventually, we know that Danika's death, and that of the pack, is surrounded by the use of a drug called synth, which makes people—both human and non—have strength and violence to such a degree that they can tear others apart. And the culmination of that is that Hunt is involved in this so that he, and those with him, can use this drug to help themselves be freed from those who have enslaved them.It did not fit with his character.Hunt, who strives to keep others safe, who works and does the horrible things that his handler, Micah, tells him to do so that he can keeps streets safe? Hunt, who deals in killing demons that come through rifts? Yes, he has been suffering for over two hundred years, and he has been tortured within an inch of his life, and the love of his life was killed in the midst of this. But to make him be a buyer, when he comes to know the consequences of the usage of synth, did not fit in with who he is. As the last part of the novel progressed, things were smoothed out a bit and it sort of fit in. But this nagged at me so much that I was not able to let it go.I did, as a matter of fact, stop reading for the day once I hit this point, and had to force myself to pick up the book again the next day so that I could continue.It doesn't take away from the story, mind you. I said it once, and I say it again, I love this book. I felt every single emotion that was in here, and that's one of the best things that I can ever ask for in a story: make me feel. And you certainly feel. You feel to the point of tears sometimes. Lehabah's end did it for me, that little fire sprite was one of the good ones. Bryce's phone call to Hunt when she's in the middle of taking out demons after the Gates open and knows she might very well die, did it for me again. Danika and Bryce's reunion after Bryce makes her Drop did it for me a third time. And then that bittersweet moment, near the end of the book, when Bryce gets just a glimpse of the pack and Connor waves to her, brought tears to my eyes once again.But I still think that there is, and was, so much to explore. And while we're taken to the brink of those moments that can be darker, like the ones that Hunt described having experienced during his years with Sandriel alongside Pollux, we're not taken there. It's not that I want to see my beloved characters suffer, it's that sometimes that suffering can have room for that much more growth. Sometimes when we bypass that, things appear a little too easy.At the end of the day, though, this was stellar. My worry was for nothing, and I am going to be suffering until the second book is so much as announced. I'm still not over the losses in this first installment, I still remember the epic scene of Bryce against Micah, of Hunt's plummet over that helicopter, of Lehabah's sacrifice. I am so curious to see how the obscure Aidas ties in with this story and what more he has to offer, and I can't even imagine how the Asteri will likely play a part in the future of this world.Bring it on, Crescent City. I'm waiting.",
                "reviewVotes": "39 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TayTay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEEGEOFN4RVLJ6ATFBTMIRRCZSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15UYPF7EOTH8X?ASIN=B082YHJS14",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars HOLD ONTO YOUR HEELS BUT READ THIS!!!",
                "reviewText": "Rating: ⭐️⭐️✨🤣👀😈Narration by: Elizabeth Evans *chefs kiss 😚*; recommend getting the ebook and the audible to go along, so good.TLDR: This is such a different departure from ACOTAR and TOG. Now, if you have not read those first - PLEASE DO! I mean it, like, really, read them first. However, if you are trying to get on the craze that is Crescent City then you can read ACOTAR series first. Bryce is fun to jump into and I want to party with her. If you can annotate parts that make you go 🤔 - it will pay off. I WANT TO HEAR EVERYONE'S UNHINGED THEORIES!!!The rest of this review is meant to be entertaining without trying to spoil anything.Hold on to your heels, because House of Earth and Blood by Sarah J. Maas is a rollercoaster of demon-slaying, angel-enslaving, and heart-throbbing proportions! Buckle up, fantasy addicts, because you're in for a wild ride through Crescent City, where the nights are as dark as the secrets lurking in the shadows.Our protagonist, Bryce Quinlan, was living the dream - working hard, partying harder (amen, girl!) - until a demon decided to crash her perfect life by murdering her closest pals. Talk about a party foul! Now, armed with determination and a penchant for revenge, Bryce becomes the Nancy Drew of the supernatural world. But hold your steeds, because there's a fallen angel in the mix. 👼Hunt Athalar, the notorious Fallen angel with a resume that screams \"bad boy,\" is now on a leash, courtesy of the Archangels he once tried to overthrow. You know, the usual workplace drama. But guess what? Hunt gets a deal he can't refuse - help Bryce catch the murderer, and he might just earn his angelic wings back. It's like a demonic buddy cop movie, and I'm here for it! No really, I want this series turned into a movie along with the rest.As our dynamic duo dives deep into the underbelly of Crescent City, they uncover a power so dark it makes midnight look like noon. Sarah J. Maas weaves a tale of suspense that's tighter than a dragon's grip on its treasure. But amidst the chaos and danger, Bryce and Hunt discover a passion that's hotter than a dragon's breath. Will they let love be their salvation, or will the darkness consume them?The characters are so unforgettable that they'll linger in your mind like the scent of a spellbinding potion. The romance sizzles hotter than a phoenix rising from the ashes, and the suspense will keep you turning pages faster than you can say \"magic spell.\" Enter Ruhn Danaan *cue the song people, iykyk*!!!House of Earth and Blood is a fantasy feast for the senses. Sarah J. Maas has cooked up a concoction of magic, mystery, and mayhem that'll leave you spellbound. If you're a fan of unforgettable characters, sizzling romance, and a plot so twisted it could give a dragon neck cramps, this book is your golden ticket to fantasy bliss. Get ready to be enchanted!Also, get ready to spiral 🌀cause I have been throughout this book and the next. 😵‍💫",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 11, 2024",
                "reviewTitle": "Maravilloso",
                "reviewText": "Es una edición muy hermosa, llegó en excelentes condiciones! Recomendado",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "o0gab0o",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2024",
                "reviewTitle": "I’m speechless",
                "reviewText": "First, I want to disclaim that I Dnf’d that book back when it came out (was it really in 2020?!). I picked it up again last week thinking that I couldn’t very well call myself a true Maas’ fan if I didn’t finish it. And oh wow what I ride. I honestly don’t understand why I didn’t finish it before. The world building was so great. I legit cried at 2 different moments. Could not put it down once I hit the 4th part. Sarah, you’ve done it again! What a masterpiece! Please never stop writing. And now, I’ll go start the second and hope to finish it before CC3 comes out.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angeline O.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on February 13, 2024",
                "reviewTitle": "LIGHT IT UP",
                "reviewText": "Guys, I actually had to take a breather and regroup myself because SJM, you really wrecked me. Like, really, really wrecked me. It has been some time a book had me crying but girl, I wept like a babyyyy.I was kinda late to the CC world but that actually became a good thing because now I do not had to wait YEARS on number three. If you are doubting, dont. Read it. Seriously.I listened to ToG and ACOTAR so I knew that it must be good but I did not expect to be swept of my feet like this. On to number two!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 9, 2024",
                "reviewTitle": "Tolles Buch.",
                "reviewText": "Sehr spannend. Kann man kaum aufhören zu lesen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Liz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 6, 2024",
                "reviewTitle": "Univers et écriture fantastique",
                "reviewText": "Je ne sais pas comment j’ai réussi à plonger dans ce livre après deux ans et demi à errer sur Booksta sans me faire spoiler mais me voici. Je ne savais rien de Crescent City mis à part que c’était de l’urban fantasy. Par contre, je connais Sarah J. Maas et savais à quoi m’attendre en terme d’écriture. Mais encore une fois, elle ne cesse de me surprendre. Son style est magistral, son univers si vaste, ses personnages si complexes, bruts et profonds.J’adore le rythme qu’elle donne à son histoire et je n’ai pas été gênée du tout par la quantité de détails et d’informations.La relation Bryce/Hunt est parfaite bien sûr, mais en dehors de ça, c’est leurs passés, leurs blessures, leurs faiblesses qui les rend si humains et me fait tomber amoureux d’eux.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}