{
    "remaining_requests": 6059,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/WANLIPO-Dashcam-Control-G-Sensor-Recording/dp/B0CC8CHTTJ",
    "body": {
        "name": "4K Dash Cam Front Built-in WiFi, WANLIPO Dash Camera for Cars with 3\" IPS Screen, Car Camera with 64GB SD Card, 2160P Dashcam for Cars with App Control, G-Sensor, Loop Recording,24H Parking Monitor",
        "price": "$59.99",
        "originalPrice": "$69.99",
        "rawPrice": 59.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/WANLIPO-Dashcam-Control-G-Sensor-Recording/dp/B0CC8CHTTJ",
        "soldBy": {
            "sellerID": "A976JEXJHD7N5",
            "name": "WANLIPO-US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A976JEXJHD7N5&asin=B0CC8CHTTJ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CQDGJS74"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "Save 10%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41lMvmlWzkL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41QHphICj7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-eUOWJDCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vdS2nX5jL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xgP8DzyfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Kyq1zjgML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1zY2GaaWIL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6a8fb5ee-e054-4d1e-867d-f7a3513c0e95/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the WANLIPO Store",
            "link": "https://www.amazon.com/stores/WANLIPO/page/6EAA0EDE-6381-427A-B6E2-927A7326314F?ref_=ast_bln"
        },
        "brand": "WANLIPO",
        "merchantInfo": "WANLIPO-US",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 138,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 1 hr 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【4K ULTRA HD FRONT DASH CAM】 Wanlipo 4K dash cam adopts advanced features of ultra-high definition up to 3840*2160P@30fps, F1.6 aperture and 6 glass lenses, which can balance the colour and brightness of the picture to record capture clearly more details and ultra-high -definition video on the driving. This new upgraded version of the wifi dash camera has more premium features, providing important evidence for car accidents, ensuring your driving safety and keeping you away from dispute.",
            "【BUILT-IN WIFI & APP SUPPORT】This 4K dashcam with WiFi comes with a free APP for Android or iOS devices, which can live preview, download videos and manage or change the wifi dashcam’s settings. By using the VIIDURE APP of this 4K car camera, the recorded videos can be easily shared on Facebook, YouTube, and Twitter, you can share any moments of your journey with family or friends. Tips: When the car is turned off, the 4K dashcam for cars will be turned off and the wifi will be disconnect.",
            "【G-SENSOR & LOOP RECORDING】The 4K dash camera can automatically monitor the driving environment by the built-in G-sensor. When the car collision attains the sensitivity of triggering it, the front car dash cam will lock and save the current video to prevent being deleted or overwritten. The wifi camera for car has the loop recording to seamlessly record 1/3/5 minutes of video clips, when the memory card is full, it will overwrite the oldest unlocked video to continue recording.",
            "【PARKING MONITOR & 150°WIDE-ANGLE】This 4K dashcam for cars can monitor the parking environment. When the battery is fully charged and the parking monitor is turned on, the wifi car cam will automatically turn on to record and save the car collision while parking. It doesn’t require additional hardware and supports 24-hour safe parking monitoring. The front dashboard camera is equipped with a 150°wide-angle, which can eliminate blind spots and provide sufficient evidence for accidents.",
            "【SATISFACTORY CUSTOMER SERVICE 】WANLIPO is committed to providing excellent 4K dash cams for cars and satisfactory after-sales service to our customers. This wifi car on-dash mounted cameras is provided with 7*24 hours of technical support, a 1-year warranty and a 30-day full refund. If you have any questions or suggestions about the WANLIPO front car dash camera , please feel free to contact us, we will be willing to solve any questions for you at any time.",
            "【PRE-PURCHASE INSTRUCTIONS & TIPS】This 4K car camera dash cam only comes with a front car dashcam and accessories without a rear or inside car dashcam. This wifi vehicle dash camera can only be connected through WiFi (No Bluetooth). Tips: Please connect the car charger and car ignition to use the 4K driving recorder . You can connect to the App through WiFi to playback videos, you can also playback videos directly on this front car dashcam or connect to a PC through a memory card reader."
        ],
        "description": "WANLIPO DASH CAMERA FOR CAR WITH WIFI WANLIPO is committed to providing you with the car dashcam with 4K ultra-high-definition video and WiFi app control, so that every car has a high-quality dash cam. The built-in battery is only used for emergency file record, it does not have enough power to support the dash cam wifi for a long time, and car charger is required for normal use. The dash camera must use a genuine memory card. Otherwise, this dash cam will not record. Max Support 128 GB memory card (memory card is included in the package) If the 4K car dashcam is not working properly, please default the system settings or format. If the video recorded by the 4K dash camera with wifi cannot be viewed normally on the PC, it is recommended to use Potplayer or download a universal player to solve the problem. Note: This front dashcam with WiFi is No GPS, No Bluetooth, No Rear Camera, No Inside Camera, No Need Hardware Kit!",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Car & Vehicle Electronics",
                "link": "https://www.amazon.com/Vehicle-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3248684011"
            },
            {
                "name": "Car Electronics",
                "link": "https://www.amazon.com/Car-Electronics/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1077068"
            },
            {
                "name": "Car Video",
                "link": "https://www.amazon.com/Car-Video-Audio-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10980521"
            },
            {
                "name": "On-Dash Cameras",
                "link": "https://www.amazon.com/Car-On-Dash-Mounted-Video/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3248689011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2.99 x 1.81 x 1.6 inches"
            },
            {
                "name": "Item Weight",
                "value": "10.5 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CC8CHTTJ"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 138 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#42,217 in Electronics (See Top 100 in Electronics) #371 in Car On-Dash Mounted Cameras"
            },
            {
                "name": "Connectivity technologies",
                "value": "Wireless"
            },
            {
                "name": "Special features",
                "value": "WiFi"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Black-Wanlipo M03-3"
            },
            {
                "name": "Whats in the box",
                "value": "Cassette"
            },
            {
                "name": "Manufacturer",
                "value": "WANLIPO"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "September 7, 2023"
            },
            {
                "name": "Brand",
                "value": "WANLIPO"
            },
            {
                "name": "Orientation",
                "value": "Front"
            },
            {
                "name": "Vehicle Service Type",
                "value": "Car"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Special Feature",
                "value": "WiFi"
            },
            {
                "name": "Video Capture Resolution",
                "value": "4K"
            },
            {
                "name": "Included Components",
                "value": "Cassette"
            },
            {
                "name": "Mounting Type",
                "value": "Ceiling"
            },
            {
                "name": "Field Of View",
                "value": "0.1 Adult US"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "FQA FOR WANLIPO DASH CAM WITH WIFI Q: Do I need to download a dedicated app? If needed, how can I download the app? A: At present, this 4K dashboard camera can be connected to WIFI to operate in the app, or not connected to wifi, and you can playback the recorded video on the wifi dashboard camera under the condition of ensuring that the wireless dashboard camera is recording (the blue indicator flashes once per second to indicate that it is recording). But if you don't like connecting to wifi and managing front dashboard camera through the app, we sincerely suggest that you do not turn on wifi, and suggest that you playback on the dashcam if you need to. If you want to manage wireless dash cam through an app, please download the Viidure app. Here are the methods to download the app: Method 1: Search and download viidure in the App Store or Google play. Method 2: Scan the QR code of the menu in the dashcam to download the viidure App. Method 3: Scan the QR code of the user manual to download the viidure App. Q: Do I have to connect to the Viidure App via wifi using this wireless dash camera for cars? Is it possible to connect via bluetooth? A: Yes, this 4K car dash camera 2160P only connects to the Viidure App through WiFi, please note that there is absolutely no Bluetooth connection. Please refer to the following steps to connect WiFi: Firstly, turn on the 4K dashcam, press the “OK” to stop recording, and long press the \"Up\" until the WiFi icon appears on the wifi car dash camera screen. Secondly, the WiFi account and password will be displayed in the lower left corner of the screen. Thirdly, turn on the mobile phone WiFi, find the WiFi account corresponding to the 4K vehicle dash camera, and enter the initial password 12345678. Fourthly, when the mobile phone is connected to the WiFi, if the WiFi logo of the wifi car camera dash cam is green, the connection to WiFi is successful. Finally, open the viidure app and click the \"Access Camera\" to synchronize the video of the 4K car dashcam.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0fcdfed2-1c97-4f0c-b2ee-09e9b96959c5.__CR0,0,1940,1200_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "FQA FOR WANLIPO DASH CAM WITH WIFI Q: How to playback the video of 4K dash cam？ A: Method 1: When the wifi dash cam stops recording (press the OK key to stop recording), press the \"M\" to select the video file and press the OK key to playback the video. Method 2: After the mobile phone is connected to the wifi of the front dash cam, view the real-time recorded video on the app. Method 3: Put the dash cam's memory card into the memory card reader, and then connect the card reader to a personal computer to view the video. Q: Why does this 4K dashcam suddenly turn on when the car engine is turned off and the doors are opened/closed? A: This is because you have activated the parking mode. When the car is turned off and in the parking state, the vibration of opening/closing the car door is recognized as a car collision. This will turn on and record emergency videos before turning off. If you really don't like this, we suggest that you turn off the parking mode. However, please note that if parking mode is turned off, once your car is hit during parking, it will not start up to retain important evidence. Q: Why do I have to reconnect to WiFi every time I open this WiFi dashcam? Is there any way to solve this problem? A: Because for Android phones, constantly connecting to WiFi may prevent you from using cellular data to access the internet and receive messages, the default setting is to open this 4K dash camera every time. If you need to connect to WiFi, you need to reconnect. In fact, you don't need to connect to WiFi all the time because playing the video can also be on the front dashcam under the condition of ensuring that the 4K dash camera for cars is recording. The blue indicator flashes once per second to indicate recording. If you don't want to reconnect to WiFi every time you turn on the front dash camera for cars, please support us to obtain a special software upgrade file to solve it. Q:Does this 4K car camera require the purchase of additional hardware? A: No, absolutely not. This wifi car camera does not require the purchase of additional hardware kits to support parking mode. In fact, this front car camera comes with parking mode (default off). If you want to turn on parking mode, you need to click the menu when the 4K dashcam for cars is stopped recording and go to the settings to find [Parking Mode] to turn it on. Some friends may have been prompted by the app's settings to purchase additional hardware for parking mode, but in reality, it is not necessary. We will fix this error in the app in the near future.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1dab0356-c56f-49bd-948b-011555333c41.__CR0,0,1940,1200_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "FREQUENT QUESTIONS AND ANSWERS Q: Does it have built-in GPS? A: At present, this wifi dashcam for cars does not have GPS. Please carefully read the product description on Amazon's website when purchasing. Q: Is the car ignition powered? A: Yes, the build in low battery of the front dashcam for cars is only used for emergency video recording, there is not enough power to record the car charger worn in the packaging must be used to connect the interface to the car designation for normal recording. Q: Do I have to connect to WiFi to use and operate this 4K dash camera? A:No, absolutely not, this wifi dash camera can connect to the app via wifi to play back videos and manage settings. When the front dash camera is in normal recording state, the blue indicator flashes once per second to indicate that it is recording. You can play back the video directly on the 4K car dash cam, or insert the memory card of the wifi car dash cam into the card reader and then connect it to a PC to play back the video. Q: Does the package include only the 4K camera for car? Does the wifi camera for car with wifi have an inside camera and a rear camera? A:Yes, currently this 4K dashcam for cars only comes with a front dashcam for cars. Please be particularly careful not to include the inside camera and rear camera. Please carefully read the packaging description of this 4K car on-dash mounted cameras on Amazon's website when purchasing. Q: Why is the suction cup mount not sticky? How can I install and fix it to the windshield? A: This suction cup mount itself is not sticky and is mainly stuck to the windshield by turning the [twist knob] of the suction cup mount to \"lock\". If you still do not understand how to install the suction cup mount, please refer to the manual . Q: If the car is turned off, will this 4K car cam still work? A: Due to the connection between the wifi car cam and the car ignition device through a car charger, once the car is turned off, the front car cam will also immediately shut down and cannot continue to work.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/579b925c-b80b-45a3-8369-ded0703453c0.__CR0,0,1940,1200_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "If you are looking for a high-resolution 4K camera car, M03 dash camera will be your best choice. Make sure you have a secure driving experience 24 hours a day. What‘s in the box? 1xM03 Front Dash Camera（No Rear and Inside Camera） 1xCar Charger 1xSuction Cup Mount 1x64GB Memory Card (in the dashcam) 1xType-C Data Cable 1xUser Manual 1xCrowbar/4*xCable Clamp WANLIPO DASH CAMERA FOR CAR WITH WIFI WANLIPO is committed to providing you with the car dashcam with 4K ultra-high-definition video and WiFi app control, so that every car has a high-quality dash cam. The built-in battery is only used for emergency file record, it does not have enough power to support the dash cam wifi for a long time, and car charger is required for normal use. The dash camera must use a genuine memory card. Otherwise, this dash cam will not record. Max Support 128 GB memory card (memory card is included in the package) If the 4K car dashcam is not working properly, please default the system settings or format. If the video recorded by the 4K dash camera with wifi cannot be viewed normally on the PC, it is recommended to use Potplayer or download a universal player to solve the problem. Note: This front dashcam with WiFi is No GPS, No Bluetooth, No Rear Camera, No Inside Camera, No Need Hardware Kit!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d139fec-18a0-4013-8539-2b629067525d.__CR0,0,960,1280_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/523577ab-dce8-435c-903d-b6cffb9af41d.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "SEAMLESS LOOP RECORDING When using the 4K dash camera for vehicles, it is recommended to turn on the loop recording function, then the continuous recording will use 1/3/5 minutes of video clips to save in the memory card, reducing the trouble of manually formatting the memory card. EMERGENCY LOCK G-SENSOR When using the wifi dash camera for vehicles, it is recommended to turn on the gravity sensing function and select the medium sensitivity. When encountering a collision, the wifi car camera can record and lock the current video urgently to avoid being covered by loop recording. 24 HOURS PARKING MONITOR When parking, it is recommended to turn on the parking monitor. When the car camera - dash cam front detects that the car is collided, it will be turn on to record and lock the current video to keep important evidence. Supports 24-hour parking safety.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d15574d8-9148-4ff6-b0c6-656a106f3639.__CR0,0,1024,1024_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36e6492c-d3ab-4d65-a9ff-5cd428318664.__CR0,0,1024,1024_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9621c5f-bb59-4ac1-b072-5615926aeb12.__CR0,0,1024,1024_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "CONNECT CAR CHARGER TO POWER This front dash camera for vehicles is currently only available in cars with a car ignition. The car charger must be connected to the dash camera for cars and the car ignition for charging to work and record. The built-in low battery is only for emergency recording, please connect the car charger for continuous recording. EASY INSTALLATION & USE This front car dashcam with wifi is very easy to install, just fasten the driving recorder front with the suction cup and install it on the windshield, then plug the side of the car charger into the car video‘s port. The rest are hidden in gaps in the interior panels of the car. Then insert the other side into the car ignition port and activate the car's start button. SCREEN SAVER & SAFE DRIVING When you set the screen saver, the screen of the front car on-dash mounted cameras will go black after the set time, saving power and allowing you to concentrate on driving to ensure driving safety. Always on screen the blue indicator flashes once per second to indicate that the wifi driving recorder’s recording is in progress.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/31f8e1df-3b3f-488c-8d50-222d819067fa.__CR0,0,1024,1024_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a1f11044-7e34-4bea-b751-43c30d05a50b.__CR0,0,1024,1024_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6340d4f8-b3d2-40f1-b1a8-edf328c52dab.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0fcdfed2-1c97-4f0c-b2ee-09e9b96959c5.__CR0,0,1940,1200_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1dab0356-c56f-49bd-948b-011555333c41.__CR0,0,1940,1200_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/579b925c-b80b-45a3-8369-ded0703453c0.__CR0,0,1940,1200_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d139fec-18a0-4013-8539-2b629067525d.__CR0,0,960,1280_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/523577ab-dce8-435c-903d-b6cffb9af41d.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d15574d8-9148-4ff6-b0c6-656a106f3639.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36e6492c-d3ab-4d65-a9ff-5cd428318664.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9621c5f-bb59-4ac1-b072-5615926aeb12.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/31f8e1df-3b3f-488c-8d50-222d819067fa.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a1f11044-7e34-4bea-b751-43c30d05a50b.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6340d4f8-b3d2-40f1-b1a8-edf328c52dab.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2cf11da1-8ff8-4b00-ba6e-a86edace325c.__CR0,0,1940,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Robert A Lawrence",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLIL5I34QWRJP3GA3BKUUR2KADA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKI9C91JWICLQ?ASIN=B0CC8CHTTJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Works well and installs easy",
                "reviewText": "This is a great cam and it has a great interface. I used an add a fuse kit to wire it in as I wanted to hide the wires as much as possible.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CHIMAN",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGCIBLIIVHPMSRZNJ5DCUEPZL6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R94STF8CEWJH8?ASIN=B0CC8CHTTJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Dash cam works well",
                "reviewText": "Easy to set up and use",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa RhodenLisa Rhoden",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXWB674UROOVHPSNRZUAWPRLYCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8SGXMDGPV3OM?ASIN=B0CC8CHTTJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic little camera",
                "reviewText": "This dash camera really surprised me with how nice it is. It was really easy to install and hide the wire. It came with plenty of cable length. It has 24 hours recording capabilities. The camera itself is very sensitive. That's my only issue, as it seems to record when someone slams the car door too hard or even the lift gate. But honestly, the more I think about it, that should be a good thing. I want a camera that's going to pick up someone messing with my car. The app is fairly easy to use as well. The camera even included a micro SD card so store any accidents that may happen. The picture and video is pretty decent. Better than expected. Currently, the price for this unit is $59 and some change, but at the time of this review there is a 50% off coupon and I don't think you can beat 30 bucks for a nice dash camera. It's a fantastic buy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61RZs0epWsL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61f2Vxq9ZUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714mHaJ+BJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71l5h2VoGkL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erekle Chigogidze",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLZCPLPLDZADFTRUG35Z4XJXDWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M0GLZ5QTMQEJ?ASIN=B0CC8CHTTJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars great!",
                "reviewText": "Easy to install and use, works perfectly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Eric Morris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHBS62BNWGQGWOK7422F3UUCJZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUD2S220Y0M3E?ASIN=B0CC8CHTTJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Get past the user manual and simple controls and enjoy great video at 4K",
                "reviewText": "I wasn't expecting a lot when I ordered this DashCam. I have a Rove 4K for my primary vehicle, but didn't want to spend as much for my classic car which gets driven very little. But, having had it damaged in a collision recently, I wanted a 4K recording capability. The WANLIPO caught my attention because of its 4K capabilities and its price; PLUS it included a 64gig memory ship (Rove doesn't). The dashcam itself doesn't have the same quality look & feel as the Rove, and the image produced doesn't include much of the Rove's meta data (GPS location, Speed, etc). However, once I made it thru the somewhat difficult-to-read Chinlish instruction manual and tried it out, I found it was great for what I intended. And the video image quality was as good as, or better than that of the Rove.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Camping Hiker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZEQOG3N4NMADN6ZPKXYGDWKKQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP8K7VQ92LYO3?ASIN=B0CC8CHTTJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Work good",
                "reviewText": "Worked excellent. Had a little issue, but the show was in contact and fix the issue. Thank you so much we definitely do business with you again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maika",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPFTORV3WBXC2WXULBUBKILJINQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXR3DPMTKBZRD?ASIN=B0CC8CHTTJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice camera",
                "reviewText": "Very nice camera",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aaron Clark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLLUWWBKTVHEWJ5VCHL7WZX44XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VKV4N5A96DLE?ASIN=B0CC8CHTTJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "4.0 out of 5 stars Good sense of security",
                "reviewText": "Great product but I wish it wouldn't auto record every time I start the truck.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}