{
    "remaining_requests": 5899,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/OldShark-Recorder-Dashboard-G-Sensor-Recording/dp/B01DLWBPCA",
    "body": {
        "name": "Dash Cam 1080P Full HD 3 Inch Dashboard Camera Car Recorder with 32GB Card 170°Wide Angle Dashcam Driving Loop Recording G-Sensor",
        "price": "$49.99",
        "originalPrice": "",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/OldShark-Recorder-Dashboard-G-Sensor-Recording/dp/B01DLWBPCA",
        "soldBy": {
            "sellerID": "A3KFZFZ4I69DS1",
            "name": "OldShark",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3KFZFZ4I69DS1&asin=B01DLWBPCA&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51qGcDclvZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51sFM bFKAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FG6d5eaRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51d44EN2mCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AsD9t8pzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dySxB g0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51l97cefnRL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/692e8098-1e84-44b8-b77c-2c1a2bbd6f01/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the OldShark Store",
            "link": "https://www.amazon.com/stores/Old+Shark/page/D2604168-362E-4139-9B78-2708291C6CE6?ref_=ast_bln"
        },
        "brand": "Old Shark",
        "merchantInfo": "OldShark",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 2921,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 9 mins",
            "FREE pickup Wednesday, February 21",
            "Or fastest pickup Sunday, February 18. Order within 9 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Ultra HD Dash Cam for Cars】With super HD video resolution 1080P and superior fluently recording. Old Shark Dash Cam 1080p deliver clear images videos even at high speed or in darkness, it will be safe and reliable with OldShark dashcam.",
            "【170° Super Wide Angle】Adopt Sony Sensor and F1.6 Big Aperture wide angle lens, real 170 degree wide field of view, the dash cams for vehicles reduces the blind spots, captures more details and reserve the real scene.",
            "【Lock Accident】Built in G-sensor, dashboard cameras can automatically detects a sudden shake/collision of car, save and lock the accident footage, which provides proof in case of an accident claim.",
            "【Your Best Driving Companion】Seamless Loop Recording, Impact Detection, Protection for Important Files, Parking Guard, Motion Detection, Auto On/Off, Time Stamp, Screensaver,the camera dash recorder satisfy your need for daily driving.",
            "【Easy to Install and USE】OldShark Dashcam comes with 32GB Memory card car cigarette charger - Plug and Play, simply mount this dash cam to windshield, connect the power cable, no need to worry even for a first time user."
        ],
        "description": "OldShark is a brand professional in car video product, with 17 years' Experience, we dedicated to creating car Camera that improve the safety, and reliable of every driving. It provides OEM and ODM services for numerous famous brands around the world. Little money saves you big trouble OldShark GS505 dash cam equipped with Novatec best 96650 chipset, and with retardant metal material and shock absorption design, it has better quality compare these equal price dash cam in market.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Car & Vehicle Electronics",
                "link": "https://www.amazon.com/Vehicle-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3248684011"
            },
            {
                "name": "Car Electronics",
                "link": "https://www.amazon.com/Car-Electronics/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1077068"
            },
            {
                "name": "Car Video",
                "link": "https://www.amazon.com/Car-Video-Audio-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10980521"
            },
            {
                "name": "On-Dash Cameras",
                "link": "https://www.amazon.com/Car-On-Dash-Mounted-Video/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3248689011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.46 x 1 x 0.59 inches"
            },
            {
                "name": "Item Weight",
                "value": "4.4 ounces"
            },
            {
                "name": "ASIN",
                "value": "B01DLWBPCA"
            },
            {
                "name": "Item model number",
                "value": "A1OS-GS505-T032"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 2,921 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#27,933 in Electronics (See Top 100 in Electronics) #270 in Car On-Dash Mounted Cameras"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Connectivity technologies",
                "value": "USB"
            },
            {
                "name": "Special features",
                "value": "1080P"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Whats in the box",
                "value": "dash cam, car charger, suction mount, manual"
            },
            {
                "name": "Manufacturer",
                "value": "OldShark"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "March 30, 2016"
            },
            {
                "name": "Brand",
                "value": "Old Shark"
            },
            {
                "name": "Model Name",
                "value": "GS505"
            },
            {
                "name": "Orientation",
                "value": "Front and Rear"
            },
            {
                "name": "Vehicle Service Type",
                "value": "Car"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Special Feature",
                "value": "1080P"
            },
            {
                "name": "Video Capture Resolution",
                "value": "1080p"
            },
            {
                "name": "Included Components",
                "value": "dash cam, car charger, suction mount, manual"
            },
            {
                "name": "Mounting Type",
                "value": "Suction Mount"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "R.C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3W25ELL35NEJ2GZZ57MEL2SQIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23S3GPYHM3LIH?ASIN=B01DLWBPCA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2016",
                "reviewTitle": "5.0 out of 5 stars Works great! (professional driver) Please read review for info.",
                "reviewText": "****UPDATE 3**** I have been running this unit constantly for the last 9 months. It has given me 0 problems. I have also used it on several offroading trips in my Jeep. The only issues I have had on the wheeling trips were: 1, a dirty windshield (inside). (Not the camera's fault) 2, The Jeeps alternator did something funny, the voltage spiked up for half a minute or so. It scrambled the dates on the camera, (weird) but it still kept recording.All in all, a solid camera, I like it!***UPDATE 2*** I gave it the 5th star today. I have been running the camera for over 2 months now and it works like a champ. My only comment is this, if you are driving a truck (i.e. BIG RIG) turn the crash sensor or whatever it is called OFF. Even with it adjusted to max, it saved too many files, thinking they were wrecks. I do alot of urban driving, and am on 7 axles at 105,500, so it MAY not be as bad if you are a strict long hauler and/or running a standard 5 axle rig that is all on air...maybe. I would just kill it and be done with it.The wreck save files eventually filled up the card and the camera would not work...it got, like hung up and couldn't figure out what to do. I had to make sure the battery was charged, unplug it from the power cord and reformat the card using the built in software. Not hard, but took some thinking about it to figure out. Don't know why it being plugged in was keeping me from getting into the menu, but it was. Just an FYI, if it happens to you. That is the only issue I have had since I bought it.**UPDATE** I have had it for over a month now, and it has worked great every time. I run a tanker, so my camera is on 12+ hours a day, 5 days a week, and the only \"issue\" I have had with it was the power cord popping out of the lighter socket on a bad bump. (Not it's fault, just saying it is that solid and reliable.)1 of the other reviewers made a comment about the blue LED light. It is horribly bright and distracting in the dark. I covered mine with a tiny piece of electrical tape. Problem solved.**ORIGINAL REVIEW** I have only had the camera 1 week. I am holding back 1 star until I know the unit is going to last. I will update this after a couple months, and if it keeps working like it has been, I will add the 5th star!If you are a truck driver, you need to set the crash detection setting to HIGH. The default is Medium, and an unseen pothole will lock it into accident mode. To get it to resume, just hit the ok button and it starts recording in standard mode again. I am posting this first, because, as a driver, this is the kind of thing I want to know when reading reviews.The camera is SOLID. It feels like an aluminum body, instead of a plastic body, so I liked that right out of the box.Setup was easy.Video quality is really good. It works well from false dawn until the sun is completely down. In full dark, it works less well. You can still make out some details, but it is not as sharp. (Obviously!)It does not get hot. This suprised me since the last 3 units I have used have all gotten at least warm, and 1 of them was hot as a pistol after a couple hours.If you have a truck that the cigarette lighter shuts off with the key, the camera will shut off when the power goes away, and will start back up automatically when the truck is started again. In my Pete, I unplug it at the end of the day, but you could let it run.Overall, I really like the unit. My only complaint, and it is a small one, is I wish they had made a way to attach the mount to the bottom, so I could mount it at the bottom of the windshield instead of the top. It has a better view from the top, but if I could put it down low, it would be out of my line of sight.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KellyKelly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4SBEJSCJAWM7CRKJDBQF3O7RGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z6FZLWN3V7J8?ASIN=B01DLWBPCA",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2016",
                "reviewTitle": "4.0 out of 5 stars Caught a near miss accident on my first use!! See video. Bought for driving late at night and in snowy winter conditions.",
                "reviewText": "The media could not be loaded. It's almost winter here at the base of the mountains in Salt Lake City Utah and winters here can be treacherous and crazy for driving in icy/snowy/windy conditions. People slide around all over the place on black ice. My husband and I leased a brand new Mazda CX-5 this year. It's a beautiful car and I want to take good car of it. I bought this camera with the main purpose of using it when driving in bad weather or when I'm driving alone late at night. So far I'm very pleased with how well it works!First, it's very small, but don't let the size fool you, it definitely has a wide view of everything out of your front windshield! Small is better for a camera like this because it won't obstruct your view. I played around with where to put it and ended up mounting it somewhat behind/under and to the right of my rear view mirror. It was SUPER easy to mount and I was very impressed with the suction cup! I have had bad experiences with suction cups before (think shower caddy) but this one is super! And it's really easy to move around if you don't like where it is. There is no limit to where you could stick it and point it to get the view you want. Just play around and find what you like best.Some reviewers seem to be confused about the battery in this camera. It is NOT meant to power the device while you're driving!! The battery is for catching those loops after you shut your car off and walk through the parking lot. I really love this feature btw. It makes me feel so much safer walking through dark parking lots at night! That means you have to have this plugged in to your cigarette lighter AT ALL TIMES. This is one of the reasons I took off 1 star. While the cable is PLENTY long, it's a pain to situate it such that is isn't in your way. In the manual it shows a diagram of how you should run the cable so that it doesn't hang down or get in your way, but it does not include anything to secure it to the car to enable such a configuration. I'm not about to tape cable to my leather interior all the way from the rear view mirror to the inside of the center console where my cigarette lighter is so for my test runs out of the box, I just let it hang down (see my pictures). Since I bought it mostly to use at night or on bad weather days, I plan to keep it in my console and use it when I need it, then put it back. For those who plan to keep it running all the time, you may need to find a better, more permanent solution for the cable situation.The other reason I took of a star is because of the instructions. They're not great. I was sent an email with a link (supposed to be a PDF with better, more up to date instructions) but when I click on the link I'm taken to a website for AVA cables. Dash cams aren't even listed as a product sold on the website and there are no PDFs in sight. Fortunately, anyone who can operate a smart phone or a digital point and shoot camera can figure out how to use it, which is what I did.As for the actual functionality and picture/sound quality, this thing is great, especially for the price! The picture is very clear! I had absolutely no problems right out of the box. I stuck it on, plugged it in, turned on the car and the camera knew just what to do! The video is smooth and clear. The files are very easy to drag and drop and play on my computer (running Windows 10). On my very first test run with it out of the box, I nearly got in and accident when the car in the next lane decided to change lanes right into me. Didn't signal or anything! I honked and he quickly moved out of the way but it was close! Had he hit me, this footage would've been INVALUABLE when dealing with insurance claims or police reports etc. The reason you don't hear sound on the video (in reality it's quite clear) is because when he started to move over into me and I honked, I issued a few choice words that I don't think are appropriate for a product review. :) Sorry! But this is the real deal! One day out with this baby and it almost caught an accident! (NOTE: The date and time are not correct because I hadn't set them yet - again, straight out of the box test). Also, sorry if the video is grainy, looks like I need to learn how to format videos for Amazon upload. The video on my computer is crystal clear!You may notice that I was driving directly into the sun at this time of day and there is some glare. Part of that is just the nature of shooting video into the sun, but the other is I had forgotten to peel the protective film off the lens. Whoops! Like I said, this was RIGHT out of the box!All in all I'm really pleased with this camera and think I'll have a lot more peace of mind driving around with it. The night, photo and zoom functions all work great! If you run into problems with set up, this company's customer service is good. I emailed them and they responded quickly. As long as you have appropriate expectations for what this is and what it isn't, I think you'll be happy with this camera!",
                "reviewVotes": "210 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61Ku8l7lqRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61T3dOEi4nL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61goZetRsHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/716FUUpLLfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71EiAgTGITL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71GlhCPlPUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71NFpTksp4L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71SV7LfiMAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71T+0EShPnL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71Xs4uzwQyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71iX63hvwuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71nukTAWTaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71tN343s3iL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71xvmsDJF2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71yA-YYAHQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/819TjRsu-nL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ea1b366-7e75-4d47-a7cb-05d120a2f61a/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Sneds",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 14, 2021",
                "reviewTitle": "Perfect all rounder",
                "reviewText": "This is a great little camera for the money. Easy set up / use, intuitive. This is the second one I've bought ( for second vehicle). Recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rudsyn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 12, 2020",
                "reviewTitle": "Must get",
                "reviewText": "For this price It’s a great little device it’s has an awesome wide angle lens, HD capabilities and ease of use functions.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David J Rye",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 7, 2021",
                "reviewTitle": "Works well day or night",
                "reviewText": "Compact, great picture quality day or nightwell worth the money",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cobra",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 13, 2018",
                "reviewTitle": "I found the item to be good value for the price and performing well so far ...",
                "reviewText": "I found the item to be good value for the price and performing well so far (2 months),good service with quick delivery time .The other good point is that the company offers back up service and help if required ,which was one of the reasons i purchased it .",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": " Manoj ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 29, 2018",
                "reviewTitle": "A QUALITY CAMERA",
                "reviewText": "I RECOMMEND THIS CAMERA. HIGH QUALITY PICTURES . EASY TO VIEW AND SIMPLE TO UNDERSTAND.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}