{
    "remaining_requests": 6030,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dashcam-Control-G-Sensor-Recording-Parking/dp/B0CP5QBZYW",
    "body": {
        "name": "4K Dual Dash Cam Front and Rear,4K Single Front Car Camera with WiFi,2K+1080P Dash Camera with 3 inch Screen, Dashcam with App Control,G-Sensor,Loop Recording,Parking Monitor,32GB Memory Card",
        "price": "$49.99",
        "originalPrice": "",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dashcam-Control-G-Sensor-Recording-Parking/dp/B0CP5QBZYW",
        "soldBy": {
            "sellerID": "A976JEXJHD7N5",
            "name": "WANLIPO-US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A976JEXJHD7N5&asin=B0CP5QBZYW&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CSJ5VQTB"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "Save 10%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41WEZHJxzfL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41C2sVNBnZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41KA7Scsp1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41TvV96 IQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41M0u7hUenL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41d-yUTAc7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1zY2GaaWIL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6a8fb5ee-e054-4d1e-867d-f7a3513c0e95/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the WANLIPO Store",
            "link": "https://www.amazon.com/stores/WANLIPO/page/6EAA0EDE-6381-427A-B6E2-927A7326314F?ref_=ast_bln"
        },
        "brand": "WANLIPO",
        "merchantInfo": "WANLIPO-US",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 15,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 1 hr 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【4K UHD SINGLE FRONT DASH CAMERA 】 Wanlipo M03X dash cam adopts up to ultra HD 4K resolution when the rear camera is not connected. The dashcam records crystal clear video at 3840*2160P/30fps, clearly capturing more details, providing sufficient evidence for accidents. Note: 4K resolution can only be achieved in a single front mode, and the maximum height of dual recording is only 2K +1080P.",
            "【2K + 1080P DUAL RECORDING DASHCAM】This dashcam features front and rear cameras that capture clear video in both 2K(front) and 1080P(rear). The dual car camera is equipped with F1.6 aperture and 6 glass lenses150°wide-angle lens, which can effectively eliminate blind spots and capture more driving details, helping to provide critical evidence in the car accident, keeping you away from disputes.",
            "【WiFi SUPPORT& APP CONTROL CAR CAM】This 4K dash camera front and rear built in WiFi is equipped with an exclusive App “VIIDURE” compatible for Android or iOS smartphones. Easily access to live preview, download videos and manage camera settings，and share your wonderful footage to social media, such as YouTube, Twitter, Facebook, and share the wonderful moments of the journey with family and friends.",
            "【LOOP RECORDING & G_SENSOR LOCK】The dual dashcam for cars can automatically detects a sudden collision with G-sensor when the collision reaches the sensitivity, the dual camera for car will lock the current video and save it from being overwritten and protecting your video evidence. The dual car cam’s seamless loop recording will continuously record 1/2/3 minutes of video clips, when the memory card is full, it will overwrite the unlocked old footage with new content video to keep recording.",
            "【24 HOURS PARKING MONITOR CAR CAMERA】 This dual dash cam front and rear automatically switches to parking mode when parking to monitor the surrounding environment. If you have turned on the parking mode, when the built-in battery is sufficient, the 4k dash cam will automatically record and save when a collision occurs while parking. Support 24-hour monitoring to provide you safe parking protection.",
            "【EASY INSTALLATION & USE FOR CARS】 This front dash cam is easy to install by attaching to the windshield with the suction cup mount. This rear dash camera connects the car's reversing lamp positive lead and then install it to the car rear. Insert the memory card, connect the car charger, when the dashboard camera is powered on, you can directly operate the camera for car. If you don't know how to install it, please refer to the user manual or contact us.",
            "【SATISFACTORY AFTER-SALE & WARRANTY】Wanlipo is committed to providing excellent car dashcam and satisfactory after-sales service to our customers.This dash camera for cars is provided with 7*24 hours of technical support, 1-year warranty and 30-day full refund. If you have any questions or suggestion about the car recorder camera, please feel free to contact us, we will be willing to solve any questions for you at any time.",
            "【PRE-PURCHASE TIPS & INSTRUCTIONS】This 4K car camera dash cam only be connected through WiFi (No Bluetooth). Tips: Please connect the car charger and car ignition to use the 4K driving recorder. You can connect to the App through WiFi to playback videos, you can also playback videos directly on this front and rear car dashcam or connect to a PC through a memory card reader."
        ],
        "description": "WANLIPO CAR CAM WANLIPO dash camera for cars provides 4K UHD Single or 2K+1080P video and app control with WiFi, allowing each car a high-quality dash cam with app. If you are looking for a high-resolution car recorder camera, M03X dash camera will be your best choice. Make sure you have a secure driving experience 24 hours a day. The built-in battery is only used for emergency file record, it does not have enough power to support the dash cam wifi for a long time, and an external power supply is required for normal use. The dash camera must use a genuine memory card. Otherwise, this dash cam will not record. Max Support 128 GB memory card (Micro SD memory card is included in the package) If the video recorded by the dash cameras cannot be viewed normally on the PC, it is recommended to use Potplayer or download a universal player to solve the problem. If the car dashcam is not working properly, please default the system settings or format.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Car & Vehicle Electronics",
                "link": "https://www.amazon.com/Vehicle-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3248684011"
            },
            {
                "name": "Car Electronics",
                "link": "https://www.amazon.com/Car-Electronics/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1077068"
            },
            {
                "name": "Car Video",
                "link": "https://www.amazon.com/Car-Video-Audio-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10980521"
            },
            {
                "name": "On-Dash Cameras",
                "link": "https://www.amazon.com/Car-On-Dash-Mounted-Video/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3248689011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.2 x 1.8 x 1.6 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.05 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CP5QBZYW"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 15 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#45,692 in Electronics (See Top 100 in Electronics) #394 in Car On-Dash Mounted Cameras"
            },
            {
                "name": "Connectivity technologies",
                "value": "Wireless"
            },
            {
                "name": "Special features",
                "value": "wifi connection"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "black"
            },
            {
                "name": "Whats in the box",
                "value": "1*Front Dash Camera /1*Rear Dash Camera /1*Car Charger/ 1*Suction Mount /4*Crowbar / 1* Cable Clamp /1*Data Cable/ 1*32GB SD Card（in the dash cam）/ 1*User Manual"
            },
            {
                "name": "Manufacturer",
                "value": "WANLIPO"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "January 26, 2024"
            },
            {
                "name": "Brand",
                "value": "WANLIPO"
            },
            {
                "name": "Orientation",
                "value": "Front and Rear"
            },
            {
                "name": "Vehicle Service Type",
                "value": "Car"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Special Feature",
                "value": "wifi connection"
            },
            {
                "name": "Video Capture Resolution",
                "value": "4K"
            },
            {
                "name": "Included Components",
                "value": "1*Front Dash Camera /1*Rear Dash Camera /1*Car Charger/ 1*Suction Mount /4*Crowbar / 1* Cable Clamp /1*Data Cable/ 1*32GB SD Card（in the dash cam）/ 1*User Manual See more"
            },
            {
                "name": "Mounting Type",
                "value": "Dashboard Mount"
            },
            {
                "name": "Control Method",
                "value": "App"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "4K resolution can only be achieved in a single front mode, and the maximum of dual recording is 2K +1080P！ Q: How to connect wifi? The following are two methods for connecting WiFi: (1) Open the M03 dash cam, press the OK button to pause recording, click the menu button on the left, find WiFi settings and turn it on. (2) Long press the \"Down\" button until the WiFi icon appears on the driving recorder interface The WiFi account name and password will be displayed in the lower left corner of the screen. And turn on the mobile phone WiFi, find the WiFi account corresponding to the driving record, and enter the initial password is generally 12345678. Q: Is the packaging SD Memory card included? A:Yes, the dashcam is already packaged with an SD card, but please note that the SD Memory card is inserted into the card slot of the dashcam (rather than placed separately in the packaging). Please insert the SD card in the correct direction according to its instructions, and do not insert it in the wrong direction, otherwise the SD card will get stuck in the dashcam and cannot work. Q: Do I have to connect to the Viidure App via wifi using this 4k dash camera for cars? Is it possible to connect via bluetooth? A: Yes, this 4K car camera only connects to the Viidure App through WiFi, please note that there is absolutely no Bluetooth connection. Please refer to the following steps to connect WiFi: Firstly, turn on the dashcam, long press the \"Down\" button until the WiFi icon appears on the driving recorder. Secondly, the WiFi account and password will be displayed in the screen. Thirdly, turn on the mobile phone WiFi, find the WiFi account corresponding to the driving recorder, and enter the initial password 12345678. Fourthly, when the mobile phone is connected to the WiFi, if the WiFi logo of the recorder is green, the connection to WiFi is successful. Finally, open the viidure app and click the \"Access Camera\" button to synchronize the real-time video of the driving recorder.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d5b47588-df39-4ad4-8b81-ee4b56db3e8d.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "FREQUENT QUESTIONS AND ANSWERS Q: If the car is turned off, will this 4K dashcam with wifi still work? A: Due to the connection between the dash cam and the car ignition device through a car charger, once the car is turned off, the dash cam will also immediately shut down and cannot continue to work. Q: Does it have built-in GPS? A: At present, this 4K dash camera does not have GPS. Please carefully read the product description on Amazon's website when purchasing. Q: Is the car ignition powered? A: Yes, the build in low battery of The 4K car dashcam is only used for emergency video recording, there is not enough power to record The car charger worn in the packaging must be used to connect the interface to the car designation for normal recording. Q: Why is the suction cup mount not sticky? How can I install and fix it to the windshield? A:This suction cup mount itself is not sticky and is mainly fixed to the windshield by turning the twist knob of the suction cup mount to \"lock\". If you still do not understand how to fix the suction cup mount, please refer to the manual. Q: Do I need to download a dedicated app? If needed, how can I download the app? A: At present, this dashcam can be connected to WIFI to operate in the app, or not connected to wifi, and you can playback the recorded video on the dashcam under the condition of ensuring that the dashcam is recording (the blue indicator flashes once per second to indicate that it is recording). But if you don't like connecting to wifi and managing dashcam through the app, we sincerely suggest that you do not turn on wifi, and suggest that you playback on the dashcam if you need to. If you want to manage dashcam through an app, please download the Viidure app. Here are the methods to download the app: Method 1: Search and download viidure in the App Store or Google play. Method 2: Scan the QR code of the menu in the dashcam to download the viidure App. Method 3: Scan the QR code of the user manual to download the viidure App.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/507884a2-6a4d-48db-be77-3cb0304c7a7e.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "What‘s in the box? 1*Front Dash Camera 1*Rear Dash Camera 1*Car Charger 1*Suction Mount 4*Crowbar 1* Cable Clamp 1*Data Cable 1*32GB SD Card（in the dash cam） 1*User Manual Please read the user manual carefully before use and keep it properly, we hope this car camera can meet your needs! WANLIPO CAR CAM WANLIPO dash camera for cars provides 4K UHD Single or 2K+1080P video and app control with WiFi, allowing each car a high-quality dash cam with app. If you are looking for a high-resolution car recorder camera, M03X dash camera will be your best choice. Make sure you have a secure driving experience 24 hours a day. The built-in battery is only used for emergency file record, it does not have enough power to support the dash cam wifi for a long time, and an external power supply is required for normal use. The dash camera must use a genuine memory card. Otherwise, this dash cam will not record. Max Support 128 GB memory card (Micro SD memory card is included in the package) If the video recorded by the dash cameras cannot be viewed normally on the PC, it is recommended to use Potplayer or download a universal player to solve the problem. If the car dashcam is not working properly, please default the system settings or format.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d139fec-18a0-4013-8539-2b629067525d.__CR0,0,960,1280_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/523577ab-dce8-435c-903d-b6cffb9af41d.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Up to 4K UHD Single Front 4K(3840*2160P) resolution dash cam for car, the recorded video is clear and high quality, it can more clearly capture all pedestrians and vehicles in front of the car, ensuring your driving safety. Note：Dual recording mode can only reach up to 2K (Front) + 1080P (Rear) Built-In WiFi & App Control Built-in WiFi can connect to the Viidure App, allowing you to preview live, playback recorded video, change the dashcam’s settings and download files to your phone or share videos to social media, allowing you to share any wonderful moments. 150° Wide-Angle The dual dash cam is equipped with 150° wide-angle, which helps to reduce driving blind spots, record more detailed videos, observe more details of vehicles, obstacles and pedestrians, retain important collision evidence, and reduce disputes.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8a57a448-1042-473a-8371-4fa0f62c7bf1.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/674691ac-f5f2-4346-a683-61032cfd8269.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e3091fb2-7940-4b48-a308-26bc7b0a6eb5.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "G-Sensor & Emergency Lock When using the car dash cam, it is recommended to turn on the gravity sensing function and select the medium sensitivity. When encountering a collision, the camera for car can record and lock the current video urgently to avoid being covered by loop recording. Seamless Loop Recording When using the car cam, it is recommended to turn on the loop recording function, then the continuous recording will use 1/2/3 minutes of video clips to save in the memory card, reducing the trouble of manually formatting the memory card. Note that locked videos need to be deleted manually. 24H Parking Monitoring When parking, turn on the parking function. When the built-in gravity sensor of the dash cam with parking mode detects a collision, it will automatically record and lock the current video to retain important evidence. The 4k dash cam supports 24-hour monitoring.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/23fac1f3-c7d5-4bf1-a38d-8305fbc3a04e.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97858f67-ef8a-40f2-923a-1357ce8b57d1.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0a058743-dea0-48b6-aeca-dae6944be5d7.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Easy to Install Dash Camera Fit the dash cam and suction cup together and attach to the windshield, then plug one end of the car charger into the port. The rest is hidden in the gaps of the interior panels. Then plug the other end into the car's charging port. And The rear dash camera connects the car's reversing lamp positive lead and then install it to the car rear. Car Charger to Record This car camera is currently only suitable for cars with car ignition. The built-in battery is only used for emergency video recording, please connect the car charger for continuous recording. The car charger must be connected to the dash camera and the car ignition for charging. Screen Saver & No Distraction When you set the screen saver, the screen of the car on-dash mounted cameras will go black after the set time, saving power and allowing you to concentrate on driving to ensure driving safety. Always on screen the blue indicator flashes once per second to indicate that the dash cam’s recording is in progress.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0f1a8822-d9e0-45aa-8b7e-d12f91cd4d74.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97cfc65a-c714-4d4f-bb45-9569c684f9e2.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ef0e363f-0426-432c-a086-91528e47922e.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "FREQUENT QUESTIONS AND ANSWERS Q: How to playback the video on dash cam ？ A: Method 1: When the dash camera stops recording (press the OK key to stop recording), press the M button to select the video file and press the OK key to playback the video. Method 2: After the mobile phone is connected to the wifi of the dashcam, view the real-time recorded video and the recorded video on the app. Method 3: Put the dash cam's memory memory card into the card reader, and then connect the card reader to a personal computer to view the video. Q: Why does this dash camera suddenly turn on and then shut down when the car engine is turned off and the doors are opened/closed? A: This is because you have activated the parking mode. When the car is turned off and in the parking state, the vibration of opening/closing the car door is recognized as a car collision. This will automatically turn on and record emergency videos before turning off. If you really don't like this, we suggest that you turn off the parking mode. However, please note that if parking mode is turned off, once your car is hit during parking, it will not automatically start up to retain important evidence. Q: Does the package include the front snd rear dash camera? Does the dashcam have an inside camera? A:Yes, currently this 4K dash cam comes with the front and rear dashcam. Please be particularly careful not to include the inside camera. Please carefully read the packaging description of this 4K dash cam with wifi on Amazon's website when purchasing. Q: Do I have to connect to WiFi to use and operate this WANLIPO 4K dash cam? A:No, absolutely not, this dashcam can connect to the app via wifi to play back videos and manage settings. When the dashcam is in normal recording state, the blue indicator flashes once per second to indicate that it is recording. You can play back the video directly on the dashcam, or insert the card of the dashcam into the card reader and then connect it to a PC to play back the video. Q:Does this 4K dash cam with wifi require the purchase of additional hardware? A: No, absolutely not. This 4K dash cam with WiFi does not require the purchase of additional hardware kits to support parking mode. In fact, this dash cam comes with parking mode (default off). If you want to turn on parking mode, you need to click the menu button when the dash cam is stopped recording and go to the settings to find [Parking Mode] to turn it on. Some friends may have been prompted by the app's settings to purchase additional hardware for parking mode, but in reality, it is not necessary. We will fix this error in the app in the near future.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/35ff45c1-199c-4fd1-bd39-1c035cb951e5.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d5b47588-df39-4ad4-8b81-ee4b56db3e8d.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/507884a2-6a4d-48db-be77-3cb0304c7a7e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d139fec-18a0-4013-8539-2b629067525d.__CR0,0,960,1280_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/523577ab-dce8-435c-903d-b6cffb9af41d.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8a57a448-1042-473a-8371-4fa0f62c7bf1.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/674691ac-f5f2-4346-a683-61032cfd8269.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e3091fb2-7940-4b48-a308-26bc7b0a6eb5.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/23fac1f3-c7d5-4bf1-a38d-8305fbc3a04e.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97858f67-ef8a-40f2-923a-1357ce8b57d1.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0a058743-dea0-48b6-aeca-dae6944be5d7.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0f1a8822-d9e0-45aa-8b7e-d12f91cd4d74.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97cfc65a-c714-4d4f-bb45-9569c684f9e2.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ef0e363f-0426-432c-a086-91528e47922e.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/35ff45c1-199c-4fd1-bd39-1c035cb951e5.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CiciWoowooCiciWoowoo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDZGDD2S72IZAVAEC363GCLQV4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30VNQEFP64J8O?ASIN=B0CP5QBZYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars An all in one front and rear dashcam solution with everything you need.",
                "reviewText": "The media could not be loaded. When my better half purchased her new car a few years ago, I was really impressed with the backup cam function on her dash display.But my somewhat older car wasn't set up for that type of electronics display.But the more I drove her car, the more I realized just how helpful having both front and rear cameras would be in my normal everyday driving.Especially in SE Michigan, where winter conditions can create havoc on the roads, making you wish you had the ability to document what went down when things went sideways.So when I saw this Wanlipo Front and Rear Dual Dash Cam with 3 inch Screen, WiFi, G-Sensor, and Parking Monitor function, I decided that I needed to give it a try.Let me tell you, this kit more than surpassed my expectations!It has everything you need to get both front and rear cameras working with a minimum of fuss and bother.It includes a 12V power adapter, all of the cabling needed to run from the main camera to the rear camera, adhesive cord control pieces, a 32 GB SD card, and even includes an SD card adapter for transferring images from your cameras to a computer or other device.All of the buttons for operation are conveniently located on the camera housing.And although not required for full operation, there is also an app that you can download to assist you with the operation.About the only thing that I think I will add to this setup is a license plate mount for the rear cam vs using the supplied mount, and maybe a larger SD card, of which I have plenty.So if you have been thinking about adding a Front and Rear Dash Cam system to your vehicle, be sure to take a good long look at this Wanlipo Front and Rear Dual Dash Cam with 3 inch Screen, WiFi, G-Sensor, and Parking Monitor.I'm willing to be that you will be every bit as impressed as I am!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61L-MknMc3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Ox0gwDbFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ZxFEMS-bL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+ZlQTeOpL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710gO3pdp0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/715vZcX0zdL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Dbr-LcXvL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71JP12i0hPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Py9GIsEIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Qu8SBxkuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71R9Jh6QYcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71XaD0SRgZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71XmrfKTbaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71bXLfonSFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71cBeRyeIjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71iFNbFCcVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71lpCCMuFDL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f8192391-a466-42f8-8896-6d8993cff9cb/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "cceroseccerose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFUJ6RPCD5PA27MGIZJS5XGZVDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27J41EX1J2ZN8?ASIN=B0CP5QBZYW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "4.0 out of 5 stars Good entry level dash cam",
                "reviewText": "This dash cam packs a lot of features for a low price. Installation was mostly a breeze. The camera locks onto the suction cup mount. Once positioned on the windshield, the suction cup holds the camera securely in place. The power cord is a suitable length to run it so that it’s hidden from view. The included prybar and mount clips make it easy to push the cable into various gaps, so they are hidden and out of the way. In my car, I ran the cable along the top of the windshield, down the passenger side of the windshield, and underneath the glove compartment. The optional rear camera has an equally lengthy cable that allows it to be mounted on the rear window, but tucked away and hidden to where it plugs into the main camera. The rear camera can also be wired into the backup lamp, so that it only comes on and records when the car is put into reverse. I chose to have the rear camera constantly record just like the front camera.The device powers on when the car is started. The front camera takes up most of the screen, with the rear camera image displayed in the upper right corner. It automatically goes into record mode when powered on, but it has buttons on the side to switch between various options, start and stop recording, and take snapshots from the front and rear cameras.There is an optional companion app which allows the camera’s memory card to be accessed over wifi. The card can be removed and inserted into a card reader directly on a PC to access the videos as well. The included memory card, while small in size, is a nice bonus.Despite a mostly informative manual, it didn’t give a good explanation about the rear camera. The lack of proper documentation left me believing that it had to be connected to the back up lights and only operated when the car was in reverse.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61HlnSOoYSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Mq-MkQxKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Jz5iuL80L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71eqol4AKUL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Almarie Gentryy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZLL3EMPW6GMPR4PJGQZQCNFOQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHN9VJT6IKTYO?ASIN=B0CP5QBZYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Needed this !",
                "reviewText": "So I’ve had a couple of break ins with my car and with my home. I got myself some cameras for my house but then I still didn’t have any for my car. And it’s always great to have these dash cams for accidents and for anything else you may need them for. We’ve assembled mine and installed them into my car. And my car isn’t a smart car. So far so good. 😊 I’ll update with the life and quality and how well it records in a month or so.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pappaof2pappaof2",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMRLVTNAYJXHO7CF2HYVTIC3IKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV3K2KK7KZ623?ASIN=B0CP5QBZYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars The Complete Package for a Dashcam",
                "reviewText": "If you are in the market for a dashcam and totally new to what they do for you as a driver, this is the best choice for you. This dashcam comes with everything to get you started and install this important device in your car. In comes with a front AND a rear cam. The instructions are included to install (and you can find tutorials on YouTube). The front camera is nice and the picture is very clear. The box comes with wiring, adhesives, mounts, and even a tool to snugly hide the wring in your car's interior dash. The wifi capability is great for when you have to view an accident right when it has happened or show a police officer. The sound effects help to allow you to know when the camera is on and recording. It comes with SD cards and instructions, so you should have this up and running in your car within one hour.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61K1xzLrEML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7185HVoE7nL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "JQ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJNKDG4YH6EONX7HYCJKKBO2F6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JPDOMS68DXO2?ASIN=B0CP5QBZYW",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "3.0 out of 5 stars Inexpensive dual camera",
                "reviewText": "Many dashcams these day come with WiFi connectivity and require Viidure app for configuration. This camera recommends installing the app, too, but you do not have to. The camera has a considerably large screen on the back and a set of navigation buttons on both sides that can be used for reviewing images/videos and for configuration. Menus use large icons and are easy to navigate.4K resolution is an overkill for dashcam needs, 1080p is more that enough to record evidence. This camera allows recording 2K front plus 1080p rear. It is more important to have great nighttime recording capability. This camera, like most cameras in this price range, does not have a great sensor, and nighttime footage looks a bit grainy and blurry.Another downside is the suction cup mount. Adhesive-based mounts tend to stay on no matter what, in any weather. My experience with suction cup mounts is that most of them fall off after at most several hours in direct sunlight.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kaitlyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLBS73MGTUPQBSKCUMSF63Q63QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BK8QJDUXSQTV?ASIN=B0CP5QBZYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars works for what I need it for",
                "reviewText": "I don’t think I’m prone to accidents, but I have so many road rage stories that I need proof behind. This works for what I need it for. video quality is nice enough to tell what’s what, who’s who, etc. Easy to put together and install, but also I had my dad do it and he said it wasn’t hard.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}