{
    "remaining_requests": 5883,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AZDOME-Dashcams-Control-G-Sensor-Included/dp/B0C3M93Y4T",
    "body": {
        "name": "AZDOME M301 2K Dash Cam Front and Rear, Built in WiFi, Dual Dashcams for Cars, Voice Control Car Camera with UHD 1440P, Night Vision, G-Sensor, Parking Monitor, 64GB SD Card Included",
        "price": "$99.99",
        "originalPrice": "",
        "rawPrice": 99.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AZDOME-Dashcams-Control-G-Sensor-Included/dp/B0C3M93Y4T",
        "soldBy": {
            "sellerID": "A1KC0NZKRWTGEO",
            "name": "Yuehling Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1KC0NZKRWTGEO&asin=B0C3M93Y4T&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41iBD-xTNgL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41xanGeutuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JGySR6J4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hBJYz2JLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gQuncaxXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 XyWGwFNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31MTot6fGXL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5ccafcd5-7e0d-4ded-af83-9909df4fc916/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6aa82e8b-0ccb-4ae1-bfd6-36321ff543b7/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the AZDOME Store",
            "link": "https://www.amazon.com/stores/AZDOME/page/07BFE4C2-1CC4-4EE3-AE5D-8EACABF41000?ref_=ast_bln"
        },
        "brand": "AZDOME",
        "merchantInfo": "Yuehling Direct",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 28,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 3 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "📷【2K 1440P Dash Cam】AZDOME M301 Dash Cam is an excellent device equipped with a high-definition 2K (2560x1440P) UHD front camera. With the added features of WDR and F1.8 large aperture, this dash cam is capable of capturing every moment in clear detail, even in low light situations. Additionally, the dash cam supports micro SD cards up to 128GB class 10 - U3 speed, and comes with a 64GB memory card included. Get the AZDOME M301 Dash Cam today to ensure that you never miss a moment on the road.",
            "📷【Built-in Wifi】“AZDOME” App allows you to remotely control the M301 dash camera within a 3-5 meter range. You can change settings, view real-time footage, take photos and videos, playback recordings, and download files to your phone for editing. Additionally, the app makes it easy to share your recorded videos with friends and family on social media. Download the AZDOME App now for seamless control and effortless sharing of your M301 dash camera footage.",
            "📷【Hands-Free VOICE Control】M301 smart car dash camera offers six voice commands for hands-free photo and video taking, allowing you to travel without worry. You can easily finish tasks with just your voice, including \"Turn on WiFi/Turn off WiFi,\" \"Take picture,\" \"Open Recording/Turn off Recording,\" and \"Lock the video.\" Please note that say a command, but ONLY support English. Get the M301 smart car dash camera today and enjoy the convenience of hands-free operation.",
            "📷【Hidden & Wide Angle】M301 car dash camera features a 170° super wide-angle lens that provides a wider field of vision, ensuring you can see more effectively in any condition. Its discreet design allows you to stick the dash cam to the windshield for an optimal view without attracting attention, promoting safe driving. Get the M301 car dash camera today and enjoy a wider perspective on the road.",
            "📷【Loop Recording/G-sensor/Parking Monitor】 When the SD card is full, it will cover the previous video file to continue the recording. When the Built-in G-sensor detects a sudden shock or collision, the camera will automatically lock video, which will not be covered by the loop recording. With the parking monitor feature enabled, the car camera detects vibration for 24/7, even if the car is parked. (need connect to Hardwire kit or External battery, Hardwire kit is sold separately)",
            "📷【Super Night Vision】AZDOME M301 dash cam enhances exposure in low-light conditions to provide clear imaging, giving you confidence when driving at night. With its WDR and F1.8 large aperture, it ensures clarity and displays road details such as license plates and road signs, making it a reliable guardian for your car day or night. Drive with peace of mind knowing that the AZDOME M301 dash cam has got you covered.",
            "📷【Heat Resistant with Super Capacitor】Super capacitor powered instead of lithium batteries, which are built to survive extreme weather conditions from -4°F-158°F. ideal for hot weather areas like Arizona, Florida, Texas, or extremely cold areas. And it also gives a longer life-span than lithium-ion battery dashcams in the market so that you can enjoy your journey at ease.",
            "📷【64GB SD Card Included & Worry-free Warranty】AZDOME we support a max. 128GB SD card (includes a 64GB SD card). We offer a 30-day full refund or replacement, 12-month warranty, and lifetime after-sales service support. If you have any questions about our products, feel free to contact us, and we'll respond within 24 hours. Choose AZDOME for reliable products and exceptional customer service."
        ],
        "description": "AZDOME M301 Car Dash Cam Equipped with advanced sensor, the dash cam offers you much clearer videos both day and night. You will enjoy a totally new driving experience! With the built-in Wi-Fi function and the free AZDOME app, you can view real-time videos on your dash cam, iPhone or Android device while on the drive. Also, view and share recorded videos with friends and family in just a few clicks, via the AZDOME application. Support 2K Dashcams for cars Field of View: Front 150°, Rear 150° Temperature: -4°F-158°F Built‒In Wi-Fi ║ Free AZDOME App Super Capacitor Super Safety 24-Hour Parking Monitor (Need additional Hardwire Kit, Hardwire kit is not included, need buy extra. JYX04 Hardwire kit ASIN: B0BQMKWPZJ) Storage: A 64GB SD Card is included, supports up to 128G Micro SD card",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Car & Vehicle Electronics",
                "link": "https://www.amazon.com/Vehicle-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3248684011"
            },
            {
                "name": "Car Electronics",
                "link": "https://www.amazon.com/Car-Electronics/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1077068"
            },
            {
                "name": "Car Video",
                "link": "https://www.amazon.com/Car-Video-Audio-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10980521"
            },
            {
                "name": "On-Dash Cameras",
                "link": "https://www.amazon.com/Car-On-Dash-Mounted-Video/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3248689011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "9.45 x 2.36 x 5.51 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.29 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0C3M93Y4T"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 28 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#250,897 in Electronics (See Top 100 in Electronics) #1,878 in Car On-Dash Mounted Cameras"
            },
            {
                "name": "Connectivity technologies",
                "value": "Wi-Fi"
            },
            {
                "name": "Special features",
                "value": "G-Sensor"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Whats in the box",
                "value": "Car Charger"
            },
            {
                "name": "Manufacturer",
                "value": "AZDOME"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "April 26, 2023"
            },
            {
                "name": "Brand",
                "value": "AZDOME"
            },
            {
                "name": "Model Name",
                "value": "M301"
            },
            {
                "name": "Orientation",
                "value": "Front and Rear"
            },
            {
                "name": "Vehicle Service Type",
                "value": "Car, Truck"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Special Feature",
                "value": "G-Sensor"
            },
            {
                "name": "Video Capture Resolution",
                "value": "1440p"
            },
            {
                "name": "Included Components",
                "value": "Car Charger"
            },
            {
                "name": "Mounting Type",
                "value": "Windshield Mount"
            },
            {
                "name": "Control Method",
                "value": "Voice"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "AZDOME M301 2K Car Dash Cam - Your Car Companion AZDOME is a leading player in the global market for automotive intelligent electronics products. With a team of experienced and imaginative engineers, we are dedicated to building a reliable and trustworthy brand that provides high-quality automotive supplies. Trust AZDOME for innovative solutions and exceptional products. AZDOME dash cam's built-in Wide Dynamic Range (WDR) technology captures optimal lighting and image details in both bright and dark conditions, ensuring vivid road sign and license plate visibility day or night. With smart accident monitoring, the dash cam activates upon impact and records videos up to 1 minute. Additionally, the device allows you to record exceptional time-lapse videos. Drive with confidence knowing the AZDOME dash cam has got your back. Warm Tips: 1. Arbitrarily disassembly is NOT in maintenance wa-rranty coverage; 2. Be sure to format your SD card with your car dash cam for the first time use, and we recommend to reformat it Monthly. 3. Max Support: 128GB(not including), A 64GB SD Card is INCLUDED, for reliable performance, we recommend SanDisk brand class 10 or U3 above micro SD card. 4. It is built in Super Capacitor (Only has 1 mAh Lithium Metal Battery used to memory time), Please always connect Dash Cam to external power ( USB Hardware Kit is Not included) while it is in use. 5.Note: IF you need dash cam record 24 hours after parked, you will need install car dash cam with a hardwire kit (Hardwire kit is not included, need buy extra. JYX04 Hardwire kit ASIN: B0BQMKWPZJ). 6. AZDOME provide updates for M301 dash cam Firmware, PDF user manual and camera accessory. If you need it, AZDOME will help you. 7. For Apple iOS Phone: Connect to APP by WiFi, Open \"AZDOME\" APP → click Check Real-time Video → click Set of this prompt of IOS system → set Wireless Data to WLAN, Turn off Mobile Data directly. 8. For iPhone Setting: 1* For Latest iOS System: Setting→AZDOME→Click \"Wireless Data\"→Select \"WLAN\". 2* For Older iOS System: Setting→AZDOME→Disable the \"Cellular Data\".",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/22eed341-5e0e-4d83-9ad0-4ef157059700.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "What’s in the box? AZDOME specializes in providing smart car electronics & visual perceptual solution for car-lovers. 2K Dash Cam x1 Rear Camera(6m/20ft) x1 Electrostatic films x2 USB Car Charger x1 Micro USB Power Cable(3.5m/12ft) x1 Cable Clip x5, Pry tool x1 64GB Micro SD Card x1 User Manual x1 AZDOME M301 Car Dash Cam Equipped with advanced sensor, the dash cam offers you much clearer videos both day and night. You will enjoy a totally new driving experience! With the built-in Wi-Fi function and the free AZDOME app, you can view real-time videos on your dash cam, iPhone or Android device while on the drive. Also, view and share recorded videos with friends and family in just a few clicks, via the AZDOME application. Support 2K Dashcams for cars Field of View: Front 150°, Rear 150° Temperature: -4°F-158°F Built‒In Wi-Fi ║ Free AZDOME App Super Capacitor Super Safety 24-Hour Parking Monitor (Need additional Hardwire Kit, Hardwire kit is not included, need buy extra. JYX04 Hardwire kit ASIN: B0BQMKWPZJ) Storage: A 64GB SD Card is included, supports up to 128G Micro SD card",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2f228329-c072-4c21-930a-c0840a347362.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a63e0e84-ab94-4f07-9cd6-4f33dc92613a.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Mirror Flip To enhance compatibility with a wider range of vehicles, we have upgraded the mirror flip function of our rearview camera. This upgrade allows for installation in a variety of scenarios, including pickups, trucks, RVs, and more. Choose our rearview camera for versatile and reliable performance. Hands-Free Voice Control M301 smart dash cam comes with 6 voice commands, you can completely release your hands and travel without worry. Note: say a command, but ONLY support English. \"Turn on/off WiFi, Take picture, Open/Turn off recording, Lock the video\" WDR Night Vision AZDOME M301 dash camera is equipped with an F1.8 aperture and advanced chip, enabling it to capture clear video in low-light conditions. This ensures that car license plates and road signs are clearly visible, providing you with a superior night vision experience. Drive with confidence knowing that the AZDOME dash camera has got you covered, day and night.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dcb27eab-03f7-434c-a18d-bf947d2ff325.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c657be6-f638-4948-9079-1b1d31e0e225.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6fd4135-ebea-4517-9cf2-6b3663ecae01.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "2K HD Resolution AZDOME M301 dash cam records at high-speeds of 30fps and 2560*1440P resolution, quickly generating high-resolution images that capture even the smallest details, including road signs and license plates. Don't miss out on important evidence - make sure you have an AZDOME dash cam. Support Max 128GB SD Card With support for up to a 128GB micro SD card (includes a 64GB SD card), the AZDOME M301 car dash cam can accommodate more 2K videos, making it perfect for recording all your wonderful trips or scenic drives anytime, anywhere. Don't miss a moment - get the AZDOME M301 car dash cam today and start recording your road adventures. Built‒in Wi-Fi With the built-in Wi-Fi, you can view and download the recorded videos on AZDOME APP, then share it with your friends or relatives on social media. Note: The dash cam's WiFi cannot be connected to the Internet. Only a short distance (about 3m/10fts) can be connected to the mobile phone via AZDOME APP.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7de577a4-cdf4-4325-af35-42975fa84d39.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c74cc279-c496-4df8-adfb-de80be50570b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83b09d9c-a84c-4354-93c4-baa573b033ee.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "G-sensor & Emergency Recording Loop recording allows dash cam continually recording videos and overwrites the oldest one. The Loop recording will automatically overwrite the earliest video segment when the memory storage space is full. Once any collision is detected by G-sensor. The video will be locked so that it won't be overwritten in loop recording. Dash Cam Front and Rear Front Dash Cam The 2K front camera is 45 degree rotatable. It has a 150° wide-angle, and can clearly display license plates or road signs in the distance that cannot be read at 1080P or other resolutions. 360° Rotatable Rear Camera The 1080P waterproof IP68 rear camera has a wide angle of 150°. It can provide you with a clear image and park more safely. The rear camera lens is 360 degree rotatable. It is recommended to install it in the windshield. 24H Parking Monitor(Hardwire Kit is NOT included) 24-Hours Parking Monitor only works on an external power source. If someone hits your car and impact reaches the G-Sensor Level, then the camera will turn on and record it. Note: Must be hardwired or connect with external battery. (Hardwire kit is not included, need buy extra. JYX04 Hardwire kit ASIN: B0BQMKWPZJ)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fd7caaea-7f72-4318-bba2-c037e298b2bc.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/86ff6a94-f71c-4253-b587-909666a0ca96.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fba211e1-db98-4d17-b8d0-52585252a0e3.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "M301 Dash Cam M300S Dash Cam M330 Dash Cam M550 Pro Dash Cam M27 Dash Cam Video Resolution Front 2K+Rear 720P Front 4K+Rear 1080P Front 1080P FHD Front 4K+Rear 1080P,1440P+1440P+1080P Three Way Front 2K FHD Camera Type 2 Channel Front and Rear 2 Channel Front and Rear Front 3 Channel Front inside Rear Front Screen Size N/A N/A 0.96 Inch 3.19 Inch 3 Inch Storage Info 64GB 64GB N/A 64GB N/A Support SD Card 128GB Max 256GB Max 128GB Max 256GB Max 128GB Max Wi-Fi ✓ ✓ ✓ ✓ ✓ Smart Voice Control ✓ ✓ ✓ ✘ ✘ G-Sensor & Loop Recording ✓ ✓ ✓ ✓ ✓ Parking Monitor ✓ ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/22eed341-5e0e-4d83-9ad0-4ef157059700.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2f228329-c072-4c21-930a-c0840a347362.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a63e0e84-ab94-4f07-9cd6-4f33dc92613a.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dcb27eab-03f7-434c-a18d-bf947d2ff325.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c657be6-f638-4948-9079-1b1d31e0e225.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6fd4135-ebea-4517-9cf2-6b3663ecae01.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7de577a4-cdf4-4325-af35-42975fa84d39.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c74cc279-c496-4df8-adfb-de80be50570b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83b09d9c-a84c-4354-93c4-baa573b033ee.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fd7caaea-7f72-4318-bba2-c037e298b2bc.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/86ff6a94-f71c-4253-b587-909666a0ca96.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fba211e1-db98-4d17-b8d0-52585252a0e3.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f15fcf01-53cb-41c1-a8d3-155a1e77b457.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9f9edea3-0074-413c-8aa5-96e8f0fc1c33.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2bca8e6c-af64-4ed4-a28c-7b7dcc1598ca.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/802c038f-61f4-4fae-9541-a6b310d35f70.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/247a55eb-45f4-4bc4-bcb3-fb2b0ed49e66.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Patrick Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPHYVJAIQSKCTDWZQAEZQBCYDSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GPE9NT1XMEC?ASIN=B0C3M93Y4T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy installation",
                "reviewText": "Everything working perfectly have no complaints",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Santiago acosta meza",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOLLH5MU3DRIL4J5OLTAATQLNDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V1GA2EH427DK?ASIN=B0C3M93Y4T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Exelente camara",
                "reviewText": "Muy util exelente camara",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Norman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW7DN5PTPUVMJV6CB3SN2XBPM6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33EQWUII77AQW?ASIN=B0C3M93Y4T",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2023",
                "reviewTitle": "4.0 out of 5 stars Decent dashcam",
                "reviewText": "This dashcam works really good. Records when it detects excessive motion or crash. I have noticed it will record hard bumps and curves if you take them going fast. You can connect to it with your phone via wifi and look at the videos which are very good quality/clarity. The only thing I don't like about it is you have to attach it to your windshield with a sticky pad on it. I would prefer a suction cup. Overall it's a good dash cam that works.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7FDJYKCHZ2ENXNBC6OJ4TTD7RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TG8TUVRNRDY3?ASIN=B0C3M93Y4T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Great dash camera",
                "reviewText": "This dash camera system was fairly easy to install with no real issues at all. The cable to the rear camera was long enough for us to easily hide. The cameras do use sticky pads to hold them in place. We actually had a left over suction rig from another accessory and stuck the camera to that and then suctioned to the windshield, works great. You can view your videos on your cell phone via the app. Nice product that works.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Talks too much and displays delusions of adequacy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIORKACLE3RWTJUMKCKNGEKUKPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PMVRWMR8CZM8?ASIN=B0C3M93Y4T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Good picture",
                "reviewText": "Easy to setup and use",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yari",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZMWLJUNTEOMKJE7K2LXGTBJ6RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R200VEH4LR9ABZ?ASIN=B0C3M93Y4T",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2023",
                "reviewTitle": "2.0 out of 5 stars It's okay. When it comes to dash cams, you certainly get what you pay for.",
                "reviewText": "This is on the more affordable spectrum, and it shows. As others have stated, the GPS feature is only available with their add on. Set up does take a bit of time. Took us around an hour to set up and get all the cable management going so that it wouldn't look like a giant eyesore.You can't access any of the recordings unless you're actually in the car, which is a major nuisance. Over all it seems to have more cons than pros. It doesn't do parking recording, so if anything happens to your car while it's parked, that's too bad. It is small and compact and you get two. One for the rear and one for the front, which I really liked that, but again, there are so many little inconveniences that just add up. I would call this an interim dash cam. A dash cam you use while you save up for a better one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teach08",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAA5OPH3ITAKJGKPRQ22A7BCFMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D0S07B8NA1XF?ASIN=B0C3M93Y4T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Very simple setup and install",
                "reviewText": "This is a basic camera that will work quite well for even a technologically stunted driver. My husband had it installed and operating perfectly in a half hour. The app allows you to see the video, as there is no screen on the camera. It is super small and unobtrusive in the car, though I do wish it was a suction cup instead of the adhesive...not sure how well that's going to hold up in our ridiculous southern summer heat. All the wiring is plenty long enough, though we did have to replace the under dash sticky cable holder with a Command branded one - but it wasn't a big deal.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JJJJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXKZPGTF5CN7LEZK67YWH27XM3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2K4L26WT6W6AO?ASIN=B0C3M93Y4T",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Good dash cam",
                "reviewText": "I installed the Azdome M301 dash cam inside my Toyota Corolla.The installation was simple, and everything needed including the Micro SD card were part of the package. It took me less than 30 minutes to complete the install (still need to clean up the wiring though).To access the dash cam and make any changes to the configurations I had to connect my iPhone WIFI to the dash cam. Doing so disconnect the phone from CarPlay and disconnect you from Internet.Pros: - Compact design - Front and back cameras - All the parts are shipped with the unit including a 64GB Micro SD card (it supports up to 128GB of class 10 Micro SD cards) - WIFI capable - Good operating temperature (-4F to 158F) - G-sensor will lock the recording in event of collision to protect it from overwritingCons: -No GPS data (locations and speed) are part of the recording - No internal battery, Most of newer dash cams comes with an internal rechargeable battery that continues recording for hours after engine is shut off. You need to purchase a wiring kit and install it before using the parking mode.This dash cam has voice command support although Voice control is only limited to 7 commands and not always working.Overall, this is a good dash cam that does the basic and very comparable to other dash cam at $40 price point. Note the list price is $69 but there is $30 coupon that makes the final price $39.99. Recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51u6Vjw99EL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/610OZT8EABL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/610QY+6WdmL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/613lfZgVZtL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/616+DBuefoL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}