{
    "remaining_requests": 5960,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dashcam-Control-G-Sensor-Recording-Parking/dp/B0CSCJB6YY",
    "body": {
        "name": "2K Dash Cam Front and Rear, Dual Dash Camera Built in WiFi, 2K Front Car Camera with 64GB Memory Card, 720P Rear Dashcam with App Control, G-Sensor, Loop Recording, 24h Parking Monitor",
        "price": "$49.99",
        "originalPrice": "",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dashcam-Control-G-Sensor-Recording-Parking/dp/B0CSCJB6YY",
        "soldBy": {
            "sellerID": "A976JEXJHD7N5",
            "name": "WANLIPO-US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A976JEXJHD7N5&asin=B0CSCJB6YY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTWSS3KS"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "Only 7 left in stock - order soon.",
        "couponInfo": "Save 10%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/413Nf2LFgHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41r4r1N5fCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qhH09zjXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410ZVT-KSnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vJ4-7HEoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XlrC8P5xL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4159UPcHEML.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the WANLIPO Store",
            "link": "https://www.amazon.com/stores/WANLIPO/page/6EAA0EDE-6381-427A-B6E2-927A7326314F?ref_=ast_bln"
        },
        "brand": "WANLIPO",
        "merchantInfo": "WANLIPO-US",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21. Order within 1 hr 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【2K + 720P DUAL RECORDING DASH CAM】This dual dashcam features front and rear cameras, ensuring clear video recording at 2K resolution for the front camera and 720P for the rear. With an F1.8 aperture and 6 glass lenses, the 170° wide-angle lens for the front and 150° for the rear effectively eliminate blind spots, capturing comprehensive driving details, helping to provide critical evidence in the car accident, keeping you away from disputes.",
            "【WiFi SUPPORT & APP CONTROL CAR CAM】The 2K dash camera features built-in WiFi and comes with the exclusive \"VIIDURE\" app, compatible with both Android and iOS smartphones. This allows for convenient access to live previews, video downloads, and camera settings management. Share your memorable journey moments effortlessly on social media platforms like YouTube, Twitter, and Facebook, enabling you to connect and relive those special experiences with family and friends.",
            "【LOOP RECORDING & G-SENSOR】The dual car dashcam is equipped with a G-sensor that automatically detects sudden collisions once they reach the specified sensitivity. It will lock and save the current video, preventing it from being overwritten. With its seamless loop recording feature, the camera consistently captures 1/3/5-minute video clips. When the memory card reaches its full capacity, it will overwrite the unlocked old footage with new video to continue recording.",
            "【24 HOURS PARKING MONITOR DASH CAMERA】 This dual dash camera automatically switches to parking mode when parkingto vigilantly monitor its surroundings during parked periods. Once parking mode is activated, the 2k dash cam will automatically record and save footage in the event of a collision, utilizing its built-in battery when adequately charged. It support 24-hour monitoring, ensuring the safety of your parking.",
            "【EASY INSTALLATION & SIMPLE SETUP】The front dash cam easily attaches to the windshield using the suction cup mount, while the rear dash camera connects to the car's rear. Simply insert the memory card, connect the car charger, and start the car. Once the dashboard camera is powered on, you can easily configure the car camera. If you're unsure about the installation, please refer to the user manual or reach out to us for assistance.",
            "【SATISFACTION GUARANTEE & WARRANTY】We are committed to providing excellent car dashcam front and rear and satisfactory after-sales service to our customers.This car camera comes with 24/7 technical support, a one-year warranty, and a 30-day full refund policy. If you have any inquiries or suggestions, please don't hesitate to reach out. We will be willing to solve any questions for you at any time.",
            "【GUIDELINES & SUGGESTIONS BEFORE PURCHASE】This 2K dash cam for cars is exclusively equipped with WiFi connectivity (Bluetooth not available). Advice: Ensure to connect the car charger and engage the car ignition when using the 2K driving recorder. Video playback is accessible through the App via WiFi, and you can also review videos directly on this car dashcam or connect it to the PC using the provided data cable."
        ],
        "description": "We provide 2K+720P video and app control with WiFi, allowing each car a high-quality dash cam with app. If you are looking for a high-resolution car recorder camera, A12 dash camera will be your best choice. Make sure you have a secure driving experience 24 hours a day. The built-in battery is only used for emergency file record, it does not have enough power to support the dash cam wifi for a long time, and an external power supply is required for normal use. The dash camera must use a genuine memory card. Otherwise, this dash cam will not record. Max Support 128 GB memory card (Micro SD memory card is included in the package) If the video recorded by the dash cameras cannot be viewed normally on the PC, it is recommended to use Potplayer or download a universal player to solve the problem. If the car dashcam is not working properly, please default the system settings or format.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Car & Vehicle Electronics",
                "link": "https://www.amazon.com/Vehicle-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3248684011"
            },
            {
                "name": "Car Electronics",
                "link": "https://www.amazon.com/Car-Electronics/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1077068"
            },
            {
                "name": "Car Video",
                "link": "https://www.amazon.com/Car-Video-Audio-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10980521"
            },
            {
                "name": "On-Dash Cameras",
                "link": "https://www.amazon.com/Car-On-Dash-Mounted-Video/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3248689011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1.6\"D x 3\"W x 1.8\"H"
            },
            {
                "name": "Item Weight",
                "value": "8.5 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CSCJB6YY"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#178,236 in Electronics (See Top 100 in Electronics) #1,314 in Car On-Dash Mounted Cameras"
            },
            {
                "name": "Connectivity technologies",
                "value": "Wi-Fi"
            },
            {
                "name": "Special features",
                "value": "Built-In WiFi"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Whats in the box",
                "value": "1*Front Dash Camera / 1*Rear Dash Camera /1*Car Charger /1*Suction Mount/ 4*Crowbar/ 1* Cable Clamp /1*Data Cable /1*64GB SD Card（in the dash cam）/ 1*User Manual"
            },
            {
                "name": "Manufacturer",
                "value": "WANLIPO"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Date First Available",
                "value": "January 31, 2024"
            },
            {
                "name": "Brand",
                "value": "WANLIPO"
            },
            {
                "name": "Orientation",
                "value": "Front and Rear"
            },
            {
                "name": "Vehicle Service Type",
                "value": "Car"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Special Feature",
                "value": "Built-In WiFi"
            },
            {
                "name": "Video Capture Resolution",
                "value": "1440p"
            },
            {
                "name": "Included Components",
                "value": "1*Front Dash Camera / 1*Rear Dash Camera /1*Car Charger /1*Suction Mount/ 4*Crowbar/ 1* Cable Clamp /1*Data Cable /1*64GB SD Card（in the dash cam）/ 1*User Manual See more"
            },
            {
                "name": "Mounting Type",
                "value": "Dashboard Mount"
            },
            {
                "name": "Control Method",
                "value": "App"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "FREQUENT QUESTIONS AND ANSWERS Q: How to connect wifi? The following are two methods for connecting WiFi: (1) Open the dash cam, press the OK button to pause recording, click the menu button, find WiFi settings and turn it on. (2) Long press the \"UP\" button until the WiFi icon appears on the driving recorder interface The WiFi account name and password will be displayed in the lower left corner of the screen. And turn on the mobile phone WiFi, find the WiFi account corresponding to the driving record, and enter the initial password is generally 12345678. Q: Do I have to connect to the Viidure App via wifi using this 2k dash camera for cars? Is it possible to connect via bluetooth? A: Yes, this 2K car camera only connects to the Viidure App through WiFi, please note that there is absolutely no Bluetooth connection. Please refer to the following steps to connect WiFi: Firstly, turn on the dashcam, long press the \"UP\" button until the WiFi icon appears on the driving recorder. Secondly, the WiFi account and password will be displayed in the screen. Thirdly, turn on the mobile phone WiFi, find the WiFi account corresponding to the driving recorder, and enter the initial password 12345678. Fourthly, when the mobile phone is connected to the WiFi, if the WiFi logo of the recorder is green, the connection to WiFi is successful. Finally, open the viidure app and click the \"Access Camera\" button to synchronize the real-time video of the driving recorder. Q: If the car is turned off, will this 2K dashcam with wifi still work? A: Due to the connection between the dash cam and the car ignition device through a car charger, once the car is turned off, the dash cam will also immediately shut down and cannot continue to work.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7d7042e1-0eb6-43d8-bb26-40408ed45464.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "FREQUENT QUESTIONS AND ANSWERS Q: How to playback the video on dash cam ？ A: Method 1: When the dash camera stops recording (press the OK key to stop recording), long press the MENU button to select the video file and press the OK key to playback the video，and long press to exit the interface. Method 2: After the mobile phone is connected to the wifi of the dashcam, view the real-time recorded video and the recorded video on the app. Method 3: Put the dash cam's memory memory card into the card reader, and then connect the card reader to a personal computer to view the video. Q: Is the packaging SD Memory card included? A:Yes, the dashcam is already packaged with an SD card, but please note that the SD Memory card is inserted into the card slot of the dashcam (rather than placed separately in the packaging). Please insert the SD card in the correct direction according to its instructions, and do not insert it in the wrong direction, otherwise the SD card will get stuck in the dashcam and cannot work. Q: Is the car ignition powered? A: Yes, the build in low battery of The 2K car dashcam is only used for emergency video recording, there is not enough power to record The car charger worn in the packaging must be used to connect the interface to the car designation for normal recording. Q: Do I need to download a dedicated app? If needed, how can I download the app? A: At present, this dashcam can be connected to WIFI to operate in the app, or not connected to wifi, and you can playback the recorded video on the dashcam under the condition of ensuring that the dashcam is recording (the blue indicator flashes once per second to indicate that it is recording). But if you don't like connecting to wifi and managing dashcam through the app, we sincerely suggest that you do not turn on wifi, and suggest that you playback on the dashcam if you need to. If you want to manage dashcam through an app, please download the Viidure app. Here are the methods to download the app: Method 1: Search and download viidure in the App Store or Google play. Method 2: Scan the QR code of the menu in the dashcam to download the viidure App. Method 3: Scan the QR code of the user manual to download the viidure App.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/67b5cb97-5f3a-4ee1-a2ae-cd69d66d501f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "What‘s in the box? 1*Front Dash Camera 1*Rear Dash Camera 1*Car Charger 1*Suction Mount 4*Crowbar 1* Cable Clamp 1*Data Cable 1*64GB SD Card（in the dash cam） 1*User Manual Please read the user manual carefully before use and keep it properly, we hope this car camera can meet your needs! We provide 2K+720P video and app control with WiFi, allowing each car a high-quality dash cam with app. If you are looking for a high-resolution car recorder camera, A12 dash camera will be your best choice. Make sure you have a secure driving experience 24 hours a day. The built-in battery is only used for emergency file record, it does not have enough power to support the dash cam wifi for a long time, and an external power supply is required for normal use. The dash camera must use a genuine memory card. Otherwise, this dash cam will not record. Max Support 128 GB memory card (Micro SD memory card is included in the package) If the video recorded by the dash cameras cannot be viewed normally on the PC, it is recommended to use Potplayer or download a universal player to solve the problem. If the car dashcam is not working properly, please default the system settings or format.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a95124bd-0ace-41ae-8b5a-b71e0b4d2a2e.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/165b37be-6e0d-41f9-a796-6d279cdfe16b.__CR185,0,600,300_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "G-SENSOR & EMERGENCY LOCK When using the car dash cam, it is recommended to turn on the gravity sensing function and select the medium sensitivity. When encountering a collision, the camera for car can record and lock the current video urgently to avoid being covered by loop recording. SEAMLESS LOOP RECORDING When using the car cam, it is recommended to turn on the loop recording function, then the continuous recording will use 1/2/3 minutes of video clips to save in the memory card, reducing the trouble of manually formatting the memory card. Note that locked videos need to be deleted manually. 24H PARKING MONITORING When parking, turn on the parking function. When the built-in gravity sensor of the dash cam with parking mode detects a collision, it will automatically record and lock the current video to retain important evidence. The 2k dash cam supports 24-hour monitoring.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36e6492c-d3ab-4d65-a9ff-5cd428318664.__CR0,0,1024,1024_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dee0a6a4-865a-4cfc-b01d-21436fe936e4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1414e338-7ee1-4bde-90f5-209544975ebc.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "EASY TO INSTALL & USE Fit the dash cam and suction cup together and attach to the windshield, then plug one end of the car charger into the port. The rest is hidden in the gaps of the interior panels. Then plug the other end into the car's charging port. Then you can install rear cam inside or outside of your car. CAR IGNITION TO POWER This car camera is currently only suitable for cars with car ignition. The built-in battery is only used for emergency video recording, please connect the car charger for continuous recording. The car charger must be connected to the dash camera and the car ignition for charging. SCREEN SAVER & NO DISTRATION When you set the screen saver, the screen of the car on-dash mounted cameras will go black after the set time, saving power and allowing you to concentrate on driving to ensure driving safety. Always on screen the blue indicator flashes once per second to indicate that the dash cam’s recording is in progress.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de80ce68-1286-4895-80f0-ab83f025d019.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d095d68e-2311-4bf8-90c6-dd1079188d67.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/721de8e4-3069-45ae-a537-8f8cc9c0f957.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "FREQUENT QUESTIONS AND ANSWERS Q: Does it have built-in GPS? A: At present, this 2K dash camera does not have GPS. Please carefully read the product description on Amazon's website when purchasing. Q: Why does this dash camera suddenly turn on and then shut down when the car engine is turned off and the doors are opened/closed? A: This is because you have activated the parking mode. When the car is turned off and in the parking state, the vibration of opening/closing the car door is recognized as a car collision. This will automatically turn on and record emergency videos before turning off. If you really don't like this, we suggest that you turn off the parking mode. However, please note that if parking mode is turned off, once your car is hit during parking, it will not automatically start up to retain important evidence. Q: Does the package include the front snd rear dash camera? Does the dashcam have an inside camera? A:Yes, currently this 2K dash cam comes with the front and rear dashcam. Please be particularly careful not to include the inside camera. Please carefully read the packaging description of this 2K dash cam with wifi on Amazon's website when purchasing. Q: Why is the suction cup mount not sticky? How can I install and fix it to the windshield? A:This suction cup mount itself is not sticky and is mainly fixed to the windshield by turning the twist knob of the suction cup mount to \"lock\". If you still do not understand how to fix the suction cup mount, please refer to the manual. Q: Do I have to connect to WiFi to use and operate this 2K+720P dash cam? A:No, absolutely not, this dashcam can connect to the app via wifi to play back videos and manage settings. When the dashcam is in normal recording state, the blue indicator flashes once per second to indicate that it is recording. You can play back the video directly on the dashcam, or insert the card of the dashcam into the card reader and then connect it to a PC to play back the video. Q:Does this 2K dash cam with wifi require the purchase of additional hardware? A: No, absolutely not. This 2K dash cam with WiFi does not require the purchase of additional hardware kits to support parking mode. In fact, this dash cam comes with parking monitor (default off). If you want to turn on parking mode, you need to click the menu button when the dash cam is stopped recording and go to the settings to find [Parking Monitor] to turn it on. Some friends may have been prompted by the app's settings to purchase additional hardware for parking mode, but in reality, it is not necessary. We will fix this error in the app in the near future.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4bc31c3c-c513-4272-884c-a13f3124b9c3.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7d7042e1-0eb6-43d8-bb26-40408ed45464.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/67b5cb97-5f3a-4ee1-a2ae-cd69d66d501f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a95124bd-0ace-41ae-8b5a-b71e0b4d2a2e.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/165b37be-6e0d-41f9-a796-6d279cdfe16b.__CR185,0,600,300_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36e6492c-d3ab-4d65-a9ff-5cd428318664.__CR0,0,1024,1024_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dee0a6a4-865a-4cfc-b01d-21436fe936e4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1414e338-7ee1-4bde-90f5-209544975ebc.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de80ce68-1286-4895-80f0-ab83f025d019.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d095d68e-2311-4bf8-90c6-dd1079188d67.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/721de8e4-3069-45ae-a537-8f8cc9c0f957.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4bc31c3c-c513-4272-884c-a13f3124b9c3.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/165b37be-6e0d-41f9-a796-6d279cdfe16b.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Meranda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5P7HA2YM6G5K7UGODEKX3MJLJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMFIHDVCTHQLZ?ASIN=B0CSCJB6YY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Great",
                "reviewText": "Works great ! Quality is also great on it !",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}