{
    "remaining_requests": 6134,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Miden-S7-Dashcam-G-Sensor-Recording/dp/B0CNJZCZVD",
    "body": {
        "name": "S7 2.5K Dash Cam Front and Rear,64G SD Card,1600P+1080P FHD Dual Dash Camera for Cars,176°+160° Wide Angle,3.2'' IPS Screen Dashcam,G-Sensor,Loop Recording,WDR,Night Vision,24H Parking Monitor",
        "price": "$45.99$45.99",
        "originalPrice": "",
        "rawPrice": 45.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Miden-S7-Dashcam-G-Sensor-Recording/dp/B0CNJZCZVD",
        "soldBy": {
            "sellerID": "A2WZEVYCS09XRD",
            "name": "XQPOWERFUL INC.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2WZEVYCS09XRD&asin=B0CNJZCZVD&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 20% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41OKYVhDj2L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/5149eUqLVBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VfLVbkDbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QH-HqLg5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oHdu5T5aL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51MKI2ITPxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71YHwmbAPuL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b32cb617-815d-41dd-901e-7eb593589c1b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98e71d76-e1cf-402f-9160-ebd1b1e135ba/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d0b3931-4fe3-4bee-9948-828129635777/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Miden Store",
            "link": "https://www.amazon.com/stores/Miden/page/99A16FAF-D666-4ED5-A66A-DBF84FA607E6?ref_=ast_bln"
        },
        "brand": "Miden",
        "merchantInfo": "XQPOWERFUL INC.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 271,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Sunday, February 18. Order within 3 hrs 44 mins",
            "FREE pickup Wednesday, February 21",
            "Or fastest pickup Sunday, February 18. Order within 3 hrs 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【2.5K+1080P FHD & 336°Wide Angle Dual Recording】-Miden brings you the S7 dash cam front and rear, which can record Ultra HD 2.5K (2560 x 1600P) front video + FHD 1080P rear video. It can help you read key details such as road signs and vehicle license plates more clearly, bringing you better driving pleasure and better security. This car camera is equipped with a 176° wide-angle front camera and a 160° wide-angle waterproof rear camera, recording everything without dead angle.",
            "【3.2 Inch IPS Screen & Aluminum Alloy Case】-The large 3.2-inch full HD screen provides you with the clearest experience. The user interface on the large screen is very clear and it is very easy to operate and navigate the menus. At the same time, this dashcam is made of professional aviation aluminum alloy material. Compared with the plastic material of most sellers, our product not only has excellent texture, but also has a very good heat dissipation effect.",
            "【Loop Recording & Evidence Protection】-Even if the micro SD card is full, the dash cam will continue to record, automatically overwrite the oldest video with the latest video, and ensure that the locked video is not overwritten. Moreover, We have solved the problem that most of the dashcams of the sellers have time intervals and key missing frames in the recorded video. By slicing the video, we can realize the seamless connection between the looped video and better preserve the video evidence.",
            "【3-Axis G-Sensor & Accident Lock】-Our car camera has a high-performance G-sensor, and the sensitivity is further optimized, which can automatically record emergency situations and save the video. When the vehicle collides, the driving recorder will automatically save and lock the current video as evidence. Besides that, press the lock button to manually lock the current video, especially if you see something interesting/important on the road can also lock the footage.",
            "【Super Night Vision & Parking Monitor】-Our car camera features a f1.5 aperture, the industry's largest 1/2.7'' CMOS image sensor and WDR technology for better color accuracy and clarity. Whether it is day or night, it can clearly capture small details such as night driving and license plates. If your vehicle crashes while parked, or someone tries to steal your car, the car camera will automatically turn on and start recording when it detects the vibration,providing 24h protection for your car.",
            "【Easy to Install & Super After-Sales】-Our dash camera for cars adopts a Innovative and minimalist design, which will not block your sight when driving, allowing you to enjoy a comfortable driving experience. It's easy to install and set up, we additionally provide a wiring crowbar and detailed instructions, even first-time users don't have to worry. Miden also provides 10 years free warranty and lifetime professional technical support. If you have any questions, please feel free to contact us.",
            "【Free USB Reader & Best Cost-Effective】-In order to make it easier for you to read the video on the Micro SD card, we have added an additional USB card reader (The use of USB card reader will be more convenient than Type-C cable for data transfer). Our dash cam not only integrates all mainstream technologies, but also carries the highest grade Sony STARVIS IMX498 CMOS. And we provide you with an free 64G SD card, which can meet all your needs and give you the best cost-effective experience."
        ],
        "description": "Three Operating Modes 1. Video Recording Mode Connect the car charger and turn it on, the car camera will automatically enter the recording mode and start recording, the video resolution can reach 2.5K. 2. Photo Taking Mode Turn on the dash cam, press the mode button to switch to photo mode, then press OK to take a photo, and it can take HD photos up to 12MP. 3. Playback Mode This mode allows you to play recorded videos or view photos, and switch the video of the rear camera by long pressing UP button for 3 sec. ✔️Specification: Video Resolution: Front 2.5K/ Rear1080P Photo Resolution: 12MP Screen: 3.2\" IPS Screen Wide Angle Lens：Front176°/ Rear160° Provide Free SD Card：64GB 3-Axis G-Sensor & Motion detection & Seamless Loop Recording WDR/HDR Technology & Super Night Vision",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Car & Vehicle Electronics",
                "link": "https://www.amazon.com/Vehicle-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3248684011"
            },
            {
                "name": "Car Electronics",
                "link": "https://www.amazon.com/Car-Electronics/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1077068"
            },
            {
                "name": "Car Video",
                "link": "https://www.amazon.com/Car-Video-Audio-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10980521"
            },
            {
                "name": "On-Dash Cameras",
                "link": "https://www.amazon.com/Car-On-Dash-Mounted-Video/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3248689011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "4 x 1.5 x 2 inches"
            },
            {
                "name": "Item Weight",
                "value": "14.9 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CNJZCZVD"
            },
            {
                "name": "Item model number",
                "value": "S7"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 271 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#561 in Electronics (See Top 100 in Electronics) #4 in Car On-Dash Mounted Cameras"
            },
            {
                "name": "Date First Available",
                "value": "November 30, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "Miden"
            },
            {
                "name": "Brand",
                "value": "Miden"
            },
            {
                "name": "Model Name",
                "value": "S7"
            },
            {
                "name": "Orientation",
                "value": "Front and Rear"
            },
            {
                "name": "Vehicle Service Type",
                "value": "Cars, Trucks, RVs, Daily Cars"
            },
            {
                "name": "Connectivity Technology",
                "value": "Type-C"
            },
            {
                "name": "Special Feature",
                "value": "2.5K Front and Rear Dual Cam, Free Customized High-Speed 64G SD Card, Type-C Port, Reversing Image Assist, Dual Parking Mode Feature, Super Infrared Night Vision,F1.5 Super Aperture,Sony IMX498 Sensor, 336° Super Wide Angle, Loop Recording, 3-Axis G-Sensor, WDR & HDR See more"
            },
            {
                "name": "Video Capture Resolution",
                "value": "1600p"
            },
            {
                "name": "Included Components",
                "value": "1 x MIDEN 2.5K Dash Cam+1080P Rear Camera, 1 x 64GB SD card, 1×USB SD Card Reader, 1 x Suction Mount, 1 x Charging Cable, 1 x Car Charger, 1 x Wiring Crowbar, 1 x Type-C Data Cable, 1 x User Manual See more"
            },
            {
                "name": "Mounting Type",
                "value": "Windshield Mount"
            },
            {
                "name": "Color",
                "value": "Space Black"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "MIDEN 2.5K dual recording dash cam, your driving safety guardian! ✔️MIDEN S7 is the most advanced and powerful 2.5K dual-recording dashcam today, with Novatek fast processor、SONY STARVIS IMX498 ultra-low light sensor、F1.5 large aperture and 8 glass wide-angle lens. ✔️The hardware is engineered to deliver crisp 2.5K video not only during the day, but also at night with its ultra-low light Sony STARVIS Sensor and Super Night Vision technology. ✔️It will get you out of trouble when you need evidence. When you are traveling by car, it will capture the scenery along the way for you. Whether it's design, features or accessories, we are committed to creating the highest quality car cameras. · Why Choose US? ✔️In addition to the most advanced and powerful hardware configuration we described above, and with a slim and compact design and unique aerospace aluminum housing, we give you the best experience in the industry in terms of user experience, video quality, product features, product texture. ✔️Strict quality control, with a professional QC team, passed CE, FCC and RoHS and other certifications. ✔️Perfect after-sales service: MIDEN provides 10 years free technical maintenance, and subsequent firmware updates and continuous improvement of new functions.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c57dab5a-e11e-4430-a608-0041ad831f01.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "360° Rotatable Lens Package List: 1 * 2.5K+1080P Dash Cam Front And Rear1 * 64GB SD Card1 * USB SD Card Reader1 * Suction Mount1 * Car Charger1 * Wiring Crowbar1 * Type-C data cable1 * User Manual ✔️Exclusive Configuration Advanced Reversing Image Assist Dual Parking Mode Feature F1.5 Super Aperture Sony IMX498 Senso Aviation-grade Aluminum Alloy Case Three Operating Modes 1. Video Recording Mode Connect the car charger and turn it on, the car camera will automatically enter the recording mode and start recording, the video resolution can reach 2.5K. 2. Photo Taking Mode Turn on the dash cam, press the mode button to switch to photo mode, then press OK to take a photo, and it can take HD photos up to 12MP. 3. Playback Mode This mode allows you to play recorded videos or view photos, and switch the video of the rear camera by long pressing UP button for 3 sec. ✔️Specification: Video Resolution: Front 2.5K/ Rear1080P Photo Resolution: 12MP Screen: 3.2\" IPS Screen Wide Angle Lens：Front176°/ Rear160° Provide Free SD Card：64GB 3-Axis G-Sensor & Motion detection & Seamless Loop Recording WDR/HDR Technology & Super Night Vision",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/777cbee4-41e0-4c64-a38f-5d0f2d6d44b1.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cbd3fca3-79a5-4058-ae1a-bd838cc38efe.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Proficient in technology, Dedicated to safety! 2.5K+1080P FHD Resolution Our dash cam front and rear is equipped with high-performance Novatek chipset and SONY IMX498 Sensor, providing smooth 2.5K front video + 1080P rear video. It can vividly capture your driving moments, provide clearer video and images and playback key moments even at high speeds. 336° Wide Angle Lens S7 is a two-channel dash cam that provides 176° front camera and 160° rear camera, it can monitor the front and rear of the vehicle at the same time. Whether you want to capture the license plate number of the car ahead, or an important event happening to the side, it makes it easy. Built In 3-Axis G-Sensor Built-in G-sensor, the dashcam S7 can detect shaking and collisions around the vehicle, at which point it will lock the current video, store it on SD, and prevent it from being overwritten. Timely record the video during the accident, so that your safety and legal rights are always protected. The sensitivity of G-Sensor can be changed through settings.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8ee05ef8-7ed4-410c-953b-9b1810e9b1c1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8da3b00a-4a06-4268-b00b-e1a0503bd5f9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5e13e7a-70d9-46af-827f-9c868e1a5fc6.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Seamless Loop Recording Our dashcams for cars has a loop recording function, even if the micro SD card is full, it will automatically overwrite the oldest recording with the latest recording. But locked videos will not be overwritten. We provide you with a large-capacity high-speed read-write 64GB SD card, so that every second of your driving moment can be recorded without missing a second. Superior Night Vision With its SONY STARVIS IMX498 Sensor, F1.5 large aperture, and 8 pieces of glass, the S7 dashcam can capture all details with ultra-low light even in the dark. At the same time, the WDR algorithm automatically adjusts the optimal exposure balance, no more annoying overexposure and underexposure, ensuring better image quality and more natural details when driving at night. Unique Dual Parking Mode Feature Unlike any other dash cams, S7 dashcam has two distinct parking mode features. 1) Internal Battery Parking Mode No additional accessories needed. When parking monitoring is triggered, the camera automatically turns on and records a video to capture every detail. 2) 24h Parking Mode With an additional 3-Lead hardwire kit, 24-hour parking monitoring can be ensured for the dash cam.(3-Lead accessory is not included in the package).",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1701b9d3-fb3b-4f09-981a-7732806e8638.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/96c84551-c0f0-4e07-9e40-fcb669894ad9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/39979400-e02d-4f44-a1cb-662b0f0f717d.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Unique features for you Rear Camera & Reversing Image Assist The rear camera can be installed on the rear window or above the license plate, and it is IP69 waterproof, so you don’t have to worry about the rear camera installed on the license plate being damaged by rain. Not only can you get a clear 1080P FHD rear video as evidence of a rear-end collision, but also realize the reversing image function, making your parking safer and more convenient. Unique Screen Saver The screen saver feature allows your camera to automatically enter screen saver mode after 1/2/3 minutes, while it continuously records video in the background to ensure you can concentrate on driving. If you need to adjust the time to enter the screen saver mode, or keep the camera screen on all the time, you can do it in the system settings menu. Easy To Transmit You can use our gifted USB card reader to play or back up video and picture files in the Micro SD card, which will be more convenient and faster. Of course, you can also use the included Type-C data cable to connect to PC/MAC to play or back up video and picture files.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/feb71205-ea2f-4bd3-88fe-1e0e24171586.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bef296c5-d34b-4cda-8c6f-fc37cd785f6f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a52d4d7b-048e-4f33-9913-fc285b07d32c.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Exclusive services for our clients 1. If you need to use the 24h parking monitoring function, you need to connect the Dash Cam to an external power supply. ✔️3-Lead Hardware Kit is required here, which is not included in the package. And all the sellers of the dashcam do not provide this accessory, but you can contact the after-sales mailbox in our manual, and we will help you solve it. 2. Because some brands of new cars do not have a cigarette lighter, but now the dash cam industry generally uses a cigarette lighter as a charging port, because it is more stable. ✔️In order to solve the problem of no cigarette lighter, you can contact our after-sales mailbox on the manual, we will give you a solution. · Warm Tips: 1. A high-speed 64G SD card we presented as a gift, which is specially customized by a cooperative manufacturer, has been placed in the package. And please format it when first use: Find the option of “Format” in dashcam and click “OK” button. 2. Our S7 dashcam are made of aircraft-grade aluminum alloy, which is not only resistant to high temperature but also to low temperature, maintaining good stability and durability even in harsh environments. Working Environment: Operating Temprature: -31°F (-35°C) ~ 176°F (80°C); Working Humidity: 5-95% 3. Without connecting the car charger, even if the battery of dash cam is fully charged, it will turn off automatically within 1 minute. It's not a battery problem, it's an automatic shutdown set by the system to save power for the purpose of recording video in emergency. All dash cams on the market are like this, please don't worry about the battery. ✔️Please always keep the dash cam plugged into the car's cigarette lighter to achieve the continuous operation of the dash cam. 4. Before inserting or removing the micro SD card, please be sure to turn off the power of the dashcam to avoid data loss. 5. When you need to access the menu settings, first press the OK button to stop video recording. 6. When you turn the car's engine ignition on/off, the S7 car camera will automatically turn on/off, which is a normal phenomenon. But if the dashcam keeps turning off and on, check if the adapter is connected well or try a new one. Then format the micro SD Card and restore factory settings in the menu.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83b9719d-38a1-4f98-b392-9f021f8c538b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c57dab5a-e11e-4430-a608-0041ad831f01.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/777cbee4-41e0-4c64-a38f-5d0f2d6d44b1.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cbd3fca3-79a5-4058-ae1a-bd838cc38efe.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8ee05ef8-7ed4-410c-953b-9b1810e9b1c1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8da3b00a-4a06-4268-b00b-e1a0503bd5f9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5e13e7a-70d9-46af-827f-9c868e1a5fc6.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1701b9d3-fb3b-4f09-981a-7732806e8638.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/96c84551-c0f0-4e07-9e40-fcb669894ad9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/39979400-e02d-4f44-a1cb-662b0f0f717d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/feb71205-ea2f-4bd3-88fe-1e0e24171586.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bef296c5-d34b-4cda-8c6f-fc37cd785f6f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a52d4d7b-048e-4f33-9913-fc285b07d32c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83b9719d-38a1-4f98-b392-9f021f8c538b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "KABIL ALIKABIL ALI",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPLDR6IJ335FA2UKJ6HFH76TH2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WFG4M9AZT0IC?ASIN=B0CNJZCZVD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Exactly what I wanted for my Car!",
                "reviewText": "The media could not be loaded. The MIDEN 2.5K Dash Cam has truly exceeded my expectations. The video quality is exceptional, capturing sharp and detailed footage on the road. Its 2.5K resolution ensures clarity, even in challenging lighting conditions. The wide-angle lens provides an expansive view, covering multiple lanes and enhancing overall safety.Installation was a breeze, and the compact design doesn't obstruct my view while driving. And it looks amazing next to my Uniden R7. The dash cam's seamless loop recording feature ensures I never miss a moment, automatically overwriting older footage. The built-in G-sensor adds an extra layer of protection by automatically saving recordings during sudden impacts or collisions.What sets this dash cam apart is its user-friendly interface and intuitive controls. It has tons of options in the settings. Navigating through settings is straightforward, and the included manual offers clear instructions. It also comes with a 64gb microSD, USB SD Card Reader. The device's durability and reliability have instilled confidence in its long-term performance.Additionally, the parking mode feature is a game-changer for monitoring my vehicle when parked. The product's build quality feels robust, and the suction cup mount securely attaches to the windshield.Overall, the MIDEN 2.5K Dash Cam is a stellar investment for anyone seeking a high-quality, feature-rich solution for their driving safety needs. I highly recommend it for its impressive performance and ease of use. If you’re in the market for a Dash Cam, look no further.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61LOUtI5mtL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61N9-7+CCXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71WfDoeKgsL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e584308a-7964-47fc-bb4e-217a5b96b487/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Don",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEV2ZSBG7RW3WBTSIYYK77USYXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUQICGOX205MR?ASIN=B0CNJZCZVD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars great camera at a good price",
                "reviewText": "I was waiting for few weeks to see how the camera works at different conditions before I could write this review. The installation process was easy, and I was able to get it running less time. The 64GB SD card is one less pain and that is quite thoughtful addition.Very easy camera to use, video quality and audio is good.This dash cam offers far greater value compared to other dash cam in the market.So far it has been performing well.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shop1888",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHOJIBIAASKFOZ726VC2OZI2ASA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BXSTP7CJ81WT?ASIN=B0CNJZCZVD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars So far so good!",
                "reviewText": "I recently purchased the MIDEN 2.5K Dash Cam Front and Rear, and I must say it is a well-made device with a good price. The quality of the footage is impressive, with crystal clear visuals thanks to its 1600P+1080P FHD Dual Dash Camera. The 3.2'' IPS screen provides a clear and vibrant display, making it easier to review recordings on the go.The installation process was a breeze, and I was up and running in no time. The included 64GB SD card offers ample storage space for all my recordings, ensuring that I won't miss any important moments while on the road.Overall, I am highly satisfied with this dash cam. If you're looking for a reliable and affordable dash cam with easy installation, I would definitely recommend giving this one a try. I will post the durability of this dash cam in a few months.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason YangJason Yang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPXXGFUWK5HQUETSHWQNB3JCP3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROGIB10R9J78D?ASIN=B0CNJZCZVD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Great dash cam",
                "reviewText": "This compact camera is fantastic – it's plug-and-play, boasts user-friendly navigation for settings, and comes with excellent features like a parking monitor, shock sensor, and night vision. Additionally, it includes a rear-facing camera that can be mounted in any preferred location. With seamless usability, good video quality, and clear audio, it's truly a great little camera.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712iQ4wac-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "GolferGolfer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE33E6EO2VEDXKQ4EWH2HWQ26IKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QHSC1N0V2IV0?ASIN=B0CNJZCZVD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Solid performance, great value",
                "reviewText": "I recently saw a video on youtube that showed an accident that happened where neither party admitted they were at fault. Luckily for one driver, he had a dashcam that recorded the accident and it was clear that the other driver ran a red light. Without the dashcam, it would have been more difficult to prove who was at fault. I feel like I didn't want to chance something like this happening to me so I started researching dashcams.There are many models and features to choose from. I mainly wanted something easy to use and the video quality that will be high enough quality to tell what happened in case of an accident.Setting up the camera is pretty easy, just plug it into the cigarette lighter 12V outlet and it starts recording. Of course, I wanted to hide the wires, so I used the little tool provided to wedge the wires in the upholstery of the car. It looks pretty clean and professional. It took me about 45 minutes to install the rear camera and hide all the wires.There are many options including automatic HDR, G sensor, and time date stamp.Here's my take:Pros:1. Includes front and rear video cameras2. Large easy to see screen3. Quality mounting hardware - the suction cup is especially of nice quality4. Includes everything needed to install and hide the wires.5. Good image quality for the front camera 1600p6. Includes 64GB memory card7. Very good price for the quality of the cameraCons:1. The rear camera resolution is 1080p. This is pretty standard in most dual camera dashcams but something to keep in mind.2. Can't speak to the longevity since I've only had this for a short timeTLDR - If you're looking for a best bang for the buck front and rear dashcam, you can't beat this one.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/613eOgtpPEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/619--9+B46L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Gn+S6jyvL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61kVF1Km9WL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71FFvwwWZvL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ZZiZ3is4L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$49.99",
                "sellerName": "RUIGE-US Store",
                "sellerRating": "5"
            },
            {
                "price": "$59.99",
                "sellerName": "MIden",
                "sellerRating": "4.5"
            }
        ]
    }
}