{
    "remaining_requests": 6063,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Channel-Adjustable-Recording-G-Sensor-Parking/dp/B0B995V4XM",
    "body": {
        "name": "iiwey T1-pro Dash Cam Front and Rear Inside 3 Channel 1080P, Adjustable Lens Dash Camera for Cars with 8 IR Lamps Night Vision, Three Ways Triple Car Camera, Loop Recording, G-Sensor, Parking Monitor",
        "price": "$79.99",
        "originalPrice": "$99.99",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Channel-Adjustable-Recording-G-Sensor-Parking/dp/B0B995V4XM",
        "soldBy": {
            "sellerID": "AWNEZZ3TORI83",
            "name": "TIANDEHU",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AWNEZZ3TORI83&asin=B0B995V4XM&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BKYC6DTH"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 20% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41O5gf fbKL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51iNj5M3WSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51piRcXQwyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Gew 0UeyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515xOUWeSvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41X8aBCrZfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91QPrlylwqL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73df0d32-79cb-4ceb-b7ac-caa188274057/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the IIWEY Store",
            "link": "https://www.amazon.com/stores/iiwey/page/DBC77C5A-3FBD-4319-AEDD-E45AD7D63061?ref_=ast_bln"
        },
        "brand": "iiwey",
        "merchantInfo": "TIANDEHU",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1439,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Sunday, February 18. Order within 1 hr 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Adjustable Triple Lens】T1-pro dash cam provides three channels recording simultaneously. Thanks to the switchable lens, three lens can be used to record “front inside and rear” OR “left right and rear”, which can be chosen by yourself. Both left and right channels have 170°wide degree, all of the details being captured plus the 140°rear camera.",
            "【Superior Night Vision with 8 IR Lamp】The left and right camera both has 4 IR lamps. Equipped with F1.8 aperture and Upgraded sensor, dash cam can ensure super clear image at night. Even it’s totally dark, it will show the image (In black and white mode). Protect your car at any time. A good choice for Uber, Taxi driver",
            "【Dual 1080P with Upgraded Sensor】Upgraded Novatek chipset and Upgraded Sensor, which can support the videos record 1080P left + 1080P right + VGA rear simultaneously. 3 videos will display on the screen at the same time, providing the whole views around the car.",
            "【Loop-recording and Auto Lock Collision Videos】The dash cam will simultaneously record, the newest video will replace the oldest one(Locked video will not be replaced). Built in G-sensor function, the dash cam can lock the video automatically when there is an emergency situation (Like collision or crash). Also, you can lock the videos manually if you think it’s important.",
            "【Brilliant Parking Monitoring】When you park the car, the camera lens can adjust to left and right view. It will provide the side view of car, no worry your car will be scratched on the side. The dash cam automatically powers on (Three cameras will turn on together) and starts recording, thus providing you a video evidence if your car is scratched by someone in parking. We recommend to use the hard wire kit (Asin: B07Q29JZZY) installing your dash cam to make the dash cam 24 hours working for you.",
            "【Note】T1-pro dash cam supports 32GB-128GB SD card. The SD card needs to purchase separately. Recommend to buy Class 10 U3 speed memory card. The rear camera is 6 meters long, which can fit for most of the cars, if you have a long car, then you can buy the extension cable(asin:B091C5K47J)",
            "【Worry-Free After Sale】We provide 12 months warranty and 30 days money back. If you have any questions regarding your product, please do not hesitate to contact us at customer care email, or drop us a message through the message chat box in amazon, we will respond immediately."
        ],
        "description": "T1-pro with Adjustable Three Channel iiwey T1-pro provides three channels adjustable lens. Three channels wil record at the same time. You can use the left and right channel as you like, records the side ways or front and inside the car. No worry antthing will missing. Also, 8 special IR lamps help the dash cam can record at dark night. It will show black and white videos for you when there is totally no light. Three Adjustable Lens 8 IR Lamps Night Vision G-sensor Parking Monitoring Loop Recording",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Car & Vehicle Electronics",
                "link": "https://www.amazon.com/Vehicle-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3248684011"
            },
            {
                "name": "Car Electronics",
                "link": "https://www.amazon.com/Car-Electronics/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1077068"
            },
            {
                "name": "Car Video",
                "link": "https://www.amazon.com/Car-Video-Audio-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10980521"
            },
            {
                "name": "On-Dash Cameras",
                "link": "https://www.amazon.com/Car-On-Dash-Mounted-Video/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3248689011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "0.8 x 2.3 x 1.2 inches"
            },
            {
                "name": "Item Weight",
                "value": "15.2 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0B995V4XM"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,439 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,430 in Electronics (See Top 100 in Electronics) #48 in Car On-Dash Mounted Cameras"
            },
            {
                "name": "Connectivity technologies",
                "value": "USB"
            },
            {
                "name": "Special features",
                "value": "Loop Recording, G-Sensor, Night Vision"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Whats in the box",
                "value": "dash cam, car charger, rear camera, suction mount"
            },
            {
                "name": "Manufacturer",
                "value": "iiwey"
            },
            {
                "name": "Date First Available",
                "value": "August 11, 2022"
            },
            {
                "name": "Brand",
                "value": "IIWEY"
            },
            {
                "name": "Orientation",
                "value": "Front and Rear"
            },
            {
                "name": "Vehicle Service Type",
                "value": "Car"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Special Feature",
                "value": "Loop Recording, G-Sensor, Night Vision"
            },
            {
                "name": "Video Capture Resolution",
                "value": "1080p"
            },
            {
                "name": "Included Components",
                "value": "dash cam, car charger, rear camera, suction mount"
            },
            {
                "name": "Mounting Type",
                "value": "Suction Mount"
            },
            {
                "name": "Field Of View",
                "value": "180 Degrees"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Safe Driving From Now On! iiwey is a brand specialized in dash cam for 12 years. And we will provide the best value dash cam for the world wide customers. Safe driving is our pursue. 200mA Battery in Equipped 2 Inch IPS Screen Advanced Image Sensor Noveteck Chip T1-pro with Adjustable Three Channel iiwey T1-pro provides three channels adjustable lens. Three channels wil record at the same time. You can use the left and right channel as you like, records the side ways or front and inside the car. No worry antthing will missing. Also, 8 special IR lamps help the dash cam can record at dark night. It will show black and white videos for you when there is totally no light. Three Adjustable Lens 8 IR Lamps Night Vision G-sensor Parking Monitoring Loop Recording",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7d4326ec-cf8d-4708-9f65-94bac2aa3780.__CR0,0,300,400_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/132fffd0-dbb7-47fb-9ce9-5d3c0e820c99.__CR0,0,350,175_PT0_SX350_V1___.png"
                ]
            },
            {
                "media_text": "WDR Function WDR balances lightness and darkness, so the T1-pro dash camera will capture a richer colors images, this function also greatly improves the video. Combine with 8 IR lamps, the T1-pro can capture the best videos at night. Waterproof Rear Camera This triple lens dash cam comes with a waterproof rear camera, which has 4 LED lights. It's IPX7 waterproof, so no worry with the rain. If you have a long car, you can buy an extension cable(asin:B091C5K47J) Advanced Sensor 6 glasses lens will help record better videos. Not like other plastic lens, the real 6 glasses lens will have much better light transmission. Clearer with the videos quality.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/27bcf521-cbdc-4ade-98a9-0213809ab873.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/63d8afab-af4a-4f9d-b232-39460cf8bdee.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/86d2ef0b-2df1-4183-9a24-a8c8cc8f2a1c.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30240a79-1290-4bc7-93a3-38444edb783e.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4bcd0046-6ed2-4d2b-8229-e06453e53bc8.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64993802-2deb-4ba5-bab8-bb0759af0f06.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7d4326ec-cf8d-4708-9f65-94bac2aa3780.__CR0,0,300,400_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/132fffd0-dbb7-47fb-9ce9-5d3c0e820c99.__CR0,0,350,175_PT0_SX350_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/27bcf521-cbdc-4ade-98a9-0213809ab873.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/63d8afab-af4a-4f9d-b232-39460cf8bdee.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/86d2ef0b-2df1-4183-9a24-a8c8cc8f2a1c.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6f3b3eda-3fcc-4922-a087-20a2ab99d685.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Daniel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEBRZNJI3CCXDMM6BCFUEWZC23Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMWEJT31AFP55?ASIN=B0B995V4XM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Fantastic Dash Cam",
                "reviewText": "First and foremost, the video quality is outstanding. The crystal-clear recordings capture every detail on the road, from license plates to street signs. Even in low-light conditions, the camera's advanced sensor technology ensures that the footage remains sharp and clear.Installation was a breeze. The adhesive mount securely holds the camera in place on my windshield, and the compact design doesn't obstruct my view at all. It's great to have a device that's so easy to set up without any complicated wiring or intricate installation procedures.One feature that really stands out is the built-in GPS. Not only does it log my speed and location, but it also provides an extra layer of evidence in case of an incident. The G-sensor is a game-changer too – it automatically locks and protects footage when it detects sudden movements or impacts, ensuring that crucial evidence is never lost.I was pleasantly surprised by the camera's user-friendly interface. Navigating through settings and reviewing footage is intuitive and hassle-free. Plus, the companion smartphone app makes it incredibly convenient to view and share recordings on the go.The loop recording feature is a lifesaver. I never have to worry about running out of storage space, as the camera automatically overwrites the oldest files when the memory card is full. This means I can keep recording without constantly managing the storage.Lastly, I can't ignore the peace of mind this dash camera gives me. Knowing that I have a reliable witness for any unforeseen incidents on the road is priceless. I feel safer and more confident while driving, especially during long trips or in busy city traffic.Overall, I can't recommend this dash camera enough. It's packed with features that not only enhance my driving experience but also provide essential security and accountability. If you're looking for a top-notch dash camera that combines superior video quality, user-friendly features, and easy installation, this is the one to go for!",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lenny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4FLCLZ4PZM7INJ6LPKK7O7BGNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VVI6RWG84AC4?ASIN=B0B995V4XM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Love it so far!",
                "reviewText": "UPDATE:4-12-23I am writing to update my review.I was contacted by a representative for the company and they resolved my problem to my satisfaction. No jumping through hoops. Their customer service is top notch! The product so far has been great since getting the original issue resolved.I really love the way it works and starts recording when the car starts!The multiple angles that you can record at one time is awesome with the two cameras on the unit and then a third camera for the rear.I love how you can set the cameras to record in clips. I use 5 minute clips. I find this makes it pretty simple to review if needed.To this moment, I have not had any further issue's like I was having before working with the representative from the company that reached out.I will come back and update this review if issues come back.ThanksOriginal post below:I have tried to reach out to the warranty department and also find an email or phone number to talk to someone about the issues I am having before I left this review. Maybe someone will contact me here.I do not want to return camera because I drive daily and at least have it as a deterant for would be thieves.The issue I am having is I can get in the car and start it up and the camera comes on and starts recording. Then as I am driving, I notice the camera is still on, but stops recording!!!!The only way I can get it start recording again is to disconnect it from power and then turn it back on (which is dangerous while driving)But then that only seems to last for a short time before it stops again.It just started doing this all of the sudden.I work in IT so I have done troubleshooting. Including redoing the power connector, replaced the micro SD card, completely reset the camera and settings. Nothing has worked.I would also like to mention I am using premium Micro SD cards.I have formated them according to specs for the camera and am using the recommended size. As I said, this is a recent issue that just started happening and now won't resolve.I actually love the camera and the angles it records at, when it works.Hopefully the company will contact me and send a replacement or offer troubleshooting steps I've missed.Very disappointing.I am hoping the company will reach out to me with a resolution ASAP!Please help, I really don't want to return. I WILL if I have to. But might have to order a different brand that will atleast help their customers.Thank",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "c hendersonc henderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNB5XMUVIVSORU3ML7W6LX22OJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31T1Z2DIFJOUB?ASIN=B0B995V4XM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Easy install good size.",
                "reviewText": "Nice picture quality, easy to use. Good 1st or second cam. The are a lot cheap one out there. This is a better buy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61gZvF7JnuL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabbi Gutiérrez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 18, 2023",
                "reviewTitle": "No me gusto",
                "reviewText": "Es muy pequeño. La imagen dice que la graba en buena definición y la verdad ni se ve.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CanadaCanada",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 10, 2023",
                "reviewTitle": "Perfect for ride share drivers.",
                "reviewText": "This camera is literally amazing for the price.You literally get three cameras in one. This is an amazing tool for rideshare operators such as Lyft and Uber drivers.In the main camera assembly, there is both front and rear facing cameras. There is also an additional third auxiliary camera which can be installed in the rear of the vehicle to capture rear facing traffic, or you can easily install it in the backseat of your vehicle to capture customer interactions.And this way, it’s perfect for rideshare drivers because you could have one camera facing the road one camera facing yourself, and another camera facing your customers, providing you with a ultimate degree of video, surveillance and accountability to customers and your employer.This camera is super high-quality and has amazingly clear video. I also really liked that. It was very easy to install and comes with this neat little tucking tool, allowing you to easily conceal the wires behind the trim without having to pop off any of the trim and risk, breaking the little clips that secure it inside the cabin of the vehicle.I wish that it was sold with a memory card. I did have to supply my own, but ultimately for the price I still think it represents exceptional value.I’m very happy with this camera and will absolutely be recommending it to all of my friends that also operate as rideshare drivers and I am very happy to give this a five star review.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71V-Tw1WuRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81-vL2rtl3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71t0VAX-GqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "F. Sherwood",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 13, 2024",
                "reviewTitle": "It works really well",
                "reviewText": "Easy to install. Great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 23, 2023",
                "reviewTitle": "No cubre las caracteristicas",
                "reviewText": "No corresponde lo que te ofrecen, nunca se carga la Bateria, no graba en estacionamiento. Es muy pequeña",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EY",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 2, 2023",
                "reviewTitle": "Easy to use",
                "reviewText": "I was very impressed of this dash cam, it is definitely worth buying! The camera quality is great and it is very easy to install and set up. This dash cam is definitely worth the price, you get 3 in 1 which is definitely a MUST! I am very happy with this purchase and don't regret it at all.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$84.99",
                "sellerName": "Laizhang-US",
                "sellerRating": "4.5"
            }
        ]
    }
}