{
    "remaining_requests": 7031,
    "original_status": 301,
    "pc_status": 200,
    "url": "https://www.amazon.com/Coleman-Autoseal-FreeFlow-Stainless-Insulated/dp/B08TP4TF4Z",
    "body": {
        "name": "Coleman FreeFlow Vacuum-Insulated Stainless Steel Water Bottle with Leak-Proof Lid, 24oz/40oz Bottle with Button-Operated Lid & Carry Handle, Keeps Drinks Hot or Cold for Hours",
        "price": "$23.90 - $59.00",
        "originalPrice": "",
        "rawPrice": 23.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Coleman-Autoseal-FreeFlow-Stainless-Insulated/dp/B08TP4TF4Z",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B08TP4TF4Z"
        ],
        "asinVariationValues": [
            {
                "asin": "B076JLCN2D",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31ymBqyqkAL._SS36_.jpg"
            },
            {
                "asin": "B08T35Y7T7",
                "variationName": "Color",
                "variationValue": "Caribbean Sea",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31qJKqSIKXL._SS36_.jpg"
            },
            {
                "asin": "B08T316PJR",
                "variationName": "Color",
                "variationValue": "Spider Mum",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31gkanGlduL._SS36_.jpg"
            },
            {
                "asin": "B076JLCN2D",
                "variationName": "Size",
                "variationValue": "24 oz",
                "variationImageURL": null
            },
            {
                "asin": "B076JKLB3D",
                "variationName": "Size",
                "variationValue": "40 oz",
                "variationImageURL": null
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31ymBqyqkAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31deGjMBDIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Jj50kzSlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31x8WwQxVxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Gc12ETI6L.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Coleman Store",
            "link": "https://www.amazon.com/stores/Coleman/page/DC904E86-A9A2-4BC1-B1DA-89727F630A4D?ref_=ast_bln"
        },
        "brand": "Coleman",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 13727,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Durable, double-walled, vacuum-insulated 18/8 stainless steel bottle keeps drinks cold up to 31 hours or hot up to 11 hours",
            "High-flow spout allows you to hydrate quickly",
            "Button-operated AUTOSEAL feature seals the lid between Sips to eliminate spills and leaks, and a patented slide lock prevents the accidental pushing of the button while you're on the go",
            "Protective spout cover keeps dirt and germs off your mouthpiece, and dropdown lid feature makes it easy to clean",
            "100% BPA-free for Peace of mind",
            "This product contains Stainless Steel (Iron, Chromium, Nickel, Manganese), Styrene, Formaldehyde, Octamethylcyclotetrasiloxane"
        ],
        "description": "When it's high noon and you can feel the sun beating down on you, don't run back into the air conditioning - instead, reach for your AUTOSEAL Free Flow Stainless Steel Water Bottle. Made of double wall vacuum insulated 18/8 stainless steel, this Free Flow will keep your water cold and crisp for up to 58 hours with select models, even in the hottest temperatures. The Free Flow's spill-proof AUTOSEAL locking lid with its easy-to-clean Dropdown lid feature fits all sizes of our stainless steel bodies, and it even features a protective spout cover to help keep any dirt off your spout in case you drop it. And when the heat index is off the charts, you'll appreciate the Free Flow's high flow spout that allows you to refresh yourself quickly. With the AUTOSEAL Free Flow Stainless Steel Water Bottle by your side, the heat wave doesn't stand a chance.",
        "breadCrumbs": [
            {
                "name": "Sports & Outdoors",
                "link": "https://www.amazon.com/sports-outdoors/b?ie=UTF8&node=3375251"
            },
            {
                "name": "Sports & Outdoor Recreation Accessories",
                "link": "https://www.amazon.com/Sports-Accessories/b?ie=UTF8&node=3394801"
            },
            {
                "name": "Sports Water Bottles",
                "link": "https://www.amazon.com/Water-Bottles-Accessories-Sports-Outdoors/b?ie=UTF8&node=3395091"
            }
        ],
        "productInformation": [
            {
                "name": "Item Package Dimensions L x W x H",
                "value": "‎10.24 x 3.23 x 3.15 inches"
            },
            {
                "name": "Package Weight",
                "value": "‎0.42 Kilograms"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎3.76 x 3.05 x 10.5 inches"
            },
            {
                "name": "Item Weight",
                "value": "‎0.89 Pounds"
            },
            {
                "name": "Brand Name",
                "value": "‎Coleman"
            },
            {
                "name": "Model Name",
                "value": "‎2015761"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Material",
                "value": "‎Stainless Steel"
            },
            {
                "name": "Suggested Users",
                "value": "‎unisex-adult"
            },
            {
                "name": "Number of Items",
                "value": "‎1"
            },
            {
                "name": "Manufacturer",
                "value": "‎Coleman"
            },
            {
                "name": "Part Number",
                "value": "‎2015761"
            },
            {
                "name": "Included Components",
                "value": "‎Water Bottle"
            },
            {
                "name": "Size",
                "value": "‎24 oz"
            },
            {
                "name": "Sport Type",
                "value": "‎Multi-Sport"
            },
            {
                "name": "ASIN",
                "value": "B076JLCN2D"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 13,727 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,930 in Sports & Outdoors (See Top 100 in Sports & Outdoors) #148 in Water Bottles"
            },
            {
                "name": "Date First Available",
                "value": "October 18, 2017"
            },
            {
                "name": "Brand",
                "value": "Coleman"
            },
            {
                "name": "Capacity",
                "value": "1.5 Pounds"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gym"
            },
            {
                "name": "Special Feature",
                "value": "Double-walled"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mister ChiefMister Chief",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDT5P4BODWPSRGAVVTKAPNAC4XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22YRCTWY7TCGS?ASIN=B08TP4TF4Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Just buy it. It is *the best* bottle and spout you will ever find for the price.",
                "reviewText": "Most people will rate their purchases within the first few days or weeks of ownership. Unfortunately that doesn't reveal much about the longevity of the product being reviewed.My review for this is being shared after owning the 40oz bottle for almost 5 years.My opinion? You MUST buy this bottle. Nothing else will come close to the quality and longevity for the price.I use this bottle and spout literally every day. The spout mechanism is probably the best design I've ever seen. It's more complicated than most other lids/spouts out there, but dang, the engineers who designed this absolutely nailed it.It simply works and it doesn't leak (there are two caveats I will get to on this later) from the spout like pretty much every other water bottle I've owned. Even nearly 5 years later and a ton of abuse, this thing stays leak-free the majority of the time.The insulated metal body is also quite a rock star here. Hot drinks stay hot. Cold drinks stay cold. It's also incredibly durable as well.While most of the time, it's this bottle is used in relatively mundane environments like at home or office, both the bottle and cap/spout have proved to be exceptionally durable and have withstood *a lot* of abuse, such as being tossed in the back of military tactical vehicles where it bounces around, banging into everything. This bottle has also handled drops from less than 10 feet onto concrete and asphalt and drops greater than 10 feet onto softer surfaces such as gravel roads/dirt. Not just once either. It's handled such falls quite a number of times, with one falling lid first from about 5 feet when it was full 40oz of water.The metal body does not seem to care about falls. Heck, the paint barely seems to care either.As complicated as the spout mechanism is, it's very easy to clean with a dish brush and dish soap. The bottle says to hand-wash only, but I toss both it and the lid in the dishwasher and nothing bad seems to have happened. Your mileage may vary though.In terms of the occasional leaks, I've found this can happen from two different reasons. The first is not twisting the lid back on completely. If it's a bit lose, it will leak from the neck (this is a weird sounding sentence). The solution is to just make sure you tighten it more.The next leak area is the spout. I should preface by saying leaks from here have been *exceptionally* rare, at least for me.When it does happen, it's usually because the silicone seal isn't fully seated due to dirt or the button was pushed a small bit.The solution here is to make sure you keep the silicone seal clean and inspect it for damage whenever you clean it. If everything looks fine, but it still leaks, then the button might be slightly jammed open or the mechanism wasn't realigned properly. This will make more sense once you have it in your hands and look at everything.Another cause for leaks is if it's full of hot drinks (or if you fill it and then go onto an airplane). The steam and/or pressure change will pressurize everything. Normally this would improve the seal, but there have been cases where it leaked a little from some part of the bottle. The solution is to keep the bottle upright and release the pressure by pushing the button thing.Finally, in one of the pictures I posted, you can see the carry handle is broken and the spout cover lid is cracked. The cracked spout cover was caused by a 5 foot fall straight-straight down onto concrete while being filled with water. It only cracked the lid. The marks around the hinge were from me trying to remove the lid (to try replacing it, but I failed).The broken carry handle happened literally yesterday (from the day this review is being posted). The handle was up and it fell onto ceramic tile handle first. The bottle was full with water. I don't think anything except metal or TPU/rubber would have survived that impact. The fact this happened nearly 5 years after owning it, this sort of thing was bound to happen and can't be blamed on the build quality. It's also possible that cleaning everything in the dishwasher made it a bit more brittle over time. Who knows.So yes. This is a very long review that rates the product after 5 years of daily use. The conclusion is that it does exactly what it needs to do, is exceptionally durable, and all at a very good price.",
                "reviewVotes": "114 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41-zThWfuTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41BiD9v2QZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKTY6OAZBMG6SXZ5OOMP3R2F4PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B8BS07HU1ZMI?ASIN=B08TP4TF4Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2020",
                "reviewTitle": "5.0 out of 5 stars Where have you been my whole life?",
                "reviewText": "1.5 year update: This bottle is amazing. It saved my $1400 laptop. The bag with my laptop ended up under my car (don't ask), and I reversed right over it backing out of the driveway.If this super strong, thick bottle hadn't been in place to lift the car up a bit, it would instead have rolled directly over the corner of the laptop. However the laptop is unscathed and works perfectly.Unfortunately, the bottle did not survive the battle. But its sacrifice will not be forgotten and it has now officially cemented itself in my heart as the greatest water bottle I've ever owned.Sidenote: The ability to hold temperature has stayed consistent for the past year and a half I've owned it. Even the lid is fine, literally just as good as day one...minus the huge dent.Original review:I have owned MANY water bottles over the years, they serve me well but they all eventually break, usually some component of the lid snaps off or stops working. Between everywhere I take them and not always fitting in my car's cup holder they do take a beating, but that's the nature of the beast.I haven't had this one long yet but it's already my favorite I've ever owned. I only upgraded to the \"temperature holding\" bottles with a Yeti knockoff over a year ago and simply can never return to the normal plastic. The problem I've found is they are either too bulky to be convenient or they only have removable or coffee sip lids. I use these when I work out and on the go so can't be bothered to unscrew anything or sip lightly.I'm very impressed the amount of water you can get through this tiny lid using the magnetic seal, it has always been one of my biggest complaints with water bottles. Just push the button to drink, close and you have a leak proof bottle that keeps your water cold for at least 12 hours (haven't let it sit longer than that).It is fairly heavy but it is super solid. It also has a rubber bottom so you can set it down on glass surfaces softly AND it keeps it in placeBest of all, it fits in my car's cup holder. Success!I guess if it stops holding the temperature in 6 months or whatever like I've seen a few reviews mention I'll update but as of now, this thing is awesome and it's everything I've always wanted.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Auotocrosser",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWBV5MTO7EMONYT3GQQYG4VIXWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GKH4ZQJU0CFG?ASIN=B08TP4TF4Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Superior Design",
                "reviewText": "If you are tired of plastic drinking bottles, stop reading and get this Coleman stainless steel bottle. Keeps your stuff cold or hot. Does not leak. The locking feature is like a crossbolt safety on a firearm. Simply brilliant! I can stick this bottle in my bag or backpack and not worry about it leaking at all.It has a hook, a cap to keep the mouth clean, and push button to drink when you are ready. What else can you ask for? Enjoy!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 1, 2024",
                "reviewTitle": "dad-proof",
                "reviewText": "got this for my dad who likes to toss his water bottle around his work truck and so far it's been indestructible. he's had it since august and it's still going strong. excellent seal and he's a big fan of the autoseal mechanism because he doesn't have to worry about making sure the bottle is closed before tossing it in the backseat. well done coleman",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gilberto ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 3, 2023",
                "reviewTitle": "Recomendable 100%",
                "reviewText": "Muy buen producto, mantiene los líquidos calientes o fríos por mucho tiempo. Su sistema de cerrado sin problema, no derrama ninguna gota. Lo volvería a comprar...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cs",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 3, 2023",
                "reviewTitle": "Awesome Water bottle",
                "reviewText": "I love this colour and how it keeps my water cold for a long period of time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AlexandreVolpiAlexandreVolpi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 29, 2023",
                "reviewTitle": "Você recebe pelo o que paga",
                "reviewText": "Garrafa ótima, construção com aspecto premium. O preço é mais alto do que gostaríamos de pagar, mas ela entrega tudo o que se propõe. Não vaza uma gota se quer, a vazão de água é enorme e mantém gelada por muito tempo (não testei exatamente pois não deixo o líquido tanto tempo nela, acabo bebendo rápido).Meu modelo foi de 40oz, que da cerca de 1,2L , acaba sendo meio desajeitada por ser bem grande, porém poupa trabalho de ficar reenchendo. Deu até vontade de comprar uma de 24oz pra poder usar no carro, já que essa grande não cabe em nenhum porta-copo (tem uns 9cm de diâmetro). Pretendo testar futuramente com água quente para saber o tempo que mantém.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61zlKIGWulL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Oscar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 13, 2023",
                "reviewTitle": "Bueno",
                "reviewText": "Bueno",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}