{
    "remaining_requests": 47554,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/PHILIPS-34E1C5600HE-UltraWide-QHD-Built/dp/B0BQQ7H8TZ",
    "body": {
        "name": "PHILIPS 34E1C5600HE 34\" UltraWide QHD 21:9 Monitor with Built-in Windows Hello Webcam & Noise Canceling Mic, USB-C Docking, Stereo Speakers, 100Hz, 4-Year Advance Replacement",
        "price": "$351.64",
        "originalPrice": "$429.99",
        "rawPrice": 351.64,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/PHILIPS-34E1C5600HE-UltraWide-QHD-Built/dp/B0BQQ7H8TZ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CV5RFKNV"
        ],
        "asinVariationValues": [
            {
                "asin": "B07YPFBZZY",
                "variationName": "Size",
                "variationValue": "27\" Curved FHD",
                "price": "$129.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0C86M1RVD",
                "variationName": "Size",
                "variationValue": "27\" IPS Black 4K UHD | USB-C |Built in KVM",
                "price": "$399.99",
                "variationImageURL": ""
            },
            {
                "asin": "B083FJ8TSJ",
                "variationName": "Size",
                "variationValue": "32\" Curved FHD",
                "price": "$179.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07VLJPZDR",
                "variationName": "Size",
                "variationValue": "32\" Curved 4K UHD",
                "price": "$309.99",
                "variationImageURL": ""
            },
            {
                "asin": "B08KFSMGJ8",
                "variationName": "Size",
                "variationValue": "34\" Curved WQHD | USB-C",
                "price": "$349.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BQQ7H8TZ",
                "variationName": "Size",
                "variationValue": "34\" Curved WQHD | USB-C | Webcam",
                "price": "$351.64",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41PcPtsxPpL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41 XKVyqzeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41k3tyfWVnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51e3 b1i0tL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51r5mN 2wgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nL2RkJNqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ckMoIKKEL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Philips Computer Monitors Store",
            "link": "https://www.amazon.com/stores/PhilipsComputerMonitors/page/FBF8895D-E82B-4D86-A6D5-979430B390F6?ref_=ast_bln"
        },
        "brand": "PhilipsComputerMonitors",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4552,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 3 hrs 38 mins",
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 3 hrs 38 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "EXPAND YOUR HORIZONS: 3440 x1440 UltraWide QHD (WQHD) resolution with 21:9 aspect ratio for efficient productivity",
            "CURVED IMMERSION: The 1500R radius curved VA panel allows for more immersion and better color accuracy. It can also help alleviate eye strain during long hours of working",
            "RICH COLORS FOR WORK AND PLAY: Ultra Wide-Color technology produces true-to-life images and a wider spectrum of colors with sRBG 123.24%, NTSC 99.25% color gamut area coverage",
            "WINDOWS HELLO WEBCAM WITH NOISE-CANCELING MIC: Comes with built-in 5MP webcam, noise canceling microphone, and speakers, perfect for remote working. The webcam is equipped with advanced sensors for Windows Hello facial recognition, which conveniently logs you into your Windows devices in less than 2 seconds",
            "ONE CABLE IS ALL YOU NEED: USB-C docking transfers high-speed data, high-resolution video signal, and power to your laptop (up to 65W of Power Delivery support) via a single USB-C cable. Play and work in high resolution while simultaneously charging your notebook",
            "GAME-READY @ 100Hz: Fast 100Hz refresh rate lets you target moving opponents with precision, putting you ahead of the game. Adaptive-Sync technology ensures every frame will be rendered smoothly with crystal clarity and without stutter",
            "OPTIMIZE YOUR WORKSPACE: The built-in USB hub brings ease of use and practicality to your desk with 1x HDMI 2.0, 1x DisplayPort 1.2, 1x USB-C (DisplayPort Alt mode, data and Power Delivery), 1x USB 3.2 Gen 1 & 4x USB-A downstream (with 1 fast charge B.C 1.2)",
            "BUILT-IN STEREO SPEAKERS: Built-in 5W speakers make it easy to jump on a video conference with clients or collaborate with colleagues. Enjoy quality audio without the hassle of connecting external speakers for movies, games and more",
            "DESIGNED FOR YOUR WELLBEING: Philips monitors use LowBlue Mode to reduce harmful shortwave blue light. Flicker-free technology alleviates eye fatigue for more comfortable extended computing",
            "PEACE OF MIND: Philips monitors come with 4-Year Advance Replacement Coverage in the United States, minimizing downtime"
        ],
        "description": "Expand your horizons with the Philips 34E1C5600HE 34” UltraWide QHD Monitor. This monitor delivers CrystalClear UltraWide Quad HD 3440 x 1440 using high performance VA panels with 178/178 wide viewing angles for ultra-crisp images with brilliant details. Its UltraWide 21:9 format allows more room for increased productivity for side-by-side comparisons and larger spreadsheets. Ultra Wide-Color technology creates real-to-life colors with natural-looking greens, vivid reds, and deeper blues, letting you immerse yourself in work. The built-in 5MP webcam, noise-cancelling microphone, and dual 5-watt stereo speakers makes conference calls easy and efficient when working from home and for remote collaboration without the need for additional accessories. Windows Hello facial recognition uses advanced sensors for quick access and strong security. Whether you’re creating content, coding, designing, editing, or gaming, MultiView enables simultaneous dual connection and view so you can work on multiple devices for complex multitasking. The rich selection of ports includes a USB Dock and a USB-C port that supports up to 90 watts power delivery so you can fast charge your laptop, watch high-resolution video, power devices, or transfer files at super-speed with a single cable. With LowBlue mode and flicker-free technology, you can work and play with more comfort and efficiency. The ergonomic monitor is also tilt adjustable, VESA compatible and comes with 4-year advanced replacement coverage.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Monitors",
                "link": "https://www.amazon.com/Monitors-Computers-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1292115011"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎34 Inches"
            },
            {
                "name": "Screen Resolution",
                "value": "‎3440x1440"
            },
            {
                "name": "Max Screen Resolution",
                "value": "‎3440 x 1440 Pixels"
            },
            {
                "name": "Brand",
                "value": "Philips Computer Monitors"
            },
            {
                "name": "Series",
                "value": "‎Phillips Monitor 5000 series"
            },
            {
                "name": "Item model number",
                "value": "‎34E1C5600HE"
            },
            {
                "name": "Item Weight",
                "value": "‎15.75 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎4.4 x 31.8 x 15 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎4.4 x 31.8 x 15 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎Philips Computer Monitors"
            },
            {
                "name": "ASIN",
                "value": "‎B0BQQ7H8TZ"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎March 30, 2023"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 4,552 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,178 in Electronics (See Top 100 in Electronics) #134 in Computer Monitors"
            },
            {
                "name": "Screen Size",
                "value": "34 Inches"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "3440 x 1440 Pixels"
            },
            {
                "name": "Special Feature",
                "value": "Built-In Webcam, Height Adjustment, Ultrawide Screen, USB Hub, Built-In Speakers"
            },
            {
                "name": "Refresh Rate",
                "value": "100 Hz"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0386e24d-4dc9-418c-852f-b268632910d9.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a6d954d-4daf-4f8f-9fdc-ef37c627b22f.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee9dedc4-4496-4e6e-a483-eab4640427e3.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2a063636-1c18-4a2e-ae1c-9b23ba6f0a30.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30b5f690-085c-4957-b512-6bd676c778a1.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVYZLBADXTBIFSW63ZJOXLFFYKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ES3MK6158C8X?ASIN=B0BQQ7H8TZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars A Dual Monitor Dream",
                "reviewText": "The PHILIPS 328E1CA 32” Curved Monitor is a game-changer for anyone involved in video editing, remote work, and even light gaming. Having purchased one and been so impressed, I didn’t hesitate to buy a second for a dual monitor setup.The standout feature for me is the 4K UHD resolution. It brings an incredible level of detail and clarity that is essential for my video editing tasks. The color accuracy, with 120% sRGB, is phenomenal, ensuring that what I see is what I get, which is crucial for professional editing.The curved design is a major plus. It offers an immersive experience that is particularly noticeable when gaming, and more importantly, it’s comfortable for those long hours of work. The curvature of the screen makes the extended use much easier on the eyes, which is a relief during those long editing sessions.Adaptive-Sync technology is another feature that has improved my experience. It ensures smooth visuals, eliminating the annoying screen tearing and stuttering, which is great both while editing and gaming.While the monitor comes with built-in speakers, I find them to be a convenient addition for everyday use, though I primarily rely on external speakers for professional editing.One aspect I don’t use is the VESA mount, as the stand provided suits my setup perfectly. However, it’s good to know that the option is there for those who might need it.The inclusion of a 4-year advance replacement warranty was the cherry on top, giving me peace of mind about the longevity and quality of the monitor.In summary, the PHILIPS 328E1CA is an excellent investment for professionals who need a high-quality display for editing, gaming, and remote work. Its performance and features have been so satisfying that adding a second one felt like a natural step. Highly recommended for its superior display quality and ergonomic design.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joshua D. WashburnJoshua D. Washburn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJFQ26QTOOT5JGK5LK2MFWRHURQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KOPGXUU3CEN5?ASIN=B0BQQ7H8TZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 27, 2021",
                "reviewTitle": "5.0 out of 5 stars Glorious piece of technology. Yes, you need this monitor.",
                "reviewText": "I was initially concerned about buying a Philips monitor because I assumed the quality would not be on par with other well-known brands. The reasonable price, 4 year warranty, and good reviews are what led me to settle on this monitor.PANELThe screen itself is bright. I tend to keep the brightness level around 85-90.1. Text looks clear both in the middle and the sides2. Contrast is good3. Images look great4. Colors are quite accurate - I have not made any changes to customize the colors of the panel. Out of the box the colors looked good to me. I am not planning on using this monitor for editing photos. I have another monitor that is more geared towards creative work.AESTHETICSThe whole monitor looks great. Even the back has sort of a brushed look. I love it!CURVEI really enjoy the curve. I have heard some people say that the curve takes time to get used to, but getting used to it seemed easy to me. I don't think I would want a monitor wider than this. The size is perfect.Thankfully the monitor I received was in perfect condition. No dead pixels. Philips dead pixel policy is not clear at all. I hope that this will never be an issue. The 4 year warranty seems pretty awesome. Seems like Philips will stand behind their product.GAMESI have not yet tested any serious games on this monitor, but I will soon and post an update here. I did play some Roblox and the game filled the whole screen. Any content that fills the whole screen is really awesome.USB-CMy work laptop is a Lenovo ThinkPad. The USB-C port on the laptop where I plug the power adapter did nothing when I connected the monitor using the supplied USB-C cable. This is probably a misunderstanding on my part. There is a secondary USB-C port on the laptop that has an energy bolt next to it. When I plugged the monitor into that USB-C port, the laptop displayed on the monitor in 1440p, and the laptop was receiving a charge from the monitor. Pretty amazing.STANDThe stand is very sturdy. The screen can tilt up & down, twist left and right, and can raise up & down. Very happy with this.SPEAKERSThe speakers are great if you consider they are built-in speakers, not dedicated reference monitors. It's a very welcomed addition, and they do the job.PURPOSEPeople may settle on this monitor for different reasons. For me the biggest reason was work. Having this monitor for work is a total dream. I am an IT engineer, so being able to have Visual Studio Code, PowerShell, Outlook, and the Azure portal all open at the same time (I have a 2nd monitor) really helps with productivity.A creative professional may want to avoid the curve and go for a panel with even higher color accuracy. A gamer might want more than 100hz to keep gameplay as smooth as possible.If you are looking for more screen real estate and you want to be more productive, then this monitor is for you.Side note: Amazon's characteristics for this item don't make any sense. They asked me to give a rating for the \"sheerness\" and \"thickness\" of the monitor.",
                "reviewVotes": "111 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/A1L3RPUYDWL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "philg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJQGNUWOM5MKVCVK7IB332FV3DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R382308TOEDSYH?ASIN=B0BQQ7H8TZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars This is a great display. Every element is well designed.",
                "reviewText": "I really like this display. It is a perfect match for my MacBook Air. It is 1440i resolution,which is a perfect match for a Mac. I drive it with USB C. All of the elements of the display are well thought through. The stand work great. It has a built in USB B and C hub, where I connect my keyboard and mouse. It is a cut above the typical no-name monitor.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "homeboy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3GTUUGBSVGTQTW6F7I2MAYINVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G3MP80Q9JKU5?ASIN=B0BQQ7H8TZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Nice monitor",
                "reviewText": "I like the size of the screen, easily enough real estate to function as a dual monitor, the screen is quite adjustable too. I got the KVM version and the docking station works well with an a 5 year old IBM thinkpad running linux. I wish the KVM switching was a little easier, bit it is a better alternative than having a KVM and all the wires all over the place. The internal speakers are OK for meetings and such, as is the camera. I use it primarily for coding and i is nice to have space for an IDE and a browser or email side by side. I haven't used it for gaming so I have no idea how well it would perform in that capacity; but for a home office it works really well and is a good value.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGC4JEEUNBBUHW22ZWRF5KRE33UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MXYCCL45H032?ASIN=B0BQQ7H8TZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing monitor, great value.",
                "reviewText": "For the money, compared to other similar spec’d monitors, this one is amazing. Incredible picture, lots of ports, easily/smoothly adjusts angles and height. Great monitor for creatives who need lots of pixels!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RecursiveGeek",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2QFRRWCPL53FTXYDY2WEBFTOLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7VZFODZO57IT?ASIN=B0BQQ7H8TZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Great productivity monitor",
                "reviewText": "I use this monitor daily for my job and love the curve to make my peripheral vision, with computer glasses, to see more clearly the edges compared to a flat monitor. I use it at 60Hz so it is sharp for productivity applications. I cannot speak to color as that isn’t a need, but it is bright with a bright room. Since it is 32”, even with my older eyes, I am able to run it natively at 4K to maximize my productivity, especially providing the equivalence of four (4) 1080P monitor.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SGT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5LO2PX6KGM5IB6WXIJMGEWACDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15SIH4EJFPH4C?ASIN=B0BQQ7H8TZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Better than expected",
                "reviewText": "This is a very nice monitor for the money. It’s a very nice monitor. It was delivered with no defects out of the box on the desk and plug it in and it’s ready to go. Value for the money for sure. You can spend a whole lot more but you don’t have to. Using this for a computer monitor and it is awesome.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Felipe Ortega Vega",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 1, 2023",
                "reviewTitle": "Funcional, excelente calidad precio.",
                "reviewText": "Muy buena para un monitor alterno o como principal, no le he utilizado para videojuegos pero para ver videos y trabajar es perfecto, y el tamaño muy funcional.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miguel A Castillo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 15, 2022",
                "reviewTitle": "Muy Recomendable",
                "reviewText": "La pantalla tiene muy buen tamaño y fue muy fácil de instalar. El precio muy razonable y la calidad de el equipo muy bueno.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wmk",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 28, 2021",
                "reviewTitle": "Great monitor, crisp black text, excellent colours and easy on the eyes. 10/10",
                "reviewText": "I researched widescreen monitors for many hours and I settled on the Philips widescreen because of the price point, and the few reviews I found on it were good. I use this screen for film editing, photoshop, and work flow. The colour range is excellent and I find the 34\" wide screen perfect. This screen is replacing my 38\" widescreen dell, which I found too big. The 34\" is perfect for opening multiple windows and unlike my old 38\" monitor, I don't have to constantly keep turning my head to see the edges - 34\" is the sweet spot! I also love the rich blacks and the colour is amazing. I am not a gamer so I can't give this an honest review for gaming, but for work flow I would not look anywhere else. I am using it with my 15\" MacBook Pro and it plugs into the usb-c on my laptop and keeps the battery perfectly charged. I tried the built in speakers and like any built in speakers in a monitor, they lack bass. I use computer speakers with a subwoofer and I would never use built in speakers on any screen so in my opion the speakers should not impact your decision to buy this screen. Thank you Philips for saving me about 800.00 on something equivalent! Amazing screen 10/10.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "UK clientUK client",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 16, 2022",
                "reviewTitle": "7 PROs, 2 CONs: P.S: Check if you need a mini HDMI (male) cable to connect to your laptop.",
                "reviewText": "Been using this monitor for 2-3 weeks for work, )ie: not to play games or watch movies) and it's great. It's my first time attaching a monitor to my Asus ZenBook so I can't compare but I think it's brilliant. I should have bought an auxiliary monitor years ago. Really transforms the way I work.Note the \"curve\" is minimal (see photo) but it suits me fine (and I can't compare to a more curved monitor), but if you are looking for a monitor with a serious curve, this is one is not for you.7 PROs:* GREAT ON THE EYES: First time attaching a large monitor to my laptop and the detail is great. Makes working much easier and enjoyable. Should have bought an external monitor years ago!* LOVE THE AUDIO: The audio on my laptop plays up sometimes making it difficult to hear, but this monitor's speakers (located at the base) are great. Amplify the sound.* PLUG AND PLAY: The only \"setting up\" is attaching the stand to the monitor. Easy. Then the power cord and then, and THIS IS IMPORTANT, the HDMI cable.* TIP no.1 : Monitor comes with a standard HDMI cable BUT to connect my laptop to the monitor I needed a MICRO HDMI (male) to HDMI (female) cable. I only realised after the monitor was delivered, so I had to order one ($14AUD for a 3m cable). It meant that I had to wait 3-4 days to use it, so if you need one, order it at the same time.* FRONT BUTTONS (bottom right) are: On / off (I prefer to turn monitor off rather than leave it on standby mode) , volume, input (VGA, HDMI 1.4 and DisplayPort) and Smart image (FPS, Racing, RTS, Gamer 1, Gamer 2, Low Blue Mode). ...err, don't know what all these \"smart image\" functions do. But audio jack is at back (see \"cons\"). Also no idea what the \"lock icon\" at the back is for...but I guess I should read the manual for that!* IT TILTS: No idea if all monitors do this, but I discovered it's quite important. When I first set it up, the light from my back window was reflecting off the monitor. A minimal tilt downwards resolved the problem. If it couldn't tilt down it would have been a real problem and I'd probably not be as happy.* THE STAND: I like that it is a rectangular frame rather than either two \"claws\" or a \"filled\" rectangle. It means you can utilise that space for other things... handy. I was worried that the \"ring\" around the screw that connects the stand to the monitor was lopsided (see photo) but has had no detrimental effect...well, so far anyway... but I don't move the monitor around.* TIP no.2: You'll need a phillips head screw driver (ha, of course!) to connect the stand to the monitor.2 CONs:* The audio jack is at the back. Why? I'd have it under the monitor for easy access.* Was worried when I saw the bottom of the box had traces of \"wet\" and there were finger prints on the monitor that were not mine (see photos). But there has been no issue.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51txVQ4Le1L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41UiF4k+s-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61FmapYwMCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/616oaXdrCUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71GAFO7aU9L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61edReVejZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51uP1kbEClL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61RzBkTh18L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/716MWwfR8tL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "T",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 31, 2023",
                "reviewTitle": "Good monitor",
                "reviewText": "Appropriate width and sufficient resolution",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$349.99",
                "sellerName": "West Coast Distributors",
                "sellerRating": "5"
            }
        ]
    }
}