{
    "remaining_requests": 47376,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ViewSonic-TD2455-Dual-Hinge-Ergonomics-DisplayPort/dp/B081FJRQJL",
    "body": {
        "name": "ViewSonic TD2455 24 Inch 1080p IPS 10-Point Multi Touch Screen Monitor with Advanced Dual-Hinge Ergonomics USB C HDMI and DisplayPort Out,Black, 12.6\" x 21.2\" x 2\"",
        "price": "$359.99",
        "originalPrice": "$379.99",
        "rawPrice": 359.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ViewSonic-TD2455-Dual-Hinge-Ergonomics-DisplayPort/dp/B081FJRQJL",
        "soldBy": {
            "sellerID": "A1P0G9HM7361L3",
            "name": "ViewSonic Corporation",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1P0G9HM7361L3&asin=B081FJRQJL&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "Only 2 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41K4s 2HtQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/514KmrspZ3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51aNUyENyYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fDa0sQlwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sy71 GJJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ysp70i2rL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71ARVTCiDSL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f8df963c-9a6c-4b82-8ec2-3d2f3db4917f/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C17IXxa5XyL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C17IXxa5XyL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the ViewSonic Store",
            "link": "https://www.amazon.com/stores/ViewSonicCorporation/page/137763D7-E51B-4650-B00F-ED579E4052F5?ref_=ast_bln"
        },
        "brand": "ViewSonicCorporation",
        "merchantInfo": "Ships from and sold by ViewSonic Corporation. Seller Certifications:Minority-Owned Business",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 95,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 14. Order within 18 hrs 5 mins.",
            "FREE delivery February 16 - 20."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "VERSATILE TOUCH MONITOR: 24 Inch Full HD (1920x1080p) IPS touch monitor with thin bezels and 60Hz refresh rate",
            "ADVANCED TOUCH SCREEN: Robust 10-point Projected Capacitive (PCAP) technology provides a smooth and responsive experience with every tap, pinch, and swipe",
            "ERGONOMIC STAND: Ergonomic tiltable dual-hinge design maximizes comfort and productivity",
            "LESS CABLE CLUTTER: USB-C connectivity for fast data, audio and video transfer, and 60W charging over one cable"
        ],
        "description": "With responsive, in-cell touch technology and an advanced ergonomic design, the ViewSonic TD2455 touch display delivers hands-on control for more productive workspaces and collaborative classrooms. This 24” (23. 8” viewable) Full HD display features a SuperClear IPS panel and a three-sided ultra-thin bezel design that lets you see more and do more with incredible images and expansive screen real estate. An intuitive 10-point Projected Capacitive (PCAP) touch screen delivers a smooth and responsive experience with every tap, pinch, and swipe. Its advanced ergonomic design delivers versatility and comfort for office use, check-in applications, and more. With DisplayPort out connectivity, the TD2455 easily connects to a projector or interactive whiteboard, making it ideal for use as a podium touch display option in classrooms and lecture halls. An included stylus pen lets you write or draw on screen, and easily attaches to the magnetic base of the display stand for secure storage and quick access. The stand also features an integrated client mount* for quick installation of VDI client endpoints on the back of the screen. So whether used on its own on office desktops, as a collaboration station in corporate huddle spaces, or as a front-of-classroom interactive teaching hub, the TD2455 helps to boost efficiency and productivity. *Client Mount Kit sold separately.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Monitors",
                "link": "https://www.amazon.com/Monitors-Computers-Accessories/b?ie=UTF8&node=1292115011"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎24 Inches"
            },
            {
                "name": "Screen Resolution",
                "value": "‎1920x1080"
            },
            {
                "name": "Max Screen Resolution",
                "value": "‎1920 x 1080 Pixels"
            },
            {
                "name": "Number of USB 3.0 Ports",
                "value": "‎5"
            },
            {
                "name": "Brand",
                "value": "ViewSonic"
            },
            {
                "name": "Series",
                "value": "‎TD2455"
            },
            {
                "name": "Item model number",
                "value": "‎TD2455"
            },
            {
                "name": "Item Weight",
                "value": "‎14.2 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎11.3 x 21.2 x 16.8 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎11.3 x 21.2 x 16.8 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Power Source",
                "value": "‎10"
            },
            {
                "name": "Voltage",
                "value": "‎110 Volts"
            },
            {
                "name": "Batteries",
                "value": "‎1 A batteries required."
            },
            {
                "name": "Manufacturer",
                "value": "‎ViewSonic"
            },
            {
                "name": "ASIN",
                "value": "‎B081FJRQJL"
            },
            {
                "name": "Date First Available",
                "value": "‎November 13, 2019"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 95 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#23,535 in Electronics (See Top 100 in Electronics) #639 in Computer Monitors"
            },
            {
                "name": "Screen Size",
                "value": "24 Inches"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "1920 x 1080 Pixels"
            },
            {
                "name": "Special Feature",
                "value": "Height Adjustment, Portable, Pivot Adjustment, Blue Light Filter, Anti-Glare Coating, Touch Screen, Swivel Adjustment, Frameless, Flicker-Free See more"
            },
            {
                "name": "Refresh Rate",
                "value": "60 Hz"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "ViewSonic TD2455 24” In-Cell Touch Display with USB C Connectivity and Advanced Ergonomics With responsive, in-cell touch technology and an advanced ergonomic design, the ViewSonic TD2455 touch display delivers hands-on control for more productive workspaces and collaborative classrooms. This 24” (23.8” viewable) Full HD display features a SuperClear IPS panel and a three-sided ultra-thin bezel design that lets you see more with incredible images and expansive screen real estate. An intuitive 10-point Projected Capacitive (PCAP) touch screen delivers a smooth and responsive experience with every tap, pinch, and swipe. Its advanced ergonomic design delivers versatility and comfort for office use, check-in applications, and more. With DisplayPort out connectivity, the TD2455 easily connects to a projector or interactive whiteboard, making it ideal for use as a podium touch display option in classrooms and lecture halls. An included stylus pen lets you write or draw on screen, and easily attaches to the magnetic base of the display stand for secure storage and quick access. Lower Energy Consumption With an energy-saving Eco-mode feature and ENERGY STAR compliance, this monitor delivers great power savings along with its stunning screen performance. VESA-Compatible Mount Mount the monitor as you see fit using its convenient VESA-compatible mount design. Features Advanced Touch Capabilities and Screen Performance Designed For Enhanced Comfort Ideal For Dual Monitor Setups Optimized for Touch Applications Cross-Platform Touch Support USB-C Single Cable Plug-and-Play Advanced Connectivity for Multiple Platforms",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/42dbc989-db5f-4fad-8a92-fa154b192087.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Features Advanced Touch Capabilities and Screen Performance An advanced in-cell touchscreen provides a smooth and responsive experience with every tap, pinch, and swipe, while also delivering awesome front-of-screen performance and incredible images. Designed For Enhanced Comfort Featuring an ergonomically enhanced dual-hinge design, this touch display can be effortlessly adjusted from desktop mode to podium use. Both seated and standing users can work for longer with less strain. Ideal For Dual Monitor Setups This interactive display comes equipped with DisplayPort Multi-Stream Transport (MST) technology so users can easily daisy-chain additional displays and create dual monitor setups.* *MacOS does not support DisplayPort MST.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e510de7b-7f2d-4fd5-9375-00f932f3c682.__CR0,0,400,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b6c07024-fe06-425a-8660-a1a4f948fc32.__CR68,0,1102,1102_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ecc72f7a-46ec-4ec6-841e-360dc7d1331f.__CR68,0,1102,1102_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Features Optimized for Touch Applications This interactive touch display enhances efficiency and productivity in business, hospitality, education and other settings. Use it as a check-in kiosk at reception desks, an office collaboration hub, or a touch-enabled podium for front-facing instruction. Cross-Platform Touch Support Compatible with Windows, Android, and Chrome, this versatile display delivers great touch capabilities* in any office or classroom setting. *Due to a hardware incompatibility with macOS USB stack, TD2455 and ID2455 cannot support touch functions by vTouch temporarily. USB-C Single Cable Plug-and-Play The latest USB 3.2 Type-C input transforms this display into a powerful hub by enabling easy connectivity to PC, laptop, and Chrome systems. In addition, it delivers charging power, video, and audio over a single cable. Advanced Connectivity for Multiple Platforms Flexible connectivity options deliver versatility for any system or platform in any office or classroom environment. DisplayPort, HDMI, and high-speed USB ports give you the freedom and flexibility to connect to a variety of devices. What’s more, DisplayPort connectivity provides multi-stream technology that allows you to easily daisy-chain multiple monitors with only a single cable.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bd1a0fe5-9f6c-46e7-b994-0fdab2159a32.__CR68,0,1102,1102_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9dd5f31-bb3f-42c7-ac09-1f950cd041a4.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/111f186f-261d-43c6-a4dd-7ecf46ce65a3.__CR69,0,1101,1101_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b054611d-8477-46b0-a4ea-0114af0fb5cc.__CR68,0,1102,1102_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b8ee6c07-8c7e-4a67-86e0-6fb5473b8067.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/42dbc989-db5f-4fad-8a92-fa154b192087.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e510de7b-7f2d-4fd5-9375-00f932f3c682.__CR0,0,400,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b6c07024-fe06-425a-8660-a1a4f948fc32.__CR68,0,1102,1102_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ecc72f7a-46ec-4ec6-841e-360dc7d1331f.__CR68,0,1102,1102_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bd1a0fe5-9f6c-46e7-b994-0fdab2159a32.__CR68,0,1102,1102_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9dd5f31-bb3f-42c7-ac09-1f950cd041a4.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/111f186f-261d-43c6-a4dd-7ecf46ce65a3.__CR69,0,1101,1101_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b054611d-8477-46b0-a4ea-0114af0fb5cc.__CR68,0,1102,1102_PT0_SX220_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Deal Finder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQJCNWEWSN5OCZ4BANQNUAQK2BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA75U6QFV86T5?ASIN=B081FJRQJL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 2, 2022",
                "reviewTitle": "5.0 out of 5 stars Works like a champ",
                "reviewText": "I purchased 2 of these to work side by side, and they work as advertised. The screens fold down to make it easier to draw or write items. The response on these is exactly what you hope it would be. These are not as \"fine\" as my surface laptop screen when I draw - these do not have that same preciseness that I have on my Surface and Lenovo Thinkpad. These ViewSonics are good for touch buttons and some rougher drawing (draw larger boxes in OneNote, etc...).I chose Viewsonic TD2455 over the Dell and the Lenovo monitorss because the Viewsonic came with the pens to draw on the screen (you can find these easily on Amazon), and these also came with all the cables necessary to connect (Display Port and USB cables). Additionally, these monitors support daisy chaining the Display Port cables (helps a bit in the cable management category). These monitors also have USB ports on the left side of each monitor, which is helpful if you need to charge something or connect something quickly.If you have 2 of these, you have to tell Windows 11 which monitor is which for the touchscreen, so that the touch applies to the right monitor. Control Panel (view by category) --> Hardware and Sound --> Tablet PC Settings --> Setup. That took me a while to figure out.Additionally, there is a Calibrate color section, and another calibrate for where edges of the screen are located. I did not find it necessary but did these at the behest of Tech Support. What I learned is that these came configured well, right out of the box. In windows 11, the calibrate is not where the tech support people were telling me it is. It was actually in Control Panel (view by category) --> Hardware & Sound --> Tablet PC Settings --> Calibrate (select the correct monitor).As a big note: I was going to send these monitors back after 1 day because the touchscreens were only enabled ~50% of the time after booting up. I had to unplug and replug in the display to get the touchscreen to work after each bootup. This happened on both touchscreens, so it was not a screen or cable issue. After a month of emailing with US Tech Support people we found the solution is to use the older USB 2.0 ports, and not the newer USB 3.2 ports. After switching both monitors to USB to USB 2.0 ports, the touchscreens work 100% of the time. This is on a brand new Dell XPS 8950. Also to note is most of the 1-month delay was me not being at the monitor each day to try out the scenarios - mostly due to my own delays and not ViewSonic tech support.All in all, this is working just as we hoped and glad we purchased this!Now, I am going to tap the [submit] button using the touchscreen :)",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason Signor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZOTT7BLMYG3VWQWXUV662OKXWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XFT58YW15B4G?ASIN=B081FJRQJL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Very nice, but does not pivot",
                "reviewText": "UPDATE: I bought a quality level and discovered the monitor IS level. Surrounding items caused a visual illusion of tilt. So, I'll update my grade for this monitor from B+ to A-. I'm still not happy with no pivot capability and may return this. Pivot is a good feature. But this is still an excellent monitor.-----This is an excellent monitor. My go-to has been ASUS for years, however, I am not satisfied with what they have to offer recently. I wanted a touch screen and struggled to find one that can be used like a standard monitor and not just like a tablet. Color and image quality on the ViewSonic is excellent without having to make any adjustments. And that is rare.There is one issue though. These new style stands. Yes, I understand the value of tilt and lying flat, as this is a touch screen. However, what I've noticed is this type of stand (none of them that I have looked at) can pivot. At least 10 degrees of pivot left and right would be useful. Why? Not every surface is level, and pivot can be useful for leveling and not just for turning the screen to the vertical position. This stand and others like it cannot pivot. Swivel and tilt, yes. But no ability to adjust left-right leveling. I ran into an annoying issue where the monitor appeared to be leaning to the right. Less than one degree, though this is noticeable if you are picky about having your monitors level like I am. I've had difficulty determining whether the issue is the monitor, my desk, or the floor. I bought a roll of 1/16-inch rubber shim and cut one piece to put under the front right foot of the monitor, and two pieces (stacked) under the back right foot. I think it is level now. However, this would not even be an issue if it could tilt left and right. This is a design oversight with these types of monitors. And it is one thing that ASUS definitely gets right that I have appreciated: ability to swivel, tilt, pivot 90 degrees, and ample vertical adjustment. Speaking of vertical adjustment, this relies on the V-shaped arm, and as a result there is not much vertical adjustment. I am using the ViewSonic as my main monitor in between two ASUS monitors to the left and right. Both are on monitor stands. With that arrangement I've been able to get maximum vertical adjustment. However, I had to purchase a new stand for the ViewSonic that allows more vertical adjustment than the other two stands. I needed to raise the monitor 3.75 inches vertically to level it with my other monitors. I am satisfied with that arrangement.However, the lack of pivot is still a consideration. I'll give it a chance and see. But I may return this for a monitor that can pivot. It is not easy to find a touch screen monitor that also pivots. It seems that touch screen computer monitors may be less common now. I know Apple used to to make a desktop touch screen but discontinued it. I think some of the thinking here is that it does take some physical exertion to hold one's arm up to touch the screen. But, for me, having the option of using either the mouse or touch screen is such a cool improvement. I WOULD consider replacing my other two monitors with ViewSonic TD2455 monitors -- if it were not for the lack of pivot.With that said, here are some definite positives. The touch screen feature works well. The stylus that comes with it works well. The thin bevel around the screen is very nice, and I still am able to clip my webcam on the top of the monitor without an issue.I do recommend this monitor. But consider the pros and cons I've mentioned. My grade for this monitor is B+. I want to give a higher grade, but I just don't get this new V-shape stand. I'm hoping that alternatives will be created that have the capability of pivot capability.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AndrewSkeet88",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF35O22IBRD3NLIQRKBIOHQ5PB2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BUZ93UTMKZ7L?ASIN=B081FJRQJL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2021",
                "reviewTitle": "5.0 out of 5 stars Very sharp images, wish the top border was a little larger for webcam",
                "reviewText": "The Good: The image is very sharp. Buttons to turn on/control are on front of monitor and NOT underneath, so easy to find/push. Touch works very well and is intuitive. The angle and position can be adjusted easily with the heavy duty stand. Note to whomever had this unit and returned it to Amazon (without the manual) - I'm sure you forgot to plug in the USB-B connector which actually allows the touchscreen features. So you need 3 cords in the back (minimum) - power, a video (HDMI/etc.), and the USB-B to make the screen work like a mouse. This necessary cable was still fully wrapped up so I know the prior person returned this as \"not working.\" It works great!The slightly BAD: The touchscreen goes to within a quarter inch of the monitor edges. This is cool and a good use of space. However, when you hook a webcam on the top of the monitor, its clip hands a little in front of the monitor. It is not registering as a figer tap, but isn't ideal.Overall - VERY NICE MONITOR!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Just Info",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVYLYH2C2EOS6UKRCTY4U3EKBLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BEFT17EXHDMM?ASIN=B081FJRQJL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2023",
                "reviewTitle": "5.0 out of 5 stars One of a kind",
                "reviewText": "You can't find a stand alone TOUCH SCREEN monitor. Much less one that has these function for users. I bought this for a client and she is always trekking me how she loves using it. Simple setup. Nice screen clarity. Perfect touch response.. the styles is what really makes this a creative crators go to. Tillt of the screen on this makes is so versatile.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Watson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLWOO5H3NNN4M5D7KIGGYGDNG2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37BFY3WNK8DK8?ASIN=B081FJRQJL",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 18, 2023",
                "reviewTitle": "3.0 out of 5 stars Returned",
                "reviewText": "This monitor's touch screen function never worked for us. We have a Dell all in one and a Mac and it didn't work for either one. No instructions on how to 'turn on' the touch function. We returned this item.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex Miravete",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 24, 2023",
                "reviewTitle": "Funciona tal como lo pretendía",
                "reviewText": "Cuando vi que las instrucciones indican muy escuetamente que los drivers pueden descargarse de la página web del fabricante, temí que mi laptop del trabajo no aceptara fácilmente éste monitor y debido a las configuraciones de seguridad que pone la empresa donde trabajo, tuviera que llamar al área de sistemas y tal vez no pudiera usar el monitor, pero mi sorpresa fue grata al comprobar que con el cable tipo C, todo funciona como lo pretendía y también que la definición es muy buena, los colores bastante cercanos a los la propia laptop y el sistema táctil muy funcional.Se agradecería que el soporte permitiera girar el monitor en sentido horizontal y no solo vertical y que el conjunto fuera un poco más ligero, pero en todo caso considero que hice una muy buena compra en la relación precio-beneficio, ojalá saquen un monitor con conexión Bluetooth.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$359.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            },
            {
                "price": "$359.99",
                "sellerName": "PCNation",
                "sellerRating": "4"
            },
            {
                "price": "$359.99",
                "sellerName": "Provantage LLC",
                "sellerRating": "4"
            }
        ]
    }
}