{
    "remaining_requests": 47625,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samsung-LC27F398FWNXZA-C27F398-Curved-Monitor/dp/B01CX26WIG",
    "body": {
        "name": "SAMSUNG 27\" CF39 Series FHD 1080p Curved Computer Monitor, Ultra Slim Design, AMD FreeSync, 4ms response, HDMI, DisplayPort, VESA Compatible, Wide Viewing Angle, LC27F398FWNXZA, Black",
        "price": "$159.99",
        "originalPrice": "$219.99",
        "rawPrice": 159.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Samsung-LC27F398FWNXZA-C27F398-Curved-Monitor/dp/B01CX26WIG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09SJ9192T"
        ],
        "asinVariationValues": [
            {
                "asin": "B079K3MXWF",
                "variationName": "Size",
                "variationValue": "24-Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B01CX26WIG",
                "variationName": "Size",
                "variationValue": "27-Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B01CX26WIG",
                "variationName": "Style",
                "variationValue": "Curved",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "Flat",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B01CX26WIG",
                "variationName": "Set",
                "variationValue": "DP/HDMI",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Set",
                "variationValue": "VGA/HDMI",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B01IPHVFUI",
                "variationName": "Set",
                "variationValue": "DP/HDMI 3-Yr Warranty",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51HXHFAQmtL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51GZ8yLYl1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BmkspqtmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21xP4v1WQTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Lhl5GC-fL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41q9FiXNc6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/316wgiKlftL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81CSFguYUFL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/51fDR4x6PxL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the SAMSUNG Store",
            "link": "https://www.amazon.com/stores/Samsung+Business/page/3597856D-5133-4B8E-A267-CA177DACD5BA?ref_=ast_bln"
        },
        "brand": "Samsung Business",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 25287,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 4 hrs 14 mins",
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 4 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "IMMERSIVE VIEWING EXPERIENCE: The 1800R curvature of the screen lets you enjoy big, bold and stunning panoramic views while you work or play at home or the office",
            "SUPER SLIM DESIGN: Make a stylish statement with its ultra-slim and sleek profile; Monitor measures less than 0.5 inch thick and the simple circular stand adds a modern look to your space",
            "ADVANCED GAMING w/ AMD FREESYNC: This technology allows users to enjoy smooth images, even during the fastest moving scenes; It minimizes input latency, dramatically reduces image tearing and stutter",
            "FAST 4ms RESPONSE TIME: With its 4ms response rate, you'll see the fastest on-screen motion clearly and smoothly with less blur, judder, and ghosting, allowing players to experience their games at the highest level",
            "EYE SAVER MODE: Optimize your viewing comfort by reducing blue light emissions and flickers at the touch of a button; Read documents, play games, watch movies and edit photos for longer periods without worrying about eye strain or fatigue",
            "BRILLIANT PICTURE QUALITY: Experience vibrant, vivid colors with Samsung's Active Crystal Color technology; The excellent 3000:1 contrast ratio delivers deep blacks and bright whites so you can see clearly even in the darkest or brightest scenes",
            "ECO-SAVING PLUS: This feature reduces screen brightness to save power, plus the screen brightness automatically transitions fluidly—reducing energy use even more",
            "Color Support: 16.7M"
        ],
        "description": "1800R curved monitor with 3000:1 contrast ratio provides a truly immersive viewing experience. Featuring a glossy black finish and simple stand, the monitor boasts AMD FreeSync and Game Mode technology which allows users to enjoy smooth images, even during the fastest moving scenes. Power Consumption (Max) - 25 Watts.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Monitors",
                "link": "https://www.amazon.com/Monitors-Computers-Accessories/b?ie=UTF8&node=1292115011"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎27 Inches"
            },
            {
                "name": "Screen Resolution",
                "value": "‎1920x1080"
            },
            {
                "name": "Max Screen Resolution",
                "value": "‎1920x1080 Pixels"
            },
            {
                "name": "Brand",
                "value": "SAMSUNG"
            },
            {
                "name": "Series",
                "value": "‎CF398"
            },
            {
                "name": "Item model number",
                "value": "‎LC27F398FWNXZA"
            },
            {
                "name": "Operating System",
                "value": "‎windows 10"
            },
            {
                "name": "Item Weight",
                "value": "‎9.03 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎3.2 x 14.5 x 24.5 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎3.2 x 14.5 x 24.5 inches"
            },
            {
                "name": "Color",
                "value": "‎Black High Glossy"
            },
            {
                "name": "Power Source",
                "value": "‎AC"
            },
            {
                "name": "Voltage",
                "value": "‎110 Volts"
            },
            {
                "name": "Manufacturer",
                "value": "‎Samsung"
            },
            {
                "name": "ASIN",
                "value": "‎B01CX26WIG"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎April 24, 2016"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 25,287 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,113 in Electronics (See Top 100 in Electronics) #22 in Computer Monitors"
            },
            {
                "name": "Screen Size",
                "value": "27 Inches"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "1920x1080 Pixels"
            },
            {
                "name": "Special Feature",
                "value": "Curved Screen"
            },
            {
                "name": "Refresh Rate",
                "value": "60 Hz"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e129c9f2-6e05-4461-a9b8-c245e2b82f2a.__CR1,0,3050,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95afa0fc-bb47-42a4-b431-d9544f0bc730.__CR0,0,3051,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/757bd476-712d-4e3f-82b9-c167739c943b.__CR0,0,3051,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c70c87fb-d900-4e20-885b-b3f5a3d374ae.__CR0,0,3051,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3aeb8dfd-7fc9-42f1-a66b-497a1cbd4fb6.__CR0,0,3051,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4eb710d7-bc22-42c9-abe2-703b1ab7acd1.__CR0,0,3051,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7643c1c3-6331-460e-9d28-7a953199a669.__CR0,0,3051,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0dfc40b-c634-4b2b-85ec-2b7cefb646bd.__CR0,0,3051,1250_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Systopian Solutions, a Division of Eutopian Trader, LLC.Systopian Solutions, a Division of Eutopian Trader, LLC.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4F6NVHCVPH3NUXAWXKM6S5BWJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB8Q32AP5299Q?ASIN=B01CX26WIG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2018",
                "reviewTitle": "5.0 out of 5 stars Amazing Picture very reasonable price!",
                "reviewText": "After finally purchasing a couple MiniPC's for both business and personal use, and using an old LCD 21\" Wide Screen Monitor I had, I was finding that I must be spoiled by my 4K TV because the picture on that monitor which I thought was wonderful, just seemed so dull and it did not support 4K which I have come to love to watch 4K videos etc.I wasn't really sure what monitor to get, but I wanted something much larger, supported 4K, and that was at a very reasonable price. I did a lot of searching Amazon's product lists for monitors, and I came across this monitor, and I noticed that it was a curved screen. While I have never owned a curved screen anything, I had seen them at the local electronics store and was darn impressed. So I was very curious about this monitor because it had all the specs I was looking for, at least 27\", Wide Screen, Support for 4K, Native Resolution of 1920 x 1080, LED, and had a curved screen. When I also noticed that it was a Samsung, I was pretty excited to learn more because I have always had very good luck with Samsung products and in fact, I have only had one Samsung product ever fail, and that was a mobile phone that should have stopped working years ago with what It went through.Not knowing much about monitors these days, I started reading the reviews that were written on this monitor and I asked the community a couple questions. The answers I got back to my questions sealed the deal for me. Everyone who responded had nothing but great things to say about this monitor and provided me in info I needed. So I decided to go for it.When it got here, unfortunately the first one had a broken screen. It appeared that it was packaged that way since the packaging was factory sealed but the packing was broken on the inside. Needless to say I returned it but Amazon really stepped up to the plate and sent me a replacement next day, so I was only delayed by 1 day getting to use it. Because the first monitor came with a broken screen, I am going to assume that the screen may be a bit on the frgile side as my old monitor has been dropped, and the LCD screen never had any issues, I don't know jf the screens on LED monitors are more easily broken, or If this was something that someone really dropped hard before packaging, for this reason I gave the durability 4 stars)Setup was a breeze! Just had to put 1 screw to put the base stand together, and that was it. The stand is about the only thing I really don't like because the base that sits on the desk is an upside down chevron shape, which sticks out in front of the monitor a few inches. This makes putting it on a small desk where your keyboard would be in front of it a bit of a pain because the keyboard has to be pulled closer to me and just gets in the way to me. I managed to get around that by putting the monitor up on a little shelf I made out of a box and an old Laptop lap desk that I had. It perfectly raises the monitor by about 4-5 inches, and let's me push the keyboard further back to where I now have more room on my desk. (Images added to show the base and how I worked around the chevron styled base to give me more room).The monitor has one HDMI port and one Display Port. Now I am not familiar with the Display Port, but all my devices are HDMI, so plugging in a PC is simple. In fact, I have 3 MiniPC's that I need to connect to this monitor so I bought a 5 port HDMI switch. This allows me to easily switch between each MiniPC with just a click of a button.The picture on this monitor is absolutely phenomenal! Once I plugged in the HDMI plug, turned on the monitor, it automatically scanned for the signal which it found right away and WOW! What a gorgeous picture. The colors are very bright and vibrant. The dynamics between the Black and White colors are stunning and the color definition is very vivid. For never using a curved screen before on a computer monitor, I am very impressed. It almost immerses you in to the picture and almost gives it a extra dimensional view, almost 3D in nature... The thing I worried most about with a curved screen was is there going to be any distortion with a curved screen and I am happy to say. \"Absolutely Not!\". The images looks perfectly flat, but because of the curve, it pulls the outer edges our of your peripheral vision and closer to your focused view when looking straight forward.Learning how to use the toggle button on the back for adjusting the settings van take a bit of getting used to, however, at this point, I haven't really needed to use any of the options other then Sleep and Shut Down as the defaults seem to be perfect for my setup.Unfortunately this monitor does not have built in speakers however, if you have speakers connected to you computer or use a set of Bluetooth Speakers you will be just fine.Overall my impression of this monitor is fantastic! The picture quality is stunning, and the size with the curves screen is awesome. I would recommend this monitor to anyone who wants an excellent monitor for home or office at a more then reasonable price. While I have not used the monitor for gaming, I have used a monitor that has the same 4ms refresh rate and that has the same native resolution of1920 x 1080 and that monitor is over 10 years old and still holds up today, so I can only imagine that this monitor would be perfectly fine for today's games. I am definitely glad that I went ahead and purchased this monitor, and should I need to replace the monitor that I amusing as a secondary monitor, I will likely purchase another one of this model! Again, Highly recommended and over all this monitor gets a full 5 Stars from me! ~",
                "reviewVotes": "116 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71FpunvLpbL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "maurice Nickelson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJAY5PANGT7ORDLGE773QN5MRWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UQZMLZU48MSD?ASIN=B01CX26WIG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars COOL FOR THE MONEY, PICTURE QUALITY IS OK, BUT I STILL GIVE A 5 FOR THE PRICE",
                "reviewText": "PICTURE QUALITY IS OK, BUT IS WHAT WAS EXPECTED FOR THE SPECS AND PRICE. I LIKE THE CURVE. NICE SIZE, DOES WHAT IS NEEDED, GOOD PURCHASE. I MAY RETURN ONLY BECAUSE I WAS A BIGGER MONITOR TO BE MORE SIMILAR IN SIZE TO MY IMAC 27",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPPU4M3N2FIOENT7SXDUJPDS6PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KIO8T0742W4P?ASIN=B01CX26WIG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Great screen",
                "reviewText": "I bought this for my daughter, who uses her computer to do light gaming and watching movies and videos. This computer screen looks bright and crisp. I love the curved screen and how, even at this size, emerges you more than one with a flat screen seems to. This was very budget-friendly and we got everything we were looking for out of a screen. I definitely recommend this screen.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ardith N.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHALJAR2I5SWTUSAOGV3DDMKISQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4AIHJ9K2GTD2?ASIN=B01CX26WIG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Excellent Curved Monitor - Samsung CF390 Series Delivers Immersive Viewing",
                "reviewText": "The Samsung CF390 Series 27-inch FHD Curved Desktop Monitor for Business has proven to be an excellent addition to my workspace. Its immersive curved design, coupled with FHD 1920x1080 resolution, provides a captivating viewing experience that truly enhances productivity and enjoyment.Setting up the monitor was a breeze, thanks to the HDMI and VGA connectivity options and its VESA mountable design. It seamlessly integrated with my existing setup, allowing me to start using it right away without any technical hassles.The curved display is the standout feature of this monitor. It adds depth and dimension to visuals, creating a more engaging and realistic feel when working or enjoying multimedia content. The wide 178-degree viewing angles ensure consistent image quality from various positions, making it ideal for collaborative projects or presentations.I appreciate Samsung's inclusion of a 3-year warranty and TAA compliance, offering peace of mind and assurance of the product's quality and longevity. The monitor's sleek black finish adds a touch of elegance to my workspace, contributing to a professional and modern aesthetic.While the overall performance is commendable, I would have liked to see some additional ergonomic features, such as height adjustability or swivel options, to cater to various user preferences and enhance comfort during extended use.In conclusion, the Samsung CF390 Series 27-inch FHD Curved Desktop Monitor is an excellent choice for both business and personal use. Its immersive curved display, user-friendly setup, and warranty coverage make it a reliable and worthwhile investment. With the addition of some ergonomic enhancements, this monitor could easily earn a solid 5-star rating. If you seek an engaging and visually appealing desktop monitor, the Samsung CF390 Series is definitely one to consider.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2XI2WBM4R6ZYHUBVKEVU35UWQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28A0JC0DF6STZ?ASIN=B01CX26WIG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Great monitors",
                "reviewText": "Standard for all my reviews: When reviewing products, I always remain objective and honest about the product or service. I always review with information that I feel others would like to know about the product as I always assume what I'm writing will influence for or against the purchase. I always try to go above and beyond surface characteristics and input into quality, value and application. Most importantly, I will always end the review with an answer as to whether I'd purchase the product again which I believe is the most critical question pertaining to the item. To manufacturers: Want me to review your items, just let me know!I spend a lot of time on my dual-screen PC and with my purchased technologies so when one of my Viewsonic monitors started dying, I decided to upgrade both. After a fair amount of research, I selected two of these Samsung 24\" monitors based upon connection options, refresh rate, reviews and my experience with Samsung overall. As expected, the monitors set up very easily, they look great and the extra 2\" of screen size are definitely a difference-maker.Purchasing monitors is now easy to do without breaking budget and I've learned to trust Samsung. Once again, they didn't disappoint and I'd highly recommend them.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EDDY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETBFSX6DNHGOTQJV5N4F74HSDPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWZZU9ZSPHA9F?ASIN=B01CX26WIG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent quality",
                "reviewText": "The picture quality is amazing very beautiful monitor worth buying again it's a decent size and the price is decent for the money thumbs up for Samsung",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "isaac cuevas fernándezisaac cuevas fernández",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 1, 2023",
                "reviewTitle": "Muy buen producto",
                "reviewText": "",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Ld0R11iJL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 24, 2023",
                "reviewTitle": "Monitor curvo",
                "reviewText": "Este monitor se mira espectacular, tal cual como lo presentan recibí completo y en buen estado",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anayancy Hernandez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 3, 2023",
                "reviewTitle": "Muy buen producto",
                "reviewText": "Es cómodo para cualquier trabajo, la calidad de imagen cumple las expectativas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S.D.S.D.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 16, 2019",
                "reviewTitle": "The screen is definitely Moore than wide enough.",
                "reviewText": "Pros:For gaming, the curved screen will make a world of difference as it gives more depth and immersion to the game you are playing.The picture quality is great with a good HDMI cable and the screen has many options to adjust it for your needs.The screen is decently light, but I'm sure it's not above average light for 2019.Cons: The screen is not super slim. They need to remove that off the title. I've seen super slim TVs and this is still thicker by a long shot. I'd say the screen is about 1 inch thick. The angle on the box is a trick, because as you go down to the middle of the screen where the stand attaches, it gets a bit thicker. So, I would say it is just slim, not super slim, that's an exaggeration.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Dn0m1qvML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ellie T",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on September 16, 2021",
                "reviewTitle": "My first curved monitor",
                "reviewText": "Would be perfect if the height could be adjusted.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}