{
    "remaining_requests": 47628,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/acer-Predator-V3bmiiprx-FreeSync-Agile-Splendor/dp/B0CJVK8PF5",
    "body": {
        "name": "acer Predator XB273U V3bmiiprx 27\" WQHD 2560 x 1440 Gaming Monitor | AMD FreeSync Premium | Agile-Splendor IPS 400 | Up to 180Hz Refresh Rate | Up to 0.5ms | Eyesafe 2.0 | Display Port & 2 x HDMI 2.0",
        "price": "$199.99",
        "originalPrice": "",
        "rawPrice": 199.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/acer-Predator-V3bmiiprx-FreeSync-Agile-Splendor/dp/B0CJVK8PF5",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CQ591WJ4"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BWSHDFVL",
                "variationName": "Style",
                "variationValue": "UHD 160Hz",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CJVK8PF5",
                "variationName": "Style",
                "variationValue": "WQHD",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BPDZPT6V",
                "variationName": "Style",
                "variationValue": "WQHD 360Hz",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "UHD",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "UHD 150Hz",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "UHD, G-sync comp",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "WQHD 270Hz",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CJVK8PF5",
                "variationName": "Size",
                "variationValue": "27-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "28-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "31.5-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08HSJ7789",
                "variationName": "Size",
                "variationValue": "32-inch",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Sm9CkvzCL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51KSBWSlicL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bKl7du6QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61Md2ZWMb0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51YEva1DlGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518duJaE4BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51aiiJn4ioL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the acer Store",
            "link": "https://www.amazon.com/stores/Acer/page/0074ABD9-06D1-469D-B509-C3134D6FFFF2?ref_=ast_bln"
        },
        "brand": "Acer",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 882,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 5 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "27\" WQHD (2560 x 1440) Widescreen Agile-Splendor IPS 400 Gaming Monitor | AMD FreeSync Premium Technology",
            "Refresh Rate: Up to 180Hz| Response Time: Up to 0.5ms (G to G) | VESA Certified DisplayHDR 400 | Pixel Pitch: 0.233mm | Color Gamut: 95% DCI-P3 | Color Accuracy: Delta E<1",
            "VESA mounting compliant (100 x 100mm) | Zero-Frame Design | 2 Speakers, 2 Watts per Speaker",
            "Ergonomic Tilt: -5° to 25° | Height Adjustment Range: 5.9\" | Swivel: +/-20° | Pivot: +/- 90°",
            "Ports: 1 x Display Port 1.2, 2 x HDMI Port 2.0 & 1 x Audio Out (Display Port and HDMI Cable Included)"
        ],
        "description": "Fasten your seatbelt: The Predator XB273U WQHD display with 2560 x 1440 resolution is all about no compromises on gaming performance, color or speed. This 27-inch (2560 x 1440) monitor combines jaw dropping specs including an Agile-Splendor IPS panel that supports up to blazing-fast 180Hz refresh rate. Through AMD FreeSync Premium technology, the game’s frame rate is determined by your graphics card, not the fixed refresh rate of the monitor, giving you a serious competitive edge. Smooth, tear-free gameplay!! And a whole lot more. (UM.HX2AA.302)",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Monitors",
                "link": "https://www.amazon.com/Monitors-Computers-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1292115011"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎27 Inches"
            },
            {
                "name": "Screen Resolution",
                "value": "‎2560x1440"
            },
            {
                "name": "Max Screen Resolution",
                "value": "‎2560 x 1440"
            },
            {
                "name": "Brand",
                "value": "acer"
            },
            {
                "name": "Series",
                "value": "‎Predator XB273U V3bmiiprx"
            },
            {
                "name": "Item model number",
                "value": "‎UM.HX2AA.302"
            },
            {
                "name": "Item Weight",
                "value": "‎19.36 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎10.5 x 24.2 x 18 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎10.5 x 24.2 x 18 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎Acer"
            },
            {
                "name": "ASIN",
                "value": "‎B0CJVK8PF5"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎October 22, 2023"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 882 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,515 in Electronics (See Top 100 in Electronics) #185 in Computer Monitors"
            },
            {
                "name": "Screen Size",
                "value": "27 Inches"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "2560 x 1440"
            },
            {
                "name": "Special Feature",
                "value": "Height Adjustment, Pivot Adjustment, Swivel Adjustment, Tilt Adjustment, Built-In Speakers"
            },
            {
                "name": "Refresh Rate",
                "value": "180 Hz"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page 1 AMD FreeSync Premium 2 Up to 180Hz Refresh Rate 3 Up to 0.5ms",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8fb625f6-e78b-4b9c-a246-6e044e9738ab.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eac37d0c-60c6-4dec-8a7e-7f48c010983a.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55ff8af3-c5d3-4c8c-865f-8833a517627b.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a99cdbc2-ee42-4d62-8dd0-cf549de70289.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8caefe7f-4737-4f98-a151-be9296ed1929.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b7839de-54c4-415c-b816-c58439a42806.__CR0,0,1464,600_PT0_SX1464_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BenBen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMIE4V7VMXFO7VI2D3RFXDZPUKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMETFBBQ72C3C?ASIN=B0CJVK8PF5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2020",
                "reviewTitle": "5.0 out of 5 stars Excellent Monitor",
                "reviewText": "Long Review, forgive me!Wow, ok guys, I got to tell ya…..this Acer Predator XB323U GP monitor is really really good. Let me give you a little back story really fast though. I am replacing my Acer Predator XB271HU and I am currently testing a Dell S2721DGF at the same time I am testing this XB323U. So I am comparing two really good monitors right now, 1 will stay on my desk and the other goes back. These are my initial thoughts after owning this monitor for the past 36-48 hours.So the XB323U arrived, in a massive box by the way. The box was like 35 pounds or something. The monitor is fully assembled when you take it out and that probably explains why it is so big. It comes with a headset holder that you attach to the stand and it comes with a DP 1.4 cable, HDMI 2.0 cable, and a USB cable so you can use the USB ports on the monitor. I personally bought an extra longer DP 1.4 cable so I could better cable manage around my desk. So that is what comes in the box…..no assembly required. The stand is made of metal, not plastic, and feels very durable. The entire build quality of the monitor definitely feels premium, kind of like buying a really nice Lexus over a base model Honda to compare.So here are my initial impressions upon turning it on. Forgive me because I will make a few comparisons to the Dell S2721DGF throughout this review which I am sure most won’t mind because that is a kick ass monitor too. This is a AHVA IPS panel on the XB323U and it is really good. The Dell has a LG nano IPS panel in it. The Dell has an extremely vibrant color set out of box and I recommend anyone buying one to use custom color settings. My XB323U came and appears to be calibrated out of box. On standard color settings the only thing I did was up the brightness to around 75 and contrast to around 50. I like to use the Eizo Monitor Testing suite to see how well my monitors perform for initial testing. I had a perfect pattern tests as lines were straight and colors looked great and faded perfectly. I had zero dead or stuck pixels and one of the most important things is I had virtually zero back light bleed with my panel minus an almost unnoticeable area on the bottom right side of the screen. I am nit picking here because unless you are in a pitch black room with an all black screen it’s virtually unnoticeable. IPS glow is minimal but only noticeable if the entire screen is black. To be honest, I was extremely surprised at how well the black contrasts on this monitor are. For IPS, at least on this one I got, the blacks are super on this monitor…..bravo Acer! I’ve had my fair share of TN and IPS monitors and this is the best one I’ve seen to date. Keep in mind it varies from monitor to monitor. One important thing for me is black and color uniformity throughout the panel and how well the panel is evenly lit across. Without having actual test equipment, I perceive no lighter or darker areas on the monitor and colors seem fantastic. This seems to be one of the best uniformed panels I have owned to date. Also my gamma seemed to be on point at 2.2 using the Eizo Monitor Testing suite.For productivity work using Excel, Word, CAD, Chrome and Edge, etc. the size of this screen is very enjoyable and easy on the eyes. Text in all font sizes is clear and sharp. I like the extra size and real estate to have multiple windows open and toggle between them side by side. On smaller monitors you can’t really do this effectively. This is much more enjoyable to work on than the Dell S2721DGF. Also, watching videos on YouTube and Netflix was enjoyable and should provide a great experience for anyone wanting to play media on this monitor.For gaming, this is where the monitor really shines. My gaming rig uses a 8700k OC’ed to 4.8ghz on all cores, 32gb 3200mhz Corsair Vengeance memory, and a EVGA RTX 2080 XC Ultra. I spent a solid 8 hours last night putting this monitor through a variety of games I play a lot such as CS:GO, PUBG, Battlefield 5, Apex, Rogue Company, PGA Tour 2k21, Diablo 3, and League of Legends. I am an avid CSGO and PUBG player so those stick out the most to me during my testing. For me, I think Acer did right on this panel to cap it at 170hz as it provides buttery smooth game play, with GSYNC on and off. If you play with GSYNC “off” screen tearing is not even noticeable especially you are pushing 160fps+ however if you are averaging lower fps like around 100 you should be using GSYNC to maximize your experience with this monitor. I can’t perceive any additional input lag while using GSYNC but I tend to keep it off anyways because I can drive high frame rates. Out of box this monitor is configured to run 170hz automatically as long as you use a display port 1.4 cable. The monitor comes with 3 overdrive settings: off, normal, extreme. Normal overdrive is the best setting I found and ghosting is non-existent. The input lag and responsiveness is seriously excellent and will make serious gamers very happy. On a side note, there is a setting in the OSD called “Ultra Low Latency”…..DO NOT turn this off. It is on by default and is important to keep your input lag low…..I am not sure why anyone would turn it off anyways…..just don’t touch it! In regards to HDR content, I am a little new to the HDR world. I did fire up Battlefield 5 and turn HDR on it things seemed a little more vibrant and bright. HDR is something I am going to have to play with a little more to see how to fully utilize it so my initial thoughts here are just that. I will add more to this post later about HDR. Just know that with HDR turned off the maximum brightness is 400nits and with HDR enabled it is 600nits and there is some sort of zone dimming on the edges otherwise this could not have achieved Vesa’s HDR600 rating. This is a really fast IPS panel and is definitely a step up in speed compared to my old Acer Predator XB271HU (still a great monitor btw!). Comparing my gaming experience to the Dell S2721DGF I am testing is so similar. I can honestly say that the Dell using the LG nano IPS technology feels really great for FPS gaming on a 27inch but there is something about the immersive experience I get on this XB323U that makes it stand out above the Dell. I think it’s the size, brightness, and how well the black contrast and uniformity is that makes it seem better. I will say though, the Dell has a little better black equalizer option in the OSD.If you are worried about the 93 PPI on a 32inch 1440p monitor, don’t worry. I sit a few feet away and can not see any pixels. If you sit with your face in the monitor you will see pixels and probably destroy your eyes so make sure you sit 3-4 feet away or more and you’ll notice the image and pixel density is really perfect. It compliments the resolution and size of the monitor very well. So for those PPI nerds out there, chill out…..this monitor looks fabulous. Also, I know people are itching to get 240hz 1440p panels but please be realistic in what you ask for. Most gamers are not going to be able to take advantage of true 240hz 1440p gaming and secondly to pay additional money for an almost unnoticeable difference is a throw away unless you are in the top %0.5 of gamers who need every last millisecond to compete on a professional stage. I am a monitor snob and I have bought and returned a few 1080p 240hz panels over the past year and the feel between 170hz and 240hz is almost imperceivable. This is the XB323U GP and the XB323U GX 240hz is supposed to come out after the 1st of the year….bare in mind that the GX is supposed to only be a HDR400 monitor too so there is a trade off depending on what you seek.In conclusion, the Acer Predator XB323U is really a fantastic monitor. I was worried about buying this at first because this is a brand new release and no reviews were anywhere to be found. So I took a leap of faith and I am really glad I did. I will be returning the Dell S2721DGF to BestBuy and this XB323U will remain on my desk as my new primary monitor. I am excited to see TFTCentral or RTINGS.com do a review on this to see how they rate it. I know it’s going to be good. I think this monitor will compete very well against the Samsung 32inch G7 without all the issues the G7 has. If anyone is on the fence in regards to this monitor, don’t be. It is a premium monitor and it’s price seems justified to me. This will suite you well in productivity, media, and gaming…..even those serious gamers.UPDATE: I have had more time to play around with HDR on this monitor and I must say watching HDR content on this monitor is extremely enjoyable. It's so immersive and the colors are so life like....you almost feel like you could reach out and touch what ever you are viewing. The zone dimming is fantastic on this panel and blacks look very good and mesh well with vibrant colors. Everything is so sharp and crisp. In regards to HDR gaming, after playing around with HDR settings in some games, I don't think HDR gaming is fully there yet in video games. I messed around with BF5, Shadow of Tomb Raider, and No Man's Sky........HDR just didn't seem to pop for me in those games. Was there improvement, yes but not like the experience you get while watching HDR videos and movies. It is very important to know that you need to turn HDR \"on\" in the screen menu before turning on HDR on in the windows Display Settings......otherwise you won't experience HDR to its fullest. I've set up a profile for gaming with HDR turned off and a profile for HDR that I swap between on the monitor. I love it, seriously love this monitor.16 JAN 2020 UPDATE: Almost 3 months in using this monitor and I love it. I love it so much that I am tempted to pick up a 2nd one and go dual display. Colors are great, response times are great, gaming on it feels fantastic. This a great all around monitor and should fill the 1440p big screen gap for a lot of folks out there.",
                "reviewVotes": "111 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61Cr8V6Xi5L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61GkEcN-kFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61k+ppA+XZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71CT-OikwkL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6NOQ6AJV33I7ZOCWTMT7US7GQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V6PCVC3CHFW3?ASIN=B0CJVK8PF5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2020",
                "reviewTitle": "5.0 out of 5 stars GOOD MONITOR FOR THOSE THAT LIKE FLAT 32 INCH IPS GAMING PANELS",
                "reviewText": "The colors pop on this.The important thing is sleep functionaility that this monitor has when I set my windows to turn off monitor after 5 minutes. All the items are there when I wake it up. The previous G7 I tried and returned would actually relocate all the windows I had open previously to the left or right monitor in my multi monitor setup. When you press the power button on this monitor it does shift around the windows to a different screen. However since I have my screens auto turn off I am okay that it doesn't have that as my previous omen 32 inch.GET A GOOD CABLE. If long distance get a fiber optic cable as it is a game changer.Works good with the cable I bought for it:RUIPRO 8K Fiber DisplayPort Cable 50 feet Light High Speed Support 32.4 Gbps 8K60HZ DP1.4 Slim and Flexible with Optic Technology 15m (8K_15M)My previous gen fiber cable did not run well and I was getting dropping of frame rates to about 30 in my starcraft 2 game because the bandwidth is just not there so cable is important.I LOVE THAT IT IS FLAT. It's a personal preference having tried the G7 curved which is nice for gaming but takes a lot more space being mounted on the wall.The buttons are straight forward. Go to NVIDIA Control panel and find a setting to turn on 10 bit color. I have it set to HDR 600 and it seems to run nice.SO IF YOU WANTFLATIPS32 INCHGAMING1440pThis is the one you want.I hope this helps future buyers.OH and what is cool is that the cables are facing downwards like on Dell monitors which is really nice. It's VESA mountable. The stand comes pre-attached and is heavy duty but using the wall mount from my previous 32 HP omen that this replaced.The high refresh rate makes gaming more fun.The resolution is nice because I use old apps and I just keep 100% scaling.The 1440p is easier to run at high refresh in games.170hz works out of the box and is not some overdrive or other gimmic, so it's truly 170hz at 10 bit and is gsync freeesync compatible.Anyways I hope you all enjoy what you are looking for.And colors and movies definitely pop because of the IPS.",
                "reviewVotes": "50 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AryaArya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ3TXJCJ3KQLFASSVR3DLMF347Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Y1EXUNSBGOFZ?ASIN=B0CJVK8PF5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "5.0 out of 5 stars OUTSTANDING",
                "reviewText": "The media could not be loaded. Im so happy and thankful to the lord I was able to purchase this monitor. Now I never write reviews for amazon like I just get my stuff and be happy but THIS RIGHT HERE? Yeah don’t second guess it just GET IT. It was heavy and big but I was able to set it up and put my PS5 underneath my desk. Long story short beautiful monitor and amazing performance with graphics. Extremely fast also so ya getting a bang for your buck. You want a outstanding monitor? Well ya gonna have to break the bank like I did. Totally worth it. You only live once. Gaming monitor>>> TV",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61XZWK4lKbL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e523623d-ffc6-4637-be42-3ed18db45271/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Good enough.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBMKPAT5EPTHLBAZ26WRKKLHNXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XBFGEHD2GCGI?ASIN=B0CJVK8PF5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Near-perfect monitor, with a pretty large caveat.",
                "reviewText": "This monitor is pretty much the apex of monitors if you don't mind LCD panels.Pros:-Color accuracy (though, it does have a green tint out of the box)-low motion blur-HDMI 2.1 compatibility-lots of ports-Good standCons:-Despite it having HDMI 2.1, it's bandwidth is limited to 28mbps, so unless your connected hardware supports DSC you won't get the most out of the monitor.-The build quality seems a bit cheap for the price",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "daniel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 24, 2024",
                "reviewTitle": "Mejor monitor para consolas",
                "reviewText": "Para ps5 es la mejor opción aprovecha totalmente las capacidades, 1ms, 2.1 HDMI, HDR y 4k.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sean",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 8, 2023",
                "reviewTitle": "Amazing as always",
                "reviewText": "I have two XB271HK Acer 4k monitors at 60hz, and I wanted a third main one for gaming at 144hz. This monitor is the exact same colouring and brightness as the other, exactly what I was looking for at a high refresh rate.Helpful TIP: The monitor is set on eco mode and has ACM disabled by default, so the brightness of the monitor is at it's lowest. Change the brightness, then apply ACM and you'll have full brightness. The selection menu for this feature is very janky as other say, but it works.It requires 1 DP or two HDMI cabled at the same time to achieve the 144hz 4k IF you have a 30 series Nvidia GPU. See Display Stream Compression HDMI 2.1 for more info.The bezels are minimal compared to Acer's other 4k 144hz monitors.This monitor also has HDR support but I don't like when HDR modifies the pixels to look worse.Acer monitors definitely get the job done. Would recommend Acer every time.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nik",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 4, 2023",
                "reviewTitle": "Great monitor, great price",
                "reviewText": "Full disclosure I am not an avid gamer, but for what I do this monitor is excellent. Super crisp and clear image, more brightness than I need, great ergonomic support.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel González",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 21, 2023",
                "reviewTitle": "Excelente monitor calidad/precio",
                "reviewText": "Lo encargue porque había bajado bastante y me sorprendió la calidad de materiales. La calidad de imagen y brillo son bastante buenas. No tiene luz en el fondo del panel como suele pasar en los paneles ips ni pixeles muertos. La verdad no le encontré ningún punto negativo, 10 de 10.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ronaldo Antonio Chavez Montes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 27, 2023",
                "reviewTitle": "Muy buen monitor",
                "reviewText": "En lo personal, es la primera vez que tengo un monitor para gaming de 4k. Sin embargo el HDR funciona muy bien, aunque en algunos juegos suele no detectarlo, pero sin problema el monitor por default lo ingresa a la pantalla. tiene buena respuesta y no he tenido ningun problema la imagen es excelente. Actualmente despues de alrededor de unos 6 meses note un pixel muerto, pero en un monitor 4k sueles no percibirlo, solo en pantallas negras de carga (para garantía tienen que estar al menos 3 pixeles muertos).",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}