{
    "remaining_requests": 29801,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Replacement-Office-Chair-Control-Mechanism/dp/B00CEY7B8O",
    "body": {
        "name": "Replacement Office Chair Tilt Control Mechanism,Alloy Steel- S2979",
        "price": "$21.89",
        "originalPrice": "",
        "rawPrice": 21.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Replacement-Office-Chair-Control-Mechanism/dp/B00CEY7B8O",
        "soldBy": {
            "sellerID": "ATEZW0Y417U2M",
            "name": "chairpartsonline",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ATEZW0Y417U2M&asin=B00CEY7B8O&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41hLYmNeW4L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41NGio8QeZL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: chairpartsonline",
            "link": "https://www.amazon.com/chairpartsonline/b/ref=bl_dp_s_web_7530622011?ie=UTF8&node=7530622011&field-lbr_brands_browse-bin=chairpartsonline"
        },
        "brand": "chairpartsonline",
        "merchantInfo": "chairpartsonline",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 986,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 15. Order within 3 hrs 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Replacement office chair tilt mechanism with 10.2\" long x 6\" wide screw mounting hole pattern",
            "Single lever for gas cylinder height activation, accepts standard tapered gas lift cylinders",
            "Tilt control - push lever in to lock tilt, pull out to unlock",
            "Twist hand wheel to tighten or loosen (adjust) backward tilt tension",
            "Black"
        ],
        "description": "This very popular replacement office chair tilt control mechanism works great for restoring or repairing many office chairs, task chairs, and executive chairs that have the same screw mounting hole pattern",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Furniture & Lighting",
                "link": "https://www.amazon.com/Office-Furniture-Lighting/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1069102"
            },
            {
                "name": "Chairs & Sofas",
                "link": "https://www.amazon.com/Office-Chairs-Sofas/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1069122"
            },
            {
                "name": "Managerial & Executive Chairs",
                "link": "https://www.amazon.com/Managerial-Chairs-Executive-Chairs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1069132"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "chairpartsonline"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "16\"D x 16\"W x 5\"H"
            },
            {
                "name": "Size",
                "value": "16D x 16W x 5H in"
            },
            {
                "name": "Back Style",
                "value": "Solid Back"
            },
            {
                "name": "Unit Count",
                "value": "‎1 Count"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "‎Office"
            },
            {
                "name": "Pattern",
                "value": "‎Solid"
            },
            {
                "name": "Finish Type",
                "value": "‎Black"
            },
            {
                "name": "Room Type",
                "value": "‎Office"
            },
            {
                "name": "Age Range (Description)",
                "value": "‎Adult"
            },
            {
                "name": "Surface Recommendation",
                "value": "‎Indoor"
            },
            {
                "name": "Furniture base movement",
                "value": "‎Rock"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "‎Indoor"
            },
            {
                "name": "Form Factor",
                "value": "‎Metal"
            },
            {
                "name": "Furniture Finish",
                "value": "‎Black"
            },
            {
                "name": "Fill Material",
                "value": "‎Foam"
            },
            {
                "name": "Item Weight",
                "value": "‎4.2 pounds"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎S2979"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B00CEY7B8O"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 986 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#67,123 in Office Products (See Top 100 in Office Products) #243 in Managerial Chairs & Executive Chairs"
            },
            {
                "name": "Date First Available",
                "value": "April 18, 2013"
            },
            {
                "name": "Material Alloy Steel",
                "value": "Item Weight 4.2 Pounds"
            },
            {
                "name": "Frame Material Alloy Steel",
                "value": "Maximum Weight Recommendation 250 Pounds"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tec",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2SWTNNMCH4GK24SJPOQXXIAVTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27AU1XN00DFE6?ASIN=B00CEY7B8O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 22, 2021",
                "reviewTitle": "5.0 out of 5 stars Built to last. Very happy with this",
                "reviewText": "M office chair is a big, high-back leather chair and I'm in it all day every day. And as I'm sitting here leaning back, it occurs to me how nice it is to be able to do that without worrying about it. Because I had issues with the factory base that was weak for years. Even rewelded it a couple of times. Expensive chair, cheap base.But just over a year ago I replaced it with this base, and clearly it is far better made than the original I remember putting it in and it was easy to install, the right fit. The only thing I did was add a couple washers to the front since I like a little more tilt than stock. After all the grief, I just wish I had just replaced it sooner.So back to give this a thumbs up for the long haul. Definitely would be my first choice to order again!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerald M LaGrone",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMUHNPMHMVLKRFRHPHINALXGY5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKNUDL9ZADNHV?ASIN=B00CEY7B8O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars great fit",
                "reviewText": "It was a replacement that worked very well and perfect fit",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Max",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHFCXE2UBEHOY7GH2YZCPNP5LTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KQSSJPJNUI86?ASIN=B00CEY7B8O",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2016",
                "reviewTitle": "4.0 out of 5 stars I would like to explain why this may happen to some purchasers",
                "reviewText": "Before ordering this mechanism, I read all of the Amazon reviews. One reviewer noted that, after installing this mechanism, his chair seemed to tilt forward. I disregarded the comment, speculating that the individual installed the mechanism off center. When I purchased and installed this mechanism, my chair also tilted forward. I would like to explain why this may happen to some purchasers, and how to resolve the issue.Before buying a mechanism or taking your chair apart, lay your chair on its side and look at it from above. You will note that a center post (the gas cylinder) extends from the base to the mechanism that you are replacing. Note the angle at which the post connects to the chair bottom. With many chairs, this angle is nearly 90 degrees. With my chair (a discontinued Laz-y-Boy office chair), the old mechanism had a slight cant, so that, when looking at the chair on its side, it looked like the seat was leaning back a little (it was). In other words, the gas cylinder was not at a 90 degree angle to the seat. When I installed this mechanism with a nearly vertical angle, the chair seemed to lean forward.The solution in my case was fairly simple. I installed a shim at the front of the mechanism. More specifically, I used slightly longer bolts in the front and placed six washers between the mechanism and the chair bottom. This caused the mechanism to lean back a little. The chair is now at the proper angle.The mechanism is solid and good quality. I don't give it five stars because it came without instructions and has no options/adjustability in bolt placement.",
                "reviewVotes": "57 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kat Phiche",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVM2DS5VFTN3PT3U3MGGEKEPABA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R394NBNH168F2M?ASIN=B00CEY7B8O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2021",
                "reviewTitle": "5.0 out of 5 stars Used \"Armstrong method\" to remove and reuse gas cylinder",
                "reviewText": "I looked at several replacements on Amazon and settled on this one after seeing that one of the other mechanisms had reviews complaining about the bolt hole spacing not being correct. The bolt hole spacing on this mechanism part was correct (6 inches by 10.25 inches) for my chair.My broken chair wobbled. The friction flange weld holding the gas cylinder in the mechanism had broken, the chair wobbled and the cylinder could spin freely. It seemed the gas cylinder was OK, I just needed to find a way to free the cylinder from the mechanism so I could reuse it.After a internet search and watching several videos, I determined to use the Armstrong method (brute force and awkwardness.)The other methods I found were as follows:1) use a pipe wrench to free the gas cylinder. This wouldn't work because the gas cylinder spun freely in the broken mechanism.2) purchase or rent a \"lift off\" tool (mychairparts.com.) The tool cost $70 to purchase or $7 dollars to rent. I didn't check to see if I'd have to pay the postage to send the tool back.3) Office Oasis had a cylinder removal tool that came when you purchased a replacement gas cylinder. I couldn't find where just the removal tool could be purchased.4) also Looked at buying a bearing puller or separation tool. The cheapest one I could find was $15.I figured the old mechanism was already broken, nothing to lose by destroying it further.So, back to the Armstrong method.With the old mechanism still attached to the chair and the wheel base removed from the gas cylinder, I used a reciprocating saw with a fine-tooth metal cutting bladee and made 4 cuts. I suppose a hack saw could be used, but this would be a lot more work, and I'm not sure it could make the last cut described below. Be careful removing the wheel base from the gas cylinder, mine had two washers and a star shaped bearing which fell out when I removed the base. The cylinder had a clip attaching to the wheel base. The clip can be removed using a flat tip screwdriver.1) I cut the lift handle on each side between plate attaching to the chair bottom and the hub piece the gas cylinder fit into. I could then remove the paddle that compressed the gas cylinder.2) I cut the pin towards the front of the chair between the plate and hub, on the side the pin was had been compressed. I pulled the pin after cutting.3) I rotated the hub away from the chair and cut the tension/compression spring at its base closest to the chair. I suppose I coould have cut it on the outside of the hub between the adjustment knob and the hub, but it seemed cutting it closer to the base plate would be better to free the hub.The cuts freed the hub the gas cylinder is attached to from the mechanism base still attached to the chair. I could see that the friction flange holding the gas cylinder was still tightly attached to the cylinder, holding the cylinder to the hub. I used a socket that matched the cylinder outer diameter and a hammer to free the cylinder from the hub and compression flange. Using a socket protects the cylinder actuator button as the socket only touches the cylinder, not the actuator. It only took two or three wacks on the socket to free the cylinder from the friction flange.I received the new mechanism, it fit my chair's bolt holes perfectly. It only took 10-15 minutes to remove the old base plate, 6 bolts in all, and install the new mechanism and place it on the gas cylinder that I'd reinstalled in the wheel base. My bolts needed an hex head Allen wrench to remove and reinstall them. Keep your old bolts, the mechanism doesn't come with new bolts.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PmM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFH6PUQXB4NBMMIP2NZRSEB73UYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R252QR4NCRON25?ASIN=B00CEY7B8O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great, but...",
                "reviewText": "This is a great way to save an older chair that is still good. Item is exactly as described and takes the smaller cylinder size. The seller should make this more clear. This is better (heavier) than the original.Removing the old bracket from the cylinder was a challenge. I tried gently (and not so gently) tapping it off. Then I tried to heat the bracket with a blow torch to expand it. I probably should have been more patient, but my angle grinder and a cutting wheel were right there.... So I just cut the old bracket off. There was a minor scar on the cylinder, but its covered....",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeremy Edward Rann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLLCSJNZVOBVQNWMSKS7JMEOWUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA7WUBS1BCFLV?ASIN=B00CEY7B8O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2021",
                "reviewTitle": "5.0 out of 5 stars Works great - chair better than new",
                "reviewText": "I bought my office chair on let go a while back and it's unmarked, so I have no idea what kind it is, but it's more comfortable than other chairs that would be in my price range. The original chair base actually cracked, so it was no longer usable. I measured the bolt pattern before purchasing, and sure enough this product did fit great. I didn't realize ahead of time that removing the cylinder from the old chair base was effectively impossible, so I ended up purchasing another one, but I was able to remove the original wheel base with some WD-40 and a hammer. Something to keep in mind, there are also kits with a chair base, cylinder, and wheel all together that in my case might have ended up working out better and been slightly cheaper, but whatever - I'm very happy with it now. No squeaks and it doesn't lean in a funky direction. Much cheaper than replacing the whole chair.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$21.89",
                "sellerName": "chairpartsonline",
                "sellerRating": "5"
            }
        ]
    }
}