{
    "remaining_requests": 30034,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AmazonBasics-Classic-Office-Chair-Adjustable/dp/B07L3XD93D",
    "body": {
        "name": "Amazon Basics Classic Office Desk Computer Chair - Adjustable, Swiveling, Ultra-Soft Microfiber, Lumbar Support, 28\"D x 25\"W x 43.5\"H, Black",
        "price": "$127.05",
        "originalPrice": "",
        "rawPrice": 127.05,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AmazonBasics-Classic-Office-Chair-Adjustable/dp/B07L3XD93D",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09JT3KCWF"
        ],
        "asinVariationValues": [
            {
                "asin": "B07L3XD93D",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$127.05",
                "variationImageURL": "https://m.media-amazon.com/images/I/31wMQiIoGBL._SS36_.jpg"
            },
            {
                "asin": "B07L3MKRFC",
                "variationName": "Color",
                "variationValue": "Light Gray",
                "price": "$125.89",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ednoRDf-L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71+cI7-Gr6L._AC_SY679_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Basics Store",
            "link": "https://www.amazon.com/stores/AmazonBasics/page/947C6949-CF8E-4BD3-914A-B411DD3E4433?ref_=ast_bln"
        },
        "brand": "AmazonBasics",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 1543,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20. Order within 18 hrs 28 mins",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Adjustable executive office chair with ergonomic support",
            "Ultra-soft 100% microfiber upholstery provides comfort and repels dust, dirt, and stains",
            "Padded headrest, back, and seat cushions for exceptional lumbar support",
            "Sturdy construction with heavy-duty five-point base",
            "Rolling caster wheels and 360 degree swivel capability provide easy maneuverability",
            "Easily adjust height for the ideal writing or typing position",
            "Supports up to 275 pounds"
        ],
        "description": "Product Description Amazon Basics Classic Office Desk Computer Chair - Adjustable, Swiveling, Ultra-Soft Microfiber - Black, Lumbar Support From the Manufacturer Amazon Basics",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Home Office Furniture",
                "link": "https://www.amazon.com/Home-Office-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063312"
            },
            {
                "name": "Home Office Chairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18682064011"
            },
            {
                "name": "Home Office Desk Chairs",
                "link": "https://www.amazon.com/Home-Office-Desk-Chairs-Furniture/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3733721"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Amazon Basics"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "28\"D x 25\"W x 43.5\"H"
            },
            {
                "name": "Size",
                "value": "28\"D x 25\"W x 43.5\"H"
            },
            {
                "name": "Back Style",
                "value": "Solid Back"
            },
            {
                "name": "Special Feature",
                "value": "‎Adjustable"
            },
            {
                "name": "Product Care Instructions",
                "value": "‎Spot Clean"
            },
            {
                "name": "Unit Count",
                "value": "‎1.0 Count"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "‎Office"
            },
            {
                "name": "Maximum Weight Recommendation",
                "value": "‎275 Pounds"
            },
            {
                "name": "Style",
                "value": "‎Adjustable, Swiveling"
            },
            {
                "name": "Pattern",
                "value": "‎Solid"
            },
            {
                "name": "Finish Type",
                "value": "‎Powder Coated"
            },
            {
                "name": "Room Type",
                "value": "‎Office"
            },
            {
                "name": "Age Range (Description)",
                "value": "‎Adult"
            },
            {
                "name": "Included Components",
                "value": "‎Casters, base, gas lift, seat plate, back cushion, seat cushion, arms, hardware pack"
            },
            {
                "name": "Shape",
                "value": "‎Rectangular"
            },
            {
                "name": "Model Name",
                "value": "‎Microfiber chair"
            },
            {
                "name": "Surface Recommendation",
                "value": "‎Indoor"
            },
            {
                "name": "Seat Back Interior Height",
                "value": "‎24.5 Inches"
            },
            {
                "name": "Furniture base movement",
                "value": "‎Swivel"
            },
            {
                "name": "Form Factor",
                "value": "‎Upholstered"
            },
            {
                "name": "Seat Height",
                "value": "‎20.5 Inches"
            },
            {
                "name": "Fill Material",
                "value": "‎Foam"
            },
            {
                "name": "Item Weight",
                "value": "‎29.8 pounds"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎50529"
            },
            {
                "name": "Weight",
                "value": "‎41.66 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B07L3XD93D"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 1,543 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,455 in Our Brands (See Top 100 in Our Brands) #354 in Home Office Desk Chairs"
            },
            {
                "name": "Date First Available",
                "value": "March 19, 2019"
            },
            {
                "name": "Material Microfiber, Foam, Metal",
                "value": "Item Weight 29.76 Pounds"
            },
            {
                "name": "Frame Material Alloy Steel",
                "value": "Seat Material Type Fiber"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MichaelMichael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQZFVDEPM3ARDOOWVM6AMJ5UMAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R49WKTZW5BH7Z?ASIN=B07L3XD93D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 2, 2019",
                "reviewTitle": "5.0 out of 5 stars An honest review. Updated 11/15/23",
                "reviewText": "Original April 2, 2019 ReviewAt the time of purchase there were only 13 reviews and all of them looked like had their chair given to them for free for a review. This is fine. I understand the need to do things like this, especially if you're pretty confident in your product and want more people to know about it. I just didn't like how none of them included pictures, especially for a $90 chair. Also, when you're, I think it's called a \"vine reviewer,\" some reviewers may feel more inclined to give a positive spin on the product in hopes of possibly getting more products free of charge. Just like with pretty much everything in life, there is an upside and downside. So, if you're looking for the first honest review with pictures, this is it.I specifically went with this chair because it came from Amazon (which I believe has good products in general), it has absolutely zero leather (I don't particularly enjoy the idea of sitting on animal skin for for prolongs period of time), it (at least from the Amazon pictures) was 100% black, it was more a high back chair, it was cushioned, and it had 2-day shipping with prime. The reviews also helped. I read them all and took them with a grain of salt. A lot of them seemed pretty sincere with their reviews and I decided to give this purchase a chance.The delivery was perfect. Amazon didn't send any shipping details until the day it was scheduled to arrive. So, for a couple days, I thought it was going to be arriving \"later than expected.\" Fortunately, that was not the case. It arrived within a couple of days. The packaging was perfect. Everything was neatly and tightly bundled. The box itself was even in solid condition. I was very happy about this, especially since I have actually never ordered a chair online until this one.Putting it together was pretty simple. Just make sure you don't tighten all the screws until it's fully put together. Amazon mentions this in their directions but because it was on the bottom of each step I honestly just glossed over it and had to loosen some of the screws. Not a big deal and clearly my fault. If you include taking the chair and all of it's pieces out of the box, putting them together, and then recycling all the trash, it was about a 30-35 minute process. It was very easy to put together and Amazon sends you the tool you need to do it with. There were no missing parts or pieces.Pulling the seat out of the box, it looked pretty big, and I'm a small guy (5'10, 140 lbs) and it felt pretty hard. I like the size of it as I'm used to smaller seats and after I got the chair put together I was very happy to know that the seat is very comfortable.The back of the chair goes up to my shoulders. It truly is 100% black. There is a silver piece that makes up the base but with how Amazon has it designed, it's always fully covered. It spins a full 360 easily and rolls smoothly. Making the height of the chair lower or higher is easy and goes without a hitch. There are no squeaks. It's very comfortable and I'm able to sit on this chair for a prolonged period of time. I honestly love this chair and have zero regrets.The only downside is the \"tilt\" feature. I understand how to lock it and unlock it but I'm not quite sure if I understand which direction to twist the mechanism to make it tilt more or less. Especially with the way it's shown in the directions, it looks like it can tilt a fair amount back but I can't get it to that point. This isn't particularly a significant issue. It could be more of a \"me issue\" than an \"Amazon issue.\" Regardless, it's easily a 5-star product and if you're having doubts about spending $90 on a chair like I did, don't, not on this one. It's a solid choice and you'll have it for many years._____________________Updated Review November 15, 2023I originally reviewed this on April 2, 2019, about 4.5 years ago. I still do not have any regrets for this purchase. I used it daily without issues for hours at a time. I am updating this review now because unfortunately I am getting rid of it and wanted to post how long it actually lasted me, which I feel a lot of reviews are lacking -- longevity; or an estimated timeframe before it needs to be replaced.It still looks great but the seat cushion is now sinking and it's causing me sciatica impacting my lower back and right thigh area. I have tried using lumbar support and a separate seat cushion made for these kinds of issues. It has definitely helped to relieve the pain and I am steadily getting better. However, I also have to put a pillow between the seat cushion of the chair and the separate seat cushion I purchased because the chair sags to the point that the added seat cushion doesn't form properly to the chair.This chair lasted me a long time. $120, which is what it is now priced for, for 4.5 years, boils down to $2.26 a month or $27.16 a year. It's definitely a solid, affordable choice. I tried saving it because I genuinely do not like tossing things out but unfortunately it's reached its lifespan. I would say for the price and daily use, it held its own and then some. People are spending around $300 and more for an office chair. Unless it lasts decades, I honestly cannot understand why. If you're in the market for an affordable office chair and this one caught your attention, I would definitely recommend it 👍I never did learn the tilt feature 😂",
                "reviewVotes": "222 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/711FhiVgPgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71L75dWrrHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71ONeD5hP0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71TGO3TgOyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71TQFuCNasL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71hXy8xYoxL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Messinger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYBBUL2PAZZD43NCDWPSXFWZAXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UK61OO5HKHRF?ASIN=B07L3XD93D",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2023",
                "reviewTitle": "5.0 out of 5 stars What an upgrade!",
                "reviewText": "We have had IKEA office chairs for decades, and this year I didn't see a model I wanted, so we took a chance on these. Wow! They were not the easiest to assemble (a second person helps) but they are SO much more comfortable than any of the ones we had before. If you're worried the microfiber won't look as good as that shiny leather (or pleather, as we used to call it) don't be. It looks great AND it's much more comfortable, and the castors work better, too. Great buy.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIMAOS463R6YKKYW4BRJN6QHOPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IGJP78ET3KQH?ASIN=B07L3XD93D",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2022",
                "reviewTitle": "4.0 out of 5 stars Has its problems, but nice chair.",
                "reviewText": "This chair is an exact clone of the Serta Hannah executive office chair I used several years ago. If you want all the nitty-gritty details, you can hunt down my review for that product, but here are some general comments.Over the years, I have come to the determination that this chair is intended for females. Maybe that's why Serta calls it the \"Hannah\" model. I'm 6'3\", and the chair is way too narrow... don't believe the dimensions at the top of the product page for a second. This chair is NOT 26.5\" wide; more like 19.5\" across the seat, and less at the armpads. The outsides of my thighs scrape against the armrest frame when I'm sitting... worse if there's anything in my pants pockets (and there's always something in the pockets, right?). Often times, I can't get in/out of the chair because the pocket items catch on the armrests. Speaking of the armrests, they sit a little too low for me to work comfortably typing on a keyboard. I can still do it, obviously, just not ideally. As for the back, the very top of the chair back is about 1-2\" below my collar bone. The padded \"headrest\" is squarely at my shoulders.I love the microfiber fabric. It's what drew me to the chair in the first place; but if it's like the Serta--and I assume it is--then it's a thin material and will rip easily if bumped into a desk corner or any brackets underneath (the voice of experience). This is primarily a home office chair and needs a gentle touch.At the time of purchase, the Serta was under $100. Those days are gone, but this Amazon Basics chair is comparably priced to what the Serta once was, and as I've said, this Amazon Basics chair is an exact clone, probably from the same manufacturer (in China).Ah, there _is_ one major difference between this chair and the Serta: the Serta chair came with a warranty, whereas this one does not.All that said, this is a comfortable chair for the most part. It would be much better if it was wider, though. Adjustable armrests would be a plus, but then you're moving into a higher price range. The seat is firm--maybe even extra firm--and while it supports well and is quite comfortable, it also kind of numbs my rear end if I sit in it too long. The lumbar support is decent.Assembly was easy, though it was tricky at times getting the chair back holes to align with the armrests. Some of the screws were difficult to start in correctly. Tip: Don't force the screws or you'll damage the threads. They'll screw in easily when they're straight. Tip 2: Don't tighten down the screws until all eight are in position and partly screwed in. It'll help when assembling the back (you want the armrests to be wobbly). Once all eight are started, then tighten them down.Overall a nice chair for the price.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MarkMark",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 5, 2023",
                "reviewTitle": "Muy comodo pero el color no es como aparece en la imagen y la textura es muy mala y sucia.",
                "reviewText": "La silla es en realidad muy muy cómoda y por el tipo de silla, tamaño y comodidad tiene un precio excelente. Es por estos que le pongo tres estrellas y no cero.Sin embargo la tela deja muchisimo que desear, para comenzar el color en la publicación no se parece al real, en la publicación parece un gris neutro o cálido como hacia el cafe. Sin embargo el color real es como griz-azulado.En segundo lugar es una tela afelpada y por lo tanto se va a ensuciar muchísimo y atrapa toda la suciedad con el tiempo y no es lavable ya que al ser porosa y absorbente se quedan las marcas de agua o se requiere de un costoso servicio profesional de limpieza a domicilio.En tercer lugar por el tipo de tela y su costura parece asiento de automóvil de los 80s de velour que se ve fatal, super viejo así que si tu oficina o residencia es contemporánea o al menos no antigua este asiento no se vera bien. En la foto se ve como se pueden hacer marcas en la tela por el tipo de textura.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51RdY3yGQGL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61bKipPznzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51cmvqSFBsL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patrick GrovesPatrick Groves",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 10, 2019",
                "reviewTitle": "Quite the Upgrade!",
                "reviewText": "To say I'm happy with this chair would be an understatement. For its price, I was pleasantly surprised with the build quality, packaging & ease of assembly. Plus it's incredibly comfortable, so that helps too!It came with its own tools and setup was surprisingly straight forward and quick; I had it together in under 20mins; I could see someone assembling it much quicker, however.Despite the backrest lacking any adjustment, I personally find the default position/lumbar support extremely comfortable, and as an added bonus, it doesn't take up much space, which is great for my tiny office.Highly recommended.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71fM4sU+3NL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rodrigo R",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 29, 2022",
                "reviewTitle": "Muy incómoda",
                "reviewText": "Es cómoda por un rato, pero al pasar ya un rato y querer descansar en el respaldo, me ocasiona dolor en lugar de descanso.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 20, 2020",
                "reviewTitle": "Comfy",
                "reviewText": "SUPER comfy chair!It's nice and soft and the back reclines (however doesn't stay reclined unless you're pushing against it.) Arm rests are at the perfect height. It was easy to build and seems quite sturdy.My only issue has been that because it's such a plush fabric, you can get a bit of a sweaty butt after sitting for a long period of time - it might not be a good chair for homes without air conditioning.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Imelda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 4, 2022",
                "reviewTitle": "No es lo que se ve",
                "reviewText": "El asiento está inclinado hacia abajo y no es cómoda",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}