{
    "remaining_requests": 29982,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Amazon-Basics-Adjustable-Previously-Commercial/dp/B07V8ZMFDQ",
    "body": {
        "name": "Amazon Basics Ergonomic Executive Office Desk Chair with Flip-up Armrests and Adjustable Height, Tilt and Lumbar Support, Cream Bonded Leather, 29.5\"D x 28\"W x 43\"H (Previously AmazonCommercial brand)",
        "price": "$248.93$223.53",
        "originalPrice": "",
        "rawPrice": 248.93,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Amazon-Basics-Adjustable-Previously-Commercial/dp/B07V8ZMFDQ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07V5WK9LL"
        ],
        "asinVariationValues": [
            {
                "asin": "B07V8ZMFDQ",
                "variationName": "Color",
                "variationValue": "Cream",
                "price": "$248.93",
                "variationImageURL": "https://m.media-amazon.com/images/I/31X5sWlsfUL._SS36_.jpg"
            },
            {
                "asin": "B07V5WKJM4",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "$248.93",
                "variationImageURL": "https://m.media-amazon.com/images/I/317f7hxkVWL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61CUGLzW65L._AC_SY450_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Basics Store",
            "link": "https://www.amazon.com/stores/AmazonBasics/page/947C6949-CF8E-4BD3-914A-B411DD3E4433?ref_=ast_bln"
        },
        "brand": "AmazonBasics",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 3194,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 18 hrs 23 mins",
            "FREE delivery Tuesday, February 20. Order within 18 hrs 23 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "The Forest Stewardship Council certified products support responsible forestry, helping keep forests healthy for future generations."
        },
        "features": [
            "Note : To ensure proper assembly, please follow all steps provided in the User manual (provided in pdf below)",
            "Ergonomic High-back executive chair for home or office work spaces, Comply with BIFMA standard;",
            "Upholstered in bonded leather for style and durability; comfortable cushions ideal for long work or gaming sessions",
            "3D incite lumbar to keep yourself supported, adjust your seat to the optimal position",
            "Flip-up arm rests to allow for more flexibility and motion-range when desired; cable-actuated tilt, lock, and height adjustment",
            "Sturdy framework set on a 5-point metallic finished base with oversized rolling caster wheels for extra durability and mobility; 360 degree swivel",
            "Dimensions: 29.5 x 28 x 40-43 inches (DxWxH); seat measures 21.5 x 21.5 inches (WxD); armrests: 26.25–29.25 inches; base diameter: 27.16 inches; chair weighs 41 pounds",
            "Previously Amazon Commercial brand, now Amazon Basics"
        ],
        "description": "An Amazon Brand",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Furniture & Lighting",
                "link": "https://www.amazon.com/Office-Furniture-Lighting/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1069102"
            },
            {
                "name": "Chairs & Sofas",
                "link": "https://www.amazon.com/Office-Chairs-Sofas/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1069122"
            },
            {
                "name": "Managerial & Executive Chairs",
                "link": "https://www.amazon.com/Managerial-Chairs-Executive-Chairs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1069132"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Amazon Basics"
            },
            {
                "name": "Color",
                "value": "Cream"
            },
            {
                "name": "Product Dimensions",
                "value": "29.5\"D x 28\"W x 43\"H"
            },
            {
                "name": "Size",
                "value": "29.5\"D x 28\"W x 43\"H"
            },
            {
                "name": "Back Style",
                "value": "Solid Back"
            },
            {
                "name": "Special Feature",
                "value": "‎Adjustable,Durability,Sturdy"
            },
            {
                "name": "Product Care Instructions",
                "value": "‎3. Do not allow children to play on or near this product., 6. Only a damp cloth should be used to clean the upholstery surface. For persistent stains and overall cleaning, contact a professional upholstery cleaning company., 1. Do not stand on the seat cushion, 4. Please avoid use of sharp objects on or near this product., 8. The casters sold with this chair are intended for use on carpet and not recommended for use on tile or hard wood floors., 2. For indoor use only. Please do not expose to direct sunlight, sources of excessive heat, or use in wet or damp environments., 5. Clean spills / marks immediately, as stains are harder to remove when they are left unattended., 7. Do not use power tools. Only use the Allen Key provided. Check and re-tighter screws and knobs every 90 days."
            },
            {
                "name": "Unit Count",
                "value": "‎1.0 Count"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "‎Office"
            },
            {
                "name": "Pattern",
                "value": "‎Solid"
            },
            {
                "name": "Finish Type",
                "value": "‎Faux Leather"
            },
            {
                "name": "Room Type",
                "value": "‎Office"
            },
            {
                "name": "Included Components",
                "value": "‎Casters, base, gas lift, seat plate, back cushion, seat cushion, arms, hardware pack"
            },
            {
                "name": "Shape",
                "value": "‎Rectangular"
            },
            {
                "name": "Model Name",
                "value": "‎Ergonomic Chair"
            },
            {
                "name": "Arm Style",
                "value": "‎Flip up arms"
            },
            {
                "name": "Surface Recommendation",
                "value": "‎Indoor"
            },
            {
                "name": "Furniture base movement",
                "value": "‎Swivel"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "‎Indoor"
            },
            {
                "name": "Form Factor",
                "value": "‎Upholstered"
            },
            {
                "name": "Seat Depth",
                "value": "‎21.25 inches"
            },
            {
                "name": "Fill Material",
                "value": "‎Foam"
            },
            {
                "name": "Item Weight",
                "value": "‎41 pounds"
            },
            {
                "name": "Country of Origin",
                "value": "‎Vietnam"
            },
            {
                "name": "Item model number",
                "value": "‎50896"
            },
            {
                "name": "Weight",
                "value": "‎41 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B07V8ZMFDQ"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 3,194 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,839 in Our Brands (See Top 100 in Our Brands) #33 in Managerial Chairs & Executive Chairs"
            },
            {
                "name": "Date First Available",
                "value": "October 7, 2019"
            },
            {
                "name": "Material Faux Leather, Polyvinyl Chloride",
                "value": "Item Weight 41 Pounds"
            },
            {
                "name": "Maximum Weight Recommendation 275 Pounds",
                "value": "Style Modern"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "What makes a chair \"Ergonomic\"? Chairs can only be labeled as \"Ergonomic\" if they meet industry ergonomic design standards (e.g. BIFMA G1, ANSI/HFES 100) to provide stable body support in a dynamic posture which is comfortable over a period of time. Can you lean back in this chair? Yes, the chair includes a flexible tilt function as well as swivel capabilities. What is the chair's weight capacity? The maximum weight capacity for the chair is 275 pounds.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SincerelyFromMe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHP4P4YAAT2OTY2XR3PXRN5COUWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X7V2157XLK9K?ASIN=B07V8ZMFDQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars The most comfortable office chair and easy to put together",
                "reviewText": "The color and style of this office chair is what originally caught my eye. The very reasonable price was also a perk. When it arrived earlier than expected, I was thrilled. Instructions to put it together are pictures mostly. This is not a problem because the pictures were pretty simple. It didn’t take much time to put it together. The best part was sitting in it and being completely comfortable and confident that it is sturdy and stylish at the same time. This chair is very attractive and something that I have no problem using in my home office which other people will see.SincerelyFromMe",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A User",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNMOPLQETVJAZKFMBNZCBBPHV2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YM09KAUVS94A?ASIN=B07V8ZMFDQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars So comfortable and supportive!",
                "reviewText": "This is a great chair to sit in for my work all day. It is extremely comfortable and I feel supported by its sturdy structure. Good height, nice color, and it took about an hour to put together. Good deal for the price and I hope it lasts a long time!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ron in Palm Springs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHARFUIPJUDPEPK5R4CGYZAZZRYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXTBI7WXHTA8I?ASIN=B07V8ZMFDQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Mostly comfortable but seems well made",
                "reviewText": "Having had to sit in a chair (from a major manufacturer) that had its flaws but lasted about 6 years, this chair was a change for me. The biggest change was the lumbar support as I never had one before and I'm still getting used to it. As a reference, I am 6' tall and weigh about 200 pounds, so chair size was a concern for me when I did my shopping for a replacement. This chair seems a little small for a larger person BUT I sat in only one other chair for years so this may be an issue I just need to get used to. New shoes can feel odd at first too. I do agree the lumbar support seems to push a person forward and does somewhat restrict the length of the chair seat - about 3 inches of my legs, at my knees, do hang over without support but so far I have not experienced any discomfort. I have learned to sit flush against the seat back (VS slouching) which also maximizes use of the lumbar support which feels good but also odd as I never had the support before. Assembly was pretty easy - always a challenge to add the arms when doing it alone, but I managed. Everything else was VERY easy, and the instructions were helpful and provided enough information. The leather also seems of good quality but only time will tell. I do use the chair every day but never for more than about an hour at a time, but several times a day. The color is also nice - pleasant and nicer than bright white. I would suggest to Amazon however, that they increase the height of the seat back for us taller folk - right now it only comes to about my shoulders because I do not slouch, so resting my head against the back is impossible unless I slide my butt forward, which then offsets the use of the lumbar support. Overall, I am satisfied with my purchase and have no regrets.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike Lewis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7DMOLYPP7ELJBYVZBRAOQ4DM6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK3GFXQQ2HVOD?ASIN=B07V8ZMFDQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2020",
                "reviewTitle": "4.0 out of 5 stars SO FAR, PRETTY GOOD!",
                "reviewText": "I just received this chair yesterday. The star ratings are based on my first impressions and I'll update this review after I've had a chance to live with this chair for a while.So far, it's fairly impressive. It was boxed well and the unpacking simple. The instructions were clear (assuming a person is able to follow pictures that show how to assemble a thing). The necessary hardware was easily identified. The only bump in the road for me was that the instructions show a screwdriver-type tool to tighten the screws but the actual tool provided was an Allen wrench. I have arthritis in my hands so I would have preferred the tool that was shown. Not a reason to prevent someone from purchasing this chair, just my personal preference. It took me about 15 minutes to assemble the chair.It looks great! The floor in my office is ceramic tile and the wheels roll effortlessly over that surface. I also tried it over tight pile carpet. Rolled easily on that service as well. The seat is well padded as is the seatback. I'm 6', 220 lbs. The lumbar support feels very good and hits my lower back in the perfect spot for me. The arms swing up and down very smoothly. The controls for positioning the chair up and down and tilting the back takes some getting used to but once mastered (took about 30 seconds) work well.I sit at my desk several hours throughout the day. I'll be looking to see how well everything holds up in the coming weeks and will revisit this initial review. So far, it's yet another Amazon Essential item that appears to be an excellent value.UPDATE OCTOBER 14, 2020: Three weeks in and I'm very happy with this chair. The seat has now conformed to my butt and the back support continues to be excellent. I actually spend a lot more time watching TV in this chair than I did with my previous office chair. The only thing that will remain uncertain for a while is how long the bonded leather lasts. Not expecting a problem though as Amazon Essential stuff is pretty good.UPDATE: FEBRUARY 8, 2021 - Recent events have me sitting at my computer for 6-8 hours a day. THIS IS THE MOST COMFORTABLE OFFICE CHAIR I HAVE EVER HAD! If you happen to buy this chair I'm willing to bet that you won't be disappointed.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephani",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 15, 2023",
                "reviewTitle": "Es cómoda, buena calidad, pero...",
                "reviewText": "La silla se siente bien, es cómoda, al principio se puede sentir algo firme/duro el asiento, pero después de un par de días de uso se vuelve más cómodo sentarseHay algunos detalles que no me gustan y deberías saber antes de comprarla1. Es una silla algo ancha, soy una persona delgada y mido 1.60, para mi tamaño realmente no es tan cómodo descansar los brazos en la silla ya que tendrás que abrir mucho los brazos para recargarte bien, la mayor parte del tiempo prefiero dejarlos arriba2. en los brazos tiene dos costuras que rodean todo el borde y ese detalle me ha irritado el codo por la fricción, es realmente molesto ya que, si quieres recargarte no lo podrás hacer por mucho tiempo o tendrás la marca de la costura por todo el brazo, no importa si usas un suéter la molestia se sientePor lo demás he de decir que se siente de buena calidad todo, el asiento es cómodo si vas a pasar muchas horas sentado como yo no tienes de que preocuparte en ese sentido, los brazos no me encantan, pero es una percepción muy personal, para ti puede que ese detalle no sea un problema. el respaldo se siente bien.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Char",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 11, 2022",
                "reviewTitle": "Good chair",
                "reviewText": "Looks good. Quality for the price is on par.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Me llego muy rápido, se ve de buena calidad todos los materiales, fácil de armar y muy cómoda, me encanto el colorMe llego muy rápido, se ve de buena calidad todos los materiales, fácil de armar y muy cómoda, me encanto el color",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 25, 2023",
                "reviewTitle": "Buena silla ejecutiva",
                "reviewText": "Me llego muy rápido, estéticamente es muy bonita, elegante y cómoda, fácil de armar, me gusto mucho el color crema.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61o0wm0bVJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+5WdRRBcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61o0wm0bVJL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Avid Reader",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 23, 2022",
                "reviewTitle": "Best Chair Ever",
                "reviewText": "High quality and comfortable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M.Teresa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 31, 2023",
                "reviewTitle": "silla comoda y bonita",
                "reviewText": "la silla nos ha gustado mucho, es comoda y elegante. Para nuestra necesidad quisiera ponerle unas ruedas CON FRENO aparte de giratorias, pero no se que modelo le funcione. Podrian ayudarme?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}