{
    "remaining_requests": 29904,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Home-Ergonomic-Office-Chair-Comfortable/dp/B08VJ2V5P6",
    "body": {
        "name": "BestOffice Ergonomic White Faux Leather Executive Chair with Lumbar Support, Massage Vibration, Swivel, and Armrests for Home or Office Use",
        "price": "$84.99",
        "originalPrice": "",
        "rawPrice": 84.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Home-Ergonomic-Office-Chair-Comfortable/dp/B08VJ2V5P6",
        "soldBy": {
            "sellerID": "A3MXV3BRX5P67N",
            "name": "Cavalier Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3MXV3BRX5P67N&asin=B08VJ2V5P6&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07RHMFD9V"
        ],
        "asinVariationValues": [
            {
                "asin": "B0822JW1MZ",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41OdotfWhyL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Brown",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41-eD7FdCUL._SS36_.jpg"
            },
            {
                "asin": "B08VJ2V5P6",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41TgccmjUZL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "12",
        "stockDetail": "Only 12 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61vcF-RrX7L._AC_SX466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BestOffice Store",
            "link": "https://www.amazon.com/stores/BestOffice/page/CD490172-99DA-415F-81F3-2CE6A6058FB2?ref_=ast_bln"
        },
        "brand": "BestOffice",
        "merchantInfo": "Cavalier Store",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 3368,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$29.99 delivery Monday, February 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "❤Easy to Install - Office chair comes with all hardware & necessary tools. Follow the instruction, you'll found easy to put together, and executive chair estimated assembly time in about 10-15mins.<br><br>",
            "❤Soft and Comfort - Comfortable long use! Massage office chair have a vibrator with remote control, slight vibration can reduce the fatigue caused by your long hours of work.<br><br>",
            "❤Headrest & Lumbar Support & Armrest - Office chair designed with human-oriented ergonomic construction for providing comfort sitting experience. Under the chair, a tilt-tension knob makes it easier or harder to rock back in your chair, depending on which way you turn the knob. has rocked back and forth.<br><br>",
            "❤Good Material - The executive chair is upholstered w/ carefully-selected PU material and filled with high-density sponge padding for a natural leather look for an upscale look and plush comfort you can sink into that requires low maintenance.<br><br>",
            "❤Warranty - Massaging office chair all the parts BIFIMA certification, more reliable and sturdy, this desk chair does include a weight limit of 250 pounds. We wish you will love this chair, if not, please get in touch with us.<br><br>"
        ],
        "description": "We present this high back massage office chair with a unique appearance and feel, unlike most office chair on the market, it have a vibrator with remote control, slight vibration can reduce the fatigue. And If you don't want to use the massage function, you can roll up the data cable and put it in a small bag. This executive chair has a higher backrest to support the entirety of your spinal column. And desk chair offer a stable five-point base with a gas spring, allowing the use to adjust for varying heights to better meet the needs of your office or computer desk. Seat height: 20”-23”; Seat wide: W21”*D21”. Feature ✔Massage office chair have beautiful generous and strong practicability. ✔Office chair have big pillows with the headrest. ✔Size and look makes the office chair ideal for any conference room or office seating, the back executive styling to make you feel relax. ✔The computer desk chair with heavy-duty metal base and arms supports are an attractive contrast to the black finish, with lock height control. ✔360 degree swivel wheel and chair can be more flexible in working station. office chair PU leather chair desk chair adjustable chair ergonomic chair task chair computer chair mid-back swivel chair rolling chair office ergonomic office PU leather desk adjustable ergonomic task computer High back swivel rolling chair desk chair adjustable chair ergonomic task chair PU leather chair office chair armrest chair executive mid-back chair Task chair office computer desk chair chair suitable adjustable chair office chair ergonomic task chair computer chair PU leather chair executive chair swivel chair rolling chair office adjustable desk task computer ergonomic executive swivel rolling chair PU leather chair.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Home Office Furniture",
                "link": "https://www.amazon.com/Home-Office-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063312"
            },
            {
                "name": "Home Office Chairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18682064011"
            },
            {
                "name": "Home Office Desk Chairs",
                "link": "https://www.amazon.com/Home-Office-Desk-Chairs-Furniture/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3733721"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "BestOffice"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Product Dimensions",
                "value": "26\"D x 21\"W x 48\"H"
            },
            {
                "name": "Size",
                "value": "26D x 21W x 48H in"
            },
            {
                "name": "Back Style",
                "value": "Solid Back"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic, Rolling, Cushion Availability"
            },
            {
                "name": "Product Care Instructions",
                "value": "Wipe Clean"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Office"
            },
            {
                "name": "Style",
                "value": "with massage"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Finish Type",
                "value": "Painted"
            },
            {
                "name": "Room Type",
                "value": "Office"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Included Components",
                "value": "No"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Model Name",
                "value": "Massage Comfortable Desk Chair Rolling Swivel Computer Chair with Lumbar Support"
            },
            {
                "name": "Arm Style",
                "value": "With arms"
            },
            {
                "name": "Surface Recommendation",
                "value": "Hard Floor"
            },
            {
                "name": "Furniture base movement",
                "value": "Swivel"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Indoor"
            },
            {
                "name": "Form Factor",
                "value": "Metal"
            },
            {
                "name": "Furniture Finish",
                "value": "Leather"
            },
            {
                "name": "Item Weight",
                "value": "36 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "BestOffice"
            },
            {
                "name": "ASIN",
                "value": "B08VJ2V5P6"
            },
            {
                "name": "Item model number",
                "value": "BestOffice Desk"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 3,368 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#186,392 in Home & Kitchen (See Top 100 in Home & Kitchen) #446 in Home Office Desk Chairs"
            },
            {
                "name": "Finish types",
                "value": "Painted"
            },
            {
                "name": "Assembly required",
                "value": "Yes"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Material Faux Leather",
                "value": "Item Weight 36 Pounds"
            },
            {
                "name": "Seat Material Type Leather",
                "value": "Maximum Weight Recommendation 250 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "1. Home Office Chair Office chair analyzing and fitting the back curve of human body, fixing the constraint conditions, the seat back curve which is more conformed to physiological principle is obtained. 2. Massage Lumbar Cushion Massage office chair have a vibrator with remote control in the lumbar support, slight vibration can reduce the fatigue caused by your long hours of work. so that you won't feel tired even after a long period of work. 3. Ergonomic Armrest Ergonomic armrests of office chair: office chair have PU padded, it soft and support your arm, you can do anything you like! 4. Comfortable Wide Seat Office chair using high-density sponge cushion and breathable premium mesh with soft PU, more flexible, fashion upholstery, beautifully designed and thickness padded. Conforms to body contours, reducing pressure.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/42ac284f-e99a-45b6-b466-229eda38afb1.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Adjustable Private Custom Office chair offers that you can personally adjust height of the chair to match your needs. You can pull out on the control handle, which allows yours to tilt back sit forward, just push the control handle in to prevent it from tilting. Commercial Class-3 Gas Lift Computer chair with commercial gas lift, fast up and down, pass the BIFMA and SGS, you will feel safety, comfortable and convenient in your live. Solid & Stable: Pass the BIFMA Racing chair are designed with human-oriented ergonomic construction that lasts long, and office chair maximum capacity up to 250 lbs, and the base has 2500lbs. for smooth-rolling mobility from one area of the office to another again. 360-Degree Swivel & Casters Office chair have swivels 360 degrees for multitasking convenience, rolling 100000, and its durable casters allow for smooth-rolling mobility from one area to another area.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d8403456-20b6-4046-a7bb-50398b02b01e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/294d7a2c-359b-4733-aef4-5cf99ee39f9b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b99264e6-105d-4236-bc73-84c02e4db00a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f7874719-746a-43ff-972d-e1db24be7248.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/fb810688-64f8-4dd1-bf0c-4b87618663f9.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/42ac284f-e99a-45b6-b466-229eda38afb1.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d8403456-20b6-4046-a7bb-50398b02b01e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/294d7a2c-359b-4733-aef4-5cf99ee39f9b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b99264e6-105d-4236-bc73-84c02e4db00a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f7874719-746a-43ff-972d-e1db24be7248.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/59181eaf-5ef6-40a6-b9c9-39db3308daec.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Grant",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4CHLLDSLCUWJXMKDK2GNQP2MQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R179X91CQ0FFWH?ASIN=B08VJ2V5P6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2022",
                "reviewTitle": "5.0 out of 5 stars Initial impression - it's a great value considering price vs features",
                "reviewText": "I just received this chair and assembled it so I can't yet address long term durability, but my first impression is it's a great value for the price I paid for it ($109 with shipping included - some chairs charge extra for shipping). My old office chair is still holding up and working as it should but the seat has grown hard and uncomfortable so I had been looking at a new chair and comparing prices for a while. This chair's features and price made me take a chance and order one.It arrived early, the assembly instructions were clear, all parts were present, and it went together well with one minor exception. I put it together myself in about 30 minutes without any big problems, and this is how I managed the couple of steps where a second set of hands and/or eyes would have been momentarily helpful (but not absolutely necessary). The holes for the bolts that connect the seat back to the arms can be challenging to get started because it's difficult to see if they're lined up. It turned out the material around the bolt receptacle was the problem. I recommend making sure the material is tucked in tightly around the bolt receptacle so it's not interfering with the bolt getting started. Also, lay the chair on its side (on a pad or carpet) so gravity isn't working against you, and then put just enough gentle, downward pressure on the arm to allow the threads on the first (of two on each side) arm-to-seat-back bolt to start to engage. Now that I put this chair together and know the tricks I could build subsequent ones like a NASCAR pit stop.Finally, the silver plastic buttons that are supposed to hide the bolts in the arms are pretty useless. I knew as soon as I put them in that they were too loose and would not stay in place, and they didn't. They started falling out almost immediately. They don't snap into place and there's really nothing to hold them in. I took them all back out and for now will do without them. If it bothers me enough I'll find a mild glue to hold them in. I wouldn't recommend super gluing them in, just in case you ever need to access the bolts underneath.I've ordered a couple of things recently that I've had to assemble and I'm liking the recent trend with assembly instructions and parts. As opposed to up until the recent past with \"some assembly required\" items that came with jumbled bags of mostly unlabeled parts and hardware, some of which was missing but not obvious until the item was half assembled, this chair came with all needed hardware on a plastic-covered bubble card with the groups of hardware labeled with numbers that correspond to the instructions. Also on the card is the only tool you'll need, a very handy T-handle Allen wrench. There is a parts inventory on the first page and you can easily lay out the parts and know that everything is there before starting the assembly, The instructions are easy to follow and are drawings with labeled hardware and parts. There's no confusing text instructions written by someone for whom English is apparently not their first language.My only question at this point is how well it will hold up, not only the mechanism but the material. It's a very nice, soft, fake leather, but in my experience with so-called \"bonded leather\" or whatever euphemism they happen to use for it, it can seem very nice when it's new, but it soon turns brittle and the top layer starts flaking off. I hope that doesn't happen with this chair, but the reasonable price vs. features made it worth taking a chance. I will edit this review later if the chair does not stand up well to daily use.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesus caballero",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH54C5TRYOE6HJV4KLMQL4AUMMRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39YO7VI4YZGN3?ASIN=B08VJ2V5P6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Very good quality very pleased",
                "reviewText": "After mix reviews wasn’t too sure about but could pay more for an office chair and wanted something bigger and more comfortable and I was not disappointed. This really is good quality with a good a amount of cushion and back support it’s a nice large size and reclines well no issues at all I loved it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tianna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV3ZEK54YUCF2MYZCHCDZN6RWNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OH40FECRI22K?ASIN=B08VJ2V5P6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Decent for price",
                "reviewText": "Very comfy chair. Good price. Massage feature doesn't work as well as I thought it would though",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reginald Lomax",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5TGPTW2FJ4XPPXOTV4VM7RYYMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MDPXII2IJA4V?ASIN=B08VJ2V5P6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2021",
                "reviewTitle": "5.0 out of 5 stars Nice chair but the massage is a no",
                "reviewText": "We like this chair...the support is good I just hate the massage part is more noisy than it is helpful. Chair hums real loud and massage is just minimal that’s why it gets 3 stars. Chair is comfortable though and it looks good with the other furniture in my room. It looked pretty easy to put together, my husband put it together in less than 45 minutes without any real issues.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZGHOPK66276MV3E2C62KKVOYVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PC9GMUXRUKM6?ASIN=B08VJ2V5P6",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "3.0 out of 5 stars Massage broke in just 5 weeks of purchase",
                "reviewText": "I got these chairs for my office and the chair over all is comfy and the massage part was nice until it stopped working after just 5 weeks of using it. I mainly bought it for that purpose so I’m pretty disappointed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eribel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5BITXZYIUGJJDVQ6OJMSXTZ76A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19DP52TMN9KK7?ASIN=B08VJ2V5P6",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "1.0 out of 5 stars Heat and massage don’t work",
                "reviewText": "I just got this chair today. I assembled it and plugged it up to use the massage and heat feature. That’s the main reason I bought this chair. I’m so disappointed. The chair itself looks nice, but not comfortable. I don’t want to be bothered taking it apart to return it so I’m stuck with this broken chair.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David M. Partlow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGH7XIJBN7XLQOFFRY44QZMIEQDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20Z5UBGM8PXU5?ASIN=B08VJ2V5P6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent value, sturdy, comfortable and looks good.",
                "reviewText": "Pretty easy to assemble, the arms gave me a little trouble, just be patient, a little hint though, lay chair on it's side, easier to locate screw holes. Simple to follow instructions and parts are well defined. (Was a no cussing assembly)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amorina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF44KE2MA6E3M36W67CMFBNCAZKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ALIWB37QXMR1?ASIN=B08VJ2V5P6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 9, 2021",
                "reviewTitle": "5.0 out of 5 stars Worth the investment",
                "reviewText": "So I'm a little skeptical with any desk chairs I buy lately due to the fact that I've had two chairs break down on me in 2years, I'm 5'9\" 245lbs. To start my chair arrived earlier than expected 04/07/21, which I thought was pretty cool (even if FedEx was a duche bag and didn't bother to put it near my door but rather at the end of my walkway, thank goodness I have decent neighbors). That being said this is one of the better made chairs I've found; it's got a metal base and I really appreciated the fact that all of the holes aligned when I was putting the chair together; it really took maybe 30 - 45min for me to put it together no longer. I like the massage feature but I honestly could take it or leave it; it's less of a massage and more of a vibration, but it doesn't add or take away from the chair for me. I do find it very comfortable as sometimes I find myself sitting at my desk for several hours with either work or gaming. Truth be told I don't think I'll EVER buy a desk chair again that has the word 'gaming' in it because their all crap; this chair is sturdy, well made and comfortable. The only part of the chair I swapped out were the wheels, because I have carpet and those wheels always break on carpet I went for roller wheels instead and it was a good investment in my situation. https://www.amazon.com/gp/product/B01G643EU6/ref=ppx_yo_dt_b_asin_title_o03_s00?ie=UTF8&psc=1 these are the wheels that I ordered to replace the one's that come with the chair for anyone that is interested.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vrej",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 25, 2024",
                "reviewTitle": "Good product",
                "reviewText": "Big and comfortable to seat long time",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Corinne Flynn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 26, 2023",
                "reviewTitle": "Very good chair at a goo price point",
                "reviewText": "Bought this in December 2022 and waited until I used to to write this review.This is a good chair and the price point is excellent. It moves well and I find it very comfortable on my painful joints. I did buy a lumbar cushion for my back It does take two people to put together as some of the pieces can be cumbersome with only one person. It is hard to screw the pieces together and hold them in place at the same time. It does not have built-in lumbar cushion so you should get one if you need it for sitting. There are ones you can buy that slip over the back of a chair. Those are the only cons I have right now. I will update if things go south.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 30, 2024",
                "reviewTitle": "Office chair",
                "reviewText": "Awesome chair perfect with back massage and so comfy I recommend it 😀",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard  Schwartz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 24, 2022",
                "reviewTitle": "Beautiful Chair",
                "reviewText": "I bought this chair because it seemed like a very good price. And it is well worth it. This chair is the most comfortable chair I have ever owned. The delivery was quick. Assembling it was a little difficult for me because of physical problems, but would be very easy for someone with no disability. It rolls very easily and is very supportive. This is a perfect office chair.. I would definitely recommend it..",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grace daCosta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 23, 2023",
                "reviewTitle": "comfy and sturdy",
                "reviewText": "This office chair is very sturdy and comfortable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}