{
    "remaining_requests": 29992,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ergonomic-Computer-Support-Executive-Rolling/dp/B004ZVHKJE",
    "body": {
        "name": "BestOffice Office Chair Cheap Desk Chair Ergonomic Computer Chair with Lumbar Support Arms Headrest PU Leather Modern Rolling Swivel Executive Chair for Back Pain Women Men Adults,Black",
        "price": "$89.99",
        "originalPrice": "$179.99",
        "rawPrice": 89.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ergonomic-Computer-Support-Executive-Rolling/dp/B004ZVHKJE",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "Usually ships within 2 to 3 days",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/6161yUMDJ6L._AC_SX679_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BestOffice Store",
            "link": "https://www.amazon.com/stores/BestOffice/page/CD490172-99DA-415F-81F3-2CE6A6058FB2?ref_=ast_bln"
        },
        "brand": "BestOffice",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 6330,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 27 - 28",
            "Or fastest delivery February 26 - 27",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "DESIGNED TO UNWIND - This chair was designed for long-lasting comfort, specifically to alleviate the back pain that can result from long working hours. The generously padded backrest and seat cushion relieve back pain and leg pain, while improving your posture.",
            "SLEEK, MODERN DESIGN - Work in style at the office or at home with this ergonomically-designed, high-back office chair. Lined with soft PU leather that is both oil and water resistant, our chair is both eye-catching and long-lasting.",
            "CUSTOMIZABLE COMFORT - This chair is adjustable to suit your individual needs. Adjust the height and tilt to your preference, and enjoy full mobility on 360° swivel wheels.",
            "PRODUCT SPECIFICS - This chair was designed to meet everyone’s specific needs, measuring 20\" (W) x 20\" (D). The seat height can be adjusted from 19\"-23\" and the backrest measures 20\"(W) x 28\"(H).",
            "BIFMA-CERTIFIED - All of our chair’s accessories pass the BIFMA test, ensuring the safety of users up to 250 lbs."
        ],
        "description": "The High Back Office chair is designed to meet your individual needs. Our chair perfectly fits the back curve of the human body, and can adjust to conform to whatever sitting position feels best for you. Lined with attractive PU leather, our chair is both water and oil resistant so your comfort is long-lasting in every sense of the word.",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Furniture & Lighting",
                "link": "https://www.amazon.com/Office-Furniture-Lighting/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1069102"
            },
            {
                "name": "Chairs & Sofas",
                "link": "https://www.amazon.com/Office-Chairs-Sofas/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1069122"
            },
            {
                "name": "Managerial & Executive Chairs",
                "link": "https://www.amazon.com/Managerial-Chairs-Executive-Chairs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1069132"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "BestOffice"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "29\"D x 27\"W x 48\"H"
            },
            {
                "name": "Size",
                "value": "Executive Chair"
            },
            {
                "name": "Back Style",
                "value": "Solid Back"
            },
            {
                "name": "Special Feature",
                "value": "‎Adjustable,Resistant"
            },
            {
                "name": "Product Care Instructions",
                "value": "‎Wipe Clean"
            },
            {
                "name": "Unit Count",
                "value": "‎1.0 Count"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "‎Office"
            },
            {
                "name": "Maximum Weight Recommendation",
                "value": "‎250 Pounds"
            },
            {
                "name": "Style",
                "value": "‎Modern"
            },
            {
                "name": "Pattern",
                "value": "‎Solid"
            },
            {
                "name": "Finish Type",
                "value": "‎Leather"
            },
            {
                "name": "Room Type",
                "value": "‎Office"
            },
            {
                "name": "Age Range (Description)",
                "value": "‎Adult"
            },
            {
                "name": "Included Components",
                "value": "‎1"
            },
            {
                "name": "Model Name",
                "value": "‎Office Chair"
            },
            {
                "name": "Arm Style",
                "value": "‎With arms"
            },
            {
                "name": "Surface Recommendation",
                "value": "‎Hard Floor"
            },
            {
                "name": "Seat Back Interior Height",
                "value": "‎28 Inches"
            },
            {
                "name": "Furniture base movement",
                "value": "‎Swivel"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "‎Indoor"
            },
            {
                "name": "Form Factor",
                "value": "‎office chair"
            },
            {
                "name": "Furniture Finish",
                "value": "‎PU Leather"
            },
            {
                "name": "Seat Height",
                "value": "‎23 Inches"
            },
            {
                "name": "Seat Depth",
                "value": "‎20 inches"
            },
            {
                "name": "Item Weight",
                "value": "‎41.2 pounds"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎OC-2610-Black"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Weight",
                "value": "‎36.1 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B004ZVHKJE"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 6,330 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#53,357 in Office Products (See Top 100 in Office Products) #189 in Managerial Chairs & Executive Chairs"
            },
            {
                "name": "Date First Available",
                "value": "May 9, 2011"
            },
            {
                "name": "Material Leather, Suede",
                "value": "Item Weight 41.2 Pounds"
            },
            {
                "name": "Frame Material Metal",
                "value": "Seat Material Type Leather"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Executive Chair Office chair Office chair Office chair Office chair Office chair Material PU Leather PU Leather PU Leather PU Leather PU Leather PU Leather Tilt & Swivel ✓ ✓ ✓ ✓ ✓ ✓ Reclining Angle 90-125° 90-120° 90-120° 90-120° 90-120° 90-120° Armrest Fixed Arms Fixed Arms Fixed Arms Fixed Arms Flip up Flip up Height Adjustable ✓ ✓ ✓ ✓ ✓ ✓ Colorful Choose Black/Brown Black Black Black/Brown Brown Black Base Metal Metal Metal Metal Metal Metal Weight Capacity 250lb 250lb 250lb 250lb 250lb 250lb Back Style High-Back Mid-Back Mid-Back Mid-Back High-Back High-Back",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8a3236ed-9d52-474f-a616-f90e53e4741a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a3d4f28-8dd4-4e2f-98a6-8533c67621b3.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/980c4cdf-0ad8-483e-add7-33864d601986.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d7e02e82-f66f-4e01-bcd2-063463424283.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6026d07e-731c-4373-82a5-a408086eb36a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/693437b1-69c7-4b4f-9956-650478bfd192.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d9a78182-d361-41f6-8634-768221fd824f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e248a97b-f674-4803-8794-72ffe423f99c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/04431c0b-1aa0-47ff-8a51-4b15d1b029b8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6873c537-bba6-4802-a476-0ce595e0700f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alex Beyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHWA3JAG4KD3GCOLZRRHDRB77AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L0Q4NYUSAW8Z?ASIN=B004ZVHKJE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 4, 2015",
                "reviewTitle": "5.0 out of 5 stars Infinitely better than my other chair",
                "reviewText": "Not really 5 stars, but close enough. This chair was a huge risk for someone like me who doesn't have a lot of money. I must say, it came before its delivery window, which is always amazing. The box was beaten up a bit, but that seems to be a UPS issue since the past three parcels I've gotten from them (including this one), came crumpled quite a bit. Luckily the only slightly fragile thing was this chair. Some minor imperfections here and there, but none enough for me to care. Like one of the arms on the caster has paint chipping off, I can buy car paint, sand it and respray paint it, or do whatever with it, not a problem. Other than that everything was perfect.About Me:Normally wouldn't put this in, but given that this furniture is physique specific, it might help you out. I'm about 65 inches tall (5' 5\", ~165cm), and 210lb (95.25Kg or 15 stone), my torso to top of head is about 32in (81.28cm)Pros:-When I first pulled it out of the box, I was afraid that the back was still too short, since tall back chairs are going the way of the dodo (god that's cliche, sorry too cheesy for me), but they are an annoying rarity now a days, unless you want to pay 300+ for them. So when I saw this chair for $90 and free shipping, I took the risk. So back on point, I took it out and unfolded it on my bed and sat in it to check the back height. It's good enough, since it's impossible to find the perfect chair, it seems. It cradles the bottom of the ball of the cranium, and covers the neck, if I sit in my usual position. That 28\" that they mention is actually the inside measurement of the back, which is nice. I was afraid that they were referring to the outside measurement, that's about 30\" so the seat removes 2 inches. When I'm reclining in it (I have a foot rest of sorts, I use a plastic storage bin), my head comfortably and naturally falls right on to the headrest.-I found it rather easy to install, yes the last two screws that lock the back in place were a bit tricky, and are easy to do alone once you figure out the trick. So at first I thought, I'll sit in the chair, lean back, and place the screws into the slot that way, screw them in just enough to catch, get out of the chair and allen key them. Great theory, terrible in practice. So what I ended up doing with greater success was, using one hand, I pulled on the back of the chair with a light shining on the armrest to see the threading for the screw. Then placing one bolt in that I had easily available on the chair seat, I started screwing it in by hand until it caught. So here is where it does get annoying, you kind of have to use the tooth you get from the few thread turns you got by head since the screws will still be off center. This by far was the most time consuming part, maybe taking 3-5 minutes per arm, but combining my hand strength with using the allen key to force the holes to align better and make sure the screw fell into the slot, I got both in. Everything else up to that point was stupidly easy, except I did screw up and forgot/thought I could put the numatic \"skirt\" (plastic telescopic piece) on after setting the piston in its home, apparently that's not possible, you have to put it on the piston first, then set the piston.-Love the fact that they give you one extra screw each (arm and base screw), and an extra plastic cover for the arm. I haven't ran into other products that offer that.- the padding on the arm rest cover a great majority of the top, my old chair, had like a padded leather island. It goes half way past the inside-back and about two inches past the downward slope.-This thing can really recline, maybe a little too much, thankfully they've got that nob there to control the recline.- I like the contour on it, it hugs the back nicely, and I think there is enough lumbar support on mine-While the padding seems stiff, there seems to be a decent amount, I don't ever feel like I'm hitting any internal structures, even on the arm rest, my elbow isn't/can't dig into it deep enough to hit the hard structure. I had to add padding to my other chair since it was too cushy and my elbow bore through it like it was nothing, making extended mouse use painful.-This chair gets pretty high. my make-shift (folding table on bed risers, I like customization options) desk top is about 36\" off the ground, so it can easily raise itself to a height that makes it comfortable to sit at the desk.Cons:-The padding on my black chair seems stiff at first, I wanted something cushier. Time will tell if I can break it in.-The wheels were and are the only questionable things on this chair, it will be interesting to see how they hold up, if they break, I can buy newer and more durable ones.As of the first day, I would definitely recommend. Easy, prompt deliver, got it the same week I ordered it, so that's cool. Also the material is nice to the touch and feels durable.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VK051907",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM5MZ7YV7DYVDMKES2YHGRSL4OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14BKV3D8ZQ9G8?ASIN=B004ZVHKJE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2014",
                "reviewTitle": "5.0 out of 5 stars Comfortable & Great Chair",
                "reviewText": "After reading many of the reviews on Amazon and a few others, I decided to make the purchase. It's a little higher than I would normally spend on a chair, but having a bad back, comfort comes first.Upon receiving the chair, I decided to see exactly how long would it take to put the chair together and if I needed some assistance from the Mrs. Installation was a breeze, as it only took me roughly 12 minutes to put it all together. The instructions are a bit vague, as it doesn't clearly show, on the instructions, exactly how it's supposed to go. However, you'll notice that they've placed a 'Front ->' sticker on the mechanical part & bottom of the chair. This will help you align everything up.I noticed that some folks were stating that it was hard aligning the holes up. I didn't have that issue. My suggestion is to start by getting one screw in, then go diagonally across the mechanical frame, and place a screw into there. Repeat this process for the other 2 holes, and tighten them up in that same order. However, noting that, only tighten the screw, at first, until it's snug onto the chair frame. Then, once all 4 screws are snug, tighten them completely, in the same order you started them. Doing it this way, I had 0 issues with getting the mechanical frame attached to the chair. That should allevate that issue/concern.The other complaint I saw is there are 2 screws that need to be attached to the chair frame & arm rests. This one was a little bit tricky, as those wouldn't align properly for me. However, I used my free hand (Non-tightening hand) & my knee to help align the holes. This was done by, with my free hand, pulling back on the top of chair (The head rest), and pushing the bottom part of back rest with my knee into the seat. By doing this, I had more control over where the holes were, and I was easily able to get it screwed in, while even placing the screw covers perfectly into the screw holes.Once the chair is completely setup and I sat in it for the first, with someone dealing with back pain, this is one of, if not, the most comfortable chair I've ever sat on. It can even get low enough to the ground that my 5 year old daughter can get herself on it, without any issues. I'm 6'0\", so the high back is a huge benefit, and once I sit down on it, I can easily tell that this is a good quality chair. Granted, I'm not going to claim that it's the top of the line, but for the price & the comfortable level, you can't go wrong with this chair, especially since setup is less than 20 minutes.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6Y3LHRVGS3CXDXMPSFTKQLEYAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R65BOLL46SUI1?ASIN=B004ZVHKJE",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Comfortable size, decent price",
                "reviewText": "Nice size comfortable chair for price! Easy to put together!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael McKimMichael McKim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2OEEVSDV4EDMIYDPDP6VVBY64Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BWQB4S41CMNG?ASIN=B004ZVHKJE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2018",
                "reviewTitle": "5.0 out of 5 stars Cavalier Wholesale is a good company. The chair itself is pretty good.",
                "reviewText": "I absolutely love this company and this chair is really nice. When the chair arrived and I put it together, something was really off. I couldn't figure out what my problem was but the chair was just leaning to the right and it was uncomfortable to sit in. Upon a closer look, the screwholes for the right armrest did not fit exactly and so the screws weren't in all the way. Upon seeing this, I contacted the seller and they emailed me back to say that they would send me a replacement seat immediately to try to fix the problem. Within a week, I got the seat and the same problem remained so I emailed them again and they said they would send me a replacement armrest. I got that three days later and put it on and it works! The company was super good at handling this problem and I would love to buy from them again.The chair itself is pretty good. It is comfortable and firm so I feel like I can sit in the chair for a long time comfortably. It's not the best thing ever but I would say that it is worth the price. The only thing I'm not a fan of is how the high the chair sits on its lowest setting. I feel like it's a bit too high for my desk but it's okay.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/7134TbYrsaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71W866pQ8NL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71o3mAigA6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos Dos Santos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2021",
                "reviewTitle": "Good but not great.",
                "reviewText": "Good but not great.The comfort level could be better the cushion support is not great.More padding would have helped.But overall good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Theresa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 30, 2020",
                "reviewTitle": "Comfy and massages",
                "reviewText": "Easy to assemble, good price, comfy, and it has a massage in it that plugs into your USB, didnt know that when i bought it, Bonus!! Would recommend this chair! Good for home office.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mohamed Abdelgadir",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 11, 2021",
                "reviewTitle": "Assembling problem which has to do with the armrests and the seat/back seat.",
                "reviewText": "Assembling went well, except for a problem I faced. This has to do with the screws of the arm sets into the back seat, specifically the upper screw ( there was no problem with the lower screw). May be this was due to the fact that all the screws supplied (Z28) were of the same size and length, note that they were 8 and not 10 mentioned in the package.Though the chair is assembled I find it inconvenient. I will appreciate your input to fix the problem.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vic",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 8, 2020",
                "reviewTitle": "Nice looking chair but..",
                "reviewText": "This is a great looking chair. It arrived a few days after I ordered it.It feels good when sitting, good padding on the seat and comfy but when leaning back its very uncomfortable.It feels like something is poking my right lower shoulder blade. I have a thick blanket on the back of the chair to help but it shouldn't be that way. Il have to find some kind of cushion for my back.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "🦉 owl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 19, 2020",
                "reviewTitle": "Great!",
                "reviewText": "Amazing value to money! Easy to assemble, and quality is good! Well packaged, and all tools are provided to assemble, including some spare pieces! 5 stars!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$64.99",
                "sellerName": "Cavalier Store",
                "sellerRating": "4"
            }
        ]
    }
}