{
    "remaining_requests": 49074,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Google-Pixel-Pro-Smartphone-Telephoto/dp/B0BCQXCFNT",
    "body": {
        "name": "Google Pixel 7 Pro - 5G Android Phone - Unlocked Smartphone with Telephoto/Wide Angle Lens, and 24-Hour Battery - 128GB - Hazel",
        "price": "$549.99",
        "originalPrice": "$899.00",
        "rawPrice": 549.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Google-Pixel-Pro-Smartphone-Telephoto/dp/B0BCQXCFNT",
        "soldBy": {
            "sellerID": "A1K3J6B4EZ5MRV",
            "name": "Russ Enterprises LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1K3J6B4EZ5MRV&asin=B0BCQXCFNT&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CJJJB7WN"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BCQXCFNT",
                "variationName": "Color",
                "variationValue": "Hazel",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/4161bAE+CAL._SS36_.jpg"
            },
            {
                "asin": "B0BCQWYR2Z",
                "variationName": "Color",
                "variationValue": "Obsidian",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Hk5y9bNvL._SS36_.jpg"
            },
            {
                "asin": "B0BCQWVFPW",
                "variationName": "Color",
                "variationValue": "Snow",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/413Tgk9Li-L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $30 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/310KUcm6SwL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41uZxQmngtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ELnIBbP6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nSfXq1dcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EZmXGfQwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DxehBdeOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EC5k-ScoL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/61jQz00lZtL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/61jQz00lZtL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Google Store",
            "link": "https://www.amazon.com/stores/GoogleLLC/page/080B7645-8292-4117-A6CA-1BF598F3FE26?ref_=ast_bln"
        },
        "brand": "GoogleLLC",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 2348,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 14 - 16.",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Google Pixel 7 Pro is Google’s best-of-everything phone; powered by Google Tensor G2, it’s faster, more efficient, and more secure, with the best photo and video quality yet on Pixel[1].Other camera description:Front,Rear",
            "Unlocked Android 5G phone gives you the flexibility to change carriers and choose your own data plan[2]; works with Google Fi, Verizon, T-Mobile, AT&T, and other major carriers",
            "Pixel’s Adaptive Battery can last over 24 hours; when Extreme Battery Saver is turned on, it can last up to 72 hours[3]",
            "The Google Pixel 7 Pro 6.7-inch Smooth Display makes everything stunning and immersive[4]; it intelligently adjusts up to 120Hz for smoother, more responsive performance[4]",
            "Google Pixel 7 Pro has a 5x telephoto lens with 30x Super Res Zoom[5]; the upgraded ultrawide lens powers Macro Focus to capture the smallest details",
            "With Google Tensor G2 and the Titan M2 security chip, your Pixel is built with multiple layers of security to help keep your personal info safe",
            "VPN by Google One (coming soon) is built into Pixel 7 Pro to help protect your online activity, no matter what app or web browser you use[6]",
            "Get hands-free help with Google Assistant, pair devices easily, and use Find My Device to locate your Pixel phone, Google Pixel Watch, or Pixel Buds[7]",
            "With its durable design and IP68 protection, your phone can handle water and dust[8]; it’s also scratch-resistant, with Corning[R] Gorilla[R] Glass Victus[TM]",
            "Please refer to the product description section below for all applicable legal disclaimers denoted by the bracketed numbers in the preceding bullet points (e.g., [1], [2], etc.)"
        ],
        "description": "Meet Pixel 7 Pro, Google’s best-of-everything phone. Powered by Google Tensor G2, it’s fast and secure, with an immersive display and amazing battery life. It features the best Pixel camera yet, with a telephoto lens and pro-level features like Macro Focus, Cinematic Blur, and more. Plus, it’s Pixel’s most refined design, made with recycled materials.[20] LEGAL [1]Compared to Pixel 6. Speed and power efficiency claims based on internal testing on pre-production devices. [2]Works with all major carriers. 5G service is carrier dependent. Requires a 5G data plan (sold separately). 5G service not available on all carrier networks or in all areas. Contact carrier for details. 5G service, speed, and performance depend on many factors, including carrier network capabilities and signal strength. Actual results may vary. Some features not available in all areas. Data rates may apply. See g.co/pixel/networkinfo for info. [3]For “over 24 hours”: Estimated battery life based on testing using a median Pixel user battery usage profile across a mix of talk, data, standby, and use of other features. Average battery life during testing was approximately 31 hours. Battery testing conducted on a major carrier network. For “Up to 72 hours”: Estimated battery life based on testing using a median Pixel user battery usage profile across a mix of talk, data, standby, and use of limited other features that are default in Extreme Battery Saver mode (which disables various features including 5G connectivity). Battery testing conducted on a major carrier network. For both claims: Battery testing conducted in California in mid 2022 on pre-production hardware and software using default settings, except that, for the “up to 72 hours” claim only, Extreme Battery Saver mode was enabled. Battery life depends upon many factors and usage of certain features will decrease battery life. Actual battery life may be lower. [4]Measured diagonally; dimension may vary by configuration and manufacturing process. Not available for all apps or content. [5]Not available for all camera apps or modes. [6]Coming soon. Restrictions apply. Some data is not transmitted through VPN. Not available in all countries. All other Google One membership benefits sold separately. Use of VPN may increase data costs depending on your plan. See g.co/pixel/vpn for details. [7]Earbuds and watch sold separately. Requires Pixel Buds Pro connected with Fast Pair to a device with location history enabled. Requires Google Pixel Watch to be connected to a compatible device. [8]Designed to comply with dust and water protection rating IP68 under IEC standard 60529 when each device leaves the factory but the device is not water or dust proof. The accessories are not water or dust resistant. Water resistance and dust resistance are not permanent conditions and will diminish or be lost over time due to normal wear and tear, device repair, disassembly or damage. Dropping your device may result in loss of water/dust resistance. Liquid damage voids the warranty. See g.co/pixel/water for details. [9]Maximum resolution and field of view with RAW image files setting turned on. Setting is turned off by default. See g.co/pixel/photoediting for more information. [10]Some third party apps and data may not be transferred automatically. Visit g.co/pixel/copydatahelp for information. [11]Not available in all languages or countries. Not available on all media or apps. See g.co/pixel/livetranslate for more information. Translation may not be instantaneous. [12]Storage specifications refer to capacity before formatting. Actual formatted capacity will be less. [13]Magic Eraser requires Google Photos app and may not work on all image elements. [14]Unblurring may not work on all photos or videos with faces. [15]Requires compatible smart device. [16]The Google One and YouTube Premium 3-month trial offers are available to eligible users with the purchase of Pixel 7 Pro. Offer expires December 15, 2023 at 11:59 pm PT. Valid form of payment required at sign-up, but you will not be charged until the trial period expires. Cancel anytime. See youtube.com/premium/restrictions and one.google.com/offer/terms-and-conditions/pixel7and7pro for full terms. [17]Based on use of Smooth Display (not available for all apps or content). [18]See g.co/pixel/astrophotography for details. [19]Watch and earbuds sold separately. [20]Recycled materials are approximately 19% of phone based on weight. [21]Wireless charging rates up to 20W (Pixel 7) and up to 23W (Pixel 7 Pro) charging with Google Pixel Stand (2nd gen). Up to 12W with Qi-certified EPP chargers. Actual results may be slower. Fast wired charging rates (up to 18W on Pixel 6a, up to 20W on Pixel 7 and up to 23W on Pixel 7 Pro) are based upon use of the Google 30W USB-C® Charger or Google 18W USB-C® (Pixel 6a only) plugged into a wall outlet. Actual results may be slower. Chargers and Pixel Stand sold separately. [22]Measured diagonally; dimension may vary by configuration and manufacturing process [23]Requires compatible USB-C® device (sold separately). Charging speed varies and depends on device capabilities, battery age, usage during charging, and many other factors. [24]Estimated battery life based on testing using a median Pixel user battery usage profile across a mix of talk, data, standby, and use of other features. Average battery life during testing was approximately 29 hours. Battery life depends upon many factors and usage of certain features will decrease battery life. Battery testing conducted in California in early 2022 on pre-production hardware and software, using default settings. Battery testing conducted using Sub-6 GHz non-standalone 5G (ENDC) connectivity. Actual battery life may be lower.",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b?ie=UTF8&node=2335752011"
            },
            {
                "name": "Cell Phones",
                "link": "https://www.amazon.com/cell-phone-devices/b?ie=UTF8&node=7072561011"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Carrier",
                "value": "Unlocked for All Carriers"
            },
            {
                "name": "OS",
                "value": "Android 13.0"
            },
            {
                "name": "Cellular Technology",
                "value": "5G"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth, Wi-Fi, NFC"
            },
            {
                "name": "Wireless network technology",
                "value": "GSM, CDMA"
            },
            {
                "name": "Connector Type",
                "value": "USB Type C"
            },
            {
                "name": "Form Factor",
                "value": "Bar"
            },
            {
                "name": "Biometric Security Feature",
                "value": "Fingerprint Recognition"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Shooting Modes",
                "value": "Macro"
            },
            {
                "name": "Water Resistance Level",
                "value": "Water Resistant"
            },
            {
                "name": "Special Feature",
                "value": "Water resistant"
            },
            {
                "name": "Battery Capacity",
                "value": "5000 Milliamp Hours"
            },
            {
                "name": "Battery Description",
                "value": "Lithium-Ion"
            },
            {
                "name": "Charging Time",
                "value": "109 minutes"
            },
            {
                "name": "Battery Power",
                "value": "4926"
            },
            {
                "name": "Rear Camera Resolution",
                "value": "50 MP"
            },
            {
                "name": "Other camera features",
                "value": "Rear, Front"
            },
            {
                "name": "Screen Size",
                "value": "6.7 Inches"
            },
            {
                "name": "Display Type",
                "value": "OLED"
            },
            {
                "name": "Refresh Rate",
                "value": "120 Hz"
            },
            {
                "name": "SIM card slot count",
                "value": "Dual SIM"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "128 GB"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "12 GB"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 2,348 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Brand",
                "value": "Google"
            },
            {
                "name": "Model Name",
                "value": "Pixel 7 Pro"
            },
            {
                "name": "Year",
                "value": "2022"
            },
            {
                "name": "Model Number",
                "value": "GE2AE"
            },
            {
                "name": "Whats in the box",
                "value": "SIM Tool, Quick Switch Adapter, Cell Phone, USB-C to USB-C Cable, Quick Start Guide"
            },
            {
                "name": "Manufacturer",
                "value": "Google"
            },
            {
                "name": "Weight",
                "value": "0.46 Pounds"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "6.42 x 3.02 x 0.34 inches"
            },
            {
                "name": "Color",
                "value": "Hazel"
            },
            {
                "name": "Warranty Description",
                "value": "1 year manufacturer"
            },
            {
                "name": "Operating System",
                "value": "Android 13.0"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Wi-Fi, NFC"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The most powerful Google phone yet.[1] Meet Pixel 7 Pro, Google’s best-of-everything phone. Powered by Google Tensor G2, it’s super fast and secure, with an immersive display, amazing battery life, and the best Pixel camera yet.[17]",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ad8ab5b0-8389-43ab-a68f-57f0efbba732.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Previous page Super Res Zoom for crisp details from far away. Capture amazing photos at a distance with the 5x telephoto lens and up to 30x Super Res Zoom.[5] Macro Focus finds beauty in the details. Even your tiniest subjects look extraordinary – raindrops, rose petals, or a blade of grass. Cinematic Blur adds more drama to your videos. Keep your subject in focus and blur the background for a dramatic effect. Selfies for everyone with Guided Frame. Helps people with low vision take selfies, using audio and haptics to guide a face into frame. A more inclusive camera with Real Tone. Real Tone represents the nuances of more skin tones beautifully, accurately, and authentically. Next page 1 Super Res Zoom 2 Macro Focus 3 Cinematic Blur 4 Guided Frame 5 Real Tone",
                "media_link": []
            },
            {
                "media_text": "Previous page The brains behind Pixel 7 Pro. Google Tensor G2 makes Pixel faster, more efficient, and more secure.[1] Secure to the core. The Titan M2 chip and Google Tensor security core add multiple layers of security. Switch over, don’t start over. Pixel makes it easy to transfer apps, photos, messages, and contacts in a few steps.[10] Made to work together. Get personalized help throughout your day with Pixel phones, earbuds, and the Google Pixel Watch[19] Pixel’s most refined design. Pixel 7 Pro has a sleek, polished enclosure that’s made from 100% recycled aluminum.[20] Next page 1 Performance 2 Security 3 Switching 4 Better together 5 Thoughtful design",
                "media_link": []
            },
            {
                "media_text": "Pick your Pixel. Pixel 7 Pro Pixel 7 Pixel 6a Display 6.7\" QHD+ LTPO Smooth Display[4] - up 120Hz Display 6.3\" FHD+ Smooth Display[4] - up to 90Hz Display 6.1\" FHD+ display[22] - up to 60Hz Camera 48 MP telephoto - 50 MP wide - 12 MP ultrawide[9] - 10.8 MP front camera Camera 50 MP wide - 12 MP ultrawide[9] - 10.8 MP front camera Camera 12 MP wide lens - 12 MP ultrawide[9] - 8 MP front camera Camera features Macro Focus - Super Res Zoom[5] up to 30x - Real Tone Camera features Super Res Zoom[5] up to 8x - Real Tone Camera features Super Res Zoom[5] up to 7x - Real Tone Memory and storage 12 GB RAM - 512 / 256 / 128 GB storage[12] Memory and storage 8 GB RAM - 256 / 128 GB storage[12] Memory and storage 6 GB RAM - 128 GB storage[12] Battery and charging Over 24-hour battery[3] - Wired and wireless charging[21, 23] Battery and charging Over 24-hour battery[3] - Wired and wireless charging[21, 23] Battery and charging Over 24-hour battery[24] - Wired charging[23]",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2e01551-fd1b-46a8-be4f-adc3c0195c47.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/139085b3-9bef-463a-8444-8f3d39c6eb3e.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/71090236-b992-4ceb-a25d-6d918bc3fe72.__CR0,0,300,225_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d0d2d0c-8e0b-4e63-86bb-a321fd1e2a34.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ad8ab5b0-8389-43ab-a68f-57f0efbba732.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b5cb0ad4-fc6e-48ee-84e0-2ea1e590a0c2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2868003-23d3-4394-af39-f6593907a9d9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c48211f1-624c-49c7-b0e8-35cf5880ed6d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e43f6359-2c5b-4fa0-b91d-97daf90568fe.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1efc4a42-9767-46e6-8c4d-428ff38018f4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/945d5e80-fc43-44f5-b3a6-8b949d89727b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4b508f3-b910-4c74-a765-853940ff964e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cfdb7d21-dbda-46c8-bfd5-48f8fa9c4637.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e0326eb-0974-4f49-9541-9bafbe56074c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9843cfe0-235c-41f5-b60a-41bfe3cbd434.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2e01551-fd1b-46a8-be4f-adc3c0195c47.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/139085b3-9bef-463a-8444-8f3d39c6eb3e.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/71090236-b992-4ceb-a25d-6d918bc3fe72.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fcec788e-01ea-47ea-8d2c-62f72f00583e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tommy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6YLCCXB2Z367YA676V4IKPKNVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3349QS1Z73LKX?ASIN=B0BCQXCFNT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Glad I Bought It-Great Phone So Far",
                "reviewText": "I've been with Verizon for years and always bought new phones through Verizon. This is my first unlocked phone purchase. I'm on a Verizon Family Plan and the plan for all lines was upgraded to a 5G Unlimited Data plan not long after 5G went live. I stuck with my 4G-LTE Moto Z2 Play until now when I pulled the trigger on this Google Pixel 7 Pro (512GB). The phone arrived at my door delivered by Amazon Prime next day. After I first turned on and set up the new Pixel 7 Pro I turned it off then I took the SIM card out of my old beat up Verizon Moto Z2 Play and I dropped it into the SIM slot of my new Google Pixel 7 Pro phone, turned the phone back on, and voilà! The phone immediately connected to 4G-LTE initially and I got frowny face, but about 3 minutes later it automatically switched and connected to 5G with 5 bars and I got big smiley face. It's been a solid 5G connection ever since. It was just that easy-peazy for me. The phone is snappy and responsive. Phone calls are crystal clear and sound amazing. The screen resolution and picture is fantastic. Super HD quality when watching 1080P or 4K. The speakers of the phone on speaker-phone sound fantastic, and the speakers sound fantastic even when listening to music or watching a video. The volume goes up very loud and it still sounds very good with little to no volume distortion (depending on the source audio). Bluetooth devices are pairing perfectly and without issues. So far, all the features of the phone work great. Security seems tight and the facial recognition and fingerprints work flawlessly thus far. The camera takes extremely good photos and video and even in very low light they come out very good. I'm trying to think of negatives and I can't really come up with any right now—except maybe that there are a whole heckuva lot of settings of all kinds that you can adjust, which isn't really a negative at all, but it takes a long time to get it all dialed in on an unfamiliar phone. Security options are many which is a good thing. I'm very happy I pulled the trigger on this so far and I'm not quite sure what to make of the 'verified purchase' negative reviews because this Google Pixel 7 Pro rocks. I'll come back and change my rating if that changes.",
                "reviewVotes": "40 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SBPCMechanic",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWZ5XKR55G2G3F7T4LI7D5W644A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HBED70F8PNS2?ASIN=B0BCQXCFNT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2023",
                "reviewTitle": "5.0 out of 5 stars The smartest of the smartphones that you can get your hands on in 2023 so far",
                "reviewText": "\"I don't write many reviews, especially on Amazon, and I was initially skeptical about this phone. However, after using it for 14 days and learning how to make smart changes, I truly love it. I can confidently say that it is the smartest smartphone so far this year for the price you are paying.You may be wondering what excites me about this phone. First of all, you should expect some bugs, but Google is good at fixing them. There are always new features being introduced, and with new features come new bugs. So, what do I love and dislike about this phone?One of the things I love is the incredibly accurate dictation through speech, even with my accent. I have used Samsung phones for several years, and while they have a much sharper and darker contrast ratio than other Android phones, their software experience is not as good as Google's. In my opinion, the Pixel 7 Pro is self-learning and adapts to you. It also emphasizes the most important features of a phone - the phone and texting functions - which is something I missed with all the extra features and bloatware on Samsung phones. For example, even after just 10 days of learning how to optimize this phone, I have never been happier with a phone and it is such a joy to take with me everywhere. I have been dictating texts with no errors so far.The only things I don't like about this phone are the not as sharp screen compared to Samsung, and the Bluetooth quality is not as good. However, if you use adaptive sound, it improves the Bluetooth quality through your headset. Despite these minor issues, the additional features and ongoing support from Google make this phone well worth the price I paid. I did purchase a Samsung Z Fold 4, but now I have to sell it because this phone is so much more intuitive.When you buy this phone, make sure to spend an hour learning how to use it and making important changes before deciding if it is right for you. If you are looking for a simple phone with amazing functionality at a basic level - just phone and text - this is, in my opinion, the the best choice.\"",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marv. T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF54NR6COB7C2QVUGQ2K77ZYBAZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX17T7WZDXNH0?ASIN=B0BCQXCFNT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars It doesn't have the duplicate and lock app feature",
                "reviewText": "I'm so pleased with everything since the order was placed till it was delivered, it was delivered in time, the package was sealed and new as it's description, an incredible service.The down side is mainly from a manufacturers side, being Google a huge if not the biggest company out there; not including the charging wall adapter and most importantly, the clear protector that comes with all devices, it just makes them look disgustingly greedy. The device is beautiful, I've been a Huawei user till the P30 pro that had Google services, and was terrified that this one wouldn't fit my needs but it delivered beyond expectations, two of the features I used the most are not in the operative system, the App lock and replicate app, which is sad because I love those features, aside that... a massive, incredible and resourceful device.I didn't rate de face recognition because I haven't even try it, it's just a feature I'm not a big fan of.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Excelente servicio. Recomiendo al 100%.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 9, 2024",
                "reviewTitle": "Buenisimo",
                "reviewText": "El celular me llegó en excelentes condiciones. Con el tiempo que llevo de usarlo no ha tenido inconvenientes. Estoy muy satisfecho con la compra y recomiendo mucho al vendedor.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 26, 2024",
                "reviewTitle": "Buen precio, buena calidad",
                "reviewText": "La verdad me sentía indeciso con comprar el teléfono había leído algunas reseñas malas y me causo incertidumbre, he de decir que lo primero primero que debes hacer es actualizarlo porque si es verdad que se calienta demasiado en la versión que trae de fabrica (Android 13) una vez se actualiza problema resuelto, si bien la pila no está sobrada no está mal tampoco, velocidad de carga media tirando a bajo lo cual para proteger la batería está bien dependiendo de tus preferencias, el procesador es bastante bueno para un uso mixto con algún juego ocasional, y la resolución y brillo son excelentes, la cámara es la mejor del segmento de precio sin duda alguna compitiendo con segmentos más arriba, el diseño es precioso aunque algo resbaloso recomiendo uso de funda y se siente en general un teléfono muy refinado y optimizado que quiere asemejarse al iPhone pero en entorno Android, una buena opción por si quieres un teléfono bonito, funcional, de muy buena cámara y a un precio no tan elevado, recomiendo bastante.Si surge algún problema vendré a actualizar",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raymundo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 11, 2023",
                "reviewTitle": "Muy bueno mas de 6 meses",
                "reviewText": "Perfecto funcionamiento ya con mas de 6 meses de uso contino uso medio-alto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alias",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 28, 2023",
                "reviewTitle": "Excelente producto y proveedor",
                "reviewText": "El teléfono llegó en tiempo y forma. Y tras una semana de uso creo que fue una compra excelente. El dispositivo es de muy buena calidad, toma fotos extraordinarias, desbloqueo facial y de huella con excelente respuesta. Antes había tenido celulares Galaxy Note, y siento que van igual, obviamente con las respectivas mejoras de pantalla y procesador, además de la diferencia del Sistema que también me ha encantado y los ajustrs propios del Pixel que son increíbles. Recomendadísimo.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TravellerMx",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 26, 2023",
                "reviewTitle": "No sirve el 5G en México",
                "reviewText": "Pues así es. Google bloque el uso del 5G en México y en los países dónde no vende sus teléfonos. Por qué, no lo sé, pero si sirve para 4G. Ridículo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$549.99",
                "sellerName": "Forefront Solutions",
                "sellerRating": "4"
            },
            {
                "price": "$549.99",
                "sellerName": "MaxProductSales (SN Recorded)",
                "sellerRating": "4.5"
            },
            {
                "price": "$899.00",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}