{
    "remaining_requests": 48919,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/OnePlus-T-mobile-Unlocked-Version-Charging/dp/B09BM2FZ3M",
    "body": {
        "name": "OnePlus Nord N200 | 5G T-mobile Unlocked U.S Version | 6.49\" Full HD+LCD Screen | 90Hz Smooth Display | Large 5000mAh Battery | Fast Charging | 64GB Storage | Triple Camera (Renewed)",
        "price": "$94.00 - $84.83",
        "originalPrice": "$104.00",
        "rawPrice": 94.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/OnePlus-T-mobile-Unlocked-Version-Charging/dp/B09BM2FZ3M",
        "soldBy": {
            "sellerID": "A20EQ1BQB4Q2FF",
            "name": "thegadgetdeals",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A20EQ1BQB4Q2FF&asin=B09BM2FZ3M&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": false,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41zFJfWdWiL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31DjIm9v7JL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31-4MDT4-0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21CDO9MyOIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Wx3bUdzNL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "SoonerSoft Electronics",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 259,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 38 mins",
            "FREE delivery Tuesday, February 20.",
            "Or fastest delivery Tuesday, February 13."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": "",
        "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b?ie=UTF8&node=2335752011"
            },
            {
                "name": "Cell Phones",
                "link": "https://www.amazon.com/cell-phone-devices/b?ie=UTF8&node=7072561011"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Carrier",
                "value": "T-Mobile"
            },
            {
                "name": "OS",
                "value": "OxygenOS, Android 11.0"
            },
            {
                "name": "Cellular Technology",
                "value": "5G"
            },
            {
                "name": "Connectivity technologies",
                "value": "Wi-Fi"
            },
            {
                "name": "Wireless network technology",
                "value": "GSM"
            },
            {
                "name": "Connector Type",
                "value": "USB Type C"
            },
            {
                "name": "Form Factor",
                "value": "Smartphone"
            },
            {
                "name": "Biometric Security Feature",
                "value": "Fingerprint Recognition"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Shooting Modes",
                "value": "Macro"
            },
            {
                "name": "Water Resistance Level",
                "value": "Water Resistant"
            },
            {
                "name": "Battery Capacity",
                "value": "5000 Milliamp Hours"
            },
            {
                "name": "Battery Description",
                "value": "Lithium-Ion"
            },
            {
                "name": "Charging Time",
                "value": "2.25 Hours"
            },
            {
                "name": "Battery Power",
                "value": "9 Watt Hours"
            },
            {
                "name": "Other camera features",
                "value": "Rear, Front"
            },
            {
                "name": "Screen Size",
                "value": "6.49 Inches"
            },
            {
                "name": "Scanner Resolution",
                "value": "1080 x 2400"
            },
            {
                "name": "Display Type",
                "value": "LCD"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "2400 x 1080 Pixels"
            },
            {
                "name": "SIM card slot count",
                "value": "Single SIM"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "64 GB"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "4 GB"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 259 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#354 in Amazon Renewed (See Top 100 in Amazon Renewed) #85 in Renewed Smartphones #1,532 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Brand",
                "value": "OnePlus"
            },
            {
                "name": "Model Name",
                "value": "Nord N200 5G"
            },
            {
                "name": "Year",
                "value": "2021"
            },
            {
                "name": "Model Number",
                "value": "N200"
            },
            {
                "name": "Whats in the box",
                "value": "OnePlus Nord N200 5G , Charge Adapter, Type-C Cable, Safety Information, SIM Tray Ejector"
            },
            {
                "name": "Manufacturer",
                "value": "OnePlus"
            },
            {
                "name": "Color",
                "value": "Blue Quantum"
            },
            {
                "name": "Weight",
                "value": "0.01 Pounds"
            },
            {
                "name": "Warranty Description",
                "value": "90 days limited warranty"
            },
            {
                "name": "Operating System",
                "value": "OxygenOS, Android 11.0"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Larry K Freemon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHO5U2MJR6XYUUZONE3CFT27VIQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PMU7CLXLMBLL?ASIN=B09BM2FZ3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Great cheap phone",
                "reviewText": "Super fast and holds a charge",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Business User",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNKXKSFFIECBTDG6BCVMWPO6O6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE62M5N8YSSW5?ASIN=B09BM2FZ3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Best $100 Phone Value, but Maybe Reconsider if Looking to Flash Custom Firmware",
                "reviewText": "This phone is exactly as advertised. The condition is almost perfect, the phone came with an acceptable USB-C cable and AC adapter, and the phone activated on T-Mobile without issue. The software updated once connected to a reasonably recent Android patch level as well.The Problem (for me):I purchased this model because it's compatible with LineageOS. I didn't know at the time that in order to unlock the bootloader on this device, you have to submit an unlocking code to OnePlus, which they in-turn have to approve and then they, supposedly, will send you an unlock token.I requested an unlock code on 11/29/2023 and as of 1/13/2024 it's still listed as \"Status: Applied\" with no response. According to the unlock website it should only take 1-2 weeks to receive an unlock token. It was a Christmas gift so even if they reply now, it won't matter, but just a heads up for those who might be interested in this device for the same reason.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Stanhope",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEFNM22NILFC5U5WI7V4HLYOJAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X9LY5FPIHVL0?ASIN=B09BM2FZ3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2023",
                "reviewTitle": "5.0 out of 5 stars All my fears are gone",
                "reviewText": "My wife has an N200 on T-Mobile so I thought I would upgrade my ON5 to one also. I took a chance on this renewed item, and I am not disappointed. The outer box had apparently had some tape around it and the black box cover showed where tape had been pulled off. Once the box was open, I found a perfect phone with no visible defects at all on screen or case. Swapping the SIM card was easy. The transfer from my old phone worked fairly well although my contact list didn't copy. Fortunately my list is very short and it was easy to reproduce. In less than 2 hours I am calling, photographing, and texting from this phone and getting incoming, with visual voicemail. Still some work to do to personalize it but I couldn't be happier. Great screen, flawless case, all features working. I couldn't be happier.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samuel BSamuel B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOIIP35TTYLDBXHBPSOB5NZL5VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EHIZ726GRFHM?ASIN=B09BM2FZ3M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2022",
                "reviewTitle": "4.0 out of 5 stars Aesthetic design could be better for price. But good still:",
                "reviewText": "The phone overall is enjoyable, as a phone. I’ve had it a few hours and been able to tinker with it and over all I really like the actual design and color and overall aesthetic of the phone. The layout I feel is really nice too, can be a bit glitchy or slow at times but it is good. I really like the finger print scanner. It came with a very slight scratch but I didn’t mind too much. My only dislike of the phone really tho, the camera quality… it’s pretty bad. You can tinker with it a bit to make it slightly better, but it really isn’t very good. But for price, not too terrible💯👍🏾.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61IIaY9rVzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brett E Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFQNHEWHOL5Q2WWKVY6AZ2FHL7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UK5SJJ5QBBJH?ASIN=B09BM2FZ3M",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "1.0 out of 5 stars NOT fully unlocked. (This got long)",
                "reviewText": "When I buy an unlocked phone, I expect it to be FULLY unlocked. I was going to put LineageOS on this thing, but I guess not. I have been beyond upset to have to go through the Oneplus bootloader unlock process. Some sites say it takes 1-2 weeks, but now I'm over 3 weeks and the return window for this phone is rapidly closing (I'll not risk keeping it in this state). There's no reason why this entire process shouldn't have taken more than a few minutes. I kept checking their web site, and the request was received. I contacted Oneplus support and they said they'd get it fixed. Then a few leisurly days later I got an email from them stating there were further problems, and it would take even longer. SERIOUSLY??? The Oneplus system for this should be automated and also should have thrown an error to support if it had gotten stuck. Exceedingly sloppy programming. The speed of business moves in neither weeks nor months but hours and minutes. Other phone unlock processes can be done the same day...Oneplus are acting like this phone was stolen and keep wanting more obscure serial numbers buried deeper and deeper. I didn't even know that some of those serial numbers existed. Am I about to get a visit from the police???I've had my new SIM for a month now and really need to activate it... but I'm stuck paying absurdly higher prices on my FIOS landline that's gotten out of hand. I'm not happy about that. It would have been cheaper for me to buy a more expensive phone from someone else. I'm going to have to contact Mint and ask for an activation extension while my other phone I just bought takes another week to come in. And if anyone is wondering, if I activate the new SIM, I lose my land line and start having to pay for the SIM, and since I don't have a working cell phone, I lose all phone connection. That's not good for someone with really bad health problems.There's also the second issue of not bothering to install and \"move into\" this phone because when a bootloader gets unlocked, it forces a factory reset and WIPES THE ENTIRE PHONE. My whole point of picking a fully unlocked phone is to \"deGoogle\" (check wikipedia for the long answer) and remove all their spyware and Tmo bloat with Lineage (see RAM below). I let my old Google logins expire and I'm not creating a new one where they demand my phone number just so they can track me forever (see \"privacy\" below).Other observations:This phone is a DE2118. This number is critical for the product page. When selling used phones, DETAIL AND ACCURACY IS EVERYTHING! I don't know why it's missing. You can find this model number in Config / About / Version, along with a couple other places.Know what you're getting. This product falls below \"Amazon Renewed\" standards. The phone was packed loosly in a small box with a dinky bubble wrap sleeve. Expect the phone to be tumbled badly by the shipping company. For the people who are complaining about endless problems that are unfixable, this bubble wrap sleeve is NOT enough to protect the phone if it was dropped by the shipper. If you have problems, you need to immediately return the phone under Amazon's policies. The card eject pin was hiding under a box flap. I almost missed it. The screen protection plastic film didn't even cover the top or bottom sections of the screen.Another thing I really don't like is that the charger is a generic USB-2 5v 2a Samsung charger with a USB A to C cable. This should have been a 9v USB-C fast charger (as stated by the manual) if it were really \"equivalent\" like \"Amazon Renewed\" advertises. The USB-C cable fits snugly into the phone but is only 3 feet. It is not enough to go from a floor power strip to a desktop. If you need a USB-C fast charger and didn't get one, you need to immediately return this phone under Amazon's policies and mention \"failed equivalent\" in the reason box.The fingerprint sensor on the power button is questionable and cranky. I never messed with it long enough to figure out if it was really having hardware problems or if it was a bad design.If anyone is curious, this phone did a 400meg Android 12 security update to the Nov 5, 2023 release. I don't know how many others it will officially get, but it won't get Android 13 (not at least from the telco). News Flash: It just decided to update to the Dec 5 patch. Looks like this one is 95megs. The telcos are about a month late with most Android security updates. It looks like this update broke my adb connection and installed cooking videos on the left screen. Way to waste my data and battery with useless videos. No telling how much RAM that's eating up (see below). Oh well, I'm about to factory reset this thing anyways...On the Config / Status page, I do have some concerns that \"Bluetooth address\" is listed as \"Unavailable\". Once I got this thing set up, I was going to pick up a BT headset. If you prefer to use a headset with your phone, you may need to pick up a wired one.If you're wondering why this phone can be so slow, have a look at \"free -m\" in \"adb shell\". This gets technical, but I'll try to keep it somewhat simple.OnePlusN200TMO:/storage/emulated/0/DCIM/Camera $ free -m total used free shared buffersMem: 3485 3243 241 3 6-/+ buffers/cache: 3237 247Swap: 2559 1137 1422I copied this down shortly after I started ADB access. The missing 512megs is probably used by the graphics driver. The rest of the 3.5g of RAM is being eaten by Tmo bloat and Google spyware. There's also 1g in the swap partition (see wikipedia for the long definition). When this phone (or any with too much bloat and swap) \"goes out to lunch\", physical RAM is being swapped to disk (flash chip) in and out until the request you made finally has enough physical RAM to complete. Notice I just mentioned \"flash chip\". Flash is very slow and has a very limited write life cycle (see \"flash memory\" on wiki) and will die a very early death if thrashed by swap. For some of you people who keep having crashing problems with nothing running after factory resets, there's a good chance your flash \"disk\" got burned. Your phone is now e-waste. This is true for ANY phone or portable device. It's the same thing as a microSD card failing. As consumers, we absolutely hate having our device die an early death, but manufacturers love it because you have to buy a new phone much sooner.As a side note, I did a dive into settings and tried to disable the bloatware to get some RAM back. I wasn't very successful. Remember I never installed anything on this phone because I'm waiting and waiting and waiting for the bootloader unlock code.If you're an advanced user, be sure to download the newest versions of ADB and flashboot from the official google site. I was hoping to back this phone up with \"flashboot fetch\", but it doesn't support it. Go figure. (TWRP isn't supported on this phone, either.) This could have been a good way to image backup the phone since many Android backup methods are \"mediocre\" at best.Also note that I've read many reviews of people upgrading to a new phone and their cloud backups NOT restoring when they should have (they wouldn't have been helped by \"fetch\" in this instance). So everyone be careful when moving over to a new phone. Your best bet is to move everything to the microSD card and copy that to your computer BEFORE making a big change. The adb command can be used in \"pull\" mode if you're advanced. It's odd how Google installs so much spyware but can't get that data back to the phone.While looking for a possible way around the bootloader lock, I did come across *#808# that enters Engineer Mode. You can do a number of specific self tests and see some of the lesser used serial numbers if you dig deep. If you dig REALLY DEEP, you can find menus in chinese, and this really upset me. Why? I knew Oneplus was made in china, but not also programmed there, too. China isn't known for privacy. While installing LineageOS will remove a lot of their spyware and some of the back doors, it won't remove the ones that are baseband processor related. That device has its own little CPU and operating system (a little sub computer within your phone) and controls things like the cellular modem, microphone, and may have unrestricted direct access to the main operating system depending on how it's implemented. If I wanted the CCP to be spying on me, I would have bought a cheaper Xiaomi. If your're curious about privacy, head back over to wikipedia and look up: Spyware, Internet privacy, Data privacy, Privacy violation, Targeted marketing, De-anonymize, Mobile security, Surveillance capitalism, Zombie_cookie. That's just to get started. Wiki also sanitizes a lot of this information, so real stories tend to be more gruesome.Ever wonder why illegals crossing the border take the battery out of their phones? Because \"off\" isn't really \"off\". Keep that in mind when reading all the wiki pages. Don't believe me? For the past month, this phone has been sitting \"off\" as a paperweight on top of my desk... Just waiting and waiting and waiting for that bootloader unlock code... One day it turned \"on\" and started making noises. It took me a minute to figure it out, but the phone received an Amber Alert and decided to turn back \"on\". Supposedly these also happen for weather, but the past month has been quiet here. Now ask yourself how an \"off\" phone suddenly decided to turn itself \"on\". (hint: baseband processor mentioned above.)As a final privacy note: If someone was stalking/spying on you as much as Google, the phone manufacturer, and the telcos, if that person was caught, they'd be thrown in prison for a very long time. Something to think about.Moving on... The phone I got has a screen in near perfect shape. I was pleased about that. On the back side is a rather noticable dent that I'm hoping didn't hit the battery. It hasn't charged hot, pushed out the back cover, or burst into flames, so I think it's ok.Since I don't have the bootloader unlock code, I can't say anything about voice quality. The biggest reason I went with this phone was 5G support and most likely easy HD audio in my coverage area (probably better than 4G HD audio). I dumped my previous cell phones and kept my land line for so long because cell-to-cell calls suck badly, and I'm in a major metroplex, so that shouldn't happen. I was really hoping to test this out.I never bothered trying out the 4 cameras and video recording. I did pick up a new 128g SDXC card, but I'm not motivated to do tests on a camera I'm about to return. I'd rather have 1 or 2 cameras in a phone that are high quality rather than having extra cameras that are useless. In a budget phone, we still have to pay for the extra useless cameras which just drives the price up and manufacturer profits down. They're nothing more than case bling.I never bothered trying to figure out battery life since I still can't use this phone. If you do a web search, there's usually a way to pop the back off and unsolder the battery for a swap out for most phones. If you're semi technically inclined, you don't have to be stuck with a used battery that's a few years old. Note that all the spyware bloat I mentioned above will really drain an otherwise usable battery. Swap reads and writes to flash and back are very energy intensive. Most sites ignore this in their reviews.Since this is a Tmo phone, make sure you have Tmo towers nearby and you should be happy with connectivity. I've read too many reviews about people buying a phone and the supported tower is across town and they get lousy reception. Don't be like that. My friends with Tmo phones get good enough reception where I live. In the past CDMA has sucked here, but that's going away, thankfully.So what are my final recommendations in this overly long review???If Oneplus ever got me my bootloader unlock key on time, I would have flashed LineageOS (probably the hard way since it's a de2118) and would have likely kept this phone regardless of the problems I mentioned. My phone needs are minimal given my health problems and I can't work. I like the slightly larger screen given my eyesight problems, too. My usage would involve the phone (obviously), GPS and open source maps, and the camera to document some of my hardware and projects. I wouldn't do any social media on this phone (not that I do social on my desktop, either).If you're expecting to run a lot of on this phone with its 4gigs RAM, it's already filled (see above). With a stripped down mobile operating system, you \"should\" be able to, but it's obvious by the other reviewers complaining about slowness that it's not going to happen. If you live out of your phone and endlessly social day and night, you should look for a phone with 6-8gigs of RAM. Here's a final tip that may seem backwards: A phone with fewer/slower processors and more RAM is usually faster than a phone with more/faster processors and less RAM (hint: remember my swap argument above).If you've made it this far, thanks for reading. If you learned something new, hit the \"Helpful\" button. The Amazon AI seems to like that.Edit: The bootloader unlock key FINALLY came in... a month late. I told them to cancel it as I had a deadline and they missed it by a long shot (screwing me over in the process). I'm not going to be working with a company that screws up that badly on something so simple. I shouldn't have to fight with a manufacturer to get their claws out of something I own and they don't. Since the police never showed up, I'm assuming the phone is legit (per my question above).",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheemoua V.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSWDAZEKYFOTMLB53N4RMSV2QPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B9J0WRKR3JID?ASIN=B09BM2FZ3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Great budget phone",
                "reviewText": "Great budget phone. Obviously you get budget phones knowing it's not the top of the line, but it can complete all of your essential functions for you. OnePlus battery life has always been top tier and I'd say that's the best thing about the phone. I use the phone as a 2nd phone for music and games. It lasts me 2 days plus on 1 charge (since it's my 2nd phone I only use it a couple hours a day). It serves my purpose, so I like it.Things I don't use it for so I could care less, but other might want to know:Camera quality isn't great. Front facing is even worse.Finger print reader is designed for your right thumb, which I'm not a huge fan of.Phone is rather bulky (but this might be something you like)",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joshua Adams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWRTSIEV7WGHSXOI3OBSW3ZCSUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2566LBPA4DVVM?ASIN=B09BM2FZ3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing phone!",
                "reviewText": "The only draw back of this phone is it doesn't tell you the immense amount of features until you find out each one! Every day I've had it I've had a little surprise",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "F. D. JesusF. D. Jesus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEL76OLGT63YHARRWXN2JRSAONQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D9VJ0PHH8KE6?ASIN=B09BM2FZ3M",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "3.0 out of 5 stars Did not work for my Sim(Mint)",
                "reviewText": "The phone was in perfect condition but it did not work for my sim I tried inserting multiple times and even called Mint for support but did not work. Im not a tech person but from what I know a unlocked phone should take any sim. UPS will be picking up the phone the following day for return.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61+rqsS8LzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61IZsGlUcvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert Neal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 25, 2023",
                "reviewTitle": "Great phone",
                "reviewText": "Best budget phone on the market.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Artemis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 12, 2023",
                "reviewTitle": "Not too shabby for a cheap phone",
                "reviewText": "The OnePlus Nord N20 5G isn't a terrible phone by any means. For a budget phone, it more than gives you enough space, and power to play some games, listen to music or take and make phone calls or texts. I recommend this if you need something cheap, or you just need something while your current phone is being repaired or replaced. Great backup, or a phone for the kids!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mumma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 14, 2023",
                "reviewTitle": "It's a good entry level phone. My 13yr old loves it!",
                "reviewText": "Some times the finger print reader glitches",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Very disappointed with rhe package. With one plus mobile I suppose to get one plus charger with this but unfortunately I got Samsung charger which is really unexpected. Very shameful Very disappointed with rhe package. With one plus mobile I suppose to get one plus charger with this but unfortunately I got Samsung charger which is really unexpected. Very shameful ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 7, 2023",
                "reviewTitle": "Shameful",
                "reviewText": "Very disappointed with this package.I ordered Once plus mobile and I suppose to get one plus charger with this but unfortunately I got Samsung charger with this. Which is really unexpected. Shameful",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ns1aYbc8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colton Calhoun",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 15, 2023",
                "reviewTitle": "Trash",
                "reviewText": "Trash 🗑",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}