{
    "remaining_requests": 48865,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Google-Pixel-7-5G-Android-Phone/dp/B0BCQVRH38",
    "body": {
        "name": "Google Pixel 7-5G Android Phone - Unlocked Smartphone with Wide Angle Lens and 24-Hour Battery - 128GB - Snow",
        "price": "$451.54",
        "originalPrice": "",
        "rawPrice": 451.54,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Google-Pixel-7-5G-Android-Phone/dp/B0BCQVRH38",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CJ9SD3QH"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BCQXY52Z",
                "variationName": "Color",
                "variationValue": "Lemongrass",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41g+BsUdVKL._SS36_.jpg"
            },
            {
                "asin": "B0BCQXXRJJ",
                "variationName": "Color",
                "variationValue": "Obsidian",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41-8P9PrydL._SS36_.jpg"
            },
            {
                "asin": "B0BCQVRH38",
                "variationName": "Color",
                "variationValue": "Snow",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41pqHO30kvL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 5 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41pqHO30kvL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51mA49dYSGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41GZr1dztuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417MSwM92XL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41AegkUUYFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511KihRmjmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ml yujmjL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Google Store",
            "link": "https://www.amazon.com/stores/GoogleLLC/page/080B7645-8292-4117-A6CA-1BF598F3FE26?ref_=ast_bln"
        },
        "brand": "GoogleLLC",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 3724,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Google Pixel 7 is powered by Google Tensor G2; it’s faster, more efficient, and more secure, with the best photo and video quality yet on Pixel[1].Other camera description:Front,Rear.Aspect ratio : 20:9, Contrast ratio : >1,000,000:1",
            "Unlocked Android 5G phone gives you the flexibility to change carriers and choose your own data plan[2]; works with Google Fi, Verizon, T-Mobile, AT&T, and other major carriers",
            "Pixel’s Adaptive Battery can last over 24 hours; when Extreme Battery Saver is turned on, it can last up to 72 hours[3]",
            "The 6.3-inch Pixel 7 display is super sharp, with rich, vivid colors; it’s fast and responsive for smoother gaming, scrolling, and moving between apps[4]",
            "Google Pixel 7 has wide and ultrawide lenses with up to 8x Super Res Zoom[5]; and Cinematic Blur brings more drama to your videos",
            "With Google Tensor G2 and the Titan M2 security chip, your Pixel is built with multiple layers of security to help keep your personal info safe",
            "VPN by Google One (coming soon) is built into your Pixel 7 to help protect your online activity, no matter what app or web browser you use[6]",
            "Get hands-free help with Google Assistant, pair devices easily, and use Find My Device to locate your Pixel phone, Google Pixel Watch, or Pixel Buds[7]",
            "With its durable design and IP68 protection, your phone can handle water and dust[8]; it’s also scratch-resistant, with Corning[R] Gorilla[R] Glass Victus[TM]",
            "Please refer to the product description section below for all applicable legal disclaimers denoted by the bracketed numbers in the preceding bullet points (e.g., [1], [2], etc.)"
        ],
        "description": "Meet Google Pixel 7. Powered by Google Tensor G2, it’s fast and secure, with amazing battery life and the advanced Pixel Camera for beautifully authentic, accurate photos with Real Tone and stunning video with Cinematic Blur. Plus, it’s Pixel’s most refined design, made with recycled materials.[11] LEGAL [1]Compared to Pixel 6. Speed and power efficiency claims based on internal testing on pre-production devices. [2]Works with all major carriers. 5G service is carrier dependent. Requires a 5G data plan (sold separately). 5G service not available on all carrier networks or in all areas. Contact carrier for details. 5G service, speed, and performance depend on many factors, including carrier network capabilities and signal strength. Actual results may vary. Some features not available in all areas. Data rates may apply. See g.co/pixel/networkinfo for info. [3]For “over 24 hours”: Estimated battery life based on testing using a median Pixel user battery usage profile across a mix of talk, data, standby, and use of other features. Average battery life during testing was approximately 31 hours. Battery testing conducted on a major carrier network. For “Up to 72 hours”: Estimated battery life based on testing using a median Pixel user battery usage profile across a mix of talk, data, standby, and use of limited other features that are default in Extreme Battery Saver mode (which disables various features including 5G connectivity). Battery testing conducted on a major carrier network. For both claims: Battery testing conducted in California in mid 2022 on pre-production hardware and software using default settings, except that, for the “up to 72 hours” claim only, Extreme Battery Saver mode was enabled. Battery life depends upon many factors and usage of certain features will decrease battery life. Actual battery life may be lower. [4]Measured diagonally; dimension may vary by configuration and manufacturing process. Smooth Display is not available for all apps or content. [5]Not available for all camera apps or modes. [6]Coming soon. Restrictions apply. Some data is not transmitted through VPN. Not available in all countries. All other Google One membership benefits sold separately. Use of VPN may increase data costs depending on your plan. See g.co/pixel/vpn for details. [7]Earbuds and watch sold separately. Requires Pixel Buds Pro connected with Fast Pair to a device with location history enabled. Requires Google Pixel Watch to be connected to a compatible device. [8]Designed to comply with dust and water protection rating IP68 (for Pixel 7 and Pixel 7 Pro) and IP67 (for Pixel 6a) under IEC standard 60529 when each device leaves the factory but the device is not water or dust proof. The accessories are not water or dust resistant. Water resistance and dust resistance are not permanent conditions and will diminish or be lost over time due to normal wear and tear, device repair, disassembly or damage. Dropping your device may result in loss of water/dust resistance. Liquid damage voids the warranty. See g.co/pixel/water for details. [9]Requires Google Photos app. Magic Eraser may not work on all image elements. [10]Some third party apps and data may not be transferred automatically. Visit g.co/pixel/copydatahelp for information. [11]Recycled materials are approximately 19% of phone based on weight. [12]Not available in all languages or countries. Not available on all media or apps. See g.co/pixel/livetranslate for more information. Translation may not be instantaneous. [13]Maximum resolution and field of view with RAW image files setting turned on. Setting is turned off by default. See g.co/pixel/photoediting for more information. [14]Storage specifications refer to capacity before formatting. Actual formatted capacity will be less. [15]Unblurring may not work on all photos or videos with faces. [16]Requires compatible smart device. [17]The Google One and YouTube Premium 3-month trial offers are available to eligible users with the purchase of Pixel 7 Pro. Offer expires December 15, 2023 at 11:59 pm PT. Valid form of payment required at sign-up, but you will not be charged until the trial period expires. Cancel anytime. See youtube.com/premium/restrictions and one.google.com/offer/terms-and-conditions/pixel7and7pro for full terms. [18]See g.co/pixel/astrophotography for details. [19]Watch and earbuds sold separately. [20]Pixel Stand sold separately. Wireless charging rates up to 20W (Pixel 7) and up to 23W (Pixel 7 Pro) charging with Google Pixel Stand (2nd gen) (sold separately). Up to 12W with Qi-certified EPP chargers (sold separately). Actual results may be slower. [21]Measured diagonally; dimension may vary by configuration and manufacturing process. [22]Wireless charging rates up to 20W (Pixel 7) and up to 23W (Pixel 7 Pro) charging with Google Pixel Stand (2nd gen) (sold separately). Up to 12W with Qi-certified EPP chargers (sold separately). Actual results may be slower. Fast wired charging rates (up to 18W on Pixel 6a, up to 20W on Pixel 7 and up to 23W on Pixel 7 Pro) are based upon use of the Google 30W USB-C® Charger or Google 18W USB-C® (Pixel 6a only) plugged into a wall outlet. Actual results may be slower. Chargers and Pixel Stand sold separately. [23]Estimated battery life based on testing using a median Pixel user battery usage profile across a mix of talk, data, standby, and use of other features. Average battery life during testing was approximately 29 hours. Battery life depends upon many factors and usage of certain features will decrease battery life. Battery testing conducted in California in early 2022 on pre-production hardware and software, using default settings. Battery testing conducted using Sub-6 GHz non-standalone 5G (ENDC) connectivity. Actual battery life may be lower.",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Cell Phones",
                "link": "https://www.amazon.com/cell-phone-devices/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7072561011"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Carrier",
                "value": "Unlocked for All Carriers"
            },
            {
                "name": "OS",
                "value": "Android 13.0"
            },
            {
                "name": "Cellular Technology",
                "value": "5G"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth, Wi-Fi, NFC"
            },
            {
                "name": "Wireless network technology",
                "value": "GSM, CDMA, LTE"
            },
            {
                "name": "Connector Type",
                "value": "USB Type C"
            },
            {
                "name": "Form Factor",
                "value": "Bar"
            },
            {
                "name": "Biometric Security Feature",
                "value": "Fingerprint Recognition"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Water Resistance Level",
                "value": "Water Resistant"
            },
            {
                "name": "Battery Capacity",
                "value": "4355 Milliamp Hours"
            },
            {
                "name": "Battery Description",
                "value": "Lithium-Ion"
            },
            {
                "name": "Charging Time",
                "value": "100 minutes"
            },
            {
                "name": "Battery Power",
                "value": "4277"
            },
            {
                "name": "Rear Camera Resolution",
                "value": "50 MP"
            },
            {
                "name": "Other camera features",
                "value": "Rear, Front"
            },
            {
                "name": "Screen Size",
                "value": "6.3 Inches"
            },
            {
                "name": "Display Type",
                "value": "OLED"
            },
            {
                "name": "Refresh Rate",
                "value": "90 Hz"
            },
            {
                "name": "SIM card slot count",
                "value": "Dual SIM"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "128 GB"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "8 GB"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 3,724 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Brand",
                "value": "Google"
            },
            {
                "name": "Model Name",
                "value": "Pixel 7"
            },
            {
                "name": "Year",
                "value": "2022"
            },
            {
                "name": "Model Number",
                "value": "GVU6C"
            },
            {
                "name": "Whats in the box",
                "value": "SIM Tool, Quick Switch Adapter, Cell Phone, USB-C to USB-C Cable, Quick Start Guide"
            },
            {
                "name": "Manufacturer",
                "value": "Google"
            },
            {
                "name": "Weight",
                "value": "0.43 Pounds"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "6.13 x 2.88 x 0.34 inches"
            },
            {
                "name": "Color",
                "value": "Snow"
            },
            {
                "name": "Warranty Description",
                "value": "1 year manufacturer"
            },
            {
                "name": "Operating System",
                "value": "Android 13.0"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Wi-Fi, NFC"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Meet Pixel 7. Powered by Google Tensor G2, it’s fast, secure, and helpful, with advanced photo and video features and amazing battery life.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a06e08d-8b45-4e7f-9330-e299c0636a50.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Previous page Hello, Hollywood. Keep your subject in focus and blur the background for a dramatic effect with Cinematic Blur. The camera that makes you feel seen. Represents the nuances of more skin tones beautifully, accurately, and authentically. Make distractions disappear, just like that. Remove unwanted objects with Magic Eraser. Or adjust their color and brightness so they blend in.[9] Selfies for everyone with Guided Frame. Helps people with low vision take selfies, using audio and haptics to guide a face into frame. Take vibrant photos in low light with Night Sight. Capture city lights, starry skies, and even portraits in low light.[18] Next page 1 Cinematic Blur 2 Real Tone 3 Magic Eraser 4 Guided Frame 5 Night Sight",
                "media_link": []
            },
            {
                "media_text": "Previous page The brains behind Pixel 7. Google Tensor G2 makes Pixel faster, more efficient, and more secure.[1] Secure to the core. The Titan M2 chip and Google Tensor security core add multiple layers of security. Switch over, don’t start over. Pixel makes it easy to transfer apps, photos, messages, and contacts in a few steps.[10] Made to work together. Get personalized help throughout your day with Pixel phones, earbuds, and the Google Pixel Watch[19] Thoughtfully designed. Pixel 7 is beautifully designed with recycled materials.[11] Next page 1 Performance 2 Security 3 Switching 4 Better together 5 Thoughtful design",
                "media_link": []
            },
            {
                "media_text": "Pick your Pixel. Pixel 7 Pixel 7 Pro Pixel 6a Display 6.3\" FHD+ Smooth Display[4] - up to 90Hz Display 6.7\" QHD+ LTPO Smooth Display[4] - up 120Hz Display 6.1\" FHD+ display[21] - up to 60Hz Camera 50 MP wide - 12 MP ultrawide[13] - 10.8 MP front camera Camera 48 MP telephoto - 50 MP wide - 12 MP ultrawide[13] - 10.8 MP front camera Camera 12 MP wide lens - 12 MP ultrawide[13] - 8 MP front camera Camera features Super Res Zoom[5] up to 8x - Real Tone Camera features Macro Focus - Super Res Zoom[5] up to 30x - Real Tone Camera features Super Res Zoom[5] up to 7x - Real Tone Memory and storage 8 GB RAM – 256 / 128 GB storage[14] Memory and storage 12 GB RAM – 512 / 256 / 128 GB storage[14] Memory and storage 6 GB RAM –128 GB storage[14] Battery and charging Over 24-hour battery[3] -Wired and wireless charging[22] Battery and charging Over 24-hour battery[3] -Wired and wireless charging[22] Battery and charging Over 24-hour battery[23] -Wired charging[22]",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/139085b3-9bef-463a-8444-8f3d39c6eb3e.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2e01551-fd1b-46a8-be4f-adc3c0195c47.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/71090236-b992-4ceb-a25d-6d918bc3fe72.__CR0,0,300,225_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/112da8f9-32df-462b-8744-849332dee438.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a06e08d-8b45-4e7f-9330-e299c0636a50.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a5dd3521-289f-4642-b08d-88d0850d4c76.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b17ad0d-3914-47f1-b72c-49233603894e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c35f759-245e-4649-a798-53c9be84a9e9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d232a77-81a2-4d68-ab5c-49ce030af572.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/958be311-1366-4420-8dee-496d6d4ed6dc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2f975a6-19e8-4751-afb4-e0a13a24a47c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c109a657-6094-4b2d-9e83-a003389eaaa7.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7297a5a-134c-4e33-a9e2-05f7ed0e9b3c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dfd47967-399e-4ea9-b131-2881c384760e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3136e10d-68eb-40b0-9f56-0bb7663a8483.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/139085b3-9bef-463a-8444-8f3d39c6eb3e.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2e01551-fd1b-46a8-be4f-adc3c0195c47.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/71090236-b992-4ceb-a25d-6d918bc3fe72.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cb80f7d4-1c29-4756-bfd1-ae5324d5727c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "M. O.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZQH2MTQZK43NU3EUU5HPHJL53Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31W69P3RPSUU1?ASIN=B0BCQVRH38",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars No bloatware, nice camera, but battery life is short",
                "reviewText": "I've had this Google Pixel 7 phone now for about 8 months, after having used Samsung phones for years. The #1 best thing if you switch from Samsung is the absence of all that bloatware, those apps you never use and can't uninstall either. This phone saves so much memory by just not having those apps, and it makes it easier to sort through the apps you do have and find the one you need quickly and efficiently. Huge relief, and that's probably the #1 reason I wouldn't go back to Samsung. Photography is my hobby and for the first time this year, I did not use my SLR camera at all. I feel bad but the camera on this phone was versatile enough for my purposes! Picture quality is excellent. The magic eraser feature in editing is quite a game changer. The fact that the phone saves photos directly to your Google drive is also nice though sharing pics to social media from there isn't that straightforward. I do it all the time but I haven't figured out how to post multiple pics without them appearing in backward order. The biggest negative for the Google Pixel 7 phone is that I need to charge it just about every day. Keep in mind that I don't use it for gaming or listening to music or watching videos. I literally just use it to text, call, google stuff, occasionally for social media, and maps if I'm driving which isn't every day. Even so, I have to charge it approximately every 30 hours. This is the one thing they need to change on this phone. I have a 2022 model and it looks like I'll be getting updates until 2026 which gives them enough time to work on that! The other thing is that fingerprint recognition rarely works. When it does seem to work, I think it's actually the facial recognition thing that comes on at the same time that's opening the phone. Facial recognition works great fortunately. Oh, and just for kicks: the feature I like best that the phone comes with is \"Now Playing\" that identifies what song is currently playing. I put it on my home screen so that I don't have to switch on my phone to activate it. Just a light touch and it tells me what the mystery song I'm hearing in a cafe or on the radio is. My 20-yr-old nephew who is an iPhone user was actually envious of this feature! It's not an app -- it's just a feature that appears in Settings>Sound. To summarize: do I like this phone and would I recommend it? A resounding yes. Should battery life be improved? Also a resounding yes.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ztykid",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKDBQFFY7GZD44BNQK77EWW2K5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YJJU52K9PEDI?ASIN=B0BCQVRH38",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2022",
                "reviewTitle": "5.0 out of 5 stars Opinion from a former iPhone user",
                "reviewText": "Before into the Pixel 7, I have been using an iPhone12 mini for 2 years. And a Samsung Note 9 before that. Why I chose the iPhone12 mini? Because I wanted a real compact phone. And Why I bought the Pixel 7 now? Well, 1. I want better battery life. 2. I want bigger screen for games and for navigation. 3. IOS just bored me.So, I got the Pixel 7 lemongrass 256g for 599$ and have been using it for a week now. And here are my opinions.In short words, if you have been using Android and want an upgrade now, I really recommend Pixel 7, mainly because it gives you good software experience and decent camera at a very fair price.Exterior & comfort:The color lemon grass is special and I like it. The visor camera bump looks unique and kinda cool in my opinion. The rounded edge makes the phone comfortable to hold. HOWEVER, there are some cons. 1. The bump and the glass back make it awkward to place on any flat surface. 2. The bump is a huge dust collector. 3. Although the edge of the flat screen has a bit of curve, the transition to the metal frame is not good, which means the touch of the edge areas feels a bit cheap, definitely not comparable to Note 9. Overall, I think the look is unique but comes with some sacrifices, and the build quality is fairly good for the price.Operating System:This is the first time I use the so called \"pure\" Android. Compared to Samsung's OneUI, the OS on Pixel 7 feels more like Apple's iOS actually. It doesn't have as many customization functions as OneUI and is simpler to use. Kinda like iOS, but in a different style, well, the kinda nerdy Google style. If you like it you like it. Some special Google AI features are cool, but should not be the only reason for anyone to buy this phone in my opinion. I haven't experienced many bugs. Actually, only one when switching between bluetooth audio devices that really bothers me a bit. Overall, I like the system, and I think it is good for anyone but people who have only used iPhone before.Camera:Pixel has always been famous for its camera capabilities. I must say it is true on Pixel 7. It takes very decent photos no matter the light conditions, and the shoot experience is simple and natural. Is it as good or better as flagship phones like iPhone 14 pro? I don't know, maybe not. But as someone who uses a dedicated camera for street photography, I think the camera on Pixel 7 is more than capable to take nice looking daily photos and capture those little moments into good memories. When it comes to video, it is also good, especially considering the price, but iPhone is better. And I mean iPhone 12 mini. So overall, the camera is very good.Battery life:Not much to say here since I don't bother to do any \"tests\" and have no numbers. But based on my feeling, it is good, but not as good as I expected considering the battery capacity. It will last you a full day (8 hours) or more if you use it lightly. But it is no way a two-day or 1.5 day battery life.Gaming:Gaming is trash. At least for pubg mobile. It is probably due to software issue (not optimized for Tensor chip) rather than lack of raw performance. But if you play a lot of 3D mobile games, avoid this one.Conclusion:Decent phone for the price. Actually, even for the normal price ($100 more than what I spent), it is still more than decent. If you don't want to spend that much on a phone (which is a terribly stupid trend in my opinion), this is the phone for you. Don't look at iPhone SE, that thing is a joke.",
                "reviewVotes": "65 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fernando Reynoso Fernando Reynoso ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 7, 2023",
                "reviewTitle": "Gran teléfono",
                "reviewText": "The media could not be loaded. La verdad estaba un poco dudoso por pedirlo, pero vaya que me sorprendió, la cámara es buenísima, claro tiene sus pro y contra, en fotos es una chula, con la cámara de atrás consigues una fotos espectaculares, en la frontal flaquea un poco, pero la calidad sigue siendo grandiosa, en video es muy bueno si hay mucha luz, si empieza a faltar luz tendrá ruido, en experiencia de batería excelente con android 13, en android 14 baja un poco la autonomía pero nada grave, de lo demás funciona exclente, altavoces con buen nivel de sonido, lo único \"malo\" es el brillo en exterior se nota que le falta un poco, mi otro teléfono (iPhone 11 pro) tiene un brillo mejor en exterior, lo único que si eres de México y planeas usar las redes de Altan ya sea Bait, diri, bromovil, pillofon me parece, etc tienes que buscar un tutorial en YouTube para que te funcionen la llamada, son dos aplicaciones Pixel ims y shizuku, y por último si tienes iPhone tiene pros y contras, por ejemplo android auto noe gusta nada en comparación con carplay pero es cuestión de gustos.Adjunto varias fotos, en retrato las fotos son asombrosas.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61At7wD8y0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61mJSBwTr4L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-FMoSE3lL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71jyDNVN1qL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61rZNxU2loL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Kj+lmG7fL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81f8BO+UvNL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/A1rQte6dAFL.mp4"
                }
            },
            {
                "reviewerName": "Mauricio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 9, 2023",
                "reviewTitle": "Muy bueno",
                "reviewText": "El teléfono esta excelente, sus cámaras, construcción y sistema operativo son lo mas destacable, el sistema operativo es muy fluido y minimalista, se podría decir que es como el iPhone de Android, todo muy minimalista y fluido. La única diferencia destacable en contra del 7pro además del tamaño, es la falta del telefoto y la diferencia de la pantalla, aunque la verdad para el usuario común la diferencia entre el 2K y el FHD+ es casi imperceptible en una pantalla tan pequeña como lo son las de los smartphones, los 90 hercios y los 120 del pro igual no representan una gran diferencia, así que las únicas grandes adiciones en realidad en contraparte del pro son el tamaño y el telefoto, que dependiendo del usuario que seas el telefoto casi no se usa. Así que si buscas un teléfono compacto y fácil de usar a una mano, y no echas en falta el telefoto, es una excelente opción ante su hermano mayor, por casi la mitad del precio",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Itzayana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 4, 2023",
                "reviewTitle": "Excelente",
                "reviewText": "Me gustó mucho el teléfono lo eh utilizado y tiene muy buena calidad en cámara, pantalla y bocina, si capacidad de tomar fotos a grandes distancias es magnifica",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rubén",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 2, 2023",
                "reviewTitle": "Excelente",
                "reviewText": "Llegó en buenas condiciones, sellado, sin problemas. Funciona de maravilla. Muy recomendado y más por las futuras actualizaciones de software que tendrá.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 23, 2023",
                "reviewTitle": "Amazing phone and a great deal!",
                "reviewText": "This phone is brand new and it does have a full 1 year warranty from Google. I'm not sure why people write incorrect reviews! I call Google and verified my warranty and all was good, and I'm sorry happy with this phone. It's so smooth and fast and the camera is awesome! Thanks for the great pricing on it!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}