{
    "remaining_requests": 48846,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SAMSUNG-Galaxy-Unlocked-Smartphone-Foldable/dp/B09G2BN89Q",
    "body": {
        "name": "SAMSUNG Galaxy Z Fold 3 5G Factory Unlocked Android Cell Phone US Version Smartphone Tablet 2-in-1 Foldable Dual Screen Under Display Camera 256GB Storage, Phantom Black (Renewed)",
        "price": "$439.00 - $398.00 - $375.99",
        "originalPrice": "$732.99",
        "rawPrice": 439.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SAMSUNG-Galaxy-Unlocked-Smartphone-Foldable/dp/B09G2BN89Q",
        "soldBy": {
            "sellerID": "AO1LGXGNS33JB",
            "name": "DNCL-TECHZONE",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AO1LGXGNS33JB&asin=B09G2BN89Q&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09G2CXLMX"
        ],
        "asinVariationValues": [
            {
                "asin": "B09G2BN89Q",
                "variationName": "Color",
                "variationValue": "Phantom Black",
                "price": "$439.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41KV+UqZJ+L._SS36_.jpg"
            },
            {
                "asin": "B09G525DHF",
                "variationName": "Color",
                "variationValue": "Phantom Green",
                "price": "$449.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41XQaLK56TL._SS36_.jpg"
            },
            {
                "asin": "B09GR67GYH",
                "variationName": "Color",
                "variationValue": "Phantom Silver",
                "price": "$519.34",
                "variationImageURL": "https://m.media-amazon.com/images/I/41kyeTs3ZrL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": false,
        "maximumQuantity": "9",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41KV UqZJ L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41h8x5Ehf1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kYJmDKnaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410pD-y3GnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Yj5dLbIjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31iLGspzujL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21IuS5ENv8L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon Renewed",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "MOBILESUPPLY",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 682,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 13 - 14.",
            "Or fastest delivery Tuesday, February 13.",
            "FREE delivery February 14 - 16.",
            "Or fastest delivery February 13 - 14.",
            "FREE delivery Wednesday, February 14."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "7.6\", Foldable Dynamic AMOLED 2X, 120Hz, HDR10+, 1768x2208px, Cover: 6.2\" 832x2268px, 4400mAh Battery",
            "256GB, 12GB RAM, Qualcomm SM8350 Snapdragon 888 5G, Octa-Core, Adreno 660",
            "Rear Camera:12MP, f/1.8 (wide) + 12MP, f/2.4 (telephoto) + 12MP, f/2.2 (ultrawide), Front Camera: 4MP, f/1.8, Cover Camera: 10MP, f/2.2, Android 11, upgradable to Android 12L",
            "2G: GSM 850/900/1800/1900, CDMA 800/1900, 3G: HSDPA 850/900/1700(AWS)/1900/2100, CDMA2000 1xEV-DO, 4G LTE: 1/2/3/4/5/7/8/12/13/14/18/19/20/25/26/28/29/30/38/39/40/41/46/48/66/71, 5G: 2/5/25/41/66/71/78/260/261 SA/NSA/Sub6/mmWave",
            "US Model. Compatible with Most GSM and CDMA Carriers like T-Mobile, AT&T, MetroPCS, etc. Will Also work with CDMA Carriers Such as Verizon, Sprint."
        ],
        "description": "See more and do more with the Samsung Galaxy Z Fold3 smart phone, that has the ultimate foldable screen putting a workspace, theater, and game room right in your pocket. The sleek cover display* unfolds to double the size, providing one expansive 7.6” edge-to-edge display that’s like a tablet. Our first-ever Under Display Camera provides an incredible uninterrupted view. We’ve put an ultra dynamic AMOLED display on our super expansive screen. Work and play in any light with a high-contrast ratio and an adaptive 120 Hz refresh rate on the main screen, plus intuitive blue light management that automatically adjusts based on the time of day. Work smarter not harder and from virtually anywhere on this powerful multifaceted cellphone that makes multitasking a breeze.",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Cell Phones",
                "link": "https://www.amazon.com/cell-phone-devices/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7072561011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6.8 x 6 x 2.6 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.035 ounces"
            },
            {
                "name": "ASIN",
                "value": "B09G2BN89Q"
            },
            {
                "name": "Item model number",
                "value": "SM-F926UZKAXAA"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 682 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#144 in Amazon Renewed (See Top 100 in Amazon Renewed) #53 in Renewed Smartphones #1,007 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "OS",
                "value": "Android 11.0"
            },
            {
                "name": "RAM",
                "value": "1 GB"
            },
            {
                "name": "Wireless communication technologies",
                "value": "Cellular"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth, Wi-Fi, USB, NFC"
            },
            {
                "name": "Display technology",
                "value": "AMOLED"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Other camera features",
                "value": "Front"
            },
            {
                "name": "Form Factor",
                "value": "Foldable Screen"
            },
            {
                "name": "Color",
                "value": "Phantom Black"
            },
            {
                "name": "Battery Power Rating",
                "value": "5000 Milliamp Hours"
            },
            {
                "name": "Whats in the box",
                "value": "Travel Adapter, Data Cable, STD Battery, Handset + Cling"
            },
            {
                "name": "Manufacturer",
                "value": "Samsung"
            },
            {
                "name": "Date First Available",
                "value": "September 13, 2021"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "256 GB"
            },
            {
                "name": "Standing screen display size",
                "value": "7.6 Inches"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "12 GB"
            },
            {
                "name": "Battery Capacity",
                "value": "4400 Milliamp Hours"
            },
            {
                "name": "Weight",
                "value": "1 Grams"
            },
            {
                "name": "Brand",
                "value": "SAMSUNG"
            },
            {
                "name": "Model Name",
                "value": "Galaxy Z Fold3 5G"
            },
            {
                "name": "Wireless Carrier",
                "value": "Unlocked"
            },
            {
                "name": "Operating System",
                "value": "Android 11.0"
            },
            {
                "name": "Cellular Technology",
                "value": "5G, 4G, 3G, 2G"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Wi-Fi, USB, NFC"
            },
            {
                "name": "Screen Size",
                "value": "7.6 Inches"
            },
            {
                "name": "Wireless network technology",
                "value": "GSM"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Philip Ortega",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBDP5BYV6UI33FYZUXPSFKWXDTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PZ8IW8YUBRIB?ASIN=B09G2BN89Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Skepticism Gone",
                "reviewText": "I recently purchased the Samsung Galaxy Fold 3, and I must admit that I was both excited and skeptical about getting a refurbished item. However, my skepticism quickly turned into relief the moment I laid my hands on this piece of technology.We all know the Samsung Galaxy Fold 3's design is a true game-changer. The moment I unfolded the device, I was greeted by the stunningly vibrant and expansive 7.6-inch Dynamic AMOLED display. The crispness and clarity of the visuals were exactly what I expected, there did not appear to be an excessive amount of where or noticeable markings that would raise any concerns.One of my initial concerns was the battery life, but I was pleasantly surprised by how well it held up throughout the day. I will be honest, I keep a charger nearby in the event that I have a day of heavy use. When it is a heavy use day the battery does appear to go quickly as compared to the Samsung Galaxy S22 Ultra that I also own. The fast charging capability is a game-changer, too, as it replenished the battery quickly during those rare moments when I needed a boost. I recently purchased a fast charging cable and an Anker power supply that I will be reviewing later but I had purchased from Amazon as well. The charger is a beast for anything USB-C related.Now I will be honest, the camera can be a lot better especially because I came from a newer Samsung Galaxy S22 Ultra device, but it is sufficient enough to use as my daily driver because I like having a bigger display in my hands. I believe that most reasonable people understand what I'm talking about if they have come from any flagship phone from Apple or Samsung in recent years. If you have under full device before like I have, the camera array is basically what you can expect, but it gets the job done from simple snapchats or quick moments to share in messaging.I will say I will say that the device is a true testament to Samsung's commitment to innovation and quality. RECELL did a fantastic job at any restorative effort and I hardly noticed any cosmetic or software irregularities. I hardly write reviews on the things that I purchase but I was hoping that this can help someone who was skeptical but finally found a reasonable price point to make the jump to get a foldable for the first time or to return back into the foldable scene as I have.If you're considering a refurbished device, I highly recommend giving the Galaxy Fold 3 by RECELL a chance. It has redefined my smartphone experience once again and has me eagerly looking forward to what Samsung has in store further in future.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "OmegaOne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGBDW7HO2YRUMEXLS2TE3TVVKMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PJ22CQRLWI19?ASIN=B09G2BN89Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome phone!! opening and closing is very satisfying!!",
                "reviewText": "I bought this as a renewed phone (labeled as excellent condition) which it absolutely was. It looked brand new I didnt even see any micro scratches, it was flawless. been using about 2 weeks now without any issues. The fold 3 has a beautiful screen on the inside, i love the bezel all the way around and the hidden selfie camera under the screen is so cool. HOW did they do that!!! The screen is just so clean to use, no notches, no cutout, just a perfect screen shape, you can see the selfie camera t certain angles but other wise its invisible.As for the fold down the middle, I wasnt sure how I was going to like it but honestly after a few days you stop noticing it. When the screen is on you cant see the seam at all but you do feel it, if pinch zooming, gaming or otherwise. its fine though, really. Dont let that seam stop you from using this awesome tech!, i love opening and closing the phone all day.Now, for the front screen, its just weird, its narrow, i dont like it or use it, like ever. The keyboard is too small to use comfortably. I'll read text notifications and pause/play music but thats really it. I just got use to opening the phone every time. There may be a place for its uses but I haven't found it yet. Its neat i guess to have that smaller screen but i dont like using it, its a weird ratio form, factor. just my personal experience.Get this phone, you wont regret it! It was $600 when i bought it, the price changes week to week, just watch it and grab it when a good deal pops up. You will save a a ton over getting the new fold 4 at $2K.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin P Horton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5AFDBYRTBFKW3X2WKPKQ6NK3XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R119WOC5N4C9MP?ASIN=B09G2BN89Q",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "1.0 out of 5 stars Not worth it!",
                "reviewText": "I bought this item and it came in about 48hrs. The product screen was already broken and not working properly. Supposedly it went through a screening process to ensure it worked properly. Extremely disappointed.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Magic Hands Man",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMQ5IMKV6KAAZKRK5S76PVQ3SNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V0N8NSKTSHQ2?ASIN=B09G2BN89Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Let's play SPIN THAT WHEEL!",
                "reviewText": "Okay folks, today marks day 1 of ordering a refurbished phone. On the one hand the primeday price was a sweet 800 bucks, not bad at all. On the other hand it seems we are spinning the wheel and here are some of the choices.1. You get a phone that does not charge2. You get a phone does not turn on3. You get a phone that is still locked4. You get a phone that comes damaged5. You get a phone that is actually fine. It looks great.Based on the averages MOST people get a perfectly fine phone. You are just unlucky if you get a busted on. That said you have to be vigilant when you order one of these suckers. First thing inspect like crazy, and try to charge. So far there was a slight scuff near the center of the hinge, looks just a bit dirty. Also it charges, so win so far. I am going to attempt to tranfer some data and move my number over, so in the next few days I will see how it goes and will probably come back with more updates.Do note that it is good of us to TRY and recycle phones and stuff. It's better for the world and all that jazz. Me I just wanted to save some money, which may or may not bite me in the ass later.Oh and just to let everyone interested in this phone know, google searches will confirm that these phones do have issues with the middle screen getting cracks and dead pixels regardless of what you do. Samsung is also TRYING ACTIVELY to not pay for any of these. It seems if you buy the samsung care plus they take care of it MOST of the time. That said their website providing information on the care plus is confusing and seems pretty useless.I did splurge on a heavy duty case because I just want to make sure that I am protecting the screens as much as possible. I am also going to try a stylus and see how that goes.Day 1- Phone looking good, turns on, charges, samsung transfer app works well android to android. So far so good.Day 16- Very glad I bought that heavy duty case because this phone is attracted to the floor. Stuff did manage to get under the case but overall it's working well. Battery life on the phone is okay overall. If you use your phone a lot, you will be charging it everyday. Tablet mode drains it pretty fast it seems. I charged it to about 90, then read novels in firefox for about 3 hours and it dropped to 50 percent. This is not a phone you want to use if you are going to be away from a charger for a long period of time. Don't get trapped on an island with it. Besides that I am really enjoying the phone. It has a super awesome refresh rate, I picked up a stylus which was pretty nice for the big screen (note the small screen doesn't accept any stylus). It is amazing for reading books or comics, watching movies or tv shows. It feels like a really nice small tablet.One of the problems I can already forsee is that this is a 1-2 year phone as opposed to 3-4 phone like I normally buy. You are most likely going to want the newest one when it comes out assuming it doesn't explode note style. Also having a protective case is nice, but man this phone is now Thiccc. Also some apps do NOT like going from the small screen to the big screen and will literally crash because resizing hurts their brains. Most are of mine are fine but a few do crash.On a plus side besides the awesome refresh rate which makes this feel like a real fancy phone, it is a big talking piece and even without me shoving this in peoples faces like pictures of my children, people come up to me and say \"Oh, you are making me want a new phone.\" Let's hope my luck keeps going.",
                "reviewVotes": "167 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$437.99",
                "sellerName": "Be My Deal",
                "sellerRating": "4"
            },
            {
                "price": "$439.00",
                "sellerName": "TEK-VIP",
                "sellerRating": "4.5"
            },
            {
                "price": "$439.99",
                "sellerName": "Chubbiestech",
                "sellerRating": "4.5"
            }
        ]
    }
}