{
    "remaining_requests": 48875,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samsung-SM-A536E-DS-Unlocked-International/dp/B09VCTP7ZL",
    "body": {
        "name": "Samsung Galaxy A53 5G (SM-A536E/DS) Dual SIM,128 GB 6GB RAM, Factory Unlocked GSM, International Version - No Warranty - (Awesome Blue)",
        "price": "$359.99",
        "originalPrice": "",
        "rawPrice": 359.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Samsung-SM-A536E-DS-Unlocked-International/dp/B09VCTP7ZL",
        "soldBy": {
            "sellerID": "A3IWU819C03265",
            "name": "INTEGRON TECHNOLOGIES INC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3IWU819C03265&asin=B09VCTP7ZL&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09VCSFFP7"
        ],
        "asinVariationValues": [
            {
                "asin": "B09VCVNK2C",
                "variationName": "Color",
                "variationValue": "Awesome Black",
                "price": "$359.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51cYgvQcRXL._SS36_.jpg"
            },
            {
                "asin": "B09VCTP7ZL",
                "variationName": "Color",
                "variationValue": "Awesome Blue",
                "price": "$449.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51eCPYg2jcL._SS36_.jpg"
            },
            {
                "asin": "B09VCTQVCW",
                "variationName": "Color",
                "variationValue": "Awesome White",
                "price": "$399.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51BDMFbHzEL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51eCPYg2jcL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51nxNemH14L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31FGKcIpdBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41r2RqFRQqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31b8Wyh2lbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/414r8WGPQeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hEbjrEz6L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SAMSUNG Store",
            "link": "https://www.amazon.com/stores/Samsung%C2%AE/page/F50AFABA-4CDE-4A95-84D0-CA4C61819FEB?ref_=ast_bln"
        },
        "brand": "Samsung®",
        "merchantInfo": "INTEGRON TECHNOLOGIES INC",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 1446,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 14 - 16.",
            "Or fastest delivery Tuesday, February 13."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "*Charging Cube is Not Included*, 6.5\", Super AMOLED, 120Hz, 800 nits,1080x2400 pixels, 5000mAh Battery",
            "128GB ROM, 6GB RAM, Exynos 1280 (5 nm), Octa-core, Mali-G68, Android 12, One UI 4.1",
            "Rear Camera: 64MP, f/1.8 + 12MP, f/2.2 + 5MP, f/2.4 + 5MP, f/2.4, Front Camera: 32MP, f/2.2",
            "2G: GSM 850/900/1800/1900, 3G: HSDPA 850/900/1700(AWS)/1900/2100, 4G LTE B1/2/3/4/5/7/12/14/20/29/30/66/38/39/40/41/46/48, 5G: 2/5/41/66/77/78 SA/NSA/Sub6/mmWave-may not get 5G as it is not available in all regions. Please check with your carrier for compatible 5G Bands.",
            "International Model - No Warranty in US. Compatible with Most GSM Carriers like T-Mobile, AT&T, MetroPCS, etc. Will NOT work with CDMA Carriers Such as Verizon, Cricket, Boost."
        ],
        "description": "LONG-LASTING BATTERY: Your busy life deserves a battery built for busy; Whether you’re taking a video call on your commute, catching up on your favorite show or with friends and family, your long-lasting, super fast charging battery has your back. POWERFUL PERFORMANCE: The very best of Galaxy A Series gives you awesomely smooth streaming of your favorite content with the most powerful performance in its series and awesomely fast speeds to download shows and movies — all at the speed of 5G. EXPANDABLE STORAGE: Galaxy A53 5G gives you the A Series’ biggest built-in storage and lets you enjoy more memories and entertainment; With an additional 1TB of expandable storage with a microSD card, you can hold on to every smile and relive every epic vacay. INTELLIGENT CAMERA: Capturing content is as easy as pose, shoot and share with A53 5G’s intelligent camera; Single Take lets you capture video, pictures and more with just one tap, while image stabilization technology makes sure every clip is crystal clear. INFINITE DISPLAY: Whether you’re streaming short videos or kicking back to complete a whole series, the Galaxy A53 5G Super AMOLED display is built to keep you entertained, with incredible color clarity that translates into awesome resolution. MODERN DESIGN: Life happens, but Galaxy A53 5G*** provides a premium slim design that is built to last through those unpredictable moments; The body was engineered to endure, so you can worry less around water and dust. PRIVACY & SECURITY: Protect your data with multilayered Knox Security; Also, with Private Share, you can set time limits and expiration dates on all shared files, revoke access at any time and ensure the intended recipient is the only one who can open your files — and that they cannot send or screenshot your stuff.",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Cell Phones",
                "link": "https://www.amazon.com/cell-phone-devices/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7072561011"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Carrier",
                "value": "Unlocked"
            },
            {
                "name": "OS",
                "value": "Android 12.0"
            },
            {
                "name": "Cellular Technology",
                "value": "4G/5G"
            },
            {
                "name": "Connectivity technologies",
                "value": "Wi-Fi"
            },
            {
                "name": "Wireless network technology",
                "value": "GSM"
            },
            {
                "name": "Connector Type",
                "value": "USB Type C"
            },
            {
                "name": "Form Factor",
                "value": "Foldable Screen"
            },
            {
                "name": "Biometric Security Feature",
                "value": "Fingerprint Recognition"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Shooting Modes",
                "value": "Macro"
            },
            {
                "name": "Water Resistance Level",
                "value": "Water Resistant"
            },
            {
                "name": "Battery Capacity",
                "value": "5000 Milliamp Hours"
            },
            {
                "name": "Battery Life",
                "value": "102 Hours"
            },
            {
                "name": "Battery Description",
                "value": "Lithium-Ion"
            },
            {
                "name": "Charging Time",
                "value": "1.04 Hours"
            },
            {
                "name": "Battery Power",
                "value": "5000"
            },
            {
                "name": "Other camera features",
                "value": "Front"
            },
            {
                "name": "Optical Sensor Resolution",
                "value": "5.0, 12.0 MP"
            },
            {
                "name": "Screen Size",
                "value": "6.46 Feet"
            },
            {
                "name": "Scanner Resolution",
                "value": "1080 x 2400"
            },
            {
                "name": "Display Type",
                "value": "AMOLED"
            },
            {
                "name": "SIM card slot count",
                "value": "Dual SIM"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "128 GB"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "6 GB"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 1,446 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Brand",
                "value": "Samsung"
            },
            {
                "name": "Model Name",
                "value": "Galaxy A53 5G"
            },
            {
                "name": "Year",
                "value": "2022"
            },
            {
                "name": "Model Number",
                "value": "-A536E/DS"
            },
            {
                "name": "Whats in the box",
                "value": "USB Cable"
            },
            {
                "name": "Manufacturer",
                "value": "SAMSUNG"
            },
            {
                "name": "Weight",
                "value": "9.6 Ounces"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "6.28 x 2.94 x 0.32 inches"
            },
            {
                "name": "Color",
                "value": "Awesome Blue"
            },
            {
                "name": "Warranty Description",
                "value": "No Warranty"
            },
            {
                "name": "Operating System",
                "value": "Android 12.0"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kwon :PKwon :P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOKM455CODK77YP3U6AJR4OHZIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R394JTP5GRSFF5?ASIN=B09VCTP7ZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2023",
                "reviewTitle": "5.0 out of 5 stars As promised",
                "reviewText": "The one I purchased is the unlocked international version A53 5G model (SM-A536E-DS). This is to replace my A51 of the same model line. I am with US T-Mobile and use a GSM-based network in the country I plan to use the 2nd SIM. So, my following comments are for T-Mobile and cannot speak for other network. Samsung made this clear that it will only work for GSM based network, not for CDMA (i.e., Verizon) based network. You need to verify this. It is, however, a bit confusing, that the vendor included a note in the package stating the above fact (see picture). But it included \"AT&T\" on the list (see markup in the photo). As far as I know, AT&T is the same as T-Mobile, both are GSM based network. So, I think, it meant to say \"Verizon\". Bad for the vendor, who don't seem to even know what they are selling!!I bought it primarily for the Dual Sim Dual Standby capability, in addition to other good things provided by the A-xx model line by Samsung, such as a larger battery, decent screen size and brightness/resolution, and a Samsung-promised 4 year OS upgrade. For $320, you cannot beat the offer with a Samsung's brand supports. To begin the use, I used Samsung Smart Switch App in transferring my A51 to the new A53. It did a very decent job on transferring App, photos, data files, messages, as well as other key phone settings. But you will have to reset each notification sound as it is different (if your previous selection is not available for the new phone). Also it took quite a while (over 40 minutes in the first stage) to download all the data via a WIFI network (mine has a download speed rated at 350 MB). If you have a slow wifi it will take even longer I assume. I suggest you leave the screen on at all time during the transfer so that you can react to the prompts from time to time to complete the switch, Because some of the Apps involve password approval or 2nd authentication, it is not possible to just leave it to the program to do the job. Overall, it took almost an hour to get everything done. Even so, some of the App-based data files and cloud-based info download took more time to download (depending on file server of that App). So, you will need to be a bit patient. But overall it did a good job. The international version promise DSDS, but that means you will not be able to install the microSD card (it has only two slots either for two SIMs, or one SIM and one microSD). This is unfortunately a downgrade from A51 because A51 actually has three slots in the SIM cassette, two for SIMs and one for microSD!! After the switch I already used up about 50% of the internal 128GB memory as pictures from the old phone are all transferred to the new phone. If you take 4K video a lot, then you need to consider the fact of using the DSDS without the microSD (the spec says A53 can take a 1TB microSD card). I see quite a few comments about not able to make calls or having trouble with the old SIM (as the phone is not unlocked??). I have no such issues at all for both A51 and A53. Both are true plug-and-play without a hitch, no need for a new SIM. Remember to reset the sound profile - otherwise it is confusing as you can have trouble making quick response to various notification sounds. I did a bit of photographing around the house. A53 has a better chipset than A51 and it is very fast by my A51 standard for taking still photos and A53 fit my needs for taking indoor photo or mixed lighting conditions without any issues. The newer AI camera is very capable in deciding the exposure for taking the best picture under mixed light exposure. I am happy.So, in the first 24 hours, everything works as promised. Last notes: it came in Spanish (probably manufactured primarily for Latin America??) so you will need to make switch to your preferred language the first thing you do. A nice surprise it that within 2 hours after finishing the \"switch\", it asks me to upgrade from Android 12 to Android 13 with the new security patch of 1/1/2023. BTW, my A51 came in with Android 10 and is has since been successfully upgraded to Android 13. I am so delighted that Samsung kept this promise on OS upgrade and security patch. I therefore expect the continuing use of both phones without worrying about the OS obsolete!! Thumbs up for Samsung.I will try giving an update after I return from the trip to tell you how the DSDS works on this model. But with the experience from A51 DSDS, I do not see it is a problem,",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71npkJMT2XL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joanne M. Munns",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUAFJ6YZEK6N7YJVUMXERAGJCZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1925UJ49ZCKKZ?ASIN=B09VCTP7ZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2022",
                "reviewTitle": "5.0 out of 5 stars Just what I wanted!",
                "reviewText": "I ordered this phone for use with Consumer Cellular service. It works fine except the signal strength isn't as good as my husband's A13 model. I found out that to use the dual sim card feature you have to pay for 2 lines. Duh! I should've figured that out myself! You can achieve this in other ways without the second line and the second sim card but I have yet to try it. Great camera! Pretty easy to use overall, for a smart phone. I replaced a Samsung phone with this one so there wasn't much of a learning curve. Overall a good deal and transaction.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anita Zebell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNQ4VDSF2WPBIL2RLWESZDRRT7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34UUP12SQ16VJ?ASIN=B09VCTP7ZL",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "1.0 out of 5 stars The phone was defective and wouldn't make calls or send texts.",
                "reviewText": "He sold me a defective phone that didn't work. I bought 3 different Sim cards 2 phone cases . Two different phone IT technicians from Verizon and AT&T tried to make the phone work with the Sim cards but it wouldn't and now he's saying I returned it back damaged which isn't true. I never got to even use the phone. I mailed back in the original box by UPS just as I received with 2 labels as requested. Then he said he didn't have the pin, I gave him that. He never said anything about the phone being damaged then because it wasn't. He only refunded me $42.90 on a $389.00 phone . He said he kept the rest for a restocking fee which isn't my responsibility and when I confronted him now he's trying to say I sent back dated which is false. I couldn't even open the jpg pics he sent me. If the pics is damaged it's not the one I purchased and returned just as I received. I do have a Supervisor named Bosh helping me to try and get my full refund, but this seller is being dishonest. I've been a long time customer with Amazon and never had the hassle I've experienced with Integron Technologies.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ6WNEE353CN7QEGJTZ3DSO5GIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UU2JFQ2WUGVP?ASIN=B09VCTP7ZL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2022",
                "reviewTitle": "4.0 out of 5 stars US Mobile Phone Carrier Problems",
                "reviewText": "Once I got the phone it was working good on AT&T but after about a month AT&T the phone stopped working due to model number is not on AT&T list of phones it supports in 5G upgrade which has been very painful to many of AT&T customers. This even after extensive tries by an AT&T retail store clerk whom tried very hard with phone center customer service.So with phone not working on AT&T I went to T-Moble and after a test with T-Mobile sim card I then changed carriers. The phone was working great until my old AT&T number was imported & even after many efforts by the T-Mobile store clerk to try to rectify a problem all incoming calls go direct to voice mail.I can make calls & use data OK but cannot receive. (Currently I have calls forwarding to another number)I went to U-Break I Fix store & the clerk there says I probably need to reset the phone to manufacturer settings & re-upload all phone updates to see if will work? Still have not done that yet do to it is time consuming.....",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephen Jehu Toe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQDPVVSGUYFSILZD35XK2ZSY4TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4PCYFVW66SZ7?ASIN=B09VCTP7ZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing Cellphone",
                "reviewText": "This product works well in Liberia and the quality of the camera is amazing. My wife is really enjoying this when it comes to the quality of the camera. It is 5g so it's fast on the internet even though we do not have 5g in Liberia.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Uziel G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 13, 2023",
                "reviewTitle": "Me encantó el equipo",
                "reviewText": "Llevo al menos cuatro meses usándolo, trabaja de manera adecuada teniendo hasta cinco apps al mismo tiempo. Yo uso mucho redes sociales y veo reels, me rinde desee las 10am hasta caso 9pm, la batería es muy buena. La cámara es muy desente. Con la memoria que tiene, ni siquiera la he podido llenar. La pantalla se ve muy bien y llegan sus actualizaciones constantemente. Me encantó el equipo.Una lástima que ya no envíen cargador, solo el cable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sergio Portilla Moreno",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 6, 2023",
                "reviewTitle": "Buen Producto",
                "reviewText": "Funciona bien en su relación calidad precio",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dany Cortes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 24, 2023",
                "reviewTitle": "Muy bueno!",
                "reviewText": "Amé el celular, llegó en buenas condiciones! Yo no sé mucho sobre celulares pero para mi que lo uso más que nada para redes sociales, es bastante rápido, la cámara toma muy buenas fotos y ha resisitido bien las caidas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gustavo Castello",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 31, 2023",
                "reviewTitle": "La calidad",
                "reviewText": "Que es bueno",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monse León",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 9, 2023",
                "reviewTitle": "Podria ser mejor, pero es funcional.",
                "reviewText": "Considero el diseño es lindo, de resistencia y agua no lo he probado como tal. Yo lo compre por las camaras, pantallas, sonido y por que en general me gusta Samsung. Solo que si se traba de repente siento que faltan actualizaciones de mejora. Pero en general pues bien al momento.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}