{
    "remaining_requests": 49147,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Nokia-Factory-Unlocked-Android-Verizon/dp/B09CBSS3BX",
    "body": {
        "name": "Nokia C01 Plus | Android 11 (Go Edition) | Unlocked Smartphone | 2-Day Battery | 1/32GB | 6.52-Inch Screen | Dark Blue",
        "price": "$74.99",
        "originalPrice": "",
        "rawPrice": 74.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Nokia-Factory-Unlocked-Android-Verizon/dp/B09CBSS3BX",
        "soldBy": {
            "sellerID": "A2GKOXTPZV7SMA",
            "name": "Mobiles International",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2GKOXTPZV7SMA&asin=B09CBSS3BX&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09CBQ366S"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "51",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51qhgA8y7eL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41vrQ0mVVcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21UKTkVH1-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rL9ndfZQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514sLuKes6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ExyCRtECL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31jZT7SaHkL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/abd57966-3940-43b7-abf6-be61d1d60511/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da591afd-9545-4191-91af-d5bb3d0fae05/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12d267d3-bd40-427f-b8be-95066b6b196b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/635d95dc-8230-4b5f-9910-f52fa6a4232c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/718d74a5-4e79-479f-834f-6c62d8adddfd/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 5,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81BvKgIrujL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81BvKgIrujL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Nokia Store",
            "link": "https://www.amazon.com/stores/Nokia/page/BBD88D40-BF44-4A32-90F8-5A0E8C5658A1?ref_=ast_bln"
        },
        "brand": "Nokia",
        "merchantInfo": "Mobiles International",
        "customerReview": "3.6 out of 5 stars",
        "customerReviewCount": 743,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 15 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "HD+ Screen with video calls.Form_factor : Bar.Display resolution maximum:720x1440 pixels",
            "Octa-core and 4G connectivity",
            "5MP front and rear cameras with LED flash",
            "Android 11 (Go edition) with a long lasting battery",
            "Product is compatible with GSM carriers. Carrier network coverage is dependent upon the carrier's service area. Product is not compatible with Verizon. Please confirm compatibility and product support with your carrier before you order."
        ],
        "description": "Make every moment count with Nokia C01 Plus. The sharp HD+ screen makes you feel closer to your video calls and immerses you in your favourite shows, while its HDR camera and front and rear flashes capture what’s most important to you. With a snappy octa-core processor, 4G and long-lasting battery, it’ll also keep you connected all day. It also comes with Android 11 (Go Edition), which saves data and storage, while also offering better privacy and usability. Compatibility: This device is designed to work with GSM carriers. This product will not support Verizon or Verizon subsidiaries. Please confirm compatibility with your chosen carrier before purchasing. For support with SIM card or network related issues, please contact your carrier for assistance in connecting your device to the chosen compatible network. Supported Network bands: 2G: 850 / 900 / 1800 / 1900 3G: 850 / 900 / 1700(AWS) / 1900 4G/LTE: 2, 4, 5, 7, 8, 28 Charging: This product is designed to be charged using the charging adapter and charging cable that are provided in the product box. Charging this device with any other charging adapter or cable may cause device malfunction. Please observe basic safety steps when charging this device and do not charge this product with malfunctioning or damaged equipment. Current Software Version: Android 10 Bluetooth Version/Range: 4.2 – 30’ Range FAQ How can I install available updates? In many cases updating your product to the latest software version will alleviate any issues experienced. To update your device please navigate to Settings > System > System update > Check for update to check if updates are available. Follow the on screen prompts to install the latest software version if available.= How can I close an app that has stopped working? Open Settings on your phone and select Apps. Then find the app you're having issues with and select Force Stop. I want to conserve battery life. How can I activate the Power Saver mode? On your phone, open Settings, then choose and activate Battery Power Saving. Please also be aware that battery life depends on a variety of factors such as device usage frequency, application requirements, your current operating system, and cellular signal strength. How can I back up my files? Navigate to Settings > System > Backup, and switch backup on. How can I reset my smartphone's network settings? Navigate to Settings > Network & Internet > more_vert > Reset. Performing this reset may help if you're having connection issues. How do I connect my phone to my carrier network? If your Nokia phone and network are compatible, place your SIM card in the SIM card tray using the included SIM card removal tool to open the SIM tray. Once your SIM card has been inserted into the device, power on your phone and proceed through the product setup steps. If you are not able to connect to your network after finalizing the product setup, please contact your carrier support for additional assistance as every carrier has different steps to assist you in ensuring your product connects to their compatible network. How can I ensure other people hear me on my microphone? If you are experiencing microphone issues with your device and your product has a Google Assistant button, please ensure that the Google Assistant button is not stuck or dirty as this will cause the microphone to not function as intended. If the Google Assistant button is not obstructed, please ensure that there is no dirt or debris in the headphone port of your product. If the headphone port is also clear, please disable the microphone permission of the Google Assistant, by going to Settings > Apps & Notifications > Google App > Permission > Microphone > Deny. How can I turn up the volume to my speaker? First, please ensure that there is no dirt or debris in the headphone port of your product. If your headphone port is clear, please make sure that “Do Not Disturb” is not enabled. To disable this setting, navigate to Settings > Do not disturb. Make sure this is toggled off. If Do Not Disturb is off, navigate to Settings > Sounds and vibration > Volume > move the Media slider to the right to increase volume and test your speaker. If you are still not able to hear any audio, check the settings of the application that you are using from the Settings menu as many applications will have their own volume settings. Why is my phone feeling warm, closing apps or occasionally slowing down? During extended operation, the device may feel warm. In most cases, this is normal. To avoid getting too warm, the device may automatically slow down, dim display during a video call, close apps, switch off charging, and if necessary, switch itself off. If the device is not working properly, take it to the nearest authorized service facility. How do I reboot my smartphone when it’s not responding? If your phone is unresponsive, you can perform a “soft reset” by pressing the volume up key and the power button simultaneously for about 15 seconds (or until phone vibrates). Your phone should then restart momentarily. This is a safe and quick way to reboot your device without losing or erasing any data. My phone won’t charge. What should I do? First ensure the issue isn't with the power source or socket you're using - you can quickly check this by plugging your phone into a different outlet, then checking if it charges. If the socket is not the issue, try taking a closer look at the power cable or charging port on your phone, ensuring everything appears as it should. Then, try turning your phone off completely and plugging it into the socket - bear in mind if the battery is completely drained, it might take up to 2 or 3 minutes to start charging. How can I contact support? Our customer support page offers a number of ways that you can contact support. Please visit the Nokia website for further assistance. How do I fix touch sensitivity issues on my phone? Before performing any additional troubleshooting steps, please ensure that your product does not show any physical damage, has not been exposed to water, the screen is clean, and your fingers and hands are not wet or dirty. Please also remove any 3rd party screen protectors that you may have on the device as non Nokia branded screen protectors may decrease the touch sensitivity of the device. If none of these solutions resolve the issue that you are facing, please perform a hard reset back to factory settings. Please note: a hard reset will completely erase all the data, settings and content on your smartphone, returning it to the original factory settings. We strongly advise that you back up your device before a hard reset. Visit here to learn more about how to back up your smartphone remotely. To reset your smartphone and erase all its content, first make sure your phone is connected to a power source. We also recommend that your battery is at least 50% charged when you perform a hard reset. Press the volume up key and the power button simultaneously for about 30 seconds or until the root menu appears. Then choose the action you want to take from the root menu, in this case “Wipe data/factory reset”. Alternatively, you can also perform a hard reset by tapping Settings > Backup & Reset > Factory data reset > Reset phone > Erase everything.",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b?ie=UTF8&node=2335752011"
            },
            {
                "name": "Cell Phones",
                "link": "https://www.amazon.com/cell-phone-devices/b?ie=UTF8&node=7072561011"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Carrier",
                "value": "Unlocked for All Carriers"
            },
            {
                "name": "OS",
                "value": "Android 11.0"
            },
            {
                "name": "Cellular Technology",
                "value": "LTE"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth, Wi-Fi, USB"
            },
            {
                "name": "Wireless network technology",
                "value": "GSM, Wi-Fi, CDMA, LTE"
            },
            {
                "name": "Connector Type",
                "value": "Micro USB"
            },
            {
                "name": "Form Factor",
                "value": "Bar"
            },
            {
                "name": "Biometric Security Feature",
                "value": "Fingerprint Recognition"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen, Microphone, Buttons"
            },
            {
                "name": "Phone Talk Time",
                "value": "12 Hours"
            },
            {
                "name": "Shooting Modes",
                "value": "High Dynamic Range"
            },
            {
                "name": "GPS",
                "value": "True"
            },
            {
                "name": "Water Resistance Level",
                "value": "Not Water Resistant"
            },
            {
                "name": "Audio Jack",
                "value": "3.5 mm"
            },
            {
                "name": "Special Feature",
                "value": "Touchscreen, Octa Core Processor, Camera, LTE, Smartphone"
            },
            {
                "name": "Battery Capacity",
                "value": "3000 Milliamp Hours"
            },
            {
                "name": "Battery Life",
                "value": "24 Hours"
            },
            {
                "name": "Battery Description",
                "value": "Lithium-Ion"
            },
            {
                "name": "Charging Time",
                "value": "3 Hours"
            },
            {
                "name": "Battery Power",
                "value": "3000"
            },
            {
                "name": "Front Photo Sensor Resolution",
                "value": "5 MP"
            },
            {
                "name": "Rear Camera Resolution",
                "value": "5 MP"
            },
            {
                "name": "Other camera features",
                "value": "Rear, Front"
            },
            {
                "name": "Effective Video Resolution",
                "value": "8 Pixels"
            },
            {
                "name": "Optical Sensor Resolution",
                "value": "5 MP"
            },
            {
                "name": "Screen Size",
                "value": "6.52 Inches"
            },
            {
                "name": "Scanner Resolution",
                "value": "1440 x 720"
            },
            {
                "name": "Display Type",
                "value": "LCD"
            },
            {
                "name": "Refresh Rate",
                "value": "60 Hz"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "720x1440 Pixels"
            },
            {
                "name": "Customer Reviews",
                "value": "3.6 3.6 out of 5 stars 743 ratings 3.6 out of 5 stars"
            },
            {
                "name": "Brand",
                "value": "Nokia"
            },
            {
                "name": "Model Name",
                "value": "C01 Plus"
            },
            {
                "name": "Year",
                "value": "2021"
            },
            {
                "name": "Model Number",
                "value": "TA-1391"
            },
            {
                "name": "Whats in the box",
                "value": "SIM Tray Ejector, Adapter, Phone Case, USB Cable"
            },
            {
                "name": "Manufacturer",
                "value": "HMD Global Oy"
            },
            {
                "name": "Weight",
                "value": "5.54 Ounces"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "5.83 x 2.83 x 0.37 inches"
            },
            {
                "name": "Color",
                "value": "Blue"
            },
            {
                "name": "Warranty Description",
                "value": "30 Day Limited Warranty"
            },
            {
                "name": "Operating System",
                "value": "Android 11.0"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "32 GB"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Wi-Fi, USB"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "See more of what you love The Nokia C01 Plus’ HD+ screen makes video calling friends and family feel even more real. It also lets you immerse yourself in all your favorite shows with crystal clear sharpness. And, thanks to its all-day battery, you have enough power to do both. Get to what's important It’s good knowing what’s important to you is safe and secure. With the Nokia C01 Plus, it comes out of the box ready with the super smart and secure Android 11 (Go edition) and the security of AI-powered face unlock. So, whatever you have on your phone, stays safely on your phone. Unmistakably Nokia You need a phone you can rely on. And the Nokia C01 Plus can handle the everyday knocks and bumps. We’ve tested it against bending, twisting, heat and humidity. Then we tested it for durability. Performed force tests. And then we ran even more tests, just to be sure it can handle everything life throws at it.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffbfaff7-fb08-4ae1-a895-b08d5b5581d2.__CR0,0,600,600_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9e0decf7-7ba8-4397-9d9e-15c5dab2f34e.__CR0,0,600,600_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1235852d-d5b5-42ac-b8fd-bc9b8e7328f3.__CR0,0,600,600_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Morning person or night owl? It no longer matters Family life is all about magical moments. Fortunately, with an HDR camera and flash on both sides, the Nokia C01 Plus is ready to capture the wow of it all.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/19014284-4ad8-4ff1-9c3a-ed6d9317d38d.__CR0,0,1940,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "The fast-acting, quick connecting phone Life doesn’t wait and neither does the Nokia C01 Plus. Thanks to its speedy octa-core processor and 4G LTE, things happen when you want them to. Those days of waiting on apps or videos to load are gone – just what you would expect from a fast-acting phone.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c99d4ea9-c4a8-473e-88dc-6f7b2a101ab7.__CR0,0,1940,600_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d9131c58-386a-473b-97b4-9ab449728942.__CR0,0,1940,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/09bd625a-50de-46ba-ab4f-a9e550b8e0f9.__CR0,0,1940,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffbfaff7-fb08-4ae1-a895-b08d5b5581d2.__CR0,0,600,600_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9e0decf7-7ba8-4397-9d9e-15c5dab2f34e.__CR0,0,600,600_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1235852d-d5b5-42ac-b8fd-bc9b8e7328f3.__CR0,0,600,600_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/19014284-4ad8-4ff1-9c3a-ed6d9317d38d.__CR0,0,1940,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c99d4ea9-c4a8-473e-88dc-6f7b2a101ab7.__CR0,0,1940,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Eddy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE257RPDQGPSNZZLLY3ZYTBJFNPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5IH8GURI8Q7S?ASIN=B09CBSS3BX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Me gustó el producto",
                "reviewText": "Está en buen precio",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Devin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJGVXLFA5XSYRWZH5YDY6BLHMJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VCVMSQW9SOX4?ASIN=B09CBSS3BX",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 2, 2022",
                "reviewTitle": "1.0 out of 5 stars Absolute garbage",
                "reviewText": "Just ordered this and brand new out of the box it doesn't work. Absolutely nothing. First of all for some god forsaken reason they actuallly used a USB-b port on it instead of USB-c despite the fact that the entire industry protty much disconinued the use of b years before this phone came out. Which you know Nokia knows not only because they're part of the industry, but because the instructions come with a huge warning not to try to use usb c with it. Because they know it's the industry standard for a reason and it's what everyone uses for everything so they need to remind you that they purposely used the wrong port on this phone just to punish you for not buying high end for whatever reason of necesity that you didn't.And what do you know. Brand new out of the box it won't take a chage. Probably because the BAD PORT IS BAD WHICH IS WHY YOU DON'T USE THAT ONE. I've tried multiple outlets, multiple blocks, and multiple cables nothing. Won't take a charge, you can tell because it's still ice cold after being plugged in for over an hour. Won't turn on. It's a brick.So now I've been out of the loop with work for over 72 hours since my last phone died, I ordered this while waiting for a Planet Computer Astro Slide to ship from overseas and I can't even get updated before Monday because amazon shipped me a broken phone.Unless Jeff Bezos himself swings through my plate glass windows on a vine in a loin cloth like george of the jungle, and slaps my phone to life like the Fonz, before backflipping back out through the broken glass as penance for having already wasted this much of my time I swear I will binge watching everything worth watching (not much) on prime vidwo which I finally started just to make sure I got this phone on tiem only for this to happen anyway, then cancelling before they can charge me a penny for it.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. Reed",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKJ73RBNLEIPWQNRRGQLWHGZDNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23ARUQT1T6AWZ?ASIN=B09CBSS3BX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2023",
                "reviewTitle": "4.0 out of 5 stars Quick service for needed item",
                "reviewText": "Looking forward to using this phone on an upcoming trip. Ratings are good so am expecting a solid product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andy Williams ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE55AEOP2I6K7EUOCHCONKRWSN2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPR2M498E3LX6?ASIN=B09CBSS3BX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Grate phone",
                "reviewText": "This phone is perfectLove it",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tinkering Geezer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHEMC7GM4VOMHFMBNSIIUYYXLUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REQJQM4Y3R88B?ASIN=B09CBSS3BX",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2023",
                "reviewTitle": "3.0 out of 5 stars Not this one",
                "reviewText": "Didn't load all my best apps. Not a great camera. Had NOKIA before. Good sturdy phone.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caryl Cox",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDGGC5SOA567DOAOSINTHPU535Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BCPR45EVK7WC?ASIN=B09CBSS3BX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Great price for an unlocked phone",
                "reviewText": "This was purchase for family in Jamaica and they are enjoying their phone and its features.No complaints yet",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J F Clark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHK4R5F67JGMKFVRXAELQCJOXN7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D93B6JTDIWSM?ASIN=B09CBSS3BX",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 13, 2023",
                "reviewTitle": "1.0 out of 5 stars Not Compatible with Tello, Mint or Consumer Cellular",
                "reviewText": "Once received, I checked the IMEI on the outside of the box (without opening it) and this item is NOT compatible with Tello, nor is it compatible with Mint or Consumer Cellular. I returned this for a refund (and bought directly from Amazon, and not a 3rd party seller). So buyer beware, this is not a phone that can be used on several carriers in the US market. It may be fine elsewhere, but not here!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Awilda Troche",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6QG2WHV27UVYCAHOXTTPUY5GZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34UPQ1NLCKTB1?ASIN=B09CBSS3BX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars New phone looks great!",
                "reviewText": "I like the color and the extra stuff that came with it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}