{
    "remaining_requests": 49127,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Google-Pixel-Memory-Unlocked-Clearly/dp/B07R9PTDTZ",
    "body": {
        "name": "Google - Pixel 3a with 64GB Memory Cell Phone (Unlocked) - Clearly White",
        "price": "$199.99",
        "originalPrice": "",
        "rawPrice": 199.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Google-Pixel-Memory-Unlocked-Clearly/dp/B07R9PTDTZ",
        "soldBy": {
            "sellerID": "A2R3UHIQCUB4GO",
            "name": "Ec fashion",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2R3UHIQCUB4GO&asin=B07R9PTDTZ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07RWPFQLM"
        ],
        "asinVariationValues": [
            {
                "asin": "B07R9PTDTZ",
                "variationName": "Color",
                "variationValue": "Clearly White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41V2ZN742YL._SS36_.jpg"
            },
            {
                "asin": "B07R5CBGY4",
                "variationName": "Color",
                "variationValue": "Purple-ish",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41FfelFeAKL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Just Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41froGV6kcL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/413K1hqqITL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21uXgCCjcKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sFXRlxwqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21cTMyCcvPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21ac5oykUuL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Google Store",
            "link": "https://www.amazon.com/stores/GoogleLLC/page/080B7645-8292-4117-A6CA-1BF598F3FE26?ref_=ast_bln"
        },
        "brand": "GoogleLLC",
        "merchantInfo": "Ships from and sold by eTechtronics (Your Trusted Online Retailer).",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 8717,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tuesday, February 13. Order within 17 hrs 3 mins",
            "FREE delivery February 14 - 16.",
            "Or fastest delivery February 13 - 14.",
            "FREE pickup Friday, February 16",
            "Or fastest pickup Tomorrow, February 12. Order within 15 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "EPEAT products are assessed against criteria including energy use and have a reduced sustainability impact across their lifecycle. SILVER"
        },
        "features": [
            "Capture stunning photos with features like night sight, portrait mode, and HDR-plus",
            "Save every photo with free, unlimited storage at high quality through Google photos",
            "The Google assistant is the easiest way to get things done including screening calls",
            "The fast Charging battery delivers up to 7 hours of use with just a 15 minute charge",
            "Comes with 3 years of OS and security updates and the custom built Titan M chip",
            "Switch seamlessly and keep all your stuff. Plus your favorite Google apps are built-In",
            "The latest Android 9.0 Pie. 100,000:1 super contrast ratio"
        ],
        "description": "Get more done with Pixel 3A. It has an extraordinary camera with features like night sight, portrait mode, and HDR+. A battery that charges faster and lasts all day [7]. All the helpfulness of the Google assistant built in. And 3 years of security and OS updates included [8]. It’s everything you love about Google – in a phone. Works with all major carriers. 1 Google photos offer free unlimited online storage for all photos and videos uploaded in high-quality. Photos and videos uploaded in high-quality may be compressed or resized. Requires Google account. Data rates may apply. 2) US and Canada only. English only. 3) Approximate battery life based on a mix of talk, data, standby, mobile Hotspot and use of other features, with always on display off. An Active display or data usage will decrease battery life. Charging rates are based upon use of the included charger. Charging time performance Statistics are approximate. Actual results may vary. 4) Android version updates for at least 3 years from when the device first became available on the Google store. 5) Some third-party apps and data may not be transferred automatically. 6) Approximate battery life based on a mix of talk, data, standby, mobile Hotspot and use of other features, with always on display off. An Active display or data usage will decrease battery life. Charging rates are based upon use of the included charger. Charging time performance Statistics are approximate. Actual results may vary 7 Android version updates for at least 3 years from when the device first became available on the Google store. FHD+ (2220 x 1080) OLED at 441 ppi, 18.5:9, Full 24-bit depth or 16 million colors, D67 white point, Memory and storage: 4 GB LPDDR4x RAM, Processors: Qualcomm Snapdragon 670.",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Cell Phones",
                "link": "https://www.amazon.com/cell-phone-devices/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7072561011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5.96 x 2.76 x 0.32 inches"
            },
            {
                "name": "Item Weight",
                "value": "5.1 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07R9PTDTZ"
            },
            {
                "name": "Item model number",
                "value": "G020G"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Metal batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 8,717 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#36,351 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #3,728 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "OS",
                "value": "Android 9.0"
            },
            {
                "name": "RAM",
                "value": "64 GB"
            },
            {
                "name": "Connectivity technologies",
                "value": "Bluetooth, Wi-Fi"
            },
            {
                "name": "Other display features",
                "value": "Wireless"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Other camera features",
                "value": "Rear, Front"
            },
            {
                "name": "Form Factor",
                "value": "Smartphone"
            },
            {
                "name": "Color",
                "value": "Clearly White"
            },
            {
                "name": "Whats in the box",
                "value": "USB-C to C Cable, SIM tool, AC Adapter, OTG Dongle, Quick Start Guide"
            },
            {
                "name": "Manufacturer",
                "value": "Google LLC"
            },
            {
                "name": "Date First Available",
                "value": "April 29, 2019"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "1 GB"
            },
            {
                "name": "Standing screen display size",
                "value": "5.6 Inches"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "4 GB"
            },
            {
                "name": "Battery Capacity",
                "value": "3000 Milliamp Hours"
            },
            {
                "name": "Weight",
                "value": "0.32 Pounds"
            },
            {
                "name": "Charging Time",
                "value": "15 minutes"
            },
            {
                "name": "Brand",
                "value": "Google"
            },
            {
                "name": "Model Name",
                "value": "Google Pixel 3a"
            },
            {
                "name": "Wireless Carrier",
                "value": "Unlocked"
            },
            {
                "name": "Operating System",
                "value": "Android 9.0"
            },
            {
                "name": "Cellular Technology",
                "value": "4G"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Wi-Fi"
            },
            {
                "name": "Screen Size",
                "value": "5.6 Inches"
            },
            {
                "name": "Wireless network technology",
                "value": "LTE"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Pixel 3a & Pixel 3aXL Get more done with an extraordinary camera, fast-charging battery, and the helpful Google Assistant built in.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d605dac4-7b55-4f6b-840b-46058607fcfb.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "More to love with Pixel 3a 3 years of security and OS updates. Keep your phone protected against the latest threats and performing at its best.* Keep your data protected. The custom-made Titan M security chip helps secure the operating system and your most sensitive data, like passwords.** Keep more of what you love. Use the Quick Switch Adapter to transfer your messages, contacts, and photos to your new device.*** *Android version updates for at least 3 years from when the device first became available on the Google Store. See g.co/pixel/updates for details.**See g.co/pixel/security for additional security information.***Some third-party apps and data may not be transferred automatically. Visit g.co/pixel/help for information.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/90782cd2-1b61-41fb-915b-058e3bc35c9f.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Night Sight. You’ll never want to use your flash again. Night Sight lets you capture rich detail and color, even in the dark. Charges fast. Lasts all day. Get more done with an Adaptive Battery that delivers 7 hours of use on just a 15-minute charge. It’s designed to learn your favorite apps and reduce power to the ones you rarely use.* *Charging rates are based upon the use of the included charger. Actual results may vary. Know who’s calling and why. Let the Google Assistant help screen your calls, so you know who’s calling and why before you pick up.* *US and Canada only. English only",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/896744b8-ab06-4668-b5d2-7fc5ca54013b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/64fc23c1-5651-475d-a574-02d78f83df10.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/eeb4f3d2-444d-48ab-8c7f-0fcdc4f36617.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d605dac4-7b55-4f6b-840b-46058607fcfb.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/90782cd2-1b61-41fb-915b-058e3bc35c9f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/896744b8-ab06-4668-b5d2-7fc5ca54013b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/64fc23c1-5651-475d-a574-02d78f83df10.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/eeb4f3d2-444d-48ab-8c7f-0fcdc4f36617.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jenn T.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTCM6MJF4TD6H63ZLQ6HYP77E2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXUPO9DKHVYT3?ASIN=B07R9PTDTZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 23, 2020",
                "reviewTitle": "5.0 out of 5 stars Best features in an Android for under $400",
                "reviewText": "I was an early adopter of Google's phones when they came out with the Nexus line. Unfortunately, I never bought a Pixel because Google chose, at first, to compete with the expensive flagship phones that cost $800 or more being put out by Apple and Samsung every year. That has since changed, and I'm a welcome convert back to the Google fold.My last phone was a Moto Z Play, which I purchased for $400 about three and a half years ago. I loved the battery life, but the bluetooth died almost entirely when the phone was two years old, and the camera was never great. By the time I had had it for three years, I couldn't run more than two or three apps without experiencing issues with crashing. Likewise, if I opened more than 50 or so tabs in the web browser, it would typically crash. It's a relief to no longer have those issues.COST: I purchased this phone when it was $320, so I already saved $80 over my last phone purchase. This phone does everything you need and looks sharp. It doesn't have 5G, but the amount of features you get for less than $400 more than justifies the price.CAMERA: Google has really outdone itself with the Pixel 3a's. The camera is fantastic; I no longer need to bring a dedicated digital camera when I'm traveling or attending major celebrations like graduations that need a good camera. It's performance in low-light conditions is fantastic and really something to write home about. Sure, my brother's iPhone 11 Pro has a better camera, but he paid over $1000 for it, so that's not a fair comparison. I'd say that the Pixel 3A's camera and camera software is every bit as good as my wife's Galaxy 10, if not better.BATTERY LIFE: A full charge doesn't last the 2-3 days that my old Moto Z Play did, but the rapid charging feature makes it not matter as much. In my daily commute of 20-30 minutes to work, I can add about 30-40% to my battery, which means I never have to worry about my phone going dead, even if I forget to charge it at night. A full charge tends to last a little over a day with heavy use. For the record, nearly every day I browse the internet for hours, play Sudoku, listen to Spotify, and post and browse on Instagram, Twitter, and Facebook.HARDWARE: It's not a flagship phone, so it's not going to hold up to intensive use. That said, nothing I've thrown at it so far as crashed it. Like I said, I'm a heavy phone user. I don't have to close my apps before switching to another one like I did with my last phone to avoid crashes. I also have experienced hangs like I did with my last phone either. This really does everything you need it to do. I don't think that a normal to heavy phone user needs much more power than this unless they're gaming or photo editing on their phone or something. The bluetooth works a lot better than my old phones did. I have an aging 2013 Prius that does not like to play nice with bluetooth in a lot of my devices. I get in the car, and the phone automatically hooks to the bluetooth and brings up my last Spotify podcast without me fussing with it past the initial setup. I forgot how nice it was when things just worked, you know?LOOK & FEEL: I really like that it's lighter than my last phone even though the screen and the screen's resolution is much larger. It doesn't have a trendy notch, but I don't really care. The fingerprint is located in a nice place in the back that feels very intuitive. There is a feature that lets you squeeze the phone to bring up Google Assistant that I could see some people enjoying, but I never use it because my hands are too small to put enough pressure on the phone to bring it up. Some people may dock a point or two for this, if it's important to you. I don't because I can just shout \"hey google\" at the phone to the same effect, and perhaps the feature works fine if you don't have tiny baby hands like me and buy a phone that's over 6 inches. The phone itself is mostly metal and glass and doesn't feel cheap. I don't think it looks like you spent less than $400 on it at all. Most importantly, it still has an aux port. Not all of us want the hassle of charging and keeping track of bluetooth earbuds that can cost more than your phone and don't sound any better than a $10 wired headset you can get at the pharmacy. The screen is absolutely huge and the resolution makes everything tiny. I don't have bad eyes and I'm not an old maid, but I had to set the text size to \"large\" otherwise every website looks like those old Myspace profiles people made back in 2002 with size-6 font. It's very comfortable to read on; I don't feel like someone would need a dedicated tablet with a phone with a screen this big.SOFTWARE & OS/UI: If you're getting an Android OS, you've probably fine with the OS. That said, Google's UI is so much better than everyone else's (I've used UIs by Asus, Samsung, and Motorola in other phones). The home screen is easier to customize, the app launcher makes sense, and the app switcher is intuitive and quick. Since it's Google, you'll have the newest Android OS's at launch and support for longer than other manufacturers. That was one thing I missed dearly about my old Nexus, and I'm glad Google is finally back in the sub-$500 market again so I can take advantage of it. I think my favorite feature about the UI is that I can turn on \"dark mode\" 24/7 so that I never have white bars or menus anywhere, just nice black ones. It's really saved my eyes. I also like that the volume and brightness on the phone has a very wide range of levels, much moreso than any other phone I've had before, which always had \"silent,\" \"soft-ish\" and \"extremely loud\" with little in between. I can turn down the volume to almost-silent and the brightness to actually quite dark without installing third party apps. Also, there's no bloatware on the phone when you purchase it. That's really nice.All in all, it's a very solid phone and I'm honestly thrilled with how nice the screen and camera is at this price-point. Everything else I've looked at with comparable specs and features is at least $100 more. I've been using mine for the past couple of weeks, and every day I like it more. Full five stars from me.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Okamuro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB3NPW33U5PIBRSLWBJLQ2HQPUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A69P4ZTF3EJR?ASIN=B07R9PTDTZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 31, 2019",
                "reviewTitle": "5.0 out of 5 stars I have a full Pixel 3 XL for work, and was excited for the 3a XL hit the market. Highly Recommended",
                "reviewText": "After several years of growing tired of my Samsung Galaxy work phones getting slower and more bloated with the Samsung UI, I was convinced by coworkers to go to a Pixel. I got the Pixel 3 XL and instantly loved it. Seconds, rather than minutes, to boot. A fast UI experience. Frequent and comprehensive OS updates that aren't lagging months behind the Android updates. A fantastic camera. What's not to love?Even though I refer to my Pixel 3 XL as my work phone, the truth is that I haven't had a personal phone in over a decade... who wants to carry two phones? Then again, there is something to be said about having a healthy work/life balance. With that in mind, I was curious when I heard about the 3a coming to the market... as much as I love the 3 XL, I can't say that I was super excited to spend $900 on a phone. When the 3a XL dropped below $300 (after the deal that gave you a $100 GC), it seemed like a no brainer.As someone that has both a 3XL and a 3a XL, here's what I can tell you:SCREENUnlike the 3 XL, the 3a XL has no screen \"notch\". Where there are some parts of the UI that take advantage of the notch, there are just as many applications that leave an annoying color (non-black) artifact in the notch area when watching landscape full-screen video - it's SUPER annoying. The 3a XL's screen is slightly smaller than the 3 XL, and while it's also a little lower resolution, the density (as a result of the smaller diagonal measurement) doesn't drop that much. In general usage I don't notice any difference. The 3a's screen is OLED, but it appears to be a quality tier below the 3 XL's... you can see it if they are side-by-side, but you wouldn't notice it if you were going from memory.CAMERAPixel phones are renown for their camera performance. While the raw specs tend to be behind other flagship phones' optics and CCDs, the actual picture quality tends to be at or near the top of the heap. The Pixel 3a XL is no different, as the rear camera is the same as the one on the 3 XL. The front camera (which I really don't care as much about) goes with a single, rather than a dual, camera setup. It's not the same as either front-facing camera on the Pixel 3 XL, but the software (which is largely responsible for the picture quality), is the same. Both cameras appear to be excellent.FORM FACTORThe Pixel 3a XL is slightly larger than the Pixel 3 XL. Some of it may be due to the notch-less screen causing the speaker and camera to be mounted above the screen. Some may be due to the larger capacity battery. Perhaps it's also influenced by the case material on the back being made of plastic, rather than glass. Regardless, the phone is about 10% lighter, which is enough to be noticable. An omission that I don't love is that the 3a XL does not support wireless chaging... it's not the end of the world, but it is missed.PERFORMANCEThe 3a XL does have a significantly slower CPU than the 3 XL. The layout of both processors is to have 4 high speed cores, and 4 slower cores. The general idea is that the system workloads can be managed by the OS'es thread scheduler, and be placed on to the lowest power consuming core that is still adequate for the job. Both phones are fine with multitasking. I didn't actually notice any performance difference is the UI or in application speeds, but I also am not a mobile gamer... I would expect for the difference to be most obvious there (assuming there is one). I was a little surprised when the 3 XL came out with 4GB of RAM (since I didn't know if that would be enough), but that worked out well. The 3a XL has the same 4GB of RAM and therefore has similar performance.NOTABLE DIFFERENCES NOT ALEADY MENTIONEDOddly, the Pixel 3a XL has a headphone jack. That's noteworthy because the 3 XL does NOT have a headphone jack. I know there are some \"purists\" that are anti-bluetooth, but I'd say that a phone is not an audiophile platform anyway. Even if you have awesome $1500 headphones, I can still tell you that the DAC in your sub-170 gram phone is junk (comparatively). One of the really nice features of the Pixel 3 XL is that it's waterproof... the 3a XL is not. It's not a dealbreaker for me, but I can see where this would affect some peoples' choices.In conclusion, I thought the deal I got on Amazon when I bought my 3a XL was so good that I bought the phone without even knowing if I'd get a service plan for it. Now that the 3a XL is at its \"normal\" price I still think it's an incredible deal, and I really question anyone who would buy a different phone at this device's price point. Highly Recommended.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tracy Jones",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 18, 2023",
                "reviewTitle": "Older model is fine for basic use - what's a notch?",
                "reviewText": "I switched from Samsung Galaxy to the Google Pixel because I wanted a better camera, and I definitely got better quality photos though it seems I don't have as many options for editing the photos on the Pixel, like adding stickers, etc. Reading the reviews, the notch was a big deal to some people but I don't notice it at all. I found it awkward to take screenshots - how do you hold the power and volume buttons at the same time when they're on the same side of the phone? On the Samsung they were on opposite sides so much easier. I accidentally discovered that I can just swipe up and get a screenshot button to press. I didn't find that tip in any of the help sites. Adding the emoji icon to the phone keyboard shortcuts was something else I figured out by accident. You'd think it would be there already. I like the call screening feature! It's easy and works great. I find the battery doesn't last as long as I would like, but I guess that's to be expected from a new Pixel 3 XL that I bought more than three years after it was released in 2018. It does charge very fast and it was super easy to transfer apps from my Samsung using the cord that came in the box. I thought the larger size might be a problem being a petite person, but it fits my hand just fine. For using basic apps and taking photos and videos, I would recommend buying this phone. It was 1/5 of the original price so definitely worth it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teressa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 18, 2023",
                "reviewTitle": "Nice phone",
                "reviewText": "Nice phone easy to set up.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angelo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 8, 2021",
                "reviewTitle": "Great phone but battery is crippled with Android 12",
                "reviewText": "I went through a lot of hoops to get this phone at a satisfactory quality for the price I wanted, and it took over a month of returns and talking with customer service representatives, but it was totally worth it in the end. The phone is fantastic and the camera quality kicks even newer, more expensive phones to the curb, especially in night mode. As the title says, expect some battery drainage with Android 12, but hopefully a software patch comes along for it sometime soon.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "boi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 3, 2021",
                "reviewTitle": "Works but something's wrong",
                "reviewText": "Arrived in original packaging, all sealed and whatnot. Works fine and is a good grab for the sale priceHowever, had a Verizon SIM card. Creepy! The phone might have been tampered with. This disrespect alone brings the rating to 1 star.Make sure to wipe the system off the phone and install it fresh, you can grab it from Google Developers website.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MoisésMoisés",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 11, 2020",
                "reviewTitle": "Mejor cámara, software y seguridad por el precio",
                "reviewText": "Si buscas la mejor cámara posible, esta es tu mejor opción. No se dejen engañar por el hecho de que su competencia tiene 3, 4 o hasta 5 lentes para fotos, o que si tiene 64 megapixeles etc. Honestamente esos son trucos de mercadotecnia, y este Pixel 3a XL lo demuestra con un único sensor, pues toma fotos que incluso supera celulares que valen hasta el doble, se nota que Google optimizó muy bien el software de la cámara para que tome fotos a la altura del Pixel 3XL que es su hermano mayor a pesar de que este último cuesta hasta $150 dlls más. El único punto \"débil\" que le veo al celular es su diseño, que a muchos no les gusta porque en las tendencias actuales los celulares poseen pantalla completa, y los marcos superior e inferior son algo vistosos, pero al menos a mi parecer hace al celular más cómodo de usar ya que evitas tocar la pantalla accidentalmente mientras juegas o ves videos, pero eso es completamente personal. En cuanto a la pantalla, es de 6 pulgadas OLED y también es de muy buena calidad, (full hd+) para el precio, tiene sonido estéreo que se escucha fuerte, pero no recomiendo subir todo el volumen ya que se saturan las bocinas (aunque es normal, pasa incluso en celulares más caros) basta con bajarle 2 puntos al volumen e incluso así se escucha fuerte, cuenta con jack 3.5mm para audífonos, la carga rápida es de 18 W y entrada usb-c, posee lector de huellas digitales en la parte trasera. La batería dura bastante y les anexo mis estadísticas de uso para tengan una perspectiva de la duración (Mi record fue sacarle 7 horas de pantalla con brillo al 75%) y en el caso de Call Of Duty Mobile funciona con los gráficos en alto y nunca se me ha atorado o cerrado inesperadamente en el uso cotidiano, sólo una vez me pasó pero porque intencionalmente abrí como 20 aplicaciones y otros juegos porque estaba cambiando a cada rato entre los mismos para poner a prueba la potencia del celular. Un punto fuerte que para mi en lo personal es muy importante es que tienes 3 años de actualizaciones tanto del sistema operativo como en parches de seguridad, y como plus el celular cuenta con el chip titan de Google, el cual se encarga de integrar bien la seguridad del software y hardware. Por lo que en cuanto a sus datos personales pueden estar tranquilos. El sistema operativo está muy bien pulido y funciona muy bien, ya que Google tiene control total tanto del sistema operativo como del hardware, y el celular funciona bajo al idea de como Google visualiza que debería funcionar android en los dispositivos con este sistema operativo. Si algo es seguro es que no se van a equivocar si deciden comprar este smartphone, les hará sentirse satisfechos con su compra.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71YoP8FGMOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/610wc8UiWjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61B3w78jsAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61nNIAeMUOL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$199.99",
                "sellerName": "Buying Done Right",
                "sellerRating": "4.5"
            },
            {
                "price": "$199.99",
                "sellerName": "Just Right!",
                "sellerRating": "4"
            }
        ]
    }
}