{
    "remaining_requests": 49068,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Blackview-Unlocked-Waterdrop-4780mAh-Battery/dp/B0BQDZHDYJ",
    "body": {
        "name": "Blackview A55 Smart Phone, 6.528 inches Unlocked Phones HD+ Waterdrop Screen, 3GB+16GB/SD 128GB, 4780mAh Battery, 8+5MP Camera, Android 11 Unlocked Cell Phones, Triple Card Slots, GPS, Face ID - Black",
        "price": "$99.99$77.41",
        "originalPrice": "$109.99",
        "rawPrice": 99.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Blackview-Unlocked-Waterdrop-4780mAh-Battery/dp/B0BQDZHDYJ",
        "soldBy": {
            "sellerID": "A3TJZ0OIZPPIWP",
            "name": "RLXphone",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3TJZ0OIZPPIWP&asin=B0BQDZHDYJ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BQF2GSLY"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41dWDaxLJGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Oj1TWr vL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BTHvR1yPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WV3 rmtcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EW77VPz7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HnXUT-enL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71ftCpDRMrL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ff6f330-b4b4-4ab3-a0bb-8678ae371bf5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/81c5055f-7ef2-403f-b1bb-b005d855cff0/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2c160473-bd09-44d5-bc7d-42945ede944a/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1QbJljALuL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1QbJljALuL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Blackview Store",
            "link": "https://www.amazon.com/stores/Blackview/page/DA18B8BF-16DB-472E-8F1A-E37ECE5C8DE3?ref_=ast_bln"
        },
        "brand": "Blackview",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 454,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 14 hrs 54 mins",
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 54 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "💙6.528''HD+ 400nits Screen💙As the cheapest but most efficient unlocked smart phone, Blackview A55 unlocked cell phones features a 6.528\" HD+ water drop screen with 720*1600 resolution to provide vibrant colors and stunning screen clarity. 400 nits brightness, you can clearly read the content of the mobile phone even in the sun, the font size and display size are adjustable, which is convenient for the elderly to use. A55 is a stylish and powerful budget smart phone unlocked for everyone!",
            "💙2.0GHz CPU & 3GB+16GB/SD-128GB💙A55 unlocked android phones is equipped with 3GB RAM and 2.0GHz low-power processor, which has enough fluency and efficiency to quickly run multiple apps and perform multiple tasks. You can save downloaded apps to SD card, A55 cellphones dual sim phone supports 128GB expansion SD card, which will make your phone run more smoothly.",
            "💙Android 11 & Doke OS 2.1💙Blackview team has been working hard to provide the best experience for users.Blackview A55 unlocked phones uses the latest Android 11 system combined with Blackview's self-developed Doke OS 2.1 system to bring you the latest and most popular features, such as: dark mode, chat bubbles, parental control mode, elegant and user-friendly interface, etc. All of this makes for a pleasant experience for the user. A55 celular has more surprises waiting for you to discover!",
            "💙4780mAh & 3-in-1 Navigation System💙Blackview A55 phones unlocked is an affordable basic phone for everyone, equipped with a 4780mAh battery to meet your daily needs. Smart AI battery management, close inactive apps and save power.Stay active by your side and be ready for your needs! 8MP rear cameras, support panorama, time-lapse, professional and other shooting modes.Face ID, only takes 0.1 seconds to unlock the phone! A55 supports GPS, GLONASS, Beidou navigation, and positioning is faster.",
            "💙4G Dual SIM & 3 Card Slots💙Blackview A55 smartphone adopts 2+1 card slot design, supports two 4g SIM cards, you can use the second number without carrying an extra mobile phone. Blackview A55 cheap phones with mirror polished bezel, deep reflection, gradient effect, elegant, unique gloss and elegant texture. 0.35inch ultra-thin design, 0.43lb thin body, smooth pebble edge, super comfortable feel. We provide 2-year warranty service, if you have any questions, please contact us in time!",
            "💙Kind Reminder💙Blackview A55 unlocked cell phone can work with AT&T, Cricket and GSM network carriers like T-Mobile, BTC, MetroPCS, H2O, Movistar, Telcel, Tigo, Claro,Vivacom, Ultra Mobile, lycamobile, Tello Mobile, Bell Wireless, Rogers Wireless, Chatr, Luck Mobile, Virgin Mobile, Fido, FIZZ, Shaw Mobile, etc. BUT IT CAN NOT work with CDMA Carriers such as Verizon, Sprint, Boost Mobile, Straight Talk or U.S.Cellular!（Connectivity about A55: ① 2G: B2/B3/B5/B83；② 3G: B1/B2/B4/B5/B84；③ 4G: B1/B2/B3/B4/B5/B7/B8/B25/B26/B28A/B28B/B66）"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Cell Phones",
                "link": "https://www.amazon.com/cell-phone-devices/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7072561011"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Carrier",
                "value": "T-Mobile"
            },
            {
                "name": "OS",
                "value": "💙Android 11 & Doke OS 2.1"
            },
            {
                "name": "Cellular Technology",
                "value": "4G"
            },
            {
                "name": "Connectivity technologies",
                "value": "Support T-Mobile，AT&T, Cricket and More Carriers"
            },
            {
                "name": "Wireless network technology",
                "value": "CDMA"
            },
            {
                "name": "Connector Type",
                "value": "Micro USB"
            },
            {
                "name": "Form Factor",
                "value": "Smartphone"
            },
            {
                "name": "Biometric Security Feature",
                "value": "Face Recognition"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Shooting Modes",
                "value": "Panorama"
            },
            {
                "name": "GPS",
                "value": "True"
            },
            {
                "name": "Water Resistance Level",
                "value": "Not Water Resistant"
            },
            {
                "name": "Audio Jack",
                "value": "3.5 mm"
            },
            {
                "name": "Special Feature",
                "value": "💙Android 11, Privacy Protection, Gesture Navigation; Doke OS 2.1, Syetem Manager, Artistic Themes 💙4780mAh Battery smartphone, Smart AI Battery Management, 🌈CE Certification; Exclusive Packaging for Amazon (Authorized Merchant Only) 🌈Our personal customer care support provides a friendly and quick response within 24 hour. Our store has two-year quality guarantee., 💙8MP Clear Rear Cameras + 5MP Front Camera; Edit your photographs further with filters, emojis, or other techniques 💙GPS, GLONASS, Beidou Triple Navigation System; Sensors: G-sensor, P-sensor, L-sensor, 💙Blackview A55 Smart Phone with Elegant Design: 0.43LB, 0.358IN Slim Body 💙6.528\" Waterdrop Screen, 400nit Brightness, 💙2.0GHz Quad-core MediaTek MT6761V CPU; 3GB RAM + 16GB ROM, SD 128GB 💙4G dual sim unlocked cell phones; Bluetooth 4.2, Wifi, 3.5mm Audio Jack"
            },
            {
                "name": "Battery Capacity",
                "value": "4780"
            },
            {
                "name": "Battery Description",
                "value": "Lithium-Polymer"
            },
            {
                "name": "Charging Time",
                "value": "2.25 Hours"
            },
            {
                "name": "Battery Power",
                "value": "5780"
            },
            {
                "name": "Front Photo Sensor Resolution",
                "value": "5 MP"
            },
            {
                "name": "Other camera features",
                "value": "Front"
            },
            {
                "name": "Optical Sensor Resolution",
                "value": "8 MP"
            },
            {
                "name": "Screen Size",
                "value": "6.53 Inches"
            },
            {
                "name": "Scanner Resolution",
                "value": "720 x 1600"
            },
            {
                "name": "Display Type",
                "value": "LCD"
            },
            {
                "name": "SIM card slot count",
                "value": "Dual SIM"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "128 GB"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "3 GB"
            },
            {
                "name": "Memory Slots Available",
                "value": "💎2 Nano SIM Cards + 1 Micro-SD"
            },
            {
                "name": "CPU Manufacturer",
                "value": "MediaTek"
            },
            {
                "name": "CPU Speed",
                "value": "2 GHz"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 454 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Brand",
                "value": "Blackview"
            },
            {
                "name": "Model Name",
                "value": "A55 Blakcview phone"
            },
            {
                "name": "Year",
                "value": "2023"
            },
            {
                "name": "Model Number",
                "value": "BOSUS-A55-Black3"
            },
            {
                "name": "Whats in the box",
                "value": "USB Cable"
            },
            {
                "name": "Manufacturer",
                "value": "Blackview"
            },
            {
                "name": "Weight",
                "value": "6.9 Ounces"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "6.6 x 3.02 x 0.36 inches"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Warranty Description",
                "value": "💙Two-year warranty from the date of purchase!"
            },
            {
                "name": "Operating System",
                "value": "💙Android 11 & Doke OS 2.1"
            },
            {
                "name": "Connectivity Technology",
                "value": "Support T-Mobile，AT&T, Cricket and More Carriers"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Blackview Attitude - Strength produces Value. Breakthrough creates the Future! Blackview We focus on high technology and high performance.Blackview Smartphone will appeal to you with its powerful features and efficiency! Blackview A55 Cell Phone Outstanding Features - Powerful, Fast, Elegant 0.358in, 0.43lb Body: Light as a feather. The matte textured back cover and ergonomically rounded curves provide a comfortable feel.400 nit 6.528\" HD+ IPS Display: Stunning views on the big screen, help you explore every details!2.0GHz Quad-core MediaTek MT6761V CPU: Run multiple applications and multitask with enough fluidity, responsiveness and efficiency to meet your productivity and entertainment needs.Android 11 & Doke OS 2.1 System: More respect for user privacy and more humanized design.4780mAh & Smart AI Battery Management: Slow down the loss of power and last a whole day.8MP Clear Triple Rear Cameras + Multiple Shooting Modes (time-lapse, professional): Record your wonderful life, and clearly record the beauty of every day with you.4G Dual SIM Slots: Deliver fast and stable mobile network experience for better work and play capabilities.Triple Navigation System: GPS + GLONASS + BeidouSupport: G-sensor + P-sensor + L-sensorConnectivity: 2G / 3G / 4G, 5G Wifi, Bluetooth 4.2 You can use whichever carrier you want after setting the APN and it is easy to set. If you encounter any quality, hardware, network or operation problems while using your Blackview A55 android phone, please let us know immediately.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c88190f5-cfe7-4fa0-88e5-04e71b772df1.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Exquisite Appearance Inspired by the water ripple resulting from raindrops dripping into the calm lake, made of durable material and treated with refined craftsmanship, A55 cellphone presents a minimalist back cover in youthful and living colors. With the texture of matte finish and ergonomic rounded curves, it’s comfortable to fit in hand. Clear and Large Screen 6.528\" Waterdrop Display: Start your next incredibly immersive visual journey with silky smoothness and fast responsiveness.720*1600 HD+ Resolution: Bring you a vivid experience of the real world that will captivate you, providing vivid details, rich colors and sharp contrasts.400nit Brightness: Clearly read mobile phone content even in sunlight.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7c58565-ac7d-4845-a04a-3ba710d7c2f6.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Blackview A55 unlocked phones is equipped with MT6761V quad-core processor clocked up to 2.0GHz and 3 GB RAM, ensuring more stable performance every time you process multiple tasks at the same time, you can run more applications at the same time, no longer limit work and games .A55 mobile phone also supports 128GB expansion memory. With the help of SD card to expand the phone space, you can store and download photos, videos, e-books, games, etc. at any time, making your life more interesting and no longer worry about storage limitations.With a powerful processor and larger storage space, the A55 smartphone does its best to let every user say goodbye to problems such as delays during use, bringing a smoother and more amazing experience to every user.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64a00eef-30bd-458a-8f5b-f89e82139057.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Android 11 - Comprehensively upgrade user privacy protection, communication is more convenient Doke OS 2.1 - Intelligent control, human interaction experience System Manager: Support all-in-one controls such as trash cleaning and battery management.Clone Phone: Transfer the privacy data safely from the old to the new device.Artistic Themes: Two sets of themes are with enriching icons and invigorating wallpapers.Cold Room: Freeze apps to avoid their stealthy background running and save memory.Screenshot/Long Screenshot: For important messages, make a screenshot or long screenshot and edit it easily.Dual-window Entertainment: View different contents on the same screen to enable entertaining while working.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/26205d7c-beeb-4b74-b87f-2b7ace1c318f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "As an affordable basic phone for everyone, Blackview A55 unlocked phone is equipped with an 8MP rear triple camera that supports multiple shooting modes such as time-lapse, and professional.5MP front camera, perfect selfie camera, make your photos more eye-catching. Feel free to use the A55 smart phone to take selfies, shoot creative videos, and leave more wonderful moments in your life!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a41be25-6108-45d6-81d0-14d4ac403aee.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "A55 cell phone dual sim has a large 4780mAh battery and intelligent dual protection functions, which can meet your long standby needs. AI smart battery management can close idle applications in time to help save power. A55 telephone cellulaire is your best choice!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f21278b-46c2-4b9a-b980-5b4f260d114b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Connectivity: 2G: B2/B3/B5/B833G: B1/B2/B4/B5/B844G: B1/B2/B3/B4/B5/B7/B8/B25/B26/B28A/B28B/B66 Please make sure your SIM card belongs to the following operators, otherwise your phone will have no signal. Support Carriers CAN work with AT&T, Cricket, T-Mobile, BTC, MetroPCS, H2O, Movistar, Telcel, Tigo, Claro,Vivacom, Ultra Mobile, lycamobile, Tello Mobile, Bell Wireless, Rogers Wireless, Chatr, Luck Mobile, Virgin Mobile, Fido, FIZZ, Shaw Mobile, etc.?CAN 𝐍𝐎𝐓 work with CDMA Carriers such as Verizon, Sprint, Boost Mobile, Straight Talk or U.S.Cellular! The storage space of A55 can be expanded to 128GB by using TF card/micro SD card. Tip: that it's not a large SD card, it's a micro SD/TF card",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5d2ce10d-0b31-4dea-8a33-1db25ed69216.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c88190f5-cfe7-4fa0-88e5-04e71b772df1.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7c58565-ac7d-4845-a04a-3ba710d7c2f6.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64a00eef-30bd-458a-8f5b-f89e82139057.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/26205d7c-beeb-4b74-b87f-2b7ace1c318f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a41be25-6108-45d6-81d0-14d4ac403aee.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f21278b-46c2-4b9a-b980-5b4f260d114b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5d2ce10d-0b31-4dea-8a33-1db25ed69216.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alin Harmon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTSQTB34AXLIWSSW7GN5IVDK4KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SUO7SPJB7RYW?ASIN=B0BQDZHDYJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Good",
                "reviewText": "Good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "George Uwakwe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEPPFIXIJIDMWYSXDYHXZ5Y2BWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21WX16SAKG81E?ASIN=B0BQDZHDYJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Performance",
                "reviewText": "works great. I love the phone",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dustin Ryan Shaw",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJCNM6W4O5WKILD7TCOEVKHUTPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4DQH8S99T04F?ASIN=B0BQDZHDYJ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 10, 2023",
                "reviewTitle": "3.0 out of 5 stars Very little space",
                "reviewText": "I love the price and the software that blackview uses, as far as blocking and ringtone/ notification settings fo individual contacts and apps. However the operation storage for this phone is minimal! I am only able to download and use 2 additional apps (not factory apps). Sometimes I can only use one additional app.However regardless of that, I have to clean storage and delete things multiple times a day. Or else the phone won't operate properly. Now I will say maybe that is due to the fact that this phone is a 2021 phone and we are now in the year 2023 so data is more than it was back then as it continues to get more as the years progress. Even with an SD card installed the phone itself has limited operational memory it can use I have disabled apps and uninstalled updates on apps just to be able to keep using this phone.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher Chi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIARXCYFUBOYGITJB4AGT363IZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SSM8U5ZYOEH6?ASIN=B0BQDZHDYJ",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "1.0 out of 5 stars Bad seller/ phone",
                "reviewText": "The seller advertised the phone as unlocked, meanwhile it’s locked to an identified carrier. The phone can’t connect to the internet. I bought several of the phones for my relatives in Africa but none of them, 3 in number could connect to the internet via any local carrier. Bad seller and bad phone. Please don’t buy this phone again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Placeholder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIQSS7NMJJA3IUJZL5HXT3RYX3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VQHZGDNA4UJC?ASIN=B0BQDZHDYJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Cell Phone A55 Not Compatible With Boost Mobile",
                "reviewText": "A55 not a bad phone, however was not compatible with Boost Mobile. I lost my phone and decided to buy the A55, only to find out it's not compatible with Boost Mobile and had to return it.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paula Foerstel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6VQ7KVZVLP6PCDCEMOFW4XQJJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HN3LZLXDF31M?ASIN=B0BQDZHDYJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Cell phone",
                "reviewText": "Great phone for the price ,it's only 4g but still works for another year , nice phone",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Héctor Orta",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGII6JEN5BVSE35FX45FKF3RLAZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LNAETHCOOJ5E?ASIN=B0BQDZHDYJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 21, 2023",
                "reviewTitle": "5.0 out of 5 stars I will try a new one",
                "reviewText": "Surfing thru apps and websites time response is somewhat slow , just good to play music",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phillip James",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGP2WKVL7AYJPVRJNW6K54YA3MJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H8FLUFYELIAL?ASIN=B0BQDZHDYJ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2023",
                "reviewTitle": "3.0 out of 5 stars Not great quality",
                "reviewText": "This phone not good quality but good for a replacement until you can afford a better phone.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacopo Lunardi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 11, 2024",
                "reviewTitle": "Ottimo rapporto qualità-prezzo",
                "reviewText": "Uno smartphone economico che ha un ottimo rapporto qualità-prezzo. Android aggiornato all'ultima versione disponibile, ottima estetica, nessun problema funzionale dopo 6 mesi. Dato il prezzo e la buona qualità, lo trovo assolutamente simile a modelli molto più costosi. Unico neo: la fotocamera non di altissimo livello (ma per il prezzo che ha, a me va benissimo così).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Estevez Lucas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 17, 2023",
                "reviewTitle": "Bonne prise en main et Bon modèle pour un téléphone portable pas cher",
                "reviewText": "Portable pris pour ma femme et le rendu est Top, stockage efficace. Même niveau jeu en performance rien à dire. Livré proprement. Bonne photo. J'ai aimé le téléphone en lui même pour sa bonne prise en main et surpris ni lourd ni léger et le rendu est cool pour ma part !!!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "navigator69",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 22, 2022",
                "reviewTitle": "BV-A80Plus: Ottimo prodotto.",
                "reviewText": "Ottimo prodotto. Buona fattura. Buone prestazioni e velocità di navigazione. Un entry-level che in realtà regge il confronto con prodotti di altri Brand di fascia ben superiore. Ottimo rapporto qualità/prezzo. Ottimo acquisto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fran ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on May 25, 2021",
                "reviewTitle": "Buen diseño, por ese precio no se puede pedir mas",
                "reviewText": "La calidad precio, está muy bien.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grit",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 15, 2021",
                "reviewTitle": "B-Ware aber Top",
                "reviewText": "Den Kidis gefällt es, bei der AF Funktion der Kamera die Einstellmöglichkeiten nutzen dann geht das auch wirklich gut (bei Tag auch ohne).Keine schnelle Knipsi Knipsi Kamera, aber eben wie früher (Nacht = Nachtmodus etc.) und dann zu analog doch erstaunlich gut.Das Paket stimmt für den B-Warenpreis.DANKE",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}