{
    "remaining_requests": 49089,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samsung-Galaxy-S21-5G-Version/dp/B08WHKF6RJ",
    "body": {
        "name": "Samsung Galaxy S21+ 5G, US Version, 128GB, Phantom Black - Unlocked (Renewed)",
        "price": "$268.00 - $242.00 - $217.00",
        "originalPrice": "$280.85",
        "rawPrice": 268.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Samsung-Galaxy-S21-5G-Version/dp/B08WHKF6RJ",
        "soldBy": {
            "sellerID": "A20EQ1BQB4Q2FF",
            "name": "thegadgetdeals",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A20EQ1BQB4Q2FF&asin=B08WHKF6RJ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": false,
        "maximumQuantity": "10",
        "stockDetail": "Only 10 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41t7gEMl9gS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Db9SbORuS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21u-80wSP9S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ASbR gxpS.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon Renewed",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Last Of The Loot",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1210,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 13 hrs 57 mins",
            "FREE delivery Friday, February 16.",
            "Or fastest delivery Tuesday, February 13.",
            "FREE delivery February 16 - 23.",
            "Or fastest delivery Tuesday, February 13."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "This Phone Is Unlocked And Compatible With Any Carrier Of Choice On Gsm And Cdma Networks (E.G. At&T, T-Mobile, Sprint, Verizon, Us Cellular, Cricket, Metro, Tracfone, Mint Mobile, Etc.).",
            "When You Receive The Phone, Insert A Sim Card From A Compatible Carrier. Then, Turn It On, Connect To Wi-Fi, And Follow The On Screen Prompts To Activate Service.",
            "The Device Does Not Come With Headphones Or A Sim Card. It Does Include A Charger And Charging Cable That May Be Generic.",
            "Tested For Battery Health And Assured To Have A Minimum Battery Capacity Of 80%."
        ],
        "description": "With Galaxy S21+ 5G, you have the ability to record in 8K. Which means your videos are double the resolution of 4K video. Or use the 64MP camera for still shots that come out clear whether it’s day or night. Single Take AI transcends the usual restrictions of photo and video editing to capture life’s greatest moments in one single take. Galaxy S21+, made for the epic in every day.",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Cell Phones",
                "link": "https://www.amazon.com/cell-phone-devices/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7072561011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6.7 x 3.4 x 2.44 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.44 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B08WHKF6RJ"
            },
            {
                "name": "Item model number",
                "value": "Galaxy S21+ 5G"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,210 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#155 in Amazon Renewed (See Top 100 in Amazon Renewed) #54 in Renewed Smartphones #1,052 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Date First Available",
                "value": "February 11, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "Samsung"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "128 GB"
            },
            {
                "name": "Standing screen display size",
                "value": "6.7 Inches"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "8 GB"
            },
            {
                "name": "Battery Capacity",
                "value": "4800 Milliamp Hours"
            },
            {
                "name": "Brand",
                "value": "SAMSUNG"
            },
            {
                "name": "Model Name",
                "value": "Galaxy S21 Plus"
            },
            {
                "name": "Wireless Carrier",
                "value": "Unlocked for All Carriers"
            },
            {
                "name": "Operating System",
                "value": "Android"
            },
            {
                "name": "Cellular Technology",
                "value": "5G"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless, Bluetooth"
            },
            {
                "name": "Color",
                "value": "PHANTOM BLACK"
            },
            {
                "name": "Screen Size",
                "value": "6.7 Inches"
            },
            {
                "name": "Wireless network technology",
                "value": "GSM"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "jen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF53KTHW2ZXZ7NH7CJ3OTEJV5W7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUDABKBD1CINL?ASIN=B08WHKF6RJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent condition, unlocked, worked with a European SIM card",
                "reviewText": "I needed an unlocked phone to use in Italy and Austria. I bought this S21+ along with an \"Orange Holiday Europe\" SIM card.The phone arrived in excellent condition, with no scratches or dents. The screen appeared to have been replaced. After setting it up, I tested it by installing SIM cards from AT&T and TELLO, both worked perfectly - it's definitely unlocked.Right before the trip, I installed the \"Orange\" SIM card with the phone powered down. Upon arrival in Italy I powered it up, and it immediately connected to the local service. We used Google Maps to get from the airport to our hotel some 50km's away, no problems at all.Photos taken on the trip were excellent. We installed Google Translate and Microsoft Translator which worked perfectly and were a real asset in helping us navigate the foreign signs, menus, etc. We also set up Hot Spot and Tethering, and used that along with wireless calling on our US SIM based phones to make and receive free calls and texts to/from US numbers. It all worked as expected with no issues.There are two minor issues to report.The battery life was OK, I would start each day at 100% but by end of day it typically had around 30% remaining. My new (locked) S23+ easily gets two days on a single charge.I did notice a minor blemish on the screen after a week of using it. At first I thought it was just a greasy smear, but no amount of cleaning has managed to remove it. I didn't notice this when I first received the phone so it most likely manifested after use. It would seem to be a flaw with the screen itself. I did not use a screen protector, which may or may not have helped to prevent it from occurring. Fortunately it's close to the bottom of the screen and has not really affected the viewing area, nor has it affected the touch screen in the area of the blemish.All-in-all I am happy with this phone. I plan to use it for future international trips as it can do what I need without having to pay the $10-a-day AT&T International Roaming plan - that soon gets very expensive with 2 or more phones.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ian McCallister",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLMWZE3Y6GC5OZPDQ7WZ5QE3DRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SG4RSN3E280Q?ASIN=B08WHKF6RJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Meeting expectations",
                "reviewText": "This was one of my more hesitant Amazon purchases, due to being used electronics. I did read some issues in other reviews, decided that the failure opportunity is simply just higher, and gave it a shot. I believe there are 90 days to return. So far so good... phone is in great condition, with minimal sign of use. It activated on Verizon on first try with no store visit or phone calls to CS. Battery life, for my usage, is better than expected.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Qcue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7DQDBMFEBP6YCZ6U6U3EV325GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLTLEXAAEU3GL?ASIN=B08WHKF6RJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 23, 2023",
                "reviewTitle": "4.0 out of 5 stars Phone is great but bombarded with Software Updates and minimal packaging protection",
                "reviewText": "Just be aware that when setting up the phone the Software is likely extremely outdated so expect an hour to set it up after downloading 2 years of updates which will eat up around another 20-30GB of the 128GB you get,aside from transferring your own data to the device.Other than that the phone itself is good. Few minor scrapes and scratches around the camera,not original box,bare bones packaging,no interior padding or light bubble wrap.Came with pre-installed screen protector (which I changed anyway),can confirm it came with a generic charger that I didn't even bother to open,would not recommend you risk damaging the phone plugging it up with it,buy a higher quality one for a few extra bucks.receipt and return slip in the box. No headphones.Battery life shoots down by 10-15%fast but may just be an analysis flaw based on aging, it still lasts plenty long about 5 or 6 hours with heavy use. Fingerprint,screen,everything is fine no issues with the phone itself. Wireless charging is a bit slow for me, super fast charging works.Cameras functional.That's about it.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M.C.Laido",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI6THOYGCPOV52EEPPBBNRJ5ZXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10YVGLOWTCXHK?ASIN=B08WHKF6RJ",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "1.0 out of 5 stars Phone seems great but not working microphone and battery is horrible",
                "reviewText": "I'll start saying my phone disappeared after delivery for almost 2 days.. I know this is not on seller but UPS didn't have me sign and after shooting the picture probably moved the package cause I found it in a totally different location. Luckily I found it because seller told me I had to wait 10 days before taking action on the phone and I bought this one cause my older phone is dead. I believe when you pick up a delivery service you should be responsible for it and I don't want to spend twice the money to get a product.Phone looks great, from 12 inches you can see some minor scratches here and there but I don't mind and those are very very minimal. However, BATTERY LIFE is trash. Charged to 100% in the morning the phone cannot reach the end of the day, usually by 3pm it is under 20% and I have not even installed half of the app I usually use.Microphone is broken, I tried all the software solution recommended from samsung, soft reset, factory reset, permissions, cache wiping etc...During phone calls or recording volume and quality goes up and down so much that people cannot understand what I am saying.Screen, Camera, overall look and sound are pretty good. I would def recommend the model but experience with this seller so far is very low.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Leblanc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7IIWG2KIULUZFXKVRAEMKYACWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HOAPQ7YYLXYM?ASIN=B08WHKF6RJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent condition like new",
                "reviewText": "This was a really good purchase it came quickly then expected and in almost new condition everything works fine no Mark scratches blemishes I am very happy and next time I purchase a renewed phone I will be back",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bill Clark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXBBLDUMBFJJ4MSM5ZC5PHIWMQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IUVR5VCT82OU?ASIN=B08WHKF6RJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazon Renewed came through",
                "reviewText": "First time purchasing an Amazon Renewed product and it has been a great decision. Looked at other renewal sales sites for this particular phone and they were all $25+ higher. This phone is in perfect condition, has worked flawlessly and was easy to replace my old phone on my current provider without their intervention or being charged. Battery life is great and easily lasts on the most used days. Will be looking for another Amazon Renewed purchase for a second phone for my wife and possibly a replacement for my old tablet.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}