{
    "remaining_requests": 49080,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Nokia-Android-Unlocked-Smartphone-6-52-Inch/dp/B093QPTSK7",
    "body": {
        "name": "Nokia G10 | Android 11 | Unlocked Smartphone | 3-Day Battery | Dual SIM | US Version | 3/32GB | 6.52-Inch Screen | 13MP Triple Camera | Polar Night",
        "price": "$107.95",
        "originalPrice": "$149.00",
        "rawPrice": 107.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Nokia-Android-Unlocked-Smartphone-6-52-Inch/dp/B093QPTSK7",
        "soldBy": {
            "sellerID": "AC3J90KUFDYZK",
            "name": "Phonesnbeyond",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AC3J90KUFDYZK&asin=B093QPTSK7&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B098SQWTQC"
        ],
        "asinVariationValues": [
            {
                "asin": "B093QPJSKJ",
                "variationName": "Color",
                "variationValue": "Dusk | Purple",
                "price": "$107.95",
                "variationImageURL": "https://m.media-amazon.com/images/I/51xPE5V6jQS._SS36_.jpg"
            },
            {
                "asin": "B093QPTSK7",
                "variationName": "Color",
                "variationValue": "Night",
                "price": "$119.50",
                "variationImageURL": "https://m.media-amazon.com/images/I/41XhQ6BpejS._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41XhQ6BpejS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41zjJFjVPtS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411ITSkk1GS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21WfqWDsvuS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41GhHP6Y-fS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514Y-b0bkEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FyHC4iQ-L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/da591afd-9545-4191-91af-d5bb3d0fae05/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/12d267d3-bd40-427f-b8be-95066b6b196b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/635d95dc-8230-4b5f-9910-f52fa6a4232c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/718d74a5-4e79-479f-834f-6c62d8adddfd/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/20895301-6f15-46b6-b00e-4badc7021c38/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 5,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71IIUPjX98L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81H7oTcHSgL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Nokia Store",
            "link": "https://www.amazon.com/stores/Nokia/page/BBD88D40-BF44-4A32-90F8-5A0E8C5658A1?ref_=ast_bln"
        },
        "brand": "Nokia",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 841,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 16 hrs 55 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Make the most of family-sized battery power with up to 3 days of life between charges..Other camera description:Front,Rear",
            "Enjoy the 6.5” screen and brightness boost for clear viewing – even when you’re out and about.",
            "Capture family life from every angle on the triple camera and explore advanced imaging modes.",
            "Get tomorrow’s phone today with 2 years of upgrades and the latest Android features. To ensure the best Android experience, download your device’s newest available version of Android during product setup.",
            "Product is compatible with GSM carriers. The following mobile network providers are confirmed to be compatible at this time: AT&T, Boost, Cricket, H2O Wireless, Metro, Net10, Simple Mobile, T-Mobile, Tracfone. Other GSM carriers cannot be confirmed to be compatible. Carrier network coverage is dependent upon the carrier's service area. Product is not compatible with Verizon.",
            "Keep the family safe with a side fingerprint sensor and secure face recognition."
        ],
        "description": "To make the most of family life, you need plenty of energy. Luckily for you, Nokia G10 has a battery that goes days between charges – for more time to captivate your kids on the bigger screen. And with a triple rear camera, complete with enhanced imagery, you’re always ready to catch those special moments. Plus, when you reach the end of the day, there’s still plenty of power for you to unwind – why not call a friend, or catch up on your favorite show? Compatibility: This device is designed to work with GSM carriers. This product will not support Verizon or Verizon subsidiaries. Please confirm compatibility with your chosen carrier before purchasing. For support with SIM card or network related issues, please contact your carrier for assistance in connecting your device to the chosen compatible network. Supported Network bands: 2G: 850 / 900 / 1800 / 1900 3G: 850 / 900 / 1700(AWS) / 1900 / 2100 4G/LTE: 1, 2, 3, 4, 5, 7, 8, 12, 13, 17, 28, 66 Charging: This product is designed to be charged using the charging adapter and charging cable that are provided in the product box. Charging this device with any other charging adapter or cable may cause device malfunction. Please observe basic safety steps when charging this device and do not charge this product with malfunctioning or damaged equipment. Current Software Version: Android 10 Bluetooth Version/Range: 4.2 – 30’ Range FAQ How can I install available updates? In many cases updating your product to the latest software version will alleviate any issues experienced. To update your device please navigate to Settings > System > System update > Check for update to check if updates are available. Follow the on screen prompts to install the latest software version if available.= How can I close an app that has stopped working? Open Settings on your phone and select Apps. Then find the app you're having issues with and select Force Stop. I want to conserve battery life. How can I activate the Power Saver mode? On your phone, open Settings, then choose and activate Battery Power Saving. Please also be aware that battery life depends on a variety of factors such as device usage frequency, application requirements, your current operating system, and cellular signal strength. How can I back up my files? Navigate to Settings > System > Backup, and switch backup on. How can I reset my smartphone's network settings? Navigate to Settings > Network & Internet > more_vert > Reset. Performing this reset may help if you're having connection issues. How do I connect my phone to my carrier network? If your Nokia phone and network are compatible, place your SIM card in the SIM card tray using the included SIM card removal tool to open the SIM tray. Once your SIM card has been inserted into the device, power on your phone and proceed through the product setup steps. If you are not able to connect to your network after finalizing the product setup, please contact your carrier support for additional assistance as every carrier has different steps to assist you in ensuring your product connects to their compatible network. How can I ensure other people hear me on my microphone? If you are experiencing microphone issues with your device and your product has a Google Assistant button, please ensure that the Google Assistant button is not stuck or dirty as this will cause the microphone to not function as intended. If the Google Assistant button is not obstructed, please ensure that there is no dirt or debris in the headphone port of your product. If the headphone port is also clear, please disable the microphone permission of the Google Assistant, by going to Settings > Apps & Notifications > Google App > Permission > Microphone > Deny. How can I turn up the volume to my speaker? First, please ensure that there is no dirt or debris in the headphone port of your product. If your headphone port is clear, please make sure that “Do Not Disturb” is not enabled. To disable this setting, navigate to Settings > Do not disturb. Make sure this is toggled off. If Do Not Disturb is off, navigate to Settings > Sounds and vibration > Volume > move the Media slider to the right to increase volume and test your speaker. If you are still not able to hear any audio, check the settings of the application that you are using from the Settings menu as many applications will have their own volume settings. Why is my phone feeling warm, closing apps or occasionally slowing down? During extended operation, the device may feel warm. In most cases, this is normal. To avoid getting too warm, the device may automatically slow down, dim display during a video call, close apps, switch off charging, and if necessary, switch itself off. If the device is not working properly, take it to the nearest authorized service facility. How do I reboot my smartphone when it’s not responding? If your phone is unresponsive, you can perform a “soft reset” by pressing the volume up key and the power button simultaneously for about 15 seconds (or until phone vibrates). Your phone should then restart momentarily. This is a safe and quick way to reboot your device without losing or erasing any data. My phone won’t charge. What should I do? First ensure the issue isn't with the power source or socket you're using - you can quickly check this by plugging your phone into a different outlet, then checking if it charges. If the socket is not the issue, try taking a closer look at the power cable or charging port on your phone, ensuring everything appears as it should. Then, try turning your phone off completely and plugging it into the socket - bear in mind if the battery is completely drained, it might take up to 2 or 3 minutes to start charging. How can I contact support? Our customer support page offers a number of ways that you can contact support. Please visit the Nokia website for further assistance. How do I fix touch sensitivity issues on my phone? Before performing any additional troubleshooting steps, please ensure that your product does not show any physical damage, has not been exposed to water, the screen is clean, and your fingers and hands are not wet or dirty. Please also remove any 3rd party screen protectors that you may have on the device as non Nokia branded screen protectors may decrease the touch sensitivity of the device. If none of these solutions resolve the issue that you are facing, please perform a hard reset back to factory settings. Please note: a hard reset will completely erase all the data, settings and content on your smartphone, returning it to the original factory settings. We strongly advise that you back up your device before a hard reset. Visit here to learn more about how to back up your smartphone remotely. To reset your smartphone and erase all its content, first make sure your phone is connected to a power source. We also recommend that your battery is at least 50% charged when you perform a hard reset. Press the volume up key and the power button simultaneously for about 30 seconds or until the root menu appears. Then choose the action you want to take from the root menu, in this case “Wipe data/factory reset”. Alternatively, you can also perform a hard reset by tapping Settings > Backup & Reset > Factory data reset > Reset phone > Erase everything.",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Cell Phones",
                "link": "https://www.amazon.com/cell-phone-devices/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7072561011"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Carrier",
                "value": "Unlocked"
            },
            {
                "name": "Operating System",
                "value": "Android 11.0"
            },
            {
                "name": "Cellular Technology",
                "value": "2G"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Wi-Fi, USB"
            },
            {
                "name": "Wireless network technology",
                "value": "GSM, LTE"
            },
            {
                "name": "Connector Type",
                "value": "USB Type C, 3.5mm Jack"
            },
            {
                "name": "Form Factor",
                "value": "Slate"
            },
            {
                "name": "Biometric Security Feature",
                "value": "Fingerprint Recognition"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen, Microphone, Buttons"
            },
            {
                "name": "Phone Talk Time",
                "value": "36 Hours"
            },
            {
                "name": "Shooting Modes",
                "value": "High Dynamic Range"
            },
            {
                "name": "GPS",
                "value": "True"
            },
            {
                "name": "Water Resistance Level",
                "value": "Not Water Resistant"
            },
            {
                "name": "Headphones Jack",
                "value": "3.5 mm"
            },
            {
                "name": "Special Feature",
                "value": "Touchscreen, Dual SIM, Camera, LTE, Smartphone"
            },
            {
                "name": "Battery Capacity",
                "value": "5050 Milliamp Hours"
            },
            {
                "name": "Battery Life",
                "value": "72 Hours"
            },
            {
                "name": "Battery Description",
                "value": "Lithium-Ion"
            },
            {
                "name": "Charging Time",
                "value": "3 Hours"
            },
            {
                "name": "Battery Power",
                "value": "5050"
            },
            {
                "name": "Front Photo Sensor Resolution",
                "value": "8 MP"
            },
            {
                "name": "Rear Camera Resolution",
                "value": "8 MP"
            },
            {
                "name": "Other camera features",
                "value": "Rear, Front"
            },
            {
                "name": "Optical Sensor Resolution",
                "value": "13 MP"
            },
            {
                "name": "Screen Size",
                "value": "6.52 Inches"
            },
            {
                "name": "Display Type",
                "value": "LCD"
            },
            {
                "name": "Refresh Rate",
                "value": "60 Hz"
            },
            {
                "name": "Aspect Ratio",
                "value": "21:9"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "1600x720 Pixels"
            },
            {
                "name": "SIM card slot count",
                "value": "Dual SIM"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 841 ratings 3.8 out of 5 stars"
            },
            {
                "name": "Brand",
                "value": "Nokia"
            },
            {
                "name": "Model Name",
                "value": "G10"
            },
            {
                "name": "Year",
                "value": "2021"
            },
            {
                "name": "Model Number",
                "value": "TA-1338"
            },
            {
                "name": "Included Components",
                "value": "Nokia G10, Type C USB Cable, Charging Adapter, Screen Protector (Pre-applied), Quick Start Guide"
            },
            {
                "name": "Manufacturer",
                "value": "HMD Global Oy"
            },
            {
                "name": "Item Weight",
                "value": "6.8 Ounces"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "6.49 x 2.99 x 0.36 inches"
            },
            {
                "name": "Color",
                "value": "Night"
            },
            {
                "name": "Warranty Description",
                "value": "1 year manufacturer"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "512 GB"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Count on it round the clock It might surprise you, but the secret to a happier family is… battery life. That’s why Nokia G10 comes with a battery that can last up to 3 days between charges. Big enough for the whole family Nothing engages kids quite like their favorite show or movie. Nokia G10’s big screen comes with a brightness boost – so even when you’re not at home, you can grab a little peace and quiet. Shots you’ll love, from any angle Capture every fun, frantic family moment with Nokia G10’s triple camera and advanced imaging modes – so from grade school awards to family celebrations, your special moments live on.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ae5a78cb-ce51-4423-aad8-9256f836a578.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c33df1c6-30d0-4e77-abb9-7361387fee13.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/827e3674-7118-49a0-ac07-2bc9a27de898.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Keep the family safe With a side fingerprint sensor and face recognition, you can unlock your phone in an instant – proving once and for all that parents do indeed have superpowers. Security that keeps getting safer With regular automatic security updates, your files, videos, photos and data are always in the safest of hands. Software that keeps getting better Want to stay on top of who said what, when? With Android 11 you see, respond to and control your conversations across multiple messaging apps, all in the same spot. And with two years of free updates you'll always get the latest features. It’s like getting tomorrow’s phone, today.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e806c78-26ba-4b48-b9f4-a91b52a89da8.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b036edd9-356e-4031-b102-3eb50f052297.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34f98221-d2b2-49f8-84b3-d4a974bcffcf.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Nokia XR20 Nokia G50 Nokia T20 Nokia G20 Nokia G10 Nokia 6300 4G Software Android 11 Android 11 Android 11 Android 11 Android 11 KaiOS Screen 6.67\" FHD+ with Gorilla Glass Victus 6.82\" HD+ 10.4\" 2K 6.52\" HD+ 6.52\" HD+ 2.4\" QVGA RAM / Storage 6 GB / 128 GB 4 GB / 128 GB 4 GB / 64 GB 4 GB / 128 GB 3 GB / 32 GB 512 MB / 4 GB MicroSD Expansion Up to 512 GB Up to 512 GB Up to 512 GB Up to 512 GB Up to 512 GB Up to 256 GB Processor Qualcomm Snapdragon 480 5G Qualcomm Snapdragon 480 5G Unisoc T610 Mediatek Helio G35 Mediatek Helio G25 Qualcommm Snapdragon 210 Camera Dual camera: 48 MP wide angle + 13 MP ultra-wide; front-facing camera: 8 MP Triple camera: 48 MP + 2 MP depth sensor + 5 MP ultra-wide; front-facing camera: 8 MP Main: 8 MP; front-facing camera: 5 MP Quad camera: 48 MP + 5 MP ultra-wide+2 MP macro + 2 MP depth; front-facing camera: 8 MP Triple camera: 13 MP + 2 MP macro + 2 MP depth; front-facing camera: 8 MP Rear Camera: 0.3 MP Battery (mAh) 4630 5000 8200 5050 5050 1500",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d10e7671-9fcb-4301-8bcc-f876c386091b.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6ceb71b-e9d9-4996-bdde-360e7ca96844.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ae5a78cb-ce51-4423-aad8-9256f836a578.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c33df1c6-30d0-4e77-abb9-7361387fee13.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/827e3674-7118-49a0-ac07-2bc9a27de898.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e806c78-26ba-4b48-b9f4-a91b52a89da8.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b036edd9-356e-4031-b102-3eb50f052297.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34f98221-d2b2-49f8-84b3-d4a974bcffcf.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a5dcc425-0636-4528-924b-52ef77d6442d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8c272242-93d5-4293-9759-5b3293b459f9.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/705dc13d-192c-4ae7-a9d0-29dd9f5e5fd2.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/20cc6398-6fbf-4cbc-96c3-d79e126cc701.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d6e1d2d-912d-43f6-8ad1-2cb804af520c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/79b0a51b-40c4-4c6c-94ee-d0c0531d7d77.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "review1101",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIZ3VRTSP34ADSJMRA52ZQDMO5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CK2M0A8JW9OH?ASIN=B093QPTSK7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars I bought this phone because it is product of Finland, not manufactured in some Asian sweat shop....",
                "reviewText": "Ya, this is a high quality phone. The one issue is that it starts up a little slower than my old Samsung. But, I am glad I made this purchase. It is well worth the price for an Android phone. More importantly, I am pleased that it comes from a European country instead of China or India. Samsung has always been my go-to cell phone, but not anymore!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Pelsang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4HNNFDETAFTG5H2E2IIJFLTA5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI5WLAN10TJUX?ASIN=B093QPTSK7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars It works well",
                "reviewText": "It works well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kat Irhi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHC274L4AOOELTPL2OH44GQ3DRTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FRXO247PVGIP?ASIN=B093QPTSK7",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "1.0 out of 5 stars 3gb of ram is NOT enough",
                "reviewText": "I bought this for my teenager as her first smart phone. We didn't want to spend a lot of money as this was a trial run to see if she was mature enough to handle the responsibilities of owning one.Despite going through extreme effort in removing all of the bloat and unnecessary apps, this phone is still so unbelievably sluggish. Rebooting it takes a minimum of 5 minutes. Opening the camera app takes a minimum of 2 minutes and while looking through the phone screen, it's so choppy. Like less than 1 frame per second, so it's impossible to actually take a photo. And half of the time, taking a photo locks up the phone and the photo comes out blurry anyway.It takes 30+ seconds to open the messaging app. It's just ridiculous.Only thing it has going for it is the battery life. If that's all you care about, and you don't use apps or anything, just want to talk/maybe text, then I guess this phone would be of decent value to you. But for anything more than that, there are better options out there.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ruth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPHAZ7KHONLTXXMPHO4PNRSNZOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LQQK7I7MPZKW?ASIN=B093QPTSK7",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 14, 2022",
                "reviewTitle": "3.0 out of 5 stars Don't waste your money.",
                "reviewText": "This is the worst phone I've ever bought. It is so slow, you have to wait, sometimes up to 5 mins for it to \" wake up\" if your in a hurry to make a call, or check email this phone won't work.It freezes all the time. If your one one thing, won't be long till it will pop in with something you looked at earlier.I've had people try to call and the phone won't ring, won't do anything.Please don't waste your money, maybe spend a little more to get something that will work.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLAJFJ4FNNN5W67VPO335SN6XFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F4UTV6NQ8K0X?ASIN=B093QPTSK7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Minimal apps, extreme battery, full compat, fast enough, etc.",
                "reviewText": "1)Battery easily lasts 3-4 days with zero charge doing basic phone, a bit of web, sms, email/pager duties, app updates, etc. Ergo, typical use realistic 3-5 days. Playing games and watching 10 hours of movies on your phone is not \"realistic\". Even under heavily load easily 24-36 hours.2)Minimal installation if you are aggressive during setup. Google apps/nokia really try to \"subversively\" get you to install \"junk\" but you can skip it all. This deserves a negative that you have to at all but otherwise the fact you \"easily\" can is a bonus vs many phones. Kudos. Probably why battery life is so good.3)Works. I mean this thing just works. Its compatible and everything works well. People think it will be incapable due to the price. Newp.4)Performance is good. Is it your 1000+ phone? No but its 70-90% of it. Who got a better value?5)For its size, resolution(which is quite good btw), weight, 3-4 days general use battery, etc. Wow.6)Clean interface that moves well. Typical android UI but unlike others not scattered and bloated with trash. Starts clean.7)Pershaps the most amazing. 100 USDish. Just wow. Nothing, I mean literally NOTHING comes close.PS. Not sure on the updates but mines on Android 12 and still updating daily/monthly on security updates.As much as I hate the bloat now days THIS is a phone worth its salt. The rest, fluff.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carl Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMUCQ26A6L7JOUR7WIWCYJ5HP5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26IAZIRUZ8CIO?ASIN=B093QPTSK7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 27, 2022",
                "reviewTitle": "5.0 out of 5 stars Really good and at exceptional price..",
                "reviewText": "second one of these we bought. first was for the lady of the house. had lots of Nokia phones (over the years) and these are the best yet and represent our move to Android.Dropped in our SIM and memory devices and mine worked fine. Bride was moving from a Windows Nokia so we had to buy new mem card and AT&T gave us the new SIM for her phone.Battery life is EXCELENT...seems to last a week (we do not live on the phones).Only issue is that one of the chargers (part that plugs into the wall-not the USB to type C cable) does not work..we get by by using the same charger for both...which is easy due to the long battery life..",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bizemama",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQ6WZ4HLFRZNGM6I7MIGZZ7YBXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YPVW19E8ER7F?ASIN=B093QPTSK7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Battery Life",
                "reviewText": "I had a phone just like this one before but it eventually just died. So I bought a different phone. Wrong move. The new phone had a battery life of about 3 hours. So I decided to go back to having another G10 phone. This phone does everything I want it to do and the battery lasts between 2 and 3 days.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nunya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVCFERUMBPAOAC7IA3MVUAOTLOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I16XR27U8YEK?ASIN=B093QPTSK7",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2022",
                "reviewTitle": "2.0 out of 5 stars You get what you pay for... Does not run Android! - Runs \"Android One\"",
                "reviewText": "I bought this as a burner phone, and chose it because it has a USB-C charging port. Compared to a 4 year old OnePlus, this Nokia g10 is slow, sluggish, laggy, kludgy. The screen protector collects so many fingerprints that it's difficult to see through. I would not want this as my primary phone.The most important thing to know, that isn't mentioned in the description (as far as I can tell) is that this phone runs Android One - a closed-source Google OS that is based on Android, but dumbed down. If you're expecting a mainline Android phone, this is not it. It's intended to bring new people to Android platform with inexpensive $100-$150 phones.Also note that this phone is compatible with normal GPS, and also China's BeiDou global positioning satellite network rather than Russia's GLONASS.While initiating the phone, you're prompted with about a million choices that you can opt out of the vendor collecting your personal data. Be very careful as most of these are presented as \"NEXT\" buttons, and the skip options aren't as obvious. Don't be tempted to click through all the options without reading first!Nice that it comes with a screen protector built in (though it's a finger print collector) and it comes with a very basic flexible clear plastic case to cover the back.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 22, 2022",
                "reviewTitle": "Buen celular",
                "reviewText": "Precio justo barato y funcional, funciona correctamente.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Osvaldo X.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 21, 2021",
                "reviewTitle": "No como crei",
                "reviewText": "El teléfono cumplio con mis espectativas, funciono bien, hasta el día 19 de agosto 2022, cuando comenzó a fallar, (prácticamente solo me aguanto 9 meses) jamás lo descuide ni golpes ni mojadas, solo comenzó a reiniciar y ya no enciende.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}