{
    "remaining_requests": 48904,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samsung-Galaxy-Note-Unlocked-Cellphone/dp/B00PHJI28G",
    "body": {
        "name": "Samsung Galaxy Note 4 N910A 32GB Unlocked GSM 4G LTE Smartphone Black",
        "price": "$64.99",
        "originalPrice": "",
        "rawPrice": 64.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Samsung-Galaxy-Note-Unlocked-Cellphone/dp/B00PHJI28G",
        "soldBy": {
            "sellerID": "A1RP27M2CQNSYF",
            "name": "Wireless Warehouse USA",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1RP27M2CQNSYF"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00R5CHWL6"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "BLACK",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51nLGZgFZOL._SS36_.jpg"
            },
            {
                "asin": "B00PHJI28G",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41-JAMMyNAL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 5 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-JAMMyNAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31CapHbvBGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4122Il65s L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31J7n E 2vL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31oOv3DH36L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/212x 613gTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BkBkvE4qL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SAMSUNG Store",
            "link": "https://www.amazon.com/stores/Samsung%C2%AE/page/F50AFABA-4CDE-4A95-84D0-CA4C61819FEB?ref_=ast_bln"
        },
        "brand": "Samsung®",
        "merchantInfo": "Wireless Warehouse USA",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 747,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$4.99 delivery February 15 - 16."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "2G: 850 / 900 / 1800 / 1900, 3G: B1 / B2 / B4, 4G: LTE B2 / B4 / B5 / B12 / B17",
            "5.7-inch Super AMOLED Capacitive Multi-Touchscreen w/ Protective Corning Gorilla Glass 3",
            "Android v4.4.4 (KitKat), Quad-core 2.7 GHz Processor, Chipset: Krait 450, Adreno 420 Graphics",
            "16 Megapixel Camera (3456 x 4608 pixels) w/ Optical Image Stabilization, Autofocus & LED Flash + Front-Facing 3.7 Megapixel Camera",
            "Internal Memory: 32GB, 3GB RAM + microSD Slot Expandable up to 64GB",
            "Unlocked cell phones are compatible with GSM carriers like AT&T and T-Mobile as well as with GSM SIM cards (e.g. H20, Straight Talk, and select prepaid carriers). Unlocked cell phones will not work with CDMA Carriers like Sprint, Verizon, Boost or Virgin."
        ],
        "description": "Experience the Best Entertainment Property - Our 5.7-inch Quad HD Super AMOLED display features more pixels per inch than any other display we've made. That means images are clearer, brighter and more captivating than ever before. And now you can capture video in the same high resolution as the display so your personal videos look better than ever before. Do more than ever before with the new, enhanced S Pen. The S Pen makes it easy to jot things down anytime with Action Memo and it's like a mouse for your phone, making it easy to highlight, cut, copy and paste whatever you want, on any screen. Also, when you don't feel like using the keyboard, you can handwrite your emails and text messages and have your words converted into text instantly. The Galaxy Note 4 has a wide-angle, 3.7MP front-facing camera so you can capture crisper selfies with all of your friends and more of your background. And when you want to photograph anything else, the Galaxy Note 4 comes equipped with a 16MP rear camera with built-in Optical Image Stabilization. So, even when you zoom in, the details in your photo remain in focus.",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Cell Phones",
                "link": "https://www.amazon.com/cell-phone-devices/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7072561011"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Carrier",
                "value": "Unlocked"
            },
            {
                "name": "Operating System",
                "value": "Android"
            },
            {
                "name": "Cellular Technology",
                "value": "4G"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Wireless network technology",
                "value": "GSM, LTE"
            },
            {
                "name": "Connector Type",
                "value": "USB Type C"
            },
            {
                "name": "Form Factor",
                "value": "Smartphone"
            },
            {
                "name": "Biometric Security Feature",
                "value": "Face Recognition"
            },
            {
                "name": "Human Interface Input",
                "value": "Touchscreen"
            },
            {
                "name": "Phone Talk Time",
                "value": "37 Hours"
            },
            {
                "name": "Shooting Modes",
                "value": "Automatic"
            },
            {
                "name": "Water Resistance Level",
                "value": "Not Water Resistant"
            },
            {
                "name": "Special Feature",
                "value": "dual-camera, smartphone, touchscreen, lte"
            },
            {
                "name": "Battery Life",
                "value": "5 Hours"
            },
            {
                "name": "Battery Description",
                "value": "2500 mAh"
            },
            {
                "name": "Battery Average Life (Talk Time)",
                "value": "20 Hours"
            },
            {
                "name": "Charging Time",
                "value": "1 Hours"
            },
            {
                "name": "Rear Camera Resolution",
                "value": "16 MP"
            },
            {
                "name": "Other camera features",
                "value": "16 MP"
            },
            {
                "name": "Optical Sensor Resolution",
                "value": "16 MP"
            },
            {
                "name": "Screen Size",
                "value": "5.7 Inches"
            },
            {
                "name": "Resolution",
                "value": "1440 x 2560 pixels"
            },
            {
                "name": "Display Type",
                "value": "AMOLED"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "32 GB"
            },
            {
                "name": "CPU Speed",
                "value": "2.7 GHz"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 747 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Brand",
                "value": "SAMSUNG"
            },
            {
                "name": "Model Name",
                "value": "Galaxy Note 4"
            },
            {
                "name": "Model Number",
                "value": "Galaxy Note 4"
            },
            {
                "name": "Included Components",
                "value": "USB Charging Cable, USB Charger"
            },
            {
                "name": "Manufacturer",
                "value": "Samsung"
            },
            {
                "name": "Item Weight",
                "value": "6.21 Ounces"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "6.04 x 0.33 x 3.09 inches"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Warranty Description",
                "value": "Year Samsung warranty"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "What is an unlocked phone? An unlocked phone is a device that is not bound to any carrier or plan. It allows you to choose your phone first and your carrier second. Upon selecting a plan, simply insert the carrier's SIM card into the phone and you're ready to go. If you decide you want to change carriers down the road or want to take an international trip, it's as simple as replacing your existing SIM card with a new SIM and activating your new plan. What are the benefits of an unlocked phone? Freedom: Choose the carrier with the best service or price. If you find a better deal later, you have the ability to change to a different carrier. Travel: Take your phone internationally and use the carrier of your choice. It's as easy as inserting an active SIM card. Selection: Choose the phone with the features you want, whether or not your carrier sells it, and get more service options without a contract. How do I set up my unlocked phone? The first thing you’ll need is a SIM card for your desired carrier. When activated, the SIM card will let your phone connect to your carrier’s network. If you decide to upgrade to a newer unlocked phone in the future, you can easily remove the SIM card from your old phone and put it in your new phone—just make sure you get the right size of SIM card (nano, micro, or standard) for your phone. If you want to use your phone while traveling internationally, you can easily buy a SIM card for a carrier that operates where you’re traveling. As long as it’s activated, you can just swap SIM cards when you arrive at your destination.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/d06f120e-c4cd-4b35-ae5a-0d33af48475b._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/676cf45b-e44e-40f4-ad58-5de5263161da._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/c0334c8c-f805-4633-9531-68714f01f7f9._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/d06f120e-c4cd-4b35-ae5a-0d33af48475b._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/676cf45b-e44e-40f4-ad58-5de5263161da._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/c0334c8c-f805-4633-9531-68714f01f7f9._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Linda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2AJXCKVWIWBPKXDMVSWHS5ICYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R5Z0M1HKQ9RE?ASIN=B00PHJI28G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2016",
                "reviewTitle": "5.0 out of 5 stars Wonderful and frustrating all at once.",
                "reviewText": "I love this phone. It is fast and powerful. The camera is great. The stylus is fantastic. The fingerprint reader is a big step up from a passcode, but still needs to be improved. The screen is gorgeous!Android versus iOSBottom line, geeks should choose Android. Fashion trendy people should choose Apple. Frugal minded people should choose Android. People who simply find it difficult to do more than the basics on a smart phone are probably better off with Apple if you don't mind paying more money. If you are not sure where you fit, read on. If you aren't sure if you like Android of iPhone, read this paragraph. Otherwise skip on down to the next paragraph. I like Android and iOS. I am also frustrated by both. I use both. I like begin able to add lots of storage on the cheap via micro SD, thanks to Samsung Android phones. I like being able to carry a spare battery, again thanks to Samsung. Android has so many more features! On the other hand, iPhone just works. iOS is very easy to use, mostly because it doesn't have the number of options available in Android. My wife uses iPhone, because she is not a geek and doesn't need more than the iPhone offers, with the exception of more storage space - come on Apple! Stop raking us over the coals for storage! For that, you really, really suck. But, I also love Apple. I don't have to rescue my wife from some disaster. Oh, and Apple, where is my swipe keyboard. Let's enter this decade, shall we? It is pretty easy to download spyware or other malware from the Google Play store. So, if you are not very careful about your apps and safety, Apple is still the safer choice.The StylusWhen you remove it from the phone (it stores inboard), a hanndy menu pops up. When you remove the pen and walk away, the phone chimes to reduce the chance that you'll lose the stylus. The stylus is pressure sensitive. It is extremely accurate compared to your finger. It is pretty accurate compared to other stylus devices. Samsung uses Wacom, the art industry standard for digitial stylus art. To be honest, the N-trig stylus on my Microsoft Surface Book blows Wacom out of the water! (I wish I could get an N-trig pen with barrel roll and angel detection for my Surface Book, but that is out of scope of this discussion). Yes, you can take a note even when the screen is locked. As an aside, I use the stylus with with OneNote all the time. OneNote syncs my notes and photos to the cloud (OneDrive) and my computer automatically. Samsung includes Adobe SketchBook Pro (not just the lite version), Which is surprisingly pleasant to use for sketches even on a 5.7 inch screen. I am an amateur artist. I work in both traditional and digital media. I was very surprised that I could produce reasonable art on my phone. No, it isn't my first choice, but it is reasonable. I have not yet tried Apple's Pencil, so I cannot compare the two.Fingerprint ReaderThe fingerprint reader is okay but a far cry from the reader on the iPhone. Here are my few complaints. I have to swipe instead of touch, which is a surprisingly big difference. Swiping works flawlessly only 25% of the time when I'm distracted. If you don't swipe your entire finger pad, forget it. The fingerprint scanner should have a nice concave seat for eyes free swiping. On my iPhone, a scan unlocks and opens the phone. On the Samsung Note, it unlocks but does not always open the phone. Here is what I mean. If the phone is locked, swiping unlocks the phone and takes me to the home screen (or whatever screen was last active). If the phone was unlocked but on the lock screen, swiping the reader does nothing. Instead, you have to swipe the touchscreen. I can't tell you how annoying this is. Don't make we switch between options to open the phone!!!!!!!ScreenThe 5.7\", Quad HD (2560x1440) AMOLED screen if gorgeous. In my opinion, it easily outshines the Apple 6 screen,which is 5.5\" with 1080p resolution. I can't see the pixels on either, which suggests Samsung went overboard on pixel density. But, Samsung's AMOLED screen provides a noticeably superior image. The colors are rich and full, almost liquidy.The CameraGreat photos and video! The camera offers 16 MP, so you can crop away and still have great images with lots of detail, even on your monster TV. Compare this to the Note 5 at 16 MP, the Note 3 at 13 MP and the iPhone 6 at 8 MP. Want 1080p (2.1 MP) video at 60 frames per second? No problem. Want full 4K (3840x2160 or 8.4 MP) video, you can do that too. The iPhone 6 supports up to 1080p. Regrettably, Samsung artificially limits 4K video recording to 5 minutes. It seems they are worried that users will quickly eat up their storage space. This isn't an issue if you add a 128 GB micro SD card like me, but Samsung doesn't seem to acknowledge that. Oh well. I guess I can settle for WQHD (2560x1440) resolution. The native Samsung camera software has lots of features and shooting modes, and you can download more modes free. Try the rear-camera selfie, wide angle selfie, burst shot, spherical panorama, virtual tour, fast motion, sequence shot, slow motion and more.Multi-windowYes, you can finally run two apps side-by-side. It is just awesome! Unfortunately, not all apps support this function. This is a super handy feature. Of course, now I'm spoiled, and I get mad at developers that don't support the feature. No, Apple does not offer this feature.Health and FitnessThere's a sensor on the back for checking pulse and O2 levels. You can also use the sensor as a virtual button in some apps. S-Health is Samsung's feature rich application. Yes, it is superior to Apple's offering.A tangent on megapixels (MP)The photos are truly gorgeous with an outrageous 16 MP. What does 16 MP really mean. A person with perfect vision can't see individual pixels of a 50 inch, 1080P (2.4 MP) display from 10 feet away. I person with perfect vision can't see individual pixels on a 144\" (12 ft.), 4k (8.4 MP) display from the same distance. Really, who needs more than 8 pixels? It will only make a difference when you start cropping and blowing up your photos. To learn more about pixel density on a big screen, see http://www.techradar.com/us/news/television/ultra-hd-everything-you-need-to-know-about-4k-tv-1048954.The Note 4 continues to support replaceable battery and micro SD cards via removable back. The Note 5 does not have a removable back, how annoying. This is a prime reason I chose the Note 4 over the Note 5.The phone has a bunch of other features like NFC, Wi-Fi Direct screen mirroring (to your TV), various Samsung applications, smart cover (optional), OTG, MHL3, GPS, Bluetooth 4.1, ANT+, 2.7GHz quad core, IR remote (use your phone as a remote control for your entertainment system), micro SD slot up to 128 GB, and S-Voice (an inferior alternative to Google Now).I can really play full 1080p movies from my phone to my big screen TV with no lag or chopping.The only thing I could think to add would be secure facial or retina recognition.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Plato loves Circles",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNYYMROXVZPK2KXNCDOFLMGDIBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CL44K000C81?ASIN=B00PHJI28G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2017",
                "reviewTitle": "4.0 out of 5 stars The new screens are hardly better. Fantastic",
                "reviewText": "PROs:The display is top quality. The new screens are hardly better. Fantastic.Also, the screen size is fantastic for watching movies/documentaries/lectures/etc. It's not too big and fits in my pocket fine. Wouldn't mind it being even bigger.The pen really is useful and i do use it for notes, drawing, taking screen caps and some other stuff. I wish their was more of a selection on the actual stylus, though. I don't like that the tip of the pen pushes into itself about 3 mm when pressed against the screen.CONs:Can heat up if too many apps are installed. (I figured out that this issue can be stopped if WIFI and moble data are turned off when it's not used. This is a tip I wish i new when i got the device, and I wish Samsung had put better software to handle this issue earlier).Their GUI sucks. I can't even search for apps without going into settings. A stupid mistake with a terribly easy and obvious solution.justCamera sucks. It just does. iPhone and the new samsung one's are better.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Predatorhousepet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPDA4KPWXDQL6BDBTK7HYZIOWCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RTNLZA757OL3?ASIN=B00PHJI28G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2016",
                "reviewTitle": "5.0 out of 5 stars Best phone I've ever owned",
                "reviewText": "I went from an LG G3 to a G4 then to the Note 4. I liked both LG phones but I cracked the screen on the G3 so I bought a G4 and it died after only owning it 1 week due to the bootloop defect common in that model. I returned it and bought the Note 4 for about the same price. The Note 4 has a comparable camera to the G4 (minus the laser focus) but has a lot more features like moveable multi windows, fingerprint & heart rate scanners and of course the S pen stylus. It is on the large side and not so easy to use one handed (especially if you have a case on it) but its still very manageable as a phone. To use it one handed you have to rest it entirely on your fingers to be able to reach all the parts of the screen with your thumb. Having a large screen is an advantage in many ways, its easier to see details and play games. Its also good if you take notes with the S pen, it gives you more space so you don't have to write so small. I only use the S pen occasionally but I really like having the option if I need it. I do miss the tap to wake feature that the LG phones had but the Note 4 can be woken by hovering your hand over the screen which is kinda cool too. The battery on the Note 4 is bigger at 3220 mAh as compared to 3000 mAh on the G4 and it does last longer. I can go all day using my phone fairly regularly without having to recharge. But, if I'm using my phone heavily for several hours I really appreciate being able to fast charge as I don't always have much time in one place before having to go elsewhere. Since the USB charging outlet on Samsung phones is prone to becoming loose to the point of not working I installed a N4 SlimPWRcard wireless receiver card and bought a Qi 3 Coil Wireless Charger + a Sony Wireless Power Bank to extend its life.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "YGTBSM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG27XIJ4XMPU7NIRHCIEIXPDM35A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AXWS6PA5I1VY?ASIN=B00PHJI28G",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2018",
                "reviewTitle": "1.0 out of 5 stars Extremely Upset After On 60-days!",
                "reviewText": "60 days after purchase, this item performed an AT&T automatic update. Working like clock work until this update (TODAY!!!). Now it no longer charges and is in a constant reboot. No, it's not the charger, it's not the battery and doing a factory reset did not change the characteristics of the malfunction. Of course it's after their 30-day return policy so I'm stuck holding the bag on a piece of garbage that's nearly useless. This was a replacement for a Note 4 bought nearly 4 years ago that all of a sudden just went dead. I really liked the performance of my original Note 4 and my wife did too. However we had to replace her's a year ago and I thought it was just a fluke, but now I'm convinced a systemic issue and perhaps planned obsolescence on the part of AT&T or Samsung. Since my issues started with an AT&T push (update) I put the primary blame on them. So, beware when purchasing expensive technology from this vendor....their 30-day return policy is a sham if the item fails shortly after that! Oh, and no option for any warranty.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "usd DB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 30, 2018",
                "reviewTitle": "still working great no issues",
                "reviewText": "Ordered and received months ago, still working great no issues.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danette",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 29, 2018",
                "reviewTitle": "but seems to work fine so far",
                "reviewText": "Would have been 5-star but I didn’t receive the stylus pen with it, but seems to work fine so far.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2020",
                "reviewTitle": "Déçu de l'achat",
                "reviewText": "Pas chanceux j'ai reçu un cellulaire d'occasion il a quelques défaut sur les côté et je crois qu'il a des action qui était toujours fonctionnel. J'avait un modèle pareil avant que je échappe j'ai commandé un pareil mais il ne fonctionne pas assisté bien . Un peu déçu je ne recommanderai pas à personne.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 15, 2018",
                "reviewTitle": "If the product works well and worthy of buying",
                "reviewText": "Battery does not hold charge and drains fast even with just surfing the web, camera does not work and is blurred either phot capturing or video. Total crap!, waste of money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}