{
    "remaining_requests": 3960,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/JC-Toys-18541-Newborn-Boutique/dp/B002S4QLBI",
    "body": {
        "name": "JC Toys 18541 La Newborn Boutique 14 Inch Doll, 9 Piece Set, Real Girl in Pink",
        "price": "$35.99$22.12",
        "originalPrice": "$49.99",
        "rawPrice": 35.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/JC-Toys-18541-Newborn-Boutique/dp/B002S4QLBI",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09SNR4C91"
        ],
        "asinVariationValues": [
            {
                "asin": "B002S4Y4XA",
                "variationName": "Color",
                "variationValue": "Real Boy in Blue",
                "price": "$35.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41cMY3guGIL._SS36_.jpg"
            },
            {
                "asin": "B002S4QLBI",
                "variationName": "Color",
                "variationValue": "Real Girl in Pink",
                "price": "$35.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41aFedxAt9L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41qmvvXFHqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31TqXAU4f5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wRDtT-nfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31etqtRy5mL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/610wtGDQ7mL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DaoabJduL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81Vs3ig6tPL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/94bc62cf-c47b-4584-a0fa-f3c0c8040629/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the JC Toys Store",
            "link": "https://www.amazon.com/stores/JCToys/page/0EDFCE80-127B-4795-808E-50149D7084ED?ref_=ast_bln"
        },
        "brand": "JCToys",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2767,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22",
            "Or fastest delivery Wednesday, February 21. Order within 21 hrs",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 21 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "vinyl",
            "Made in USA or Imported",
            "The La Newborn Boutique is a realistically looking ANATOMICALLY CORRECT REAL GIRL newborn doll that perfectly captures bringing a baby home from the nursery. The doll has a soft and adorable face with bright happy eyes and irresistibly cute crinkly toes.",
            "MADE IN SPAIN She’s completely made from non-scented and washable vinyl, which means the doll is soft and smooth to touch, yet durable for years. The doll is water-friendly too, so children ages 2 or older can safely play with her in the bathtub.",
            "The La Newborn Boutique baby doll comes with an 9-piece GIFT SET for dress-up fun. This includes: 1 short-sleeve baby shirt, 1 diaper cover, 1 pair of booties, 1 hat, 1 cloth diaper, 1 Soft Blanket, Belly Button Gauze, 1 hospital bracelet and Birth Certificate.",
            "The doll’s jointed at the shoulders, hips, and neck, so you can rotate the legs and arms when adding and removing doll’s clothing, and turn her head side to side during play. She’s 14” long and weighs about 1lb. 5 ounces.",
            "Intricately detailed, thanks to the award-winning creativity of the Designed by Berenguer design team. Hover over the pictures yourself to see life-like dimples, folds, and wrinkles. Made by JC Toys, the world’s leading doll manufacturer since the early 80s. For the past 30+ years, JC Toys has built a proven reputation for quality products and 100s of baby dolls available in stores nationwide. All JC Toys products are safety tested and approved for children 2+."
        ],
        "description": "Looking for the perfect baby doll for a child age 2 or older?Know someone who would absolutely love a realistic newborn doll gift set?Wouldn’t it feel great to enhance the oh-so-cute playtime experience with a 9 piece gift set for pretend fun?If you answered, “Yes!” to any of these questions, then you will absolutely cherish the La Newborn Boutique doll gift set by JC Toys!The La Newborn collection of baby dolls were hand-designed in Spain by the Designed by Berenguer team, an award-winning group of the world’s best doll designers. Every La Newborn was originally hand-sculpted by a doll design specialist, so the quality level is beyond anything you’ve ever seen.Dolls from the La Newborn collection represent precious moments in a newborn’s life, like the first tired yawn or tear drop. This La Newborn baby doll, the Nursery, flawlessly imitates that once-in-a-lifetime leaving the hospital experience thanks to her intricately detailed dimples, folds, life-like wrinkles, and realistic accesories. People all over the world love our dolls for all kinds of reasons. Baby dolls encourage social interaction as well as fine-motor development in children. Dolls also help you introduce an upcoming new baby in the family to a young child. Children especially love baby dolls because of the infinite amount of playtime possibilities. The Nursery La Newborn is manufactured directly by our company, JC Toys, a world leader in doll manufacturing. JC Toys is a family run and operated business with origins dating back to 1982 in south-east Spain - one of the top major toy-making and design centers in the world. Today, you can find 100s dolls, playtime accessories, and more by JC Toys in stores like Toys R Us and Wal-Mart.Add smiles to a young child’s face today by adding this La Newborn Boutique Doll to your cart now, so it can be ready for checkout and shipment asap - thank you!",
        "breadCrumbs": [
            {
                "name": "Toys & Games",
                "link": "https://www.amazon.com/toys/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165793011"
            },
            {
                "name": "Dolls & Accessories",
                "link": "https://www.amazon.com/kids-toys-dolls-accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166118011"
            },
            {
                "name": "Dolls",
                "link": "https://www.amazon.com/Dolls/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3245219011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "14 x 1 x 1 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.01 ounces"
            },
            {
                "name": "Country of Origin",
                "value": "Spain"
            },
            {
                "name": "ASIN",
                "value": "B002S4QLBI"
            },
            {
                "name": "Item model number",
                "value": "18541"
            },
            {
                "name": "Manufacturer recommended age",
                "value": "24 months - 10 years"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#131,714 in Toys & Games (See Top 100 in Toys & Games) #2,652 in Dolls"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,767 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Release date",
                "value": "June 24, 2020"
            },
            {
                "name": "Language",
                "value": "Spanish, English, French"
            },
            {
                "name": "Manufacturer",
                "value": "JC Toys Group, Inc."
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "JC Toys 18541 La Newborn Boutique 14 Inch Doll, 9 Piece Set, Real Girl in Pink JC Toys is the source for lifelike baby doll girls and accessories, and you’re going to love the incredible value that we offer for this newborn baby doll set! You will receive a lifelike baby doll girl and a number of coordinating accessories. If your child loves baby dolls, he or she is going to adore this set! This baby doll gift set includes an all-vinyl, 14-inch baby girl doll with a cute expression and moveable arms, legs and head. She is anatomically correct and made totally out of vinyl for easy cleaning and care. This sweet little girl is attired in a cute romper, matching hat and matching booties, and she has a hospital bracelet too. This set also includes a matching blanket, so your child can swaddle her to keep her cozy and safe.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/ee2dca34-fab7-491a-b779-f207945d0b98.__CR0,0,1222,1222_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/ee2dca34-fab7-491a-b779-f207945d0b98.__CR0,0,1222,1222_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "txsunshine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFJP6ZERZUXFJGN4VAVSNHLPCGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15SEJZSDPZPIU?ASIN=B002S4QLBI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Highly recommend seller and the doll is beautiful.",
                "reviewText": "I like the quality of how the doll is made. It will be a Christmas gift.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jane J.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWDA4CQWORSUUN34KU735WME74A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TA8A1I7GNWL0?ASIN=B002S4QLBI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Comparison between doll size options and accessories",
                "reviewText": "The media could not be loaded. Anatomically correct, boy doll is uncircumcised with scrotum and girl has indented slit. Great for teaching children the difference. This video compares the 9.5” and 14” versions including accessories. Easy movement of joints, waterproof for bath play, realistic and artistic construction. Recommended ages 4 and under for 9.5” option and ages 5+ for 14” option doll. Would highly recommend.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d24b5c09-9a3e-4dae-ab9d-951a721031a3/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Lexi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKA6MLBFWLIOPE3JE2FFPTIPEVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39QZ2OA4J449N?ASIN=B002S4QLBI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 25, 2022",
                "reviewTitle": "5.0 out of 5 stars Just How I Remember",
                "reviewText": "For my 10th birthday, my parents gave me some money, took me to Walmart, and let me pick some toys. This was one of two, and together they were my Favorite. Babies. Ever. Well, about 2 years afterward, it came up missing (I still have the orher one.) It was nowhere. The rooms have been cleaned out multiple times, and my parents knew how much I loved it, nevertheless, it was gone. I thought about this baby doll for years since. Now I'm 18, and at 1am I did some digging and found the doll on Google, and after cross examination with Amazon, found it. The clothes were lighter than before, now being a pale pink whereas before they were hot pink, and the top on the old one was an actual top, where this one was a tie. However, the doll looks exactly the same, feels the same, same size, whole thing. Thank you for still having this doll",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Johnson Family Johnson Family ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE35E25HDHLUKGTKK7TAES3TZAEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJS44VCTSHIQQ?ASIN=B002S4QLBI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2023",
                "reviewTitle": "5.0 out of 5 stars SO Realistic And CHEAP!! 😍",
                "reviewText": "I have always wanted a reborn baby, and most of them are so expensive, and hard to find. This reborn baby was super cheap for my budget and so BEAUTIFUL! It’s hand painted- and has realistic details! I bought the boy, and I’m obsessed! 💕 It is atomically correct with not the squishiest body. It is vinyl but not very squishy. The limbs can move up and down, he is in a curled position. 😇 He/She comes with a pacifier, baby blanket, outfit, bottle and certificate of adoption. 100% giftable, and value for money! 💗",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61fmRvmPxwL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71MCOveJmBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71QgGONRnOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71yT7gNOBeL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "tim colson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWLDECKEMGA6WWH3F22DLLI3KIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIT28AURPGKL4?ASIN=B002S4QLBI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2015",
                "reviewTitle": "4.0 out of 5 stars It looks like a boy's thing",
                "reviewText": "My Grandaughter loves her. I think she is cute, precious. I would give it a 5 star, except, I was aware she a was anatomically doll, but was totally shocked when we saw the belly button. It looks like a boy's thing. My Grandaughter asked why it looked that way. Her parents were not sure if they would let her keep it, because of this. She is seven. We explained to her that sometimes newborns belly buttons can look like this, she has to keep the white strip over it. So please in the future, consider one that doesn't look like this. This is the second doll I bought for her, the first one was a mini, just adorable. We are greatly satisfied with her, even the girl part, but not the belly button. I am planning on buying more jc dolls, as they are the best I found that look real, and your company is very helpful, friendly.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fall Deere",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNUXGZFCC4OLGPQ7ZWOO42WVNBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKG7290B11XML?ASIN=B002S4QLBI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 7, 2016",
                "reviewTitle": "5.0 out of 5 stars Very cute, very detailed, very perfect.",
                "reviewText": "Normally I wait a few days before reviewing a doll so I've had time to live with it and get a real opinion, but I can't imagine my opinion changing. I adore this doll. It is extremely detailed and has an adorable expression that can melt hearts. It is made of fairly solid vinyl, so it isn't what I would call cuddly, but since that isn't why I got it, I'm fine with that.Preemie sized baby clothes fits it fairly well, though those clothes are a bit on the long side. It won't fit perfectly, but the preemie sized stuff I have for my other dolls fits it well enough.I'm not a fan of the clothes it comes in. They doesn't seem to fit the doll very well and just isn't to my liking, but since I prefer to change my doll's clothes (I collect various types of semi-realistic dolls), that doesn't bother me and isn't worth knocking a star off since the doll itself is everything I expected and wanted.It definitely looks better in real life than in the provided pictures here on Amazon. I may be able to add pictures in a few days, once I get them off my camera.This doll is a very good addition to my collection and I think anyone who wants a small (14 inch) full bodied doll would be very pleased with this one. I certainly couldn't be more pleased with my purchase.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karina ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5X5N6C35BIXJ72KLRYJWCKYN3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HSI75KOXE1ZN?ASIN=B002S4QLBI",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "3.0 out of 5 stars Bebe",
                "reviewText": "En la foto se ve grande ideal para una niña de 2 a 3 años realmente la compré con otro objetivo pero aún así lo utileze",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "doll lady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESBBCIJRR45LPFJEESFZFTKVOIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSYK4HPZMUTTQ?ASIN=B002S4QLBI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Well-made baby doll",
                "reviewText": "I like the sturdiness and details of this baby doll. A little girl would enjoy washing the baby with a small real baby washcloth, but not submerging her in water, although it probably would be okay.I bought her along with the little boy that looks like her because I’m a 74 yr. old doll collector in my 2nd childhood! 😉The preemies are so cute!! ❤️❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 4, 2023",
                "reviewTitle": "Excelente",
                "reviewText": "Hermosa realmente increíble",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susana []",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 14, 2024",
                "reviewTitle": "Buena calidad-precio",
                "reviewText": "Muñeco realista pero sin pasarse, los que lo son demasiado me dan grima y este está bien. Además el precio es muy asequible comparado con otras marcas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sabrinasabrina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 28, 2023",
                "reviewTitle": "Belle imitation",
                "reviewText": "Beau bébé, bien imité, je ne m attendais à ce qu il soit aussi rigide. Mais ma fille de 3 ans est vraiment contente.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/616Pha4BA4L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61mLV-BxWHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61tYYJkrRkL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/611zFE5eIgL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samuelamauro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 26, 2023",
                "reviewTitle": "Molto bello",
                "reviewText": "Molto bello",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lina l.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on December 5, 2023",
                "reviewTitle": "En Fantastiskt babies",
                "reviewText": "Jag köpte den for min brorsdotter o hon var mycket glad. Det verkar som en riktig babies.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}