{
    "remaining_requests": 6730,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Elmers-Disappearing-Purple-School-Washable/dp/B003ULCZ7M",
    "body": {
        "name": "ELMER'S Disappearing Purple School Glue Sticks, Washable, 6 Grams, 12 Count",
        "price": "$5.94$5.94 ($2.36$2.36 / Ounce) $5.64$5.64 ($2.24$2.24 / Ounce)",
        "originalPrice": "$12.59",
        "rawPrice": 5.94,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Elmers-Disappearing-Purple-School-Washable/dp/B003ULCZ7M",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CCQ9LNZ9"
        ],
        "asinVariationValues": [
            {
                "asin": "B00143UIC2",
                "variationName": "Size",
                "variationValue": "6 Count",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B01JZYM6GC",
                "variationName": "Size",
                "variationValue": "7 Count",
                "price": "$9.99",
                "variationImageURL": ""
            },
            {
                "asin": "B003ULCZ7M",
                "variationName": "Size",
                "variationValue": "12 Count",
                "price": "$5.94",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "90",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/511sf251VaL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51A8cER1N-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517s5xeDzWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ctt0PC8kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31r2GTv5WbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31sJZtybZ4L.jpg",
            "https://m.media-amazon.com/images/I/5173QWkIs1L._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/417ad7ef-1470-4f0f-a4b4-aa53c5a5b297/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9a857177-02cd-43c2-b25e-84652c0e2aaf/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/71771a4a-11f5-4257-aa25-15fb0fc263b6/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/44794e98-565e-4d57-9e1e-86537bb3ed4e/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/91653c4c-1d43-4ca5-9084-1e95e9df7dff/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ac0d30bc-6e2a-4052-a797-10ea7855dd95/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Elmer's Store",
            "link": "https://www.amazon.com/stores/Elmers/page/43D453CD-06AC-45B2-A45A-E2FC60DB8318?ref_=ast_bln"
        },
        "brand": "Elmers",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 32381,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35. Order within 2 hrs 14 mins",
            "Or fastest delivery Tuesday, February 20",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35. Order within 2 hrs 14 mins",
            "Or fastest delivery Tuesday, February 20",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Bonds to paper, cardboard, foam board, display board, and more",
            "Goes on purple and dries clear",
            "Washable, non-toxic, acid-free, and photo safe",
            "Applies smoothly without clumps",
            "Perfect for arts, crafts, and school projects",
            "Colored pencil compatible",
            "10 Year Limited Warranty"
        ],
        "description": "Product Description Assemble school projects, crafts, decorations, and more with the non-toxic adhesive of Elmer's Disappearing Purple School Glue. Specially formulated to be easy to use and clean up, Elmer's Disappearing Purple School Glue is purple when first applied so it's easy to see, then it dries clear for great results. Elmer's Disappearing Purple School Glue is washable, photo safe, and non-toxic for fun and easy crafting. From the Manufacturer For more than sixty years, Elmer's Products, Inc., has been providing creative adhesive solutions that support project success and turn ideas into reality. By continuing to develop innovative new products, Elmer's has become the trusted brand when it comes to fueling creativity and providing outstanding product performance in the classroom, at home, in the workshop and at the craft table. Elmer's products inspire people to create, build and learn for life. Elmer's School Glue is easy to use and stays where you put it. View larger Elmer's Disappearing Purple School Glue Sticks go on smoothly and are great for kids. View larger Which Elmer's Adhesive Products Is Best for Your Needs?Elmer's answers the most important question of all: \"which glue should I use?\" Whether you are a teacher, a student, a crafter, a business owner or a homeowner, Elmer's the \"Glue Experts\" for over 60 years, offers the solutions to all your glue and adhesive needs. The trusted brand for fueling creativity and product performance. View larger Elmer's Washable, No-Run School Glue--Elmer's Washable, No-Run School Glue is easy to use and stays where you put it. It is safe, non-toxic, and washable, so accidental messes mean easy clean-up. Bonds most porous materials such as paper and cloth, and semi-porous materials such as wood and pottery.Elmer's Disappearing Purple School Glue Sticks--Elmer's Disappearing Purple School Glue Sticks go on smoothly and are great for kids. The Disappearing Purple formula goes on purple, so it is easy to see and dries clear. It is safe, non-toxic, and is a must-have for all students.Elmer's Glue-All--America's all-purpose glue is now better than ever. Perfect for school projects, crafts and home repair. Works on a variety of materials, i.e. paper, wood, fabric, leather, ceramics and more. Elmer's Glue-All is a must-have for the kitchen, home office, workshop and garage. Bonds strong for all your needs.Elmer's Washable Repositionable School Glue Sticks--Elmer's Repositionable School Glue Stick goes on smooth and dries fast, clear, and colorless. The formula allows you to stick and re-stick so it's perfect for school projects, decorations, and much more.Elmer's All-Purpose Glue Sticks--Elmer's All Purpose Glue Stick is a favorite for easy, no-mess bonding. The All Purpose formula bonds clear and strong and works on a variety of paper types, including cardboard, foam board, display board, computer paper, and more. Elmer's All Purpose Glue Stick goes on smooth and dries fast, clear and colorless. It is acid-free, washable, safe and non-toxic.Elmer's Carpenter's Wood Glue--Elmer's Carpenter's Wood Glue has been in American homes for generations. Contractors and homeowners alike use Carpenter's Wood Glue because it sets fast and bonds strong, even stronger than wood. Carpenter's Wood Glue is sandable and paintable, so you'll have the perfect finish every time. Easy to clean up with water. Elmer's for the Classroom A favorite of teachers everywhere Elmer's All-Purpose Washable School Glue Sticks--Elmer's classroom packs are ideal for teachers everywhere. Make sure all your projects meet the standards you demand. Elmer's All Purpose Washable School Glue Stick goes on smoothly, is safe, washable, and non-toxic, making all your lesson plans easier and more fun.Elmer's School Glue--Elmer's School Glue is a trusted favorite of classroom teachers everywhere. Going back to school just wouldn't be the same without it. Elmer's School Glue is safe, non-toxic, and washable, so accidental messes mean easy clean-up. Elmer's convenient Gallon size emphasizes reducing waste while keeping your students prepared for any project.Elmer's Disappearing Purple School Glue Sticks--The Elmer's Disappearing Purple School Glue Stick, available in a classroom-ready pack of 30, goes on smoothly and is great for kids. The Disappearing Purple formula goes on purple, so it is easy to see and dries clear. It is safe, non-toxic, and a must have for all students.Find the Right Glue for YouUse this guide as you create, build and learn with Elmer's. As an industry leader Elmer's has been providing creative adhesive solutions that support project success and turn ideas into reality. By continuing to develop innovative new products, Elmer's has become the trusted brand when it comes to fueling creativity and providing outstanding product performance in the classroom, at home, in the workshop, and at the craft table. Elmer's products inspire people to create, build and learn for life. Set Contains: 12 Washable Elmer's Disappearing Purple School Glue Sticks, 0.21-ounce sticks See more",
        "breadCrumbs": [
            {
                "name": "Arts, Crafts & Sewing",
                "link": "https://www.amazon.com/Arts-Crafts-Sewing/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2617941011"
            },
            {
                "name": "Crafting",
                "link": "https://www.amazon.com/crafting/b/ref=dp_bc_aui_C_2?ie=UTF8&node=378733011"
            },
            {
                "name": "Craft Supplies",
                "link": "https://www.amazon.com/craft-supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=8090710011"
            },
            {
                "name": "Adhesives",
                "link": "https://www.amazon.com/adhesives/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12890721"
            },
            {
                "name": "Art Glues & Pastes",
                "link": "https://www.amazon.com/Art-Glues-Pastes/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12890741"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.55 x 4.35 x 8.3 inches; 0.01 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ E1559"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ July 2, 2010"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Elmers"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B003ULCZ7M"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#66 in Arts, Crafts & Sewing (See Top 100 in Arts, Crafts & Sewing) #3 in Glue Sticks #5 in Art Glues & Pastes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 32,381 ratings"
            },
            {
                "name": "Brand",
                "value": "Elmer's"
            },
            {
                "name": "Specific Uses For Product",
                "value": "School, Craft"
            },
            {
                "name": "Material",
                "value": "Natural"
            },
            {
                "name": "Compatible Material",
                "value": "Wood, Cardboard, Paper, Leather, Ceramic, Fabric"
            },
            {
                "name": "Item Form",
                "value": "Sticks"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "At a Glance: Bonds to paper, foam board, cardboard, and more Goes on purple and dries clear Washes easily off hands and out of clothes Non-toxic and acid-free Great for arts, crafts, and school projects Elmer's Disappearing Purple School Glue Stick (12 x 6g) Elmer's Disappearing Purple School Glue Sticks are a fun way to attach items to paper, display board, cardboard, foam board, photos, and much more. The glue is purple when first applied, so it's easy to see, then it dries clear. For convenience, this glue is also specially formulated to be washable, non-toxic, and acid-free. Get smooth, clump-free results at home, school, or on the go with Elmer's Disappearing Purple School Glue Sticks. What's in the Box: 12 Washable Elmer's Disappearing Purple School Glue Sticks, 0.21-ounce sticks",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/acbb1393-0aa4-4e7f-84a1-fb2d2651632d._SR285,285_.png",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/4ddfcaf0-8363-49fa-8e47-ba53e587a308._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "Disappearing Purple Makes Application Easy Use Elmer's Disappearing Purple School Glue Sticks for precise application. Great for kids, the glue is purple when first applied so it's easy to see, then it dries clear for easy bonding and great results.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/98635c70-4bf6-4272-a10e-2053ffae7d97._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "The Glue with the Orange Cap Fast Drying Formula for Rapid Results Glue on items quickly with Elmer's Disappearing Purple School Glue Sticks. Designed to go on evenly, the glue dries rapidly for hassle-free bonding. Save time and reduce mess with Elmer's Disappearing Purple School Glue Sticks. *The Glue with the Orange Cap Washable for Easy Cleanup Created with parents and teachers in mind, Elmer's Disappearing Purple School Glue Sticks are safe, non-toxic, and washable. Elmer's Disappearing Purple School Glue Sticks clean easily off of hands and out of clothes for fun, no-mess gluing. Create, Build and Learn with Elmer's For more than 65 years, Elmer's products have been the perfect choice for inspiration and convenience. With a full range of art, craft, repair, school, and office products for both children and adults, Elmer's keeps you prepared for almost any project.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/0c51c7b0-6b0e-4723-8a92-756e05b9c45a._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/140e43c4-4e7e-4a45-ae85-e3fd690d61d0._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/2c40fe5e-8a0a-4e66-83aa-a17af59775f6._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/acbb1393-0aa4-4e7f-84a1-fb2d2651632d._SR285,285_.png",
            "https://m.media-amazon.com/images/S/aplus-media/mg/4ddfcaf0-8363-49fa-8e47-ba53e587a308._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/ca76e25c-83df-47a7-9827-d5b8c5df6325._SR970,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/mg/98635c70-4bf6-4272-a10e-2053ffae7d97._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/0c51c7b0-6b0e-4723-8a92-756e05b9c45a._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/140e43c4-4e7e-4a45-ae85-e3fd690d61d0._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/2c40fe5e-8a0a-4e66-83aa-a17af59775f6._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Garrett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7VTMIXWDYO46JAPKYJGFCQZVRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DLIHA35V273I?ASIN=B003ULCZ7M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Your Typical Glue, but With a Purple Twist",
                "reviewText": "I purchased these as part of my daughter's school supply list. It was a great price for a pack of 12. And Elmer's has been the biggest name in the glue market, even when I was I young lad. No reason it is the number 1 teacher's brand.This glue is easy to use, especially compared to glue in a bottle. It goes on easy you just have to be willing to accept that if you want to cover the edges of whatever you are gluing then you will more than likely go over whatever is under it with the glue stick. I still find that it goes on smooth and is pretty clean, and easy to control. It goes on purple so that you can see exactly where you are putting it and it dries clear. It is not the best adhering glue, but it is good enough for school work and crafts. Sometimes that has even worked in my favor, where I was able to reposition what I was gluing, after I had placed it.This was a bargin for some high quality glue sticks. I am sure that I will be purchasing more next school year.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sergej M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF337A4LOE6XZ4R2ZEIN3HCQQ6YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z19ZSY2UEHXP?ASIN=B003ULCZ7M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Good",
                "reviewText": "The ELMER'S Disappearing Purple School Glue Sticks have been an absolute game-changer in our household. These glue sticks, coming in a pack of 12, are not just your ordinary glue sticks; they're a must-have for any household with kids.Our little artists at home absolutely adore these glue sticks. The magical disappearing purple formula makes it easy for them to see where they've applied the glue, ensuring a mess-free crafting experience. Plus, it washes away easily, so no need to worry about sticky fingers or ruined clothes.What sets these glue sticks apart is their reliability. They hold paper, cardboard, and even fabric together securely, making them perfect for school projects and creative activities. No more worries about projects falling apart!The 6-gram size is just right for little hands, and with 12 in a pack, we never run out when creativity strikes. These glue sticks have become an essential part of our crafting and school supplies, and I couldn't recommend them more. They're affordable, reliable, and kids absolutely love them. If you're in search of the perfect glue sticks, look no further!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heatherfoy68",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRNDDXN7VZOZPHRTOCLJ3QO3SAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22ZYP5FLS6I86?ASIN=B003ULCZ7M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Good value",
                "reviewText": "I really like these glue sticks, they work well. I homeschool and we use them a lot. I'll be honest this price is just about the same as Wal-Mart but I'm a prime member and live 45 minutes from Wal-Mart so it was just easier to have them delivered in 2-3 days. If you've never used these, they aren't messy, there is no smell, they're easy to use, they're sticky without the mess like regular glue. And the kids aren't putting glue on their hands waiting for it to dry so they can peel it off, lol!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lolonita",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCBZYFDFIA2GL3EAHDWGKNDKMAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39PIUMO24HCEM?ASIN=B003ULCZ7M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars the only glue i will buy",
                "reviewText": "this is the only glue recommended to buy for my daughters age. it’s helpful thwt it’s colored. the price was also best on amazon as compared to a physical store. i will continue to buy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher R Narozny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVIXQRYWROLL3DKVE7KTUU62Z7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IM9SOW2JTNIC?ASIN=B003ULCZ7M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Stickin' It to the Universe, One Glue Swipe at a Time!",
                "reviewText": "Hold on to your crafty hats, because these Elmer's Glue Sticks are like the superheroes of the adhesive world! I'm convinced they were sent from a parallel dimension where everything is held together by rainbows and unicorn magic.I mean, have you ever experienced the sheer satisfaction of gliding one of these glue sticks across paper? It's like spreading the essence of dreams and creativity, one smooth swipe at a time. Move over, Picasso – there's a new artist in town, and their weapon of choice is a glue stick!Let's talk about versatility. These glue sticks are like the MacGyver of the crafting world. Need to stick together a popsicle stick tower? Glue stick. Creating a masterpiece out of macaroni? Glue stick. Assembling a diorama of your dream vacation (while you're supposed to be working)? Glue stick, my friend. These sticks are the ultimate problem solvers, ready to bond with whatever your imagination throws their way.But don't be fooled by their fun-loving appearance – these glue sticks mean business. Once they grip onto something, they're like that friend who refuses to let go of a good joke. Whether it's paper, cardboard, or your ambitious plan to finally organize your life, these glue sticks are here to stick with you through thick and thin.And can we talk about the packaging? It's like a futuristic capsule that contains the secret to crafting happiness. I half-expected the glue stick to levitate out of its container, accompanied by a choir of angels singing a glue-themed anthem.In conclusion, if you're ready to take your crafting game to the next level, get yourself some Elmer's Glue Sticks. They're not just adhesive; they're the glue that holds your dreams together, one stick at a time. Say goodbye to messy spills and hello to precision sticking. Get ready to unleash your inner glue guru!",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Justin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3QLMUMRLRQC3KSN5MW3MKXPPUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUOY1JK4AG04W?ASIN=B003ULCZ7M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Affordable fast shipping",
                "reviewText": "I like the purple color, it stands out on white paper that tells me how much did I put on.Handy for art project and very affordable price!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amy Goodrow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHU3HMXW7UK2NIV3FKKN6NP6AB5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLQVF97Q3ZOO9?ASIN=B003ULCZ7M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Good value",
                "reviewText": "Purchased in bulk for use in stuffing giving boxes for children in need. Very happy with the quality of product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMHGPT55GDRBXOTYOG7344MCJ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VLT8MOLD8JFL?ASIN=B003ULCZ7M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy glue",
                "reviewText": "Easy to use by kids, love the purple color.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 5, 2023",
                "reviewTitle": "Works great and good price",
                "reviewText": "Came on time for school",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vinamrata",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on November 27, 2023",
                "reviewTitle": "Good quality",
                "reviewText": "Good quality glue especially for kids",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lois",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 19, 2023",
                "reviewTitle": "Love this glue",
                "reviewText": "I use this glue for turned under applique, and love it. Better in my opinion than other fabric glue sticks I have used in that it is not so “claggy”. Excellent price too",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 13, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "C est de la bonne colle",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alimom4",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 9, 2023",
                "reviewTitle": "Nice big package, handy!",
                "reviewText": "Useful, great for grandkids crafty endeavours! Perfect for small hands.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}