{
    "remaining_requests": 42835,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/WIN-309GE-IW-CS-309GE-BLK-Tower-Black/dp/B09GPWLBDV",
    "body": {
        "name": "IN WIN 309GE (IW-CS-309GE-BLK) EATX/EEB Mid Tower with 4 ARGB Fan, Black",
        "price": "$279.00",
        "originalPrice": "$279.00",
        "rawPrice": 279.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/WIN-309GE-IW-CS-309GE-BLK-Tower-Black/dp/B09GPWLBDV",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "9",
        "stockDetail": "Only 9 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31WUBanvvFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/11kTYRgJr2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31F2F3T740L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41oxa9NRvNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31oXvXgS oL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31MwTYLIXyL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the IN WIN Store",
            "link": "https://www.amazon.com/stores/INWIN/page/5F3E3568-E9FA-4F5A-AF69-220090720301?ref_=ast_bln"
        },
        "brand": "INWIN",
        "merchantInfo": "Ships from and sold by Computer Headquarters, Inc.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 31,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "FREE delivery Tuesday, February 20. Order within 18 hrs 16 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Vivid Display Through 144 ARGB LEDs and provides creation mode via InWin exclusive Glow X Software",
            "Three Built-in Classically Themed Games and Comes with an Exclusive Gamepad Which Is Specially Designed for the 309’s Integrated Games",
            "New Software, GLOW X, 8 Built-in Lighting Modes and 1 Creation Mode, Supports More Interesting Interactive Lighting Effects and New Customized Creation Mode Provides Users to Defining Own Lighting Effects with More Freedom ▪ Easily Control the Lights and Fans with Just One Software",
            "Increased up to 40 Pages Design Can Display a Simple Animation on Panel and Slideshow Your Creations by Easy Time Sitting"
        ],
        "description": "The 309 Gaming Edition offers three built-in games along with an exclusive gamepad to make the panel become a gaming system on its own! The upgraded GLOW X software supports a new creation mode, offering up to 40 frames that gives control to the users to design whatever they want on the front panel display, even a simple animation!",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "External Components",
                "link": "https://www.amazon.com/External-Components/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3012292011"
            },
            {
                "name": "Computer Cases",
                "link": "https://www.amazon.com/Computer-Cases-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=572238"
            }
        ],
        "productInformation": [
            {
                "name": "Number of USB 2.0 Ports",
                "value": "‎2"
            },
            {
                "name": "Brand",
                "value": "IN WIN"
            },
            {
                "name": "Series",
                "value": "‎IW-CS-309GE-BLK"
            },
            {
                "name": "Item model number",
                "value": "‎IW-CS-309GE-BLK"
            },
            {
                "name": "Item Weight",
                "value": "‎36 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "21.8\"D x 9.4\"W x 19.7\"H"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎21.8 x 9.4 x 19.7 inches"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Batteries",
                "value": "‎2 AAA batteries required."
            },
            {
                "name": "Manufacturer",
                "value": "‎InWin"
            },
            {
                "name": "ASIN",
                "value": "‎B09GPWLBDV"
            },
            {
                "name": "Country of Origin",
                "value": "‎Taiwan"
            },
            {
                "name": "Date First Available",
                "value": "‎September 16, 2021"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 31 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#971 in Computer Cases"
            },
            {
                "name": "Motherboard Compatability",
                "value": "Extended ATX"
            },
            {
                "name": "Case Type",
                "value": "Mid Tower"
            },
            {
                "name": "Cooling Method",
                "value": "Air"
            },
            {
                "name": "Model Name",
                "value": "IW-CS-309GE-BLK"
            },
            {
                "name": "Number of USB 2 Ports",
                "value": "2"
            },
            {
                "name": "Hard Disk Form Factor",
                "value": "3.5 Inches"
            },
            {
                "name": "Fan Count",
                "value": "4"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8b04c1cd-3a51-4e73-bbb8-f0787b34cb51.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ec257c7-2a82-4895-aab5-48a5f09434ef.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/71bbfef9-caf6-4488-958c-36bd9d7c3bef.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/190a7637-a5a9-4d03-8e68-1d4531e3371b.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/31b55483-6f1d-40d4-bb9f-451b05b26c62.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lily_pad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFI3Q77DOF2FRHD7QK26FO4ETRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UJDATKA3E3AX?ASIN=B09GPWLBDV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars It’s pretty nice to have",
                "reviewText": "I’ve been enjoying this very much, there’s not much information on the internet about this chasis but it is very satisfying when you figure out",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "herbert g carter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZA2WK7WZTTTJB2JI3Q3YFJJU5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XIA4IY8QTZN2?ASIN=B09GPWLBDV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Unique.",
                "reviewText": "The media could not be loaded. I barely fit a E-ATX mobo, the ASUS 670e extreme, and have a ASUS Tuf 4080 and a AMD 7950x. Replaced the included saturn fans with a corsair elite 150i AIO and ML elite bottom and rear fans.Airflow definitely isn't optimal but it works Better than I thought it would. I'm managing around a 70ﾟ- 80° Celsius CPU temps running demanding games (40s idle) with the fan curves set to their lowest. I haven't put it through any stress tests yet but so far so good.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/08eb1892-3656-4d7f-98b0-34b74f441b47/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Tony Daniels",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFLQC7SVDODKUMBNM2J5Q2Q5UTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NV9PJ25LQQKM?ASIN=B09GPWLBDV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2022",
                "reviewTitle": "5.0 out of 5 stars In these inwin towers",
                "reviewText": "Better than the infinity inwin case. Better air flow. Probably not the best air flow overall but definitely better.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE74ULADBIP6L7PVXKN7FCGZ23A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ILDUBKAH4695?ASIN=B09GPWLBDV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2023",
                "reviewTitle": "4.0 out of 5 stars This is not the case if you want good airflow, but if you want to impress people it is.",
                "reviewText": "Got this all set up in april with a 7800x3d and a 4090 and I have my AIO running at the top with two fans pulling air from the free space since the power supply takes up one place where airflow should be.It's not the worst design but it's not the best. I bought it for the front panel, which i have working great with my own animations and I have all 9 of my fans hooked to ARGB with signalrgb controlling them (no armoury crate, no glowx aside from making and uploading the animations for the front panel). To achieve that, i have all Inwin saturn fans chained off the 3 pack controller (it works, they all spin at max 1800 as advertised). Don't have them hooked up to the panel controller as you only get colors that match your animation. The case exactly fits a ATX board with room at the bottom for 3 intake fans (which of course get blocked from the size of a 4090), AIRFLOW IS A HUGE PROBLEM WITH THIS CASE. if you leave the glass side on, even with 3 fans on a 360rad, the ONE exhaust and the 3 intake at the bottom (that again, a video card blocks the air flow) your heat goes up 8c and even higher if your're pushing your video card. Still though if you are saavy enough you can make the case more air flow friendly if you dont want to live without the dimmed glass side (and depending on what video card you get you may not have a choice. It's wide enough to fit the biggest xfx amd card and then some with a brace included but if your card is tall and the power plug isn;t 90 degrees, you're not putting the side on. Anyway, with the side on my temps are cpu 54c idle cpu, 91c maxed uncompressing a repack, 4090 OC'd to 2900, 35c idle 76c pegged. without the side, with all the fans, cpu 46c idle, 86 pegged, GPU 32c idle and 71c pegged. Its a good case to impress your friends but if you want all sides on you're going to run real hot. here's my rig infoasus crosshero x670e1 gb samsung 990 pro for OS/boot2 gb samsung 990 pro for downloading crap4 gb WD SX black for games64gb of corsair ram (i prefer the leds on the corsair ram)9 inwin saturn 120 fansinwin 36nb nebula AIOhonestly if the case had better airflow i'd give it a five but if you dont do something to make more intake/output for the air you're basically cooking your components.the case is awsome, not worth the price, i'd rate this with the airflow issue at $150 range not what they are charging and unless you make your own new animations for the front panel you're stuck with what it comes with and the 2 year old add on animations on their web site.And yes, in a normal room, at 68f with the glass side on, i've had the psu thermal shutoff twice and you can feel how hot it is after it shuts down. I leave the glass side off and everything looks better (the side is tinted, dont care for tint) and it's cooler. I also don't have my PC on the floor, it's on a desk 4\" elevated for the 3 intake fans that basically just help cool the gpu but hey, no moree shut downs, hwmon reports all is good so i'll take it and i like the brighter argb and thank myself for not linking the board/fans to armory crate or the glowx software (unless I'm uploading a new animation). if you want to impress people and dont have high end stuff that heats up but this, if you have high end stuff that gets hot skip this and go with something nexus recommends cause airflow in this is a problem with the side on.Edit, yes, if you have a 4090, your radiator at top with 3 good 120mm fans, the 3 fans at the bottom as intake and the included exhaust you're going to need to run this with out the thin glass (and yes, believe it or not it is glass) side on unless you want your temps at 78c for the GPU (thats with the 3 gpu fans at 100% plus the 120mm intake fans blowing on the gpu). there is maybe 8% airflow in this, it just blows hot air everywhere! the 3 fans at the top (if you have your radiator mounted up there on its side blow like this, the one near the back blows the hot air INTO your power supply through the power supply fan (unless you are lucky and have like a 380 asus PS that has a HEATSYNC on one side and you can flip it around for the screw holes), the second fan blows through, and hits the power supply cables which may or may not be a problem depending on your PS and cable amount, and the third fan goes right through. I put two more fans in on 2 & 3 radiator blow through side as a push-pull situation and even with that and the side on i got temps hitting 91 with the side of the case on. with the cheap glass side off and real airflow I can verify and show you pics of 42c idle (instead of 50c idle) for cpu and 30c idle (instead of 36c) idle for gpu. in use pegged for all 8 cores with a huge repack uncompressing and installing, i get 77c instead of 91 for cpu. in game i get 68 for the gpu (with all the air blowing into that i dont think it will make much of a difference). This just has 5% air intake, and if you put your rad on the bottom you have ZERO air intake. Again, like i said, it's a solid case, designed well except for no air intake and that's because the front panel is closed off as a display, and let me say this, i took the front panel off cause the cr2032 that's in it popped out and fell to the bottom when i was setting it up, they could have made 3 120mm fan intake mounts with side vents (or 2 140). they were just lay, the internals of the front panel are a board to control the fans/argb with the front panel colors. I don't have it plugged it, i have the USB cable to upload animations for the front panel connected but no fan or argb control. that whole board is basically worthless when you can get signalrgb software and use the free version to do all your argb stuff and let the front panel do its thing with what you want through the glow software (i dont even run it, i run it when i need to update the front panel)THIS IS NOT THE CASE TO RUN FOR A GAMING RIG UNLESS YOU DONT CARE ABOUT DUST OR A SIDE. Personally i dont. i've kept the side off my pc for the last 14 years cause im in and out cleaning and such. but it is what it is. 4 out of 5.. 5 if they took the time to engineer side vents for front panel fans",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFHZL4WXNJ633S65SBXAQRTRRRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GA4ABWB2KT8A?ASIN=B09GPWLBDV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2021",
                "reviewTitle": "5.0 out of 5 stars Amazing",
                "reviewText": "Everything advertised. Case is amazing, FYI case is heavy 40lbs NO complaints otherwise",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WertyjomaneWertyjomane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPOVY5N5LORFIPCKCRUIIDIIRIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28HYC5FIB5LNH?ASIN=B09GPWLBDV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 6, 2022",
                "reviewTitle": "5.0 out of 5 stars GREAT AND CREATIVE CASE!!",
                "reviewText": "The media could not be loaded. I love this, I didn't get from Amazon but I still love this product. It has nice airflow and isn't hard to cable manage and the remote that comes with it makes some small nostalgic fun with the games in the panel. As shown in the video the customizable front panel is great for those wanting to dip their toes in pixel art motions an you can bring more flare to your PC.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61KnbUwTxAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71RQ1nO7lZL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8ee71ee7-6b77-4c78-a6a4-6c6773e5a469/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Kat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQ5PVW66SQRK4EZYAHL2HT3SWXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDXKFTKPCAFG?ASIN=B09GPWLBDV",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 30, 2023",
                "reviewTitle": "1.0 out of 5 stars Horrible Case",
                "reviewText": "Don't buy this god awful case, aside from the fact that it is horrendously overpriced, mine arrived damaged with a crack in the plastic and I only noticed after I already fully built it, which was a huge headache, not worth it to take everything out and start over again just to return it.The GlowX software that controls the RGB lighting for this case is the worst PC software I have ever used. It crashes every 30 seconds and if you think you'll be able to customize the front panel AND the color of the fans, or the color of the fans at all for that matter, think again. The fans are clearly capable as the various (although extremelylimited in terms of color options) presets have many different fan RGB configurations. However, if you use the custom option to design your own front panel, the fans are locked into slowly cycling through the ugliest color palette I've ever seen. Why they would ever design it this way is beyond me. This is by far the worst case I have ever owned.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on May 3, 2022",
                "reviewTitle": "Design is awesome",
                "reviewText": "The media could not be loaded. it is easy to build your pc, a lot of space to move around m. Argb compatible with Aura sync",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/E1OWr2fM3fL.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}