{
    "remaining_requests": 42830,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/PC-O11-Dynamic-Razer-Tempered-Computer/dp/B07P96XQNJ",
    "body": {
        "name": "LIAN LI PC-O11 Dynamic Razer Edition Black Tempered glass ATX Mid Tower Gaming Computer Case - PC-O11D Razer",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/PC-O11-Dynamic-Razer-Tempered-Computer/dp/B07P96XQNJ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B09JH3SX8Q"
        ],
        "asinVariationValues": [
            {
                "asin": "B07P96XQNJ",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31rfznRD3TL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41pF6s2w1vL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41cybZVCxyL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31rfznRD3TL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41jfVcZtXlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41K3h6Lqv5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bKDlT WbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31N9kNqTA1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4105vKhxIBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41L8AAdddQL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ffd1315-ef87-42ac-b122-358b49008558/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81GqiSjvMBL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81GqiSjvMBL.pdf"
        },
        "byLineInfo": {
            "name": "Brand: Lian Li",
            "link": "https://www.amazon.com/Lian-Li/b/ref=bl_dp_s_web_21413346011?ie=UTF8&node=21413346011&field-lbr_brands_browse-bin=Lian+Li"
        },
        "brand": "Lian Li",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 1976,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Case Type Tower Chassis",
            "Structure Dual Chamber",
            "Dimensions (W)274Mm X(H)449Mm X(D)446Mm",
            "Country Of Origin : China"
        ],
        "description": "Model PC-O11 Dynamic Designed by Razer. Case Type Tower Chassis. Structure Dual chamber. Dimensions (W)274mm x(H)449mm x(D)446mm. Color Black. Material (Front/Side)Tempered Glass+Aluminum (Body)0.8mm SECC. I/O Ports USB3.0 x2 , HD Audio USB3.1 Type-C x1 , HD Audio M/B Type E-ATX / ATX / Micro-ATX.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "External Components",
                "link": "https://www.amazon.com/External-Components/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3012292011"
            },
            {
                "name": "Computer Cases",
                "link": "https://www.amazon.com/Computer-Cases-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=572238"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎26 Centimeters"
            },
            {
                "name": "Number of USB 3.0 Ports",
                "value": "‎2"
            },
            {
                "name": "Brand",
                "value": "Lian Li"
            },
            {
                "name": "Item model number",
                "value": "‎PC-O11D Razer"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC"
            },
            {
                "name": "Item Weight",
                "value": "1 Kilograms"
            },
            {
                "name": "Product Dimensions",
                "value": "17.56\"D x 10.79\"W x 17.68\"H"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎17.56 x 10.79 x 17.68 inches"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎LIAN LI"
            },
            {
                "name": "ASIN",
                "value": "‎B07P96XQNJ"
            },
            {
                "name": "Date First Available",
                "value": "‎March 5, 2019"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 1,976 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#872 in Computer Cases"
            },
            {
                "name": "Motherboard Compatability",
                "value": "ATX"
            },
            {
                "name": "Case Type",
                "value": "Mid Tower"
            },
            {
                "name": "Material",
                "value": "Tempered Glass, Alloy Steel"
            },
            {
                "name": "Cooling Method",
                "value": "Air"
            },
            {
                "name": "Number of USB 3 Ports",
                "value": "2"
            },
            {
                "name": "Total USB Ports",
                "value": "3"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mark F",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNJQOGZDCWPNX7P4NXLM37B2EBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AN8RWNHHMO1T?ASIN=B07P96XQNJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 8, 2020",
                "reviewTitle": "5.0 out of 5 stars Best Case I've Ever Bought",
                "reviewText": "The media could not be loaded. First, the gear:Gigabyte Aorus Elite X570 MBRyzen 3700X CPUSapphire Pulse Radeon 5700XT GPUTeamgroup Dark Za 32GB 3200Mhz RAM3 Corsair QL120 fans (side)6 Thermaltake Riing 12 Plus Premium fans (top and bottom)1 Be Quiet! Shadow wings 120mm white fan (rear)Thermaltake Toughpower 750W Modular Gold rated PSUWD Black 500GB NVME M.2 SSDSeagate Firecuda 2TB SSHDPccooler GI-D66ARecently, I decided it was time to upgrade my PC. Initially, I went with the Fractal Meshify-C White case. It was a good case, but it had some drawbacks that made me realize that since I'm building a quality gaming PC, why settle?Several things made me decide to shop for a better case: The space behind the motherboard wasn't enough for all the cables and controller for the fans, and I was tired of having to physically mash the left panel down to get it to close. The front PCB was built into the front panel, so any time I wanted to open it up, I had to be careful not to put too much stress on the connecting cables going to the motherboard; and finally, in order to have 3 intake fans on the front of that case, you had to remove the panel on the shroud, which left an ugly, gaping hole exposing all the cables that you want to hide. Initially, I modified the panel and used my angle grinder to make a cut out to allow room for the 3rd fan, but the cut was very uneven and I had to use some car weather stripping I had laying around to hide the jagged edges. So I began to shop for a better option.Enter the Lian Li O11 Dynamic XL. I'd never bought a case this expensive before, so I read and watched every review of it I could find. I was tired of the compromises that companies made in the $75-$100 price range, and the O11 XL seemed to be what I was looking for, so I pulled the trigger.Package arrived on time, no visible damage. The case itself was in perfect shape, no dents or scratches on the glass panels.First impression: This case is freakin' SWEET! Finally, I have a case that checks all the boxes for me, and looks amazing! I love the glass front and side and the brushed aluminum finish on the front. Everything about this case has a very high quality feel to it. All the panels fit together perfectly, no annoying gaps.The LED strip looks great, too, very bright and colorful with smooth transitions on the RGB patterns. I like that it has the M/C buttons on the front to change modes and colors. Switching to the 8th mode (LEDs will be off) syncs it to my MB via Gigabyte's RGB Fusion software.This case is large, which I love. There's so much room to work with, and I have plenty of options for future upgrades and additions.I really like the hot swap bays. I took one out for cable management and used the other one for my 2 TB SSHD.This case has TONS of options. There's so many mount points for drives and SSDs, it's ridiculous.I'm running an air cooled build, and this case is great for that. Some reviewers recommend the original O11 Dynamic for air cooled builds, but the clearance for tower CPU coolers is a bit low on that one. I had originally ordered that one and then I checked the clearance specs from Lian Li's website and realized that my Pccooler GI-D66A was too big. The XL is perfect for that cooler, it fits with a few mm's to spare. Also, I wanted a 120mm rear exhaust fan and the XL is the only model that has a place for it.The craftsmanship of the case is straight up on point. I'm really impressed. You really do get what you pay for, and I am glad that I spend the extra $ to get a case worthy of my build.Building in the O11 XL was a good experience. The size of the case allowed for ease of assembly and nothing was too cramped. For example, on the Meshify-C I had to use needle nosed pliers to get the CPU power cable inserted into the MB, since there was no room to get my hand in between the plug and top of the case. With the O11 XL, I had more than enough room to get my hand in there.With all the fans, controllers, etc. I have TONS of cables. Cable management in this case is great, the layout is perfect for hiding all the wires behind the MB. I like the cable shroud panel in the back as well, it helps hide the insanity lol. The openings in the front are well-placed with nice rubber grommets, allowing me to have the cleanest looking build yet.The versatility of this case is a big plus. I was able to move the PSU up to the middle, remove one of the hot swap trays, and use the top one for my hard drive, thus allowing space at the bottom for the fan controllers and PWM hubs.Placing and mounting all 10 of my fans was easy, I really like that the SSD trays are removable, with one more plate to hide the gap when using 3 120mm fans on the side. I also love the 3 fan tray on the bottom, it made mounting those 3 intake fans a breeze. Currently I have the 3 side and bottom fans as intake and the 3 top and 1 rear as exhaust for a slightly positive pressure air flow setup. I am slowly migrating to all Corsair QL fans, as the white really matches up well with the case color, and these fans have rear LED rings as well, so whether I mount them as intake or exhaust, there's no compromise in LED visibility.So what about temps? Same as the Meshify. CPU temps at idle in 30's, full load in 60's. GPU junction temps when playing graphics intensive games like GOW5 is 70s-80s. Nice.I LOVE THE GPU BRACKET! My sapphire pulse GPU is pretty long and it has a bit of a sag. In the Meshify, I used a GPU stand, but I realized that I couldn't use a stand on the O11 XL, since the bottom fans would be in the way. Lian Li thought of everything though, and included a GPU bracket that can support up to 2 GPUs. As I was building, I noticed the instructions recommended putting the bracket hardware on the 2 MB mounting screws just to the left of the right edge. However, the heatsink of my MB PCH was too thick. No problem, I just installed the bracket on the two outermost mount points, and it just cleared my SSD ports and works great! GPU is nice and level.This case is so well built that DB levels with all 10 fans running is quite low, and air flow is more than sufficient for proper temps both at idle and under full load stress tests. Pretty much no difference from the open front design of the Meshify C.All in all, am I glad I got this case? HELL YES I AM. It looks great, performs great, and has all the room and options I need for both now and in the future.I definitely recommend it!",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb2b9255-9d70-451f-9951-f31be7d79e21/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Brad P.Brad P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ47BJU3PSFONRCAI2JZYDPPDCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28PIG23U0N3XX?ASIN=B07P96XQNJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 15, 2022",
                "reviewTitle": "5.0 out of 5 stars Easy to work with, beautiful design",
                "reviewText": "As a long time PC enthusiast/gamer, but first time builder, I can say this case is extremely easy to work with. The build process is very smooth thanks to the intelligent design and copious amount of space in this case, and once it’s complete, the result is stunning.I went with the O11 XL variant because I wanted lots of space to work with, plus I was installing a very large 3090 Ti FTW3. I never found myself cramped or needing more space while going through the build. The panels are all quick and easy to remove, and this case even makes cable management a breeze. I really love all the mounting points for case fans/radiators. I decided to install my AIO on the side and push air out the back and top. Temperatures are ridiculously low; airflow through this case is extremely efficient.Aesthetically, the O11 is quite eye catching. I went with the silver/tinted glass option and I have to say I’m extremely pleased with how it looks assembled. If you’re wondering if the tint is too dark to cover up your hardware, don’t worry, it isn’t. Take a look at the pictures of my setup, the tint is just right to add a little style and still show off the build. The built in front panel LED strip is a very cool touch.Subjectively, this is one of the best looking cases on the market. Objectively, this case is very well designed, easy to work with, and the build quality is superb. Great case; you won’t be disappointed.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61cqBvcy67L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Wfvr1oWML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71sTP9b7fAL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "SJGSJG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4B2AYZ7N7NSIRF2WLUKP44KKDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RARR422UWBCX7?ASIN=B07P96XQNJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2020",
                "reviewTitle": "5.0 out of 5 stars Get One Now, But RT*M!",
                "reviewText": "I adore this case! It replaced an NXTZ H630 and I never thought I'd find a better one. Wrong!First, though, RT*M! It has several tricks that are not really found by looking at the confusing B&W pictures in the manual. The two that most really come to mind are the latch to release the lid (it's on the back, upper left looking from front-to-back), and the plate for attaching SSD drives (it's hard to put in more than two and you have to point them face to face, which makes for some *very* cramped cable origami.) I highly recommend you go to Lian's website to get a better look at how the case is put together.Now about the case itself:It's beautiful! I've never built an RGB system before and was unsure if I'd like the skyscraper-look. I got over that really, really quickly. The only thing in the case that doesn't light up is the Noctua CPU cooler (see specs below). I have to put the sucker to sleep when I go to bed or I'll have to wear a sleep mask (I bought one from Amazon b/c of migraines, but it comes in handy when I forget to sleep the PC. LOL).Also, it's incredibly roomy. As you can see below, I've crammed everything into this that one can get (including two SSD drives, three M.2 cards, a WD 4TB HDD, and two Nvidia 1080Ti Trios). I never felt cramped putting things in as long as I didn't do things out of order. The GPUs, for instance, are 13.62\" long; most ATX cases would have a problem with that, but not the Lian. You can see how much room is left if you look at the pic I attached.I am quite impressed w/ the pre-wired hot-swap HDD bays - all four of them! No more mounting screws! Plug-and-Play. I've never had it better.Finally, it's sooooo easy to assemble/disassemble: you don't need any tools, every piece is solid enough to hold its shape without being too heavy, they are perfectly lined-up when attached (I've never seen such a precise fit between pieces), and they glide into place. The one thing I didn't like about the NXTZ is how you had to pull the front off - (grabbing from the bottom) and feeling a lot of resistance before the attach points released and it finally snapped off, making a loud noise and leaving you wondering if it broke. (It will if you pull from the top, BTW.) The Lian makes a small amount of noise when you slide the metal pieces on/off. That's it.I was disappointed this case didn't support optical drives, but now that externals are so cheap, that passed quickly.Finally, the price: this case is well worth $350 and right now it's listed for around $230; you can't beat the quality/price ratio. Get the Lian and you'll be dancing on a cloud.System Specs: (all bought on Amazon except the RAM)CPU: Intel 17-10700KRAM: G.SKILL Trident Z Royal Series 64GB (2 x 32GB) 288-Pin DDR4 SDRAM DDR4 3600Mobo: MSI MEG Z490 ACE Gaming Motherboard (ATX, 10th Gen Intel Core, LGA 1200 Socket)PSU: Super Flower Leadex Platinum Special Edition 1000W 80+ PlatinumGPU: MSI GEFORCE GTX1080 TI GAMING X TRIO (Renewed) x2 (SLI)CPU Cooler: Noctua NH-U9S, PremiumCase: Lian Li O11 Dynamic XL ROG Certified (Silver) ATX Full Tower",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71qacY-GotL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "grandee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 3, 2022",
                "reviewTitle": "Great pc case with lots of room",
                "reviewText": "Product arrived earlier than expected and in excellent condition and works great the rgb looks incredible and the amount of space available for parts is perfect plus gotta love Razer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jgualnohdx",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 28, 2021",
                "reviewTitle": "Not sure if PC case or T-72",
                "reviewText": "This thing is a tank, it's built like a tank, its has the interior space of a large tank.Get it.The air flow is outstanding, you have MORE than enough room for anything from RTX 3090 power houses and still throw in a radiator (or 2) to keep everything clean and cool.It's a tank, and I have no complaints.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 24, 2020",
                "reviewTitle": "Great",
                "reviewText": "Great Space For Cable Management, Unfortunately I didn’t go for A custom water cooling but if you decide to then this is the case",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Farid",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 30, 2020",
                "reviewTitle": "Elegant and efficient",
                "reviewText": "Elegant and efficient case. Beautifully designed.It was case of the year.I had no issues.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 4, 2022",
                "reviewTitle": "An excellent mid size case",
                "reviewText": "This is a great case. It was well thought out an very well constructed. My only quibble and it’s very very VERY minor is the lack of a reset button (just power on case). That’s it … I’m happy with this case.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}