{
    "remaining_requests": 43119,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cooler-Master-NSE-400-KKN2-Mid-Tower-Computer/dp/B00DKXXBU0",
    "body": {
        "name": "Cooler Master N400 NSE-400-KKN2 Mid-Tower Fully Meshed Front Panel Computer Case (Midnight Black)",
        "price": "$74.99",
        "originalPrice": "$89.99",
        "rawPrice": 74.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cooler-Master-NSE-400-KKN2-Mid-Tower-Computer/dp/B00DKXXBU0",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51XcHzcBOqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51O4aYsjUHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51m boqm-ZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kZkimsvFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iYnIhg-SL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tyc5v9ONL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41g3Ig0 wJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1pCEsbHYdS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1pCEsbHYdS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Cooler Master Store",
            "link": "https://www.amazon.com/stores/CoolerMaster/page/39CD5B9F-09EA-40B7-A28C-DEFFA5D757AF?ref_=ast_bln"
        },
        "brand": "CoolerMaster",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 571,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fully meshed front panel for superior airflow",
            "Supports a 240 mm water cooling radiator or two 120 mm fans on the right side or top of case",
            "Supports up to three SSDs -two on the tool-less 2.5 Inch bracket and one at the bottom of the HDD cage",
            "Supports a 120 mm water cooling radiator at the rear",
            "Includes two Cooler Master XtraFlo 120 mm fans (non-LED) arranged for optimum airflow with support for up to 8 fans total",
            "Three dust filters (top, right side panel, and power supply) for easy maintenance",
            "Two USB 3.0 SuperSpeed ports in front"
        ],
        "description": "The N400 is one of two computer cases joining the N200 in Cooler Master's new N-Series. Along with its brothers, the N400 has numerous features that help it stand apart from the competition. It does so with a full array of exciting options that have been designed specifically with cooling performance in mind, especially water cooling. Its full mesh front panel and well-ventilated layout provide for a more abundant flow of air throughout the case. Fully embracing water cooling, N400 supports radiators up to 240 mm.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b?ie=UTF8&node=193870011"
            },
            {
                "name": "External Components",
                "link": "https://www.amazon.com/External-Components/b?ie=UTF8&node=3012292011"
            },
            {
                "name": "Computer Cases",
                "link": "https://www.amazon.com/Computer-Cases-Add-Ons-Computers/b?ie=UTF8&node=572238"
            }
        ],
        "productInformation": [
            {
                "name": "Number of USB 3.0 Ports",
                "value": "‎2"
            },
            {
                "name": "Brand",
                "value": "Cooler Master"
            },
            {
                "name": "Item model number",
                "value": "‎NSE-400-KKN2"
            },
            {
                "name": "Item Weight",
                "value": "12.4 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "19.7\"D x 7.5\"W x 16.7\"H"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎19.7 x 7.5 x 16.7 inches"
            },
            {
                "name": "Color",
                "value": "N400"
            },
            {
                "name": "Audio-out Ports (#)",
                "value": "‎1"
            },
            {
                "name": "Manufacturer",
                "value": "‎Cooler Master USA, Inc."
            },
            {
                "name": "ASIN",
                "value": "‎B00DKXXBU0"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎July 7, 2013"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 571 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#32 in Computer Cases"
            },
            {
                "name": "Motherboard Compatability",
                "value": "ATX"
            },
            {
                "name": "Case Type",
                "value": "Full Tower"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Business"
            },
            {
                "name": "Material",
                "value": "Polymer, mesh front bezel"
            },
            {
                "name": "Cooling Method",
                "value": "Air"
            },
            {
                "name": "Fan Size",
                "value": "120 Millimeters"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "kbulgrien",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEONQK4Q5IE3YIFAW4BN33ZC6RWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S1M1IJVL9HP6?ASIN=B00DKXXBU0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2016",
                "reviewTitle": "5.0 out of 5 stars A class leader for anyone that wants cooling options without too many vanity features.",
                "reviewText": "While I love the product, I find it silly that the manufacturer did not include the tool-less drive retention hardware for all the drive bays. The last mid-tower I bought with this quantity of drive bays had the drive latching hardware for all drive bays. This case included latches for only the bays that might be considered \"typically\" populated, but I bought the case knowing that I wanted to populate quite a few more than this, so now I have to either try to order the hardware separately or use screws despite the fact that one of the selling points I considered was the tool-less design.Getting past this minor complaint though, I have always taken great pains to manage cooling - particularly with respect to maintaining air flow around drives - even though I don't typically buy high end cases. This has to be my best case yet. It included extra fans and definitely will draw air around the drive bays. The absence of plastic panels, etc. is also a bonus, though I do miss the quick disconnect side panel latches that I enjoy on a similar competitor's case in the same price range.In my opinion, the location of the front-mounted USB and audio connectors is superior for my application. The side-mounted connectors on some cases is beyond difficult at times, and the high connectors on many cases in the same class are awkward when the case is on a desktop for easy access, etc. The location of these connectors was very high on my selection criteria.This purchase emphasized to me the importance of seeing a case before buying it. I selected a number of cases \"on-line\", but I actually visited a brick-and-mortar store before the purchase. Upon seeing the cases with similar attributes and price, it became clear that this case clearly stood head and shoulders above any of the others that I could actually see. Most of the cases felt tinny, had plastic parts, etc. The brick-and-mortar store front, though, had no stock, so I resorted to buying online, but, going forward, I'm certain I will never buy a case without looking at one first.I'm not a big fan of the large top grill on the case as I tend to stack several towers in my tight environment where I have multiple systems, but I have no regrets either. I'd rather have cooling options than nit-pick this point. In fact, a comment below shows that this is probably a key feature that I want to have even though I'm not used to the top of a tower case being open.A plus about this case was that the cooling apertures all have screen filters. Dust is a problem in my environment - to the point that I periodically clean the insides of systems every so often. While the filters aren't likely as effective as the filters on my to-date favorite case, these filters are definitely going to be easier to remove/clean, and are less likely to trap the dust in a way that detracts from the black finish. The presence of the filter screens also mitigate risk of dropping small items into the case from the vents along the top.A key selling point for me on this case was that the cooling apertures are such that they do not emphasize \"show off\" vanity lighting inside the case. I feel that many cases built to show of the inside of the case are unattractive when this is not a goal for the build - particularly when the system is going to have a lot of internal cabling, cards, and so on. The front grille is nice and open, but not so much that empty bays will detract from the system appearance.This is the first tower case I've built that uses a bottom mounted power supply. At first I was somewhat skeptical about losing use of the power supply fan to draw heat off the top of the case, but upon further consideration it is clear the design is well thought out. The power supply cooling is maximized, and the top case venting will prevent hot air from pooling at the top of the tower. Furthermore, I find that cable routing in this configuration is superior. Whereas I've always had to contend with cabling that crosses over the CPU, memory, etc., in top-mounted power supply configurations, it's going to be a pleasure to route cables in this case.A slight downer on this design is that mounting removable optical drives in the 5.25\" bays will break the continuity of the front vertical bar that houses the switches, indicators and connectors. I think that will detract from the appearance of the case when a drive is mounted there.Thumb screws for side panel removal are vanity items that add no functional value. They are decorative and attractive (black and textured), but I find that they are decidedly not tool-less thumb screws. They are so small and the threading so tight that one must use a screwdriver.Bottom-line: I am happy to have this case. The price was right, I found the case in a brick-and-mortar store so I could review it before buying it, and I doubt I'd want to spend the time to hunt down a competing case to avoid the few nit-picks I have against it. Of the cases I saw, this was by far and away the one that best fit my criteria... cooling options being paramount on that list. The things I would change about this case that would make it perfect: drive mount hardware for all drive bays, quick-open latches for the side panels.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFK4BWHGNYY6WGLBIKSKNZNYALEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25U6D61I22BWA?ASIN=B00DKXXBU0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2017",
                "reviewTitle": "4.0 out of 5 stars Good value",
                "reviewText": "This case is a good value, especially if you're looking for a case to hold a lot of drives. It's almost ideal for my purpose; building a small file and media server for my home network. I am mostly pleased with my purchase, and even with a few items displeasing me I couldn't find any other case that met my needs for less than double the price.My requirements:Room for a micro-ATX motherboard, a big CPU heat-sink, and as many hard drives as I can stuff inside the box.Ventilation adequate to keep the drives and CPU cool while transcoding video.Graphics card fit or cooling was not a consideration. The server does not contain a graphics card (other than the one embedded in the chipset). Most of the time it doesn't even have a monitor, keyboard or mouse attached.Pros:Lots of space for drives. I put eight 3.5 inch hard drives in the case. In addition there are two 5.25 inch bays and three places to mount 2.5 inch drives.Lots of ventilation. The front is fully ventilated with room to mount two 120mm fans so I can blow outside air over all those drives. There are also vents on both sides and the top. Most vents are filtered (though see the cons below for more on those filters)No frills look. This thing is sitting in my home office. I do not want a computer that looks like a gaming system. I do not want a window on the side nor do I want LED fans. This case looks nice but doesn't look like it should be in a game room.Comes with two basic (no PWM) fans mounted. I replaced them with PWM fans (and added more PWM fans elsewhere), but I didn't really need to.Motherboard mounting plate has an opening for mounting a cooler back-plate.Cable management is decent. I've never worried about this before (I don't care to see inside my computer) but I suppose it makes airflow within the case a bit cleaner.Cons:Fit and finish leave a bit to be desired. One side panel was bent at the corner when I received the case. I straightened it, but it still doesn't sit squarely on the side of the case. It's not worth the trouble to RMA, so I'll live with it.Filters are difficult to remove for washing. All require you to remove one side panel or the other to access. In some cases, if you mount a fan, the filter ends up between the fan and the case side (meaning you must remove the fan to remove the filter).Little headroom between the motherboard and the top of the case. I use a downward blowing CPU cooler (Scythe Kabuto II). There is so little space between the cooler vanes and the top of the case that it's impossible to mount standard 25mm thick fans to the top vents. I think I can make thin (15mm) fans fit, but I'm not certain. It would have been nice if the case had a little more headroom.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KboyerKboyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFLB7FRBKWRLW4G4NCO5BQ4CCVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLBOBKKOGT6R2?ASIN=B00DKXXBU0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars A simple but fantastic case for any use",
                "reviewText": "I have two of these and they are absolutely fantastic cases. One of them is holding a late 2000's gaming rig and the one I just ordered is being used for a home server. It's one of the few cases you can find that actually have more than one or two hard drive bays and still has external disk drive slots as well. It's not the fanciest looking case but its sturdy, reliable, and a great value.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-1Ufrc0XL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "garthmicro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 2, 2023",
                "reviewTitle": "Ordinary Case",
                "reviewText": "This case is an ordinary black case without the see-thru side panel. I wanted a case that is practical and provided four USB ports on the front. This case met my needs very well. It has a front fan and a rear fan - they work well. It is reasonably attractive but not \"wild\". I like it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Othon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 11, 2023",
                "reviewTitle": "Excelente herramienta perfecto",
                "reviewText": "No se raya aunque uno lo limpie, por su textura antiryas",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 7, 2023",
                "reviewTitle": "Boitier moyen",
                "reviewText": "Boitier moyen qui je crois est en fin de production. Spacieux, utilisé avec carte maitresse ATX, pas de bling bling.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 25, 2020",
                "reviewTitle": "Good looking case with lots of room to build",
                "reviewText": "Used this case to upgrade my home server from a Micro ATX tower. Really nice case to build in. My only complaint is a lack of instruction on mounting drives, especially NAS drives with screw-holes in non-standard places. Although that's more on me for trying to put NAS drives in a regular consumer case; I'll probably purchase a bracket when I add more drives. Comes with fans in both the front and rear.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.H. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 1, 2020",
                "reviewTitle": "Looks so much better, out of the box!",
                "reviewText": "The cost is awesome. The case looks professional, belongs in an office. Not to mention, so much better looking out of the box! The # of components you can put in is fantastic. I have 8 fans mounted. PERFECT FOR A WORKSTATION.For a first time pc builder, it was great!At some point you may need the assistance of someone with thin fingers or small hands.Downside is the plastic SSD bracket. Just buy a new one when you get the case, not worth trying.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}