{
    "remaining_requests": 42853,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Thermaltake-Tempered-Vertical-Pre-Installed-CA-1I7-00F6WN-00/dp/B07D9CKZV8",
    "body": {
        "name": "Thermaltake View 71 Snow 4-Sided Tempered Glass Vertical GPU Modular SPCC E-ATX Gaming Full Tower Computer Case Chassis 3-Way Radiator View with 2 White LED Riing Fan Pre-Installed CA-1I7-00F6WN-00",
        "price": "$219.99",
        "originalPrice": "",
        "rawPrice": 219.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Thermaltake-Tempered-Vertical-Pre-Installed-CA-1I7-00F6WN-00/dp/B07D9CKZV8",
        "soldBy": {
            "sellerID": "AVJVORAZOW99L",
            "name": "Super Component Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AVJVORAZOW99L&asin=B07D9CKZV8&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08MSZPKJM"
        ],
        "asinVariationValues": [
            {
                "asin": "B074ZL25BP",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51+nwMCtHRL._SS36_.jpg"
            },
            {
                "asin": "B07D9CKZV8",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51DZLrcJqNL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "Only 8 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/517feALSzLL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41SgDefWWPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41AEUgXBXeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JuzV2sbYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51thiY2PVnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51aodOfQgxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419atZHJIoL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Thermaltake Store",
            "link": "https://www.amazon.com/stores/Thermaltake/page/E7446300-D4D5-4D86-B99A-E6DBD017FB77?ref_=ast_bln"
        },
        "brand": "Thermaltake",
        "merchantInfo": "Super Component Store",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 2250,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$4.99 delivery Tuesday, February 20."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Supports Mini ITX, Micro ATX, ATX, E ATX Motherboard",
            "Take in the View: Designed for enthusiasts, the View 71 TG Snow dual swing door full window panels open a new look on PC building",
            "4 Sided Glass Viewing Protection: Surrounded in 5mm thick tempered glass panels spaced from the chassis for optimal airflow",
            "Go Vertical: Includes GPU Float bracket allows vertical mounting options for 2.5 slot GPU solutions; (Riser Cable Sold Separately)",
            "3 Way Radiator View: Supporting 3 way radiator fitments with options for Top, Front or Vertical View mounting options",
            "Cool all your View: Includes 2 x Riing 140 mm White LED Fans (140 mm) providing cooling and color right out of the box",
            "3 Year Warranty"
        ],
        "description": "Designed to expand the legacy of the View Series lineup, the View 71 Tempered Glass Snow Edition Full Tower Chassis features unrivaled cooling support and expandability surrounded in tempered glass for a one of a kind view. Swing open full window tempered glass panels for easy access with all panels properly spaced for optimal airflow. Preinstalled with two 140mm Riing white fans, Vertical GPU mount and 3-Way radiator support for today’s PC hardware demands, the only limitation is your imagination. 3 year warranty.Case Type: Full TowerDimension (H x W x D): 592 x 274 x 577 mm. 23.3 x 10.8 x 22.7 inchNet Weight: 18.9 kg / 41.66 lbSide Panel: 5mm Tempered Glass x 4 (Left & Right & Front & Top)Color: Exterior & Interior: WhiteMaterial: SPCCCooling System Rear (exhaust): 140 x 140 x 25 mm Riing LED White fan (1400rpm, 28dBA) (1000rpm, 22 dBA with LNC) Cooling System Front (intake) :140 x 140 x 25 mm Riing LED White fan (1400rpm, 28dBA) (1000rpm, 22 dBA with LNC)Drive Bays: Accessible: 2.5” x 4 or 3.5”x4 (HDD Rack). Hidden: 2.5”x 6 or 3.5” x 3Expansion Slots: 8+2Motherboards: 6.7” x 6.7” (Mini ITX), 9.6” x 9.6” (Micro ATX), 12” x 9.6” (ATX), 12” x 13” (E-ATX)I/O Port : USB 3.0 x 2, USB 2.0 x 2, HD Audio x 1PSU: Standard PS2 PSU (optional)Fan Support: Front: 3 x 120mm, 2 x 140mm. Top: 3 x 120mm , 3 x 140mm. Rear: 1 x 120mm, 1 x 140mm. Bottom: 2 x 120mm.Radiator Support: Front: 1 x 360mm, 1 x 420mm. Top: 1 x 360mm, 1 x 420mm. Rear: 1 x 120mm, 1 x 140mm. Right: 1 x 360mm, 1 x 420mm. Bottom: 1 x 240mmClearance: CPU cooler height limitation: 190mm. VGA length limitation: 310mm(With HDD Rack).410mm(Without HDD Rack).PSU length limitation: 220mm (Without Bottom Fan)",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "External Components",
                "link": "https://www.amazon.com/External-Components/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3012292011"
            },
            {
                "name": "Computer Cases",
                "link": "https://www.amazon.com/Computer-Cases-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=572238"
            }
        ],
        "productInformation": [
            {
                "name": "Number of USB 2.0 Ports",
                "value": "‎2"
            },
            {
                "name": "Number of USB 3.0 Ports",
                "value": "‎2"
            },
            {
                "name": "Brand",
                "value": "Thermaltake"
            },
            {
                "name": "Item model number",
                "value": "‎CA-1I7-00F6WN-00"
            },
            {
                "name": "Item Weight",
                "value": "41.66 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎27.56 x 19.69 x 27.56 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎27.56 x 19.69 x 27.56 inches"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Manufacturer",
                "value": "‎Thermaltake"
            },
            {
                "name": "ASIN",
                "value": "‎B07D9CKZV8"
            },
            {
                "name": "Date First Available",
                "value": "‎May 24, 2018"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 2,250 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,080 in Computer Cases"
            },
            {
                "name": "Motherboard Compatability",
                "value": "ATX"
            },
            {
                "name": "Case Type",
                "value": "Full Tower"
            },
            {
                "name": "Material",
                "value": "Tempered Glass, Alloy Steel"
            },
            {
                "name": "Cooling Method",
                "value": "Air"
            },
            {
                "name": "Number of Expansion Slots",
                "value": "10"
            },
            {
                "name": "Number of USB 2 Ports",
                "value": "2"
            },
            {
                "name": "Number of USB 3 Ports",
                "value": "2"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amanda BakkeAmanda Bakke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRWDDFFSLXSYIG6KP3MS6WW3ICQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17OMVU9EMPE8L?ASIN=B07D9CKZV8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2019",
                "reviewTitle": "5.0 out of 5 stars The best case I could find and i'm not disappointed!",
                "reviewText": "The media could not be loaded. I am absolutely in love with this case! I cannot speak for water cooling since I have not set my pc up that way. The case is massive... it really is big. I was blown away when they delivered the box. Packaging was fine. Unpacking was easy. It is HEAVY, but if you remove the glass, which is very easy, it's like half the weight or less. So when I want to tinker, I take the glass off where it sits, then move it. The sides are set on hinges. You take out the two screws and open it like a door, then lift it off the hinges. The little things impress me the most.... The attention to detail! The top pin is a little longer than the bottom pin.. so you can set the top pin in the hinge a little, and then line up the bottom. This is ingenious because one could spend all day trying to get them both to line up at once. The top and front glass are held in by the attractive screws. The glass is thick and durable.. you are not going to break or scratch it. The screws that hold the glass on are nice, black so they blend in, and have rubber washers. I remember reading a review that said the space between the case and the glass was not big enough for adequate air flow. That is totally a lie. I don't know if that was a fake review from a competitor but there is plenty of air flow. I would know. I have 13 fans in my case and I count the power supply fan because it is drawing air from in the case and blowing it out the back. Ideal fan placement: (3) 120mm in the front, (3) 140mm on the top, (1) 140mm on the back, (3) 120mm on the cpu radiator cooler and I managed to get (2) 120mm fans on the bottom. The radiator: Sits in the case, in front of the motherboard, on the right side. The radiator and fans may sit on the top, I did not try. This mount comes completely off which is nice for installation purposes. Take it off, install whatever, then 4 screws to put it back. I opted to put my radiator on the inside right panel because of 2 reasons; 1: I wanted those fans on top, 2: that's how it was done in the installation video I looked up. It is a Thermaltake case and I did buy a Thermaltake cooler and it all lined up nicely. Almost like it was made for this case! All my fans are Thermaltake as well. The radiator goes all the way to the bottom of the case, so I had to move a fan some to make it work.. not ideal since it's offset and not totally on the grate with the holes, but it's there and still pulls in air. Options: This case has many options... if you don't have a cooler, or a batman figurine to put in the case (front) you can use the hard drive modules that come with it. I opted to take mine out and use the mounts on the other side (right side) of the case. Very handy and gets them out of the way. Less clutter, more air flow. Also comes with a mount for the video card if you are liquid cooling, also removable. Lets talk about cable management. There are plenty of places to run these cables.. including holes with rubber washers at the edge of the motherboard mounting area... so you can run the cable in and attach it right where it sits. Holes across the top every so often so you can run cables directly from the fan to the hole and not along the inside, across the case, just to find a hole. You don't have to run the cable across anything. I had issues with the board and the radiator... I couldn't attach my front USB 3.0 ports... this was unacceptable so I installed a PCI USB 3.0. Added (5) USB 3.0 to the back and I got my front USB ports back since this piece of hardware had 2 additional ports in the front. The bad part about this is, there are more cables and the PC looked so much cleaner before I installed that. Oh well... can't win at everything all the time. Maybe I could have found a cable that had a \"L\" in it and made it work, but I wanted the extra USBs on the back anyway. The best motherboard you can get doesn't have enough lol. The right side of the case: 3 places to mount HDD, and ample room to stuff all your cords you don't want to see. I have (3) RGB fan control modules back there along with all the cables for the fans and one HDD. It's crowded.. but a perfect place to hide all those cables. It has a top, front and bottom dust screen.. THANK YOU Thermaltake! This case is the perfect home for my MSI MEG Godlike motherboard, i9-9700k processor, 1080ti graphics card and all glorious fans moving all the air I want. I need it with the overclocking. This is the best and the last case I will ever buy. Thank you Thermaltake for making such a well thought out product so perfectly.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/713SxPN6zFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71AymQfKmuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71XNtmxBhWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71jPlN9lbeL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7dc565ac-b6c7-483f-8dea-fb9535d55ae0/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Neo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEE3L5ILY5EX7SFIZ43IZACODFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2II0FDU80NVFJ?ASIN=B07D9CKZV8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2020",
                "reviewTitle": "5.0 out of 5 stars Good design, good quality, but the small details...",
                "reviewText": "Case looks cool, easy to work with, fans looks cool.There are many details they did good. However there are lots of small details that i don’t know what to say.1. The case has dust filters, but as the builds in the pictures, they all use the dust filtered ports as exhausts. The intakes have no dust filter, and the intakes are small! The poor weak 200 fans have to work their ***es off to suck the air in. Doesn’t make any sense to me.2. The case is huge, but it use very little space for hard drives, I had a hard time mounting them.(I have 3 fans on the bottom as intakes, because there is a dust filter.)3. The screw holes are weird, that most of them are hard to screw in. I often felt like I used the wrong screws, because I had to use some force so they could go in, other screws will not even fit.4. Although most people don’t pay attention to the rear, but it is ugly!5. Again the case is huge, even bigger than some e-atx cases, but wait, this case does not support e-atx!? It has 8 pcie mounting positions, but There’s no mounting holes for e-atx. Even if you put an e-atx mb in, you can no longer use the vertical gpu mount, as it is in the way.6. This case is for water cooling, thus I assume it also should take care of noises. However, the hard drive mount only used hard plastic, which makes my 3.5 hard drive sound much louder. My last case is a Phanteks p400. For a price of $80, it has rubber on hard disk mounts, which made the hard drive much quieter.7. I mounted 3 120 fans on the bottom because it has a dust filter, but the vents are so small that the poor little coolermaster sickle flow 120mm fans don’t produce much airflow. I just purchased 3 high pressure fans to replace the current ones, hoping to give the pc more air.8. I mounted 3 140mm fans on the top for exhaust, but there are more room for the air to go back down than to go out, due to the narrow vents. If you mount the provided 2 200mm fans on the top, they are literally touching the glasses, making the big ARGB fans only for good look, because they are literally trying to blow through a wall.9. The case has a cap on the bottom for draining water(if you build a custom water loop), but to use the vent you have to move your pc so out that they would fall to the ground. Why is there such a useful feature but you can never use?10. You can have access to the hard drives from the back of the case without opening the panels. Supposedly you can easily swap your hard drives, since the mount slide outwards, but no, you have to open the right panel so you can unplug the SATA power and SATA cable. Again, Why does this case have such design but you can’t really use it?11. The power button has led around it, but it can only be white.12. The fans came with the case are at full speed the all the time, unless you unplug them. If you unplugged one of the fans, you may disrupt the ARGB signals to the other fans, as the fans have a pin for ARGB-in and another pin for ARGB-out. Maybe they want the leds on the fans to be in series.This case is far from perfect, but given a price tag of $200, it is indeed a good product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "crankypants",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERMNUYZEIL3AWIYNIOCQWGSZKTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KPC6ACYCI7EX?ASIN=B07D9CKZV8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2020",
                "reviewTitle": "5.0 out of 5 stars Plenty of build room, sturdy, heavy PC Case",
                "reviewText": "TLDR; Great case with plenty of room. It is heavy, but sturdy, with a clean aesthetic.Case came as advertised and was very easy to build in. The HDD cages were easily removed and there was plenty of room for a standard ATX motherboard with an AIO 280mm CPU radiator top mounted. Cable management in the back is a learning curve for those unfamiliar with full glass cases, but it was not a problem. The only issue I had was horizontally mounting a GPU. The mounting bracket at the back of the case was not exactly in line, so it took some additional pressure to get the thumbscrews in place to hold the card. I ended up vertically mounting my GPU using the bracket (cable not included) so it was not a problem.Pros:SpaciousHinged doors make access easyVery customizable for fans and water coolingGood tempsCons:Not insulated for noise (didn't expect it to be, but others might)Cable management is on display in the backPCIE bracket thumbscrew holes were slightly offSome screws are low quality and may strip/break (had 1 snap while installing vertical GPU mount)Does not include PCIE riser cable to accompany mountHEAVY (full build weighs 80+ lbs)I would recommend this case if you like the aesthetic and are looking for an easy access case that can easily run a water loop. In this price range their may be better cases for sound and air flow, but this is an as advertised case.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ComelysComelys",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 24, 2022",
                "reviewTitle": "Excelente gabinete mas para quienes tiene Noctua",
                "reviewText": "Busque varios dias, un gabinete para poder poner mi Noctua NH-U12A, para aquellos que tiene fans de 200 mm, es tu case, la circulacion de aire es batante agradable para los ryzen 9",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71axcwQ+FpL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rogelio GarcíaRogelio García",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 6, 2022",
                "reviewTitle": "Excelente gabinete, estético y funcional",
                "reviewText": "The media could not be loaded. Definitivamente aquí cabe de todo, componentes, funkos, figuras coleccionables etc...Sus acabados se sienten perfectos, los cristales de suficiente grosor, espacio para gestión de cables más que sobrado, sin duda es una excelente compra, tuve un Dynamic O11 y la verdad éste Thermaltake me gusta mucho más.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CsOGzflPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81uucD3zzYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61AFCR6+UaL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/E1UbwamB6BL.mp4"
                }
            },
            {
                "reviewerName": "Captain Proton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 7, 2019",
                "reviewTitle": "Huge, Beautiful and future proof",
                "reviewText": "Pro'sThe case is hugeOffers plenty of space for a custom loop cooling system/AIO cooling solutionsVarious fitments of radiators and chassis fans.Sturdy, thick tempered glass doorsMore then enough space for Hard DrivesSupports vertical and traditional GPU mountsTons of space and superior airflowAmazing cable management2 front mounted USB 2.0 + 2 USB 3.0 plugsMagnetic dust filters galoreEssentially an open case design.Slick Blue Riing 140mm fansCon'sSheet metal is thin so screws strip easyHoles for above screws are also not pre-tapped and are fine thread furthering the stripping likelihoodThumbscrews are a bit of a pain to get in on glass elementsWish I could install 3 140mm fans in front instead of 2.Would be nice if there was a PSU shroud for a cleaner lookSide mounted AIO cooler's require careful consideration as hoses are often not long enoughOne of my USB 2.0 ports is DOA.Case is very heavyThis is gorgeous case and is good value when you consider the amount of space and airflow it affords you. Had the sheet metal been a tad thicker and/or the holes for the screws were tapped or the screws themselves were of better quality all around, then this case would be a solid 5 star baby.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Birdy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 9, 2019",
                "reviewTitle": "Just a heavy A.F’sc beautiful case",
                "reviewText": "The case is beautiful but I have one issue pictures don’t show power supplies when they are clearly viewable and glass panels hinges screws over tightened otherwise no complaints about it yet",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AmazonAddictAmazonAddict",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 5, 2019",
                "reviewTitle": "Great Case",
                "reviewText": "It is really a beautiful case, great for showing off RGB gear. Your first impression of it is that it's huge, it is a little larger then most full size towers. There is tons of room for watercooling, or whatever you want to do. It has excellent cable management, I was able to really hide everything nicely. It can hold seven 3.5\" harddrives, and you could probably sneak a few more here and there if you wanted to. The fans that come with it are crappy when compared to the Corsair LL120's I replaced them with. I wish the case had wheels. But all the glass panels are removable so you can build your system easier, and transport it around easier.If you want big and transparent, this is the one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71a5sNuEasL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}