{
    "remaining_requests": 42910,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Phanteks-Enthoo-Chassis-Without-PH-ES614PC_BK/dp/B00KFAG6DA",
    "body": {
        "name": "Phanteks Enthoo Pro Full Tower Chassis without Window Cases PH-ES614PC_BK,BLACK NO WINDOW",
        "price": "$109.99",
        "originalPrice": "$118.74",
        "rawPrice": 109.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Phanteks-Enthoo-Chassis-Without-PH-ES614PC_BK/dp/B00KFAG6DA",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "Only 8 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41GWONm6eqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ZYHpijtwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411Cz2Qud6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tDELLpZjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415w8oisNGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31d C12MwQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xy99HX2iL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Phanteks",
            "link": "https://www.amazon.com/Phanteks/b/ref=bl_dp_s_web_9273886011?ie=UTF8&node=9273886011&field-lbr_brands_browse-bin=Phanteks"
        },
        "brand": "Phanteks",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 483,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Enthoo Pro includes 1 x 200mm fan in front and 1 x 140mm fan in the rear. Ability to upgrade to additional fans is possible. All fans included are Phanteks' new redesigned and better performing SP series fans. Budget friendly case. 2 x USB 3.0, USB-C GEN 2, Mic, Headphone Front Port",
            "Appearance: Brushed plastic with an aluminum appearance; Stealth interior: hidden PSU / hidden HDD",
            "Cooling: Extreme cooling capacity; 2 included Phanteks' premium fans ; The PWM hub makes it possible to control all the connected fans (also 3-pin fans) with PWM function through 1 PWM connector and create a better cable management",
            "Extensive water cooling support. Provides up to 4 diff installation areas for radiators vary from single to triple (120mm & 140mm form factors). Clearance for push-pull fan configurations; Innovative liquid cooling mounting systems",
            "Closed HDD panel strengthens the chassis' rigidity, even when both HDD cages are removed. Removable Drop-n-Lock SSD bracket that can be installed on 2 different locations. (1 bracket incl.)"
        ],
        "description": "Enthoo Pro includes 1 x 200mm fan in front and 1 x 140mm fan in the rear. Ability to upgrade to additional fans is possible. All fans included are Phanteks new redesigned and better performing premium fans. Budget friendly case, Phanteks Enthoo Pro, unleash unlimited possibilities.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b?ie=UTF8&node=193870011"
            },
            {
                "name": "External Components",
                "link": "https://www.amazon.com/External-Components/b?ie=UTF8&node=3012292011"
            },
            {
                "name": "Computer Cases",
                "link": "https://www.amazon.com/Computer-Cases-Add-Ons-Computers/b?ie=UTF8&node=572238"
            }
        ],
        "productInformation": [
            {
                "name": "Number of USB 2.0 Ports",
                "value": "‎2"
            },
            {
                "name": "Number of USB 3.0 Ports",
                "value": "‎2"
            },
            {
                "name": "Brand",
                "value": "Phanteks"
            },
            {
                "name": "Series",
                "value": "‎Enthoo Pro"
            },
            {
                "name": "Item model number",
                "value": "‎PH-ES614PC_BK"
            },
            {
                "name": "Item Weight",
                "value": "‎30 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎21.65 x 9.25 x 21.06 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎21.65 x 9.25 x 21.06 inches"
            },
            {
                "name": "Color",
                "value": "BLACK NO WINDOW"
            },
            {
                "name": "Audio-out Ports (#)",
                "value": "‎1"
            },
            {
                "name": "Manufacturer",
                "value": "‎Phanteks"
            },
            {
                "name": "ASIN",
                "value": "‎B00KFAG6DA"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎July 17, 2014"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 483 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#337 in Computer Cases"
            },
            {
                "name": "Motherboard Compatability",
                "value": "ATX"
            },
            {
                "name": "Case Type",
                "value": "Full Tower"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Personal, Gaming, Business"
            },
            {
                "name": "Material",
                "value": "Brushed Plastic, Steel Chassis"
            },
            {
                "name": "Cooling Method",
                "value": "Water"
            },
            {
                "name": "Model Name",
                "value": "Enthoo Pro"
            },
            {
                "name": "Light Color",
                "value": "Black"
            },
            {
                "name": "Fan Size",
                "value": "140 Millimeters"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Enthoo Pro No Window Enthoo Pro Window Enthoo Luxe Enthoo Primo Window ✓ ✓ ✓ Included Fans 1x 140mm + 1x 200mm 1x 140mm + 1x 200mm 2x 140mm + 1x 200mm 5x 140mm PWM Hub ✓ ✓ ✓ ✓ Exterior Finish Simulated Brushed Aluminum Simulated Brushed Aluminum Sandblasted Aluminum Brushed Aluminum Dual Power Supply Support ✓ 5.25\" Bays 3 3 3 5 Expansion Slots 8 8 8 8 Dimensions 235 mm x 535 mm x 550 mm (W x H x D) 235 mm x 535 mm x 550 mm (W x H x D) 235 mm x 560 mm x 550 mm (W x H x D) 320mm x 725mm x 705mm (WxHxD) Weight 11.4 Kg 11.9 Kg 13.9 Kg 17.9 Kg",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/4c58749e-b641-4068-83d9-57b1b2e932c2._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5f69bff2-d60b-47d3-94c7-aba642562e6c._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/53851f7f-4f44-421c-b1b9-f30a4649d2b2._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d4536193-4cb9-413a-9624-74f0e3c629cb._SR150,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TCG View",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTZ3HRH6F3LO23MO66S7SKZXEVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R52XRJLKMTOHK?ASIN=B00KFAG6DA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "5.0 out of 5 stars This Jolly Old Beast Still Has Some Bite!",
                "reviewText": "I've been looking for an old school case for some time. When I found this older guy, I was so darn happy!He's big, he's hefty, he's sturdy as heck, and he can do just about anything you ask.The hard drive cage is a huge thing for me since I use a ton of storage. It even provides additional space between each drive to give a little air flow to help keep the drives cool. I was able to mount my 240mm radiator to the very top of the case without any problems, although if I wanted I could have gone with a 360! The inside is BIG so you can fit just about any motherboard in it and even some of the longest of GPUs. I was easily able to get the MSI RTX 4070 3 fan GPU in this case with room to spare.The included tiedowns with the logos on them was a nice addition and they also include a nice hard plastic case with tons of various screws to help you put your built together. And not just a bunch of screws thrown into a plastic container. They are all sorted and each has its' own section so no digging through a bunch of screws trying to find the one you need.The included fans were also a nice thing. The 200mm in the front moves enough air into the case to keep temps under control. There is also a 120mm rear fan they include, but I replaced it with one of mine.Downsides?He's a bit heavy. That's expected though because of the materials used. Once you get your build in there, it will obviously be even heavier so do take care when moving it. Some might say its lack of RGB is a downside, but I bought this case specifically because it didn't have any RGB stuff. Remember, this is a ten year old case and it came out before everything had to have RGB.If you prefer a super silent build, you will run into issues here. The 200mm fan isn't loud, but if you use the top for a radiator, those fans will be audible. For me, it's fine and I only really hear them when my CPU (5900x) ramps up.Overall, I am very happy with this purchase. This old case does everything I want and nothing I don't. I hope Phanteks continues to make this case available because I know there has to be more people out there that don't want all that flashy stuff. Some of us just want a good ol sturdy boy that can house a ton of storage, has good cable management, and can even support a couple of optical drives if needed (I have a Blu Ray drive in my build).If you want small, flashy, RGB, this is obviously NOT the case for you. If you're kickin' it old school with optical drives and a stack of HDDs, you can't go wrong with this big guy!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGW4WVEJOIL2MYYZNJ4GKCIMUWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZOJV5C592V80?ASIN=B00KFAG6DA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 29, 2015",
                "reviewTitle": "5.0 out of 5 stars Almost perfect ... almost - But a very good case, and a great case for the $$",
                "reviewText": "First off, for the price this case is nearly impossible to beat. There are some things, like the screw box, the cover over the drive bays, the SSD mounting system, and the velcro cable routing ties, that just go above and beyond what you'd expect from a case at any price. Fact is there is nothing wrong with or bad about this case. I have to compare it to my CoolerMaster HAF 923 Advanced, which costs way more than 2x as much, to find any real faults with it, and even then they are small. If I compare this case to the HAF, the internal space is lacking, Externally they aren't that different in size, but when working inside both cases, the HAF feels a lot bigger. OTOH the HAF is not nearly as adjustable and configurable. Almost every fan mount in this case is adjustable, and they allow for various size fans at almost all locations. The HAF is definitely sturdier (and a lot heavier), but it's a computer case not a bench, and I generally don't drop or throw my cases often, so I am not sure that's all that big an issuePros:1)Price of course - you'd have to spend twice this to get anything better and even at that, many would still compare poorly against this case2)Design and usability - the variety of configurations possible with this case is mind boggling and for the most part everything is really well thought out and engineered.3)Appearance - it is just a nice looking case. Adult, not some Transformers wannabe gamers case. Just nicely built and attractive. The brushed aluminum look to the front and top plastic panel is a really nice touch of class.4)Filters of some sort at every intake location. Maybe not the best, but at least there is some filtration. And most are really easy to get to and clean.5)It will easily fit a full ATX mobo with room to spare. And almost any size ATX PSU you can imagine6)Isolated bottom mount PSU with its own intake filter7)Comes with front and back fans.8)Can easily be configured for just about any water cooling setup you want.9)The SSD mount systems (however see cons below)10)The tool free HD mounts. (though the 5.25\" mounts do allow for a fair bit of movement for things like DVDs where you are pushing on the front at times) The 3.5\" mounts may seem flimsy at first, but once a drive is mounted and they are installed, they work just fine.Cons:1)The bottom front fan is sort of pointless. It blows into a very confined almost closed space under the 3.5\" drive bays. In fact the space is so small you can only fit a thin fan. Normal thickness 120mm fans will not fit under the bay. And the bay is closed off so none of the air you draw in, gets to anything. It seems mostly to be forced out the front and ends up feeding the front fan.2)The filters are not real dust filters, they are screens. They will do very little if anything to filter dust. But they will keep out bugs :-) To clean the front one, you have to remove the front cover entirely, but thankfully that's not at all difficult. And the filter does come out of the front cover for cleaning.The top filter has the same issue, you must remove the entire top cover. But unlike the front, the top filter is fixed in the cover so you can not remove it for cleaning and must clean the whole top cover. Of course if you are using the top fans as exhausts, then this is less of an issue. which brings me to ...3)Because of the design, all top fans must be running in the same direction, either all intakes or all exhausts. They all pull from a plenum under the cover, so if you run some as exhausts and some as intakes, the intakes will be pulling the exhaust air right back in. Same is true for the front if you run multiple fans there. This isn't an issue unless you are trying to run the case as positive pressure, then you end up with too many exhaust fan locations and too few intake locations. This would be less of an issue if the bottom front fan was actually functional. If there were more intake locations, running 3 fans on top as exhausts would be perfect. Also if you are trying to urn positive pressure, there are areas near the intake fans that you will need to block off or air exhausting the case will simply be drawn right back in. Just above and below the front fan for example. This is because they made holes in the chassis for various fan configurations including multiple smaller fans. With one big fan, there are openings above and below the fan that will simply let the hot air in the case exhaust out into the front plenum behind the front cover and feed the front intake fan. I used some black Gorilla Tape which worked just fine. Also had to block off some openings on the top of the chassis. This is not a big deal and it is a side effect of the case's configurability, which is a good thing. So just be sure however you configure the case, that if it is positive pressure, you do not leave any places for hot air to get drawn back into the case.4)The bottom filters would be great, if they were actually filters. The way the slide in and out is perfect. It's just the material they use is way to course to actually filter dust. For all the filter locations I would suggest adding DEMCiflex filters to the factory \"filters\". Google that name and you'll find them. They will actually make filters to your specs at no additional cost.6)The rubber washers they give you for the side cover thumbscrews, do not hold up. I get they do not want to scratch the paint, and they want to dampen vibrations. But these washers tear in no time unless you do not tighten the side panels. What they need are black plastic washers, preferably nylon.7)Poor cooling to the SSD mounts. They put some really nice SSD mount on the backside of the mobo panel, behind the right side panel. Rubber mounted, clip on, really nice idea. Would work for SSDs or 2.5\" HDs. BUT there isn't enough airflow back there. When I mounted my 850 EVO SSD back there, it ran 10c hotter than I expected. I switched it to one of the 3.5\" bays, which have forced air cooling from the front fan, and the temps came down 10c. Not saying you couldn't run an SSD back there, it will just run hotter. I would not suggest running a 2.5\" HD back there unless it runs really cool to start with. Which is too bad, because the rubber damped mounting system would be perfect for 25\" HDs8)And this is my only real complaint with the design. The location of the power button, power LED and HD LED are bad. Unless you have the case on the floor, you can't see them because they are on top of the case. The HD LED is the most serious. I like to check to see if my HDs are busy or not, and I simply can't tell with this case unless I stand up and go over to the case. Additionally with the power button on top, it is possible to inadvertently set something on it or touch it, and turn the machine off. (it's not guaranteed as the button is recessed, but it's possible, I did it once). Also the external power button, that is in the top cover, sticks in the down position sometimes. This button pushes on the actual power button which is mounted on the top of the chassis, below the top cover. So they put the \"push-through\" button in the top cover. But it tends to get coked in the cover when you push it down, and stick in the pushed position, which has resulted in the computer turning on and then right back off on me. So now I am very careful about putting the top cover back on, and about pushing to power button. This is the only flaw in the design (or at least the execution of the design) in the case.So it may sound as if I am unhappy with this case. I am NOT. I love it. Even had I been looking in the $100-$125 range, I'd still have gotten this case. It's a really good case, and for the money it's probably the best case out there. Heck for 1.5 times the money it's still probably the best case out there. At worst there are a few nitpicking issues or things that are just good rather than great. At best there are some really outstanding things about this case. I seriously doubt that anyone considering buying this case, will be disappointed by it. If you have $150-$200 to spend on a case, you can probably find one you like better for one reason or another. OTOH the $$$ you save by going with this case will let you buy a better SSD, more memory, or whatever, so you might want to think about what's more important. If you are in the sub $150 market, you will be hard pressed to find anything better unless you like cases that look like like they were designed by Hasbro. And on top of it all, there's that really cool little screw case you get. That's just genius, and so much better than the baggie full o screws I got with my HAF.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg Deleersnyder",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 9, 2021",
                "reviewTitle": "It’s a big case that does everything!",
                "reviewText": "I found it very easy to install my new system in this case. Nothing was too tight or hard to reach. Very well-thought out design with lots of accessories.The only two downsides are that it’s big and heavy. It will fit under a desk but you won’t have a lot of room to spare.Otherwise, very nice case that will fit everything you need to put into it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PrincePrince",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 3, 2022",
                "reviewTitle": "Good quality big case",
                "reviewText": "This case is very big and it supports big coolers and graphics cards. It comes with rear and front fans with hub to connect more ones. Speed of the fans can be controlled and even turned OFF through BIOS if connected to fans header in motherboard. Front panel contains two USB 3.1 ports, one USB 3.1 type C port, headphone and mic socket for easy accessibility. SSDs and HDDs can be attached and removed very easily due to the case mechanism. Quality of the materials is superb. Sheet is very thick and whole case weighs around 10 kg. All the needed screws are packed in a box with separate sections for easy assembly. No fancy RGB lights on fan or glass side panel thus no distraction of any kind. Power button comes with ring like LED light and HDD LED just above it. All white light. Top portion have very big mesh cutout which helps to dissipate heat inside the case. Overall very good case for all kinds of PC builds.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61PM8+38ZzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71sLQ8X07rL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71mSrUF-MRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61T60kKZRIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61i1VL8BYCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71IOPhSAzOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ClhqJtmTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "rbisanti",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on March 22, 2022",
                "reviewTitle": "Ottimo case",
                "reviewText": "Case curato e spazioso. Bello esteticamente e funzionale internamente. Il notevole spazio interno facilita e rende piacevole l'assemblaggio. Rapida, curata e veloce la spedizione da parte del venditore Caseking Gmbk - Berlino.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jynni",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 28, 2021",
                "reviewTitle": "Fantastic",
                "reviewText": "Amazing product! Plenty of room inside the work with, my components have plenty of space for air flow, and will last me years of upgrades.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Davo esquire",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 9, 2023",
                "reviewTitle": "Great case with lots of room",
                "reviewText": "This is a great case. So much room to work in. Being able to remove 3.5\" drive bays is handy when fitting a RTX4080 card in (bays were able to be replaced OK). Behind the motherboard has heaps of room with velco straps included.Takes a 360mm AIO at the top easily. Although the specs on the web page state 2 x USB3 and 2xUSB2 ports, the case came with 2xUSB3 and 1xUSB-C port which is just what I wanted. Being able to mount 6 x 3.5\"drives, 3 x 5.25\" drives as well as place to mount up to 3x2.5\"drives, you cannot go wrong (only one 2.5\" tray was included though).Having worked with my HAF932 before, this case ranks up there as a great case! Highly recommended.I only wish they made more cases like this nowadays as this was hard to find.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}