{
    "remaining_requests": 2697,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mead-Notebook-Subject-Selected-05748/dp/B000BQS5AU",
    "body": {
        "name": "Mead Spiral Notebook, 3 Subject, College Ruled Paper(05748), 120 Sheets, 10-1/2\" x 8\", Assorted Color - 1 Count",
        "price": "$6.89",
        "originalPrice": "",
        "rawPrice": 6.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mead-Notebook-Subject-Selected-05748/dp/B000BQS5AU",
        "soldBy": {
            "sellerID": "A21BBMEF3BMW1Z",
            "name": "westlake",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A21BBMEF3BMW1Z&asin=B000BQS5AU&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B003XVZCRY"
        ],
        "asinVariationValues": [
            {
                "asin": "B003NSB07I",
                "variationName": "Color",
                "variationValue": "02 Blue",
                "price": "$6.89",
                "variationImageURL": "https://m.media-amazon.com/images/I/41mII3+BjAL._SS36_.jpg"
            },
            {
                "asin": "B003NSB082",
                "variationName": "Color",
                "variationValue": "03 Red",
                "price": "$12.95",
                "variationImageURL": "https://m.media-amazon.com/images/I/419Me9M3+KL._SS36_.jpg"
            },
            {
                "asin": "B000BQS5AU",
                "variationName": "Color",
                "variationValue": "Assorted Color",
                "price": "$6.62",
                "variationImageURL": "https://m.media-amazon.com/images/I/51tLs-XCL4L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51tLs-XCL4L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51YkaIQ4 2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gJ4oBH0qL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZLaI6ZesL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XqtqgwFZL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Mead Store",
            "link": "https://www.amazon.com/stores/Mead/page/339F7493-5B3E-4D44-8A98-A48C0364E3EA?ref_=ast_bln"
        },
        "brand": "Mead",
        "merchantInfo": "westlake",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 840,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 10 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Handy dividers separate the notebook into 3 subjects. Ideal to use for all your classes or for special projects.",
            "With 120 college ruled, double-sided sheets, there’s plenty of notetaking space. Pages are perforated so they easily tear out with clean edges.",
            "Notebook is 3-hole punched for storage in your favorite binder. This allows you to keep all your work organized and in one place.",
            "Spiral binding will not snag and resists uncoiling to keep your notes together. Notebook covers are coated for durability.",
            "Sheets measure 10-1/2\" x 7-1/2\" when torn out. Overall size of 10-1/2\" x 8\". Availabel in assorted colors: Red, Blue, Green."
        ],
        "description": "Mead Spiral 3 Subject Notebook is versatile and perfect for a variety of uses including in-class assignments and homework. Handy dividers separate the notebook into 3 subjects. Ideal to use for all your classes or for special projects. With 120 college ruled, double-sided sheets, there’s plenty of notetaking space. Pages are perforated so they easily tear out with clean edges. Notebook is 3-hole punched for storage in your favorite binder. This allows you to keep all your work organized and in one place. Spiral binding will not snag and resists uncoiling to keep your notes together. Notebook covers are coated for durability. Sheets measure 10-1/2\" x 7-1/2\" when torn out. Overall size of 10-1/2\" x 8\". assorted colors: Red, Blue, Green.",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office & School Supplies",
                "link": "https://www.amazon.com/Office-Supplies/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1069242"
            },
            {
                "name": "Paper",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1069664"
            },
            {
                "name": "Notebooks & Writing Pads",
                "link": "https://www.amazon.com/Notebooks-Writing-Pads/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1069756"
            },
            {
                "name": "Subject Notebooks",
                "link": "https://www.amazon.com/Subject-Notebooks/b/ref=dp_bc_aui_C_5?ie=UTF8&node=490756011"
            }
        ],
        "productInformation": [
            {
                "name": "Manufacturer",
                "value": "‎ACCO Brands"
            },
            {
                "name": "Brand",
                "value": "Mead"
            },
            {
                "name": "Item Weight",
                "value": "‎10.6 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎10.5 x 0.75 x 8.38 inches"
            },
            {
                "name": "Item model number",
                "value": "‎05748"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Color",
                "value": "Assorted Color"
            },
            {
                "name": "Cover Material",
                "value": "Paper"
            },
            {
                "name": "Material Type",
                "value": "‎Paper"
            },
            {
                "name": "Binding Edge",
                "value": "‎left"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Size",
                "value": "‎Pack of 1"
            },
            {
                "name": "Lines Per Page",
                "value": "‎31"
            },
            {
                "name": "Ruling",
                "value": "‎College"
            },
            {
                "name": "Sheet Size",
                "value": "10.5-x-8-inch"
            },
            {
                "name": "Manufacturer Part Number",
                "value": "‎05748"
            },
            {
                "name": "ASIN",
                "value": "B000BQS5AU"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 840 ratings 3.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#19,441 in Office Products (See Top 100 in Office Products) #118 in Subject Notebooks"
            },
            {
                "name": "Date First Available",
                "value": "July 7, 2007"
            },
            {
                "name": "Theme",
                "value": "Book"
            },
            {
                "name": "Style",
                "value": "Spiral"
            },
            {
                "name": "Ruling Type",
                "value": "College"
            },
            {
                "name": "Special Feature",
                "value": "No"
            },
            {
                "name": "Binding",
                "value": "Office Product"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/f62f1a0e-4a2d-43b3-b01d-186f4826417f._CR0,0,970,300_PT0_SX970__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Yoonmi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTQ2NJDNNSLF6VYEG2ZV7RUYPFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW1R01Q02H841?ASIN=B000BQS5AU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 8, 2013",
                "reviewTitle": "5.0 out of 5 stars Paper cover for those who don't like Five Star",
                "reviewText": "I've been a lover of Mead notebooks since I was young. From the composition notebook that I got in the first grade until now. So this may come off very biased.I write fiction and still like to do it long hand. Based on that, I'm very picky about my notebooks, down the number of pages I prefer to buy in the notebook. I have a fit if someone tears a page out without asking.I've tried other notebooks, but either this covers were made of plastic which cut me when I didn't expect it, which meant I had to cut off the corners, they had perforation that got in the way or made my precious pages fall out, they had holes that were hard to work around, or they had awkward and hard to kill dividers.Since I like tearing out the brown dividers and the dividers are thin, really helps me out.Since there are no holes in the notebook, my pinky doesn't crash into it.Since there is no perforation on the pages, unlike most Five Star, the pages don't get pulled out. (And no one has a temptation to pull out the pages, especially when it has no holes.)Since it's college rule, I save money for the page and the blue lines are dark enough so I can see them.Since the pages in the spiral are punched evenly along the line and far enough in, the pages turn both evenly and don't start to tear out. When I do want to tear them out in frustration, they tear with a satisfactory sound. Also, I tend to hold up the notebook by the single page and they don't tear even then, making the paper fairly sturdy. (Mead has improved this over the years, much to my personal satisfaction)And no offense to people who like recycled paper, but my notebooks wouldn't hold the pencil well on recycled paper. (I recycle by composting it these days instead.) Since I did math in my notebooks, I often had trouble with erasing on recycled paper and also getting it to hold the line. I also don't have a light hand when it comes to writing.There was a complaint that these notebooks don't stand up to the test of time. They do. I have notebooks from when I was 13 when I was writing every day. While the writing in them now sucks in my eyes, the notebooks themselves have held up fine. The other notebooks I have had (Topflight) fell apart due to perforation, their pages clogged such that I couldn't turn them, the spiral part came apart, such that I had to transfer much of the material by hand to a Mead notebook instead.The Five Star notebooks I have are bulky (Don't fit neatly into my purse/bookbag/carrying vessel), they have sharp corners that cut me when I used to fall asleep with my notebooks--so it was unpleasant waking up with a cut in the middle of the night. (I like writing at night and often would write in bed.) There were often extra dividers I really didn't need--such as a calendar, notebooks with pockets, which when I pulled out, ruthlessly, bent the spiral. And when they got abused--which I was apt to do with notebooks, often the large spiral would bend out of shape because it was too large for the notebook, making it hard to turn the pages. And I hated the plastic covers. (Seriously--paper cut is one thing, but getting cut with plastic is another.) My other complaint about Five Star was that often the lines would be faint, so when I was working on my homework at night, I couldn't see the lines, even by light--the lines also had a tendency to fade over time. (I have no idea if Mead fixed this at all in the newer versions, but it was a pain in the butt since I liked to buy ahead.)I am now in my 30's and that makes for over 20 years of experimentation. I've seen every experimentation Mead has tried with their notebooks since I was little (They once sold bright pink covers on the 200 denomination, you know). And my only conclusion is this type of notebook is for me. It comes with me everywhere. It has been thrown, stepped on, rained on, and pummeled. I do have to say that I am sad that Mead has thinned down on the back and front cover over time (Mostly the back cover--a thick back cover is useful). It used to be much thicker and sturdier material. Also that the distribution of this type of notebook is harder to find these days--Office Max, Office Depot, Staples? Anyone? But, for me, it beats every other notebook I've tried on market--and I've tried them all.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kiara Morris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXEQK3P7DLRTENA3F4BG5LGYMLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T23WXZDMS9JJ?ASIN=B000BQS5AU",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "1.0 out of 5 stars Not 3 note books and flimsy paper",
                "reviewText": "They put a misleading title. They make it seem likes it’s 3 but it’s only one. And the material is cheaply made and the paper is flimsy. Very over priced for 1 notebook.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheila B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAVVEAHLZIT4PB7C3RZZXPOTF7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y9ZW21HU81HD?ASIN=B000BQS5AU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Good quality",
                "reviewText": "I usually find smaller sized ones in my area, this notebook is great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jillian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6MFQ4JXBPETOVXGRBPYXUQHWDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R85QPOXSKB0W?ASIN=B000BQS5AU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2010",
                "reviewTitle": "5.0 out of 5 stars Great notebook, two (maybe) minuses",
                "reviewText": "I was a little skeptical about buying notebooks online. I tend to be pretty picky, and I hate getting flimsy books full of cheap paper. Those pages where the ink's half gone? Gross.Thanks to the low price, I decided to bite the bullet and stock up on these notebooks from Amazon. They're what you'd expect in a basic Mead notebook - reliable quality at a decent price. Soft, smooth paper with squared edges on the page (I hate the rounded edges....is it just me?). I'm glad I bought a few, because these are exactly what I needed.There are two potential minuses when buying these notebooks. First of all, there are no ring holes. If you like to keep your notebook inside your three-ring binder, this one won't work for you. Secondly, the notebooks are pretty flexible - which I like, but you might not. This notebook doesn't have the uber-thick paper cover and cardboard backing that most multi-subject notebooks do. The front covers are pretty thin, and the backing is plain cardboard on the outside with coating on the inside (think gift boxes for shirts). These books would be ideal for rolling up and sticking into your pocket or a bag that's pressed for space. I can see where some people might want a book that feels a little sturdier, though so far the flexibility hasn't presented a problem.If you need a basic, budget notebook, this is the one to get.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jason x",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPPVVLHMRE7DQVB7KHXO7YAFOYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DSW7UN95OC0X?ASIN=B000BQS5AU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2010",
                "reviewTitle": "4.0 out of 5 stars No complaints, good quality paper",
                "reviewText": "The price is so much better online for such items compared to the local Staples store. Items arrived in 3-4 days, and were perfect. The paper quality is good, the spiral binding holds together well. I used the Ampad notebooks earlier, but they tend to smudge the ink often. These Mead notebooks are far superior in quality - no ink smudges, no paper crumpling, paper looks new even after several months.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hal A. Lupinek",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELBOIJZ63FJ74MY5EG7V5MMNVJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JD5TIO5TXW37?ASIN=B000BQS5AU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2020",
                "reviewTitle": "5.0 out of 5 stars Best paper, 'lighter' construction more than suffices.",
                "reviewText": "The paper is the best, accepts ink better than any of the other brands tried. The [biro] ink shows blackest, takes the least pressure to mark. These notebooks are not 'flimsy' to me, rather, perfectly adequate for daily carrying in pack. True, the paper is finer than many others'; less weight then, less bulk... great! I write and draw for hours at a time in these notebooks; the light lines are minimally distracting for drawing, but still give a bit of structure for writing without crowding me. Well worth the price.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G. Davis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG42IAKS5T2K4PEV36AMYKQTVU7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HT524TGOXMB0?ASIN=B000BQS5AU",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "2.0 out of 5 stars Getting ripped off",
                "reviewText": "I ordered this item which according to the image contains 3 notebooks. I only received 1 notebook. I call that a rip off.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPAFT66W6ZMS23Z3M6UTVXBDZVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU6771OM2PJZ0?ASIN=B000BQS5AU",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "1.0 out of 5 stars Not 3 Notebooks",
                "reviewText": "The advertising image is misleading as you only receive one notebook instead of three shown in the picture.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rita",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 28, 2023",
                "reviewTitle": "Qualidade",
                "reviewText": "Qualidade pessima",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.99",
                "sellerName": "green valley sales",
                "sellerRating": "4.5"
            },
            {
                "price": "$7.07",
                "sellerName": "OTCRx4u",
                "sellerRating": "4.5"
            },
            {
                "price": "$7.19",
                "sellerName": "Modernparty",
                "sellerRating": "5"
            }
        ]
    }
}