{
    "remaining_requests": 2791,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Moleskine-Cahier-Cover-Journal-Pocket/dp/8883704894",
    "body": {
        "name": "Moleskine Cahier Journal, Soft Cover, Pocket (3.5\" x 5.5\") Ruled/Lined, Black, 64 Pages (Set of 3)",
        "price": "$8.88",
        "originalPrice": "$10.32",
        "rawPrice": 8.88,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Moleskine-Cahier-Cover-Journal-Pocket/dp/8883704894",
        "soldBy": {
            "sellerID": "A16HZ3J3WEU71V",
            "name": "LY Berditchev Co.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A16HZ3J3WEU71V&asin=8883704894&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "20",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31gxKqrVU1L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31DBOfW8ZcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31pi 2E1rqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31CFdIzPWoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31DJ2UC87qL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31UzPhLQBGL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Moleskine Store",
            "link": "https://www.amazon.com/stores/Moleskine/page/0DC91016-728C-4CFA-81DE-86E66632AA78?ref_=ast_bln"
        },
        "brand": "Moleskine",
        "merchantInfo": "LY Berditchev Co.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 2757,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs 35 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35. Order within 17 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "The Forest Stewardship Council certified products support responsible forestry, helping keep forests healthy for future generations."
        },
        "features": [
            "MOLESKINE CAHIER: This 3.5 x 5.5 ruled journal has a flexible heavy-duty customizable cardboard cover, a pocket for loose notes & visible stitching on the spine. The last 16 sheets are detachable.",
            "CLASSIC DESIGN: The Cahier Journal is a favorite among avid notetakers. Its cardboard cover makes it ideal for customization—script a favorite quote, sketch a portrait or simply give it a name.",
            "ICONIC NOTEBOOKS FOR EVERY PURPOSE: The story of the iconic Moleskine notebook collection has expanded to include a whole variety of sizes and colors, textures and layouts, and even flexible covers.",
            "MOLESKINE VERSATILITY: Writers, students, artists, professionals & travelers love our notebooks, planners, pens, bags & accessories. From journals to backpacks, there's a Moleskine product for you.",
            "MOLESKINE QUALITY: We're dedicated to culture, travel, memory, imagination, & personal identity—both physical & digital. We bring this commitment to our notebooks, bags, apps & smart pens & notebooks."
        ],
        "description": "Product Description Cahiers are lightweight, flexible, everyday journals with customizable covers. Visible Singer stitching, natural colors and tactile raw cardboard add a handcrafted feel to your writing. The last 16 sheets are detachable and there is a pocket for loose notes. Cahier Journals come in sets of three, making them ideal for organizing separate projects or plans. Amazon.com Moleskine Notebook & Journals Comparison Series Classic Notebooks Evernote Smart Notebooks Classic Notebooks - Reporter Volant Notebooks Cahier Notebooks Brief Description The Moleskine icon. Always at the ready, these thread-bound classic notebooks capture your thoughts, drafts, sketches, notes, appointments, contacts, or anything else you choose. Write, sketch, or draw in the specially designed Evernote Notebooks by Moleskine. Take a photo of any page in this Moleskine notebook with the Evernote Page Camera and it instantly becomes digital so that you can save it, search it and share it with the world. The Moleskine Pocket Ruled Reporter notebook has a cover that flip opens at the top, detachable pages at the back for quick notes on the spot and can be used both horizontally and vertically. A colored collection of soft cover notebooks and journals ideal for everyday use. Volant notebooks come packed in sets of two, consisting of two different shades of the same colour. It's a notebook so lightweight you'll forget about it - until you need it. The journals for day-to-day use, Cahier notebooks each have a heavy duty cardboard cover with visible stitching on the spine that matches the cover color. Slim, soft and light - Cahier journals suit any occasion, and come packaged in sets of three. Size X-Small, Pocket, Large, X-Large Pocket, Large Pocket, Large Pocket, Large Pocket, Large, X-Large Format Hard cover, Soft cover Hard cover Hard cover, Soft cover Soft cover (Sets of 2) Soft cover (Sets of 3) Black XS Plain Hard cover, XS Ruled Hard cover, Pkt Plain Hard cover, Pkt Plain Soft cover, Pkt Ruled Hard cover, Pkt Ruled Soft cover, Pkt Squared Hard cover, Pkt Squared Soft cover, LG Plain Hard cover, LG Plain Soft cover, LG Ruled Hard cover, LG Ruled Soft cover, LG Squared Hard cover, LG Squared Soft cover, XL Plain Soft cover, XL Ruled Soft cover, XL Squared Soft cover Pkt Ruled Hard cover, Pkt Squared Hard cover, LG Ruled Hard cover, LG Squared Hard cover Pkt Plain Hard cover, Pkt Plain Soft cover, Pkt Ruled Hard cover, Pkt Ruled Soft cover, Pkt Squared Hard cover, Pkt Squared Soft cover, LG Plain Hard cover, LG Plain Soft cover, LG Ruled Hard cover, LG Ruled Soft cover, LG Squared Hard cover, LG Squared Soft cover XS Plain Soft Cover, XS Ruled Soft cover, Pkt Plain Soft cover, Pkt Ruled Soft cover, LG Plain Soft cover, LG Ruled Soft cover Pkt Ruled Soft cover, Pkt Squared Soft cover, LG Squared Soft cover, XL Plain Soft cover, XL Ruled Soft cover, XL Squared Soft cover Blue XS Plain Antwerp Blue, XS Plain Blue, XS Ruled Antwerp Blue, XS Ruled Blue, Pkt Plain Antwerp Blue, Pkt Plain Blue, Pkt Ruled Antwerp Blue, Pkt Ruled Blue, LG Plain Antwerp Blue, LG Plain Blue, LG Ruled Antwerp Blue, LG Ruled Sky Blue, XL Plain Antwerp Blue, XL Plain Sky Blue, XL Ruled Antwerp Blue, XL Ruled Sky Blue Pkt Plain Indigo Blue, Pkt Ruled Indigo Blue, Pkt Squared Indigo Blue, LG Plain Indigo Blue, LG Ruled Indigo Blue, XL Plain Indigo Blue, XL Ruled Indigo Blue, XL Squared Indigo Blue Kraft Brown Pkt Plain, Pkt Ruled, Pkt Squared, LG Plain, LG Ruled, LG Squared, XL Ruled, XL Squared Green XS Plain Oxide Green Hard cover, XS Ruled Oxide Green Hard cover, Pkt Plain Oxide Green Hard cover, Pkt Ruled Oxide Green Hard cover, Pkt Squared Oxide Green Hard cover, LG Plain Oxide Green Hard cover, LG Ruled Oxide Green Hard cover, LG Squared Oxide Green Hard cover XS Plain Emerald & Oxide Green, XS Ruled Emerald & Oxide Green, XS Ruled Green, Pkt Plain Emerald & Oxide Green, Pkt Ruled Emerald & Oxide Green, Pkt Ruled Green, LG Plain Emerald & Oxide Green, LG Ruled Emerald & Oxide Green, LG Ruled Green, XL Plain Emerald & Oxide Green, XL Ruled Emerald & Oxide Green Grey XS Plain Slate & Payne's Grey, XS Ruled Slate & Payne's Grey, Pkt Plain Slate & Payne's Grey, Pkt Ruled Slate & Payne's Grey, LG Plain Slate & Payne's Grey, LG Ruled Slate & Payne's Grey Orange/Yellow XS Plain Hard cover, XS Ruled Hard cover, Pkt Plain Hard cover, Pkt Ruled Hard cover, Pkt Squared Hard cover, LG Plain Hard cover, LG Ruled Hard cover, LG Squared Hard cover XS Plain Orange/Yellow & Cadmium Orange, XS Ruled Orange/Yellow & Cadmium Orange, Pkt Plain Orange/Yellow & Cadmium Orange, Pkt Ruled Orange/Yellow & Cadmium Orange, LG Plain Orange/Yellow & Cadmium Orange, LG Ruled Orange/Yellow & Cadmium Orange, XL Plain Orange/Yellow & Cadmium Orange, XL Ruled Orange/Yellow & Cadmium Orange Pink/Purple XS Plain Brilliant Violet Hard cover, XS Ruled Brilliant Violet Hard cover, Pkt Plain Brilliant Violet Hard cover, Pkt Ruled Brilliant Violet Hard cover, Pkt Squared Brilliant Violet Hard cover, LG Plain Brilliant Violet Hard cover, LG Ruled Brilliant Violet Hard cover, LG Squared Brilliant Violet Hard cover, XS Plain Magenta Hard cover, XS Ruled Magenta Hard cover, Pkt Plain Magenta Hard cover, Pkt Ruled Magenta Hard cover, Pkt Squared Magenta Hard cover, LG Plain Magenta Hard cover, LG Ruled Magenta Hard cover, LG Squared Magenta Hard cover XS Plain Brilliant & Light Violet, XS Plain Pink Magenta & Magenta, XS Ruled Brilliant & Light Violet, XS Ruled Pink Magenta & Magenta, Pkt Plain Brilliant & Light Violet, Pkt Plain Pink Magenta & Magenta, Pkt Ruled Brilliant & Light Violet, Pkt Ruled Pink Magenta & Magenta, LG Plain Brilliant & Light Violet, LG Plain Pink Magenta & Magenta, LG Ruled Brilliant & Light Violet, LG Ruled Pink Magenta & Magenta, XL Ruled Pink Magenta & Magenta, XL Ruled Pink Magenta & Magenta Pkt Plain Lilac/Yellow/Peach, Pkt Ruled Lilac/Yellow/Peach, Pkt Squared Lilac/Yellow/Peach, LG Plain Lilac/Yellow/Peach, LG Ruled Lilac/Yellow/Peach, LG Squared Lilac/Yellow/Peach, XL Plain Lilac/Yellow/Peach, XL Ruled Lilac/Yellow/Peach, XL Squared Lilac/Yellow/Peach Red XS Plain Hard cover, XS Ruled Hard cover, Pkt Ruled Hard cover, Pkt Squared Hard cover, LG Plain Hard cover, LG Ruled Hard cover, LG Squared Hard cover XS Plain, XS Ruled, Pkt Plain, Pkt Ruled, LG Plain, LG Ruled, XL Plain, XL Ruled Pkt Plain Cranberry Red, Pkt Ruled Cranberry Red, LG Plain Cranberry Red, LG Squared Cranberry Red, XL Plain Cranberry Red, XL Ruled Cranberry Red, XL Squared Cranberry Red White XS Plain, XS Ruled, Pkt Plain, Pkt Ruled, LG Plain, LG Ruled From the Manufacturer Cahiers are lightweight, flexible, everyday journals with customizable covers. Visible Singer stitching, natural colors and tactile raw cardboard add a handcrafted feel to your writing. The last 16 sheets are detachable and there is a pocket for loose notes. Cahier Journals come in sets of three, making them ideal for organizing separate projects or plans. See more",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office & School Supplies",
                "link": "https://www.amazon.com/Office-Supplies/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1069242"
            },
            {
                "name": "Paper",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1069664"
            },
            {
                "name": "Notebooks & Writing Pads",
                "link": "https://www.amazon.com/Notebooks-Writing-Pads/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1069756"
            },
            {
                "name": "Hardcover Executive Notebooks",
                "link": "https://www.amazon.com/Hardcover-Executive-Notebooks/b/ref=dp_bc_aui_C_5?ie=UTF8&node=490755011"
            }
        ],
        "productInformation": [
            {
                "name": "Manufacturer",
                "value": "‎Moleskine"
            },
            {
                "name": "Brand",
                "value": "Moleskine"
            },
            {
                "name": "Item Weight",
                "value": "‎4.5 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "5.5\"L x 3.5\"W x 0.5\"Th"
            },
            {
                "name": "Item model number",
                "value": "‎S04894"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Cover Material",
                "value": "Cardboard"
            },
            {
                "name": "Material Type",
                "value": "‎paper"
            },
            {
                "name": "Number of Items",
                "value": "‎1"
            },
            {
                "name": "Size",
                "value": "‎Pocket"
            },
            {
                "name": "Ruling",
                "value": "‎Faint Ruled"
            },
            {
                "name": "Sheet Size",
                "value": "3.5 x 5.5 inches"
            },
            {
                "name": "Ink Color",
                "value": "‎Gray"
            },
            {
                "name": "Manufacturer Part Number",
                "value": "‎QP311"
            },
            {
                "name": "ASIN",
                "value": "8883704894"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 2,757 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,397 in Office Products (See Top 100 in Office Products) #206 in Hardcover Executive Notebooks"
            },
            {
                "name": "Date First Available",
                "value": "October 7, 2006"
            },
            {
                "name": "Theme",
                "value": "Book"
            },
            {
                "name": "Pages",
                "value": "64"
            },
            {
                "name": "Style",
                "value": "Ruled"
            },
            {
                "name": "Ruling Type",
                "value": "Faint Ruled"
            },
            {
                "name": "Special Feature",
                "value": "Soft Cover"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Cahier Journals are flexible paper companions for everyday notes and ideas. Available in handy packs of 3, they allow you to catalog and develop different projects, tasks and plans.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/9b38011a-b5c3-4e9c-8c74-9a1d404b0305._CR0,0,1920,594_PT0_SX970__.jpg"
                ]
            },
            {
                "media_text": "Cahiers are lightweight, flexible, everyday journals with customizable covers. Visible Singer stitching, natural colors and tactile raw cardboard add a handcrafted feel to your writing. The last 16 sheets are detachable and there is a pocket for loose notes.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/15fffcb4-157b-4027-80f1-af42352b2272._CR0,0,1996,1996_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0b6b9b26-98e0-422e-adc0-57efb5ec6130._CR0,0,1000,1000_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1555eb8f-e2fb-4646-a1e7-8f7dc2f8d2f9._CR0,0,1384,1384_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Cahier Journals Volant Journals Classic Notebook Collection PRO Collection Ideal For Note-taking, Journaling, A daily diary, Sold in packs of 3 or 4 Note-taking, Journaling, A daily diary, Sold in packs of 2 Note-taking, journaling, daily diary Increased productivity, Efficient note taking Layout Ruled, plain, dotted or squared Ruled or plain Ruled, plain, dotted or squared Custom professional layout Size Pocket: 3.5\" x 5.5\", Large: 5\" x 8.25\", XL: 7.5\" x 9.75\" XS: 2.5\" x 4.25\", Pocket: 3.5\" x 5.5\", Large: 5\" x 8.25\" Pocket: 3.5\" x 5.5\", Medium: 4.5\" x 7\", Large: 5\" x 8.25\", XL: 7.5\" x 9.75\" Large: 5\" x 8.25\", XL: 7.5\" x 9.75\", XXL: 8.5\" x 11\" Paper Grade 70 G/M² 70 G/M² 70 G/M² 100 G/M² Cover Type Flexible cardboard cover Soft cover Hard cover or soft cover Hard cover, Flexible cardboard cover Number of Pages Pocket: 64 Pages each, Large: 80 Pages each, XL: 120 Pages each, XXL: 120 Pages each XS: 56 Pages each, Pocket: 80 Pages each, Large: 96 Pages each Pocket: 192 Pages, Large: 240 Pages, XL: 192 Pages, Reporter: 192 Pages, Expanded: 400 Pages Large (Hard): 240 Pages, Large (Soft): 192 Pages, XL: 192 Pages, XXL: 192 Pages",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/ad49acdc-c5f8-47f9-ae3c-86842b6f4d2b.__CR1,0,1904,589_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9b38011a-b5c3-4e9c-8c74-9a1d404b0305._CR0,0,1920,594_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/15fffcb4-157b-4027-80f1-af42352b2272._CR0,0,1996,1996_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0b6b9b26-98e0-422e-adc0-57efb5ec6130._CR0,0,1000,1000_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1555eb8f-e2fb-4646-a1e7-8f7dc2f8d2f9._CR0,0,1384,1384_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6f516461-7ac2-4380-bc50-f8dc3ededbb9.__CR0,0,800,1600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/72b9eab4-3d51-4a00-88ef-6da382bfe53d.__CR0,0,800,1600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3dc3ba04-0676-4705-8685-a97f79ecefe4.__CR0,0,802,1603_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f2c77ec1-2ec1-4dfe-9712-e886f3a023f2.__CR0,0,800,1600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/914b5c2d-b464-4dbe-8db4-73c143ae9360.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Candid Reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE46WNJS3O6HQX3B6S55NKOYHJ5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAI8MU93KPFUH?ASIN=8883704894",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2013",
                "reviewTitle": "5.0 out of 5 stars As good as it gets for portable note-taking and budding authors",
                "reviewText": "Of all the many, many journals I've tried over the years, these Moleskine Cahier Journals are as good as it gets. You can find fancier journals with hard, leather-wrapped covers, gilded pages, and embedded illustrations or decorative scrollwork. You can find cheaper journals (like a spiral notebook). What you won't find is a more pocket- and travel-friendly journal than this.Each journal in this pack of 3 is slim enough to ride in your pocket or any briefcase/pack/purse. The pages are just large enough and lay so flat that you don't feel like you're writing on something as annoyingly small as a post-it note. The ruled lines help keep your thoughts flowing straight across the page, but are printed lightly enough that it works passably well for brief sketches as well. The last 16 pages are perforated so you can easily tear out a sheet to leave a note, reminder, or phone number/address for someone else. The cardboard cover is slim and durable enough to protect the pages from tearing, yet flexible enough to mold to your butt or the bulges in your briefcase/pack/purse.Yes, you can find fancier journals, but you won't find a journal you're more likely to take everywhere and always have on you when good ideas spring to mind. Authors, inventors, artists, theoretical mathematicians, and other obsessive or creative thinkers should never be without one of these. Highly recommended!",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caleb Matthew Radens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBNIQHQ3TODXKHMFPVHJLK2ZDOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M5UQOL1J5TQW?ASIN=8883704894",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2018",
                "reviewTitle": "5.0 out of 5 stars Durable, good quality paper, fits in a pocket",
                "reviewText": "I am a scientist and I carry one of these notebooks in my pocket 24/7. I love them, and would recommend them 100%.I really like the size. One of the drawbacks of a bigger notebook is that it has way too many pages and you can't find something important. I can dedicate one of these little notebooks to one conference, for e.g., and then label it and store it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stacey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPMPC2FROAWI7Q6FGD5BOVVYPJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UPQLU0SGUT9X?ASIN=8883704894",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2022",
                "reviewTitle": "5.0 out of 5 stars Pocket Perfect",
                "reviewText": "As someone sort of losing her memory, these pocket-sized Cahier Journals are the perfectly totable, passport-sized notebooks that serve as a sidecar for my brain. I can tuck one in my fanny pack and pinch it out during my walk to scribble down noticings and keep one in my purse for jotting down ideas, book/movie recommendations from others, and the occasional poem. The ruled lines are narrow, forcing me to write small, but each page has a generous 22 full lines (you can write seven Haiku!). While I’m not a list maker, I imagine this would be a perfect vessel for list-making enthusiasts. The paper is thin and yes, there’s a faint show-through if using a Bic. With a Flair, it’s a more prevalent show through, but I’m not bothered by it as it’s the cost of having such a wonderfully light journal to carry everywhere. The outer bindings of mine have curled at the corners, namely the cover’s bottom right hand corner, but that’s more because of my carelessness with sliding them into purse pockets, aforementioned fanny pack, and jean pockets. The paper is smooth when I rub it against my cheek. Just how I like it. The pocket on the back cover is perfect for receipts and fortunes from fortune cookies. As noted in the product description, the last sixteen pages are detachable, ideal for writing love notes to detach and slide under the windshield wiper of a lover’s car. Highly recommend this product.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sempervirens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQYP5EVZHJXVUS43MU3MITHQWXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YFNHP82HGVUG?ASIN=8883704894",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2014",
                "reviewTitle": "4.0 out of 5 stars more pages than Field Notes, and actual sewn binding",
                "reviewText": "These pocket notebooks are perfect for carrying always on one's person. It is the same size as a passport, and fits in a back pocket or shirt pocket (on male clothing, at least.)The paper is smooth and accepts ink well, and the cover is sewn on, unlike some other notebooks that are stapled. I'm not sure how much difference this makes in longevity.There is a pocket inside the back cover that doesn't quite along with the back cover, so the glue eventually fails and it just flops about, but it doesn't bother me enough to fix it yet with tape or glue.UPDATEI've gone through several of these now, and they hold up well. However, I think I'm moving on to a different type for two reasons:1. the paper is quite thin. This makes it fit well in the pocket, but if I use a rollerball or fountain pen there's significant ghosting through to the other side.2. there's slight feathering with the aforementioned inky pensMinor quibbles:1. very difficult to tell which side is the front when you pull it out of your pocket. I wrote in white paint-marker \"this side up\" on the cover, which I then varnished to prevent from rubbing onto my clothes.2. I like dot-grid paper better than lined because it affords more flexibility for making tables and diagrams. Moleskine doesn't offer this.My next pocket notebook will be Scout Books DIY Lined Notebook 12 Pack (3.5\" x 5\") with the dot-grid pages. I hear their paper is quite good. Slightly cheaper, too, if you buy them by the dozen.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Foster",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AET4XXU7PFU5RTYVHOELEC6Z467A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BRN73F61SA0G?ASIN=8883704894",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect size, great ruled spacing, and fits well into my leather cover.",
                "reviewText": "Love these little booklets. Perfect for capturing work notes and to do's lists. I have a leather binder cover that these fits perfectly in. Plus, the spacing on the lines is perfect for me... not the big grade-school spacing, nor is it too narrow... it's just right. Good stuff!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "zskinner1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNQLG2JTN4MI2EVAJYXBXCC4FGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKPPXQ1EAL69W?ASIN=8883704894",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Love Moleskine products",
                "reviewText": "Moleskine always good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cody L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELWMUNXSFFW2NQ6FA3OGP2ZDLTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R170GUKTWFGYKK?ASIN=8883704894",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2019",
                "reviewTitle": "5.0 out of 5 stars Perfect Little Pad",
                "reviewText": "This is the perfect little pad to store in your purse or in your back pocket. I always have one with me in case I need to write something down I do not want to forget, grocery lists, whatever! These are just great to carry around because of the perfect size, and I prefer pads with lines like this. They are sturdy enough, but won't last a lifetime in your pocket; it is still paper held together with threads.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martin A. Woodard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5NKB4RQ7253FNAQJXJRVDNL7HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R51Q262SXUWNR?ASIN=8883704894",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 17, 2016",
                "reviewTitle": "5.0 out of 5 stars Pricy but useful",
                "reviewText": "Honestly, these tiny books have always seemed pricey to me, but it's hard to argue with quality and usefulness. I always keep a stack on me for notes at job sites. They fit perfectly in a product I purchased a while back from Amazon listed as \"Italian Leather covers for your Pocket size Moleskine Cahier or Fields Notes Notebooks. Made in USA. (Color: Merlot)\" by \"Renaissance Art Leather\", so much so that I was going to include a link here, but it seems they've vanished from Amazon. Pity.Anyway, these books are exactly as advertised, and if those leather Moleskine covers ever come back, they make a perfect accompaniment.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jen Avila",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 9, 2022",
                "reviewTitle": "Lindo y pequeño",
                "reviewText": "Es pequeño, de bolsillo, justo lo que yo quería y necesitaba para mis ideas y pensamientos que de pronto necesito vaciar en algún lugar.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Felipe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 21, 2022",
                "reviewTitle": "Bom acabamento.",
                "reviewText": "Caderneta Moleskine é um excelente material pra quem gosta de produtos com bom acabamento e não liga para pagar por isso.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elliot & NeskaElliot & Neska",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 13, 2021",
                "reviewTitle": "Decent quality, stylish little notebooks. It's moleSKINE not \"mole skin\" 🤣",
                "reviewText": "Decent little set of pocket notebooks. Good size, nice quality, stylish and subtle looking. Pleased with my purchase! Better than the dollar store notebooks I've been using that fall apart in my pockets after a week of use. Nicely bound inside with thread, instead of stapled or ringbound. I like that the second half is perforated so i can rip out shopping lists and phone numbers without destroying the integrity of the notebooks. The flap on the back cover is a pleasant surprise too, useful for storing any torn out notes that need keeping. A handsome set of pocket notebooks that make me feel classier than when i was pulling out dollar store books for my note taking. I'm going to use these till they're full and then try Field Notes after to compare them and then I'll decide which brand to carry in the long run. But I am definitely a happy customer.Very confused about all the negative reviews though. Apparently people think Moleskine is more than a brand name and were expecting to get 3 notebooks bound in the skins of underground dwelling critters and were disappointed to receive normal notebooks? Its a brand name, not a description lmao and it's also moleSKINE (pronounced like mole-skeen) not moleskin anyway!Also the size and measurements are clearly given, it's very obvious that these are thin, pocket sized notebooks. If you're ordering things and not reading the description properly first that's your fault, not the product! Don't give bad reviews based on your inability to read the listing and reviews, ALWAYS research a product before pulling the trigger on it! Common sense folks.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81782GVjiRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/816G9oLsuRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81tkfqRDnVL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angelo77",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 25, 2024",
                "reviewTitle": "Perfetti per un viaggio o una conferenza",
                "reviewText": "Pratici, comodi, di ottima qualità, i migliori che abbia mai usato",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on January 9, 2024",
                "reviewTitle": "Prima notitieboekje",
                "reviewText": "Het papier voelt als goede kwaliteit, wat er fijn is om op te schrijven.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.91",
                "sellerName": "Prime Deals, USA",
                "sellerRating": "4.5"
            },
            {
                "price": "$10.84",
                "sellerName": "Preferred Pharmacy Plus",
                "sellerRating": "5"
            },
            {
                "price": "$11.60",
                "sellerName": "Direct Time",
                "sellerRating": "5"
            }
        ]
    }
}