{
    "remaining_requests": 4654,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Upgraded-Watch-Remote-Control-Racing/dp/B0CM3RMCX3",
    "body": {
        "name": "Upgraded 2023 Watch Remote Control Racing Car Toy for Kids - With Dustproof Cover and USB Charging - Mini Watch Car Toys Gift for Boys and Girls (Pink)",
        "price": "$8.91",
        "originalPrice": "$16.99",
        "rawPrice": 8.91,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Upgraded-Watch-Remote-Control-Racing/dp/B0CM3RMCX3",
        "soldBy": {
            "sellerID": "A35EQJK5WBXG15",
            "name": "BallDirect",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A35EQJK5WBXG15&asin=B0CM3RMCX3&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41lSVAQAeDL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41mLPYBQxnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iMIk2gOEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41A2szayxSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pnNz7ysAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Splc5AKWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51C3n6vHToL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: okoium",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=okoium"
        },
        "brand": "okoium",
        "merchantInfo": "BallDirect",
        "customerReview": "5.0 out of 5 stars",
        "customerReviewCount": 4,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 22 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🚗【Long Distance of Watch Remote Control Car】 The mini cartoon watch remote control car can be effectively controlled at a distance of 30 meters, with a wide range of infrared emissions and fast transmission. 2.4G independent signal, don't worry about being unable to control the distance. You can have fun in the outdoor area. For example, in the park, you can also compete with other children. This watch remote control car toy is the best choice.",
            "🚗【Power Battle Watch Car Toys is Easy to Control】This watch remote control car has an easy button setup, and with just one touch, the vehicle will automatically move forward or backward! It is Sensitive. The mini remote control car watch is suitable for many ages. Because its operation is very simple. A watch and a remote control car go together perfectly. Let the child carry the remote control watch car with them, the watch itself is the controller. This is very convenient for children.",
            "🚗【Watch Car Toy with Special Design】The watch car comes with a dust cover, which can be opened with one button to protect the car from damage. The watch remote control car is comfortable and skin-friendly, and the silicone strap can be adjusted at will, durable and safe. The mini remote control car watch toy is very comfortable to wear and very convenient. The tension of the strap can be adjusted at will. High-quality alloy material increases the durability of the watch car.",
            "🚗【USB Charging of Mini Remote Control Car Watch】This power battle watch car supports USB charging and has worry-free battery life. It can be connected to common USB devices such as socket power banks and computers to charge. The watch remote control car toy can be charged for 30-60 minutes before the first use, which is beneficial to the use of the car. The mini remote control car watch can last 5-6 hours per charge. You can let your kids play to their heart's content.",
            "🚗【Perfect Gifts 2023 New Watch Car Toy】This watch is the perfect birthday present for boys and girls. The package of this car watch includes 1 remote control car, 1 USB cable, 1 watch, 1 gift box, 1 screwdriver, and an instruction manual. A screwdriver can be used to install the battery, the battery uses a 1.5V, 3A battery. And watch car toys can use in the living room, park, road, etc. The remote watch car can be used. This environment did not affect the driving of the car."
        ],
        "description": "p>Why choose our watch remote control car？ Because our watch car is very portable. Just wear it on your hand. You can play whenever and wherever you want when you go out. The watch is the controller, which is very novel for children. How to use this watch remote control car toy？ 1. Insert the battery into the watch. 2. Charge the car before use. 3. Make sure the roller switch is in the OFF position, and after the indicator light goes out, turn the roller switch to the ON position. 4. Press the button of the watch, you can choose forward and backward to control the driving of the car. Package Includes: 1 *Car 1 * USB Cable 1 * Watch 1 * Screwdriver 1*Manual 1 * Gift Box",
        "breadCrumbs": [
            {
                "name": "Toys & Games",
                "link": "https://www.amazon.com/toys/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165793011"
            },
            {
                "name": "Vehicles",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=23539911011"
            },
            {
                "name": "Cars & Race Cars",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=23627234011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2 x 1 x 1 inches"
            },
            {
                "name": "Item Weight",
                "value": "7.8 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CM3RMCX3"
            },
            {
                "name": "Manufacturer recommended age",
                "value": "36 months - 3 years"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#169,522 in Toys & Games (See Top 100 in Toys & Games) #1,411 in Kids' Play Cars & Race Cars"
            },
            {
                "name": "Customer Reviews",
                "value": "5.0 5.0 out of 5 stars 4 ratings 5.0 out of 5 stars"
            },
            {
                "name": "Manufacturer",
                "value": "okoium"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}