{
    "remaining_requests": 12431,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Evenflo-Modular-Travel-System-Sandstone/dp/B071VHBYX8",
    "body": {
        "name": "Evenflo Pivot Modular Travel System with LiteMax Infant Car Seat with Anti-Rebound Bar (Desert Tan)",
        "price": "$293.20",
        "originalPrice": "$319.99",
        "rawPrice": 293.2,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Evenflo-Modular-Travel-System-Sandstone/dp/B071VHBYX8",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09XYMB6D1"
        ],
        "asinVariationValues": [
            {
                "asin": "B01M99JN9D",
                "variationName": "Color",
                "variationValue": "Casual Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/61rrUj3-zjL._SS36_.jpg"
            },
            {
                "asin": "B071VHBYX8",
                "variationName": "Color",
                "variationValue": "Desert Tan",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/61M+P8dUn6L._SS36_.jpg"
            },
            {
                "asin": "B07B1934C7",
                "variationName": "Color",
                "variationValue": "Dusty Rose",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/61chWxYeY8L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "560",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41FH6mSB sL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41MaOrHvIaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RQFoCIqHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aszclg XL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JX pExEBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51izltGby L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51C7o-UIT2L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9612ca6c-c63f-425a-ab1d-449b3571f64f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f1683b74-1a1e-4c3b-99ff-7c8f4396add3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/30a500bc-d2f0-5795-bbdb-1f0bc64f1d6c/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/925f924d-0109-43ff-9960-533d00261f1b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1c151110-c7cd-482d-8658-b24aa309919e/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b5e967ef-97af-42a1-a2de-fdb64090b456/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec1ed919-287d-4b22-b512-b98b79c99f43/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f0b55257-f7af-47cd-a5bf-25aab8c0a774/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 8,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91CQwp0ramL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91CQwp0ramL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Evenflo Store",
            "link": "https://www.amazon.com/stores/Evenflo/page/3C218481-6E42-408E-8D53-997BC89AEF18?ref_=ast_bln"
        },
        "brand": "Evenflo",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 14399,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Saturday, February 17. Order within 4 hrs 58 mins",
            "FREE delivery Wednesday, February 21. Order within 22 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Polyester",
            "Imported",
            "FLEXIBLE INFANT TRAVEL SYSTEM: The Evenflo Pivot Modular Travel System is a car seat and stroller combo featuring the SafeMax Rear-Facing Infant Car Seat and SafeZone Base with anti-rebound bar, infused with parent-and child-friendly accessories.",
            "VERSATILE and LIGHTWEIGHT: This car seat and stroller combo features a modular frame with 6 modes. The reversible mode permits your baby to face in or out, while the stroller coverts from an infant car seat frame to stroller seat or carriage mode with ease.Adult assembly required",
            "EASY INFANT CAR SEAT TRANSFER: This car seat and stroller combo has been designed with a stay-in-car base that allows for a quick and safe infant car seat connection from stroller to car and vice-versa.",
            "ADDITIONAL FEATURES: The Pivot Modular Travel System also includes an over-sized storage basket, a SafeZone base with belt lock-off system for correct installation, and large cruiser tires with tread and ergonomic handle for a smooth, effortless ride. A large canopy and removable arm bar make baby transfer easier and improve comfort."
        ],
        "description": "The Evenflo Pivot Modular Travel System is the multipurpose travel stroller you’ve been looking for. This exceptional carriage, stroller, and car seat combo is a durable travel system that includes the SafeMax Rear-Facing Infant Car Seat and SafeZone Base. The modular frame can be configured with up to 6 modes of use allowing your child to be parent-facing or forward-facing. While the stroller can easily convert to carriage mode, toddler mode, or a frame stroller with infant car seat. The toddler seat has a maximum weight of 50 lb, with height recommendations of up to 38 inch (96 cm), while the car seat has a maximum weight of 35 lb. and up to 32 inch. The SafeMax Rear-Facing Infant Car Seat is not only comfortable with a removable body pillow, it has been rollover and side-impact tested. It features an anti-rebound bar that limits the amount of rebound movement experienced in a frontal impact. Our integrated belt lock-off system provides peace of mind that the base has been securely and correctly installed. The Evenflo SafeMax car seat has been designed and tested for structural integrity at energy levels nearly two times the federal crash test standard. We’ve also tested this system to simulate a side-impact event and rollover event. Plus, it includes a stay-in-car base that allows for a quick and safe infant car seat connection from stroller to car and vice-versa. The feature-rich stroller includes cruiser tires to make it easy to navigate over multiple surfaces, a large canopy with a peek-a-boo window, an over-sized storage basket, removable arm bar with cup holder and snack tray, and convenient self-standing fold. For 100 years, Evenflo has been a trusted source of precision-manufactured, high-quality child-safety equipment engineered for real-life situations. Additionally, all Evenflo car seats and strollers include ParentLink customer-service perks, like real-time chat and free live video installation support.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Strollers & Accessories",
                "link": "https://www.amazon.com/Baby-Strollers-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=8446318011"
            },
            {
                "name": "Strollers",
                "link": "https://www.amazon.com/baby-strollers-tandem-jogger-double-triple/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166842011"
            },
            {
                "name": "Travel Systems",
                "link": "https://www.amazon.com/Travel-Systems-Strollers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=166849011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Evenflo"
            },
            {
                "name": "Seating capacity",
                "value": "1"
            },
            {
                "name": "Color",
                "value": "Desert Tan"
            },
            {
                "name": "Included Components",
                "value": "1 Stroller, 1 Car Seat, 1 Toddler Seat"
            },
            {
                "name": "Age Range (Description)",
                "value": "Infant"
            },
            {
                "name": "Model Number",
                "value": "56012477AZ"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 14,399 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#831 in Baby (See Top 100 in Baby) #2 in Baby Stroller Travel Systems"
            },
            {
                "name": "Assembly Instructions",
                "value": "Adult Assembly Required, No Tools Needed"
            },
            {
                "name": "Warranty Description",
                "value": "90-day-limited"
            },
            {
                "name": "Specification met",
                "value": "ASTM"
            },
            {
                "name": "Import Designation",
                "value": "Imported"
            },
            {
                "name": "Product Dimensions",
                "value": "34\"L x 25.5\"W x 47\"H"
            },
            {
                "name": "Item Weight",
                "value": "38.05 Pounds"
            },
            {
                "name": "Folded size",
                "value": "26\" x 19.5\" x 40\""
            },
            {
                "name": "Maximum weight recommendation",
                "value": "50 Pounds"
            },
            {
                "name": "Material",
                "value": "Polyester, Ethylene Vinyl Acetate, Cotton"
            },
            {
                "name": "Fabric Type",
                "value": "Polyester, Cotton"
            },
            {
                "name": "Frame Material",
                "value": "Metal"
            },
            {
                "name": "Care instructions",
                "value": "Do not lubricate or immerse in water any part of this child restraint, unless rinsing is permitted. Plastic and metal parts may be wiped clean with mild soap and water and dried with a soft cloth. Do not use abrasive cleaners or solvents. Take care not to damage any labels. The harness can be wiped clean with mild soap and water. Do not submerge the harness strap.To avoid damage to the buckle, do not clean the buckle with soap or detergents and do not use a lubricant."
            },
            {
                "name": "Harness Type",
                "value": "5 Point"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b86e3ad0-16ca-4a60-a977-9b48bede08f4.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2d5a5e7b-ea1d-42ed-87b2-16d9715f9f2b.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cc2a2ed3-a1a0-445c-b7ae-0f823912f761.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/539d35ea-93e2-4979-8882-bbda0359b000.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/406bed2d-dc50-4589-bbf4-d2d86f636c8f.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tania M. LoaisigaTania M. Loaisiga",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2CQ72ALCQRVPO6ZYZD2WSR473Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YYAJK48IZX34?ASIN=B071VHBYX8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2018",
                "reviewTitle": "5.0 out of 5 stars Great Stroller!",
                "reviewText": "This is my very first stroller that I bought for my baby boy which will be here in September. I bought it despite all the negative reviews, because I fell in love with it! I received it in two days, and the first thing I did was open it. My brother took everything out, but I assembled everything. I'm 7 months pregnant, and it was very easy to put together and especially very light-weight. Should I emphasize, it was very very easy to put together and the instructions were very clear and straightforward with images. I was almost going to buy the navy blue, but I read in one of the reviews that it didn't include a cover for the bassinet so I decided to go with the casual grey not knowing if it had it or not. That was the best thing that I did, because it did come with a cover! I tried it out of course without a baby on it, but the wheels seem to work fine (I will update later when I have my baby about wheel function). The wheels are plastic and rubber, so they will function better at hard floors and cement, but that doesn't bother me because I will buy a jogger when my baby outgrows this stroller (which is when he reaches 50 lbs). The base when folded stays put on the ground, which makes the transition between car seat and bassinet very practical. The car seat base seems to have all the safety features needed, and the car seat looks very comfortable for the baby. I also love that the car seat has a canopy to protect the baby from the sun. Overall I am very happy with the stroller and can't wait to use it. It's practical, lightweight, and very cute. I will update this review once I have my baby, but for now the stroller is a five-star!***Update***I've used this stroller now for 9 months now. The wheels occasionally squeak because, like I said, they are plastic and rubber. A little bit of oil and they are good to go. It's also kind of hard to use it on the grass, as you probably need bigger wheels for that. This I consider the only bad thing about the stroller.Here comes the important stuff that I've learned after becoming a mom. The car seat has good rear facing capacity. What does this mean? That your child can rear face for a very long time in it (which is more than 500% times safer). My son is 9 months and still has a good 2 more inches of being in the car seat (he's in the 98th % for height). It is also very light-weight so it's not incredibly heavy on my back especially with my big baby. I love that I can also protect him from the cold weather in this one as opposed to a convertible. The harness is very easy to tighten (pinch test), as opposed to my husband's Graco Snug. I would like for it to have an arrow on both sides for when using it without a base (for proper incline), but that's something I could live with.Now let's talk about the bassinet. OMG! I love the bassinet, especially with all the deaths from positional asfixia, a bassinet gives me such peace of mind. When I use it with my child sitting down and he falls asleep, I just quickly turn the bassinet into a little \"bed\" and my child doesn't need to have his head hanging, he can just sleep completely flat. I would never in a million years buy a regular stroller without this feature. The bassinet's canopy is huge, which I also love. The bassinet cover is also very useful when it's cold.The stroller has a good size basket for your belongings. Everything is lightweight and very easy to maneuver.The only con I do have to warn you with is that 9 months later, and I still can't manage to become a pro at clicking in the car seat to the frame. For some reason I find it very hard, but that can just be me.Overall, this stroller is still 5 stars and I would buy it again, but maybe in a lighter color because there can always be a bug on it and with the dark colors they're harder to see.Hope this review helps!",
                "reviewVotes": "1,327 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71WHkLItHSL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denise Tekay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENOJJSGL2AKKY53ZF2HAYTER2ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E54SHHJQABV7?ASIN=B071VHBYX8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars This is the cutest stroller",
                "reviewText": "Very easy to use and also light weight. I wanted a carseat and stroller that was very light for me, the color is a plus!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mario coplin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF5ENKUDRIEIB7T6BQ5BPUC6K5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN7ZAVOO5D9YS?ASIN=B071VHBYX8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect stroller",
                "reviewText": "This is such the perfect stroller. It comes with the carseat, carseat base, the stroller and even a bassinet to attach to the stroller. The color is super pretty and it pushes so smoothly. I love the carseat has newborn padding and I have never had any concern with my newborns safety in this carseat. The carseat base is easy to install and take out, lightweight and portable. The stroller collapses very well and fits in the trunk of a sedan. I would definitely buy this as a gift for somebody and highly recommend for others and their newborns. I’ve never had an issue with this stroller.!",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miamii",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFATCWGJ5KTPY7XFVIX7FL2JIJ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS10AK55TJRP2?ASIN=B071VHBYX8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing",
                "reviewText": "This stroller has like 10 different things you can do with it it’s perfect for toddlers or a baby the car seat can sit right in the stroller or you can take the car seat out and turn right into a bassinet it is very convenient for a baby if you are an outdoors person as I am your baby can just take a nap as you push him or her around it’s spacious it’s big and I love that it can carry a car seat be a bassinet and a seat it came with a little tray and cup holder for snacks and it has the storage sack at the bottom it is very comfortable easy to fold easy to remove the car seat from and all of the above it was not hard to assemble at all it gave very detailed directions for every single piece the car seat the stroller and the base the car seat is very very cozy looking and feeling as I am about to have a new born and I also have a toddler and this is perfect for both def a cute mommy must have I wanted a doona stroller untik I came across the combo set as your child will need a stroller for future use it’s absolutely amazing I highly recommend!!!",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cale",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD3BMN76EOQMPUUC4CED6ETC23A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBOUI60C9LEJK?ASIN=B071VHBYX8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Would buy this again in a heartbeat",
                "reviewText": "I bought this system for my 4th child, and I wish I had it for all of my children. It is by far my favorite stroller I’ve ever used. It feels luxurious, but for a reasonable price. I bought this over a year ago, so I’ve been using it a long time and I’m still very pleased. I’ve gotten many comments from people saying they loved my stroller and where did I get it. I’m also very happy with the car seat. It washes up well and the padding is still nice and full. My only complaint would be that I sometimes I have a hard time snapping the car seat onto the stroller, because if you don’t line it up just right it kind of gets jammed. I don’t have a problem putting the stroller attachment on, just the car seat. Even with that slight issue I would buy it again. Absolutely love it! Also, my husband is 6ft tall and I’m 5’7” and this stroller is the perfect height where we don’t feel like we have to slightly bend over to push it.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LeilaMarie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPIVODRTC5V7Z4XXY4OVCTXY4SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DVXDJLFTYHNX?ASIN=B071VHBYX8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "4.0 out of 5 stars Good enough, but…",
                "reviewText": "I truly love this stroller, the bassinet feature is super handy and allows my baby to sleep comfortably. The car seat is easy to work with, the basket underneath could use a little more coverage in the front so things don’t accidentally fall out but it’s manageable. As many people have said in previous reviews the wheels do squeak after some use, in my case it was 2 months after initial use, I contacted customer service and their suggestion for how to fix the issue was to take the wheels off and lubricate them and the hinges with vegetable oil base lubricants or natural lubricants. Customer service said that vegetable oil cooking spray would work but to NOT use WD40 since it has not been tested for safety. Personally I put Vaseline on mine last night, I strolled around the house and it seems to have worked but when I go out later I will know more and update this post if needed. Overall is a pretty good stroller, not really convenient if you travel by mass transit a lot specially alone since it is bulky but if you use a baby carrier you can easily close the stroller to get on the bus(I live in NYC) but not necessary to close it when getting on the subway. It would be great if this came with a rain cover but not a deal breaker. All in all I truly like this stroller and so does my daughter and if the lubrication of the wheels gets rid of the squeaking I will be a very happy camper",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "IsraelIsrael",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 27, 2023",
                "reviewTitle": "Muy buens compra",
                "reviewText": "Tal cual la descripción, por el precio es una excelente carriola, se maneja muy cómoda, y que puedas cambiar los asientos me encanta, es muy bonita, no es tan compacta como algunas pero tampoco tan bultosa, para mi está excelente",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71EO7LFPWbL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karla Guzman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 21, 2021",
                "reviewTitle": "Excelente",
                "reviewText": "Llegó antes, súper bien. Esta preciosa y dura muchos años",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "g4ghosh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 8, 2022",
                "reviewTitle": "Super Impressed",
                "reviewText": "Rightly said by someone its like a Mercedes comparing others in this segment.Got it in much reasonable price 19+K considering the product quality + car seat.*** Its little bigger in size",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Astrid r.Astrid r.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 24, 2024",
                "reviewTitle": "Muy práctica",
                "reviewText": "Me encantaaaa! Es una carreola que voy a usar por varios años, ya que se adecua a cada etapa del bb y lo mejor es que incluye todo. El precio es Justo a la calidad y función del producto.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ssStbriKL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kiran",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 20, 2022",
                "reviewTitle": "Best Stroller",
                "reviewText": "One of the best stroller along with car seat in market with reasonable price. GO FOR IT!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}