{
    "remaining_requests": 12344,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Chicco-Bravo-Travel-System-Orion/dp/B01CSECET0",
    "body": {
        "name": "Chicco Bravo Trio Travel System, Orion",
        "price": "$399.99",
        "originalPrice": "",
        "rawPrice": 399.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Chicco-Bravo-Travel-System-Orion/dp/B01CSECET0",
        "soldBy": {
            "sellerID": "A38DHFORO807W2",
            "name": "AlbeeBaby",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A38DHFORO807W2&asin=B01CSECET0&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B093WQB5NF"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/5117S21SyJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61b8lPA4GIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ntR yWJhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AwY9v0VTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SazVB1I0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61JZxV2QJEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jTDmIMQPL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/14feddb0-a58a-59d0-8848-e80d8b75f901/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/2926d10c-2b07-51c3-b4ff-dde25d2f8579/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/af59d481-afb4-5d51-87f5-23e4afa92319/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f55df86-05bb-4d0a-88ab-99d206c19bed/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/949d2983-d448-42ca-b1a8-9231658c854c/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 5,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1oAIV4Sc2S.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1oAIV4Sc2S.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Chicco Store",
            "link": "https://www.amazon.com/stores/ChiccoUSA/page/A25B0B54-B141-4044-A620-132B49904E7C?ref_=ast_bln"
        },
        "brand": "ChiccoUSA",
        "merchantInfo": "AlbeeBaby",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 4286,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 21 - 22."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Polyester",
            "Imported",
            "The Chicco Bravo Trio System Includes Bravo Stroller, Key Fit 30 Infant Car Seat and Base",
            "Stroller features a removable seat for easy transformation into a stylish frame carrier for the Key Fit. A gorgeously woven jacquard in a delightful polka dot pattern is paired with warm grey and delicate pink accents, creating a feminine look that is oh-so-inviting",
            "Stroller features 1-hand fold, auto-positioning wheels and a self-standing compact folded position.Care & Cleaning: Hand Wash",
            "Stroller includes a convenient parent tray with storage and cup holders. Usage: For Children up to 50 pounds",
            "Designed exclusively for use with Chicco Key Fit 30 Infant Car Seat. For infants from 4 to 30 pounds and up to 30 inches in height"
        ],
        "description": "For older babies and toddlers, the Chicco Bravo Quick-Fold Stroller features a multi-position reclining backrest, five-point harness, child tray with two cup holders, and large adjustable canopy. For younger babies, the Bravo Stroller accepts the Chicco KeyFit 30 Infant Car Seat with click-in attachment via the child tray. The stroller seat and backrest detach easily in one piece, along with the canopy, leaving behind a lightweight frame stroller for the car seat. It's just as easy to reattach so older babies can switch back and forth between car seat and stroller seat. When it's time to close the Bravo Stroller, the seat cushion lifts to expose a fold handle. The handle engages easily with one hand, activating the fold and simultaneously rotating the front wheels inward to keep the stroller standing for easier maneuvering and storage. Once the stroller is closed, the fold handle doubles as a carry handle. Full suspension and front swivels make it easy to maintain a smooth ride in every configuration. One-touch brakes keep the stroller in place when parked. A height-adjustable handle, parent tray with two cup holders, and large storage basket provide added convenience for mom or dad.The Bravo Trio Travel System includes the No 1-rated Chicco KeyFit 30 Infant Car Seat, which accommodates infants from 4 to 30 lbs and up to 30inch. The KeyFit 30 is the easiest infant car seat to install simply, accurately, and securely every time. • Includes the No 1-rated Chicco KeyFit 30 Infant Car Seat• Detachable stroller seat/canopy leave behind a lightweight frame stroller• Innovative fold/carry handle for a one-hand, free-standing quick fold • Includes child tray with 2 cup holders• Multi-position reclining backrest for added comfort• Large, adjustable canopy provides shade• Parent tray with 2 cup holders and storage compartment • Padded push-handle with 3 height positions • All-wheel suspension and front swivels for a smooth ride • One-touch, linked rear brakes for parking • Large storage basket.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Strollers & Accessories",
                "link": "https://www.amazon.com/Baby-Strollers-Accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=8446318011"
            },
            {
                "name": "Strollers",
                "link": "https://www.amazon.com/baby-strollers-tandem-jogger-double-triple/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166842011"
            },
            {
                "name": "Travel Systems",
                "link": "https://www.amazon.com/Travel-Systems-Strollers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=166849011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Chicco"
            },
            {
                "name": "Seating capacity",
                "value": "1"
            },
            {
                "name": "Color",
                "value": "Orion"
            },
            {
                "name": "Included Components",
                "value": "2 Removable Cup Holders, Car Seat Base, Rear-Facing Infant Car Seat, Car Seat, Stroller Cover/Canopy, Stroller"
            },
            {
                "name": "Age Range (Description)",
                "value": "Baby"
            },
            {
                "name": "Model Number",
                "value": "04079761510070"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 4,286 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,012 in Baby (See Top 100 in Baby) #22 in Baby Stroller Travel Systems"
            },
            {
                "name": "Assembly Instructions",
                "value": "Adult Assembly Required, No Tools Needed"
            },
            {
                "name": "Warranty Description",
                "value": "1 Year Limited Warranty"
            },
            {
                "name": "Import Designation",
                "value": "Imported"
            },
            {
                "name": "Product Dimensions",
                "value": "43\"L x 35.5\"W x 21.75\"H"
            },
            {
                "name": "Item Weight",
                "value": "18.97 Kilograms"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "30 Pounds"
            },
            {
                "name": "Rear Facing Minimum Weight",
                "value": "4 Pounds"
            },
            {
                "name": "Rear Facing Maximum Weight",
                "value": "4 Pounds"
            },
            {
                "name": "Material",
                "value": "Plastic, Metal"
            },
            {
                "name": "Fabric Type",
                "value": "Polyester, Polyvinyl Chloride"
            },
            {
                "name": "Frame Material",
                "value": "Aluminum"
            },
            {
                "name": "Care instructions",
                "value": "Spot or Wipe Clean"
            },
            {
                "name": "Harness Type",
                "value": "5 Point"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Converts to Frame Stroller Stroller seat is removable to create an ultra lightweight car seat carrier. Adjustable Comfort Reclining backrest with 3 positions for child comfort and adjustable, removable canopy. Storage Basket Large basket accommodates toys, snacks and other on-the-go essentials. Includes a KeyFit Infant Car Seat Car seat clicks directly into stroller seat or empty frame via the child tray. Bravo Travel System includes a KeyFit 30 car seat. Bravo LE Travel System includes a KeyFit 30 Zip car seat. Parent Tray Easy-grip, adjustable handle with 3 positions plus 2 cup holders and storage. Bravo LE features a zippered storage compartment. Reversible Cushion Feature on Bravo LE and Bravo Primo, seat cushion with reversible knit and mesh fabrics to provide all-season comfort.",
                "media_link": []
            },
            {
                "media_text": "KeyFit 30 Car Seat Included KeyFit 30 Zip Frame Stroller Use Adjustable Handle Premium Parent Tray Premium Seat Cushion Extended Canopy KeyFit 30 Car Seat Included KeyFit 30 Frame Stroller Use Adjustable Handle Premium Parent Tray Premium Seat Cushion Extended Canopy",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/4bac3b92-5944-414e-97f4-caa749c7c200.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1bd9cc2e-9324-459f-998a-707f06b41a5c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b92564b2-18e6-4647-8122-b27035557a87.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1615a94e-c9ad-4487-80b1-f57e89c5ffa8.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1f68f166-21a9-4e0a-b149-6fa2027348f2.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/887311db-0e06-4179-8e35-71660252ebfa.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/eb480456-4d14-4ec5-a1f7-77d9703e881c.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/67ded57a-a42f-42fe-8797-f43cb6ff28be.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/20baf710-104f-4533-97ba-8d2108da725e.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d10bc9aa-60af-4964-85d9-c78458b9712a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bd025ce0-d091-4d29-af62-fa54a84d3ca7.__CR0,0,488,700_PT0_SX488_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fb8cb34e-24f3-4c25-8e86-26560b164db1.__CR0,0,488,700_PT0_SX488_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6RSL7GXQCUU2P346IE4RWGGJMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBRFDBMOPPV4Y?ASIN=B01CSECET0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 5, 2015",
                "reviewTitle": "5.0 out of 5 stars Best Travel System",
                "reviewText": "I am so glad my wife and I bought this travel system. We are first time parents and were overwhelmed with choosing between the numerous different car seats and strollers. We were about to buy a much more expensive travel system ($1500), when we came across the Chicco Bravo. It has just about every feature that the more expensive systems had and then some.Set up of the system took no more than 20 minutes and was very easy to accomplish. Once set up, my wife and I started to play with it to see how easy it was to fold it up and then put it back together. IT COULDN'T POSSIBLY BE EASIER. With a single hand you can collapse the stroller and have it ready to stow away. Even better is the weight. We were in stores every weekend playing with different travel systems and none of them were as easy to manipulate or as light weight as the Chicco Bravo. The weight was a big concern for us and was the reason we held out on some of the higher end travel systems. With the Bravo, my wife and I can easily lift the stroller into the back of our truck or SUV with no problem.The car seat base was also extremely easy to set up. I went out to my truck expecting it to be complex and time consuming, but it took me less than 5 minutes. The car seat easily secures into place and with the pull of a latch it easily comes out. Our little girl appears to be very comfortable in this seat and I feel at ease knowing she is secured in a high quality car seat.The stroller rides are smooth and we have no complaints. There are numerous accessories with this travel system that make it even better, but since I know anyone reading this has probably read up on all the specifics, I won't list them all here.I highly recommend this travel system to other parents. My wife and I were prepared to spend a lot more money on one, but after spending hours in different baby stores, we felt this was without a doubt the best buy.***UPDATE MAY 2015***The travel system continues to make my wife and I happy about our decision. We use it on a regular basis and it has held up great. We have not had any issues and parents with other travel systems have commented on how they wish they would have purchased the Chicco Bravo. It does everything that many of the overpriced systems do, and in my opinion, it is better in many ways.",
                "reviewVotes": "707 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Virginia Houk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENMNINNLO74N7W2M4ZSSJRYQRWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWQBZLB5CRFNG?ASIN=B01CSECET0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2016",
                "reviewTitle": "5.0 out of 5 stars A+ Safety and Length of Use = Amazing Product",
                "reviewText": "I don't think there is a way I can convey how much I'm glad I own this system. We are living in Japan for the next few years and I even had it shipped here because I like it so much. I did a lot of research before purchasing this, and I've been so happy with it for so many reasons. I don't have a single con, so I suppose I'll just list the pros:- With the base, the car seat is so easy to install and give you peace of mind that you've installed it correctly. We've installed it both with a seatbelt and with the latch system and both ways were so easy. There are even instructions on the base itself as to where everything is supposed to go, but I highly recommend reading the instructions too. The best part is the two small bubble levels on each side showing you exactly the angle the base needs to be at when secured. Also, as if this wasn't easy enough, there are also so many videos on YouTube showing how to install this. While you don't get the levels to confirm your proper installation when you use the carseat without the base, this too is very easy and very secure.- The stroller is fantastic too. We've only used the \"car seat holder\" version of it and have yet to reattach the extra visor or the seat, but even so it's been such a great product. It was easy to put together right out of the box. It doesn't take up too much space in the trunk (I know. I'm driving a teeny Mazda Demio over here in Japan). It collapses and reforms with the use of one sliding piece. And on top of all that, it's quite sturdy.- I love the basket at the bottom. It's been perfect when we go shopping, and for storing our daughter's diaper bag.- It's going to be used for a long time. Granted our daughter is already over 17.5 pounds, but this car seat is rated up to 30 pounds (less than the average weight of a two year old) so the money spent on it was indeed a great investment.- Safety. This is the number on reason I bought this travel system. The car seat ranks consistently high on Consumer Reports (in the top five) and the the seat is also approved for use on airplanes, which was a must for us since we have trans-pacific flights at least twice a year. On top of this, it's rear-facing—all the way up to 30 pounds (which will take your child into their second year)—which is more in line with the current safety recommendations.I've loved this so much that my friend here in Japan is now looking for a way to get her own Chicco Bravo Trio Travel System all the way over here, too.Okay, one small con: I wish the stroller had a way to stay locked in the collapsed position, especially since we plan to put it in checked luggage soon when we go home for the holidays. But we bought two velcro bands that solved that problem for us.We are using it on our first loooong plane trip next week, so I'll update this accordingly.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 23, 2021",
                "reviewTitle": "Extraordinaria",
                "reviewText": "Precio, practicidad, todo super seguro, excelentes materiales y resitencia, ligera, simplemente muy a gusto con la compra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Helga Diaz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 31, 2019",
                "reviewTitle": "Excelente",
                "reviewText": "Excelente carriola. Fácil manejo y muy bonita.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rain",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on June 9, 2020",
                "reviewTitle": "Very useful",
                "reviewText": "Nice",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lokesh Prasanna Kumar Sahadevan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 16, 2017",
                "reviewTitle": "Good quality but overpriced",
                "reviewText": "Very good product really can feel the difference between chicco available in India and imported. Only negative part was that product was couriered with original pack with no extra cover which would result in product damage if you are unlucky. Overall Product quality is awesome but overpriced",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Román F.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 30, 2018",
                "reviewTitle": "Fácil de armar",
                "reviewText": "Muy satisfecho. Como cualquier producto que tienes que ensamblar, cuando lo sacas del paquete parece complicado pero, si te tomas unos momentos para leer las instrucciones debidamente, armas la carriola bastante fácil y rápido. La carriola y asiento en sí son bastante prácticos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}