{
    "remaining_requests": 12390,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Maxi-Cosi-Pria%C2%AA-Convertible-VentMax-System/dp/B0CG9THLPH",
    "body": {
        "name": "Maxi-Cosi Priaª Chill All-in-One Convertible Car Seat with VentMax Fan System to Help Keep Baby Cool, Chill",
        "price": "$399.99",
        "originalPrice": "",
        "rawPrice": 399.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Maxi-Cosi-Pria%C2%AA-Convertible-VentMax-System/dp/B0CG9THLPH",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41PEF5OBXRL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51JuCEjddZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61Qsc0RUCqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mOGGBfTlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hTMonMqVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RSe5TdMZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FYX0NVmmL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b2522a4-f635-4773-bfe5-c5160778ba42/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9337cfdb-a759-44d9-8c7b-fa7a809f5e98/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c5085ff0-44d9-4060-bc28-931fbf00cdb8/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bdf4e2b6-74c4-4970-bc0a-31a8059c5583/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Maxi-Cosi Store",
            "link": "https://www.amazon.com/stores/Maxi-Cosi/page/FB35509B-C57F-495C-BAEB-5420117C25F1?ref_=ast_bln"
        },
        "brand": "Maxi-Cosi",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 17,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22. Order within 22 hrs 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "NEW PRIA CHILL WITH VENTMAX TECHNOLOGY Help your little one stay comfortable on warm days. VentMax is an integrated automatic fan system with specially designed sensors that engage fans to circulate air when the temperature rises.",
            "THE COOLEST CAR SEAT IN TOWN Special open-cell padding and soft, breathable mesh fabric allow air to circulate around your child (2 fans in the lumbar area, 1 in the headrest) to enhance airflow and comfort, because a comfy baby means happier car rides.",
            "WE SWEAT THE SMALL STUFF VentMax fans are water resistant (don’t worry about spills), quiet, and can be turned on/off manually. System shuts off when vehicle is off. Power cord is designed to stay out of the way. Indicator light shows when fans are on.",
            "A CAR SEAT TO LOVE FOR YEARS TO COME 3 modes of use to grow with your child. All-in-one convertible car seat: rear-facing (4–40 lbs. and 19\"–40\"), forward-facing (22–65 lbs. and 29\"–49\"), and belt-positioning booster (40–100 lbs. and 43\"–52\").",
            "PURE COMFORT, PURECOSI Soft, plush cushions and fabrics for the ultimate, comfy ride. PureCosi fabrics are made without wool or added fire-retardant treatment––better for your child and our planet. All fabric cushions are machine-washable and dryer-safe.",
            "FUSS-FREE IN-AND-OUT Pria Chill’s easy in-and-out harness holders keep straps from getting in the way when you put your little one in the car seat and take them out, and the ClipQuik Magnetic Chest Clip promotes struggle-free buckling.",
            "COMFORT AND SECURITY FROM THE FIRST RIDE Plush infant pillows, plus a soft, removable wedge pillow for smaller babies (from 4–10 lbs.), keep little ones snug and secure. Easily removable for cleaning or when baby no longer needs the added support.",
            "FAST 1-HANDED HEIGHT ADJUSTMENT Customize the fit for your growing child with ease. QuikFit is our integrated headrest and harness system made to adjust swiftly, so you can set the proper position and get on your way. No rethreading the harness needed.",
            "SIT BACK—ENJOY THE RIDE ReclineFit lets you pick from 3 reclining positions for your little one, for a relaxing ride wherever you go. And since each vehicle has slight variations in the design of their back seat, ReclineFit also makes installation easier.",
            "ADDITIONAL FEATURES YOU’LL LOVE Side Impact Protection (SIP). 2 removable, dishwasher-safe cup holders. 1-click LATCH connectors for simple, secure installation."
        ],
        "description": "Meet the coolest car seat in town, the new Pria Chill with VentMax technology. The first-of-its-kind Pria Chill will help keep your little one comfy in their car seat. VentMax is an integrated automatic fan system with specially designed sensors that engage fans to circulate air when the temperature rises. Special open-cell padding and soft, breathable mesh fabric allow air to circulate around your child (2 fans in the lumbar area, 1 in the headrest) to enhance airflow and comfort. You’ll know the VentMax fans are engaged when you see the automatic indicator light. The VentMax system is also water resistant (don’t worry about spills!), super quiet, and shuts off when the car power port does. Our innovative all-in-one convertible car seat will be part of your family for years in 3 modes of use: rear-facing (4–40 lbs. and 19\"–40\"), forward-facing (22–65 lbs. and 29\"–49\"), and belt-positioning booster (40–100 lbs. and 43\"–52\"). Pria Chill also features soft, premium PureCosiTM fabrics, QuikFit for easy harness and headrest adjustments, and removable infant support pillows to keep little ones secure and comfy. Easy in-and-out harness holders keep straps from getting in the way when you put your little one in the car seat and take them out, and the ClipQuik™ Magnetic Chest Clip promotes struggle-free buckling.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Car Seats & Accessories",
                "link": "https://www.amazon.com/baby-infants-car-seats-booster/b?ie=UTF8&node=166835011"
            },
            {
                "name": "Car Seats",
                "link": "https://www.amazon.com/Car-Seats/b?ie=UTF8&node=1272297011"
            },
            {
                "name": "Convertible",
                "link": "https://www.amazon.com/Convertible-Car-Seats/b?ie=UTF8&node=166839011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "‎34.5 x 20 x 30.5 inches"
            },
            {
                "name": "Item model number",
                "value": "‎CC317HCN"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "‎100 Pounds"
            },
            {
                "name": "Material Type",
                "value": "‎Polyester"
            },
            {
                "name": "Number Of Items",
                "value": "‎1"
            },
            {
                "name": "Number of reclining positions",
                "value": "‎5"
            },
            {
                "name": "Batteries required",
                "value": "‎No"
            },
            {
                "name": "Orientation",
                "value": "Forward Facing"
            },
            {
                "name": "Rear-facing minimum child weight",
                "value": "‎4 Pounds"
            },
            {
                "name": "Forward-facing maximum child weight",
                "value": "‎65 Pounds"
            },
            {
                "name": "Harness type",
                "value": "‎5-Point"
            },
            {
                "name": "Item Weight",
                "value": "‎22.8 pounds"
            },
            {
                "name": "Country/Region of origin",
                "value": "‎USA"
            },
            {
                "name": "ASIN",
                "value": "B0CG9THLPH"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 17 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#47,381 in Baby (See Top 100 in Baby) #90 in Convertible Child Safety Car Seats"
            },
            {
                "name": "Brand",
                "value": "Maxi-Cosi"
            },
            {
                "name": "Installation Type",
                "value": "Latch"
            },
            {
                "name": "Material",
                "value": "Polyester"
            },
            {
                "name": "Color",
                "value": "Chill"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/b1875882-39e4-49e7-9a3e-6c624a5f8875.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/227f94d7-ec67-46f2-b9c3-e169434b5848.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/34fa022f-fb71-4088-9c03-44f19f2beae5.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/87d9724b-b715-425a-9b99-a3353f8b5fad.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1beafdbb-2393-48f7-96ec-3a3b1f4cd6fa.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "E_The_Real_Dragon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ54UXEFAB43SG5MDQ7TXCYC6QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ECC4BJ6O8211?ASIN=B0CG9THLPH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Wow! thats a nice looking car seat!",
                "reviewText": "My children are growing fast and my youngest is in a booster seat now. I had a pair of Diono 3RXT seats that we used (1 in each car) for years. I kept one \"just in case\". Well now my sister in law has a baby and we watch her 1 day per week. I pulled out the old Diono, but it is very heavy and going back and forth in and out of the car has been a pain so I started looking for a new Carseat when I came across this one.I had never looked at Maxi-Cosi before now. I must say that I am impressed. This seat has all the beels and whistles in terms of safety and comfort. The 2 built in cup holders are made from rubber and are flexible on top. Not a huge deal, but it your child ever slammed his knee into one while getting in the car seat, then youy understand why this is very cool. The padding on the seat is quite thick, especially in the safety areas such as the side impact portions ar the top. My older seat was also padded but it had about 3/4\" foam insert (I know because I took it apart and power washed it last week). This one has padding more like a pillow in all the main areas where your childs body will contact it. Beyond the comfort padding, the areas where its just cloth over frame still has about 1/2\" memory foam over it. I wish the bucket seats in my van were this soft.It is just a very well thought of and created car seat. Currently it is winter here in the panhandle, and so I do not have the opportunity to try out the fan portion of the seat. This thing has built in fans to push air thru the cushions when the ambient temp is hot. Meaning summertime when the car and seat is hot, as long as youy have it plugged into power outlet (it comes with a long cable), it will be cooling the seat as soon as you turn car on, independent of the vehicle AC...I know my niece will be bugging her mom to rude in Auntie's car next summer when temps rise...Overall, I give this seat 5 stars and would recommend even without the cooling function.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MDCMDC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAPYWIUD2I3XWI4UWY7AOTZEMRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20C8H94TI60HS?ASIN=B0CG9THLPH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Very cushioned car seat. Nothing special to make installation easier.",
                "reviewText": "This car seat has a lot of cool features (no pun intended) that make it great but also has some room for improvement, particularly in the installation department.I'll start off with the cool features:1) It has plastic tabs that can hold the straps out of the way to make it easier to put your child in the car seat. This is especially helpful if putting in a newborn and you need to be holding them in two hands while lowering them into the car seat.2) It has an infant cushion as well as infant neck pillow and infant back rest. The infant cushion elevates them and due to this feature, I see why it claims to go as low as 4lbs. This is the only convertible car seat I've used where I'd actually feel comfortable putting a newborn in it (however, it doesn't recline as much as other's I've seen).3) The cooling feature is unique and solves a problem that is often an issue for kids in car seats – getting sweaty. Unfortunately my car doesn't have a rear 12v outlet (aka cigarette lighter outlet) and the only one I have is in my center console. I don't want to close the center console on the cord and damage it so I effectively cannot use this feature.4) This is one of the most cushioned car seats I've seen and the materials are very plush, so you shouldn't have any comfort issues in this car seat.Now, onto the things I don't love:1) The cupholders are small (the smallest I've seen in a car seat so far). The small water bottle I got to fit in my son's other car seat doesn't even go half an inch down into this cupholder.2) There are no features that make installation easier. Graco, for example, has their SnugLock system/belt lock off which helps you get a tight installation. With this, you're reliant on your own strength to push the car seat down while pulling the car's seat belt tight. As an 105lb woman, I cannot get the seat belt or the LATCH system close to tight enough for a proper installation. This installation method is the typical one but at this price point I'd expect something to make it easier. I wouldn't recommend this car seat if you think you'll need to install/uninstall it more than once a year and don't have a very strong person to install it.3) An interesting installation quirk about this car seat is that in rear-facing mode it requires the car seat touch the back of the passenger or driver's seat if it's behind one of those seats (which they say is the preferred installation location). Depending on the person in the front seat, this could severely limit how your car's seat can be positioned.4) This car seat only has three recline positions where as the Graco models I've tried have six.Overall, this is a great car seat with some nice features, but it lacks in the installation department.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719zTNMFH8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71M6iHKVAHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71MYEFqP8IL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ujMd8OqgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81WvQ9N6QxL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan and Asjla",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQDY7VECAFJXLD6EBDHZGU6OM4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7NPR8ANYJ1AD?ASIN=B0CG9THLPH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars A built in FAN!!",
                "reviewText": "I love that this car seat has a built in fan, which is especially handy for rear facing babies who otherwise don’t get much air blowing on them. The material is very soft and nice quality. Definitely a luxurious car seat! Highly recommended",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELHDIEV3ASKDGMKJ3MPTXW4RBGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1304NI2YKGMNJ?ASIN=B0CG9THLPH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Royals Royce of car seats",
                "reviewText": "This seat is great. I received it during the middle of the week, so I left it in the living room, on the floor. My 2 and 1 year olds were fighting to sit in this thing because of how how comfortable it is. My 2 year old, being bigger and stronger won, and sat in this seat for a solid hour like it was a recliner. I eventually installed it in the actual car and it fits well. I tried installing with the anchor system, but the latches are so large, that they end up getting in the way of the base of the seat, which is also pretty large. So I just used my cars seat belt to secure the seat down. I'd say it takes up slightly more space than the average car seat. The only concern I have, is that my 2 yr old fiddles with the magnetic top latch after watching me unbuckle it and understands the concept. I'm afraid that once she develops a little more dexterity and strength, she might be able to undo the latch herself. Time will tell. Otherwise, this is a really nice seat and would recommend, especially since Maxi-Cosi offers discounts for teachers, veterans, etc. at the time of this writing.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY6FKTMTFIEATQ5ZGJSAUSDIK5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAYWOEUF6WRFW?ASIN=B0CG9THLPH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Very impressive cart seat",
                "reviewText": "This car seat fits my 1.5year old extremely well. He seems to be comfortable sitting it. It is easy to clean, as he seems to like making messes like any other kid. It is definitely built to last. With our last car seat, it was a huge deal getting it mounted to the seat. This car seat was very easy to install all by myself. I expect that during the summer it will be nice with the cooling effect. Having a car seat like this brings me piece of mind that if I was in an accident our baby would be safe. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$399.99",
                "sellerName": "Kidsland",
                "sellerRating": "3"
            },
            {
                "price": "$399.99",
                "sellerName": "PishPoshBaby",
                "sellerRating": "4.5"
            },
            {
                "price": "$399.99",
                "sellerName": "Little Folks",
                "sellerRating": "5"
            }
        ]
    }
}