{
    "remaining_requests": 12503,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Evenflo-Tribute-Convertible-Seat-Saturn/dp/B006PB2B6O",
    "body": {
        "name": "Evenflo Tribute LX 2-in-1 Lightweight Convertible Car Seat, Travel Friendly (Saturn Gray)",
        "price": "$79.99",
        "originalPrice": "",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Evenflo-Tribute-Convertible-Seat-Saturn/dp/B006PB2B6O",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLGPMYDQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B07DNPVCF2",
                "variationName": "Color",
                "variationValue": "Jupiter Red",
                "price": "$79.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41SP0v3iv+L._SS36_.jpg"
            },
            {
                "asin": "B00O8RRYDW",
                "variationName": "Color",
                "variationValue": "Neptune Blue",
                "price": "$79.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/11w3Upx9V1L._SS36_.jpg"
            },
            {
                "asin": "B006PB2B6O",
                "variationName": "Color",
                "variationValue": "Saturn Gray",
                "price": "$79.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01WHkdGw2aL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41 nu85N94L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41htMDadzkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410afLLiCIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41z2mpnT9YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hucSXanzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41w1Q4VWGLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61B7EL4W0HL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f82e0d36-2898-476d-bbd1-4d857a2231a4/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/724e91cc-fa1f-58fd-9520-165f68cb0c3f/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b1baa0e2-885a-4737-a224-82e73785f602/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1-7h9VmqxL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1-7h9VmqxL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Evenflo Store",
            "link": "https://www.amazon.com/stores/Evenflo/page/3C218481-6E42-408E-8D53-997BC89AEF18?ref_=ast_bln"
        },
        "brand": "Evenflo",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 9171,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Saturday, February 17. Order within 9 hrs 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% Polyester",
            "Made in the USA and Imported",
            "MEET THE HIGHLY REVIEWED CAR SEAT WITH UNBEATABLE VALUE: This fan- favorite offers a budget-friendly choice without sacrificing safety, comfort or ease",
            "TRAVEL SLEEK AND LIGHT: Compact design offers an ideal fit for smaller vehicles, while lightweight design makes this a popular car seat for family travel",
            "GROW WITH IT: With use from 5 to 40 lb (19 to 40 in. tall), offers rear-facing and forward- facing modes, 5-point harness, plus 4-position shoulder harness",
            "SECURE YOUR CHILD WITH EASE: Upfront harness adjust makes it easy to get an accurate, snug fit for your child as they grow",
            "KEEP DRINKS AND SNACKS WITHIN REACH: Removable cup holder is dishwasher-safe for easy cleaning",
            "KEEP IT LOOKING FRESH: Durable, stain-resistant polyester fabrics remove easily for machine-washing and tumble-drying"
        ],
        "description": "If you’re looking for a savvy car seat investment, take a closer look at the car seat reviewers across the internet agree is an amazing value: The Evenﬂo® TributeTM LX Convertible Car Seat. Budget-friendly, the Tribute LX checks off your essential must-haves, from stringent safety standards and child comfort to ease of use. But that’s just the beginning. This dependable convertible features a compact design ideally suited to smaller vehicles and backseats that need to fit multiple car seats comfortably — owners frequently report they can fit 3-across, although that is dependent on vehicle type. Will you be traveling? Weighing just 9.4 lb, the Tribute LX is the lightweight choice for families who fly frequently or need to switch between vehicles often. Designed for children weighing 5 to 40 lb, measuring 19 to 40 in. tall, this reliable convertible takes you from rear-facing to forward-facing modes with a 5-point harness and adjustable, 4-position shoulder harness. You might not expect a no-nonsense convertible car seat to come with conveniences, but think again! The up-front harness adjust makes it easy to maintain a secure fit as your child grows. As your baby grows, the plush head pillow adds comfort and support for proper head positioning — and it’s removable when your child outgrows it. To keep snacks and drinks within reach on the go, the Tribute LX includes a removable cup holder that’s dishwasher-safe for easy cleaning. And because messes happen, the durable, stain-resistant polyester fabrics are removable for tossing into your washer. Discover for yourself why so many families trust the Tribute LX as their first car seat and even their second car seat for grandparents, babysitters and caregivers.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Car Seats & Accessories",
                "link": "https://www.amazon.com/baby-infants-car-seats-booster/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166835011"
            },
            {
                "name": "Car Seats",
                "link": "https://www.amazon.com/Car-Seats/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1272297011"
            },
            {
                "name": "Convertible",
                "link": "https://www.amazon.com/Convertible-Car-Seats/b/ref=dp_bc_aui_C_4?ie=UTF8&node=166839011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "‎18.5 x 22 x 25.5 inches"
            },
            {
                "name": "Item model number",
                "value": "‎38111190"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Target gender",
                "value": "‎Unisex"
            },
            {
                "name": "Minimum weight recommendation",
                "value": "‎5 Pounds"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "‎40 Pounds"
            },
            {
                "name": "Minimum height recommendation",
                "value": "‎19 Inches"
            },
            {
                "name": "Maximum height recommendation",
                "value": "‎40 Inches"
            },
            {
                "name": "Material Type",
                "value": "‎Polyester"
            },
            {
                "name": "Material Composition",
                "value": "‎Fabric"
            },
            {
                "name": "Care instructions",
                "value": "‎Plastic and metal parts may be wiped clean with mild soap and water and dried with a soft cloth. Do not use abrasive cleaners or solvents. The harness can be wiped clean with mild soap and water. Allow harness to air dry. Machine wash the seat pad separately in cold water. Tumble dry 10 to 15 minutes on low heat. Place the buckle in a cup of warm water and gently agitate. To avoid damage to the buckle, do not clean the buckle with soap or detergents and do not use a lubricant."
            },
            {
                "name": "Additional product features",
                "value": "‎Adjustable Head SupportAdjustable Head Support"
            },
            {
                "name": "Number Of Items",
                "value": "‎1"
            },
            {
                "name": "Style",
                "value": "‎Only Car Seat"
            },
            {
                "name": "Number of reclining positions",
                "value": "‎4"
            },
            {
                "name": "Batteries required",
                "value": "‎No"
            },
            {
                "name": "Specification met",
                "value": "‎certified frustration-free"
            },
            {
                "name": "Orientation",
                "value": "Convertible"
            },
            {
                "name": "Rear-facing minimum child weight",
                "value": "‎5 Pounds"
            },
            {
                "name": "Rear-facing maximum child weight",
                "value": "‎40 Pounds"
            },
            {
                "name": "Forward-facing minimum child weight",
                "value": "‎22 Pounds"
            },
            {
                "name": "Forward-facing maximum child weight",
                "value": "‎40 Pounds"
            },
            {
                "name": "Harness type",
                "value": "‎5-Point"
            },
            {
                "name": "Seating capacity",
                "value": "‎40.00"
            },
            {
                "name": "Item Weight",
                "value": "‎9.29 pounds"
            },
            {
                "name": "Country/Region of origin",
                "value": "‎USA"
            },
            {
                "name": "ASIN",
                "value": "B006PB2B6O"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 9,171 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,910 in Baby (See Top 100 in Baby) #14 in Convertible Child Safety Car Seats"
            },
            {
                "name": "Brand",
                "value": "Evenflo"
            },
            {
                "name": "Installation Type",
                "value": "Latch or Seat Belt"
            },
            {
                "name": "Material",
                "value": "Polyester"
            },
            {
                "name": "Color",
                "value": "Saturn Gray"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/7d132393-a8db-433a-9148-1c69a3a5503e.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5416344e-65b7-4fcf-a326-34eda5365e63.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/05513001-68c7-41de-bc65-35ec926e6b6d.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/42b6c2ff-e64c-4b25-9297-9b52cfd4d80d.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/06cae811-a650-4ccc-8004-bc8b2224d715.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MsMelissa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCVBG6UZSKUXHNLSA2FEKOEB52Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GWD5T66G894G?ASIN=B006PB2B6O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2016",
                "reviewTitle": "5.0 out of 5 stars Simple and budget friendly car seat!",
                "reviewText": "I purchased this car set for my son who was 14 months at the time I purchased it. We've had it for over 6 months now and I am really happy with the purchase.What I Like:I love that this car seat was reasonable priced but still a quality product. It does exactly what I need it to without paying for a huge car seat with extras that we don't need.It has a fairly narrow design, and fits in my car with a booster seat on each side. This was a must for us as we have 3 kids in our sedan. Also, I'm petite so a big bulky car seat isn't fun to lug around or try to install.Not too bulky, but still seems soft and comfy. My son's not a huge talker, but he hasn't indicated that it's uncomfortable in any way.Easy to install and uninstall when you need to move the car seat. Not too hard to get it correctly installed in a secure position.The strap tension adjustment is easy to use, probably the easiest I've ever used and I know my way around a car seat. You just push the button in the front bottom of the seat and pull the shoulder straps to loosen them, put the baby in the seat and buckle up the harness, then pull the strap on the adjuster at the bottom to make tight with the harness at the armpits of the baby.It comes with a latch system and a tether so you can use either option.The whole seat cover comes off easily and is machine washable. Let's face it, babies are messy and tend to spit up, but the cover came out looking great after going through the washing machine.What it Lacks:The cup holder is pretty weak. We didn't end up using it, one reason being that it's in an awkward spot and would have probably been bothering my daughter in the seat next to it, and we couldn't actually get it to stay on. Even if we could get it to stay, it doesn't look like it is very durable.This car seat is supposed to be a seat for a baby 5-40 lbs, but does not come with any additional padding for an infant. I think a 5 lb baby would be way too tiny for such a large seat, but that's my opinion. I like keeping my babies in an infant car seat until they turn a year old because I like to be able to remove the seat from the car to carry them and also, the infant seats just seem more comfortable for a tiny baby who sleeps all the time. My son was over a year and a pretty solid toddler when I purchased this, so it was perfect for him.Overall, it's been a great car seat! We've been fortunate to not have been in any accidents, so I can't say for sure how it holds up under trauma, but for us it's been perfect. We were on a budget so the price was the main reason for choosing this car seat, but it turned out to be great! I like the simple design and I've been happy with the purchase.",
                "reviewVotes": "46 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daits",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOJDYYNSXFUVSZXRWH3FD5G2HFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX4N4CTNIUHN1?ASIN=B006PB2B6O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2017",
                "reviewTitle": "5.0 out of 5 stars MONEY WELL SPENT",
                "reviewText": "SHIPPINGItem arrived in time as promised tucked in a sturdy cardboard shipping box. Both the box and product were intact.WHAT IS GOOD ABOUT ITI already have an expensive ( I paid $250) child car seat from another brand but I wanted one especially for the upcoming travel weight being the concern. This car seat is very light but it is also sturdy. Adjusting the harness is easy and convenient. Adjusting the harness on the other car seat ( the expensive one ) is a Hercules task. The seating pad is soft yet firm. Fits perfect for my daughter. Has a cup holder that is detachable. The best part of this car seat is its weight. It is so light I could carry it all over the terminal without feeling the weight. It fits perfectly in a Delta domestic flight which was a Boeing ( Not sure about the Aircraft model) . However, It did not fit on a Spirit flight which was an Airbus. I had to do the gate check in, for that particular flight.It looks sturdy and feels well built but can not comment on the quality until it is out to a test which I would not want. Going through the previous reviews, I remember some one mentioning about the real life test and how it saved the child. So I feel, it should do well in case of an unfortunate event.WHAT IS NOT SO GOOD ABOUT ITThe only minor issue is with the cup holder. It does not stay in place when you load it up with a heavy cup. I can use some glue to put it in place but then it is beats the idea of \"detachable cup holder\".Bottom LineIt is value for money and the best car seat If you have to carry it on a flight or use it on a rental car.Would I recommend it to a friendYes, I would.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "IGGY Mom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELWKKES5YI5YUGHQ3RUOOOYWS4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GMLVKM0P24GS?ASIN=B006PB2B6O",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2012",
                "reviewTitle": "4.0 out of 5 stars Great Price and Safe",
                "reviewText": "This carseat is a great deal. Carseat safety standards are all the same. It doesn't have the bells and whistles that other seats to but it does what it is supposed to do. There are a few small issues that I have with it but generally it is a great seat.1. The cupholder - Yes, it's flimsy as everyone says but not a big deal.2. Strap release - The button is along the front of the seat so trying to push it or pull the strap to tighten the harness is a little hard when the seat is rear facing.3. Latch System belt - VERY hard to tighten. It doesn't seem to want to pull tight enough and is at a funny angle to tighten it, especially in a smaller car (Corolla). It's not impossible though. We got it tight enough eventually and it's not like you have to go through that process much if you are leaving the seat in the same car most/all of the time.4. Not much cushion. Compared to the little infant car seat that we graduated from it's a little hard but honestly, my 1-year old falls asleep on a wood floor covered with a small rug so he doesn't seem to mind this at all.The good things make up for it:1. Fabric is soft comfy for the little guy.2. The price is awesome especially if you are buying a seat for each of 2 cars.3. Pretty easy installation - save the latch system belt4. Small enough for a small car - we put it in the middle of the bach seat and it fits perfectly in our Corolla.5. Will be easy to turn around to forward facing when he's bigger.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam Dankert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFENOFCESYNQVV7D472QFZWGMPRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CIH7NP4KO80V?ASIN=B006PB2B6O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Value",
                "reviewText": "Easy enough to install and good quality I wouldn’t say it’s the most comfortable overall for a baby but does a good job of keeping them secure which is the important part. Would recommend for anyone on a smaller budget",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Annie Kirk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIGKVNZMRNREI6DGD6NJUYXCC7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P0E2VZB8T6UH?ASIN=B006PB2B6O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Great price",
                "reviewText": "Great price and nice car seat",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arlene F. Sproull",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2024",
                "reviewTitle": "Great price",
                "reviewText": "The only thing missing is a cup holder",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vinu joseph",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 17, 2021",
                "reviewTitle": "Not fitting in Ford Ecosport Titanium (2019) Model",
                "reviewText": "1) This one is not fitting on Ford Ecosport Titanium (2019) Model.2) There is no installation guide attached in the package.3) Type this product name on Youtube and you will find a detailed video. check the video and confirm if you have all the connecting points before buying this product.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jose Villaseñor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 2, 2020",
                "reviewTitle": "Excelente calidad",
                "reviewText": "La verdad leí, muchos comentarios de este producto y también hice comparativa con otros, al final me decidí por esta silla y ha cumplido en todos los sentidos fácil de instalar, lavar y cuenta con materiales de calidad, se le ha dado uso diario y para mi opinión en condiciones rudas y ha soportado a la perfección, recomendable sin duda. Únicamente hay que tener cuidado con el dedo cada vez que se presiona el botón para aflojar el arnés al momento de bajar al niñ@, ya que de otra forma te puede lastimar.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chantal ross",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 8, 2024",
                "reviewTitle": "Très satisfaite",
                "reviewText": "Je l’adore très léger est facile à installer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dofdez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 18, 2022",
                "reviewTitle": "Buena silla a buen precio",
                "reviewText": "Silla segura, que da bastantes tallas, a un precio razonable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}