{
    "remaining_requests": 12358,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Disney-Baby-Convertible-Seating-System/dp/B0B94RZWZM",
    "body": {
        "name": "Disney Baby Pria All-in-One Convertible Car Seat, All-in-One Seating System: Rear-Facing, from 4-40 pounds; Forward-Facing to 65 pounds; and up to 100 pounds in Booster Mode, Minnie",
        "price": "$249.99",
        "originalPrice": "$329.99",
        "rawPrice": 249.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Disney-Baby-Convertible-Seating-System/dp/B0B94RZWZM",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B97Z3STL"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B94PVZHJ",
                "variationName": "Color",
                "variationValue": "Mickey",
                "price": "$249.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/414Bp-VjmLL._SS36_.jpg"
            },
            {
                "asin": "B0B94RZWZM",
                "variationName": "Color",
                "variationValue": "Minnie",
                "price": "$249.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41BMykI9zML._SS36_.jpg"
            },
            {
                "asin": "B0B94SNSV4",
                "variationName": "Color",
                "variationValue": "Neutral Minnie",
                "price": "$239.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Vy-vQ6xHL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "Only 5 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41BMykI9zML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41cqQUf VzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41M cBCIbSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ymdDUx-tL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41R7vJiQ50L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lYeVqTBbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kkOQF9dSL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Disney Store",
            "link": "https://www.amazon.com/stores/Disney/page/EF081BE7-FC57-4715-9A43-440C8BAF0514?ref_=ast_bln"
        },
        "brand": "Disney",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 27,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22. Order within 22 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "All-in-One convertible car seat: rear-facing, from 4-40 pounds; forward-facing to 65 pounds; and up to 100 pounds in booster mode",
            "Side impact protection technology with GCell protects your child’s head where it’s needed most in a side impact crash",
            "In and Out harness holders keep straps out of the way when buckling",
            "One click LATCH system, with easy click-in for better installation",
            "QuickFit shoulder harness automatically raises the harness and headrest height"
        ],
        "description": "Add a bit of Disney magic to every ride with the Pria All-in-One, baby's first and only car seat. All-in-One Seating System With the Disney Pria All-in-One Convertible Car Seat, you can take comfort in knowing that youll have a safe, comfortable car seat for your child, from birth to 10 years old. Children can ride rear-facing, from 4-40 pounds; forward-facing to 65 pounds; and up to 100 pounds in booster mode. It may be the only car seat youll ever need. Converting the Disney Pria All-in-One Convertible Car Seat to each new stage is simple and intuitive, so you can quickly make car seat adjustments. It allows for a wide range of adaptability with its 3-position recline, 5 headrest heights, along with a QuickFit shoulder harness. Superior Safety Features Drive with confidence knowing that the Disney Pria All-in-One Convertible Car Seat is backed by over 30 years of European engineering and exceeds all federal standards, including FMVSS 213. GCell side impact protection is built into the headrest to cushion the impact, and protect your child around the head where its needed most. The QuickFit shoulder harness automatically raises the harness and headrest height to fit your growing child. Children grow at different rates so its important to have the flexibility to customize your car seat to ensure that you keep safety where you need it, when you need it. Supreme Comfort Soft-to-touch cushions and premium fabrics and padding throughout provide supreme comfort for your child during the journey. The Disney Pria All-in-One fabrics are designed to keep your little one comfortable and cozy. The covers are easy to remove, machine washable and dryer safe. Surround your child in comfort and safety from the first ride home with the Disney Pria All-in-One Convertible Car Seat.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Car Seats & Accessories",
                "link": "https://www.amazon.com/baby-infants-car-seats-booster/b?ie=UTF8&node=166835011"
            },
            {
                "name": "Car Seats",
                "link": "https://www.amazon.com/Car-Seats/b?ie=UTF8&node=1272297011"
            },
            {
                "name": "Convertible",
                "link": "https://www.amazon.com/Convertible-Car-Seats/b?ie=UTF8&node=166839011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "‎26.2 x 24.2 x 20 inches"
            },
            {
                "name": "Item model number",
                "value": "‎CC311GHY"
            },
            {
                "name": "Minimum weight recommendation",
                "value": "‎4 Pounds"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "‎100 Pounds"
            },
            {
                "name": "Material Composition",
                "value": "‎B01BTUNHSQ"
            },
            {
                "name": "Number Of Items",
                "value": "‎1"
            },
            {
                "name": "Number of reclining positions",
                "value": "‎3"
            },
            {
                "name": "Batteries required",
                "value": "‎No"
            },
            {
                "name": "Orientation",
                "value": "Rear Facing"
            },
            {
                "name": "Rear-facing minimum child weight",
                "value": "‎4 Pounds"
            },
            {
                "name": "Forward-facing maximum child weight",
                "value": "‎65 Pounds"
            },
            {
                "name": "Item Weight",
                "value": "‎21.9 pounds"
            },
            {
                "name": "Country/Region of origin",
                "value": "‎USA"
            },
            {
                "name": "ASIN",
                "value": "B0B94RZWZM"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 27 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#53,518 in Baby (See Top 100 in Baby) #103 in Convertible Child Safety Car Seats"
            },
            {
                "name": "Brand",
                "value": "Disney"
            },
            {
                "name": "Installation Type",
                "value": "Latch"
            },
            {
                "name": "Color",
                "value": "Minnie"
            },
            {
                "name": "Maximum Weight Recommendation",
                "value": "100 Pounds"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Matthew S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK5M7PJONKQKSVKWV2FQCFCOOKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P4F4B8PTQXR5?ASIN=B0B94RZWZM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Well padded, robust and comfortable - with a few \"cut corners\" in the design",
                "reviewText": "I am extremely happy with the quality, comfort, and ease of use that this car seat offers. When our daughter was young, we started with a \"carrier\" style car seat - the kind where a locking base remains in the car, and the seat containing the baby lifts out. We transitioned to this car seat right around 1 year old, and I think I would follow that same schedule if I were to do it again.The previous car seat we had was more of a \"lay down\" style, which I felt worked very well for a newborn / young baby. This car seat seems to be more of a \"sit up\" style (even with the adjustable angle) - and while she loves it at 1 year old, I'm not sure it would have been a great fit when she was younger.That said, she does absolutely love it. She's able to sit up, see more, and interact with her toys more naturally. It's also easier to maneuver her into the car seat, as the angles are less awkward. The nice thing is that this seat should cover us for many years to come - as it evolves with the various attachments and configurations to match the appropriate age/weight combination.An important point to note, this car seat is very large - probably a necessity to be able to cover the range of ages that it does. But, it's an important consideration because it limits functionality within the car. In our car (4 door sedan), the front passenger seat ends up at such an angle (due to this car seat behind it) that it's uncomfortable to sit in / frankly not a usable seat. So that's definitely a consideration if you regularly need to use every seat in your car.A (perceived) benefit of the car seat is that with its large size (tons of padding), it does feel very robust and protective - I'm very comfortable having my daughter in this car seat. There are a few areas where it seems like they might have saved on cost, however. A few elements don't seem quite as refined as our other car seat - the belt tightness adjuster, the manner in which the car seat installs, the way the car seat adjusts for leveling purposes, the unfinished feel of the plastic base, etc. It all feels a bit rough, and doesn't have the same quality feel as the rest of the car seat - it feels like they cut some corners on the \"nice to have\" details, to perhaps shave a few dollars off the production cost. Fortunately once the (somewhat challenging) installation is complete, you don't have to deal with those elements too much - aside from the belt adjuster, which is more frequently used.All in, this is a great upgrade - you just have to make sure it's the right fit for your vehicle, and decide if it's the right fit for your baby relative to their age/weight & the manufacturer's instructions.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDVEEUD4NZX7NYETDDN5N3HBJEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6QDPB05CYZX?ASIN=B0B94RZWZM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing Car Seat; I Am Very Happy with My Selection",
                "reviewText": "FeaturesHeavy, 22LBSBreathable fabricFive (5) point harnessOne-click to latch ontoHarness covers for babyHeight adjustable headrestSimple to install in near all vehiclesExtended rear facing ability to (40LBS)Infant to child head & body support featuresI am very pleased with the Disney themed Pria All-in-One Convertible car seat. With this, we expect to not have to buy another. There are inserts that start to protect baby, from birth, and then this converts to (10) years old. It’s durable, bulky, but easy to handle. I love the Disney theme. Set-up is easy and offers security for the unthinkable. My little one can ride rear facing, from 4-40 pounds; forward-facing to 65 pounds; and up to 100 pounds in the booster seat mode. Conversion to the next stage of growth is simple, allowing for quick adjustments. What is nice about this, for instance, is its multi-level position recline, 5 headrest heights, and a shoulder harness that I can adjust quickly, with the headrest. We like name brand products because they look after their brand.All the padding feels thick, yet soft to the touch. The fit and finish is perfect, not a thread out of place, seams are all tight, and the appearance fun. Everything vacuums or is wiped clean with ease. If the mess is bad, we can remove the covers, throw in the washer and then the dryer. Baby has no issues and falls asleep most of the time we are driving. Because they are comfortable; and baby also likes to fiddle with the pads they have grown out of.Countries of originSupposedly USA, per listing, I could not find any markFabrics are tagged as made in VietnamSeatbelt straps are tagged as ChinaValueCompetitively priced. These all in one’s are usually greater in cost, however, in the long run are cheaper.When made?July 2022Expiration dateJuly 2032, which is ten 10 years.I would select this againI hope my thoughts added information.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}