{
    "remaining_requests": 12302,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Protector-Siivton-Protectors-Non-Slip-Vehicles/dp/B09W2G8VMX",
    "body": {
        "name": "Car Seat Protector, Siivton Seat Protector for Child Car Seat Seat Cushion for Leather and Fabric Seats, 2 Mesh Pockets, Non-Slip Bottom, Waterproof Protectors for Vehicles Baby Pets (Black)",
        "price": "$14.99",
        "originalPrice": "$19.99",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Protector-Siivton-Protectors-Non-Slip-Vehicles/dp/B09W2G8VMX",
        "soldBy": {
            "sellerID": "A3VMN6MWTXXKK4",
            "name": "Sivton",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3VMN6MWTXXKK4&asin=B09W2G8VMX&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C58MNQNS"
        ],
        "asinVariationValues": [
            {
                "asin": "B09W2G8VMX",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31flJj8+SHL._SS36_.jpg"
            },
            {
                "asin": "B09W2CVPX1",
                "variationName": "Color",
                "variationValue": "Off—White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31USlYNQXVL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31K6LQszg1L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "off-white",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41eFrz0ZO4L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $2 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31flJj8 SHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51RpOPPYITL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412-b-OpSzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sIG9InTHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EtWtVXOsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 dKzSEMWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dn YAOztL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Siivton Store",
            "link": "https://www.amazon.com/stores/Siivton/page/4947DF11-7BA2-4B49-A195-45E1122A0E47?ref_=ast_bln"
        },
        "brand": "Siivton",
        "merchantInfo": "Sivton",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 896,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 22 hrs 12 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Protect Your Car Seat and Keep It Clean】 Siivton car seat protectors can protects car fabric or leather seats from spills, scuffs, dirt, indentations and scratches. It comes with 2 handy pockets to conveniently store water bottles, treats, toys and accessories and keep them within easy reach.",
            "【Durable & Easy to Wipe Clean】This carseat seat protectors has premium quality waterproof 600D oxford fabric for a good look and super long life. And easy to clean! You can wipe up spills and dirt with a damp cloth. To ensure a longer lifespan, Machine Washing is NOT Recommended.",
            "【Multifunctional Carseat Protector】The xl car seat protector for child car seat can even be used as a pet car seat cover for pets, dogs and cats, no matter the back seat or the front seat of the car. It’s perfect for family trips and day trips with kids, whole family, babies, pets or alone!",
            "【Adjustable Strap & Anti-slip Design】The car seat cover has adjustable straps that securely attach the seat cover to the headrest for a perfect fit. Premium leatherette, anti-slip back insert and anti-slip backing to prevent car seat protectors from slipping off the seat. Enjoy your trip with peace of mind!",
            "【Fit to Most Vehicles】The carseat seat protectors are ideal for protecting vehicles from baby, toddler and pets. It fit to most vehicles with the measurement - the back: 18.7*22.8 inch, the seat:18.7*17 inch, and the mesh is 13.3 x 8 inch, large enough to cover the bottom portion of the seat and the back. Meet most of automotive installation needs."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Car Seats & Accessories",
                "link": "https://www.amazon.com/baby-infants-car-seats-booster/b?ie=UTF8&node=166835011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/Child-Safety-Car-Seat-Accessories/b?ie=UTF8&node=166836011"
            },
            {
                "name": "Automotive Seat Protector",
                "link": "https://www.amazon.com/Car-Seat-Automotive-Seat-Protector/b?ie=UTF8&node=8457330011"
            }
        ],
        "productInformation": [
            {
                "name": "Manufacturer",
                "value": "‎Sivtoon"
            },
            {
                "name": "Brand",
                "value": "‎Siivton"
            },
            {
                "name": "Item Weight",
                "value": "‎13.1 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎41.34 x 18.5 x 0.39 inches"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Manufacturer Part Number",
                "value": "‎ST-A130"
            },
            {
                "name": "Position",
                "value": "‎Front, Bottom"
            },
            {
                "name": "ASIN",
                "value": "B09W2G8VMX"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 896 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,256 in Baby (See Top 100 in Baby) #20 in Car Seat Automotive Seat Protector"
            },
            {
                "name": "Date First Available",
                "value": "March 21, 2022"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Siivton Car Seat Protector —— protects your car seat and interior from dust, drinks and wear Buying a quality car seat for your car is an important thing, a poor quality product can damage and wear out your car interior. Protect your car seat with the Siivton Car Seat Protector. Not only is this seat cover beautiful in design, but with a spider web-like anti-slip structure, and 600D Oxford fabric, once you place it on the seat, it's very secure, ensuring your child's safety seat won't stay in place once installed. Moves and is responsible for the safety of children on the move - perfect for extended use.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/79191ccc-d126-4328-9db3-d164fb66666b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Spider Web Anti-Slip Structure: The spider web anti-slip design provides extra grip and prevents the seat protector from slipping off the seat, providing a safer play space for children Adjustable shoulder straps: To secure the rear panel to the car's headrest. Install and remove your child's car seat with unparalleled stability 600D Oxford cloth fabric: We use high quality waterproof Oxford cloth fabric, which is beautiful in appearance and long service life. And easy to clean! You can wipe up spills and dirt with a damp cloth. and won't contaminate your car seat Easy installation process: Just put the waterproof child car seat cover protector on the car seat, then insert the cushion straps into the car seat gap to secure the cover, and finally snap on the headrest as you want. The safety seat cushions are already installed!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ad9feb49-d808-40b2-bd30-25d3b30306b6.__CR0,0,500,500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b232d59-6310-48d6-9147-47601bde0ad1.__CR0,0,500,500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f25ad2f1-fb02-4c51-af82-0f03a080b726.__CR0,0,500,500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29fae553-aacf-4ee8-abb2-9eb9fb8cd8cc.__CR0,0,500,500_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a19775a1-0e35-45ba-99d5-fe8a09e76db0.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b168b1e-1807-40ce-8d58-c849c16fedd0.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/79191ccc-d126-4328-9db3-d164fb66666b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/314fef7f-8248-445b-96f8-4a7944f0c067.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ad9feb49-d808-40b2-bd30-25d3b30306b6.__CR0,0,500,500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b232d59-6310-48d6-9147-47601bde0ad1.__CR0,0,500,500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f25ad2f1-fb02-4c51-af82-0f03a080b726.__CR0,0,500,500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29fae553-aacf-4ee8-abb2-9eb9fb8cd8cc.__CR0,0,500,500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/35c41bd0-23fe-40ca-b93a-039c50330ed2.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "S. Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHII5X5ROER6UZD26JCM2MO6ZSAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9WG5OXYKR5QW?ASIN=B09W2G8VMX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect fit in my Hyundai Santa Fe",
                "reviewText": "Surprisingly attractive, sturdy, and stays in place!I highly recommend these! I may add a video later on if I remember to ☺️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manhal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGV4NXX7DY74W6S55EHZDSJIXWLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3314PDBK2K1XE?ASIN=B09W2G8VMX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Preserving Precious Cargo: The Perfect Car Seat Protector for Uncompromising Safety",
                "reviewText": "Introduction:Prepare to prioritize your child's safety and comfort as I share my personal experience with the perfect car seat protector for child car seats. In this thorough and detailed review, I will provide honest and unbiased feedback on this exceptional product that undoubtedly deserves a 5 out of 5-star rating. Offering helpfulness tips and focusing on its transformative qualities, this review aims to provide insights that everyone can agree with, ensuring a secure and worry-free car journey for parents and their little passengers.Quality and Durability:The first aspect that sets this car seat protector apart is its exceptional quality and durability. Crafted with premium materials, it is designed to withstand the demands of daily use and effectively protect the car seat from spills, stains, and wear. The sturdy construction ensures it maintains its shape and functionality, providing long-lasting reliability for years to come. This car seat protector truly embodies the essence of durability and resilience.Protection and Safety:The utmost priority when choosing a car seat protector is protection and safety. This product excels in providing reliable protection for both the car seat and the child. Its waterproof and spill-resistant properties shield the car seat from accidental spills, stains, and messes, preventing permanent damage. The non-slip backing ensures that the car seat remains securely in place during the journey, reducing the risk of shifting or sliding. This car seat protector offers peace of mind for parents, knowing that their child's car seat is well-protected and secure.Easy Installation and Universal Fit:Convenience and ease of use are crucial factors when selecting a car seat protector. This product understands the needs of parents, offering a hassle-free installation process and a universal fit. It can be easily secured onto the car seat using adjustable straps or secure attachments, ensuring a snug and customized fit. The universal design allows it to be compatible with various car seat models and sizes, providing versatility and adaptability for different vehicles.Comfort and Cushioning:A remarkable car seat protector should provide comfort and cushioning for the child's seating experience. This product surpasses expectations in this aspect, offering a soft and padded surface that enhances the child's comfort during car rides. The plush cushioning reduces pressure points and discomfort, ensuring a pleasant and enjoyable journey. The car seat protector adds an extra layer of comfort to the child's seating area, allowing them to relax and rest comfortably during long drives.Easy Maintenance and Cleaning:The convenience of maintenance and cleaning is a significant consideration for any car seat protector. This product excels in this aspect, making it effortless for parents to keep it clean and hygienic. Its waterproof and stain-resistant properties make spills and messes easy to wipe off with a damp cloth or sponge. The material dries quickly, allowing for immediate reuse. The easy cleaning process ensures that the car seat protector remains fresh and ready for the next adventure.Storage and Portability:The ability to store and transport the car seat protector conveniently is an essential factor for families on the go. This product is designed with portability in mind, offering a compact and foldable design that allows for easy storage in the car or when not in use. Its lightweight construction ensures it can be carried effortlessly, making it a practical choice for travel or switching between different vehicles. The car seat protector's portability adds to its overall value and usability.Versatility and Multi-Functionality:A remarkable car seat protector should offer versatility and multi-functionality. This product understands the diverse needs of parents and provides additional features to enhance its utility. It may include pockets or storage compartments for keeping essentials within reach during the journey. Some models may also serve as a kick mat, protecting the back of the front car seat from children's shoes. This versatility makes the car seat protector a multi-purpose accessory that offers added convenience and functionality.Customer Satisfaction and Recommendations:Customer satisfaction is a testament to the quality and appeal of a car seat protector. Countless positive reviews and testimonials from other customers attest to its excellence. Many parents have praised its exceptional quality, protection, and ease of use. The car seat protector's ability to garner widespread satisfaction and recommendations further reinforces its reliability and value.Final Thoughts:In conclusion, the perfect car seat protector for child car seats prioritizes protection, safety, and convenience. This exceptional product combines superior quality, durability, and comfort to provide a worry-free and secure car journey for parents and their little passengers. From its easy installation to its versatile features, every aspect is designed with the child's safety and comfort in mind. If you seek a car seat protector that safeguards your child's car seat and enhances their seating experience, look no further. With this car seat protector, you'll enjoy peace of mind and create a secure environment for your little traveler.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVS5SADYKNN5CG7UZ6HYQBFEDOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QN1TT0VGG3PQ?ASIN=B09W2G8VMX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "4.0 out of 5 stars Looks better than dark on my almost white leather seats.",
                "reviewText": "I have a Hyundai Palisade with “Beige” seats and it’s yellower than my seats but looks better than the standard black covers. Looks sharp. Easy to instal. I only have a baby in a car seat so the staying power is good for me but can’t tell if you have an older child that could easily move it. Would buy again.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mihai Preda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4EM5IOLPUTBLEOIR6E7E7MAWYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R341J8JHS2Z0BR?ASIN=B09W2G8VMX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Good quality and looks great!",
                "reviewText": "Great product! I have light beige / ivory car interior and this cover looks like it came with the car! Great quality and works perfectly to protect your car from the baby car seat.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frugal ShopperFrugal Shopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVN3EEYQ5546HJE6ESZBB2X53VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ3VNETW3J9O1?ASIN=B09W2G8VMX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Seat Cover for Next to Carseat",
                "reviewText": "I got this to protect the seat, next to car seat, from little feet. It’s attractive and does the job. Not expensive and perfect for our needs.Also, our car seat instructions say not to use anything between child car seat and automobile seat.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71uVQqG9mRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81QHjGXIcWL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cynthia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJG6KKJNCP7BJORZXBIVBCH6UHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JOETIRKK9R8H?ASIN=B09W2G8VMX",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 21, 2023",
                "reviewTitle": "3.0 out of 5 stars They kind of work",
                "reviewText": "Work well if you have a car seat or booster seat sitting on top of them. I wouldn’t recommend if you don’t. They move around quite a bit and can cover the seat belt connections which can make it difficult to buckle.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CD101",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJBPAJ2FX6Z6VOWN3ZFHLMZ2CVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHFXR98B3QC8X?ASIN=B09W2G8VMX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Not bulky but sturdy.",
                "reviewText": "Compared to others I’ve seen, these are not bulky, but well made and sturdy even though thinner. Good fit on a new car backseat for a child’s safety seat that weighs about 10LB.Easy to place on seat.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hailey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG57NKNLPJUK4Q46B4THJN2DJYWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YBXI5BW0JCIR?ASIN=B09W2G8VMX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Beautiful covers",
                "reviewText": "I initially bought these because I thought the car I was gonna buy had tan seats, however, that wasn’t the case. Regardless, they were so nice looking and such a good quality that I decided to keep them. They are very beautiful and then protect seats very well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jackie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 15, 2023",
                "reviewTitle": "Impressive",
                "reviewText": "I put those heavy carseat on top of this, and it didnt leave the mark on the real seat while take off. Surprised.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 22, 2023",
                "reviewTitle": "I like them",
                "reviewText": "The color is what caught my attention. Matches well with my interior. Doesn't slide around on the leather seats. The only issue I had is the seat part is a little too short by about 4 inches and the top strap wouldn't work with the headrests, but I was able to make an extra strap and attach it to the child seat bracket behind the seat.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "まみさ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on April 22, 2023",
                "reviewTitle": "値段の割には",
                "reviewText": "値段の割にはしっかりしてて、予想以上にいい感じ。チャイルドシートの下に敷いて使ってます。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "じょりぴと",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on May 28, 2022",
                "reviewTitle": "チャイルドシートには必須と言ってもいいプロテクターです。オススメですよ。",
                "reviewText": "これで十分。600D(デニール)の製品です。ストッキングでおなじみの単位、デニールを簡単にいえば、糸の太さ。数字が小さいほど細く(軽く)、数字が大きいほど太いということになります。ストッキングだと30D前後、タイツになると60Dでしょうか。それでは600Dはどんなもんか。リュック(バックパック)の底の部分やジャケットに追加で縫い付ける肘当て。このあたりの素材に600Dを使うことが多いようです。1680Dなんて謳うシートプロテクターもありますが、かなりのオーバースペックです。この製品、チャイルドシート用カープロテクターとは、クルマの座席とチャイルドシートの間に敷き、チャイルドシートの重みでイスの一点にだけかかる荷重を分散してやったり、シートの一部分に集中する荷重によるヨレやへこみを緩和する、結構重要なアイテムです。シートにつく、一般的ではないキズや凹みは、車を売る際の査定にも響いてきます。この製品はほとんどの大きさのチャイルドシートに適する大きさで、取付も至極簡単。ヘッドレストに引っ掛けるだけなのがポイント。もちろん座席を汚れからも守ってくれますよ。チャイルドシートをお持ちの方、シートプロテクター使ってますか？安価で色の展開もありますから、ぜひご検討をお勧めします。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 8, 2023",
                "reviewTitle": "Car seat protectors",
                "reviewText": "Works very well at protecting the seat from marring the upholstery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}