{
    "remaining_requests": 12244,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/KidsEmbrace-Forward-Facing-Supergirl-Backless-Positioning/dp/B0CTY7SPJP",
    "body": {
        "name": "KidsEmbrace 2-in-1 Forward-Facing Harness Booster Seat, Disney Beauty and The Beast Belle & DC Comics Pink Supergirl Backless Booster Car Seat with Seatbelt Positioning Clip",
        "price": "$172.28",
        "originalPrice": "$189.48",
        "rawPrice": 172.28,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/KidsEmbrace-Forward-Facing-Supergirl-Backless-Positioning/dp/B0CTY7SPJP",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "Only 2 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31OUAc8qZUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51q-JOF3GBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cc6CSLxXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51e7Rm5847L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sxKV0L7AL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rb7JYincL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MTlp47UhL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: KidsEmbrace",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=KidsEmbrace"
        },
        "brand": "KidsEmbrace",
        "merchantInfo": "",
        "customerReview": "",
        "customerReviewCount": 0,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "Delivery Wednesday, February 21. Order within 11 hrs 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Product 1: 2 MODE OPTIONS: Get a toddler car booster seat that grows with your child! The forward-facing 5-point-harness booster-seat mode is made for kids who weigh 22–65 lbs. and are 29\"–49\" in height. When they get bigger, convert it to the belt-positioning booster-seat mode for older kids who weigh 40–100 lbs. and are 38\"–57\" in height.",
            "Product 1: 5-POINT-HARNESS SECURITY: Give your child the best protection possible with 2 position points at each shoulder, 2 position points at the hips, and 1 point where the harness buckles between the legs. We recommend using the 5-point harness to the maximum recommended weight and height before using this seat as a belt-positioning booster.",
            "Product 1: 3 HARNESS POSITIONS: The shoulder straps should be at or just above your child's shoulders when you are using this forward-facing travel booster seat. Our kids’ booster seat is equipped with 3 slots to position the harness shoulder straps according to the weight and height of your child.",
            "Product 1: SAFETY CERTIFICATIONS: This child booster seat exceeds Federal Motor Vehicle Safety Standards (FMVSS 213). It was side-impact tested only when used with a 5-point harness. When it was used as a belt-positioning booster seat, the Insurance Institute for Highway Safety gave it a “Best Bet” rating.",
            "Product 2: CERTIFIED SAFE: Drive safe knowing your Backless Booster Car Seat is a certified “BEST BET BOOSTER” from the Insurance Institute for Highway Safety and exceeds the Federal Motor Vehicle Safety Standards (FMVSS 213)",
            "Product 2: AGE AND SIZE RECOMMENDATIONS: This KidsEmbrace backless booster is designed for children over 4 years old, weighing 40 to 100 pounds, and measuring 40 to 57 inches in height",
            "Product 2: SEAT BELT POSITIONING: Our backless booster has a shoulder belt positioning clip with an adjustable strap so you can easily adjust the seat belt according to your child's size",
            "Product 2: CUP HOLDER: Equipped with a universal cup holder so your child can enjoy their beverage or snack at any time during the ride. The cup holder attaches to either side of the car seat for ultimate convenience"
        ],
        "description": "KidsEmbrace 2-in-1 Forward-Facing Harness Booster Seat, Disney Beauty and The Beast BelleYour child will love hopping into the car knowing Disney is along for the ride! The KidsEmbrace Disney Princess Belle 2-in-1 Booster Car Seat has been rigorously tested and exceeds Federal Motor Vehicle Safety Standards (FMVSS 213), plus it was given a \"Best Bet\" rating by the Insurance Institute for Highway Safety when used as a belt-positioning booster. Great for toddlers and older kids alike, this combination booster car seat is approved for forward-facing use with the five-point harness for children weighing between 22 and 65 pounds and 29 to 49 inches in height, and it can be converted into a belt-positioning booster car seat for children weighing between 40 and 100 pounds and 38 to 57 inches in height. The booster seat harness straps are easy to adjust with one hand. The crotch belt can be used in two different positions to accommodate your growing child, and the headrest can be adjusted to three different heights. The contoured seat is comfortable for long rides, and the cushioned seat cover is machine-washable for easy cleaning. Two cup holders provide a handy place for drinks, snacks, or your child’s favorite soft toys, and the Disney Princess Belle cape can be removed for use as a blanket. The combination five-point harness high-back booster car seat is easy to install with or without LATCH and the top tether. It measures 19.5 by 19 by 29.5 (L x W x H) (headrest down) to 19.5 by 19 by 32.5 (L x W x H) (headrest up), and it weighs 15 pounds.KidsEmbrace DC Comics Pink Supergirl Backless Booster Car Seat with Seatbelt Positioning ClipYour child will love hopping into the car knowing they are safe and as cool as they can be, in their very own DC Comics Supergirl car seat! The Kids Embrace DC Comics Supergirl backless booster Car Seat has been rigorously tested and exceeds federal Motor Vehicle Safety Standard (FMVSS 213), Plus it was given a “Best Bet” Rating by the Insurance Institute for Highway Safety.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Car Seats & Accessories",
                "link": "https://www.amazon.com/baby-infants-car-seats-booster/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166835011"
            },
            {
                "name": "Car Seats",
                "link": "https://www.amazon.com/Car-Seats/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1272297011"
            },
            {
                "name": "Booster",
                "link": "https://www.amazon.com/Child-Safety-Booster-Car-Seats/b/ref=dp_bc_aui_C_4?ie=UTF8&node=166837011"
            }
        ],
        "productInformation": [
            {
                "name": "Minimum weight recommendation",
                "value": "‎40 Pounds"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "‎65 Pounds, 100 Pounds"
            },
            {
                "name": "Maximum height recommendation",
                "value": "‎57 Inches"
            },
            {
                "name": "Orientation",
                "value": "Forward Facing"
            },
            {
                "name": "Forward-facing maximum child weight",
                "value": "‎65 Pounds"
            },
            {
                "name": "Harness type",
                "value": "‎5-Point"
            },
            {
                "name": "ASIN",
                "value": "B0CTY7SPJP"
            },
            {
                "name": "Brand",
                "value": "KidsEmbrace"
            },
            {
                "name": "Installation Type",
                "value": "Seat Belt, Latch"
            },
            {
                "name": "Maximum Weight Recommendation",
                "value": "65 Pounds, 100 Pounds"
            },
            {
                "name": "Harness Type",
                "value": "5-Point"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}