{
    "remaining_requests": 12220,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/KidsEmbrace-Booster-Backless-Seatbelt-Positioning/dp/B0CTY7VCCN",
    "body": {
        "name": "High Back Booster Car Seat, Disney Frozen Elsa and Anna Purple, White, Blue & Disney Frozen Backless Booster Car Seat with Seatbelt Positioning Clip, Elsa, Anna, Olaf",
        "price": "$100.88",
        "originalPrice": "$107.08",
        "rawPrice": 100.88,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/KidsEmbrace-Booster-Backless-Seatbelt-Positioning/dp/B0CTY7VCCN",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41h06fV1QDL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41YU-P7FPFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SX34M2D2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JTSrIQyGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DMVWzclLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51tc-zSu5jL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vOgc19uLL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: KidsEmbrace",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=KidsEmbrace"
        },
        "brand": "KidsEmbrace",
        "merchantInfo": "",
        "customerReview": "",
        "customerReviewCount": 0,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "Delivery Thursday, February 22. Order within 22 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Product 1: GROWS WITH YOUR CHILD: The KidsEmbrace Frozen high back booster car seat grows with your child, and easily transitions from a high-back booster to a backless booster depending on their age and size",
            "Product 1: AGE AND SIZE RECOMMENDATIONS: The high back booster is designed for children over 4 years old, weighing 40 to 100 pounds, and measuring 38 to 57 inches in height. The backless booster is designed for children over 4 years old, weighing 40 to 100 pounds, and measuring 40 to 57 inches in height",
            "Product 1: SEAT BELT POSITIONING: Our Frozen high back booster has a shoulder belt positioning clip so you can easily adjust the seat belt according to your child's size, and a belt positioning clip guide for the backless booster",
            "Product 1: CERTIFIED SAFE: Drive safe knowing your Frozen high back booster car seat exceeds the Federal Motor Vehicle Safety Standard (FMVSS 213) and boasts a BEST BET BOOSTER rating from the Insurance Institute for Highway Safety (IIHS) CUP HOLDER: Equipped with a cup holder so your child can enjoy their beverage or snack at any time during the ride",
            "Product 2: CERTIFIED SAFE: Drive safe knowing your Backless Booster Car Seat is a certified “BEST BET BOOSTER” from the Insurance Institute for Highway Safety and exceeds the Federal Motor Vehicle Safety Standards (FMVSS 213)",
            "Product 2: AGE AND SIZE RECOMMENDATIONS: This KidsEmbrace backless booster is designed for children over 4 years old, weighing 40 to 100 pounds, and measuring 40 to 57 inches in height",
            "Product 2: SEAT BELT POSITIONING: Our backless booster has a shoulder belt positioning clip with an adjustable strap so you can easily adjust the seat belt according to your child's size",
            "Product 2: CUP HOLDER: Equipped with a universal cup holder so your child can enjoy their beverage or snack at any time during the ride. The cup holder attaches to either side of the car seat for ultimate convenience"
        ],
        "description": "KidsEmbrace High Back Booster Car Seat, Disney Frozen Elsa and Anna Purple, White, BlueYour child will love hopping into the car knowing they are safe and as cool as they can be, in their very own Frozen car seat! Now they can ride along with the iconic characters from Disney's Frozen, like Anna, Elsa, and everyone's favorite snowman, Olaf! The Kids Embrace Disney Frozen high-back booster Car Seat has been rigorously tested and exceeds federal Motor Vehicle Safety Standard (FMVSS 213), Plus it was given a “Best Bet” Rating by the Insurance Institute for Highway Safety. The high-back booster is approved for use by children over 4 years old weighing 40 to 100 pounds and 38 to 57 inches in height. It easily converts from a high-back booster to a backless booster for children over 4 years old weighing 40 to 100 pounds and 40 to 57 inches in height. The headrest adjusts to two different positions to accommodate your growing child. The booster back features an integrated shoulder-belt positioning guide, and when your child is ready for the backless configuration, there is a belt-positioning clip that keeps your vehicle shoulder belt at the correct height for maximum safety. The contoured seat is comfortable for long rides, and the cushioned seat cover is machine-washable for easy cleaning. The Frozen high-back booster comes with one cup holder that is easy to attach on either side of the base, for easy access for a drink, snack, or your child’s favorite soft toy. It measures 17.25 by 14.5 by 25-1/2 inches (L x W x H) (headrest down) to 17-1/4 by 14-1/2 by 28 inches (L x W x H) (headrest up), and it weighs 12 pounds.KidsEmbrace Disney Frozen Backless Booster Car Seat with Seatbelt Positioning Clip, Elsa, Anna, Olaf and KristoffYour child will love hopping into the car knowing they are safe and as cool as they can be, in their very own Disney Frozen car seat! The Kids Embrace Disney Frozen backless booster Car Seat has been rigorously tested and exceeds federal Motor Vehicle Safety Standard (FMVSS 213), Plus it was given a “Best Bet” Rating by the Insurance Institute for Highway Safety.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Car Seats & Accessories",
                "link": "https://www.amazon.com/baby-infants-car-seats-booster/b?ie=UTF8&node=166835011"
            },
            {
                "name": "Car Seats",
                "link": "https://www.amazon.com/Car-Seats/b?ie=UTF8&node=1272297011"
            },
            {
                "name": "Booster",
                "link": "https://www.amazon.com/Child-Safety-Booster-Car-Seats/b?ie=UTF8&node=166837011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN",
                "value": "B0CTY7VCCN"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}