{
    "remaining_requests": 18958,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Oster-TSSTTVFDDG-Digital-French-Stainless/dp/B014D9LBCY",
    "body": {
        "name": "Oster Convection Oven, 8-in-1 Countertop Toaster Oven, XL Fits 2 16\" Pizzas, Stainless Steel French Door",
        "price": "$174.28",
        "originalPrice": "$199.99",
        "rawPrice": 174.28,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Oster-TSSTTVFDDG-Digital-French-Stainless/dp/B014D9LBCY",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41kGBDkVOeL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51tFDIOhEIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zZjtszX L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51WaenAT5RL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OMIF ki0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41R94IY37YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51H0qtlei5L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Oster Store",
            "link": "https://www.amazon.com/stores/Oster/page/7890459C-2B36-477F-A854-6677DDABE451?ref_=ast_bln"
        },
        "brand": "Oster",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 6390,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20. Order within 16 hrs 35 mins",
            "FREE delivery Tuesday, February 20. Order within 16 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Single door pull opens both doors with 1 hand ease and convenience",
            "Digital controls provide precise cooking time and temperature to take the guesswork out of cooking",
            "Turbo convection baking technology cooks faster and browns more evenly, STAINLESS STEEL FINISH: Durable, premium stainless steel finish",
            "Two racks provide maximum cooking flexibility; This oven control allows you to slowly cook your food at a preset temperature of 150°F for an adjustable time of upto 6 hours",
            "Extra large interior accommodates 2 16 inches pizzas; Preheat setting gets oven temperature up to where you need for precise cooking",
            "90 minute timer with signal turns oven off automatically",
            "This product contains Aluminum, Stainless steel(Iron, Chromium, Nickel, Manganese, Phosphorus)"
        ],
        "description": "Voila, dinner’s done; The Oster Digital French Door Oven looks elegant, cooks with convection and makes meal prep easier. Unique design opens both doors with a single pull so you can place dishes in the oven without hassle. Digital controls provide added convenience to bake, toast, broil, warm and convection cook in just one touch. Control panel also includes touch commands for pizza, dehydrate and defrost, as well as adjustable time and temperature settings. There’s no reason to turn up the heat with your conventional oven, as the Oster Digital French Door Oven cooks more efficiently, using up to 50 percent less energy. With 90 minute timer, your foods cook as long as you need, then the oven shuts off automatically. With a countertop oven this attractive, this efficient and this easy to use, you’ll enjoying using it for every meal you prepare.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Convection Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289934"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Oster"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "20.15\"D x 23.8\"W x 15.1\"H"
            },
            {
                "name": "Special Feature",
                "value": "Digital"
            },
            {
                "name": "Control Type",
                "value": "Touch Control"
            },
            {
                "name": "Door Style",
                "value": "French Door"
            },
            {
                "name": "Included Components",
                "value": "Oven and Accessories"
            },
            {
                "name": "Model Name",
                "value": "French Door Convection Countertop and Toaster Oven"
            },
            {
                "name": "Finish Type",
                "value": "Brushed"
            },
            {
                "name": "Item Weight",
                "value": "18.1 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Oster"
            },
            {
                "name": "ASIN",
                "value": "B014D9LBCY"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "TSSTTVFDDG"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 6,390 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,544 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #9 in Convection Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "August 14, 2015"
            },
            {
                "name": "Capacity 24 Cubic Inches",
                "value": "Wattage 1500 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 18.1 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Oster Digital French Door Oven with Convection Bake, Broil, Toast, Pizza, Warm, Dehydrate, and Defrost The Oster Digital French Door Oven looks elegant, cooks with convection and makes meal prep easier. Unique design opens both doors with a single pull so you can place dishes in the oven without hassle. Digital controls provide added convenience to bake, toast, broil, warm and convection cook in just one touch. Control panel also includes touch commands for pizza, dehydrate and defrost, adjustable time, and temperature settings. Key Features Turbo Convection baking technology Two racks provide maximum cooking flexibility Extra large interior Digital controls 90 minute timer",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b557429a-47d5-48fe-8b4d-981c3070e188.__CR0,0,1000,1000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Performance. Versatility. Durability. French Door & Brushed Stainless Steel Exterior Sleek design fits most décor. A single door pull opens both doors with just one hand for ease and convenience while cooking. Extra Large Capacity Holds two 16-inch take and bake pizzas, family size chicken, roast, casserole or 14 slices of bread. Digital Controls Functions include dehydrate to make you own dried fruits and vegetables. 90-minute timer with signal automatically turns oven off. Preheat ready feature lets you know oven is heated to set cooking temperature.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/94df457f-e4a1-47fc-ae7e-d78ca61a9170._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/47732f1a-da52-42d1-b0d1-1fde80082c2a._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/069e3c30-ec7b-45e0-af98-4c02b1d9c895._SL300__.jpg"
                ]
            },
            {
                "media_text": "Dual Rack Two racks provide maximum cooking flexibility. Durable baking pan and baking rack doubles as a broiling pan when assembled. Removable crumb tray makes clean up easy. Turbo Convection Baking Technology Turbo convection heat technology circulates hot air throughout oven for faster, more even cooking. Interior Light Conveniently check food without opening doors.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/56a2471d-197f-4d55-8eb7-dc21175d1fbe._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/8403852b-3bf2-4896-848f-e1779dbd2fcf._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/eb3242cc-695c-41af-81b2-c4d3c8b1acbf._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/26aeadf1-cf5f-4bd8-bcd2-b3de7a174f6c.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b557429a-47d5-48fe-8b4d-981c3070e188.__CR0,0,1000,1000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/94df457f-e4a1-47fc-ae7e-d78ca61a9170._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/47732f1a-da52-42d1-b0d1-1fde80082c2a._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/069e3c30-ec7b-45e0-af98-4c02b1d9c895._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/56a2471d-197f-4d55-8eb7-dc21175d1fbe._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/8403852b-3bf2-4896-848f-e1779dbd2fcf._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/eb3242cc-695c-41af-81b2-c4d3c8b1acbf._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dp",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7FBFUTGFO6UL4KIJ2WS2LAWFNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30KOK8VFD6NIU?ASIN=B014D9LBCY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 19, 2018",
                "reviewTitle": "5.0 out of 5 stars Oh ster, my toaster!",
                "reviewText": "This thing is a BEAST! I purchased this because I have no oven in my apartment and wanted the option to be able to cook and this toaster oven does NOT disappoint. So far everyone that has been over to my place has complimented on how awesome it looks. Then I cook them some bomb food and they love it.The buttons are a little mushy and require a little more pressure then I find is necessary for a touch sensor button. Also the power cord is pretty short so make sure the outlet is close by or you'll need an extension cord. Two prong so no biggie.I've noticed that the toasting option doesn't visibly display a countdown to let you know when it's done. I've tried different options and can't seem to get a counter going. It does display a shading number though starting at 4 and then automatically shuts off when it has that shade. I think it does it in terms of quarters. So 4 is pretty much whole thing toasted. 3 = 75%. Etc. I usually stick with 3 since 4 sometimes overcooks just a little.Baking is a lot simpler. Set the temp, lights come on to tell you it's preheating. Lets out a chime when it's ready. From there it gives you an actual timer that you can feel free to set to your liking. Default is around 20 minutes or so. Just add or subtract however much you need. Lots of room in this behemoth. Doors stay open automatically once you've open the doors to their full swing. I saw another reviewer saying they shut on their own but that's not the case. Just open them up all the way and they'll stay open.The clock seems to work fine. Have noticed other people saying they've had issues with theirs but mine seems to be okay and I've had it for a bit now. Will update should anything arise.Overall, this thing is absolutely amazing.UPDATE 10/20/2021I'm noticing some other reviewers complaining about exploding doors and doors not staying open. I can comfortably say I've been using this toaster oven pretty much every day for 3 years and have not had a single problem with it. No exploding doors and the doors stay open as strong as they did 3 years ago. The only reason I can think of for the doors breaking is if you slam the doors shut or allow them to. If you repeatedly treat the toaster oven like it's your personal gimp, of course it's not gonna last. Just treat the oven well and it will last you as long as mine has.",
                "reviewVotes": "597 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Xerellise",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENRKZUDVMUP4L2QL2ESN2KWDXRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17YQ22KF3LRBM?ASIN=B014D9LBCY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2016",
                "reviewTitle": "5.0 out of 5 stars Attractive toaster oven, easy to use, love it!",
                "reviewText": "*Update*12/01/16: I've recently baked a brownie cake, a fruit pie, pork belly and a big spiral sliced ham in this toaster oven and they all turned out wonderful. The spiral sliced ham was a hit since it was a dish for our Thanksgiving get together, was so juicy and tender, not dry at all and there were so many compliments. We also baked a big slice of pork belly for two hours, the top was so crispy and bubbly brown while the pork meat was tender and juicy just like the ham, I wasn't expecting that so I was amazed. Still very happy with my purchase!------------I've been looking for a toaster oven for quite some time since I moved out. I almost settled for a toaster oven that was around $40 but realized that since I wasn't using my oven, that I needed a bigger toaster oven since I love baking and definitely wanted something with a lot of room to fit a 13x9 pan and so on. It took me about a week to receive this which was amazing because I was a dummy and waited after it almost sold out to buy one and was notified that it would take approximately 2 -3 months to ship to me. So I was really happy when Amazon notified me a few days later that I would receive it so much sooner.After I unboxed it and set it on my counter, I admired how nice it looked in stainless steel with its french doors which made it look so fancy. I read over the manual and then set the clock which was easy to do. The first thing that I cooked in this toaster oven was a rack of ribs split into two pieces that was marinaded, I used the aluminum pan that came with it and the ribs turned out amazing. I've only used the broil and toast function so far and am looking up ideas so I can use the dehydrate option. It's so easy to use it too, from choosing the function, setting the temp and timer to starting and stopping the cooking process, also love how it has a light inside when food is cooking and it does stay on the entire time until you turn off the toaster oven. Now I cook all sorts of things in this toaster oven, it's very roomy and gives me the light-bulb that I need to make and bake my own pizza.This toaster oven does create heat when in use and the outside does get hot so I just keep everything away from it. The cord is also short and I do wish it was longer but I use an extension cord to fix that. The inside is very easy to clean and so are the glass doors. I have yet to bake any sweets though because I haven't had the time and usually just cook dinner after work and such but Thanksgiving is coming and I need to start my pie practice so I will be baking some goodies real soon. I'm overall very happy with my toaster oven, absolutely love it and am so satisfied that I made the purchase and a big giant thank you to Amazon for shipping this out to me in a week instead of the 2 -3 months that I was told.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cathy P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBG2FKHW6C65SDJPEM2MJZWWAOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13ZZVFEJWNJX3?ASIN=B014D9LBCY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice oven. Good product.",
                "reviewText": "Nice oven that works well. I use it in summer as I live in a very hot climate and it does not heat my house up as much as my range oven.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MikeMike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6UVFTO7NDMM43LD2VP4M4TELYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IZAM7TCNZF6W?ASIN=B014D9LBCY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2023",
                "reviewTitle": "4.0 out of 5 stars Good Supplemental Oven for Cooking",
                "reviewText": "I like the various types of cooking (toast, bake, convection, etc.). Good size. Allows 9 x 13 pans to be heated in the unit. Gets a little hot on top so you have to be careful not to touch it. Make sure it is in a well vented area.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71eg6aL53uL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ros32",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 1, 2024",
                "reviewTitle": "Genial",
                "reviewText": "Buenísimo. 100% recomendable!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leonardo Morales",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 7, 2023",
                "reviewTitle": "Eficiente",
                "reviewText": "De buen tamaño, eficiente, las charolas están geniales. Único detalle las teclas cuesta trabajo apretar están muy duras en especial para poner la hora. Marca en farenheit no en celcius.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ary",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 2, 2023",
                "reviewTitle": "Buen horno",
                "reviewText": "Calienta perfectamente y con un excelente espacio, el único detalle es que no se puede cambiar a centígrados y que los botones no son sensibles, hay que presionar fuerte. Por lo demás cumple con su función.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chikisoe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 3, 2020",
                "reviewTitle": "Excelente compra",
                "reviewText": "En relacion al precio es una excelente compra la verdad yo me ahorre como un 30% ya que estaba en oferta entonces el precio me parecio muy bien.Estaba dudosa pero no me arrepiento, es muy practico y facil de usar solo es de agarrarle la onda y listo. Tener este horno en tu cocina suple perfectamente el tener un hornito, un horno normal, una tostadora dan y un grill.El tamaño es grande entonces caben dos pizzas chicas-medianas (no individuales). El color lo esperaba un poco mas plata pero es mas gris claro pero no es problema. Si estas viendo esto, compralo no te vas a arrepentir.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PORFIRIO BENAVIDES LOZOYA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 28, 2024",
                "reviewTitle": "Buen producto de capacidad suficiente",
                "reviewText": "Solo un pequeño problema, que se requiere una presión en lugar muy precisó para que funcione y se batalla un poco con esto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$169.99",
                "sellerName": "CLIMAX RESALE",
                "sellerRating": "4.5"
            }
        ]
    }
}