{
    "remaining_requests": 19124,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/JAQ-Adjustable-Expandable-Stainless-Organizer/dp/B0B55PVZ8F",
    "body": {
        "name": "JAQ Small Dish Drying Rack in Sink Adjustable 14.96\" to 20.59\", Expandable 304 Stainless Steel Metal Dish Drainer Rack Organizer with Stainless Steel Utensil Holder Over Sink Counter (for 1-2 People)",
        "price": "$28.99",
        "originalPrice": "",
        "rawPrice": 28.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/JAQ-Adjustable-Expandable-Stainless-Organizer/dp/B0B55PVZ8F",
        "soldBy": {
            "sellerID": "AQAP4V2604IWA",
            "name": "GN Trading companies",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AQAP4V2604IWA&asin=B0B55PVZ8F&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B41LXQ65"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CMGY4269",
                "variationName": "Color",
                "variationValue": "304 Stainless Stell",
                "price": "$12.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41bGwsH2QaL._SS36_.jpg"
            },
            {
                "asin": "B0BD49SM49",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$17.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41AjdzfM2WL._SS36_.jpg"
            },
            {
                "asin": "B0B58K1D2W",
                "variationName": "Color",
                "variationValue": "Black/8-slot",
                "price": "$12.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/317lU2Kv6zL._SS36_.jpg"
            },
            {
                "asin": "B09H2HMW9B",
                "variationName": "Color",
                "variationValue": "Dish Drying Rack in Sink-304 Steel",
                "price": "$34.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41GOr72v+JL._SS36_.jpg"
            },
            {
                "asin": "B09QX1M1T4",
                "variationName": "Color",
                "variationValue": "Large Dish Drying Rack-304 Stainless Steel",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51AqcZkQjLL._SS36_.jpg"
            },
            {
                "asin": "B0B55PVZ8F",
                "variationName": "Color",
                "variationValue": "Small Dish Drying Rack in Sink-304 Steel",
                "price": "$28.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41bRGnpFUQL._SS36_.jpg"
            },
            {
                "asin": "B09GB74MDR",
                "variationName": "Color",
                "variationValue": "White /2 Pack",
                "price": "$16.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41QmvmJSZxL._SS36_.jpg"
            },
            {
                "asin": "B0B58PSMNF",
                "variationName": "Color",
                "variationValue": "White /6-slot",
                "price": "$12.89",
                "variationImageURL": "https://m.media-amazon.com/images/I/31AlVdeg88L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41bRGnpFUQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41mhLnFKGnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hHInug16L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Pqm-qc3ML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yTx7k2xgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51D5BXX5thL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TkEirvvYL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the JAQ Store",
            "link": "https://www.amazon.com/stores/JAQ-BuyNow/page/144FDF5B-4331-4CBB-9DCB-3B4CC839A859?ref_=ast_bln"
        },
        "brand": "JAQ-BuyNow",
        "merchantInfo": "GN Trading companies",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 911,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 3 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "★【 Rustproof 】Our metal dish racks are all made of top quality 304 stainless steel , very sturdy and durable",
            "★【 Versatile Dish Rack 】You can take the dish drainer rack on Countertop or by the sink with drying mat (no included ) , or you can put it over the sink or in the sink",
            "★【 304 Stainless Steel Silverware Holder 】The removable silverware holder are also made of top quality stainless steel , easy to clean .",
            "★【 Dishes Slot Available 】The dish drainer features dish slots, which can hold 7 dishes vertically",
            "★【 Non-slip Adjustable arms 】The adjustable arms of The metal dish rack are very convenient for moving",
            "★【 Kitchen organizer 】you can put your dishes , pots and pans into it ,make you kitchen looks tidy",
            "★【 Dimensions 】the dimension of our dish rack is 14.96\"(38cm ) X 8.27\"(21cm) X 4.33\"( 11cm ) , after expandable, 20.59\"(52.3cm) X8.27\"(21cm) X 4.33\"( 11cm )",
            "★【QUALITY ASSURANCE】We provide 1- year warranty. If you are not satisified with stainless steel dish drying rack , please feel free to contact with us and we won't let you suffer any loss"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Storage & Organization",
                "link": "https://www.amazon.com/kitchen-storage-organization/b/ref=dp_bc_aui_C_3?ie=UTF8&node=510136"
            },
            {
                "name": "Racks & Holders",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=23691552011"
            },
            {
                "name": "Dish Racks",
                "link": "https://www.amazon.com/dish-racks/b/ref=dp_bc_aui_C_5?ie=UTF8&node=695483011"
            }
        ],
        "productInformation": [
            {
                "name": "Material",
                "value": "Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "8.27\"D x 14.96\"W x 4.33\"H"
            },
            {
                "name": "Brand",
                "value": "JAQ"
            },
            {
                "name": "Color",
                "value": "Small Dish Drying Rack in Sink-304 Steel"
            },
            {
                "name": "Mounting Type",
                "value": "Countertop Mount"
            },
            {
                "name": "Item Weight",
                "value": "0.83 Kilograms"
            },
            {
                "name": "Special Feature",
                "value": "防锈, 可扩展"
            },
            {
                "name": "Manufacturer",
                "value": "guannian"
            },
            {
                "name": "ASIN",
                "value": "B0B55PVZ8F"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "small dish rack 001"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 911 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,247 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #226 in Dish Racks"
            },
            {
                "name": "Date First Available",
                "value": "June 27, 2022"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Our JAQ dish drying racks are both aesthetically pleasing and functional, which are made of top-quality stainless steel materials, rustproof, and very sturdy. It features stainless steel utensil holder which is separated into three parts that you can put your silverware separately. And Its dish slots can hold 7 dishes vertically. What's more. It is very convenient for you to carry the dish racks inside the sink or over the sink by adjusting the expandable hands. If you are worried that water drips land back in your marble after washing your dishes, you can choose our metal drying rack",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9e3abc81-adbe-4af5-9e0e-04d65dd33d51.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Small 304 Stainless Steel Dish Drying Rack 304 Stainless Steel Dish Drying Rack Dish Rack Organizer Cutting Board Organizer-Black Cutting Board Organizer-White Usage in sink, over sink in sink, over sink cabinet, countertop cabinet, countertop cabinet, countertop Material 304 stainless steel 304 stainless steel Power coated Power coated Power coated Feature 7-dish 7-dish 18-dish/9-mug hook 8-slot 6-slot",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9e3abc81-adbe-4af5-9e0e-04d65dd33d51.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ddb68ad8-2a27-46c4-981b-e6ca3421069a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f196e054-3044-4eb0-96c0-d95455986967.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c4604984-1262-47ca-b4ce-dd6fcbed2037.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b32c31e6-caca-4927-8b06-41782d204055.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c1de2c71-e5a1-49e3-b9cb-fcac5cb85de0.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/68555c6b-020e-4bbb-a5e1-e3a28e0aac0a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90e6d825-708c-4bcb-bad1-81ac9fcec5c2.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BlossomBlossom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMLXRDTANFWBF2YZBIEGQLQTYIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDDXRJG3P0UP2?ASIN=B0B55PVZ8F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Size Matters! #rabithole",
                "reviewText": "First, I must apologize for all the added/largely non-applicable info included - but I just had to pass on what I learned during a kitchen rehab. If you only want my reviee of this item please skip down to the very last, succinct, bullet point.I have a small kitchenette off of my bedroom that, after 23 years of above and below counter leaks, I was finally forced to upgrade. The upgrades have resulted in a lot of... BEHAVIORAL adjustments: I had a pair of plumbers fix the leaks and install a base grade sink/faucet, thinking my problems would be fixed. The pair left me with an unusually fat bill and, thanks to an old, warped formica countertop, HUGE gaps all along the sink edge. I needed to replace the counter so I went to a cabinet showroom and the sales guy said I should forget about another formica countertop and hit up a local stone yard for a REMNANT that he promised would be \"surprisingly\" cheap and would never warp. He suggested that INSTALLATION of any type of countertop was the expensive part so, why not (😒)? So I did. At the stone yard, I listened to the woman explain the pros/cons of granite vs. \"quartz.\" Then we went out into the open yard where I ignored all her warnings and fell head-over-heels for a beautiful slab of white \"quartz\" with gorgeous griege veining. She mentioned that an UNDERMOUNT double sink would free up more countertop space (YES, plesse) and she ordered the only stainless steel double bowl she could find. I looked at the cabinets and wished... but I'd already spent SO much so... no. All settled. Until... A few days later, a co-worker who rehabs houses (and who, apparently, reads my deepest thoughts) said \"If you aren't crazy in love with your (ratty) old cabinets (😒) you need to get new one's now or it'll be Expensive Mistake #2. You'll have to rip out the old cabinets AND that expensive \"quartz\" remnant and start all over again. STOP THE PRESSES!! The next day, I called to ask about cabinets. They sent out their guy to measure everything and I reported to the stone yard 4 days later to chat about cabinets. They autimatically assumed I would go for white shaker (yep), but I asked why they assumed. \"Because EVERYONE gets white shaker.\" More attractive than flat slab doors/drawers and easier to keep clean than more detailed designs. And this is for a very small (but increasingly expensive) kitchenette. Btw, the second pair of plumbers (a father & son) were brilliant, fair, and recommended by the manager of the stoneyard. I'll be their customer until one of us drops.My God, my new kitchenette cabinets and countertop are so glamorous. I like to stare at them often so I don't have to look at the rest of the room. But, while I love the LOOK, if I'd known just how much of a hassle \"quartz\" would be, over granite, I would have chosen a solid stone. You can set hot pans, skillets, and plates on granite. \"Quartz\", on the other hand, is not solid stone (hence, the quotation marks). Nope. \"Quartz\" is actually bits of stone ground up and held together with resin (i.e., plastic). Get heat on or too near plastic, what happens? Your countertop is ruined. I am constantly watching out for spills (need to be cleaned up immediately)... and it's only been four days. The only pros? \"Quartz\" comes in the most elegant man-made designs and doesn't require sealing. With granite (and I think, marble), you have less design oprtions but if you keep up on annual sealing, you can pretty much light a fire on it. A big deal in a kichen. hasI Should have heeded the saleswoman's warning. I'm constantly juggling hot items. You have to be SO careful all the time and you can't clean with 99% of commercial cleaners. Next, I got a stunning single-hole (Kohler Rival) matte black faucet (heavy as an anvil) with separate sprayer (it's plastic...☹). Perhaps the faucet is a smidge too large for such a small \"kitchen.\" I say that because the double sinks are so weird. They're very deep but the bowls are weirdly tight. I always liked to put a dish drainer down in one bowl and spray off the soap as I went. But I couldn't find a drainer locally that fit perfectly- so I came to Amazon and got THIS. I literally pulled it out of the box and immediately used it on the morning's dishes. Apart from wishing the little dish wires tilted forward a bit (They are straight up) so big plates wouldn't have to be so carefully stacked to keep from falling over, it's perfect for my weirdly-sized sink bowls. It holds quite a bit more than it should have to, and it doesn't take up any counter space. A very inexpensive \"WIN\" that makes me inordanantly happy. It's going to get a lot of use.Take-aways:- Never call a plumber with \"Affordable\" in their company name - and always get estimates first,-Do not install a countertop that can be easily destroyed by heat (Bathroom curling irons? Think twice there, too),- A single-hole matte black faucet with no deck plate (one drilled hole), even with a separate sprayer (two drilled holes) is vastly less time-consuming to keep clean than a lot of shiny metal, with parts sticking up, collecting dust, prints, and water spots.- Buy THIS dish drainer if you want more counter space and your sink is small. Everything else I saw was 1/2\" too big. For me, it's NEARLY perfect. I say \"nearly\" because, on closer examination the round rubber tubes encasing the wires on each end of the basket, designed to prevent any part if the wire of the basket from coming into direct contact with your counter (preventing countertop scratches around the sink, aren't quite thick enough to accomplish that, even with anUNloaded basket, much less fully loaded. I/you will need to add something to create a thicker buffer between sleeved wire ends and your sink/countertop.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Z9NO0Ew5L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lon Sorensen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDM3MC2Y6ARPYQCC5JJJLWLQWQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9PE9LUM9JNKN?ASIN=B0B55PVZ8F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Good choice! Good value",
                "reviewText": "I have an oversized sink and this is perfect for keeping the dishes draining nicely and off my countertops. Really like the stainless steel construction and the separate silverware basket. The only problem is one mentioned in another review that the prongs that hold the dishes up are a little too straight, so the dishes lean over. This has worked anyway as the dishes are still separated by the prongs, but I think when I get around to it, I will bend them back a little so they actually hold the dishes up as the other reviewer did. HOPEFULLY THE MFG will take note and adjust newer models, but I'd still buy it again. It hasn't bothered me enough to send me out to the shop to take care of it yet, so still gets 5 stars for being adjustable, sturdy and easy to clean.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Troy ClneTroy Clne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGD6QYPR3N7HUO6MXL2K2ZNBIFWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVDHGULBU6OR1?ASIN=B0B55PVZ8F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing item",
                "reviewText": "This is awesome, I live in a cool studio at the beach area and wanted something for my large sink that doubles for my bathroom sink and kitchen sink, this is perfect, it's strong, holds quite a bit, and just perfect for what I needed. A friend Paul sent me a video with one like it, but it was to small, this was the largest I could find as my sink is only 15 inches wide, I love this!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71N5lc54etL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDLSYL2UNP52E3DPAK4LMDCUSUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP20AM9CKM31Y?ASIN=B0B55PVZ8F",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "4.0 out of 5 stars It's perfect....almost.",
                "reviewText": "The dish rack, itself is perfect. It hangs in my sink and allows for quite a bit. There are three adults here and we generally have ample room for our dishes as long as I wash the pots and pans separately. I really love the dish rack. The utensil holder, however, needs some help. It's a good size, but because of the design, our spoons frequently get stuck. The tend to go through the wires sticking either out or into the 2nd compartment. Because of this, I'm giving it 4 stars instead of 5. Otherwise I'd give it a 5+ stars. I'm looking now for a utensil holder that will be compatible with this dish rack. I'd still recommend the rack, though.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71bKajDBCTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zaqSt3IdL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ying Zhu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKXESNVUBXNH3UMCOQFOZRQF6OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21G8U3BGKYPQR?ASIN=B0B55PVZ8F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Functional and easy to clean",
                "reviewText": "Quality stainless steel; simple design and very functional; easy to clean in dishwasher",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Camille",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSJEOQWMU6BWKWBL452ZHQXD2VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28U9HP1M7KZNU?ASIN=B0B55PVZ8F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Made well!",
                "reviewText": "It is well made and fits perfectly in my large sink. I love that it stays put and has a place to put utensils to dry.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R.Lynn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AET4ZGXU7NR6TVMRMHQ2IQ5D4JKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QJG70VC5WLJK?ASIN=B0B55PVZ8F",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "3.0 out of 5 stars A Bit Small",
                "reviewText": "Should have read the measurements more carefully. It’s a well-made product, but was just a bit smaller than I needed. Returned",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diane ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEL2UUH6QARE7KBRXOYHOV2BWAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D9SNPTAB0MFM?ASIN=B0B55PVZ8F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Works well",
                "reviewText": "Helps keep lids organized. Easy to store",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ellen C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 29, 2024",
                "reviewTitle": "Good quality n works well",
                "reviewText": "I used this rack for a while. Very satisfied with the quality. It fits my sink and function well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karla",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 17, 2023",
                "reviewTitle": "Pequeño y estético. Apto para tarjas petite.",
                "reviewText": "¡Es justo lo que buscaba! Mi cocina es muy pequeña y este escurridor le quedó perfecto. Lo recomiendo ampliamente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Annette",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 7, 2024",
                "reviewTitle": "Fits perfectly",
                "reviewText": "This item is a great purchase. Using in a commercial sink. Perfect for the small items washed but still gives access to the sink.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pablo Guzman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 7, 2023",
                "reviewTitle": "Buen producto",
                "reviewText": "Buen producto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 3, 2023",
                "reviewTitle": "Fits smaller sinks well",
                "reviewText": "Only issue is that our sink is a bit curved and this is pretty straight, so we hung the cutlery basket on the outside to better utilize the space. The material seems good, but we will see how it holds up!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}