{
    "remaining_requests": 19140,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Godboat-Valentines-Decorations-Auto-Drain-Kitchen/dp/B0CFQHWHXH",
    "body": {
        "name": "Godboat Valentines Day Decorations, Valentines Day Gifts, Dish Drying Rack with Auto-Drain, Dish Racks for Kitchen Counter, Dish Drainer with 360° Swivel Spout, Cool Kitchen Valentines Day Decor",
        "price": "$26.99",
        "originalPrice": "$19.99",
        "rawPrice": 26.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Godboat-Valentines-Decorations-Auto-Drain-Kitchen/dp/B0CFQHWHXH",
        "soldBy": {
            "sellerID": "A1UBP2KBE9N8W",
            "name": "hangweite-AAA",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1UBP2KBE9N8W&asin=B0CFQHWHXH&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C17LPWBW"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BBFXVLBN",
                "variationName": "Color",
                "variationValue": "1-tier",
                "price": "$26.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51xFrGPDrNL._SS36_.jpg"
            },
            {
                "asin": "B09XXNLNTT",
                "variationName": "Color",
                "variationValue": "2-tier",
                "price": "$33.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51K4oFk-8LL._SS36_.jpg"
            },
            {
                "asin": "B0CFQHWHXH",
                "variationName": "Color",
                "variationValue": "Compact",
                "price": "$16.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51xjHv0JJyL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51xjHv0JJyL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/512ryl3vKrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-2FLD5XAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51GOUpdwNiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51j8ZLZBc3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51e80hCOzxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lF5rhsL7L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Godboat Store",
            "link": "https://www.amazon.com/stores/Godboat/page/9C9390AD-5351-459A-8856-212424AA7009?ref_=ast_bln"
        },
        "brand": "Godboat",
        "merchantInfo": "hangweite-AAA",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4021,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 15 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Elegant and Compact Dish Rack】 - The drying rack for kitchen sink is made of high-strength metal carefully polished with high-temperature lacquer, ensure the kitchen drying rack anti corrosion and anti-rust. All corners are rounded and polished to avoid scratching and damaging items, and the hollow-out slot design makes it easier to pick up the dishes without worrying about falling. Comes with a large-sized knife and fork holder, make a nice look for your kitchen.",
            "【Automatic Draining & Non Wet Countertop】 - Godboat dish rack with hollow design makes it easy to reach items and drain. the dish drain with a 360-degree rotatable funnel-shaped draining tray can be adjusted according to the location of the sink at each side of the drainage, while the knife and fork rack has a separate drainage port together with the water into the draining tray, drain the water directly into the sink. make the kitchen looks clean and tidy.",
            "【Moderate Size and Space Saving】 - Size 12.99\" d x 16.93\" w x 5.91\" h, our dish drying rack for kitchen counter is enough for more than 10 different size plates and other tableware. Size 10.35\" d x 2.36\" w x 4.52\" h 3-slot cutlery rack that can hold a variety of knives and forks. Meets the needs of daily kitchen activities and say goodbye to clutter. It doesn’t occupy lots of space, and holds a decent amount of dishes/silverware/cups/glasses. Perfect size for small space.",
            "【Widely Used and Kitchen Gadgets】 - Godboat dish drainers for kitchen counter widely used in kitchen, farmhouse, new house, apartment, RV and camping. It's a good helper to manage your tableware and utensils when you are cooking or after eating. Free standing in the kitchen, a good assistant in the farmhouse, decoration in the new house, storage experts in apartment, a good helper in camping, cool gadgets in the RV.",
            "【Wonderful Gift Ideas & Deliver Best Wishes】 - On Mothers Day, Fathers Day, 4th of July, Hanukkah, Christmas, Halloween, Easter, Valentine's Day, Thanksgiving, New Year's Eve, Birthday, Wedding, Our Dish Rack Can Be Used as Family Gifts, Friend Gifts, Team Gifts, Teacher Appreciation Gifts, White Elephant Gifts, And 16 18 21 Adult Prime Gifts, For Mom, Dad, Wive, Husband, Sister, Brother, Grandmother, Grandfather, Boyfriend, And Girlfriend, Etc."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Storage & Organization",
                "link": "https://www.amazon.com/kitchen-storage-organization/b/ref=dp_bc_aui_C_3?ie=UTF8&node=510136"
            },
            {
                "name": "Racks & Holders",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=23691552011"
            },
            {
                "name": "Dish Racks",
                "link": "https://www.amazon.com/dish-racks/b/ref=dp_bc_aui_C_5?ie=UTF8&node=695483011"
            }
        ],
        "productInformation": [
            {
                "name": "Material",
                "value": "Metal"
            },
            {
                "name": "Product Dimensions",
                "value": "12.2\"D x 16.7\"W x 5.6\"H"
            },
            {
                "name": "Brand",
                "value": "Godboat"
            },
            {
                "name": "Color",
                "value": "Compact"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Dishware"
            },
            {
                "name": "Mounting Type",
                "value": "Countertop Mount"
            },
            {
                "name": "Item Weight",
                "value": "3.3 Pounds"
            },
            {
                "name": "Weight Limit",
                "value": "30 Pounds"
            },
            {
                "name": "Special Feature",
                "value": "Space Saving"
            },
            {
                "name": "Manufacturer",
                "value": "Godboat"
            },
            {
                "name": "ASIN",
                "value": "B0CFQHWHXH"
            },
            {
                "name": "Item model number",
                "value": "WDJ-2023-003"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,021 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#832 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #12 in Dish Racks"
            },
            {
                "name": "Date First Available",
                "value": "August 15, 2023"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Godboat - Dish Drying Rack, Sturdy Dish Rack, Multi-Functional Dish Drainer- Make Your Kitchen Clean and Organized ! Are You Still Troubled by Messy Dishes and Headaches from a Cluttered Kitchen? We Highly Recommend this Godboat Dishes Drying Rack to Make Kitchen Tidy, Keep Countertops Dry, Release Your Headaches about the Kitchen! 4 AREA DESIGN - Metel Dish Drying Rack + Tableware Rack + Plastic Drainboard + 360° Swivel Spout.Free Drainage System -It has a non-slip drain pan, which can collect water from the whole dishrack, allowing water to flow into the sink.Large Capacity -This drying dish rack is enough to store 10 bowls or plates, 10 knives, 10 forks, 4 cups,etc, which can meet daily needs.3-Hole Knife and Fork Holder -Come with a 10.35 \" x 2.36\" x 4.52 \" 3-slot cutlery rack, can hold various knives, forks, tableware, and utensils.Flexible Placement -The dryer rack has a 360-degree free-rotating drain, no matter which direction your sink is in, it can stand there perfectly.High-Quality -Made of high-strength metel, carefully polished & nano-coating, making our dish racks anti-corrosion & rust-proof, lasting for years.Perfect Kitchen Decor -Our dish drying rack with drainboard is carefully designed according to daily life and looks cool and beautiful.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7fa8cfd1-0e93-45b9-9e4f-55bc54cf3683.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Godboat - Compact Dish Drying Rack, 3-Hole Utensil Holder, 360° Swivel Spout, Automatic Drain & Non Wet Counter！ Godboat Dish Dryer Rack, Keeping Your Kitchen Neat and Tidy as a Nice Gift for Your Love ! [Well Displayed and Safe Storage] - Keep dishes, plates, silverware, cups, glasses, knives, forks, pots and pans neatly displayed and safely hold.[Suitable Size] - Our drying rack kitchen measures 12.99\" D x 16.93\" W x 5.91\" H and come with a 10.35\" D x 2.36\" W x 4.52\" H silverware holder, perfect for small countertop, kitchen, and space.[Nice Decor & Fashionable Style]- Pure black color, natural metal, simple and practical design showcases the cute and fashionable appearance of this Dishrack for Kitchen Counter, enhancing the decorative effect of the kitchen, making it a beautiful scenery and decoration.[Great Gift for Your Loved Ones] - During holidays, family gatherings, and revelry, this Multifunctional Dish Rack can be used as a special gift. Between family and friends, our Plate Holder can be used as a small gadget to convey love and blessings.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d5b99e1e-49b0-439f-8da5-e0989757c46c.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Godboat - Drying Rack Dishes, Dish Drying Rack with Drainboard, Nice Kitchen Storage and Utensil Holder！ Godboat Dish Drainer Rack, Small Dish Drying Rack, Say Goodbye to Clutter and Space Saving ! Does this Godboat drying rack for kitchen counter bring any convenience and fun to your life?When you are cooking, different sizes of bowls and plates are displayed in the kitchen dish rack, allowing you to freely pick up the items you want to fill your food.While you are enjoying a meal, you can choose what you want from the knife and fork holder and they're well organized so you don't have to worry about finding them!After dinner, the dish holder can be placed next to the sink, allowing you to easily put the washed utensils inside and keep them safe. The water on the utensils will quickly drain.When you are washing fruits or vegetables, this dish drainers for kitchen sink will help you drain the water out of them.Having this dish dry rack makes your kitchen more organized and keeps your countertop dry, making it a great decoration in the kitchen. Work well for you and your family, making your life more comfortable.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7c59dc06-4e82-4fd9-b758-bbee30359c93.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Godboat Compact Dish Drying Rack, Large Cutlery Rack, Enough to Meet the Storage of Daily Household Tableware. Godboat Dish Drainers for Kitchen Counter with Drainboard, Great Helper for Kitchen, Perfect for Families of 3-5 ! SIZE - 12.99\" D x 16.93\" W x 5.91\" H (Dish Rack) + 10.35\" D x 2.36\" W x 4.52\" H (Knives and Forks Holder) Well-Organized 10 Bowls or PlatesEnough Storage for 10 Knives & 10 ForksIdeal for Storing Pots and PansEfficient and Fast Draining SystemKeep Your Kitchen Dry and CleanWorks with Most Home EnvironmentsA Beautiful Addition to the KitchenA Perfect Home Decor and Nice Gift",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/442b55a6-1319-4f6e-84aa-ec1fac0c6f78.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Godboat Kitchen Dish Rack, Large Knife Holder, Quickly Drain, Suitable for Countertops and Sinks on each Side. Large Size Knife & Fork Holder Measuring 10.35\" D x 2.36\" W x 4.52\" H, the plastic knife holder has 3 slots for large capacity storage of knives, forks and scissors. Very convenient to fix knives and silverware in place.The cutlery holder with protruding drains to channel water easily into the drip tray, always keeping your plates dry and clean.The whole utensil rack is removable and free standing, it can be flexibly placed according to your kitchen layout. 360 Degree Rotating Drainer Spout The adjustable dry rack allows you to quickly and easily expand or collapse it depending on your kitchen space and storage needs. Unlike others, the surface of this dish drainer tray is not designed completely flat, but of slightly angled so that water drips quickly into the drainage holes. While the black spout of the metal dish rack can be adjusted 360 degrees to suit your needs for more precise and quicker drainage into the sink. U-Shaped Hole For Plates Godboat dish strainers for kitchen counter is made of high-strength iron, which is carefully polished and baked at high temperature, making it anticorrosive, rustproof and non-sticky, and can be used for many years. The large gauge flat iron of our dish drain boards for kitchen counter is machined into a curved shape to protect items from scratches, and the protruding plate slots allow for safe storage of different sized dishes.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce39c864-535f-497f-88ee-a13782292c11.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f7b64249-64d2-4d59-af28-35792a236a00.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9a36f4e-eae0-4873-b9aa-548d8e6abb65.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Godboat Kitchen Organizers and Storage, Applicable with Various Scenarios, Widely Used and Cool Gadgets ! Godboat Utensil Drying Rack, Widely Used in Kitchen, Farmhouse, New House, Apartment, RV and Camping. Free Standing in the KitchenA Good Assistant in the FarmhouseDecoration in the New HouseStorage Experts in ApartmentA Good Helper in CampingCool Gadgets in the RVIt's a Good Helper to Manage Your Tableware and Utensils When You Are Cooking or After Eating.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7a9b5169-acaf-4571-b908-010b6fff8041.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Godboat Kitchen Gadgets, Perfect Gifts for Women & Gifts for Mom, Easter Basket Stuffers, Cool Mothers Day Gifts. Perfect For Family and Friends, Great Gift Ideas For Men And Women, Amazing Gift for the Holidays ! During Women's Day, our Godboat products can be used as gifts for women, birthday gifts for women, gardening gifts for women, gift basket for women, thank you gifts for women, gifts for mom who has everything, gifts for women who have everything, gifts for adults who have everything, gifts for women who has everything, gifts for moms who have everything, gifts mom who has everything, birthday gifts for women who has everything, gift mom who has everything, gifts for sister who has everything, gift ideas, for women who have everything, gifts for her who has everything, unique gifts for women who have everything, gifts for wife who has everything, travel gifts for women who have everything, gifts for mother who has everything, gifts for woman who has everything, gift for moms who have everything, gift for women who has everything.During Easter, our Godboat products can be used as easter basket stuffers, easter basket, easter, easter baskets, easter gifts, easter basket stuffers for adults, easter crafts.During Mothers Day, our Godboat products can be used as mothers day gifts for mom, great mothers day gifts for mom, mother's day gifts for mom, mother s day gifts for mom, gifts for mothers day, anniversary gift for her, mothersdaygift for mom, birthday gifts for mom, mothers day gifts, mother's day gifts, mothers day gift, mom gifts, grandma mothers day gift, mother day gifts, first mothers day gifts, personalized mothers day gifts, funny mothers day gifts, mothers day gift ideas, mothers day cards, mother's day card, personalized gifts, mother's day gift, nana mothers day gift.When our Godboat product is used as a gift for family and friends, it can be used as mothers day gifts from daughter, mothers day gifts from son, mothers day gifts from husband, mother day gifts from daughter, sisters gifts from sister, mothers day gifts from daughter unique, mother in law gifts from daughter in law, mothers day card from daughter, gifts for grandma, gifts for mom, gifts for sister, gifts for wife, gift for grandma, sister gifts, aunt gifts, mothers day decor, grandma gifts, nana gifts, bride gifts, mothers day gifts for grandma, mothers day gifts for sister, mothers day gifts for daughter, mothers day gifts for wife, mother day gifts for mom, mother's day gifts for wife, mothers day gifts for friends.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e1983178-b196-487e-8efa-aeb9807f4fb9.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7fa8cfd1-0e93-45b9-9e4f-55bc54cf3683.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d5b99e1e-49b0-439f-8da5-e0989757c46c.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7c59dc06-4e82-4fd9-b758-bbee30359c93.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/442b55a6-1319-4f6e-84aa-ec1fac0c6f78.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce39c864-535f-497f-88ee-a13782292c11.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f7b64249-64d2-4d59-af28-35792a236a00.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b9a36f4e-eae0-4873-b9aa-548d8e6abb65.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7a9b5169-acaf-4571-b908-010b6fff8041.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e1983178-b196-487e-8efa-aeb9807f4fb9.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE73P633ZBNA3DAO6BW4CZF6BAHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JTZQ7DBZ3MUQ?ASIN=B0CFQHWHXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice clean looking and holds a lot, spout feature is cool",
                "reviewText": "My mountain cabin has a rustic kitchen and no dishwasher. My typical plastic dish rack was gross and didn’t hold much. On Thanksgiving I put this one to the test. It did well. Granted it didn’t hold the platters and pans etc but I can see for a small crowd it will do nicely. It looks clean which I like as well as the drainer spout feature. I did find it a little difficult to attach the top rack until I took a photo and zoomed it up. Hook goes under the bottom of rack over in the middle through to the top rack with all hooks pointing out. For attaching the top rack, hold your breath, hold one side then kind of force it into place on top. Once in it’s very secure. I think it will work well for me.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717RQhPO6OL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71brGKl551L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81FmIZheb-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa Lisa ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGMX3GMKEVLZQ635WPHS7MZISDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P7N3VYFUQ24H?ASIN=B0CFQHWHXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Sturdy construction plenty of space!",
                "reviewText": "To assemble the top tier, I did watch the video someone posted, since the directions were not clear, it was very easy. I have 10 inch square plates, so when I placed them diagonally they fit perfectly, with plenty of room. I love the silverware holder it is double the length of my old one. The cup holder is sturdy, it has a tray underneath and a drying mat, all for a good price. I'm happy with this purchase.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71gZN8WzzNL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr.Science",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHXRPML46VJOKPTDARPC6AR2EEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39CZGWHBLQPAR?ASIN=B0CFQHWHXH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Good value for money",
                "reviewText": "Been using this a couple months now. It gets lots of use, easy to store lots of dishes in it, don't use the dishwasher as often as we used to. Good design, even has a place to put a cutting board where it drips into the sink. The biggest problem is that the legs are only a couple of millimeters long, so if you have even a low lip around your sink, you'll have to block the rack up in order for it to drain to the sink. We have it perched on a couple of wooden blocks.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "San Diego SunKat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKZ7V5DZV5PGPEJ3DNCL4T2BOAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MRW0R8R6WQ5G?ASIN=B0CFQHWHXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars The instructions stink, but the product is great",
                "reviewText": "My sister and I finally figured out that you have to force the end of the sides into the smaller top shelf to get it to work. Then it is sturdy and wonderful. It fit under our cabinets to boot. We highly recommend this product!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wanaka",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOOH3BIX36U4NJNUUG4CI3RDV4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24EMUKWNFK6RK?ASIN=B0CFQHWHXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars I love it!",
                "reviewText": "I like everything about this dish rack. It's genius for draining water! Love the color, the size. It's well made and as described. I'd buy it again. But it might be awhile as this one looks durable and will last a long time.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R.CR.C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI73VYU72IENOMAAZHDC2PWJVNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ0YIHQIS3X5A?ASIN=B0CFQHWHXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Great dish rack",
                "reviewText": "So I took my chance on this dish rack. I was looking for a large dish rack that was black. After reading tons of reviews on several different racks I ended up chosing this rack. I really like the style, the knife compartment part, & the way it strains the water. So far it's been great. Enough for my dishes and ended up being the perfect size. Of course, after having it for several months, the water marks are there, but that happens to all racks. I would definitely recommend this rack. I will purchase again, when I need to replace.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7104KxOpedL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711nmBQVLPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71PCoB4JNlL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Pk-QFZRYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71V4B+zoamL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71auJ68P1dL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TRexa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVONAI2ZEBMHPP2X4J2QG55VRTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROAQ61J4OFNB7?ASIN=B0CFQHWHXH",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "3.0 out of 5 stars Missing Part, Slightly Inaccurate",
                "reviewText": "Recieved the product very fast after purchasing. Arrived in excellent condition. It took a little time & patience to assemble. Instructions weren't the worst I've seen, but not exactly straight forward with every step. Works great so far & feels sturdy, even with having 2 levels. Overall a little more compact than I was expecting (and much more than the last drying rack I had) but gers the job done, just won't be able to hold as many items.I deducted 2 stars because - 1. The water drain spout is not NEARLY as long as they make it look in the photos. I purchased the two tier drying rack and no matter what direction I rotate the spout, it barely reaches the end of each edge. This means you have to put the edge of the rack right up against the edge of your sink, unless you'd like to have to wipe down your counter every single time. I strongly dislike this short spout and didn't appreciate that inaccurate advertisement.2. My dish rack did not come with the cup holder. Definitely disappointed with that.All-in-all, it's just okay. It'll do the job for now, but for the price, I expect better. Not something I would repurchase.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patty C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWFNMPXLSHMPMGWDNIE2BEUD6ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SE99ZFKRWH07?ASIN=B0CFQHWHXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Great dish drying rack.",
                "reviewText": "I love this drying rack. It fits everything. I really LOVEthe cutting board attachment. I use it for small sheet pans as well as cutting boards. The Compartment for silverware is great. It has 3 compartments in it. So I can do my spoons and won forks in another knives and other things in the third one. And keep things separated easier to dry and put away. The top tier is easy to put on and can be removed if not needed everyday.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesse Ireland",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 5, 2024",
                "reviewTitle": "Great quality and size",
                "reviewText": "Great dish rack. The size is just perfect for my apartment counter and still able to hold all my large dishes and cookware. Sturdy metal frame with a plastic base, and the moveable spout is convenient. Like the addition of the cup holders and drying towel!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 27, 2023",
                "reviewTitle": "Great",
                "reviewText": "Works well for our space",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2024",
                "reviewTitle": "Very sturdy and tidy",
                "reviewText": "Once assembled, it is very sturdy and holds a surprising amount of dishes. Makes my kitchen counter look SO much tidier.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debbo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 10, 2023",
                "reviewTitle": "Nice in black dish rack",
                "reviewText": "Good solid product. Doesn’t quite fit on the sink drainer but a nice product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelvin Fong",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 9, 2023",
                "reviewTitle": "Great drying rack",
                "reviewText": "Good size, I wish the drain spout extended a bit longer.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}