{
    "remaining_requests": 21169,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/COSRX-Hyaluronic-Intensive-Cream-100ml/dp/B072FH17NJ",
    "body": {
        "name": "COSRX Hyaluronic Acid Moisturizing Cream, Long-lasting Hydration, Rich Moisturizer for Sensitive Skin 3.52 oz / 100g, Korean Skin Care, Animal Testing Free, Parabens Free",
        "price": "$12.52$12.52 ($3.55$3.55 / Ounce) $11.82$11.82 ($3.35$3.35 / Ounce)",
        "originalPrice": "$24.00",
        "rawPrice": 12.52,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/COSRX-Hyaluronic-Intensive-Cream-100ml/dp/B072FH17NJ",
        "soldBy": {
            "sellerID": "A2E3ILYZ70ZIBL",
            "name": "COSRX",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2E3ILYZ70ZIBL&asin=B072FH17NJ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Ee3YYZvXS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/415QKPJHYOS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419zsSHauRS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31FKSwNY1QS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31LS62eEd9S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Vr-zDuagS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/C1TWDuEUlnS.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/69e83f68-de9b-4070-b6ab-1e9175bed852/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ce321301-cf53-4058-b424-78fb8a444f27/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3b769f29-621f-4f45-bd8c-49f6fa6de1cd/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2e5bc8f3-a460-4bfa-ab05-09ddaac3d65a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63acbf82-af0b-449e-a220-c245731676d0/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6fab9a15-b63e-4583-86b2-86545026d9e7/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the COSRX Store",
            "link": "https://www.amazon.com/stores/COSRX/page/C65C37C6-99CB-4105-9EFE-3E0C3F377888?ref_=ast_bln"
        },
        "brand": "COSRX",
        "merchantInfo": "COSRX",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3395,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 11 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Recharge and Lock in Moisture: COSRX Hyaluronic Acid Intensive Cream is designed to deliver moisture deep into your skin. Locking the moisture into your skin, the cream provides long-lasting nourishment and hydration.",
            "Thirst-Quenching: Your parched skin will thank this ultimate thirst quencher which has an intense moisturizing quality. None-oily yet greatly hydrating, it will leave your skin smooth and supple.",
            "Key Ingredients: Hyaluronic Acid, found naturally on our skin, helps your cells to retain moisture. With additional antioxidizing benefits, it is safe for all skin types.",
            "Plump and Dreamy Radiance: This cream is the key to plumping out the fine lines and delivering the glow. Grasp on to your bright youthful skin texture while hydrating from its roots.",
            "COSRX Standards: Clean Beauty - All COSRX products are formulated with skin-friendly ingredients that alleviate irritated skin. Hypoallergenic, Dermatologist tested, Animal Testing-FREE, Parabens-FREE, Sulfates-FREE, Phthalates-FREE"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060711"
            },
            {
                "name": "Creams & Moisturizers",
                "link": "https://www.amazon.com/Facial-Creams-Moisturizers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11061301"
            },
            {
                "name": "Face Moisturizers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=16479981011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2 x 2 x 1.5 inches; 3.2 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 8809416470122"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 778714091644 888243073636"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ COSRX Inc."
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B072FH17NJ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#926 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #30 in Face Moisturizers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 3,395 ratings"
            },
            {
                "name": "Brand",
                "value": "COSRX"
            },
            {
                "name": "Scent",
                "value": "Unscented"
            },
            {
                "name": "Item Form",
                "value": "Cream"
            },
            {
                "name": "Active Ingredients",
                "value": "Hyaluronic acid"
            },
            {
                "name": "Unit Count",
                "value": "3.53 Ounce"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Hyaluronic Acid 3,000ppm = Water 18L Found naturally on the surface of our skin, Hyaluronic Acid aims to deliver rich and long-lasting hydration to your skin. Locking in water and penetrating deep inside, it is a game-changing intensive cream. Little Goes a Long Way This thick cream is meant to be used in little amounts for effective absorption and perfect nourishment! Just a little bit will give you the expected result, unlike other creams that leave you dry and underwhelmed even after slathering it on. Soft, Supple, and Youthful Glow Plumping up your fine lines while delivering intense moisturization, COSRX Hyaluronic Acid Intensive Cream is formulated to bring back your skin to where it came from. Safe for all skin types. Sensitive, dry, and acne-prone.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a23024b-eeb2-4d96-92b2-2d33e9e60280.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83a413fb-d4c8-4b68-b357-cadb6643c9be.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4988304a-f501-4aa6-bead-9c6f4127bb9c.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8beb610d-7cf3-4a27-aa98-fc794566927e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8c7a0748-2e01-4847-ac9d-c68b6db6bd50.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56ff0abf-8f99-48eb-9786-423acbd013e8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a23024b-eeb2-4d96-92b2-2d33e9e60280.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83a413fb-d4c8-4b68-b357-cadb6643c9be.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4988304a-f501-4aa6-bead-9c6f4127bb9c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0ab8f5b2-42cb-4728-bdce-7fd561642078.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ZenzininZenzinin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWUOA2BDVMFNEXWNSOZAQ5NV5VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LJFL65JOGVL?ASIN=B072FH17NJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2020",
                "reviewTitle": "5.0 out of 5 stars Done Looking For a Moisturizing Face Cream",
                "reviewText": "I am done with looking for a moisturizing face cream. This is it. I have combination skin. This works for me, and so my quest for it is finally done. After 3 months of using it in various weathers (from 100F to 30F), here is my review AND tips on how to use it to maximize benefits.Summary PROS:- Very moisturizing- Non-scented (huge plus!)- A little goes a long way- Considering how little you need to use, it is very cost-efficient- Absorbs quickly, but you need to find the sweet spot on the amount to put on your face- Goes well under makeup- Last line of skin care- Not an essence nor serum, but if you’re looking to skip or simplify a step (of the thousand Korean skincare steps) but still add hyaluronic acid to your daily life, this is for you- Great for all weathers, however, the more hot and humid it is, the less you should apply- Is great for dry and normal skin types- Is good to ok for combination skin, but MAY need additional sebum-controlling products (recommended tips later in this review)- May be tolerable for oily skin type, but will definitely need additional sebum-controlling products (recommended tips later in this review)- Works well with both COSRX Advanced Snail 92 All in one Cream (as second to last skincare step)- Works well Korean Skin Care Snail Repair Cream (as second to last skincare step)Summary CONS:- Not an essence nor serum, so you may look down on this product- Incorrectly applying too much leads to oiliness, and possibly breakouts- For combination and oily skin types, may need additional sebum-controlling products- Need to mist water onto face before applying this cream, for maximum absorptionREVIEW:Others have said it, but I’ll say it here anyways.1. You need to mist/pat water on your face before applying this cream so that it absorbs perfectly and not be greasy, oily, or sticky. You don’t need a lot of water. I got this little 1 oz spray that I filled with filtered water and just spritz some on my face and neck – the water in that 1 oz spray lasted 2 months from daily use. That’s how little water you need to mist onto your face. At first, I used rose water for 2 weeks. Then I changed to filtered water. It made no difference at all. It does make a difference if you don’t apply any water though. Also, it was easier with a spray than just patting water on my face, because it just feels a lot less wet with a spray. I can control how much I want to mist.2. A little goes a long way. You need to play around with how much cream to apply to your face. You’ll find the sweet spot on the amount after a few days or a week. I was soooo surprised with how little I needed to apply so that it is just moisturizing enough AND doesn’t make me oily or make my face feel heavy and grimy. I absolutely hated this product when I first got it because I put too much on and it felt heavy and sticky, plus it looked so oily – the bottle seemed so small too that I was a bit upset with the price. I had considered The Ordinary Hyaluronic Acid beforehand, but went with this Cosrx instead because it was on sale AND I hated the idea of having yet another essence/serum; I gotta say I was really regretting my decision at first. However, I didn’t know I was just putting way too much in the beginning. I was putting the same amount on my face like all the other face creams I’ve ever had – and that was just a big fat NO. Later, as I looked at the reviews, I realized that I may have put too much. I gave it another try. It took a whole week for me to finally accept that all I needed was about 1/10th of what I usually apply. And OMG, I just loved it. I was like, are you kidding me?? That’s not possible. It was so moisturizing and not oily at all with such a tiny amount. Even in the winter’s dry icy air, my face never once felt tight or dry! That has never happened in my entire life of 35 years with any face moisturizers. That was when I finally felt like I found THE moisturizer.This cream is really moisturizing if applied correctly, ie. with a little water and apply a fraction of the normal amount, it lasts you for a very long time. I transferred some into a smaller container/jar 3 months ago, and I have barely even used half of it in my travel-sized 20ml cosmetic jar. I’ve used it in dry hot 100F and cold 30F, and it’s great for all weathers. I do apply a bit more in colder weather than I do in hotter weather. I apply even less in humid weathers. This is the one face and neck cream that I have to be careful with how much I apply because it can be too oily. I also like that this isn’t an essence/serum.While I was on board with 9 or 10 or 12 step Korean skin care thing for a couple of years, I have grown tired of it. In fact, I have grown tired of makeup. However, I still believe in Korean skincare on a whole. It’s in line with my beliefs – take great care and focus of skincare first, then natural-looking makeup. I’m at the age where regular face moisturizers no longer work and require something more, to help with the dryness, lines, and sag. Which is why I wanted hyaluronic acid in my skincare, but not as an essence or serum. Instead of a ton of steps, I wanted to simplify and condense the steps but still get some of the benefits. I guess I am just lazy, but I honestly can’t tell the difference with this hyaluronic acid intensive cream and a pure and dedicated hyaluronic acid essence/serum. Because I can’t tell the difference, I am going to stick with this cream as a face moisturizer until I get older and require more work. For now, it works and it’s great. I feel my face is properly moisturized, protected, and plumped and firmed. I am just really happy with it.Regarding snail creams, they are usually not as moisturizing. However, they do work well in clearing blemishes, not clog pores, and helps the skin a bit…. amongst quite a few other benefits. So, I usually put on snail cream first, mist my face with water, then finally apply this Cosrx Hyaluronic Acid Intensive Cream.Tips for combination skin and oily skin:The one thing about this cream is that no matter how little I put, I’ll eventually look oily as the day progresses, and that’s because I have combination skin, especially my T-zone. So I have to use a sebum-controlling mineral powder. While I have tried a lot of face moisturizers to date, I have not really tested out mineral powders. Maybe I got lucky but I only tried the Innisfree one and it happened to work perfectly. So the two I use is the Innisfree No Sebum Mineral Powder 5g 0.17oz (usually $6-7) and the Innisfree No Sebum Mineral Pact, 8.5g (usually $10). They are both essentially the same thing, but one is a pact and the other is a powder; both have their benefits and downsides. The mineral PACT is not as natural and takes longer to absorb but is more convenient to use and lasts a long time, so I only use this either at night or if I don’t have to see anyone for at least 30-45 min. The mineral POWDER is more INconvenient and doesn’t last as long, but it’s absolutely a ton more natural-looking and absorbs right away. The powder is the one I take with me in my purse to touch up any shine when I have to see people. The pact is the one I leave at home. Sometimes, I only need to use either one once in the middle of the day and that’s all I’ll need to control my sebum (oils) for the rest of the day. Of course, this will vary from person to person and from weather to weather. I feel it’s better than the makeup kind of pressed or loose face powders because this doesn’t clog my pores, doesn't cake with multiple applications, and it doesn't dry my face out. And since it’s supposed to be colorless (with the exception of the initial white when you apply it), I don’t have to worry about matching it to my skin color. All this Innisfree mineral powder does is absorb and control my sebum.This powder/pact is the last thing I put on my face after moisturizers, sunblock, and/or makeup. Sometimes, I have to apply another layer after a few hours. This also helps to control my breakouts when I take omega 3. When I consider all the face products I buy, this powder/pact is something I just can’t do without because of my oily, acne-prone skin. So, I no longer try to look for other sebum-controlling descriptions in moisturizers, creams, serums, and essences. As long as I have this to apply on top after everything, I feel like I can use any products now.",
                "reviewVotes": "607 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81TBgHFoiuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81gEvVOJ5fL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Berry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESPVKJCG5DR4K7AQOY5HM5H2E2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AUNG9A8Z9QAV?ASIN=B072FH17NJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing Hydration, Budget Friendly",
                "reviewText": "Your skin will love it. Your wallet will thank you.I have tried a number of night moisturizers over the last year. I typically spend about $70 for a small jar of “premium” night moisturizer. With winter here, I’ve been hunting for a better product. On a whim, I bought this CosRx product. IT DELIVERS MOISTURE! This is my new favorite pm moisturizer. I am 49 and have dry, sensitive skin. I also just started using prescription retinol, making my skin even more parched than usual. I am utterly surprised by the high quality. The hype over CosRx is well deserved. I just apply it after my evening serum. I haven’t had any problems with stickiness or pilling. My skin looks great and feels smooth. I highly recommend!",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andy.   I ordered xxl navy blue. They are perfect the fit is loose and comfortable The weight of the fabric is perfect . I love them and will order another pair in a different color",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUTQMB3R7GPU4D5UQ7YNCY2GVMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P930A1EV3J06?ASIN=B072FH17NJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "These products are amazing. I use this and the power essence. They moisturize my face and soften my face. I am a senior women and I have lines and wrinkles much to my dismay. I also have dry skin but this softens the dryness and wrinkles and make them less noticeable. I use these 2 a day and it makes a big difference. I went a week without using this to see if I saw a difference the results are absolute. Without it my skin was dull , painfully dry and the wrinkles I have were very pronounced. With it my skin looks healthy, moist, pumped up and has a glow. I have used many high priced products and while they do work I live on a budget. I would compare this with any of those. I personally prefer these products. I find these reviews very helpful and hope this helps others. This is absolutely a wonderful moisturizer and works great.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shantavia Reid",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4DP6LH7QAL6FQE3K45MGMCSMEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M9NM79ECVGFY?ASIN=B072FH17NJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "4.0 out of 5 stars Loveeee",
                "reviewText": "So I have oily skin, or at least I thought I did. But I've been using this for about two months now and the level of oiliness I have has significantly reduced. It leave my skin feeling extremely moisture thought the night. It does have a velvety feel on the skin when you apply it and it doesn't mix well with the sunscreens I've tried thus far (because it's a grl cream). I will try with a new sunscreen I bought and update you. I use it lore for nighttime moisture because I can't use it with Sunscreen. I absolutely love it though. And I'll continue to repurchase for sure. The jar usually lasts about 2-3 months",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JustAMom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLUDZRL6EFQHVNCVI5QCGPD37WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I75DNU1WAQBV?ASIN=B072FH17NJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2023",
                "reviewTitle": "5.0 out of 5 stars The only thing that's worked for my super dry skin",
                "reviewText": "As a 49 year old woman living in the north east, my skin is ALWAYS dry. I've tried every \"super moisturizing\" cream on the market and still feel dry, flaky and tight. I ordered this one not expecting much but was very pleasantly surprised.It doesn't have a powerful smell, it feels great going on, it's pretty affordable and my goodness my skin actually looks downright DEWEY after I use it. The moisture lasts all day too!I recently ran out of this and picked up another Hyaluronic Acid cream at the store figuring it would give me the same results but I was so, so wrong. The other cream reeked of perfume and my skin felt dry and tight. I rushed back to Amazon to re-order this and will never run out again.If you have oily skin, this might not be the cream for you. It's definitely heavy. But if you suffer from dry skin and had given up on ever feeling moisturized - try this cream. It's the BEST.",
                "reviewVotes": "42 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "megan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZGP5JZUDKLPYSNWK74VMMKG3IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R226DDPJ1B1AQZ?ASIN=B072FH17NJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Its awesome for after a chemical peel",
                "reviewText": "I got a chemical peel and needed a good moisturizer that wasn't scented and was going to hydrate my skin. I feel like stuff from sephora/ulta/drug stores always has some kind of scent and no matter how good the product is, it has some kind of scent or some kind of chemical exfoliant. I used the snail mucin and put this on top (I waited 24hr of course to wash my face after my peel) and it is definitely doing its job and really moisturized my skin. Def recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIWAUE3HRUDP3FYSKCFCPWNQMJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YIAIRU7P6Z0A?ASIN=B072FH17NJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars my favorite nightly moisturizer",
                "reviewText": "i’ve been using this moisturizer at night because it’s pretty thick, and i definitely notice the change in my skin. it’s much more hydrated and my cheeks haven’t been dry and flaky like they used to be. you could probably use it twice a day if you have super dry/dehydrated skin, but using this at night and a light gel moisturizer in the morning has worked perfectly for me",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CM ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 9, 2023",
                "reviewTitle": "PROBANDO PRODUCTOS KOREANOS",
                "reviewText": "Super hidratante. sólo la uso de noche, vivo en un lugar húmedo y si lo aplico durante el día mi cara siempre está brillando. Una gotita funciona muy bien para toda mi cara. Llego en muy buenas condiciones.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "XingGal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 26, 2023",
                "reviewTitle": "Just awesome",
                "reviewText": "Had heard about the product and now after using it can definitely say worth the buy..skin has come so much better and clearer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "standard girl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 7, 2024",
                "reviewTitle": "Great moistuizer",
                "reviewText": "Great moisturizer for dry combination sensitive skin! It keeps my face moist and not dry, fully recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon カスタマー",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on October 13, 2023",
                "reviewTitle": "しっかり潤う",
                "reviewText": "秋になり急に乾燥してきたので、これまでもcosrxのクリームを使っていましたが、今回は新しいクリームに変えてみようと思いこちらを購入。肌に乗せるとスーっとなじんで気持ちよく、でもほんの少しだけ油膜感があるのでしっかり蓋をしてくれる感じもあり、べたつかずツヤ感も出て凄くおすすめ。しっかり保湿されるけど油っぽくならないから、メイク前にも良い。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lupita Mar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 23, 2023",
                "reviewTitle": "Crema hidratante con ácido hialuronico",
                "reviewText": "Crema espectacular , me quedo muy bien ya que mi piel es seca . Es un shot de hidratación.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$14.09",
                "sellerName": "ThirtyFirst Highland",
                "sellerRating": "5"
            },
            {
                "price": "$16.50",
                "sellerName": "Wholesale Plus Traders",
                "sellerRating": "4.5"
            },
            {
                "price": "$17.79",
                "sellerName": "Glamstore US",
                "sellerRating": "4.5"
            }
        ]
    }
}