{
    "remaining_requests": 21011,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Natural-Organic-Beauty-Recipes-Moisturizers-ebook/dp/B00TXNQYJQ",
    "body": {
        "name": "Natural & Organic Beauty Recipes - Complete Guide to Organic Homemade Facial Masks, Scrubs, Toners, Lotions, Moisturizers & More, 50 Simple & Easy Natural ... Recipes Included (Skin Care Series Book 1)",
        "price": "$4.97",
        "originalPrice": "",
        "rawPrice": 4.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Natural-Organic-Beauty-Recipes-Moisturizers-ebook/dp/B00TXNQYJQ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81fs0XkudVL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Evelyn R. Scott",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_ebooks_1?ie=UTF8&field-author=Evelyn+R.+Scott&text=Evelyn+R.+Scott&sort=relevancerank&search-alias=digital-text"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 50,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Have you noticed? You continue to use cosmetics & products promising you an acne-free life, anti-aging results, smoother glowing skin...But the more you use these products, the fewer results you see. If you're like millions of other people, you may begin to feel they only prove to be a waste of both your money (the best of these products come with a hefty price tag!) and your time.There very well could be something else that is being \"wasted,\" too -- your very health. It's true! Even the so-called natural and organic cosmetics seem to carry potential dangers -- despite the soothing assurances of commercials and manufacturers.If you put cosmetics on with less than healthy -- even toxic -- ingredients, guess what happens?All the potentially toxic items soak directly into your skin and into your system. Surely there must be a better way to make you look and feel better without putting your health on the line everyday!What if I told you there were products available that are natural, and many times organic that wouldn't harm your skin or endanger your health?What if I told you there were products you can use and be absolutely sure of the ingredients you were using?What if I told you the ingredients for these outstanding skin care remedies are waiting for you right now in your very own kitchen? All you need to do is gather the items and make them.It's true and this is what \"Natural & Organic Beauty Recipes\" will show you.Just imagine being able to have healthier & more beautiful skin in just 7 days (or less) without becoming frustrated or wasting your time. Here's what you'll discover in \"Natural & Organic Beauty Recipes\": - The potentially dangerous and toxic ingredients lurking in many modern cosmetics... - How to understand the advantages of creating your own skin care recipes, therapies and treatments... - Dozens of easy-to-make, all-natural recipes for facial scrubs, masks, under eye treatments, moisturizers and more... - 7 everyday but often overlooked tips and tricks for understanding your skin and giving it the best treatments... - WARNING: 3 things you should never do when it comes to creating your own homemade skin care treatments... - 6 time tested and proven strategies to reducing, treating and curing many common skin problems... - How to use natural skin care recipes to improve your skin's moisture content and repair damaged skin... - How to use skin care recipes to boost your skin's ability to protect itself from environmental toxins... - And much more...",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Health, Fitness & Dieting",
                "link": "https://www.amazon.com/Health-Mind-Body-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10"
            },
            {
                "name": "Beauty, Grooming, & Style",
                "link": "https://www.amazon.com/Beauty-Fashion-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4601"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00TXNQYJQ"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 22, 2015"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 239 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 130 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,529,674 in Kindle Store (See Top 100 in Kindle Store) #1,806 in Style & Clothing #2,624 in Beauty, Grooming, & Style #417,250 in Self-Help (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 50 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Gloria L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUN34KLPCLCDZDLLHFEIJB2ANDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BLH8M7LRODIA?ASIN=B00TXNQYJQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2012",
                "reviewTitle": "5.0 out of 5 stars Quality information within matches the beauty of the cover...",
                "reviewText": "I ran across this little gem of a book when I was looking for recipes to make my own beauty products with healthier ingredients. It definitely has those and so much more! The 50 recipes included in the book are worth its purchase alone and that's just part of the book. I appreciated the simple explanations that made it easier to understand why regular beauty products are most often very unhealthy for the body with the chemicals they contain. In my opinion the front cover of the book is an accurate indicator of the information within. The beautiful picture and colors that indicate practicality, health, and efficiency which are delivered through the pages of the book. Even without the recipes, I probably would have purchased it anyways once I read the table of content of all it contains. Having the details provided on hand any time I need to refer to them makes this a very wise purchase - at least for me and probably for anyone else concerned about their beauty products and how they might be detrimental to overall good health. I can't wait to try out some of just the regular tips and suggestions given for my skin type and will be picking up the ingredients I need in order to make my own products from these recipes. Such fun and useful information I will enjoy using for years, and I definitely recommend this book if are looking for healthier beauty products and tips for creating your ideal complexion according to your skin type.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gloria",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUEFUY4NML7B3TR2A457D37KOFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26DLN05LL0ISH?ASIN=B00TXNQYJQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2014",
                "reviewTitle": "4.0 out of 5 stars Inexpensive Beauty Products!!",
                "reviewText": "What an inexpensive, easy way to save on beauty treatments! In the first chapter, the author gives you the ingredients to avoid when buying beauty products. I was surprised when looking at mine that 70 percent contain harmful or maybe cancer prone ingredients. It is important to me that my beauty treatments and frankly anything else that has to do with my body be natural.Great and inexpensive read for those who are interested in using natural products for their beauty treatments!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "angie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHKXLAGR4GURA6NYAWUGR2KWNBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X8IB1FGDISD8?ASIN=B00TXNQYJQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 18, 2012",
                "reviewTitle": "5.0 out of 5 stars Great information on organic beauty products!",
                "reviewText": "I was searching for information on organic beauty products when I found this book. It was very informative about organic products and gave me a ton of suggestions and easy ways to make products organically. There are also beauty secrets to keep your skin young and looking the best it can be without all the chemicals and expensive beauty creams. This can save you money in the long run and it can also help you by using all natural ingredients. I used some of the products on my skin and they felt great on my skin and they also made me appear more youthful. There are several more tips that I want to try and I am looking at other products that I may be able to use that are organic. You can have glowing and beautiful skin and not spend a lot of money and this book taught me how to do this without a lot of hassle. I would recommend this book to anyone who cares what goes on their skin and also has concerns about the environment.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashleyyy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDXYBIFIQDQOYH5WAVYU6K4XVRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R345JKFQFOUASC?ASIN=B00TXNQYJQ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2014",
                "reviewTitle": "3.0 out of 5 stars Halfway-decent recipes, but nothing to write home about",
                "reviewText": "I appreciate the information the author provides about traditional skincare products and the ingredients to avoid. There is also a section which explains the benefits of specific ingredients. However, I was disappointed in the recipes. Most of the recipes are for immediate use, not make ahead long-term use. I was hoping to make jars of creams, lotions, etc, but most of the recipes have an expiration date of a few days or less or need to be refrigerated. I have made many natural skin care products and was hoping to get some inspiration from this book, but that did not end up being the case.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSEI362ZFAKCYSRHDVDSLSE53XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CYE7D0N55ZMV?ASIN=B00TXNQYJQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2014",
                "reviewTitle": "5.0 out of 5 stars A Useful Guide with Easy to Prepare Recipes",
                "reviewText": "As a woman in her forties, I know I need to take care of my skin, especially my face. I have been hesitant to purchase facial products to due price and sensitivity. I decided to read this book to see what I could make for myself that would be free of chemicals and save me some money.What I really love about this book is it not only goes over what to use on different skin types and how to apply different skin care treatments. The recipes are so easy and I found I had many of the items in my pantry. I was especially excited to try the pumpkin sugar scrub. It worked great on my dry skin.The book is an easy read with a good deal of useful info including, but not limited to, the simple and easy to prepare masks, scrubs, toners, and lotions.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Canjor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2GV2ZTZUT2D5ACL3EAPMZ5EQXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WWQP2ZP01HXX?ASIN=B00TXNQYJQ",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2014",
                "reviewTitle": "2.0 out of 5 stars I was really disappointed because the reviews seemed great and the index looked ...",
                "reviewText": "If you're looking for something with details, this isn't it. It was mostly fluff and repetitive recipes. No recipes for cleansers, just talk about nothing. No recipes for hair shampoos/conditioners, no essential oil recipes, no real lotion recipes. I was really disappointed because the reviews seemed great and the index looked good, but there was fluff where there should have been substance. This should be called the advice/moisturizer, toner book and leave off the general 'beauty' term.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mint tea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXI7GNGRCBHEI5WLFPWPMROK54A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJV0PZR5EXLQ8?ASIN=B00TXNQYJQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2013",
                "reviewTitle": "5.0 out of 5 stars Easy to follow and fun to read!",
                "reviewText": "This book is a great read for anyone that is interested in making their own scrubs, masks, toners and more. It has a very interesting rundown of some ingredients in the soaps and beauty products we buy, and is packed full of easy to make recipes that will help your skin, make you feel nice, and not hurt your pocketbook. There are even tips and pointers on how to determine what kind of skin you have and what is good for each type. I found myself looking at the recipes and getting very excited because I have most of the ingredients just lying around in my pantry anyway. I will be trying some of these recipes very soon!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RawVeganGoddessNoire",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAXB7HNYN5ETH2RJA5TJKLG5CQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GH1A53TFOR8G?ASIN=B00TXNQYJQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 5, 2013",
                "reviewTitle": "4.0 out of 5 stars Great Recipes!",
                "reviewText": "Great book and the recipes were easy to make. The directions are straight forward and I had great results with most of the recipes that I had tried. I downloaded the book right away and started making delightful body treats. I recommend this purchase for the novice and the seasoned crafter.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "redhead",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 2, 2014",
                "reviewTitle": "organic receipes",
                "reviewText": "Good starter book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lidia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 21, 2016",
                "reviewTitle": "Good Book",
                "reviewText": "Good book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}