{
    "remaining_requests": 21005,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sensitive-Skin-Complete-Joanna-Lumley/dp/B00170JRTW",
    "body": {
        "name": "Sensitive Skin - The Complete Seasons 1 and 2",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Sensitive-Skin-Complete-Joanna-Lumley/dp/B00170JRTW",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51HK5DqeLoL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Joanna Lumley",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_dvd_1?ie=UTF8&search-alias=movies-tv&field-keywords=Joanna+Lumley"
        },
        "brand": "Joanna Lumley",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 70,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Product Description Sensitive Skin: Complete First and Second Seasons (DVD)Al (Denis Lawson) and Davina Jackson (Joanna Lumley)seem to have the perfect life. At 60, they both look great, enjoy their work (he's a music writer for a newspaper; she works in an art gallery) and having finally said au revoir to their son, are ready to indulge themsleves with a funky centeral London apartment and a retro 70s Silver Shadow Rolls Royce. Still, something, somewhere, somehow doesn't feel quite right. Is it that their 30-year-old son Orlando refuses to acknowledge adulthood? Or that Davina's sister Veronica and her husband Roger intimidate them with their confident grasp of life and comprehensive pension plans? And don't forget the sexual temptation, the professional jealousy and that burning question: is this the life I wanted?]]> Amazon.com Weathered but luminous, Joanna Lumley (Absolutely Fabulous) glows in Sensitive Skin, a lovely comedy-drama from the BBC. Davina Jackson (Lumley), a 61 year-old wife, mother, and art-gallery assistant, has begun hallucinating imaginary friends and the personification of her frustration. Her husband Al (Denis Lawson, Bleak House) is a bundle of neuroses, while her son Orlando (a brilliant turn by James Lance) is 30 but behaves as if he's barely 13. Over the course of 12 half-hour episodes (six per season), Davina, Al, Orlando, and their friends and family reveal--sometimes with rueful melancholy, sometimes with acidic humor--that getting older doesn't mean getting wiser. Al struggles to be more assertive and just becomes obnoxious; Davina has an affair with a younger man prone to make archeological double-entendres; and their brother-in-law Roger (Nicholas Jones) surrenders his profitable career in finance to become an artist--just as he falls under suspicion of embezzlement. None of the episodes are plot-oriented, yet they move along briskly, driven by elegant, razor-sharp writing and skillful performances from the central cast and superb guest performers like David Warner, Frances de la Tour, Jonathan Miller, Patrick Malahide, and Anthony Head (Buffy the Vampire Slayer), among others. After the first season there's a dramatic turn; the series loses its footing slightly for a couple of episodes after that, but then unveils the strongest work of the series. Fans of Dennis Potter (The Singing Detective, Pennies from Heaven) should definitely see Sensitive Skin. Lumley is simply wonderful, ranging from arch comedy to heartbreaking sadness with subtle and fluid confidence. Sensitive Skin is a gem. --Bret Fetzer",
        "breadCrumbs": [
            {
                "name": "Movies & TV",
                "link": "https://www.amazon.com/movies-tv-dvd-bluray/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2625373011"
            },
            {
                "name": "Featured Categories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2644980011"
            },
            {
                "name": "DVD",
                "link": "https://www.amazon.com/DVD-Featured-Categories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2958934011"
            },
            {
                "name": "Music Videos & Concerts",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2959114011"
            }
        ],
        "productInformation": [
            {
                "name": "MPAA rating ‏",
                "value": "‎ NR (Not Rated)"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 7.75 x 5.75 x 0.53 inches; 4 Ounces"
            },
            {
                "name": "Director ‏",
                "value": "‎ Hugo Blick"
            },
            {
                "name": "Media Format ‏",
                "value": "‎ Color, Multiple Formats, NTSC, Subtitled, Widescreen"
            },
            {
                "name": "Run time ‏",
                "value": "‎ 5 hours and 42 minutes"
            },
            {
                "name": "Release date ‏",
                "value": "‎ August 5, 2008"
            },
            {
                "name": "Actors ‏",
                "value": "‎ Joanna Lumley, Denis Lawson"
            },
            {
                "name": "Subtitles",
                "value": "‏ : ‎ English"
            },
            {
                "name": "Language ‏",
                "value": "‎ English (Dolby Digital 2.0 Stereo)"
            },
            {
                "name": "Studio ‏",
                "value": "‎ BBC Video / Baby Cow"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00170JRTW"
            },
            {
                "name": "Number of discs ‏",
                "value": "‎ 2"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#133,128 in Movies & TV (See Top 100 in Movies & TV) #4,063 in Music Videos & Concerts (Movies & TV)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 70 ratings"
            },
            {
                "name": "Genre",
                "value": "Music Videos & Concerts"
            },
            {
                "name": "Format",
                "value": "Color, Multiple Formats, NTSC, Subtitled, Widescreen"
            },
            {
                "name": "Contributor",
                "value": "Denis Lawson, Joanna Lumley, Hugo Blick"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "Number Of Discs",
                "value": "2"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ed Altman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5BDJETIRM6YDUM4KP6WUHYH5HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11EU29Q479W0J?ASIN=B00170JRTW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Great series; excellent performances and script.",
                "reviewText": "This is the second copy I bought. I bought it for a friend. It’s a great little stories, which, for some reason was not more known. It could be that it was overshadowed by the US or Canadian version that was done with the woman from sex and the city. Regardless, particularly if you like JoAnn Lumley, this is very much worth seeing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5LDXYBPQI6AMCX5FHJLX2LXMOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JU7F4JUKKQME?ASIN=B00170JRTW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2010",
                "reviewTitle": "4.0 out of 5 stars Ends just when it's getting really good!",
                "reviewText": "This is a wonderful \"bittersweet dramedy\" rendered in twelve half-hour episodes. If only there had been more closure to the storyline; the writers/producers leave us after the main character has come to grips with certain elements of her life, but also at the very moment she is embarking on a juicy new \"life chapter\"! Characters we are just now warming are snatched out from under us as Series 2 (disc 2) ends.JOANNA LUMLEY's PERFORMANCEI had never seen Joanna Lumley in a leading role (no, I never did get around to watching ABSOLUTELY FABULOUS) and was deeply impressed by her work in Sensitive Skin. Here, as a 62-year old woman struggling with an unfulfilling marriage, her out-to-lunch adult son, her bitter sister, and life and death in general, she is oh-so-heartbreakingly good: pensive, quietly intelligent, quietly glamorous, quietly tragic, even, in her way. Her wit is dry but never cutting or sarcastic; you sense she is a more-than-decent person, possibly even a kind one. And she seems to have an air of bittersweet humor about her at all times, as though people's most outrageous, offensive, or hurtful behavior amuses her. But she telegraphs her amusement in a way that makes it seem she is not only smiling over their absurdities, but laughing at herself, too. What I loved best about her was her air of vulnerability.Her face can be described as a \"magnificent ruin\": conventionally, model-worthy beautiful, but also slightly craggy with the years, with regret, and with a subdued sort of pain she keeps close to her chest. She is elegantly but heavily made up with dark lip rouge and black eye pencil and softly glowing blush, almost as though the rituals of beauty help ease this unnamed, muted pain she carries around with her at all times.DISC 1 (SERIES 1)There is a marked difference between the two discs. The first disc, series 1, is more like a series of vignettes that are loosely related due to the recurring characters and themes. The general vignette subjects include: managing to live with a neurotic long-time spouse who hasn't emotionally resonated with you for years; dealing with an envious sister and her boorish husband; wondering whether you've really \"made something\" of your life after all; trying to fill the inexplicable holes in your heart with posh flats and Vidal Sassoon haircuts and always coming up short; and being alarmingly pursued by a variety of inappropriate men.The first few episodes did not really hold my attention all that well, because the writers just drop us into said vignettes and show us a series of characters we don't know who display neurotic, selfish, bizarre, or embarassing behavior. Sometimes I felt my attention wander.I felt, oddly enough, that there was a whif of CURB YOUR ENTHUSIASM about this series. Now, please know that they are vastly different shows with *completely* different approaches and senses of humor. CURB is broad, laugh-out-loud, outrageous comedy rendered in colorful splashes; SKIN is utterly subdued, autumnal, bitterish-sweet \"dramedy\" that mixes sharp, cutting humor with sometimes heart-wrenching reflections on life and death. But, they are similar in that in both series, the main characters encounter increasingly absurd people who make the main characters, dysfunctional as they themselves might be, seem almost sane in relation to the rest of the world.I guarantee that even if you weren't that engaged by the first few episodes, the last episode of this 6-part disc will hook you expertly and reel you in. After that, the show really picks up steam.DISC 2 (Series 2)The second disc/series is much more like a traditional serial, with plots and subplots that run throughout all 6 episodes. It is also much more emotionally compelling than the first disc.There are some shocking plot twists throughout, all the way to the last episode. That's about all I can say without giving away spoilers, but I hope you stick with the series until the end.OTHER IMPRESSIONSI was so disappointed when I realized BBC had not made any more episodes after these twelve. There are so many characters I wanted to know more about, storylines I wanted to explore in greater depth. I believe HB0 will be producing a re-make of this series starring Kim Cattrell in the Lumley role, but I urge you to see the original version first because I highly doubt the same \"autumnal\" tone will translate into the American version.The overall impression of the teleplay, humor, acting, camera work and color palette is indeed one of autumn--the autumns of people's lifespans, but also autumn as a represenation of emotional bruising and bottled up-pain. The somber selections of classical, folk, and pop music combine to create an almost constant elegiac tone; even at the conclusion of the funniest or most amusing scenes, the music reminds us that life is always embroidered with pain, one side lined with humor but the other inevitably lined with suffering.Denis Lawson is excellent as Lumley's husband; this Scottish actor (Ewan MacGregor's uncle) is highly underrated and I always long to see him on screen more. Pitch-perfect guest stars include luminaries such as Frances De La Tour and Jean Marsh (in a devastating role).RECOMMENDATIONIf you are looking for sharp humor but not for outright comedy; if you don't mind a good dose of the bitter with your sweet (I don't really even think there is a \"sweet\" here); and if you don't mind not quite knowing \"what ultimately happens\" to the characters you've grown to be invested in, this series will really speak to you. Be prepared to sit and brood a little bit and perhaps even shed a tear throughout.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike Billington author of Murder in the Rainy Season",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUSJSIO4CHWUDOYVV4GSVK2RFFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWJTDGA1AKDZK?ASIN=B00170JRTW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 24, 2017",
                "reviewTitle": "5.0 out of 5 stars A marvelous series",
                "reviewText": "I am a man of a certain age; someone who has spent most of his adult life as a writer.That said, I can honestly admit that I never really appreciated all the nuances of the word \"bittersweet\" until I watched both seasons of \"Sensitive Skin.\" Joanna Lumley (I'm old enough to remember when one of her first roles was in \"The New Avengers\") and Denis Lawson play a couple in their 60s that has grown so comfortable with one another that they no longer feel the thrill of being married. Lumley's character was once the belle of the ball and is trying desperately to hold onto her looks and figure. Lawson plays a columnist who seems to get angrier by the day. A hypochondriac whose constant visits to the doctor cost a fortune, he loves his wife but doesn't really appear to be \"in love\" with her any more. He spends his time ranting rather than wooing. She, meanwhile, continues to wonder if maybe, just maybe, she could have done better both in her marriage and her career.I'm not going to delve deeply into the plot of either season because I think doing so would be a disservice to those that have not yet seen this truly well done series. Instead, I'll say that the writing captures the joy, the humor, the angst, and the fear that we all face once we realize that - no matter what we may have thought in the past about being invincible - we're getting older and slower and more weathered each and every day. We can try to hold back the tide of aging by a variety of means but, ultimately, we cannot do so. Some people accept that fact and go on to enjoy the time they have left while, for others, that realization can truly be a catalyst for bad decisions.I'll also mention here the fact that the music which accompanies the episodes in this series is well chosen and adds, I think, a great deal to the storytelling. Old pop tunes and classical music help to heighten the mood of the most important scenes.In addition, I'd like to pay tribute to the directors who kept each episode moving along at a nice, easy pace. Not too fast, not too slow; the pace is just fast enough to allow us to remain engaged but not so fast that we miss the wonderfully nuanced performances of Lumley, Lawson and the rest of the cast.I should add here that I don't think everyone will like this series because, in truth, the storylines can be occasionally uncomfortable. Additionally, the series constantly reminds those of us of a certain age that we are no longer who - or what - we once were back in the days when the future seemed endless.For those that are not afraid to face the fact we are getting older, however, I think you'll find this a truly marvelous series.I did.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine Cunningham",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 12, 2014",
                "reviewTitle": "Four Stars",
                "reviewText": "Love Joanna lumley, Wished the series could have continued",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dianne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 3, 2013",
                "reviewTitle": "Recommended for older audience",
                "reviewText": "Would certainly recommend this. I found it to be interesting and at times quite sad (realistic)Joanna Lumley is super",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "peter",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 13, 2014",
                "reviewTitle": "Very happy to have got this for $30",
                "reviewText": "Arrived the next day .... Very happy to have got this for $30 ,",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 22, 2015",
                "reviewTitle": "Gave this away",
                "reviewText": "Couldn't get into this. The woman was too vain and the situations too confusing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philip Kerr",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 14, 2014",
                "reviewTitle": "Five Stars",
                "reviewText": "wonderful, dry english comedy. Love Joanna Lumley.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}