{
    "remaining_requests": 35295,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wolf-Gourmet-Elite-Countertop-Knobs/dp/B07KMTSRFS",
    "body": {
        "name": "Wolf Gourmet Elite Digital Countertop Convection Toaster Oven with Temperature Probe, Stainless Steel and Red Knobs (WGCO150S)",
        "price": "$735.99",
        "originalPrice": "$999.99",
        "rawPrice": 735.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wolf-Gourmet-Elite-Countertop-Knobs/dp/B07KMTSRFS",
        "soldBy": {
            "sellerID": "A17W5Z9BSG4H6V",
            "name": "Trends Goods",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A17W5Z9BSG4H6V&asin=B07KMTSRFS&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09JTXQNNB"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "Only 13 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41HdukpAKnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/6193QebHoEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vVrFF9DYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oroNpgv0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513cD T177L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BjlbIngxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jYS3XEYJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the WOLF GOURMET Store",
            "link": "https://www.amazon.com/stores/WolfGourmet/page/C1F3F000-6EA1-4F52-BD34-B7504D9B27C8?ref_=ast_bln"
        },
        "brand": "WolfGourmet",
        "merchantInfo": "Ships from and sold by Trends Goods.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 799,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 20 - 22.",
            "Or fastest delivery February 16 - 21.",
            "FREE delivery February 20 - 22.",
            "Or fastest delivery February 16 - 21."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "A WOLF OVEN IN COUNTERTOP FORM: Enjoy all the features of a full-size Wolf oven, like interior lighting, precise temperature control and convection heating, in a compact, energy-efficient form.",
            "ADVANCED CONVECTION TECHNOLOGY: Countertop convection oven continuously circulates heated air throughout for even roasting and baking with no hot spots.",
            "7 COOKING MODES: Bake, Roast, Broil, Warm, Proof, Bagel and Toast functions offer you greater control and consistent, predictable results.",
            "PRECISION TEMPERATURE PROBE: Offers the control to cook meat to an exact preferred internal temperature for tender, precise results.",
            "5-YEAR LIMITED WARRANTY: Wolf Gourmet warrants appliances to be free from defects in materials or workmanship for a period of five (5) years from the date of original purchase."
        ],
        "description": "Wolf Gourmet Elite Countertop Oven with Convection Introducing Wolf Gourmet’s most advanced countertop oven yet. Wolf Gourmet’s most advanced countertop oven offers all the benefits of a Wolf oven in a compact, energy-efficient form, plus new features that make countertop cooking even more convenient. The Wolf Gourmet Elite Countertop Convection Oven bakes, broils, roasts, proofs, toasts, heats bagels and warms food quickly and evenly, thanks to five heating elements, intuitive controls and advanced electronics. The interior is spacious enough to fit most 9” x 13” stoneware dishes or a 5½ pound chicken. Precision temperature probe cooks meat to your preferred internal temperature Advanced convection technology continuously circulates heated air throughout the oven for even roasting and baking with no hot spots 2 easy-glide racks can be repositioned easily into three levels 7 uniquely calibrated cooking modes offer greater control and predictable results Spring-loaded door with seal prevents heat loss and provides gentle opening and closing 5 heating elements deliver consistently accurate temperatures for even cooking performance Halogen light adds visibility to the oven’s interior, making it easy to check food as it cooks Nonstick interior with removable side rack holders and crumb/drip tray for easy cleaning",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Convection Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289934"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "WOLF GOURMET"
            },
            {
                "name": "Color",
                "value": "Elite Red Knobs"
            },
            {
                "name": "Product Dimensions",
                "value": "16.6\"D x 22.4\"W x 12.6\"H"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Grill"
            },
            {
                "name": "Cable Length",
                "value": "9 Inches"
            },
            {
                "name": "Item Weight",
                "value": "46.5 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Wolf Gourmet"
            },
            {
                "name": "ASIN",
                "value": "B07KMTSRFS"
            },
            {
                "name": "Item model number",
                "value": "WGCO150S-C"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 799 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#78,459 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #40 in Convection Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "December 19, 2018"
            },
            {
                "name": "Wattage 1800 watts",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 21.14 Kilograms",
                "value": "Finish Type Stainless Steel"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Better meals are close at hand. Wolf, the brand synonymous with delicious results, presents Wolf Gourmet – countertop appliances and kitchen tools that embody the precision control of their larger counterparts. From prepping ingredients to the finished dish, with Wolf Gourmet, the dish you envision will be the dish you serve. Wolf Gourmet Elite Countertop Oven with Convection Introducing Wolf Gourmet’s most advanced countertop oven yet. Wolf Gourmet’s most advanced countertop oven offers all the benefits of a Wolf oven in a compact, energy-efficient form, plus new features that make countertop cooking even more convenient. The Wolf Gourmet Elite Countertop Convection Oven bakes, broils, roasts, proofs, toasts, heats bagels and warms food quickly and evenly, thanks to five heating elements, intuitive controls and advanced electronics. The interior is spacious enough to fit most 9” x 13” stoneware dishes or a 5½ pound chicken. Precision temperature probe cooks meat to your preferred internal temperature Advanced convection technology continuously circulates heated air throughout the oven for even roasting and baking with no hot spots 2 easy-glide racks can be repositioned easily into three levels 7 uniquely calibrated cooking modes offer greater control and predictable results Spring-loaded door with seal prevents heat loss and provides gentle opening and closing 5 heating elements deliver consistently accurate temperatures for even cooking performance Halogen light adds visibility to the oven’s interior, making it easy to check food as it cooks Nonstick interior with removable side rack holders and crumb/drip tray for easy cleaning",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/77e36eee-f450-4ef5-9ace-67dae49cbc4d.__CR1502,0,1498,1997_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/0529eacc-5cf3-46af-bb27-b8bebe879511.__CR0,171,1714,857_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "A Wolf Oven in Countertop Form Get the precision, quality, and look of a Wolf oven in one countertop-friendly appliance. The Elite Countertop Convection Oven boasts heritage Wolf features like interior lighting, advanced convection, temperature control, and an integrated temperature probe.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/97b1215b-5d99-42b9-90aa-dbd0c24fbff6.__CR538,0,1706,1706_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "7 Cooking Modes Seven cooking modes – Bake, Roast, Broil, Warm, Proof, Bagel and Toast – offer the cooking flexibility to make everything from cheesy garlic-parmesan crostini to broiled lamb chops.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/3efe0a17-1818-4082-84b7-b1e8cfebc338.__CR590,0,2250,2250_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Better meals are close at hand. Advanced Convection Cooking Unique perimeter convection thoroughly circulates heated air for even baking and faster cooking, reducing cooking time by up to twenty-five percent. Convection can be used in roast or bake mode with a simple press of the button. Integrated Temperature Probe Cook an herb-crusted roast, balsamic-glazed chicken, or a sourdough boule to your preferred internal temperature. The probe gives you precise control over the temperature of your food without opening the oven door. Keep an eye on the oven temperature as well as the probe temperature on the LCD display. High-Performance Temperature Control Temperature is finely tuned and uniquely calibrated for the best cooking performance in each cooking mode. Intuitive controls allow for simple selection of cooking mode, time and function. Five heating elements and advanced electronics deliver more even cooking performance for baking, broiling and roasting every time.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/b61e8605-66e6-4c8f-8d24-74e01673bc29.__CR360,0,2880,2880_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/eb813656-833d-4f5a-bbf9-a9a04a4d9096.__CR1878,748,1714,1714_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/1c325a1e-b9bd-4776-b7e5-7e1889a13ab0.__CR0,360,2880,2880_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Wolf Gourmet WGCO150S Elite Countertop Convection Oven Wolf Gourmet WGCO170SR Elite Countertop Convection Oven w/Black Knobs Wolf Gourmet WGCO170SR Elite Countertop Convection Oven w/Silver Knobs Three Knob Color Options Red Black Silver",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/77e36eee-f450-4ef5-9ace-67dae49cbc4d.__CR1502,0,1498,1997_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/0529eacc-5cf3-46af-bb27-b8bebe879511.__CR0,171,1714,857_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/97b1215b-5d99-42b9-90aa-dbd0c24fbff6.__CR538,0,1706,1706_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/3efe0a17-1818-4082-84b7-b1e8cfebc338.__CR590,0,2250,2250_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/b61e8605-66e6-4c8f-8d24-74e01673bc29.__CR360,0,2880,2880_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/eb813656-833d-4f5a-bbf9-a9a04a4d9096.__CR1878,748,1714,1714_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/1c325a1e-b9bd-4776-b7e5-7e1889a13ab0.__CR0,360,2880,2880_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/4e7f1e75-4e1c-4a1b-b72e-da6980f00704.__CR130,91,907,1815_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/7b998cf4-01ef-4800-b84b-453627f3a6ec.__CR2446,346,1154,2308_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A38A0HBPP4RK5P/ffeeeb62-e87f-408b-ad8c-f6b7d9e54605.__CR2492,332,1108,2215_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sandh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7ZNU6A5SSN255WLOQQCBUPW4NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UI84R17STJJU?ASIN=B07KMTSRFS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2021",
                "reviewTitle": "5.0 out of 5 stars Works as it should; warranty perhaps questionable",
                "reviewText": "What's not to like, it does it's job as a second oven very well.Here are my opinions/observations on a few major points of comparison to other products:Problems and Warranty; I understand, but have not confirmed, that there are no service centers in the US which could be problematic. While I've yet to have any issues, if I did, I'd plan on begging parts from Wolf to fix it myself rather than hassle with the return, expense and possible shipping damage. Most companies are happy to comply with this because it saves them money. No idea what to expect from Wolf, but it's reasonable to expect this wouldn't be an issue. If I was concerned with this I'd consider buying from a local dealer instead so you might have the option to return/exchange it down the road depending on what their policies are. Unlike the Breville and other products that are known for a number of issues according to reviews, I could really only find one potential issue with this product regarding allegid \"known\" electronics failures. These seem to be very rare and not systemic issues. We've not had any problems. Hypothetically these could be nothing more than an occasional loose connection resulting from shipping, that might be easily addressed by folks with the know-how, but one would have to contact Wolf to ferret out and confirm the details if you could. That said, should they occur, having a lack of service centers could be problematic for some folks. I expect the odds of issues are very low, but like other products, this is made in China and you might want to look into what service would require for you before you purchase.Cook times; My wife's characterization is that it cooks \"hotter\" than our standard oven, and food cooks quicker and cook time needs to be adjusted accordingly. Faster is good imo for work efficiency; who wants to spend more time in the kitchen than they have to. However some might find the learning process a hassle or you might expect occasional issues when following recipes intended for conventional ovens. I don't think it cooks at any different temperature, maybe more accurate and therefore higher compared to poor temperature control that often results in lower than set temperatures on typical lesser products. However, I think depending on usage, food may be closer to the burner, and with the convection fan running, the food probably does get hotter or heats quicker by comparison. I expect the main factor is that food may brown, or burn on top faster by comparison. With the glass door and interior light it's easy to watch what's happening the first few times to get a feel for it and how much to adjust temp or time depending on what you're cooking, what rack it's on and how close it is to the top burner.Toast; Given the interior size and time to temp up, potential convention toasting if you use it, plus distance to the burners top and bottom, I find it's true that toast get's 'less toasted' and somewhat more 'dehydrated' or dry compared to a typical toaster. This is affected by which rack position you use and if you want the top, bottom or equally toasted. It also takes more time to get a toasted browning by comparison to a smaller oven or dedicated toaster. Typical time to get a nice browning is around 9 minutes for two slices, depending on the bread and how much you load it. We find we use close to the darkest setting to get close to a medium darkness. It seems to me the darkness scale is not accurate and leans towards being less toasted than you might expect from the dial setting. It's easy to add time to achieve results you're looking for though. If you like your toast crispy on the outside and soft on the inside, this is probably not the 'toaster' for you. Consider a smaller oven or a regular toaster. However, my wife is pretty picky with her toast and she likes this toast more than any toaster or oven we've had, since she prefers the bread toasted all the way through and not just the outer crust. There is a bagel setting that toasts more on one side that can result in a softer center if that's your preference, but you'd probably get better results with another product.Air frying; If you don't know, \"Air Frying\" is little more than a marketing term for a convection oven. According to America's Test Kitchen testing, there is no practical difference if you already own a conventional convection oven. Depending on the product, one could argue that Air Fryers might have a faster fan; but faster does not necessarily mean more even heat or more dehydration since it's cooking in an enclosed mostly sealed space anyway. What it likely does mean is louder noise when running. We have an \"air fryer\" that I wouldn't characterize as working particularly good or bad; it's ok if not marginal. Personally I think this oven works just as good if not better with the convection fan on, even though it technically does not have an \"Air Frying\" setting. All one needs is a suitable basket that allows air flow around the food and use typical air fry practices.Noise; There is really no noise unless you're running the convection fan. While noise is noticeable, it's not at all objectionable and runs very quiet...particularly compared to reviews of similar ovens. It is even substantially quieter than our conventional large oven when using convection.Door seal; Unlike other products this oven door has an actual heat door seal just like on a conventional full sized oven. There is no discernible steam or appreciable heat loss around the door while cooking though it is not sealed at the bottom so I assume there is some room for minimal air exchange. I would argue that the lack of leakage is a huge advantage if being used under overhead cabinets. The extra cost of this oven will be less than the cost of repair for damage potentially caused by other products.Cabinet heat; unlike other products and their reviews, the cabinet top and sides stay relative cool even when broiling. That said, I would use the handle and avoid touching the glass, door or sides directly. I put a bamboo cutting block on top with 1\" silicone legs under it to divert heat away from overhanging cabinets. This also allows us to store pans on it without scratching, or causing heat damage to the finish on the top. We are in a very dry area and any bamboo tends to warp and split. The cutting board is only ever warm to the touch and has not seen any warping, shrinkage, splitting, burning or other damage at all, which may be a factor of the particular wood we received, but I would expect issues if it were getting particularly hot. I'm happy to report this has worked really well. While I built my own with an appropriately sized board and bought legs separately, there are similar products for the Breville ovens that should work similarly well: https://www.amazon.com/Toaster-HI-BOV900ACB-HI-BOV800CB-Protection-19-7x10-8/dp/B087JL67BP or https://www.amazon.com/Breville-BOV900ACB-Bamboo-Cutting-Board/dp/B07168H3DP for example. The top of the oven measures 22 1/4\" x 13 1/4\". The legs I used are here; https://www.amazon.com/gp/product/B07B6T68H9 .Overall this has worked exceptionally well for everything we've done with it; pizza's, proofing and baking breads, desserts, fries, veggies, broiling, baking, etc. and it works great as a second oven. Everything crisps, browns, rises and otherwise cooks really well and has equalled if not surpassed our high end conventional oven. We had originally considered the Breville countertop oven because of the substantially lower cost, but that lower cost comes appears to come with issues. We have not regretted biting the bullet on price; buy once, cry once. We expect this will last longer and save money in the long run, but time will tell.",
                "reviewVotes": "95 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ovid987-Homer654",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMEUNSVRPM2DVCZPF2IREWMNWMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23D376HM8818K?ASIN=B07KMTSRFS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 17, 2021",
                "reviewTitle": "5.0 out of 5 stars Works great.",
                "reviewText": "It is 3 to 4 even 5 times as expensive as a regular toaster oven. However, it has been consistent. It looks like they use the same seal around this oven that they use on their $20k ranges. One thing to note the top gets HOT! I nearly burned my finger the first time I used it. Now, I warm my plates on it. This does take longer than a conventional oven, but it also does not heat up the house like a conventional oven. Example: two large potatoes in the oven. 400F degrees for 2 hours. Perfectly baked potatoes. Inside is moist, outside is crispy like a french fry. The trick is to scrub the potatoes clean under water to remove the dirt from the farm. Do NOT scrub the skin off. Then soak them in a bowl of water overnight, or soak them in the morning for later that night. You can cook them as low as 380 F, or as high as 420 F depending on how dehydrated you want them and how large or small they are or how much time you have to prepare dinner. They can be cooked for as little as 1 and a half hours if you don't want the skin so crispy. In a conventional oven I bake them for about an hour, an hour 20 minutes. Depends on number of potatoes you have. Also, you can put salmon in this little oven. Skin side up. Same heat 400F to 420F depending on how crispy you want the skin. I use the included tray. I use foil over the included pan/tray so that I don't have to clean up as much. You can use a few drops of olive oil, or butter, or lard (depending on your taste) on the foil underneath the salmon. This makes it easier to remove the fish--not as sticky against the foil. Salmon is better if you don't cook it too long. Depending on thickness you can cook it for 12 minutes. Even 10 minutes. I never go over 13 minutes. If you get white ooze then you over cooked it. The white ooze is congealed protein. If you cook it for 8 minutes it will be super tender and delicious, but also slightly rare in the middle. You will need to like sushi for this and you will have to make sure you have sushi grade salmon. One of the longest running Michelin three star restaurants only sears its salmon for about 15 seconds on each side. That is on a pan and the salmon is sliced evenly about half an inch thick, maybe thinner. They serve it in a sorrel beurre blanc sauce with butter and shallots and a white wine sauce with white pepper and salt. The point is that salmon's best flavor is when you keep the integrity of the flesh. You may want to slice the salmon pieces so that you too have even thicknesses of salmon. I have tried this and it works great, but in those cases I bake if for less than 2 minutes. I like sushi but I do not love it. The idea of raw fish gives me images of Gollum tearing into the flesh of a live fish he caught in the pond. I mention this because I am attempting to strike a balance between the true and best taste of the salmon and me needing it to be cooked. Another thing I have tried is a bone in veal chop.. On a cast iron skillet (a tricked I learned watching Gordon Ramsey) on high heat. Cast iron continues to absorb the fire's heat. I don't even bother using oil in the skillet. Sear for 2 minutes on each side. Then one minute on each edge. The bone side, usually has extra fat on it, so I may sear it for another minute, or tow as needed. When the skin looks crispy, or golden brown, it should be enough. Then put the chops in the oven at 350F for 11 minutes. If you eat salt I would salt the chops before you sear them. Let the salt soak in for up to an hour (Julia Child's method). You can also pepper them when you salt them. My spouse is no longer allowed salt for medical reasons so I no longer salt our food. It is actually better for you not to use salt, but it is difficult to kick the habit. It was one of the main ingredients that the Egyptians used to embalm their mummies. Anyhoo, If you want you can simply put a pat of butter over the chops once you remove them from the oven (11 minutes only at 350F). You can finely chop fresh garlic and put some thyme sprigs in the butter if you like. I sometimes do a mushroom sauce. Before you sear the chops, (while you are waiting for the salt to soak into the chops) you can make the mushroom sauce. I like Julia Child's mushroom recipe best. But what I do, to make it simple for me, is to slice mushrooms, then sauté them in the pan (\"Don't crowd the mushrooms\" the steam released will boil the neighboring mushrooms.) I think I use two mushrooms per chop. They shrink. Sauté both sides. Use cold olive oil on the hot pan. (room temperature is cold enough). I also put butter in it. New science is showing that cooking olive oil releases omega 6 and bad triglycerides so I am now eliminating cooking olive oil. Coconut fat is best for us as it has omega 3. The new research actually shows that our bodies handle animal fat (lard) much better than cooked olive oil or corn oil or vegetable oil. Our bodies had eons of years to adapt to eating animal fat. Agriculture is new to us (2,000 years to people from the UK), 12,000 years to people from the Fertile Crescent. Not long enough for humans to have adapted to refined oils. Anyway, do your own research and see what you think. So after you sauté the mushrooms on both sides, I add finely chopped shallots (one is good, maybe two if small). I lower the heat and add a finely chopped garlic, thyme from several sprigs (do to your taste), I add cream about one cup. Add salt and black pepper to taste. Here is where you would use your salt if you do not want to use it directly on the meat. The french salt their sauces. This way you can add as much or little as you please. I have not been salting my sauce now because of spouse. Also add about one table spoon of Dijon mustard. Stir to blend together. Don't use high heat. Use low heat when adding the cream. You can add a dash or two, maybe three if you like a heavy hand, but taste it after the second dash to be sure, of worcestershire sauce. That is usually what I do instead of looking at Child's cookbooks because hers are so involved. Mostly, we don't use and sauce. Be sure to make some vegetable too. I like asparagus with this dish. I peel the dark green skin off each stem. Use a light hand. It takes a while to learn not to skin off all the white flesh. The dark skin is the bitter taste. I then put them on a foil pan. I simply cut a small orange in half and squeeze one or both halves over the asparagus. Lemon makes them too tart and acidic. I then add a couple spoonfuls of chopped onions or better chopped shallots over them across the middle. Add dry lemon pepper if you like. I then sprinkle some parmesan cheese across the middle. Salt if you like. I no longer use olive oil over them, but you can drizzle some over them before the cheese. I put in the little wolf oven for the same 400F, or you can use the 350F if you are heating the veal chops. Note you will need a second pan/tray for the asparagus as the Wolf only gives you one tray. The asparagus should be done when you take out the chops. I like my veggies al dente, or crisp. If you like them soggy leave them in while you rest the chops. Always rest meat before you cut into it. The juices need to redistribute through the meat as it adjusts to room temperature. 3 minutes should be fine. My spouse can never wait the five minutes. If you cut too soon all the juices will run onto the plate and you end up with a dry piece of meat. For dessert, lately we have simply been having full fat plain yogurt with fresh berries. Add honey and cinnamon if you want more sweetness. The cinnamon is supposed to help regulate blood sugar levels. I use full fat now because fat free yogurt might have more sugar or salt in it depending on brand. The flavor has to come from somewhere. You can use non fat greek yogurt, but it is not as indulgent. Fat keeps us satiated for longer and it does NOT spike the insulin response like carbohydrates do. So, skip the potato if you want. I double the veggies when I skip the baked potato. Remember to have sour cream, chopped chives, butter and even horseradish if you like for the baked potatoes if you make them A little horseradish goes a long way in the potato, but you use less sour cream and less butter and less salt. You can use olive oil instead of butter and sour cream. All in all, I am very happy with my purchase of the Wolf Oven, I LOVE IT! I am using my conventional oven less and less. For a big family or a family with kids you will still need your range oven, but you can do side dishes in the Wolf Toaster oven. Now I want to buy the big WOLF Range double oven dual fuel, but I have to win the lottery first.",
                "reviewVotes": "81 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JohnJohn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 23, 2022",
                "reviewTitle": "Quality at its best!",
                "reviewText": "As soon as I opened my Wolf Gourmet oven, I could tell immediately that it was quality at its best. This is the third \"toaster Oven\" that I have owned and it was far superior to the others as far as quality goes. It was exactly as I had expected and it arrived well packaged and on time, one box inside of another. As soon as I unpacked the oven, I started to use it. I felt like it was a mini version of my large range oven. I have had this oven for just 4 days and I have already baked bread, cooked chicken, made muffins, and cookies twice. I love to bake and I found this oven a joy to work with. It is everything that it says it is and more. It cooks well and I found the oven temperature to cook exactly as my recipes called for. Not complicated at all and very easy to use. It should not be referred to as a toaster oven as far as I am concerned. It is more of a real oven and I find the term toaster oven to be insulting to the product. I did however feel the product was a bit pricey but in the end it will probably be worth the cost. Living in Canada, the price is much higher than it is in the United States.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710EL7xQQyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61o9ZBjeiTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Wz5hOg3BL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71USzYT7KxL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trish Loraine McCracken",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 16, 2019",
                "reviewTitle": "Wolf",
                "reviewText": "I love this oven. I use it for roasts and I use it to help my bread dough rise. The roasting pan is so easy to clean. I love the probe and the convection cooking on lamb racks.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "blake",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 15, 2020",
                "reviewTitle": "Great alternative to an oven in a small space or when only needed occasionally",
                "reviewText": "Though priced considerably higher than your typical toaster oven it is a real oven (and not so much a toaster). There are about 5 occasions a year where we need 2 ovens at work. Therefore we did not want another large wall oven as the kitchen space was better used for more storage. This smaller oven was the answer. It is tucked away when not needed and pulled out for the big family meals. It cooks very evenly if a bit hotter than recipes mandate (so keep you eye on the oven the first 3 or four uses to figure out the right temperature. I have taken to turning it done 10 to 15 degrees below the recommended recipe temperature or shortening cooking time and food cooks perfectly). It is solidly made and exceptionally easy to figure out and use. I did not read the instruction book in detail and was baking perfect cheesecakes once I figured out the right times and temperatures.If you are willing to spend the money and need a real extra oven on infrequent occasions as we do, I would encourage you to make this your first choice And if you are in a small space and need a small solid performing oven this is worth the money.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr.Thomas Suleiman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 9, 2017",
                "reviewTitle": "Excellent quality product for the price.",
                "reviewText": "Excellent addition to the kitchen. Comes on handy to do what it's been designed to do instead of using your big conventional oven.Wife loves it, would recommend to anybody. Easy to use.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave de la Plante",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 31, 2023",
                "reviewTitle": "When you want the best",
                "reviewText": "Premium quality, easy to operate, and great fit on the counter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$749.95",
                "sellerName": "Wolf Gourmet",
                "sellerRating": "5"
            }
        ]
    }
}