{
    "remaining_requests": 35334,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ninja-DCT451-Thermometer-FlavorSeal-Convection/dp/B0BRL9F8HV",
    "body": {
        "name": "Ninja DCT451 12-in-1 Smart Double Oven with FlexDoor, Thermometer, FlavorSeal, Smart Finish, Rapid Top Convection and Air Fry Bottom , Stainless Steel",
        "price": "$279.99$219.95",
        "originalPrice": "$349.99",
        "rawPrice": 279.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ninja-DCT451-Thermometer-FlavorSeal-Convection/dp/B0BRL9F8HV",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CJ5BDK1M"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41e3xBURCfL._SS36_.jpg"
            },
            {
                "asin": "B0BRL9F8HV",
                "variationName": "Color",
                "variationValue": "Stainless Steel",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41OVh-RKLgL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41OVh-RKLgL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51EXxE--BoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SoWpMPUGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FBZd9o0xL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514AJmiu9IL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TQMk3ZmAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61kXFA09rpL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ninja Store",
            "link": "https://www.amazon.com/stores/Ninja/page/4D837C13-1334-44EE-AD50-9586EE0F3873?ref_=ast_bln"
        },
        "brand": "Ninja",
        "merchantInfo": "Ships from and sold by DiscountsJungle.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1055,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 18 mins",
            "FREE delivery February 21 - 27.",
            "Or fastest delivery February 15 - 20."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "FLEXDOOR: Creates two separate ovens. Access just the top for quick meals and snacks, or open the full door so you can cook 2 meals, 2 ways on the top and bottom.",
            "FLAVORSEAL TECHNOLOGY: Two separate ovens prevents smells from crossing between ovens, so your flavors stay separate.",
            "SMART FINISH TECHNOLOGY: Sync both independent ovens to cook 2 meals, 2 different ways that finish at the same time.",
            "SMART COOK SYSTEM: Leave-in thermometer precisely monitors temperatures, so you don’t have to.",
            "FASTER MEAL-MAKING: Spend less time cooking and more time with family. Eliminate back-to-back cooking for 65% faster meal-making than your traditional oven.",
            "12 COOKING FUNCTIONS: Bake, broil, reheat, keep warm, bagel, and toast in the Top Rapid Oven. Air fry, convection bake, pizza, air roast, whole roast, and dehydrate in the Bottom Convection & Air Fry Oven.",
            "FAMILY SIZED CAPACITY: Ninja’s Double Oven fits 6 lbs of wings and a 12 in pizza at the same time to feed up to 8 people.",
            "EASY FAMILY DINNERS: Two independent ovens let you cook a meal for the kids and a separate meal for the parents at the same time.",
            "WHAT'S INCLUDED: Countertop oven, 2 sheet pans, 2 wire racks, air fry basket, removable crumb tray, and chef-created recipe book with 15 recipes and cooking charts."
        ],
        "description": "Meet the Ninja Double Oven, the countertop oven that unlocks the power of two ovens in the counter space of one. Only Ninja has the FlexDoor that creates 2 separate ovens so you can cook 2 meals, 2 ways at different temperatures and cooking times. Use just the Top Rapid Oven for quick snacks, sides, and sheet pan meals—or the Bottom Convection & Air Fry Oven for larger roasts, bakes, or air frying up to 6 lbs of wings. You can also sync both independent ovens to cook a full course meal that finishes cooking at the same time with Smart Finish technology. While your meal cooks, FlavorSeal technology prevents flavor crossover between ovens. The Smart Cook System precisely monitors temperatures with the leave-in thermometer, so you don't have to. Two oven cavities in one eliminate back-to-back cooking for 65% faster meal-making than your traditional oven so you can put your wall oven out of business. Plus, this countertop dual oven features 12 cooking functions for the ultimate versatility.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Convection Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289934"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Ninja"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "21.5\"D x 16.39\"W x 13.26\"H"
            },
            {
                "name": "Special Feature",
                "value": "Wipe Clean Exterior, Programmable"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Countertop Oven, 2 Wire Racks, 2 Sheet Pans, Removeable Crumb Tray, Air Fry Basket"
            },
            {
                "name": "Model Name",
                "value": "Ninja DCT451"
            },
            {
                "name": "Finish Type",
                "value": "Stainless Steel"
            },
            {
                "name": "Power Source",
                "value": "Corded Electric"
            },
            {
                "name": "Item Weight",
                "value": "31 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Ninja"
            },
            {
                "name": "ASIN",
                "value": "B0BRL9F8HV"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "DCT451"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,055 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,275 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #5 in Convection Ovens"
            },
            {
                "name": "Date First Available",
                "value": "February 9, 2023"
            },
            {
                "name": "Capacity 12 Liters",
                "value": "Wattage 1800 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 31 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page 1 Smart Cook System 2 Flex Door",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page 1 Smart Finish 2 FlavorSeal",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1b90e84f-9649-4e07-91ea-9e81428ece17.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3537484e-2d6f-4fa1-804d-40e536a8d4ae.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/00e595e9-5228-488a-a96e-54ad4e23adb6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8e276c79-2394-40bc-92b9-c15fe7762aed.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/33e91643-3e05-47e9-a0de-5dbee89ec5fc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95ee513d-08f2-4bb7-b231-1ff9c89e3230.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3336f528-cb68-4273-b269-ab6b4a6824e2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "NelleTex",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESKTB3QMATS6OOY76OERVDUJWHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R340YWIKZT7LMV?ASIN=B0BRL9F8HV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2023",
                "reviewTitle": "5.0 out of 5 stars REAL toast+separate air fry/convection",
                "reviewText": "We've had a couple of air fryers, the basket kind that took up too much space, for the limited things that it would do, and the toaster oven kind from a brand that is outfront with certain pot that they make...This toaster oven with its two separate ovens which seems crazy but it's fantastic, does not use convection in the toasting top part of the oven. Instead of desiccating toast with hot convection waves, this actually toasts like real toast, you can put it on the rack or, I prefer oven toast on a small cooking sheet pan. This is like the toast I grew up with the toast that your grandmother or mother made in the oven! You can put butter on it and it comes out crunchy, not like a piece of sandpaper, as the toast from a convection oven does.That alone makes this thing worth it, however it has many other features that are user friendly, customizable, and helpful. So if you really do want to dry something out or cook it fast, the bottom of the will do that for you, and the air fry for french fries and fish sticks and chicken tenders, all of those things is fantastic and efficient and quick for an individual or a family. In fact the toast makes up pretty quick too because the top oven is very small so do not walk away. I've been accustomed to making toast for almost 4 minutes -- anow 2 minutes or so, you've got a nice medium brown piece of crunchy toast. Yes I'm obsessed with the toast! I really missed oven-type toast.It has a sweet little dinging tone for ending and selection that is not annoying like some of these models. Don't know if you can turn it off, I wouldn't want to because it's just the cutest little sound and is helpful.You have a dedicated instant on/off button. The knob selector that selects toast color and number or whatever function you need also punches in to lock that in. Once you are cooking, you can punch it to stop turn heat source immediately. There's also a button for a light that lights up both ovens, that stays on a fairly long time maybe 30 seconds. One tap and it's right back on again.It's slightly bigger than the \"IP\" brand that we had before, chunky little squareish thing. But it is much less wide than most of the multi-featured models out there, and of course it needs to be pulled out a little bit for hot air frying, cuz there's a vent on the back. The glass does get hot on the front, as of course it should.The two doors on this model are fantastic. You don't have to move stuff out of the way underneath, if your coffee is waiting for your toast to be done. You punch in the top button and open just the top shallow toaster oven, so there is no need to open all of the door that comes all the way down to the countertop. When you're making toast or Pop-Tarts or bagels or whatever, you only need open/close the top door. I love that little top flip door. You don't have a big hot oven spreading heat into the kitchen when you flip up in that little door.In fact both of them are well insulated even though the glass gets hot it does not spread heat into the room like our other brand. So you don't feel heat all the way from the countertop to the dining table as we had before.And it's quiet, so so quiet compared to the screaming multi-function oven we had before that sounded like a C-130 landing for 30 minutes.My one complaint and this is true of most appliances, when you have to burn and break in the new appliance. I thought I was going to leave the house. It is that disgusting and dizzying and miserable. It's much like self-cleaning your regular oven, it is smelly and sickening. There's just no way around it though. It has to be done before use, but I would recommend plugging it into the garage or even on a patio or something because inside the kitchen the smell of the burning off of the factory, really permeated the atmosphere in a miserable way. Turn your air purifiers way up, and the vent fan on your stove!Other than that it's a fantastic little appliance if you don't need to cook huge things. You could probably just live with this as your one and only oven. I'm not sure if you can bake cakes in it as you could with our other one, but I bake cakes in my big range anyway. I believe you can cook a whole chicken in this though. We use ours for toast and Pop-Tarts and bagels and warming up things reheating things, re-crisping things. There are a lot of things we microwave for a minute or so and then crisp up in this kind of oven and this does all of that very well. Another issue is that I toast buttered flour tortillas quite often, and I have burned up a toaster oven when the tortilla puffed up and touched the heating element. I heated up frozen flour tortillas, handmade by the way, so they are extra thick -- and I stood by and did not take my eyes off of the tortillas that were on a toaster oven size baking pan. I don't know if they just happened to be not puffy or if the freezing protected them from puffing up, but I successfully toasted some flour tortillas that were delicious. If you're going to do that, as with toast or bagel don't walk away, keep your eyes on that little top oven because it cooks really fast. So I'm crossing my fingers that I will have future successful toastings of flour tortillas.I really highly highly recommend this, especially if toasting bread is something that you do on a regular basis because the other air fryer / convection ovens do not have this extra little separate oven that is just a regular toaster oven. This makes all the difference. I've been suffering with desiccated bread from hot convection wind for a couple of years now, and it was such bliss to eat a regular piece of toast again that was cooked very quickly without having to heat up my huge oven that would have taken 20 minutes probably. Butter up a piece of bread throw it in on a little baking sheet, and you have some darn good crunchy medium toast in under 3 minutes, anyway. Pick your toast shade!Buy this thing you'll love it for the other functions as well. I first purchased an air fryer after having my gallbladder removed so I could enjoy crispy things without drowning them in oil. It's been 10 years, and we use an air fryer several times a week. High power 1800w so don't plug it in at the same time you're using another powerful appliance. This one shares a wall outlet with a coffee maker and can opener, is all.Worth every penny!!",
                "reviewVotes": "139 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lyn Craven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIESIW5NRIBYTLF53KX25VMIGMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CCLP9RUGIXRJ?ASIN=B0BRL9F8HV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 12, 2023",
                "reviewTitle": "5.0 out of 5 stars The counter top oven I have been waiting for!",
                "reviewText": "Since my husband and I are the only two home, firing up the big oven all the time seems a waste - plus it heats up the kitchen which is not fun in summer. An added catch is that we don't eat the same. I don't eat meat (I will eat fish) and he hates fish but loves a good roasted chop. Anyone who doesn't care for fish is always wary of cooking it together with meat - it does tend to infiltrate!I have tried many counter top ovens. Some didn't work AT ALL: I couldn't get the touch panel on the Oster Convection Oven to work without practically breaking a finger; the Elite Gourmet ETO-4510M got WAY too hot (inside and out) and was complex because it expected you to manually synch the top and bottom heat source (which were both in the same oven, unlike this one) and the french doors were a definite burn hazard; the Hauswirt 26Qt Air Fryer Convection Oven Rotisserie was also too small and got dangerously hot on the outside. The Breville Smart Oven Pro Toaster Oven is a great little oven - I have actually had 3 over the years - but the big drawback is only one shelf. I once ordered an extra shelf so I could put two things in at once, but there really wasn't room and if the two things needed different temps there was too much math involved. Also, the fish/meat thing.The Ninja DCT451 is a superb little oven. I love it and so far can't find anything about it I don't like. What I do like...- top and bottom operate separately but can also be synched- the top is small (slim really) but easily accommodates a pizza- the door can be opened just for the top, or for both- each oven has separate controls, making it easy to set each one for different things- so far it seems to cook (time/temp) per instructions for the item with no need to adjust- the functions of each oven are easy to select (toast, bake, convection etc)- there is an inside light (a really nice feature)- the outside doesn't get too hot - just mildy warm- the size is great for the capacity inside, fits nicely on my counter- it has plenty of pans - 3 shelves, two roasting pans and an air fry mesh thing.- the pans are very heavy/good quality (not flimsy - even the Breville was guilty of that)- it says hello and goodbye 😃A great purchase - I am really glad I spent a bit extra. Its is well worth it.",
                "reviewVotes": "69 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7AEFIV2CKXJ6YRO65VJRVXHP2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TXTDDDK33QDP?ASIN=B0BRL9F8HV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Everything and more",
                "reviewText": "This all-in-one does everything! We absolutely love it!*It toasts quickly.*It can do two different types of cooking and set the Smart finish so they end at the same time!*You can use the thermometer to insert into the meat, then set it to the corresponding protein, then it will end when the internal temperature is met! (Love this feature) Chicken comes out so moist! It cooks quickly!*You can make adjustments during cooking*It is extremely user friendly*Easy to cleanI replaced our old airfryer and toaster oven with this one machine and couldn't be happier! Definitely recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wreathandcrestwreathandcrest",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDCNR7EZA45WWNEXRQNQIOV537Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RY72VQQEGNBLQ?ASIN=B0BRL9F8HV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2023",
                "reviewTitle": "5.0 out of 5 stars It’s Kinda Brilliant, Has Replaced Our Big Oven Daily",
                "reviewText": "To call this thing a toaster oven is a great injustice to this great little machine. It’s actually a mini version of our full-size residential oven—but it also happens to have a broiler/toaster/warmer attached. I only bought it to use as a second oven for Thanksgiving but now we pretty much use it every day unless we’re cooking for more than 4 people.It preheats FAST. I’m talking like 3 minutes to get to 425. It easily cooks as evenly and consistently as our big oven and doesn’t heat the kitchen up. The toast feature works so well and faster that I junked our old 2-slice toaster. And the two chambers for different items cooking at two different speeds seemed gimmicky but damned if we don’t use it weekly.It fits inside the cabinet, and I put a 5” PC exhaust fan at the back and a vent in the front to make sure all of the heat is pulled out when it’s running. DO NOT PUT THIS OVEN IN A CABINET UNLESS YOU DO THAT. With the airflow, it never goes over 120deg in the cabinet.Best money on a kitchen appliance that I’ve ever spent, assuming that it’s reliable.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710-rUkoEhL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71R5Uh+rXRL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71WaRnWcxmL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diego LD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 1, 2024",
                "reviewTitle": "Excelente opción de horno.",
                "reviewText": "Cocina todo lo que te imagines en corto tiempo.Muy fácil de entender y cocina todo perfecto. Recomiendo entrar a la página de ninja para ver las recetas.La potencia es súper buena, ya incluye el termómetro y trae una luz que te permite ver lo que se está cocinando.Recomiendo protectores de silicon de SILPAT para el horno de arriba y que no necesiten engrasar ni empapelar.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M G",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 23, 2024",
                "reviewTitle": "It's like having a kitchen full of appliances packed into one sleek and shiny package",
                "reviewText": "Alright, folks, I'm about to introduce you to the Ninja DCT401 Double Oven, and let me tell you, this beast is a game-changer! Get ready for some serious kitchen wizardry with this double oven that will make you feel like a culinary genius.First, let's talk about the FLEXDOOR feature. This little gem creates two separate ovens, giving you the power to access just the top for those quick meals and snacks, or open the full door and cook two meals, two ways on the top and bottom. I enjoy having a magical portal to flavour town right in my kitchen!There's more! With the FLAVORSEAL TECHNOLOGY, you can say goodbye to any unwanted smells crossing between ovens. No more mixing of flavours, my friends. Your garlic-infused pizza won't taste like your chocolate chip cookies anymore.Let's discuss the SMART FINISH TECHNOLOGY. This genius feature allows you to sync both independent ovens, so you can cook two meals, two different ways, and have them finish at the same time. No more playing the waiting game or juggling different cooking times. It's like having your own personal kitchen assistant but without the attitude. 😉And if you're anything like me, you want your meals ready in a flash. Well, hold on to your spatulas because the Ninja DCT401 is here to save the day. With its 65% faster meal-making capabilities, you'll be spending less time cooking and more time with your loved ones. Finally, a way to eliminate back-to-back cooking and reclaim your precious time.Now, let's dive into the cooking functions. Brace yourselves, because this oven can do it all. Bake, broil, reheat, keep warm, bagel, and toast in the Top Rapid Oven. Air fry, convection bake, pizza, air roast, whole roast, and dehydrate in the Bottom Convection & Air Fry Oven.And don't worry about feeding your hungry clan. The Ninja Double Oven has got it handled with its family-sized capacity. It can fit a whopping 6 lbs of wings and a 12-inch pizza feeding up to 8 people. No more fighting over who gets the last slice. Everyone's a winner with this oven.With two independent ovens, you can cook a meal for the kids and a separate meal for the parents at the same time. No more compromising on what to cook or dealing with picky eaters. It's a win-win situation for the whole family.The Ninja DCT401 Double Oven comes with everything you need to get started. You'll get the countertop oven, 2 sheet pans, 2 wire racks, an air fry basket, a removable crumb tray, and a chef-created recipe book with 15 yummy recipes and cooking charts.So, there you have it, folks. The Ninja DCT401 Double Oven is a kitchen powerhouse that will revolutionize the way you cook. With features like FLEXDOOR, FLAVORSEAL TECHNOLOGY, and SMART FINISH TECHNOLOGY, you'll be cooking up a storm in no time. Say goodbye to boring meals and hello to culinary greatness. Get ready to unleash your inner chef with the Ninja DCT401 Double Oven!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "melanie cashen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2024",
                "reviewTitle": "Love it!",
                "reviewText": "Super easy to use and food turns out great!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'AmazonClient d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2024",
                "reviewTitle": "Wow",
                "reviewText": "Acheter a mon fils de 20 ans pour noel cest parfait pour cest repas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71uoevzHQ-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aries ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 28, 2023",
                "reviewTitle": "Forma de cobro",
                "reviewText": "No he podido usarla pues no tengo instructivo viene en inglés, pero eso es lo de menos lo compre en un año sin intereses y me lo cobran en tres meses así no puedo pagarlo,ese es el motivo de mi devolución 😢 que lastima 😞",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}