{
    "remaining_requests": 35345,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Elite-Gourmet-ETO4510BMDouble-Countertop-Convection/dp/B07XMJMCS3",
    "body": {
        "name": "Elite Gourmet ETO-4510M French Door 47.5Qt, 18-Slice Convection Oven 4-Control Knobs, Bake Broil Toast Rotisserie Keep Warm, Includes 2 x 14\" Pizza Racks, Stainless Steel",
        "price": "$155.08",
        "originalPrice": "$179.99",
        "rawPrice": 155.08,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Elite-Gourmet-ETO4510BMDouble-Countertop-Convection/dp/B07XMJMCS3",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CR6KD4FR"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Ege-IudOL._SS36_.jpg"
            },
            {
                "asin": "B07XMJMCS3",
                "variationName": "Color",
                "variationValue": "Stainless Steel & Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41lg16GOC0L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41lg16GOC0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41wI FvzSLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SYOxRSGaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51lSkWFVBuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RiE0vRzYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pL3V U29L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81 nqtKC eL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Elite Gourmet Store",
            "link": "https://www.amazon.com/stores/EliteGourmet/page/7C41F0D0-1198-4E29-9F0F-7F910F09B7C4?ref_=ast_bln"
        },
        "brand": "EliteGourmet",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 6254,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 6 hrs 20 mins",
            "FREE delivery Sunday, February 18. Order within 6 hrs 20 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "45L capacity - Fits 9 slices of toast on 2 racks for a total of 18 slices and roasts up to a 7lb turkey. Four rack positions fit up to 2 x 14\" pizzas with interior dimensions of 16-3/8 W x 15-7/8 D x 8-1/2 H (upper element to rack at bottom position)",
            "French dual door design allows you to open one or both doors at a time saving precious counter space. Four rack positions allow you to cook multiple dishes at once",
            "Convection feature circulates hot air inside the oven for flakier crusts, deeper flavors and more tender meats, in less time. Rotisserie spit & Fork assembly rotates food inside the oven while roasting it to perfection.",
            "Independent Temperature Knobs up to 450°F to separately control top and bottom heating elements - turn on only one or both at the same time; 60-minute timer with signal turns oven off automatically",
            "Stainless Steel door handle, frame, and panel adds style and elegance. Oven door constructed of safety tempered glass, and slide-out crumb and grease tray makes clean up a cinch."
        ],
        "description": "Introducing the Elite platinum Double Door countertop oven, The perfect stand-in or supplement to conventional ovens. This dual door Rotisserie and convection oven will have you forget about your traditional oven altogether! Toast, bake, broil, and Rotisserie your way to delicious, hearty meals and decadent desserts - this oven can do it all! The spacious interior boasts 4 rack positions so you can bake 2 x 12\" Pizzas, warm dinner rolls, and broil a casserole all at the same time! With heating elements on top and bottom that can be independently turned on using the separate temperature dials, a 60-minute timer, and a function dial, This oven really has the versatility you've been waiting for. Includes French-style doors, an interior light, 2 x wire racks, 1 enamel bake tray, a tray handle, Rotisserie set and handle and a crumb tray. Removable parts are all dishwasher safe. Avoid heating up your kitchen with a big conventional oven, save time and use less energy with the Elite platinum Double Door countertop oven, The perfect supplement for the holidays when your kitchen needs goes on double duty!",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Convection Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289934"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Elite Gourmet"
            },
            {
                "name": "Color",
                "value": "Stainless Steel & Black"
            },
            {
                "name": "Product Dimensions",
                "value": "13.98\"D x 21.06\"W x 15.55\"H"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Control Type",
                "value": "Knob Control"
            },
            {
                "name": "Door Style",
                "value": "French Door"
            },
            {
                "name": "Included Components",
                "value": "Toaster Oven"
            },
            {
                "name": "Model Name",
                "value": "Elite Gourmet ETO-4510M"
            },
            {
                "name": "Finish Type",
                "value": "Brushed"
            },
            {
                "name": "Power Source",
                "value": "AC"
            },
            {
                "name": "Cable Length",
                "value": "24 Inches"
            },
            {
                "name": "Temperature Range",
                "value": "150 - 450 Degrees Fahrenheit"
            },
            {
                "name": "Item Weight",
                "value": "24 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Maxi-Matic"
            },
            {
                "name": "ASIN",
                "value": "B07XMJMCS3"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "ETO-4510M"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 6,254 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,403 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #11 in Convection Ovens"
            },
            {
                "name": "Date First Available",
                "value": "September 6, 2019"
            },
            {
                "name": "Capacity 45 Liters",
                "value": "Wattage 1500"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 24 Pounds"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/23e23f23-1af5-4a9d-859f-f9593ec8b0d8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/12b2721a-0d06-40b5-bda7-667948f4742d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b83b8582-bcdd-4c29-9695-8dc4e4b4a332.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8093af07-11ae-4b18-b7b4-6b4b1bfdda66.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/37a25794-367e-4d13-b6d1-dc728c31b001.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "HighMountainColumbine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOVY3TDLUV42GYNOPNWOZ32NPPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13FRRFPMZWEF2?ASIN=B07XMJMCS3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2020",
                "reviewTitle": "5.0 out of 5 stars Superior Countertop Oven",
                "reviewText": "When the oven on my antique stove stopped working, I was faced with two choices: Give up my beautiful cream and apple-green enamel classic and buy a modern stove, or find an alternative. I chose an alternative. In the ensuing 10 years I used two different brands of counter top ovens, neither of which were satisfactory. They were too small, barely accommodating an 11\" pie plate, and neither of them heated accurately. Cookie tins were twice the size of both ovens, and my 9x13 baking dish was several inches too wide to fit. Roasting a turkey was entirely out of the question, and the baking at Thanksgiving and Christmas I had relished (and my family enjoyed for many years) was exceedingly difficult because of the limitations of both ovens. The day I served baking powder biscuits for breakfast that were half the size they should have been and never browned properly was the day I was done, done, done. I embarked on a year-long search to find a satisfactory counter top oven and visited dozens of websites. I looked at countless brands and models, and either they didn't meet my requirements for size and quality, or the reviews were terrible. Then one day when I had nearly given up hope, I found the Maxi-Matic Platinum Double Door Counter Top oven. The skies opened and the birds sang, as I read the specs on the ETO-4510M Toaster Oven. They’ve been singing ever since. This oven is far superior to the humble toaster ovens I've used over the years, and its 23L-capacity accommodates my 11\" pie plate and large, collectible muffin tin with ease. And yes, my glass 9x13 baking dish also has plenty of room. Rotisserie, Bake, Grill, Broil, Roast, Toast, Keep Warm; it's all part of what this oven does so well. Cleanup is a dream, so easy that splatters from a roast simply wiped off later. This oven is also well-constructed with double doors that fit properly without a gap in the middle. On top of everything else, it deserves the designation \"Platinum\" in its name for a simple elegance that I find very pleasing. I *have* found that the oven runs hotter than the gauge indicates, but overcoming that obstacle was easy with a high-quality oven thermometer. Each setting has a consistent temperature, and the increases are in even increments. I now have a chart posted inside the cabinet door above the oven, and I know exactly where to set the dial(s) for the temperature I want. There are two additional changes I wish the manufacturer would implement: A switch to turn off the light inside, and a \"Stay On\" feature for the timer. Presently, the oven timer stays on for one hour, then shuts itself off. (I suppose this is a safety feature as so many senior citizens are a bit absent-minded at times, but it would be nice if I had the option for longer cooking times.) Again, I overcome this feature by setting an alarm to reset the oven timer when more cooking time is needed. For me, these three minuses are insignificant compared to the many advantages of this oven. I am almost deliriously happy with it, and if I could give it ten stars I would gladly do so. NOTE: I would definitely NOT recommend placing this or any other oven above shoulder height (see photo below). Should anything go wrong when removing baked goods from an oven this high, terrible burns are almost a certainty.",
                "reviewVotes": "386 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gézike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQMI53AUFUJMZHLQQ4RMUHFORNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G2FMJEAH3ILU?ASIN=B07XMJMCS3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent product at an amazing price",
                "reviewText": "I was already impressed when I received this product. The heavy cardboard box and effective packaging provided more than ample protection for the oven. No dents, scratches, or damage. Ample space inside the Owen to even bake bread in a heavy metal casserole, although, even doubling up the shelves, the weight of the casserole made the selves sag a considerable amount. Probably need an additional reinforcement to avoid sagging into the heating element. My 13 inch pizza pan still fits into it, but touches both walls. The oven reaches true 450 degrees very fast and the double doors make inserting large items very convenient. The upper and lower heating elements are controlled separately and the timer goes up to one hour. The usable inside dimension is: 8” high, 13” deep, 15” wide. If you need to preheat to bake, you will need a thermometer since there is no digital display to know.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Les Hall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUWEI3MWE7ZCNI5OXBTSKIUYAQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16ACO23FFR8EG?ASIN=B07XMJMCS3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Can't be beat for the money",
                "reviewText": "Considering it's running on standard US 110-120V it does a good job for the price.The outside, especially the top gets very hot. It's just a bare metal shell, so it conducts heat. I've baked a few times with it and it's ok. I rotisserie'd a pork loin and it worked ok.Everything is lighter weight than I would like, but the price... A rack dipped a bit when I put a cast iron skillet on it. Controls seem very well made - heavier duty. Convection fan is very quiet.Like all things that are multi-use it doesn't do any of them really well, but it does a pretty good job. I haven't tried baking bread in it yet - that will be a good test.Oh, get an oven thermometer as the temperature gauge is not super accurate.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon L. Gammell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRPAUKZYCMZA5NL2UGN7D5USPBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L9H04023KYHA?ASIN=B07XMJMCS3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Remember, ovens get hot...!",
                "reviewText": "Now that I've used the Elite Gourmet countertop toaster, convection, rotisserie oven for toast, pizza, chicken, turkey, and Swedish meatballs, it's time to give my honest evaluation: I love it!A little background and why I chose this product: I recently had to move into affordable housing and still will pay for gas and electricity. I'm now on a fixed income. The first time I used the apartment's oven, my apartment went from 68° to 77°. It took all afternoon for it to cool down. I started to look for a good quality countertop unit with a rotisserie. I was about to purchase one costing nearly $300 which was rated close to 5 stars. But nearly all of the 1 star reviews said the same thing, there was an odor that wouldn't go away, the materiel was flimsy, and the rotisserie function was faulty. Always go to the 1 star reviews first. If they say the same thing, look for something else or see for yourself at a local store if you can find the item. I did. So back to searching I went and came across Elite Gourmet with only 4 stars. Plus it was offered at over 50% off. The 1 star reviews were varied. Amazingly, they were from people who obviously didn't read the instructions or realize that they were dealing with a miniature oven. And ovens get hot. Even the beautiful Brevilles have problems, plus none of them have a rotisserie. So I bought the Elite Gourmet and I'm so glad I did. My apartment never heats up when I use it.Some advice if you are getting this or any countertop oven: READ THE INSTRUCTIONS. After wiping it down and prior to first use, set the oven function, not the convection function, to 450° and heat it for around 15 minutes or so. There will be a slight odor, but it will dissipate. I waited for it to cool down and wiped it with a clean damp cloth again before using it.Next, get familiar with the appliance and its accompanying accessories. Practice removing the baking sheet and wire racks using the tool that comes with the oven. Attach and remove the rotisserie rod. If you aren't sure or have never used the type of rotisserie attachments included, go to YouTube and watch a video. Make sure you have the racks in properly before placing or removing items, especially heavy ones. Last, remember to wear oven mitts. The elements are much closer to your hands then the ones on larger ovens and they get just as hot. Also, use just the oven function, which is at the off position on the function dial, when you make toast. The convection function will dry out your toast.The Elite Gourmet has beautiful French style doors and fits beautifully in the corner of my counter. It's convenient, well-priced, and performs wonderfully. This is not an airfryer, but using the convection feature can sometimes perform the same or better depending on what you are making.Hope this review helps you if you're looking for a countertop oven.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melodie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 7, 2023",
                "reviewTitle": "It’s Perfect",
                "reviewText": "I love this oven. It fit perfectly on my counter. It cooks amazingly. I haven’t used my big stove since I got this. So simple to use",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arnaud",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 3, 2023",
                "reviewTitle": "Grand petit four",
                "reviewText": "Outre les accessoires, j'étais dubitatif.J'y cuis des gâteaux et quiches ou pizzas (moules à acheter en conséquence) et surtout mon pain maison, qui n'est jamais sorti aussi bon avec ce four comparé à mon four à gaz (trop vaste et donc perte d'énergie)Pas encore utilisé pour les toasts",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bel Amaya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 1, 2022",
                "reviewTitle": "Super útil!! Me encantó",
                "reviewText": "Me gustó mucho! Es súper amplio,calienta bastante bien, tiene bastantes funciones es muy versátil por su espacio, la función de rostizar no me agradó tanto porque si pones un pollo más grande como que de una parte no se rostiza al parejo, pero por lo demás todo está muy bien las puertas que se abren, los niveles que se tienen, todo esduper bueno, es un súper horno genial, de luz no siento que consuma tanta energía.Y más que lo tome en promoción. Muy bue a inversión y compra.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 15, 2020",
                "reviewTitle": "Calidad y Utilidad",
                "reviewText": "Excelente y muy practica",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CLAUDIA P SALAS ESPARZA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 9, 2023",
                "reviewTitle": "Excelente horno",
                "reviewText": "Muy práctico que se puede controlar la temperatura de abajo y arriba de manera independiente, muy amplio. Nos gustó mucho.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}