{
    "remaining_requests": 35326,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BLACK-DECKER-Countertop-Convection-CTO6335S/dp/B0043E6PLC",
    "body": {
        "name": "BLACK+DECKER 6-Slice Convection Toaster Oven, CTO6335S, 20% Faster Cooking, 120-Minute Timer, Extra-Deep Interior, 8 One-Touch Functions",
        "price": "$89.99",
        "originalPrice": "$89.99",
        "rawPrice": 89.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BLACK-DECKER-Countertop-Convection-CTO6335S/dp/B0043E6PLC",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0745BYF7F"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41EJmMwsMpL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51sIraJhZRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kMjQKaCoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gfYXjyWDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417T2jnQULL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZUf6OrGuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71YqmGXC69L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BLACK+DECKER Store",
            "link": "https://www.amazon.com/stores/BLACKDECKER/page/9CD42FC6-F544-4F9F-807D-D1B33889F479?ref_=ast_bln"
        },
        "brand": "BLACKDECKER",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 9436,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 7 hrs 17 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Extra-Deep Interior: Forget about heating up the large oven. This countertop oven is designed to fit 12” pizzas, and things like casserole dishes, whole chickens, and more.",
            "Dual Position Rack: Place food right under the broiler or make room for large items. High and low oven rack positions provide the versatility to have great results on all foods.",
            "120-Minute Timer: The digital timer ensures accurate results. Set it for short jobs like toasting and broiling, or longer for baking. The oven turns off when the timer runs out.",
            "8 One-Touch Functions: Bake, broil, toast, bagel, pizza, frozen snacks, potatoes, cookies.",
            "Convection Baking: Hot air is circulated throughout the oven for fast, even baking."
        ],
        "description": "Product Description Cooking versatility at the touch of a button! The BLACK+DECKER 6-Slice Stainless Steel Convection Countertop Toaster Oven with Broiler Pan features one-touch functions for a whole range of foods: bagels, pizza, frozen snacks, potatoes, and cookies. Convection technology circulates air within the oven for fast and even results while baking. Plus, the toaster oven includes a broiler pan and an external crumb tray that slides in and out, making cleanup a breeze. When its time to eat, trust the #1 brand in toaster ovens BLACK+DECKER. Dual position rack place food right under the broiler or make room for large items. High and low oven rack positions provide the versatility to have great results on all foods. Nonstick interior cleanup is fast. Just wipe clean the cooled nonstick surfaces.Volts 120V . Brand Story By",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b?ie=UTF8&node=289933"
            },
            {
                "name": "Toaster Ovens",
                "link": "https://www.amazon.com/Toaster-Ovens-Toasters-Small-Appliances/b?ie=UTF8&node=289937"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Black+Decker"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Product Dimensions",
                "value": "13.4\"D x 22.8\"W x 15.5\"H"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Control Type",
                "value": "Knob Control"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Removable Crumb Tray, Stainless Steel Countertop Convection Oven, Baking Pan"
            },
            {
                "name": "Model Name",
                "value": "02648008504"
            },
            {
                "name": "Finish Type",
                "value": "Polished"
            },
            {
                "name": "Item Weight",
                "value": "15.76 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Applica Incorporated/DBA Black and Decker"
            },
            {
                "name": "ASIN",
                "value": "B0043E6PLC"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "CTO6335S"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 9,436 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,182 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #19 in Toaster Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 31, 2010"
            },
            {
                "name": "Capacity 6 Liters",
                "value": "Wattage 1500 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 15.76 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The BLACK+DECKER Countertop Convection Toaster Oven Cooking versatility at the touch of a button! The BLACK+DECKER Countertop Convection Toaster Oven features one-touch functions for a whole range of foods: bagel, pizza, frozen snacks, potatoes, and cookies. Convection baking circulates hot air around your food for fast and even results, and the extra-deep curved interior fits 12” pizzas and so much more.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d70e810d-68a0-4891-9291-1ed92260beca._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Key Features Extra-Deep Interior Forget about heating up the large oven. This countertop oven is designed to fit 12” pizzas, and things like casserole dishes, whole chickens, and more. Dual Position Rack Place food right under the broiler or make room for large items. High and low oven rack positions provide the versatility to have great results on all foods. 8 One-Touch Functions Bake, broil, toast, bagel, pizza, frozen snacks, potatoes, cookies. Convection Baking Hot air is circulated throughout the oven for fast, even baking.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/aed47c8a-f4f4-4ca0-9cb7-0df3b6d09f2d._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1733b697-0a14-4ea7-9b21-d66c13268a17._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a49d2fb7-97a3-444a-8c64-3597ff001946._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8db4fe3f-1296-4fbb-bc58-95a48ded059f._SL220__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d70e810d-68a0-4891-9291-1ed92260beca._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/aed47c8a-f4f4-4ca0-9cb7-0df3b6d09f2d._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1733b697-0a14-4ea7-9b21-d66c13268a17._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a49d2fb7-97a3-444a-8c64-3597ff001946._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8db4fe3f-1296-4fbb-bc58-95a48ded059f._SL220__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "JRJR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF26YA6JDHVLGTPL7CMWJBG4TCQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3STW7WW069JUY?ASIN=B0043E6PLC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2015",
                "reviewTitle": "5.0 out of 5 stars So far so good!",
                "reviewText": "Just got this as a serious upgrade to a beat up toastmaster purchased from another retailer a few years back. I gotta say that thing chugged along, and is still working, but its a holy mess and it was time to send it packing. Otherwise it still works like a charm surprisingly.We just got some shiny new appliances, stainless steel grade, and the Toastmaster just didn't fit in anymore. Just so you know, this is not your mom's toaster oven. This thing is pretty big with lots of options, so have a decent sized counter space for it. It will need it. It cuts a nice profile though, and will work well looks wise if you have upgraded appliances. Also, this thing gets plenty hot, so give it some space towards the back, and keep any packaging you throw on your counter away from it and in a pantry.Getting back to the size for a second, my wife was a bit taken a back. She is used to smaller toaster ovens and is of the opinion that you don't need a toaster oven that looks its ready to blast off into space to make toast and bagels. Accept its also a convection oven, and there is the rub. If you are looking to save some money on a stove, you can save a lot by still getting something nice, but just not convection. Because convection ovens run you more money. So instead of spending an extra 250.00 on a convection oven we spent a quarter of that on this, and it does all the same things including baking, and even broiling a whole chicken! So you can keep it simple with this thing, or put it to the test and go make some home made cookies!I will tell you to be patient, at first, even if you are doing basic toasting, it seems to take forever and you will wonder what the heck is going on. This thing is a slow burn, literally, but for a good reason, because things come out nice and even. It goes from zero to sixty in about 3 mins and soon things get toasty fast. So much so that you really do need to let this thing cool down. So far I am impressed. it really does work nicely. Ps, a secret to having to constantly clean the bottom of the oven, Foil. What better way to catch all the crumbs then to make sure they never fall there in the first place. Keeps your maintenance duty much lighter.I do have one concern. I am used to knobs. Even though my toastmaster looked like it has been to hell and back, the knobs were solid and never gave out, and never fell off. It really was a champ. The buttons on this new fangled Black and Decker feel delicate and I do worry that over time, if one of those buttons ceases to function, it might be a serious problem. They feel a bit flimsy. But that is the way things are done with appliances these days, they are mostly all digital with no Knobs. I worry about the same thing with my Samsung washer and dryer, other then the settings button, all the other options are digital with soft buttons, if something goes wrong, Houston we have a serious problem.As long as that holds out, I have hope this will be more then just pretty, but last a really long time. PS, you really have to play with this thing to understand all it can do. The timing buttons are a bit odd and take practice. It definitely takes some getting used to.As of now I can recommend it highly, we shall see if it holds up like my old and gray toastmaster.",
                "reviewVotes": "170 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51a6pIlH-ZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Placeholder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDXQWWJX3R2P56GETDE7ZQZG7PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13W6I1YA7OYOW?ASIN=B0043E6PLC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars It cooks quicker and better than my old toaster oven.",
                "reviewText": "The instructions were helpful. Food can be cooked crispy. 20 to 30 minutes maximum to bake or broil anything.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tony C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRVVTJ5LA73O6RJDU37APTMHTMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PEYT2U82M9LT?ASIN=B0043E6PLC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Nice Product, Works Great, But Box was Opened and Missing Paperwork",
                "reviewText": "I have no problem with the oven, itself. It seems well made, it gets hot quickly, and it makes exciting (?) toast. However, the box was mushy, seemed to have been opened, and there was no owner’s manual or other paperwork enclosed. I asked Amazon for help and they just wanted to do a complete return, which is more trouble than it’s worth.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan D. Littell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFTQFLMUAFZHGICDYDNFRZDM26Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39PCYBYATXIIE?ASIN=B0043E6PLC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2022",
                "reviewTitle": "5.0 out of 5 stars I like it",
                "reviewText": "Our previous convection toaster oven served us well over the years with 4 teenage boys and frozen pizzas. It finally gave out and they no longer made it anymore. Settled on this one for looks, price, convection, etc. After having used it for several weeks, I think I can give a fair review. I like it, it gets good and hot. For S&G, I timed how long it took to get to 350 degrees, exactly 4 mins. I mention this because I got very used to setting the timer to the shortest recommended time and put the food in as it was heating up. I guess this one takes a little longer to warm up because I noticed I didn't need the full amount of set time to cook. So now I still set it to the lowest time, I just start preheating first, before setting up whatever I was going to put in. Convection fan only works on the Bake mode. Just hit Bake, Convection fan, set the temp, then the timer and hit start. It's not an air fryer, But it bakes, re heats dinners and gives it a nice little browning if you like that.Biggest con is the door. You have to hold it all the way down, nothing stops it from hitting the counter hard if you let it go. The lettering is hard to see and read, especially at my age. Now, I've just got used to where my favorite buttons are.Toasting: I don't toast regular bread in it, but I've done some bagels and home baked bread that can be too thick for a toaster. I've noticed that it is uneven. Seems like the rear/upper is the hottest and browns quicker. Lastly, it has a little rounded, recessed area in the back and it seems like it could hold up to a 12\" pizza. I put in a 11\" plate and there was still a little gap to the door. It fits a 9x13 casserole dish WITHOUT handles.So, in all, it works well for us as empty nesters. Big enough to heat up food, bake some potatoes without having to use the big oven. Oh, and the rack can be moved into 4 different levels, two slots that it can slide into and you can put it upside down.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diana Pastrana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 12, 2023",
                "reviewTitle": "Me encanta",
                "reviewText": "Es un buen producto funciona bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 19, 2021",
                "reviewTitle": "Bought the same model for the second time",
                "reviewText": "This model has a long body, you can bake the whole chicken in it, it is just high enough so it would fit most microwave spaces in smaller houses. The controls are easy to use, there are various settings, it looks good, the polish blends with other appliances well. We bought the same model for the second time, the first one lasted 5 years, until then the ON button broke. We searched quite a bit for a new oven, and in the end, decide to buy the same one, we find that for this price range it is still the best deal and the best design.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WALTER SOUTHERN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 7, 2023",
                "reviewTitle": "Easy to use",
                "reviewText": "The box the unit came in was badly damaged . The unit has a dent in it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 29, 2021",
                "reviewTitle": "Bueno",
                "reviewText": "Eexelente producto a buen precio",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EnriqueEnrique",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 4, 2022",
                "reviewTitle": "No compren en Amazon la garantía de los productos no la hace el d",
                "reviewText": "Compre este horno hace 6 meses y sopas que empieza a fallar el display no marca correctamente y hablé a black&deker y me dicen que no aplica la garantía del producto por que no es nacional",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Ri3tnEdrL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$92.69",
                "sellerName": "✅✅✅ clicktosave",
                "sellerRating": "5"
            }
        ]
    }
}