{
    "remaining_requests": 35258,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Couture-Cooking-including-Matte-Black/dp/B0BKLVD75Y",
    "body": {
        "name": "Cafe Couture Oven with Air Fry, 14 Cooking modes in 1 including Crisp Finish, Wifi, Matte Black",
        "price": "$349.00",
        "originalPrice": "$449.00",
        "rawPrice": 349.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Couture-Cooking-including-Matte-Black/dp/B0BKLVD75Y",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C8F19BQY"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BKLVD75Y",
                "variationName": "Color",
                "variationValue": "Matte Black",
                "price": "$349.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41iKtY8AmxL._SS36_.jpg"
            },
            {
                "asin": "B0BKLVF1DM",
                "variationName": "Color",
                "variationValue": "Matte White",
                "price": "$349.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41NUOnE9h0L._SS36_.jpg"
            },
            {
                "asin": "B0BKLV5M4H",
                "variationName": "Color",
                "variationValue": "Steel Silver",
                "price": "$349.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41SYQJnuyEL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41iKtY8AmxL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51LvvUlpXDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ImFQWOXeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51O tf6KIIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515fbBc55AL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uhLyY6SCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RHqJdftEL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Café Store",
            "link": "https://www.amazon.com/stores/Caf%C3%A9/page/A9FB1340-4485-4AB4-913B-5F486EF5AE7B?ref_=ast_bln"
        },
        "brand": "Café",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 154,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 7 hrs 5 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LARGE CAPACITY - Accommodate 12\" pizzas, 9\" x 13\" cake pans, 2 qt. casserole dishes and more in a spacious cooking cavity that's sized for party-style fare",
            "14 COOKING MODES - Flawlessly prepare any recipe, from kids snacks to dinner party hors d'oeuvres, with 14 essential cooking modes, including Air Fry, CrispFinish, Bake, Broil, Roast, Toast, Bagel, Pizza, Cookies, Proof, Dehydrate, Slow Cook, Reheat and Keep Warm Watch Video",
            "WIFI CONNECTED- Delight in simpler, smarter cooking by using your voice to control your countertop oven through Echo or Google Home devices. Plus, use the SmartHQ app to start and program cooking modes remotely and even download updates",
            "CONTROLS & LCD DISPLAY- Cooking is a cinch with intuitive controls and a bright LCD display that let you program cook mode, time and temperature, add Crisp Finish to any meal and enable Café connected features",
            "6 QUARTS HEATING ELEMENTS - Savor the convenience and performance of 6 total heating elements that enable rapid preheating, cook evenly and let you set temperatures for all your needs, from proofing at 80˚F to air frying at 450˚F"
        ],
        "description": "The Café Couture Oven with Air Fry is your new kitchen essential: with 14 cooking modes, you can Air Fry, Bake, Toast, Dehydrate, and more — all without having to turn on your main oven. A spacious interior capacity can accommodate 12\" pizzas, 9\" x 13\" cake pans, 2 qt. casserole dishes, or up to 6 slices of toast. Showcase your individual style and taste — with curated finish options and adorned with Café's signature copper accents, these countertop ovens make a design statement on your counter. This versatile oven pairs high performance with countertop convenience. It's large enough to cater to a crowd and boasts six efficient heating elements that enable rapid preheating. The Wi-Fi-enabled machine syncs with the SmartHQ app so you can use voice control (through Echo or Google Home devices) and program recipes remotely. Distinguished by sleek designer finishes, the Café appliance line from GE defines bold contemporary style in the kitchen.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17659095011"
            },
            {
                "name": "Air Fryers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17659096011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Café"
            },
            {
                "name": "Color",
                "value": "Matte Black"
            },
            {
                "name": "Product Dimensions",
                "value": "17\"D x 18.6\"W x 14\"H"
            },
            {
                "name": "Special Feature",
                "value": "CrispFinish™ - Crisp Finish Use CrispFinish at the end of any standard cooking mode to melt, caramelize, brown or crisp, and put the perfect finishing touch on any of your signature dishes See more"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Heavy-Duty Wire Rack; Baking Tray; 12\" Pizza Pan; Air Fry/Dehydrate Basket; Crumb Tray"
            },
            {
                "name": "Model Name",
                "value": "Café™ Couture™ Oven with Air Fry"
            },
            {
                "name": "Finish Type",
                "value": "Matte"
            },
            {
                "name": "Temperature Range",
                "value": "80 - 450 Degrees Fahrenheit"
            },
            {
                "name": "Item Weight",
                "value": "28 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Café"
            },
            {
                "name": "ASIN",
                "value": "B0BKLVD75Y"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "C9OAAAS3RD3 Matte Black"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 154 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28,858 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #115 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "October 26, 2022"
            },
            {
                "name": "Capacity 25 Liters",
                "value": "Wattage 1800 watts"
            },
            {
                "name": "Material Aluminum",
                "value": "Item Weight 28 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Countertop Ovens Add the finishing touches to your kitchen space with our wide range of Café countertop appliances. Whether you’re looking for a premium coffee maker to get your morning caffeine fix or a multi-purpose oven with an air fry option, you’ll find the right high-quality appliance here at Café. Our smart and functional countertop kitchen appliances will complete the look of your stylish kitchen. Choose from our range of premium countertop kitchen appliances that complement your kitchen in various colors and finishes - from stainless steel to matte black and matte white.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/54fb1077-4029-4e5b-b15a-0b674b81bbb0.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Perfect for your Countertop Accommodate 12\" pizzas, 9\" x 13\" cake pans, 2 qt. casserole dishes and more in a spacious cooking cavity that's sized for party-style fare 14 Cooking Modes Café countertop ovens offer 14 cooking modes, letting you Air Fry, Bake, Roast, Toast, Dehydrate, and more – without having to turn on your main oven WiFi Connected & Voice Control Delight in simpler, smarter cooking by using your voice to control your countertop oven through Echo or Google Home devices. Plus, use the SmartHQ app to start and program cooking modes remotely and even download updates",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/27ac7362-f6d3-4637-82b0-3960331d352e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f07e6095-f92b-4608-87c3-04c3671a784b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8745f24c-002f-4e95-b729-d62791676f60.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Crisp Finish Use Crisp Finish at the end of any standard cooking mode to melt, caramelize, brown or crisp, and put the perfect finishing touch on any of your signature dishes Accessories Accessories include a heavy-duty oven rack, 12\" enamel non-stick pizza pan, enamel non-stick coated baking pan, wire mesh air-fry/dehydrate basket, and removable crumb tray 6 Quartz Heating Elements Savor the convenience and performance of 6 total heating elements that enable rapid preheating, cook evenly and let you set temperatures for all your needs, from proofing at 80˚F to air frying at 450˚F",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/acca442f-0029-4be8-9d95-3a3420be1301.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6359da73-689a-49e5-80ef-7751abb29d6a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/81caa547-930c-4129-8547-cc8181039d91.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Café Couture Oven with Air Fry Café Specialty Grind and Brew Coffee Maker with Thermal Carafe Café Express Finish 2-Slice Toaster Café Specialty Drip Coffee Maker with Thermal Carafe Café Affetto Automatic Espresso Machine + Milk Frother Café Bellissimo Semi Automatic Espresso Machine + Milk Frother Brand Café Café Café Café Café Café Small Appliance ✓ ✓ ✓ ✓ ✓ ✓ SmartHQ Connectivity ✓ ✓ ✓ ✓ ✓ Finishes Available Steel Silver, Matte White, Matte Black Steel Silver, Matte White, Matte Black Steel Silver, Matte White, Matte Black Steel Silver, Matte White, Matte Black Steel Silver, Matte White, Matte Black Steel Silver, Matte White, Matte Black",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/54fb1077-4029-4e5b-b15a-0b674b81bbb0.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/27ac7362-f6d3-4637-82b0-3960331d352e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f07e6095-f92b-4608-87c3-04c3671a784b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8745f24c-002f-4e95-b729-d62791676f60.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/acca442f-0029-4be8-9d95-3a3420be1301.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6359da73-689a-49e5-80ef-7751abb29d6a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/81caa547-930c-4129-8547-cc8181039d91.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4fb7deb0-49e7-4d15-b0b5-3c35c5126a6d.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8e41093c-03e0-410e-90be-874358a52dfb.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3bd485a3-81c8-4082-8357-5e806c2d00a8.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0385b9e3-ef0d-49ab-b305-cf03da0890ae.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/977934c5-9cb3-42bc-b6a1-86a9be663701.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/633f53e2-2416-4796-95dc-26a7b1a032e6.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SomebodySomebody",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCDS7HS55C27QWOBBAXWVYOA7CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FEBEZCPGSVT4?ASIN=B0BKLVD75Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Arrived today & first impression: That thing's HUGE!",
                "reviewText": "I'm old and weak, but somehow I managed to scoot the shipper from my porch to the inside of my house. I opened both ends of the shipper, then got on the floor and pushed the contents out of it. Opened the product box and struggled to get the Styrofoam that held the oven in place out of the way. It was packed so tight, it was hard to do. Got the oven out of the box but then there was another hunk of Styrofoam to remove from the box so I could get to the accessories. None of this was accomplished fast and afterward I had to scoot across the floor to get to my couch so I could grab it while pulling myself up and back on my feet. I then surprised myself when I was able to lift the oven and carry it to my kitchen counter. Some Tylenol took care of the aches that followed the unboxing ordeal. I mention all this because if, like me, you're old and weak, you're going to find a real challenge when this item arrives. Good luck.Now for the oven: I bought it because it's white (matching all the appliances in my kitchen) and the handle and knobs look like copper (I have a lot of copper in my kitchen). I don't need it for the fancy stuff it does, but may change my mind about that as I try the various settings. What I expect to use it for is toasting reheating, and broiling.Today I tried it out with a pizza, but ran into some problems. The pizza setting assumes you're baking a totally frozen pizza. In my case, the crust was frozen, but then when that was baked I added the fresh toppings (sauce, pepperoni, mushrooms, and cheese). Stuck the assembled pizza under the broiler for a few minutes. So far, so good -- but when I tried to remove the pizza from the pizza pan (the one that comes with the oven), it wouldn't budge. Totally stuck to the pan. I trusted the manufacturer's word that it was non-stick. Ha. I scraped off the toppings and ate those, then went about the business of getting the crust off the pan. Soaked it for a while, then used a silicone spatula to peel off the crust. The little bit it removed was very slow going and not at all thorough. Soaked it some more, then used some detergent and a nylon scrubber. That worked, with considerable effort. Washed it and was surprised by how \"like new\" the pan looked. I had done no damage. ADDED LATER: I think the problem was the crust, not the pan. Nothing has been a problem after that. See update at bottom of review.About the pizza pan: In the materials that accompany the oven there is an illustration of the pizza pan showing it is covered with perforations but the pan I received had just a few holes around the rim. The pan was otherwise solid. I bought another pizza pan with perforations all across it and will see if I can tell a difference when baking pizzas on both pans. In the past, in my regular oven that's in my stove, I've used a fully perforated pan and it works nicely to make the crust crisp.I did the airfry instructions that came with the oven -- running it without anything in the oven, per the instructions to get the oven ready to use (after first wiping down the oven walls also per the instructions). The oven was preset to do that so there was no problem with the controls. When I moved on to try making the pizza, the settings couldn't be the built-in pizza settings, so I changed them for baking the frozen crust. Let me share some wisdom with you: read the instructions to learn how to do the settings, rather than plunging right in, trying to figure it out yourself (like I did). I wasted a lot of time and ended up swearing at the settings for not doing what I wanted them to do. Then I read the instructions and it was super easy.My oven has what I think is probably a flaw. See the photo of the screw that sticks out from one of the inner walls. That can't be right, can it? I'm going to contact the manufacturer to find out if I should try to screw it in (or if I should leave it alone because it's that way on purpose).Before ordering the oven, I read all the reviews and as far as I recall no one had ordered the white oven except for one person who kept receiving black ones instead, then dealing with returns. I was worried I'd get the wrong color, but Amazon did a perfect job with fulfillment.I saw several reviews mentioning the oven's price. When the number was mentioned, it was a price a hundred dollars more than I paid (about $350). I would not have ordered the oven if it'd been $450. I had to have an argument with my budget, talking myself into making the purchase at the price I paid -- especially because I already had a perfectly-operating Breville toaster oven whose only sin was that it was stainless steel, not white, and doesn't have copper-colored accents.At this early moment of ownership of the new oven, I'm happy I ordered it. If that changes over time I will update this review. Right now my task is figuring out how to arrange my kitchen with such a huge newcomer needing to take up a lot of space on my counter top.UPDATE: That thing in the photo of the oven's interior is supposed to be just like it is. Support told me it's the thermostat.UPDATE #2: I have been using the oven for several days now and everything turns out great. I'm also impressed with the accessories. When they say non-stick they mean it. I had only one bad experience cleaning the pizza pan and I think the problem was what I was baking, not the pan. They say don't use spray to avoid sticking, but I did and will never do that again. I don't add anything now to them to prevent sticking and whatever does semi-stick comes right off when I use a Scotch-Brite scrubber. Takes very little time and effort. Only thing I haven't tried is air-frying. I don't know how to do that and not sure I would like it.Update #3: i really, really, really love this oven. Remember when I said I wouldn't use the air fryer? Ha. I use it regularly. I also thought I wouldn't use bake very often, but that too is something I use regularly. After using the air fryer, the back wall and the inside of the door need to be cleaned. I've been using Mr. Clean Magic Erasers and that works out great. I'm loving the oven so much, I'm thinking of buying one for my daughter, but the pricing keeps bouncing around and I'm hoping to catch it when it's $350 again.",
                "reviewVotes": "61 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/611dEU6lbnL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61G0tpU7OML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61PRKRJhcdL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61nRoEXg+IL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Saldana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETDO47GBUYA6KVFVLMQONN2X6TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OP2XXL0I2562?ASIN=B0BKLVD75Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Kitchen Addition",
                "reviewText": "Great air fryer and oven. Good looking, quiet and spacious.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott R.Scott R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRETFVCLV2FZNI7BN3OITPRUA7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21MPT76O0GTG2?ASIN=B0BKLVD75Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Sleek Design & Multi-Purpose Functionality",
                "reviewText": "This is possibly my favorite machine from all previous ones we have had! This machine works so fast. It is so easy to use and pre-sets the length of time before you pop something in it. For example, when I put a veggie patty in it I just simply click “air fry” and it sets the time for recommended air fry mode. It works so fast and we use this everyday. We barely use our oven anymore because this does everything our oven can do and more - plus, it’s so pretty and sleek in our kitchen.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/610cJlxWBSL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cassie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAXWYBNWYGR7XDKCXDJVR5OZYLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ME2JK3435PVU?ASIN=B0BKLVD75Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Great!",
                "reviewText": "This is worth every penny. The computer board in our oven quit right before Thanksgiving. We postponed our small family meal, ordered this appliance, and have had nothing but great service. Its large enough to roast a chicken, bake cake layers, etc. High Quality.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jrs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNG34MN2INGQNR66ZC7X7AWEHRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H3B8U1WK6APT?ASIN=B0BKLVD75Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Quality",
                "reviewText": "I've been using this appliance for a few weeks now & it does what is expected of it. It has a high(er) end, quality look to it for sure. We've toasted (duh), air fried & baked in it. Always with good results.However, I recall one reviewer who mentioned the rubber gasket along the bottom of the 'window' causing an issue with cleaning. I agree with this reviewer. At times, steam rises up & around the door & we believe this is the reason. This does not seem to cause a problem with the function - but if it does in the future, I'll update my review.The oven was so well packaged it took quite awhile to remove from the box. This is not a demerit - but it merit's mention.All in all, we're pleased with this purchase.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew J Pagano",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPCTRXPDQ7RW7WHCNY2TNY23RMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQL7P5A0E3A9L?ASIN=B0BKLVD75Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Qualit, the GE App Is garbage.",
                "reviewText": "Great product, All of GE's Cafe line are great products. Now if they could get the software team to make an application that was not a full fledged failure that would be nice.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dream Team",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGA4RNFZXL3IT2QIRMG3KRZ3INNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RF8QJ61JGFZE1?ASIN=B0BKLVD75Y",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "1.0 out of 5 stars Not GE Cafe Quality",
                "reviewText": "If you are buying this because you want a match to your existing GE Cafe Appliances, don't proceed. This looks cheap with plastic knobs and an inferior looking grade of stainless steel. If you are buying this for its cooking ability, consumer reports gave it very low scores in that arena. In short, this is not worth the money, even on sale. Take my advice and skip it!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FRAN FORNABIA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAVCCHVMHLUPWIKX4P64HBI5RAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZMEGJH3SQ49M?ASIN=B0BKLVD75Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy to use. Worth every penny",
                "reviewText": "Nothing to dislike abiut this appliance. Easy to use and maintain. Worth every penny!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}