{
    "remaining_requests": 35350,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BLACK-DECKER-TO3250XSB-Convection-Countertop/dp/B00LU2I428",
    "body": {
        "name": "BLACK+DECKER 8-Slice Extra Wide Convection Toaster Oven, TO3250XSB, Fits 9\"x13\" Oven Pans and 12\" Pizza, Stainless Steel/Black",
        "price": "$79.99",
        "originalPrice": "$79.99",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BLACK-DECKER-TO3250XSB-Convection-Countertop/dp/B00LU2I428",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41QShEJ5WzL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/414tdOJCAML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41o1pfYKzSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UvIrN476L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vD8tws0xL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514sM k-L6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ExohT-epL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the BLACK+DECKER Store",
            "link": "https://www.amazon.com/stores/BLACKDECKER/page/9CD42FC6-F544-4F9F-807D-D1B33889F479?ref_=ast_bln"
        },
        "brand": "BLACKDECKER",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 9815,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 20 mins",
            "FREE delivery Monday, February 19. Order within 7 hrs 20 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fits Most Oven Pans - Use the pans you already have. This spacious oven fits most standard 9”x13” oven pans with handles. That means you can go from straight from oven to table. Plus, the included baking/broiling pan fits perfectly, making it easy to insert and remove food. Toasting rack also included.",
            "Convection Heating - The powerful convection fan circulates warm air throughout the oven for fast, even baking. Other functions include: baking, broiling, toasting, and keeping food warm.Dedicated Toast Timer - Get perfect toast every time using the dedicated toast timer. It allows for predictable shade selection with every use.",
            "Temperatures in the oven will be lower than your set point. This is due to advanced heating elements used in this oven. Temperature dial settings have been calibrated to provide expected results for most recipes taking into account the advanced heating elements.",
            "60-minute Timer - The 60-minute precision timer features stay-on functionality for longer baking tasks. Dedicated precision toast timer. 3 rack positions for improved cooking flexibility. Removable crumb tray for easy cleaning"
        ],
        "description": "The BLACK+DECKER 8-Slice Extra-Wide Stainless Steel/Black Convection Countertop Toaster and Pizza Oven with Broiler Pan simplifies large baking tasks. Its extended interior fits an entire 13”x9” pan with handles, so you can bake lasagna, brownies, and even 12” pizzas with your standard bakeware. You won’t have to wait around for your large oven to preheat anymore, just set the correct temperature and time and you’ll be baking in minutes with four unique functions: bake, broil, toast, and keep warm. Convection technology circulates air within the oven for fast and even results while baking. Plus, the toaster oven includes a broiler pan and an external crumb tray that slides in and out, making cleanup a breeze. When it’s time to eat, trust the #1 brand in toaster ovens*—BLACK+DECKER.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Toaster Ovens",
                "link": "https://www.amazon.com/Toaster-Ovens-Toasters-Small-Appliances/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289937"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "BLACK+DECKER"
            },
            {
                "name": "Color",
                "value": "Stainless Steel/Black"
            },
            {
                "name": "Product Dimensions",
                "value": "14.5\"D x 22\"W x 11.5\"H"
            },
            {
                "name": "Special Feature",
                "value": "Timer"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Crumb tray"
            },
            {
                "name": "Model Name",
                "value": "050875812185"
            },
            {
                "name": "Finish Type",
                "value": "Brushed"
            },
            {
                "name": "Temperature Range",
                "value": "250 - 450 Degrees Fahrenheit"
            },
            {
                "name": "Item Weight",
                "value": "17.5 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Spectrum Brands"
            },
            {
                "name": "ASIN",
                "value": "B00LU2I428"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "TO3250XSB"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 9,815 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,152 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #6 in Toaster Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "June 24, 2014"
            },
            {
                "name": "Capacity 8 Liters",
                "value": "Wattage 1500 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 17.5 Pounds"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cody Barr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOAG5D5IUWEAHGHIJ6A2T2DOBIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F2Y7MT3GJO11?ASIN=B00LU2I428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Big! Great toaster oven!",
                "reviewText": "We love this toaster oven. It’s nice and big can fit a casserole dish no problem, pizza too. It broils great, overall a fabulous unit. Like having a second oven, real handy!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Myron J Milner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6YYGXSY32MNFFM2U7AI6T6RJWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32XHPD9I5NAK5?ASIN=B00LU2I428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Be careful",
                "reviewText": "Bought this toaster because of it simple mechanical controls, and its extra width, despite poor reviews posted. Yes it is light weight, it gets hot ( it is a oven after all ) but not so hot to be a problem or hazard to life and property as some have claimed. It reaches operating temp in a reasonable amount of time. The dial settings were quite accurate ( temp setting 450f , oven temp. gage 460f) Have no idea how accurate the oven temp gage is, but I think it is accurate enough.Previous to this purchase I bought a different brand toaster oven that cost three times the price, it failed two days after receiving it, that was a waste of my time and money, Yes Amazon did refund money, but it did end up being a less then ideal refund, and it did cost me money. I doubt I will ever shop or buy from Amazon again.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KMS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYOEG2A4AMSQ6BK6TWGF7GNPO5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I0V4UL104BJR?ASIN=B00LU2I428",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 2, 2015",
                "reviewTitle": "4.0 out of 5 stars Excellent toaster oven!",
                "reviewText": "We used the same toaster oven for the first 7 years of our marriage. My husband complained time and time again about how ugly it was getting and that we needed to upgrade. Well, I did that for Father's Day! Now, we use our toaster ovens a lot. Literally on a daily basis. We use it for all of the regular things that you would expect like toast, bagels, frozen prepared meals, pizza, etc. We actually don't have a microwave so we use it to warm up all of our food as well! So it is used for almost every meal of the day.I LOVE the size of this toaster oven and it is just pretty! It is so much more usable than our previous oven and it doesn't take up too much room on our countertop. I have successfully cooked things that I would have only cooked in our larger standard sized ovens previously like casseroles, bread, cookies, etc. It performed just as well as the larger oven. It's also nice not to have to heat up the entire house when I want to cook something. I do have to say that it cooks things more evenly than our previous toaster oven as well.I was specifically looking for a toaster oven with knobs versus a digital display. How many times have I had products with those fancy digital displays break?! Technology is great, but sometimes I just like to go back to the basics and I mean that in a good way. The knobs are easy to manoeuvre, but I did have a slight challenge making toast the first time. I couldn't quite figure it out. I'm sure that if I would have read the directions better that would have helped though. ;-)Now...drumroll, please...the reason for 4 stars vs 5 stars? The buzzer! That sucker is LOUD. That's great when I want to be notified so that I can remove items from the oven, but when my kids are asleep, I have a migraine, etc then I would love the option to turn it off or lower the volume. That's definitely not a make or break detail and I would still purchase this toaster oven again. Especially for the great price!",
                "reviewVotes": "289 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Louise Zielinski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOS6GSNHVURFYWZC22WWDZZFCUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OFSXYTYQKIQF?ASIN=B00LU2I428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2022",
                "reviewTitle": "5.0 out of 5 stars Just received my third one!",
                "reviewText": "I have just received my third oven of this model. The other two lasted about four years each with everyday use. Not just toasting in the morning, but this is my actual oven for cooking. I never use my big oven. I am a baby boomer and I have come to terms with things not lasting like they used to. That being said, this oven has served me well. I got it originally for the wide oven capacity. For the two of us, this is perfect. I have read the other reviews, and yes when it was getting older, I noticed it became loud on the cooking part, not the toaster. And then finally the oven part went, and only the toaster worked. But I didn't care if it played a tune while it cooked, I still liked it. No glass ever shattered, and I didn't notice the temperature being subpar either. It cooked chicken, pork, casseroles, everything, or I would not have gotten a third one. For the most part I was quite pleased with it. I noticed they now have a newer version with a air fry option. Nope, I know better. I just stuck with what worked. I don't need any fancy add ons. Just one more thing to break. My guess is it doesn't air fry like a dedicated air fryer anyway. One more thing, I gave it one star because the grate cleans ok and the tray, which I cover with foil anyway. I stopped trying to clean the cavity of a toaster oven long ago, so no. Never bothered. I just bought new. So there you have it.UPDATE: I like honest reviews so I am going to put this here. Having had my new oven for several weeks now, I notice the cooking/baking selection makes a loud noise. Annoyingly loud. My other ones did when they were on the way out. This one is new and it is making the noise. The toaster, broil selections are quiet. Just the low sound of a ticking timer. Needless to say, after this one, I am going to try to find something else. It is too bad because I loved the width of this one. But I cannot listen to this oven. I have to put the TV on louder since my kitchen/family room is one area. I will not stop using it, but to say it is annoying is an understatement. So if this seems like something you can stand, go ahead. The oven cooks quickly, is wide and I like everything else about it. But it WILL be my last because of the noise. Color me disappointed.",
                "reviewVotes": "59 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarafina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRSBL2JEZDX4MOXJ264VXAEKT7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R85TGRWU5X1G4?ASIN=B00LU2I428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Black & Decker 8 slice extra wide countertop oven",
                "reviewText": "Arrived in excellent condition. Works well. Wish the oven grill had a \"stop guard\" when pulling the dishes out of the oven. Must be very careful as the grill will \"tip\" so be very careful when you pull the baked goods from the oven, can burn yourself and dishes can drop. Very satisfied with the rest of the oven, temps good, knobs work well. Good purchase.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "billybooks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDWHEA5EXBUCU2SZ3C6JE6FJQYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23J2E6XO7GA7H?ASIN=B00LU2I428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Love the LARGE size",
                "reviewText": "Once you figure it out this is easy to use for baking, toasting and so on. Very large capacity. Does a particularly nice job with baking function.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fran Tiburzio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4AQHXTJJKNL62LJTI63UBGHLBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11AC78Z0DNJOY?ASIN=B00LU2I428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Good little oven",
                "reviewText": "I live alone, so it seems silly to use the regular oven just for me. This works great, and all my pans & cookware fit in it easily. It does make some noise (a rattling sound) when it's baking, but it's not a deal breaker to me.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Quantum CD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 2, 2023",
                "reviewTitle": "Eficiente",
                "reviewText": "Ha funcionado eficientemente hasta la fecha. Reduce el tiempo de horneado de pan y asado de carnes, aumentando así el ahorro en el consumo de energía. Además, el espacio interior es bastante amplio.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Esther Osborne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 25, 2020",
                "reviewTitle": "Works great for baking.",
                "reviewText": "A lot of good things about it, but toaster doesn't work well at all. Bread gets hard n crisp, but no browning at all until so hard that you can't eat it. Yep my settings rechecked and accurate. It has no indication to show or sound, that oven has reached set temp. A bit annoying, but otherwise a good and very roomy toaster oven.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sanjiv Dua",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 4, 2020",
                "reviewTitle": "Underrated Transformer . 500w instead of 1500w. Absolute cheat",
                "reviewText": "This product works on a 110V AC source . Amazon is supplying it with a local step down transformer from 230V to 110V to make it suitable for Indian conditions . The transformer supplied is not working . I made a complaint to Black & Decker who sent a technician and he rectified the transformer on his second visit . Within the first use , the main MCB tripped indicating overload or short circuit in the transformer . Black & Decker refuses to service / replace the transformer saying it’s not their product . It’s just been a month since delivery and issue isn’t getting resolved . Will Amazon come forward to sort out the mess ?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CGA-Mex",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 7, 2018",
                "reviewTitle": "Excelente producto",
                "reviewText": "Compramos este horno para reemplazar nuestro horno que tenía mas de 10 años. El modelo anterior era el modelo tradicional en el que caben solo 4 panes (apretados) y ahora nuestra familia ha crecido así que necesitábamos un horno que nos permitiera poner una mayor cantidad de alimentos en el horno al mismo tiempo. Con este modelo podemos cocinar 4 o 5 molletes al mismo tiempo (depende del tamaño del pan) y así servir la cena o el desayuno a todos juntos y no tener que hacerlo por turnos. Es conveniente que cuenta con dos selectores uno para el horno y otro para el tostador, y en ambos casos las indicaciones son claras y fáciles de interpretar. Lo único en lo que hay que tener cuidado es su tamaño, ya que si no se tiene el espacio suficiente en la cocina, puede resultar estorboso.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 14, 2017",
                "reviewTitle": "I recommend this oven! Doable and durable!",
                "reviewText": "It's a good oven that can put 4 slice of toast. You can put 6 slice but will be a little bit tight. The instruction is very easy to understand, and the oven heat very quickly. This is my 3rd oven with Black + Decker. I'm satisfied with this brand's oven. I also have this brand of rice cooker, it works well. I would recommend this oven to others! It's worth the price and durable!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}