{
    "remaining_requests": 35289,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Presto-03430-Pizzazz-Plus-Rotating/dp/B00005IBXJ",
    "body": {
        "name": "Presto 03430 Pizzazz Plus Rotating Oven, Black",
        "price": "$82.31",
        "originalPrice": "$89.99",
        "rawPrice": 82.31,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Presto-03430-Pizzazz-Plus-Rotating/dp/B00005IBXJ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51fJ mofd5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51tzmFW k4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41g9f9VmS0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HspBy6 hL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 ytMAUnrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mj-u9gNzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61rN5nDWazL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Presto Store",
            "link": "https://www.amazon.com/stores/PRESTO/page/DCAA63BB-5854-4DA5-9AD0-40998884F669?ref_=ast_bln"
        },
        "brand": "PRESTO",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 18980,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 6 hrs 11 mins",
            "FREE delivery Tuesday, February 20. Order within 17 hrs 56 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Rotating tray turns continuously to assure even baking.",
            "Top and bottom heating elements bake foods from both sides. Heating elements are separately controlled, allowing you to select top, bottom, or both elements for perfect results every time.",
            "Timer signals end of cooking time and automatically turns off heating elements.",
            "Saves as much as 60% in energy compared to a conventional oven.",
            "Removable nonstick baking pan is easy to clean and store."
        ],
        "description": "Product Description The fast and easy way to bake frozen, homemade, take-and-bake, and deli pizza. Also great for preparing frozen convenience foods such as chicken nuggets, jalape–o poppers, fish fillets, egg rolls, cinnamon rolls, cookies and much more. Rotating tray turns continuously to assure even baking. Top and bottom heating elements bake foods from both sides. Heating elements are separately controlled, allowing you to select top, bottom, or both elements for perfect results every time. Timer signals end of cooking time and automatically turns off heating elements. Save as much as 60% in energy compared to a conventional oven. Nonstick pan is removable for easy cleanup and storage. 120 volts AC, 6o Hz only, 1235 watts Amazon.com This 1,235-watt countertop oven makes pizza in about half the time required by a conventional oven. You don't need to preheat it--it begins rotating and baking the moment you plug it in. There are independently controlled top and bottom heating elements, so all types (frozen or fresh) and sizes (7 to 12 inches) of pizza can be custom baked. With a rising-crust pizza, for example, you should run the lower heating element for 10-12 minutes before turning on the top element. For a crisper crust, bake the pizza with both heating elements, then finish it off with a few minutes of bottom-only heating. For extra cooking time on your toppings, leave the top element on a little longer. A timer with automatic shutoff lets you set cooking times precisely, and a cooking-time guide for various pizza types is printed on the pizza maker. For safety, the appliance shuts off automatically if it overheats. With the 13-1/4-inch-diameter baking pan in place, the pizza maker is 13-1/4 inches wide, 9-1/2 inches high, and 17-1/2 inches deep. (The baking pan can be removed for more compact storage.) It carries a two-year warranty against defects. --Fred Brack",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Countertop Pizza Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=17548251011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Presto"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "14.5\"D x 15.8\"W x 10.3\"H"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Control Type",
                "value": "Knob Control"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "1"
            },
            {
                "name": "Model Name",
                "value": "Pizzazz Plus Rotating Pizza Oven - 12-Inch, Countertop Oven, Nonstick Tray"
            },
            {
                "name": "Finish Type",
                "value": "Polished"
            },
            {
                "name": "Cable Length",
                "value": "14.5 Inches"
            },
            {
                "name": "Item Weight",
                "value": "7.6 pounds"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Presto"
            },
            {
                "name": "ASIN",
                "value": "B00005IBXJ"
            },
            {
                "name": "Country of Origin",
                "value": "Indonesia"
            },
            {
                "name": "Item model number",
                "value": "03430"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 18,980 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,887 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #3 in Countertop Pizza Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "May 5, 2003"
            },
            {
                "name": "Capacity 12 Cubic Inches",
                "value": "Wattage 1235 watts"
            },
            {
                "name": "Material Nonstick",
                "value": "Item Weight 7.6 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56a86352-c67d-44be-a610-b58cf9956a8d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d88b0b27-d9fa-441c-a7c4-c49254cdf242.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/32c743c9-2bad-4549-8110-004b3cbd2d5f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/70ca8096-08a0-4058-936f-b9ae49cc0ec0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1aea8ceb-23d1-4494-ad48-6d65a8897250.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa0c66ad-5ac3-4eba-a31c-59116ee932ff.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/404f8973-5d3b-41aa-aa46-7fe1c05345ef.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/327ed458-72aa-448f-8c7f-0bcba20b4af9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sparkle65Sparkle65",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGR6FET6T57LOYAYGEATK2KMEYFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1L2NGPAM1BY64?ASIN=B00005IBXJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Cooks/Bakes Perfectly",
                "reviewText": "Just received today Couldn't wait to try it out. Made the mini egg rolls first. As you can see only two left..they came out deliciously perfect. Then I decided to try and bake refrigerated cookie dough. Again perfection. The versatility is no doubta great feature of this machine! Directions are easy. So easy to clean. I am sure I will be experimenting a lot. Will do pizza tomorrow and fish fillets on Friday. Only drawback is storing it. Yes the baking plate comes off, but the unit itself is a good size. Also, I would think that the heating elements on top and bottom, which are somewhat exposed, need to be very carefully taken care of...in other words, you cant just shove it into your cupboard. I have already made a nice roomy spot fot so it eont be disturbed. Well worth the juggling that I had to do to accomplish that! I highly recommend, so far. Just the first day for me. But so far each thing I have tried has come out better than I expected. It's really interesting watching the change in food as it cooks too. Very fast shipping. Packed very nicely.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71L9-i0u0fL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81H9+82WjLL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ILoveMyKids",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWS3IVS7S2GY5M4VZWZAUA3MXCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X4METVT6UTSR?ASIN=B00005IBXJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2016",
                "reviewTitle": "5.0 out of 5 stars Absolutely Fantastic Product",
                "reviewText": "I initially ordered one of these for a relative who entertains a lot, and thought it would come in handy for them. I then later thought about it, and realized this *might* be handy for me/my family too. So...of course, I had to order one.I really had minimal expectations for this product. I knew it obviously cooked pizzas and possibly other little frozen items. I had no idea that I would literally use it all the time. Every day.I have 2 kids who love pizza and enjoy snacks like mozzarella sticks, fish sticks, and other frozen food items that you might typically throw in an oven when you are crunched for time. These are obvious items that can be used easily on this product, and it certainly delivers. It is incredibly simple to use. You plug it in, throw whatever you want to cook on it, and set the timer. You don't waste time preheating. There is no heat adjustment, but it cooks it perfectly. It rotates while cooking, and my kids get a kick out of watching it cook right in front of them. It cooks pizza (even the cheapie junk ones) into perfection. I have made countless homemade pizzas and it makes them perfect every time. Reheating your pizza on it refreshes it to its former glory. Once the timer is done, it stops heating the product (but simply keeps rotating), so you don't burn your food if you get distracted for a minute or 2.What I was not counting on is all the other items we would end up cooking on it. I enjoy making homemade cookies and cinnamon rolls from scratch with my kids, and (so long as they are not large or rise too tall) we are able to cook those with ease, too. I am a vegetarian (mostly vegan), and I can cook my veggie patties and other veggie products on it, and they don't come out soggy like they do sometimes in a microwave. You can add things to your food while it is cooking, and you can see for yourself whether it is done or not (or burnt). Leftovers from a restaurant reheat perfectly on it, too. No more nuking food with a microwave.The cons to this product: You have to watch to make sure you aren't cooking something too tall or close to the heating element (think dough that rises up too high, etc). When I make cookies, biscuits, cinnamon rolls, or anything doughy on it, I make them small or squash them down a little so they don't rise too high.Another con is that if you have a super large pizza, this won't accommodate it. The circular pan thingy it cooks on will cook a standard large pizza (like standard frozen pizza size), but no larger. That said, the product would probably take up too much space if it were any bigger, which leads me to my next con...yes, it is a little bulky if you do not have space for it.While you can certainly burn yourself on it, as with anything, you have to use a little common sense and keep it out of reach from little hands. That said, it is not as drastic of heat and the risk of harming yourself should you touch it is MUCH less than if you were messing with an oven. I have used this product every day (unless we are out of town) for about 15 months straight, and with minimal care, I can't recall a time that I burned myself, and I rarely have to wear oven mitts since I can just grab a spatula and get it off easily onto a plate straight from the pan. My kids have never burned themselves on it either. I always supervise them if they want to add something on whatever we are cooking (which they love to participate in), and they know to be careful. I always worry with an oven, but with a little caution, I really don't worry much with this item. I can touch my finger quickly on the pan while it is rotating and not hurt myself (as long as I pull my finger off right away). Could I do that with an oven and not hurt myself? Uh, no.Cleaning it is a breeze, too. Overall, we love it so much that our microwave hardly ever gets used and our oven is reserved for larger items, like casseroles and other larger home-cooked items.I would recommend this for anyone and everyone, and not just for the pizza lover. It is not expensive, and I would imagine this would be a great gift for the average college student.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen Bronchetti",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKT7MFF66AFQ3B66JKJR4PA3MFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM3SAEZMJHY6D?ASIN=B00005IBXJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfectly cooked!",
                "reviewText": "The media could not be loaded. In just 13 minutes, this machine cooked a homemade pizza to perfection! So easy to use! So much faster and easier than preheating the oven, etc. Crust cooked all the way through. Toppings melty and bubbly. Cooked homemade pizza topped with lots of heavy toppings and meats just as well as my pizza shown in the video with a few select toppings. Plug it in, turn the dial and watch it transform your pizza while tidying up the kitchen. I bought this appliance for my daughter first. She says it cooks frozen pizzas much better than the oven or microwave. It's so easy to clean. The rotating tray comes off and hand washes in seconds like a dream. I love this appliance. It's a brilliant design. I have full confidence that it can do all the things they say it can and do them well. I wish I had known about this appliance sooner!",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/33731d8d-2f39-4466-8690-7f201616844e/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Christopher CarterChristopher Carter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUJIBZMW4QDSPPWHDFI5DSRCXYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T5B92ON5C06H?ASIN=B00005IBXJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great right out the box",
                "reviewText": "Read through a lot of reviews before purchasing. Was going back-and-forth between this one and some more expensive ones I noticed this one had quite a lot of reviews which were helpful in making my decision. Very easy to use right out of the box, was able to clean it off and prepare my first pizza. First pizza turned out great took less than 20 minutes. Only thing that caught me off guard is that it turns on the minute you plug it in I was looking around for the off switch. Unless it’s on there somewhere and I’m missing it. The first picture was the before and second picture was after it finished. Definitely recommend great value.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61JnJqF7nAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Br5YyJmDL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bobby Rose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIVUU6WDRJYQGEE3TTV5MMUGZLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUFPZF7J0PJUT?ASIN=B00005IBXJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Buy it.",
                "reviewText": "People in my household were always heating the oven to 450 to cook a small pizza, now they can start cooking with no pre-heating and be done in 20 minutes. This machine makes a pefect pizza every time, it heats from the top and bottom, and even has a fan which acts like a convection oven. The convenience, ease of cleanup (basically just wipe the non-stick surface), small size, and extremely effective cooking makes this an amazing unit -- I cannot recommend it enough (not to mention the power being saved by not having to heat up a full sized oven).",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 29, 2023",
                "reviewTitle": "Great kitchen gadget",
                "reviewText": "Makes great pizza, even fresh, very little effort and you get to visually make adjustments. Easy to cleanup.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julio A. Hernandez Barros",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 19, 2020",
                "reviewTitle": "El mejor horno de pizzas a un precio accesible",
                "reviewText": "Una de mis mejores compras. Un aparato que hace una pizza profesional en minutos. Lo hemos probado con masa de pizza hecha en casa y queda perfecta en tan solo 12 minutos. Es un aparato que no puede faltar en la cocina. Las pizzas quedan incluso mejor que en los costosísimos hornos de piedra.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KAR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 27, 2021",
                "reviewTitle": "Buenísimo.",
                "reviewText": "De uso súper fácil y hornea parejo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beth Sands",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 26, 2021",
                "reviewTitle": "I LOVE THIS THING!",
                "reviewText": "Seriously, this is my second one. My first lasted 8 years and finally, the motor gave out. I use this more than my oven, and I cook everything from wings, to chicken fingers, pizza (duh), fries, onion rings. It is one of the best kitchen appliances I have ever bought. No preheating, no issues. My only recommendation is to keep the pan really clean, and when it gets stuff built up (it will eventually) just use parchment paper on it to keep it cleaner.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. D.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 31, 2022",
                "reviewTitle": "Best kitchen gadget ever!",
                "reviewText": "This Pizza maker became my favorite kitchen appliance in one day! I did grilled cheese bagel, garlic bread, frozen French fries, also melted chocolate cookies! All turned out perfect. It's amazing to watch how it rotates your food and everything is getting done how you like it. Especially like the feature of switching heating elements from dual to top or bottom only. Total control of doneness as you watch it. It's not going to leave our counter top!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$80.49",
                "sellerName": "Beyond Box",
                "sellerRating": "4.5"
            }
        ]
    }
}