{
    "remaining_requests": 35225,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cuisinart-TOB-40FR-Classic-Toaster-Broiler/dp/B00M13RBBU",
    "body": {
        "name": "Cuisinart TOB-40FR Custom Classic Toaster Oven Broiler, Silver (Renewed)",
        "price": "$69.99",
        "originalPrice": "$99.95",
        "rawPrice": 69.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cuisinart-TOB-40FR-Classic-Toaster-Broiler/dp/B00M13RBBU",
        "soldBy": {
            "sellerID": "A3LJ2FXZPL0RZH",
            "name": "Verdi!",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3LJ2FXZPL0RZH&asin=B00M13RBBU&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41MAIoKFCvL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Verdi!",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 288,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 20 - 22."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1800 Watts to toast, bagel, bake and broil; full size interior holds 11-inch pizza and 6 slices of toast",
            "Stainless steel front with rubberized easy grip dials, cool touch handle, and a front removable tray; easy clean nonstick interior, unit measures: 17\" x 11.74\" x 8.35\"",
            "Always even shade control monitors the temperature and adjusts timing to consistently toast to the shade selected every time",
            "Convenient auto side-out rack for hands free loading and easy removal of cooked foods and automatic shutoff safety feature",
            "This Certified Refurbished product is tested & certified by Cuisinart to look and work like-new. The product includes all original accessories, and is backed by a 90 day warranty"
        ],
        "description": "Cuisinart's TOB-40 toaster oven broiler is large enough and smart enough to present a full range of menu options. Toast four bagel halves, bake an 11-inch pizza, or broil two big open-faced sandwiches. Always Even Shade Control monitors the temperature and adjusts the timing to consistently toast to the shade selected every time. A convenient auto slide-out rack provides hands-free loading and easy removal of cooked foods. When the cooking is done, its easy to clean with its reflective nonstick coating on the oven's interior that wipes clean in seconds, which enhances heat efficiency and ensures even toasting.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Toaster Ovens",
                "link": "https://www.amazon.com/Toaster-Ovens-Toasters-Small-Appliances/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289937"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Cuisinart"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Product Dimensions",
                "value": "8.35\"D x 17\"W x 11.74\"H"
            },
            {
                "name": "Special Feature",
                "value": "Convection, Multi-function"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "1"
            },
            {
                "name": "Model Name",
                "value": "Toaster Oven"
            },
            {
                "name": "Item Weight",
                "value": "15.61 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Cuisinart"
            },
            {
                "name": "ASIN",
                "value": "B00M13RBBU"
            },
            {
                "name": "Item model number",
                "value": "TOB-40FR"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 288 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#177,548 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #130 in Toaster Ovens #404 in Renewed Home & Kitchen"
            },
            {
                "name": "Date First Available",
                "value": "July 22, 2014"
            },
            {
                "name": "Wattage 1800.00",
                "value": "Material Stainless Steel"
            },
            {
                "name": "Item Weight 15.61 Pounds",
                "value": "Finish Type Stainless Steel"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "GMO",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW3FXLAFMR6GXYZR2TVYEHMPSTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V43C5NT99QRD?ASIN=B00M13RBBU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2015",
                "reviewTitle": "5.0 out of 5 stars Great toaster oven and the refurbished one looks and functions like it is brand new!",
                "reviewText": "Refurbished is the way to go! This is a smaller version of the Cuisinart toaster oven I've seen at many of my friends' homes. And I like the smaller size very much - it fits much more inconspicuously on the counter, doesn't take up very much space but still has plenty of room inside the toaster. It is very easy to use. We typically use it for toasting bagels or bread in the mornings, and so it's nice that all I have to do each morning is hit the start button. You don't have to change or turn any other dials if you are using it for the same function. We also use it to heat a lot of things for the kids' dinners (so we don't have to wait for the big oven to heat), toasting sandwiches, baking just a few cookies at a time, etc. And the refurbished looks brand new and works great. Came packaged well too. Makes me want to buy all refurbished appliances at these better prices.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERTUPFV7F7C3SBQWNK5EGR6HXPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LRA1XU2N1CHO?ASIN=B00M13RBBU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2022",
                "reviewTitle": "5.0 out of 5 stars Better than expected",
                "reviewText": "Had a toaster oven for the house and rarely used it even though it had more features like air fry. Bought this for my RV after toaster died and friend said to try a toaster oven instead. I was hesitant but so glad we got this. Toast comes out better than in the toaster and we find we use it to cook a lot of meals or sides so it’s more practical than a toaster. I did a lot of research and decided on this one and believe it’s a solid pick. I’m a quality engineer and can pick apart any product pretty easily but I’m impressed with this. Yeah it’s tinny with thin sheet metal but so far (3 months), so good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antt Mann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIM4EPRNLFCP7IY7V6YF3YV2R7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRWL65YGNE06U?ASIN=B00M13RBBU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2021",
                "reviewTitle": "5.0 out of 5 stars Great little Toaster Oven",
                "reviewText": "Would be nice if they painted the dial indicators white because they are hard to see but you can do it yourself. Other then that it performs well, the alarm bell to tell you when timer finishes is good and loud so you don't miss it. If you hate microwaves as much as I do this little fella will be your best buddy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETJE2C3FK5DLKNQF5DQ2BSRX6DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R284UYDMKX9ZKY?ASIN=B00M13RBBU",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2015",
                "reviewTitle": "1.0 out of 5 stars Good toast, but not worth the other design issues.",
                "reviewText": "I'm not normally one to write bad product reviews. Most things I buy generally work about as well as I expect them to, and sometimes much better. This Cuisinart is unfortunately not one of them. I bought the refurbished version of this toaster about a month ago, and some of my complaints could be because I still got a bum unit. Not 100% sure if it is working as designed or not, more on that in a bit. First the complaints.* It takes 5 minutes (not an exaggeration, I timed it) to toast an English muffin. My previous cheap Black and Decker took about 60 - 90 seconds tops to do the same thing.* The heating element on the bottom doesn't seem to get warm until the very end of the cycle. The ones on top start glowing pretty quickly, but the ones on the bottom stay black until about 4 minutes into toasting, when they turn kind of pale orange. This is what leads me to wonder if my unit is maybe bad? Maybe this is the reason for the long toasting time also?Edit: Just read another review that mentioned that the tray came installed upside down. The tray design doesn't make it obvious, and in fact by looking at it I wasn't even sure at first that it would fit in the other way, but turning it over made the two related issues go away. Leaving them in the review in case other people have the same problem and adding another star to my review.* I'll give the benefit of the doubt for the ones above and say that's just a broken unit...but there are also bad design choices throughout. The biggest is that you can't open up the door all the way without removing the crumb tray. So I either have to remove the crumb tray from the hot toaster and then take the toast out (which seems to be the time that I want the tray in there the most) or try to fish out hot toast from a half open door. This is what I end up doing most the time, and of course half the time I end up dropping it and it slides down onto the elements.* A related gripe, opening the door even part way also pulls out the crumb tray a little bit. Which seems to be by design as well. So you have to push it back in every time you open the door.* The alarm is also unnecessarily loud and goes off like a microwave. I'd prefer just a short buzz since I'm often making toast in the morning before my wife is up and we have a studio apartment so no walls separating the kitchen from the bed.* I do want to say one positive, even though it may be partially broken, the thing does make excellent toast. Muffins get a nice and even golden color all over them that I've never really seen before. That's nice and all, but I'm not really all that particular about my toast \"shade\" and to me it certainly isn't worth taking 5 minutes and the aggravation of not being able to open the door all the way just to get perfect toast. I'm sure there are other models out there that will do the same thing, my 15 year old B&D that I had before this made perfectly adequate toast that I was happy with, but it certainly wasn't as evenly done as this Cuisinart. So it gets a star added for that.Update Jan 2016: I was sent a replacement unit and now both elements heat up at the same time. But it doesn't seem to change cooking time at all, still 5 minutes to toast even at slightly below the middle shade setting. It also is no longer getting as dark at that setting as it used to. That by itself wouldn't be too big of a deal, since it was generally a bit darker than I like anyway. But the lack of consistency makes it hard to come to a good setting selection, and I worry about longer term reliability.And one other small thing that I hadn't noticed before because I couldn't open the door all the way, but the toast rack has a bit of a lip on it. Just big enough to make it hard to slide things off of it and directly onto your plate using something like a knife to grab it. So I either have to pick it up with my fingers, or very carefully manipulate it up and over the lip and onto my plate, and with the latter I invariably end up flipping things so that whatever toppings I had on my toast or potato or whatever end up falling off and onto the heating elements. I'm clumsy I admit, but little things like this make me silently curse my toaster every time I use it.Update as of April 2017:I hate this toaster. It's stopped being even remotely consistent with the toast shade, which was basically the only thing it had going for it originally. Additionally, the door started getting jammed when open only part way. I think this is somewhat by design so that you can prop the door open a crack while broiling, but over the last few weeks it got harder and harder to get past that point, and whatever the hinge was hanging up on is internal to the toaster and could not be easily seen. So today, while trying to get my sandwich out of the toaster the door was so stuck that I ended up ripping the handle off the door trying to get it open. And I was actually happy to have done so, because now I can hopefully find a toaster oven that doesn't drive me crazy every time I use it.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "History BuffHistory Buff",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEE5CWQ5AFCFJCHU57CQTEDAVAFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TB9SYQLI4O91?ASIN=B00M13RBBU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Best I have had",
                "reviewText": "I seem to go through toaster ovens often. This is one of the best. Fits nicely and unobtrusively on counter; but not too close to the cabinet above. Hot enough to cook a baked potato. The pull out bottom makes it easy to clean. The toaster bell is a little annoying.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/31BmFRWuOvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF24LL2QXTRRSOKAL67UD4MHESCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RGNP5QZK1K6C?ASIN=B00M13RBBU",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2015",
                "reviewTitle": "3.0 out of 5 stars I like it, but....",
                "reviewText": "I have owned several Black and Decker toaster ovens and finally decided to try something different. The Cuisinart has some good and bad features. I really like the pullout crumb tray on the bottom (that is what sold me). I also bought it because of the door opening feature that should pull the rack out when you open the door so you don't have to reach in for the food. However, this feature only works with the rack inserted on the upper slot. And with the rack in this slot, it leaves very little room for bulky food. Also, with the rack in this position, I discovered a poor design flaw. The ridge or lip on the rack should curve down, not up, so when I pull out the tray, it catches the lip and I pull the rack and the tray out. Kind of annoying. Also, the knobs are all black and impossible to read. I dotted the indicator ridge with nail polish so I could read where to set the temperature etc... One thing I am having difficulty with is adjusting to is the size. It extends out much farther than any oven I have owned. I miss the extra space I used to have on my small counter.Despite the above mentioned items, I think the oven looks very nice, feels well built, and the metal baking tray is quite sturdy. I don't love, love this oven and I'm sure with time I will get used to it's little issues. I just kind of wish I had purchased something else, but it will do for now.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$69.99",
                "sellerName": "Verdi!",
                "sellerRating": "4.5"
            },
            {
                "price": "$89.35",
                "sellerName": "eTechtronics (Your Trusted Online Retailer)",
                "sellerRating": "4"
            }
        ]
    }
}