{
    "remaining_requests": 35283,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Oster-Convection-Capacity-Polished-Stainless/dp/B003Z34OME",
    "body": {
        "name": "Oster Toaster Oven | Digital Convection Oven, Large 6-Slice Capacity, Black/Polished Stainless",
        "price": "$158.20",
        "originalPrice": "",
        "rawPrice": 158.2,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Oster-Convection-Capacity-Polished-Stainless/dp/B003Z34OME",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41X0Zi6B8UL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51WbHFB-8ML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VrB8M99VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/516S9C1fYUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519nBz ZyNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51n5iyLTFZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71di1jI4urL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Oster Store",
            "link": "https://www.amazon.com/stores/Oster/page/7890459C-2B36-477F-A854-6677DDABE451?ref_=ast_bln"
        },
        "brand": "Oster",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 11453,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 8 hrs 10 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "6 slice convection toaster oven for faster, more even cooking. This Oster Large Digital Countertop Oven can fit up a pan with the measure of 2 inches height, 10.5 inches width and 12.5 inches length",
            "Convection technology and a wide temperature range of 150 to 450 degrees F let you cook with the convenience of an oven",
            "Digital controls with 7 cooking settings and an interior light for easy viewing",
            "Large interior can accommodate one 12 inch pizza, casseroles, cookies, and even a roast; with 24 inch cord",
            "Includes Durable baking pan and removable crumb tray for easy cleanup. Watts: 1300w"
        ],
        "description": "Precaution: Do not touch hot surfaces. Always use oven mitts when handling hot materials and allow metal parts to cool before cleaning. Allow the unit to cool thoroughly before putting in or taking off parts. Always use the oven handles when moving the unit. Perfect for large families, this countertop oven from Oster comes equipped with convection technology, which means it distributes heat quickly and evenly for thorough cooking and excellent results. The oven provides a large interior that can accommodate a frozen pizza, a whole chicken, a casserole, or even a pan of crescent rolls or chocolate-chip cookies. Two rack positions allow for customizing the space, especially helpful when cooking a tall roast. Furthermore, the sleek, modern-looking unit features a stainless finish frame and a user-friendly manual/digital control panel for convenient operation. Choose from a variety of cooking functions, including Bake, Convection Bake, Broil, Toast, Pizza, Defrost and Warm. Adjust time and temperature using one touch controls. Other highlights include a see-through door that allows for checking on food at a glance, an optional interior light, an easy-to-clean interior, and an external removable crumb tray. A durable baking pan comes included. Black housing with chrome accents.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Toaster Ovens",
                "link": "https://www.amazon.com/Toaster-Ovens-Toasters-Small-Appliances/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289937"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Oster"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "14.6\"D x 18.1\"W x 22.5\"H"
            },
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Tssttvmndg, Warranty, Oster Large Capacity Countertop 6-Slice Digital Convection Toaster Oven, Manual, Baking Pan, Black/Polished Stainless"
            },
            {
                "name": "Model Name",
                "value": "TSSTTVMNDG"
            },
            {
                "name": "Finish Type",
                "value": "Polished"
            },
            {
                "name": "Door Material Type",
                "value": "Tempered Glass"
            },
            {
                "name": "Cable Length",
                "value": "2 Feet"
            },
            {
                "name": "Temperature Range",
                "value": "150 - 450 Degrees Fahrenheit"
            },
            {
                "name": "Item Weight",
                "value": "20.3 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "OSTER"
            },
            {
                "name": "ASIN",
                "value": "B003Z34OME"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "TSSTTVMNDG-SHP-2"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 11,453 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#19,653 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #36 in Toaster Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "May 7, 2010"
            },
            {
                "name": "Capacity 5919 Cubic Inches",
                "value": "Wattage 1300 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 20.3 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Oster Large Convection Toaster Oven, Digital 6 Slice, Black/Polished Stainless Steel This large-capacity countertop oven features convection baking that circulates hot air for flakier crusts, crispier edges, and even browning in less time; plus, it lets you broil, roast, toast, and more. A digital control panel offers precise heat and time adjustments, 7 preset functions for guess-free cooking, and choice of toast shade from light to dark.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ccf691c5-52b2-40e8-960f-da6b352668f8._CR0,0,570,570_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Large Interior Capacity This countertop oven has a large interior that will give you true second-oven convenience. It can accomodate a variety of foods from thin pizzas to thick roasts with its two rack positions. Easy Broiling Broil at any temperature for proper browning and melting, whether your London broil calls for a 500-degree oven or you want to melt parmesan on bruschetta at a lower temperature. One-Touch Operation The user-friendly digital control panel makes for easy operation. Choose from Convection Bake, Broil, Toast, Pizza, Warm, and more. Time and temperature adjust with one-touch controls. More Convenient Features The interior features a light so you can monitor cooking progress, and the 90-minute timer automatically shuts off the oven so you can cook worry-free.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7a1993db-aacb-4318-ad79-47c6aa7b3c12._CR0,0,440,440_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f8fd0981-2200-4d2d-aa99-d1ceeb4c466a._CR0,0,440,440_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/094e567b-4c38-42e1-b48c-ebcbf7c21983._CR0,0,440,440_PT0_SX220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/6d08d36c-4400-40a7-9056-73aa4f3c7a86._CR0,0,440,440_PT0_SX220__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/fd63fbaa-08ea-4632-a31c-ffb2545f464a._CR0,0,1940,600_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ccf691c5-52b2-40e8-960f-da6b352668f8._CR0,0,570,570_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7a1993db-aacb-4318-ad79-47c6aa7b3c12._CR0,0,440,440_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f8fd0981-2200-4d2d-aa99-d1ceeb4c466a._CR0,0,440,440_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/094e567b-4c38-42e1-b48c-ebcbf7c21983._CR0,0,440,440_PT0_SX220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6d08d36c-4400-40a7-9056-73aa4f3c7a86._CR0,0,440,440_PT0_SX220__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Irate Retro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHP2PPUO4CGZ7D43RXFMGSIM6NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VVZQXYQFA6A?ASIN=B003Z34OME",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 12, 2013",
                "reviewTitle": "5.0 out of 5 stars So good I ditched my regular oven",
                "reviewText": "This little gem works perfectly for all my needs. In fact, now I don't even have a \"real\" oven in my house at all. This saves me buku bucks on electricity not to mention all the extra space I now have in my kitchen.It's large enough to handle any frozen pizza I've ever found in stores. The baking pan that comes with it is handy. I picked up a second wire rack so I could bake two (thin) items at once. The convection fan is very quiet, not that I use it much -- I haven't quite gotten the knack of it. The crumb tray is extremely easy to remove, so easy that one of these years I may actually take it out and clean it. On other ovens I've owned that process is such a pain that I normally wait to clean it until it smokes or catches fire.One of the best features on this thing is the forced use of the timer. Some folks may not like this. But let's face it, we've all set the kitchen on fire once or twice by leaving the toaster oven on. Storing your lantern fuel next to it doesn't help matters; ask me how I know this. Now you can set it and forget it, knowing that your adult beverages will remain safe in the refrigerator.There is a clock on the thing that you can set if you care. When the power goes out it doesn't annoyingly blink 12:00, it just starts at 12:00 and runs as usual. This may be a welcome feature for folks out in the boonies. Or if you live in a 3rd world country with unreliable grid power. Or if you have neighbors that like to come over with bolt cutters and cut down your power lines. You get the idea. I like being able to come home and see exactly what time the power came back on, and I especially like not having the thing blinking when not set.Now the gripes, but nothing important enough to knock off a star:- There are only up-down arrows to set the cooking time. It starts out at 30:00 and you have to keep pressing over and over to get to the time you want. This makes setting certain times very cumbersome, but this is acceptable to me because a full keypad would probably clutter up the device. If you're blind you probably don't want this model because there is no feedback for when the buttons are pressed. Ditto if you are missing all of your fingers or something. Be careful with that chainsaw because the buttons are too hard to press with your nose. Ask me how I know this too.- The light remains on the entire time the oven's on by default. This is a waste or power and bulb life. It only takes one press to turn it off but I often forget. It would be better if there was a way to change the default setting. Maybe I should read the manual before complaining though. :)- You cannot change from convection bake to regular bake, etc without starting all over. Same with toast darkness setting. Many things cannot be changed once started which I find rather annoying.- The top of the thing gets rather hot. So much heat on the outside means wasted power, but I suppose it's unavoidable. You definitely don't want to set your beer down there, or store your bread on top of the oven.- Toasting takes way too long. Silly me for trying toast in a toaster oven. Buy a separate cheap toaster or give up toast. It probably causes cancer anyway.All in all, I am extremely pleased with this oven. You will be too. Buy it. If I had a 2nd kitchen I'd buy a second one. When this one starts on fire or accidentally gets on the wrong end of the shotgun I'll buy this exact same model to replace it.** Update ***8 years later it's still going strong! I got lazy about 1 year in and stopped manually turning off the light when cooking, but the bulb remains working and I've never changed it. I'm still using this as my ONLY oven in the house. I could not be more pleased! I've not once in these 8 years had anything that wouldn't fit in this oven.. Sure you can't bake a large turkey but if you condone killing animals you're going straight to hell anyway.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOELLE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBAGI2DF7XGSNCLR6BAKQSEE33A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z11D8TEX8TY9?ASIN=B003Z34OME",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 25, 2014",
                "reviewTitle": "5.0 out of 5 stars Could not ask for a better product!",
                "reviewText": "I received my oven and must say I am very impressed from every thing to the way it was packaged to the way it bakes. I am not a \"tecky\" person, but I didn't need any instructions to set the clock or fiqure out how to use the settings, so simple. The interior light is a wonderful feature, but the glass door is large enough to give a good view of the item inside. I have used toaster ovens for about 45 years, and have never really cared for making toast in a toaster oven, for toast, I use a toaster. This is my second convection toaster oven and I wouldnt be with out one, I bake biscuits several times a week and they turn out nicer than in my big oven, baking pies, muffins etc. are wonderful. The convection baking takes about 1/3 less time than a conventional oven and requires about 25 degrees less in temp setting UPDATE:I have had my oven for almost 2 years now and like it as well as the day I first received it. I used it daily mainly for baking and warming, I would still rate it 5 stars--perfect. It is so easy to clean, mine still looks like new. We have had various Oster products in our home for several and have never been disappointed. I have had my oven for over a year now and use it several time a week for baking alone and it still bakes like a dream, so easy to take care of and clean, it still looks like new. We have several Oster products in our kitchen, bread machine, foodsaver just to name a couple, their quality has been excellent as well. One thing that impresses me is anytime I have a question, I can call Oster and speak with a rep that is always helpful, not all companies can say that now days. I find all of the settings work perfectly, I cannot think of any thing that isnt positive about my new oven, looks great and works perfectly--this one far surpasses my previous convection------thank you Oster. 3/1/13 I wanted to checked the oven for heat accuracy and found that it runs 25 degrees higher than the temp setting.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Douglas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 3, 2023",
                "reviewTitle": "Racking design does not include 3 levels .",
                "reviewText": "Like exterior design ;like size; like low wattage in the available electrical power. Dislike the interior racking design. This toaster oven is unable to make full use of it's interior size because of only only 2 rack setting. So disappointing Oyster did not notice this major flaw. Many pots and oven dishes with lids that could normally fit with this interior size can not. This is a winner as the best true toaster oven but unfortunately fails due to the limits put on it's interior design. Cheers...",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ruben Huitron",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 19, 2022",
                "reviewTitle": "Es lo que esperaba",
                "reviewText": "Practico y funcional",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Estela Murillo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 2, 2020",
                "reviewTitle": "Elegante, práctico, fácil de manejar!",
                "reviewText": "El mejor horno digital!!! Es el segundo que compró de la marca y modelo y ambos son excelentes! Buen tamaño interno, hornea y el tostado es rápido y quedan crujientes los panes. Fácil manejo y los alimentos se preparan en poco tiempo. Sin duda la mejor compra en lo que a hornos se refiere.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joane F.Joane F.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 28, 2022",
                "reviewTitle": "four à convection, grille-pain numérique Oster.",
                "reviewText": "Si vous l'achetez pour le grille pain, vous allez être déçu mais pour la fonction: four, vous serez satisfaits.Moi je suis satisfaite car je l'utilise seulement comme un four et pas comme un grille pain, c'était le but de mon achat.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61+e-TYXP5L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 27, 2021",
                "reviewTitle": "Easy to use and Effecient",
                "reviewText": "I purchased an old model of this Toaster Oven and I actually like this one better. The issue I have is when If I put bread to toast and put it on a small tray (so no crumbs fall), only the top part of the bread will toast. I was also under the assumption this toaster has a timer set for 90 minutes. It only has 30 minutes then it shuts off. Would I return it for these problems, No because I was happy with my old toaster oven cooking for 30 min. If that does not work for you, I suggest not buying this Toaster Oven. I have no problem re starting to add minutes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}