{
    "remaining_requests": 35316,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Oster-Digital-French-Door-Oven/dp/B08MXSZHB5",
    "body": {
        "name": "Oster Air Fryer Oven, 10-in-1 Countertop Toaster Oven, XL Fits 2 16\" Pizzas, Stainless Steel French Doors",
        "price": "$314.88",
        "originalPrice": "",
        "rawPrice": 314.88,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Oster-Digital-French-Door-Oven/dp/B08MXSZHB5",
        "soldBy": {
            "sellerID": "AETG4JCOOX8ZT",
            "name": "Energia SP",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AETG4JCOOX8ZT&asin=B08MXSZHB5&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41wa2tIY3kL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51YcxpLbfjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Fkb9npnRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vufQYARlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zV3frF77L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512sSghQNIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/6141neeAf L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Oster Store",
            "link": "https://www.amazon.com/stores/Oster/page/7890459C-2B36-477F-A854-6677DDABE451?ref_=ast_bln"
        },
        "brand": "Oster",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1993,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 20 - 22.",
            "FREE delivery Monday, February 19. Order within 7 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "FRENCH DOORS: Elegant French doors open with a single pull, making inserting and removing meals easy and convenient",
            "EXTRA-LARGE CAPACITY: Fits up to a 15\" x 12\" baking pan, a full family size chicken, or 2 large pizzas; plus, its 3 rack positions make it easy to accommodate a variety of meal sizes",
            "10 COOKING FUNCTIONS: Includes 10 cooking presets to easily cook a variety of foods, including Bake, Air Fry, Toast, Slow Cook, Dehydrate, Broil, Roast, Warm, Pizza, and Turbo Convection",
            "FASTER PREHEAT: Designed with 35 percent Faster Preheat to reduce overall cooking time, and uses up to 50 percent less energy than conventional ovens Compared to model TSSTTVFDDG",
            "DIGITAL CONTROLS: Digital controls provide precise cooking time and temperature to take the guesswork out of cooking"
        ],
        "description": "The Oster Extra-Large Digital French Door Countertop Oven with Faster Preheat* reduces overall cooking time while using up to 50 percent less energy than conventional ovens. This Oster countertop oven features interior lighting, 3 rack positions, and 10 preset cooking functions, including Air Fry, Slow Cook, and Dehydrate, to make cooking full meals for the entire family fast and easy! This extra-large toaster oven easily fits up to a 15\" x 12\" baking pan, a full family size chicken, or 2 extra-large pizzas. This Oster oven is designed to make it easy and convenient to cook an entire meal at once! Add a delicious crisp to foods with the Air Fry function, slow cook your favorite recipes, dehydrate delicious healthy snacks, or choose from any of the other 7 cooking functions: Bake, Toast, Broil, Roast, Warm, Turbo Convection, and Pizza. This French door oven features a convenient design that opens both doors with a single pull, making inserting and removing meals an effortless experience. *Compared to model TSSTTVFDDG.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Convection Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289934"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Oster"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Product Dimensions",
                "value": "20.71\"D x 24.61\"W x 17.01\"H"
            },
            {
                "name": "Special Feature",
                "value": "Digital, Programmable"
            },
            {
                "name": "Control Type",
                "value": "Touch Control"
            },
            {
                "name": "Door Style",
                "value": "French Door"
            },
            {
                "name": "Included Components",
                "value": "Oven"
            },
            {
                "name": "Model Name",
                "value": "French Door Convection Countertop & Toaster Oven"
            },
            {
                "name": "Finish Type",
                "value": "Stainless Steel"
            },
            {
                "name": "Cable Length",
                "value": "27 Inches"
            },
            {
                "name": "Item Weight",
                "value": "26.6 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Oster"
            },
            {
                "name": "ASIN",
                "value": "B08MXSZHB5"
            },
            {
                "name": "Item model number",
                "value": "2142008"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,993 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#27,445 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #20 in Convection Ovens"
            },
            {
                "name": "Date First Available",
                "value": "April 2, 2021"
            },
            {
                "name": "Capacity 42 Liters",
                "value": "Wattage 1700 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 12.1 Kilograms"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Key Features Elegant French doors Extra-large capacity 3 rack positions 1O cooking functions Up to 12-hour timer Interior light Includes air fry rack, broil rack, baking pan, and crumb tray Slow cooker function Convenience Meets Versatility This Extra-Large Digital French Door Air Fry Countertop Oven features up to 40% faster preheat to reduce overall cooking time, and uses up to 50% less energy than conventional ovens. Its elegant French doors open with a single pull, making it easy to take food in and out. Plus, its extra-large interior features 3 rack positions perfect for multilevel cooking, so making full meals for the entire family is fast and easy! Add a delicious crisp to a variety of foods with the air fry function, slow cook your favorite recipes, dehydrate healthy snacks, or choose from any of the other 7 cooking functions to create meals everyone will love. *vs. electrical range oven with hidden bake elements.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/46844cad-7d2b-4e57-9132-53754247a563.__CR0,0,500,500_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Ease and Versatility French Door Design Both doors open effortlessly with a single pull, making inserting and removing meals effortless. Extra-Large Capacity Fits a 15\" x 12\" baking pan, a family size chicken, or two 15 in. pizzas-and its 3 rack positions accomodate a variety of foods for multilevel cooking 10 Cooking Functions 10 convenient cooking presets Bake, Air Fry, Toast, Slow Cook, Dehydrate, Broil, Roast, Warm, Pizza, and Turbo Convection. Interior Light A convenient interior light lets you check on the progress of your food as it cooks, without opening the doors.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/65b03ca0-2444-49c7-bd28-1e59ccf7b385.__CR0,0,500,500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/896837ef-83c6-418f-8b88-acbfd44926c1.__CR0,0,500,500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/45d80c77-c606-4404-aac1-9109aeebcb14.__CR0,0,500,500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f193f82e-2156-47f2-85bb-bf98304b2cf2.__CR0,0,500,500_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Cooking Full Meals Is Fast and Easy Faster Preheat To reduce overall cooking time, this oven is designed with up to 40% faster preheat* and uses up to 50% less energy than an electrical range oven with hidden bake element. *vs. electrical range oven with hidden bake elements. Digital Controls Digital controls and auto-shutoff timer provide precise cooking time and temperature to take the guesswork out of cooking. Versatile Accessories Includes an air fry rack, integrated wire rack, durable baking pan, and removable crumb tray, so you're ready for any type of cooking project",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/20e8b9ab-aa79-4dc3-bbc4-0190924bdc4f.__CR0,0,500,500_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/59b52567-f142-4b81-9f0c-59d6f7e113a2.__CR0,0,500,500_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a295e406-0f3d-46e3-82cf-5353e0c654be.__CR0,0,500,500_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/76523c4f-f5e3-45f6-afe2-fb40939cfbf0.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/46844cad-7d2b-4e57-9132-53754247a563.__CR0,0,500,500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/65b03ca0-2444-49c7-bd28-1e59ccf7b385.__CR0,0,500,500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/896837ef-83c6-418f-8b88-acbfd44926c1.__CR0,0,500,500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/45d80c77-c606-4404-aac1-9109aeebcb14.__CR0,0,500,500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f193f82e-2156-47f2-85bb-bf98304b2cf2.__CR0,0,500,500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/20e8b9ab-aa79-4dc3-bbc4-0190924bdc4f.__CR0,0,500,500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/59b52567-f142-4b81-9f0c-59d6f7e113a2.__CR0,0,500,500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a295e406-0f3d-46e3-82cf-5353e0c654be.__CR0,0,500,500_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "C. FisherC. Fisher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH32PAAH7NPCRIBSSMEK42XDZSZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T1FQAI06CAB5?ASIN=B08MXSZHB5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Impressive Performance with Spacious Design",
                "reviewText": "I recently acquired this toaster oven, and I must say, it performs exceptionally well. It offers a variety of functions, including baking, toasting, warming, pizza, broil and much more, all of which work like a charm. The timer is a convenient feature that adds to its functionality.However, it's worth noting that this toaster oven is on the larger side, so be prepared to allocate some extra counter space. On the plus side, it comes with an array of trays that are quite handy for various cooking needs. Additionally, the French doors not only add a touch of elegance but also make accessing your food a breeze.In summary, if you have the counter space to spare, this toaster oven is a fantastic addition to your kitchen. Its impressive performance and versatile trays, coupled with the stylish French doors, make it a worthwhile investment.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71f2VpRE9RL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sue Hennig",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4HGL2D4DW3KYY3G5ICAS4LRQPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD42YHIMYTOTB?ASIN=B08MXSZHB5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Great table top multi function oven",
                "reviewText": "This is an up grade for an Oster oven exactly like this one. The difference is this one has air fryer and slow cooker capabilities. I have not used those features yet. Temperature is accurate (I checked with an oven thermometer). I use a baking stone when baking frozen pizzas. As others have noted, the digital temperature control is very difficult. It takes many attempts to change temperature while baking something. That is my only complaint. Oven is large (same size as my previous one), but not very heavy. Overall, I’m pleased with it.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kate | More Sunsets PleaseKate | More Sunsets Please",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZCGKWDSJ4Q5PU2Y2WJVNUOZM7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5NZPJEH7HA7S?ASIN=B08MXSZHB5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Best Counter Oven On The Market - One Downside",
                "reviewText": "The media could not be loaded. I have been searching and researching for a while to find the best counter top oven to replace my RV oven (that barely holds a loaf pan) to be able to cook in. This one takes the cake! No, literally!ACTUAL BAKING AREA:15.25in W x 6.5in H (depth is rounded at the back)This takes into account the heating elements at the top and the bump ins on the sides for the racks.Pros:SIZE!!! The size of this thing can’t be beat! I fit my glass 9x13 glass pan in with a hair to spare (will not fit the glass pan with the very wide rounded handles). The height inside beautifully gives space for my breads to rise and I could even fit my 5.5qt lodge Dutch oven (I just inverted the knob handle to the inside - would have fit if the heating elements weren’t lower than the opening).I can fit my cookie sheet (note this is the middle size Walmart cookie sheet, not your standard 1/2 sheet (16in wide), this is slightly smaller but bigger than a 1/4 sheet.BAKING OPTIONS: there are so many options to cook in this thing, I use the dehydrate as my proofing for bread as keep warm is just a hair too hot. The air fryer works beautifully allowing the air to get all around. The temperature is pretty spot on, if you use convection, maybe drop the temp a bit when cooking to compensate.FRENCH DOORS: having a small space to work with, I truly appreciate the French doors vs a drop down door.STRENGTH OF RACK: this sucker is STURDY! It easily holds the giant lodge Dutch oven. Not a sway, bend or bounce.Did I mention the size!!?? (That’s like at least worth 5 more pro check marks ☺️)Cons: there’s gotta be something because nothing on the market is perfect.NO KEEP-ON OPTION: everything has to have a time and then it shuts off when the time is done. Our teeny cuisinart has a keep on feature, not sure why this one doesn’t as it actually is more like an oven.TOP IS REALLY HOT: I use my silicone mat for the top of the oven to constantly remind myself it gets hotter than anything and to not place anything on top when it’s on. The sides aren’t too bad and grateful the area around the buttons stay cool too.BUTTONS DON’T BEEP: ok, maybe this one is preference, but I find it odd tapping buttons that make zero sounds…..? But maybe that’s just me.WISH IT CAME WITH TWO RACKS: we have been using the air fryer rack as a second rack and it does the trick, but would prefer two racks to just come with it or have an option to buy after.REALLY SHORT CORD: like I mean REALLY short! I understand how power works and why the cord is short but dang, it’s short! And using in an RV, really limited the spot to put it.EMITS A LOT OF HEAT: ok, not really a con, because it’s an oven, they all emit heat from them. But just fair warning to any small space user, it will heat up your space.FINAL THOUGHTS: I’ve made white bread loaves, sourdough, Dutch oven baked, cookies, casseroles, cinnamon rolls, Dutch baby’s, more cookies, reheated meals, fried, proofed, and more in just the few short weeks we’ve had this and I can’t imagine going on without it.As a Full Time RV’er, I wanted to have the ability to cook and bake like I did in our sticks & bricks, and this gave me that option.So happy with this product!",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71JxpwpmyyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71QQj5RAIfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71QyNeJ9vdL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71nMHuKCm8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71rwtQWxVHL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec51b501-3e67-45b5-80a2-ff0b6e8e8bed/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "S & C Boyd",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDJXUKCO34U2V43NNH5MONU4CFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I64C1PEWTM0O?ASIN=B08MXSZHB5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Replaced a 10+ year old one that we now use in RV!",
                "reviewText": "These ovens are awesome! This replaces an older one that we now use in our RV. It will blow your mind how well this works! I use the convection a lot & this cooks so fast you'll probably over cook some things at first, lol! This has 3 rack slots, old 1 had 2. The new top slot allows you to broil & brown! In the ones with 2 shelf slots you have to put something under your pan to lift the food close enough to the element. I highly recommend Oster, from long time experience. The complaints about the door...Just be careful to open fully! And you should be using oven mitts anyway! Someone said the racks won't stay. I experienced this 1x. I used a pan a smidge wider than the oven. Guess what...it pushed the walls out just enough. Standard 9\"x13\" pans fit but they can't have \"handles\" that round out on the ends. To measure for pans, use the pan that it comes with. Do not use the rack itself! Like most things-use a bit of gray matter aka your brain, lol, before you complain something is faulty! Thanks Oster!!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 24, 2023",
                "reviewTitle": "Love it so far",
                "reviewText": "Haven't used it too much yet but so far so good. This model has improved features over our last Oster we had although we really liked it and it lasted 5 years. This newer model can air fry and what I really like is you set the temperature and when it reaches it the inside light comes on and it beeps. The older model did not do this had to use an oven thermometer. The only thing I haven't' figured out how to bypass the timer - when it's on bake or convections I'd rather just watch the time myself. Size it great - we can put in a roast pan or 9x13 tray - love it. Fingers crossed lasts as long a the last one.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pebel C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 9, 2021",
                "reviewTitle": "Cualidades.",
                "reviewText": "Es el mejor horno que hemos tenido, después de nuestro antiquísimo y heredado de una tía de los EUA, y que fue utilizado desde 1960 aproximadamente, de nombre Roto- Broiler, nunca podrán igualar es calidad de manufactura y con un enorme recetario, muy robusto y grande, nunca tronaba la lámina cuando se calentaba.Acerca del Oster que adquirimos, esta muy bonito, bien diseñado, y práctico.Se puede limpiar bien, es rápido como debe de ser, me gustaría que puedan vendernos una parrilla extra de freidora y otra de asar.Ya horneamos, pastel, cup cakes, pies, pizzas, todo casi bien, ya iremos calculando mejor algunos tiempos, ya que en donde vivimos, cerca de la CDMX estamos a 2,600 metros sobre el nivel del mar.Me gusta que el programa de cada operación, ya sea asar, hornear, pizza, etc. ya viene con el tiempo y la temperatura programadas, y de ahí podemos subir o bajar según queramos, pero en general esos límites están correctos y hay que seguirlos de primera vez y probar, tal vez por eso el manual no es muy explícito y no trae recetario, aunque por ese precio bien podían entregar uno, sobre todo si sabemos que Oster es una buena marca y es una división de Sunbeam.Yo tengo una freidora de 7 litros de GoWiseUSA y es bastante buena, este horno Oster que también es freidora, necesito probarlo, ase unas verduras con el modo freidora y se tostaron un poco las cebollas que estaban a la salida del aire, así que recomiendo que pongan de ese lado calabazas o zanahorias, en este punto que quedo pensando si es mejor una freidora con el aire en la parte superior y cocine más parejo.Hay alguien que comentó que los números del display están muy pequeños y tiene toda la razón. Además empujar los botones es algo duro, prefiero los botones botones, en este sistema de Oster llegas a fallar pensando que lo apretaste, pero no obedeció.Después de 1-2 horas de uso, los tronidos de la lámina, se vuelven más frecuentes, tal vez el grosor de la lámina es muy delgada o estructuralmente tiene algunas fallas.Pero en fin estamos entusiasmados y sabemos que no es un Roto-Broiler, no es tan robusto y pesado, pero seguiremos probando.Gracias…",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MARÍA LUCILA ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 14, 2023",
                "reviewTitle": "EXCELENTE HORNO",
                "reviewText": "Llegó en perfectas condiciones, funciona perfecto!Justo lo que estaba buscando!!!Totalmente satisfecha con la compra",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SANDRA MCCALL",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 20, 2023",
                "reviewTitle": "Exactly as described by manufacturer",
                "reviewText": "So far everything works great, no complaints. Temperature dead on and it's quiet. Looks stylish on the counter and large enough to fit medium size roaster, but not too overwhelming for a countertop appliance.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 31, 2023",
                "reviewTitle": "Works great",
                "reviewText": "I love the size and multiple functions. I've used air fry, turbo convection and bake so far.The only downside is that the air fry rack is rated as not dishwasher safe. That means I have to soak it in a big sink and hand scrub it. Not the best for removing grease.If the rack was dishwasher safe. I'd give it 5 stars, even though it's a bit noisy when it runs, and the timer isn't very loud when it alerts you, even though it seems to remind you in spurts until you turn it off.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$279.87",
                "sellerName": "always quality",
                "sellerRating": "4.5"
            },
            {
                "price": "$333.00",
                "sellerName": "Instock Distributing",
                "sellerRating": "3"
            },
            {
                "price": "$339.87",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}