{
    "remaining_requests": 35061,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ronco-Rotisserie-Stainless-Countertop-Functions/dp/B0B1RJRW8Y",
    "body": {
        "name": "Ronco 5500 Series Rotisserie Oven, Stainless Steel Countertop Rotisserie Oven, 3 Cooking Functions: Rotisserie, Sear and No Heat Rotation, 12-Pound Capacity",
        "price": "$149.99$127.49",
        "originalPrice": "$164.99",
        "rawPrice": 149.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ronco-Rotisserie-Stainless-Countertop-Functions/dp/B0B1RJRW8Y",
        "soldBy": {
            "sellerID": "A3QU4XD7JO8V9H",
            "name": "Synergy Global - Brand Authorized Distributor",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3QU4XD7JO8V9H&asin=B0B1RJRW8Y&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B7P4MCBQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B1S3H7H2",
                "variationName": "Style",
                "variationValue": "Black",
                "price": "$154.99",
                "variationImageURL": ""
            },
            {
                "asin": "B08JQMWK6K",
                "variationName": "Style",
                "variationValue": "Original Black",
                "price": "$207.88",
                "variationImageURL": ""
            },
            {
                "asin": "B0B1RJRW8Y",
                "variationName": "Style",
                "variationValue": "Stainless Steel",
                "price": "$149.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41xtR-TA3oL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51qlLhAkxFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F6cvdyObL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51s6V4FHoqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DZswfIZdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/610DRYhPLGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51MzsYqwJBL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ronco Store",
            "link": "https://www.amazon.com/stores/Ronco/page/3E90C4ED-79B3-4395-87A2-D02876ED0E3E?ref_=ast_bln"
        },
        "brand": "Ronco",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 712,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 21 - 27.",
            "FREE delivery Monday, February 19. Order within 6 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LARGE CAPACITY OVEN: The interior is large enough to cook up to a 15 lb turkey or 2 whole chickens at a time but at only 13 inches tall and 17.75 inches wide, the Showtime Modern Rotisserie is compact to fit under cabinets for easy storage when not in use.",
            "SELF-BASTING ROTATION: The classic Ronco rotisserie design locks in flavor and seals in natural juices while the removable heat reflector helps brown meat to perfection giving you tender, mouthwatering rotisserie chicken at home, anytime",
            "3 SIMPLE COOKING SETTINGS: With three simple switch control settings, Roast, Sear, and No Heat Rotation, the unique Ronco Showtime Modern Rotisserie has the perfect preset temperature and rotation speed to evenly brown foods. No guesswork needed.",
            "HEALTHY and DELICIOUS: Rotisserie cooking seals in flavors while unwanted fat and grease melts away so you are left with deliciously moist, flavorful, healthier poultry and roasts. Perfect for preparing Keto friendly, low carb meals",
            "AUTO SHUTOFF: An adjustable, 3 hour timer makes the Ronco Showtime Modern Rotisserie Oven as easy as ever to use and will automatically shut off when time is up so you don’t have to worry about overcooked foods",
            "MORE THAN CHICKEN: The included multi-purpose basket lets you enjoy deliciously roasted foods such as fish, vegetables, hamburgers, sausages and more while taking advantage of the hands-off simplicity of the rotisserie oven",
            "SIMPLE CLEAN UP: The oven’s interior surface wipes clean with a damp cloth while the removable glass door and drip pan are dishwasher safe so clean up is as effortless as the cooking.",
            "SILICONE DOOR TIE: The Ronco Showtime Modern Rotisserie Oven includes a silicone tie that simply slips over the door handle to help secure the door for storage.",
            "MODERN EDITION INCLUDES: Ronco Modern Edition Rotisserie Oven with silicone door tie, multi-purpose basket, rotisserie spit, carving platform, removable drip tray, oven gloves, food ties"
        ],
        "description": "Cook like a gourmet with the Ronco Showtime Modern Edition Rotisserie Oven. Make perfectly roasted chickens, turkey, pork, roasts, and burgers that are delicious and healthy too. Its large capacity accommodates a 15-pound turkey or 2 whole chickens while still fitting on your countertop! The three cooking options allow you to Roast with normal rotisserie rotation, Sear to pause rotation and stop food in front of the heating element, and No Heat Rotation to keep juices evenly distributed before serving. An adjustable timer will automatically shut-off when cooking time is up which means no more worrying about overcooked food. The included multipurpose basket accommodates a variety of food including burgers, sausages, fish & vegetables so can roast a variety of foods with the ease of a rotisserie oven. Ronco rotisserie ovens feature dishwasher safe parts for easy clean up.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Rotisseries & Roasters",
                "link": "https://www.amazon.com/Rotisseries-Roasters/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289936"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Ronco"
            },
            {
                "name": "Color",
                "value": "ST5500STAIN"
            },
            {
                "name": "Product Dimensions",
                "value": "15\"D x 18\"W x 14\"H"
            },
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Ronco Modern Edition Rotisserie Oven with silicone door tie, multi-purpose basket, rotisserie spit, carving platform, removable drip tray, oven gloves, food ties"
            },
            {
                "name": "Model Name",
                "value": "Ronco Series Rotisserie Oven"
            },
            {
                "name": "Finish Type",
                "value": "Painted"
            },
            {
                "name": "Item Weight",
                "value": "12 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Ronco"
            },
            {
                "name": "ASIN",
                "value": "B0B1RJRW8Y"
            },
            {
                "name": "Item model number",
                "value": "ST5500STAIN"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 712 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25,785 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #6 in Rotisseries & Roasters"
            },
            {
                "name": "Date First Available",
                "value": "May 20, 2022"
            },
            {
                "name": "Capacity 12 Pounds",
                "value": "Wattage 1250 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 12 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Large Capacity Cooking The Ronco Showtime Modern Rotisserie Oven is perfect for large batch cooking of fish, vegetables, hamburgers, sausages, chicken, turkey, ham, and more! The interior is large enough to cook up to a 15 lb turkey or 2 whole chickens at a time. Specialized Heating The specialized heating element and precision rotating speed efficiently circulates heat to cause excess grease and fat to drip away. Let The Oven Do The Work All you have to do is load the chicken or turkey - or other foods - onto the nonstick spit assembly and set the timer! The timer is simple to use and automatically turns off the heat when the time is up.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cf7078c7-e917-4e87-81b0-81e33a089554.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/5559a0bc-3060-40a6-b431-7215cd062a73.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3bbcff5b-0429-4259-83d2-9586ecbd8450.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Showtime Modern Rotisserie Showtime EZ-Store Rotisserie Showtime Platinum Rotisserie Showtime Classic Rotisserie Control Manual Digital Digital Manual Exterior Dimensions 17.7 x 15.2 x 13.7 inches 17.0 x 17.0 x 12.5 Inches 19.9 x 16.6 x 15.6 inches 14.7 x 17.7 x 13.5 inches Auto Shutoff ✓ ✓ ✓ ✓ EZ-Store ✓ Silicone Door Tie ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/9531ffc0-5af6-4c91-aa6f-194985161b63.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cf7078c7-e917-4e87-81b0-81e33a089554.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5559a0bc-3060-40a6-b431-7215cd062a73.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3bbcff5b-0429-4259-83d2-9586ecbd8450.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/07909825-b65f-48aa-9efa-6ff99c0d7abf.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d5c3613a-5a48-4334-9ce3-0ac5290d1c5e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/10961b2f-c0da-41c8-b474-3e591e809a41.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f1aa5707-5a39-45f2-a29c-4125d8cf5854.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5d8322a9-7956-4fae-a8bf-c4ab28c538f0.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cec2f891-22b3-40b3-9987-08045714657b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1a24a9c6-94b7-43a3-ad47-9b28448b722b.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Maggie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVYMMS4HMTLRMBO5J726IRTIT6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R205R6RQ44ZNYZ?ASIN=B0B1RJRW8Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars I was so surprised how easy it was!!!",
                "reviewText": "The night after I received this we made a whole chicken following the directions in the enclosed book. It was the best chicken I've ever tasted. For Christmas Eve we made a prime rib. Oh my goodness! It was the best. I've never even tasted a restaurant prime taste this good. For New Year's we're making a beef tenderloin and I can't wait. This is the best cooking investment I've ever made. It's the best. It may be a bit pricey for some but it is so worth it. It was so easy. We seasoned the prime with salt and garlic powder, poked the prongs through the meat, put it on the rotisserie, set the timer and left it alone. It came out medium rare throughout. And, it was just as easy to clean.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Schwartz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFGVYALGIE7LTWS7C7F2ZKANXEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RW4VUCDIYP1X?ASIN=B0B1RJRW8Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Had to replace my old Ronco and this is a decent replacement",
                "reviewText": "My parents gave me an old Ronco rotisserie years ago. I believe it was one of the very early models when they were sold via Infomercials on late night TV. It was one of the best Ronco inventions that was ever sold on those infomercials! The plastic base finally cracked to the point where I couldn't use it anywhere. I had fixed it once, but the glass door would no longer stay on and was unfixable.This is one of those kitchen appliances that you think, \"Do I really need this?\" The first one was given to me so when it couldn't be used any longer I had to make a decision as to whether I should spend $100 to replace it. The answer was 'yes'!This rotisserie makes cooking a chicken so delicious, so juicy and so easy that I couldn't imagine just roasting a chicken in the oven, again. The spits are sharp and easily fit into the chicken and onto the gears which rotate the chicken. There is a rotisserie function or just a rotate function (without heat). My model has a dial to set the temperature (figure 15 min/lb for the chicken). The instructions say that the spits can hold two chickens but the one time I tried two chickens they were too big and didn't rotate properly.I also cooked a boneless beef roast that was around 5lbs and it came out incredible and medium rare. You can also rotisserie a small turkey. I had done that once and it was also amazingly juicy.The product comes with a base on which to put the spits after cooking so you can slice beef, but I have never used it. The pan and pan top (onto which the grease drips) is easy to clean if you line the pan with aluminum foil, first. When my food is finished cooking and I've taken it out of the rotisserie, I clean the rotisserie right away, as it's much easier when everything is hot. As the unit cools down a bit, I take glass cleaner to clean the inside of the glass that usually has grease spatters. The product also comes with rubber/vinyl heatproof gloves to use to remove the spits from the rotisserie after the food is done cooking.I think the original was built a bit better than this, but that's usually the case as years go on, companies design products to be made less expensively.Even with this being slightly less impressive than the original model, I will continue to use on a regular basis. If you like rotisserie chicken from Costco, imagine having the chicken come out JUST as juicy at home with your own concoction of rub ingredients!!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Long Island NativeLong Island Native",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2OQ4ESF6FVRSIM7EI36S5NOD3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUS6KNXVO79WX?ASIN=B0B1RJRW8Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 23, 2021",
                "reviewTitle": "5.0 out of 5 stars Cooks evenly, easy cleanup, set up",
                "reviewText": "In 2006 I received the older version of this Ronco rotisserie and used it frequently for nearly 13yrs so far as cooking every holiday Turkey, Beef Roast and too many Roasted Chickens to count.All were spectacular, moist juicy and all presented beautifully! Since then I had been unable to reproduce the spectacular results this unit created, thus my new unit arrived a few days ago.I cooked an 8lb Turkey breast to succulent (Basting it with herbed butter early during the cooking process) then apple juice thereafter to succulent perfection. Just to mention I usually place the unit on a small table outside on our deck to save inside counter space and it works nicely. It’s simple and easy to use”Just set it and forget it” you tube has helpful videos for first time users.The clean up can be a be detailed, unlike my last unit this one has a “detachable heat shield” this really helps with clean up. I covered mine with foil along with the bottom of drip pan. Front glass is detachable and was easily cleaned with Dawn Detergent and a Scrub Daddy. Same for the inside. I am planning to have this model for many years. Yes as some reviewers mentioned it does turn more slowly, the meat was still incredibly moist!It is a big large to store. I saw more compact models available but decided to stick with the original sized unit.I must confess this is my success for rave Turkey and meat reviews from our family and friends.Give it a try.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1ur2ghTW5S.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aries ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 8, 2023",
                "reviewTitle": "Mmm chicken",
                "reviewText": "Very good, thank you. This works very well. Recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randy jollie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 30, 2022",
                "reviewTitle": "very very dissapointed",
                "reviewText": "I ordered this item on Nov 26th with a delivery date of Dec 16th.I received on the 16th and the product was defective/incomplete.The rotisserie wheel part was unable to work.I contacted manafacturer and after providing my proof of purchase i had another part ordered and received on December the 23rd and they sent the wrong part,so i had to re order again and i have what i hope is the correct part to be delivered on Jan 3rd.This was a xmas present for a family member and we are very dissapointed.I paid over 500.00 for this product on Nov 26 and as of December 30th i still have a in complete product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 12, 2021",
                "reviewTitle": "Very easy to use",
                "reviewText": "Imy wife loves this product She made chicken ribs and a roast and it comes out beautifully done",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patricia jeffers",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 11, 2023",
                "reviewTitle": "Terrible.",
                "reviewText": "Had two previous items but this one turns too slow. Poor quality of item as well. Would not buy again or recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 2, 2021",
                "reviewTitle": "rotisserie",
                "reviewText": "tres bon produit je recommande",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}