{
    "remaining_requests": 35328,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Nutrichef-Upgraded-Multi-Function-Rotisserie-Oven/dp/B079B3Y1ZD",
    "body": {
        "name": "Nutrichef Upgraded Multi-Function Rotisserie Oven - Vertical Countertop Oven with Bake, Turkey Thanksgiving, Broil Roasting Kebab Rack with Adjustable Settings, 2 Shelves 1500 Watt - AZPKRT97",
        "price": "$89.40",
        "originalPrice": "",
        "rawPrice": 89.4,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Nutrichef-Upgraded-Multi-Function-Rotisserie-Oven/dp/B079B3Y1ZD",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51bmElKkyeL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/510PmdooSGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51E-RiIY1iL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Xrq79zGBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510V5UQSfCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kN8JpByeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61hmgbKFYAL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the NutriChef Store",
            "link": "https://www.amazon.com/stores/NutriChef%E2%84%A2Kitchen/page/7524F6DC-82AB-40A1-B65C-EF27713A17A4?ref_=ast_bln"
        },
        "brand": "NutriChef™Kitchen",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1153,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 6 hrs 17 mins",
            "FREE delivery Sunday, February 18. Order within 6 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "INNOVATIVE STYLE & DESIGN: Ideal addition to any home or establishment, Convenient heat resistant tempered glass door",
            "VERSATILE MEAL PREPARATIVE: Multi function oven cooking ability, Bake, Roast, Broil, and Rotisserie & More",
            "QUALITY & FEATURES: Safe placement on any kitchen table or countertop, High powered heating elements, Energy efficient & time saving cooking, Adjustable time & temperature setting",
            "WHAT’S INCLUDED: Kebab skewer rack, bake pan & grill racks, stain resistant & easy to clean, Use the rotating kebab rack for tasty results",
            "WARRANTY: By purchasing the Nutrichef Vertical Rotisserie Oven you receive a worry free 1 year warranty and our friendly customer service"
        ],
        "description": "NutriChef Model : PKRT97Multi-Function Vertical Rotisserie OvenMulti-Function Vertical Oven with Bake, Rotisserie & Roast CookingFeatures:Versatile Meal Prep: Bake, Roast, Broil, Rotisserie & More!Use the Rotating Kebob Rack for Tasty ResultsMulti-Function Oven Cooking Ability High-Powered Heating ElementsEnergy Efficient & Time-Saving CookingAdjustable Time & Temperature SettingSafe Placement on Any Kitchen Table or CountertopConvenient Heat-Resistant Tempered Glass DoorIncludes Kebob Skewer Rack, Bake Pan & Grill RacksStain Resistant & Easy-to-CleanTechnical Specs:High-Powered Heating Element: 1500 WattMax. Time Setting: Up to 60 minsMax. Temperature Setting: Up to 464 °F (240℃)Capacity: 24+ QuartsPower: 110VUnit Dimensions (L x W x H): 13.4'' x 12.2'' x 18.9''Rotisserie roast your favorite foods with healthy and tasty results. The NutriChef Vertical Countertop Rotisserie Oven provides you with hassle-free food prep ability. Use the included skewer tower and insert your favorite meat. Operation is simple -- insert your food, set the rotary timer and the oven does the rest! Save time and money thanks to simple food preparation with the NutriChef Vertical Countertop Rotisserie Oven.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Rotisseries & Roasters",
                "link": "https://www.amazon.com/Rotisseries-Roasters/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289936"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "NutriChef"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "12.2\"D x 18.9\"W x 13.4\"H"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Included Components",
                "value": "Product Unit;Accessories"
            },
            {
                "name": "Model Name",
                "value": "AZPKRT97"
            },
            {
                "name": "Finish Type",
                "value": "Polished"
            },
            {
                "name": "Temperature Range",
                "value": "200 - 464 Degrees Fahrenheit"
            },
            {
                "name": "Item Weight",
                "value": "10.6 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Sound Around"
            },
            {
                "name": "ASIN",
                "value": "B079B3Y1ZD"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "AZPKRT97"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,153 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#23,888 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #5 in Rotisseries & Roasters"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "January 25, 2018"
            },
            {
                "name": "Capacity 24 Quarts",
                "value": "Wattage 1500 watts"
            },
            {
                "name": "Material Tempered Glass",
                "value": "Item Weight 10.6 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Us Pyle was founded in the 1960s as a manufacturer of high-quality advanced woofers. Our reputation quickly grew as customers around the United States used our products and recognized the power of our scientifically-tuned woofers and drivers. Soon, the Pyle Driver, our original speakers, became a household name. In the late 20th century, Pyle established itself as a premium source for replacement speakers and car audio. By the year 2000, Pyle had undergone a massive transformation, expanding into the nascent market spaces of car audio, home audio, marine audio, and professional audio & musical instruments - our Pyle Pro line.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/3c90c25f-d6d6-4a5e-ac90-9ebbdb224983.__CR0,0,401,401_PT0_SX300_V1___.jfif"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/3c90c25f-d6d6-4a5e-ac90-9ebbdb224983.__CR0,0,401,401_PT0_SX300_V1___.jfif"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Swordfish SixSwordfish Six",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7QZUPNANDN2R3LL7K5UIC7IBKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ5J03ZXMZTOM?ASIN=B079B3Y1ZD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 29, 2020",
                "reviewTitle": "5.0 out of 5 stars Oh My Gosh It's Huge!",
                "reviewText": "I recently bought the Nutrichef Vertical Countertop Rotisserie Oven. I like it very much. So much so, I am making this comprehensive positive review. If you're like me, you will appreciate the depth and scope of my thorough review to help you decide if you want to purchase. First, It came incredibly fast. I ordered it late Sunday night, and it was delivered Tuesday afternoon. Fast delivery aside, I am very impressed with the size of the oven, and with the quality of construction. I read some negative reviews suggesting the construction was sub standard. I disagree with those reviewers. I found it to be constructed very solidly. I like how the curved tempered glass door stays open, when you open it all the way, and shuts by itself, when you put it in any other position besides fully open. Setup was instantaneous, as it was fully assembled right out of the box. You might want to wash the racks, skewers, bowls and pans, as well as the inside of the oven, just to remove any grease or manufacturing residue from the factory. There really didn't seem to be any, but I washed all the accoutrements anyway, just to be safe. The oven comes with everything you could possibly want for making kabobs, for using the rotisserie, and even for baking. I did a 20 minute \"burn in \", to make sure that any fumes or smoke from the initial use did not get on my food. There was a small amount of smoke, when I first turned it on, but it only lasted a few seconds. I like the fact that you can adjust the temperature . I also like the option to set the timer to the \"Stay On\" setting, for slow cooking. Make sure to turn the timer knob counter clockwise to get to the \"Stay On\" position. Don't try to force the dial to go past the 60 minute setting. The timer is very accurate. I cooked a medium sized chicken, and there was room to spare, as you can see from the photo, (attached). I wanted to attach a picture of how neatly it stores away in my cupboard, but you'll have to take my word for it, as I couldn't seem to attach more than one photo. Luckily, I have big cupboards, because this thing is huge! My chicken came out perfectly cooked. It was juicy and tender. The rotisserie motor worked perfectly. I can't really speak to the versatility, as I only cooked one chicken, so far, but I tested the heating elements in both configurations, and in different modes and it worked fine. I've even seen a picture where one element was horizontal and one was vertical. I find the ability to manipulate the heating elements very interesting. That is sure to be useful. I read that a few people thought that this model oven was top-heavy. I agree it may be tipped over easily, if you have a small child, or a michievous cat. That being said, I believe it's perfectly safe, unless acted upon by an outside force. I certainly wouldn't pass up this great bargain, because of a high center of gravity. I just took a little strip of cardboard from the packing material and made a little wedge to place under the front of the oven to make sure my cat doesn't accidentally knock it over. If you look close at the photo I attached, you can see how easily the high center of gravity can be neutralized. One more thing worthy of note is the ease of cleaning. It cools down very quickly, and can be wiped down with a damp paper towel in seconds. All in all, I would recommend it to anybody in the market for a versatile space saving appliance that makes a great addition to your kitchen. It could replace many of your other appliances. It's fun to use, and I feel is well worth the money.",
                "reviewVotes": "129 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71wVL8Fd40L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joel R.Joel R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGODF7XVARIJRWKQQYQ5Q2CZAMWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33XLL05BD1HDF?ASIN=B079B3Y1ZD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent product",
                "reviewText": "My father's like everything and I satisfied for all services.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71IsUoGU8OL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dewayne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVGK2UEVGG5GUS7724VUWYBJYIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VYR9UH2OBX4D?ASIN=B079B3Y1ZD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Very happy with the product.",
                "reviewText": "The media could not be loaded. I like it a lot. I have used it twice so far and it cleans good, heat up fast. I would give it a 5 star rating, but I feel that the timer is a little cheap. If you accidentally set it for an hour, but you actually need to set it for 30 mins, I’m not sure if you can reset it. So you have to wait until the timer runs it’s course. Overall, I really like it for the price!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d921ed5e-2866-4e2b-9253-fa2dcfe9bc09/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "KayeVicKayeVic",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTGB75FRUCQ2EAJAXWXVSC4FDVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I3W1HM9TZOLX?ASIN=B079B3Y1ZD",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2019",
                "reviewTitle": "1.0 out of 5 stars Accessories rust and door doesn’t close completely shut",
                "reviewText": "I was really excited about this upright rotisserie. However, I noticed that the glass door doesn’t completely close shut. Thus, messing with the temperature because heat escapes through the opening.It took longer to cook a 5 pound chicken than I would’ve in my oven. Also, I noticed that the bottom portion wasn’t cooking the chicken well, as if most of the heat were being emitted on the upper portion of the heating element. I then had to stop the process and adjust the whole chicken higher. Which was a pain to do because it was still hot of course.Clean up was easy, I just wiped the interior down with a damp cloth.Now for the accessories. I noticed that after a couple of washes, they were beginning to rust.The long stake, the skewers, prongs, and the plates had spots with rust starting up.I immediately deemed it unsafe because I wouldn’t attempt to place food on these accessories again, let alone cook with them.I did contact Amazon CS and they had me process a return for a refund. I sent it back and got my money back a few days later.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71Qhpq4ArZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71c2ZUzvB6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81VFcLNLDzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve Harrington",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQYVNTDD5MBX6RMEROLYZ6DMMAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRR3088TR73U4?ASIN=B079B3Y1ZD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Rotesserie",
                "reviewText": "I had two Ronco's over the pass two years. Neither held up, so I tried Nutruchief. Cleaning is a breeze with the Nutruchief. It has two heating elements, one vertical and one horizontal. With the vertical positioning of a chicken or rib roast drippings do not splatter on sides or back, like Ronco. Always had problems with the Ronco with food rubbing against the heating element and gear slippage. You can also adjust the temperature with the Nutruchief when using the Rostesserie. You cannot do that with Ronco Rostesserie. The Ronco had a tendency to over cook and the chicken was not as moist, all related to the size of the chicken. I bought this to replace my last Ronco which fell apart in about a year. Ronco use to be the gold standard but this much superior at a third of the cost.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julia Barnes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYU546ES4N6G6TJPTBGC2I2DGRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z8HZBPEGKKHN?ASIN=B079B3Y1ZD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing",
                "reviewText": "This is amazing!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vladimir",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIF2RYY3YMV4YOZGWSKNVFPXPVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR3F2DAUIDZJI?ASIN=B079B3Y1ZD",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 6, 2023",
                "reviewTitle": "3.0 out of 5 stars Product is so so.",
                "reviewText": "Delivery is good, but product is not very good.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLI3Z7F2WWLUTBRUKHTEC3POAOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NCU77HR8DQB7?ASIN=B079B3Y1ZD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Roster",
                "reviewText": "We roast a chickenEasy to use",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "IsabelIsabel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 3, 2024",
                "reviewTitle": "Muy buen producto, multifuncional y práctico",
                "reviewText": "Me gusto mucho,tiene complementos para rostizar y funciona muy bien.Asa, rostiza y hornea, tiene temporizador de 60 min pero puede aumentar y volver a girar la perilla si es necesario.No trae instructivo pero es intuitivo, tampoco trae recetario pero ayudan los videos de YouTube y las reseñas previas.Muy buen producto 👍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Auv1FrnFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zR+gkBQpL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71rZV0pyGXL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "w",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 1, 2023",
                "reviewTitle": "excellent results and easy to clean . Rotisserie roast and chicken (excellent)",
                "reviewText": "The media could not be loaded. Hold on to the door, it is a bit front heavy . No big deal . Otherwise very happy with unit 👍👍",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/E1ZbJLUY3-L.mp4"
                }
            },
            {
                "reviewerName": "Jorge d",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 10, 2023",
                "reviewTitle": "Excelente producto",
                "reviewText": "Excelente producto a buen precio . El horno es tal y como se describe muy fácil de usar y para usos variados es práctico y ligero.. fácil de limpiar.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 8, 2021",
                "reviewTitle": "Love this machine!!",
                "reviewText": "I use my rotisserie to do sublimation on tumblers. It works great! People writing poor reviews obviously are not working this correctly. Take out the bottom tray and you will find the rotisserie hole and you can move the elements to the sides which makes it awesome.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brad Wright",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 22, 2022",
                "reviewTitle": "Great!",
                "reviewText": "Great! Makes great chicken! The only thing to watch out for with this product is the door hinge spring action. If your not careful the do will slam shut, do to the strong spring if you do not open it all the way and let go. This had happened a couple of times. The door has not broken, I would just like to see a different design of the door. Because the chicken rotates vertical, all the oils drip down nicely but I wonder if it rotated Horizontally like the pro ovens do, if it would not make a better product as the oils would stay more on the chicken. Over all we still love it and use it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}