{
    "remaining_requests": 35305,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Panasonic-NB-G110P-FlashXpress-Infrared-Removable/dp/B008C9UFDI",
    "body": {
        "name": "Panasonic Toaster Oven FlashXpress with Double Infrared Heating and Removable 9 Inner Baking Tray, 1300W, 12 x 13 x 10.25 inches, Silver",
        "price": "$169.99",
        "originalPrice": "$169.99",
        "rawPrice": 169.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Panasonic-NB-G110P-FlashXpress-Infrared-Removable/dp/B008C9UFDI",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B00GMDX1WI"
        ],
        "asinVariationValues": [
            {
                "asin": "B07JX1Z6LS",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$169.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51H3kBdZbXL._SS36_.jpg"
            },
            {
                "asin": "B008C9UFDI",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "$127.49",
                "variationImageURL": "https://m.media-amazon.com/images/I/415cnTOFUdL._SS36_.jpg"
            },
            {
                "asin": "B00E07D76S",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$169.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51niASGv+JL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/415cnTOFUdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51PAoCFCa8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QHx4D2coL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71lhT01tfKL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C16SRS3Y-AS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71p0rDfH3FS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Panasonic Store",
            "link": "https://www.amazon.com/stores/Panasonic/page/F6906AE2-27F4-463F-8810-41DB8D93F02B?ref_=ast_bln"
        },
        "brand": "Panasonic",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 9113,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 13 mins",
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 7 hrs 13 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "A Compact, Easy-to-Use Oven Toaster: Toast, bake, brown, and reheat to perfection, no preheat required—two infrared oven heating elements are positioned at the front and back for maximum efficiency",
            "Six 1-Touch Controls: Six preset cooking functions for the foods you love, plus reheat, defrost, and more, so that making it just right couldn’t be simpler",
            "For So Much More than Just Toast: A compact toaster oven that makes meals, snacks, and sides perfectly using a manual temperature control and timer",
            "Safety Features: Toaster ovens baking rack is connected to the oven door to smoothly pull the rack toward you as the door is opened; auto shut-off helps prevent overcooking and burning",
            "Compact, Attractive Design that Fits Anywhere: The FlashXpress toaster unique design and small footprint is perfect for any kitchen décor or countertop"
        ],
        "description": "Panasonic FlashXpress small toaster oven technology featuring a double infrared heater for instant heat that eliminates the need for preheating. Six cooking menus with illustrated preset buttons automatically calculate the cooking time for a variety of foods: bread (toast, waffles, bagels), frozen food (pizza, hash browns) and reheat (rolls, breads, leftovers). Other features include a digital timer (up to 25 minutes) and temperature settings (250 Degree F to 500 Degree F), square shaped inner tray perfect for pizza up to 9-Inch in diameter or 4 slices of bread, removable crumb tray for easy cleaning, a reminder beep lets you know when food is done, interior light allows you to view your food while cooking, internally measures 4.1-inch (H) by 10.2-inch (W) by 9.8-Inch (D), 7. 5-Pound, The FlashXpress G110P toaster ovens countertop measurements 10.2-inch (H) x 13-inch (W) x 12-inch (D).",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Toaster Ovens",
                "link": "https://www.amazon.com/Toaster-Ovens-Toasters-Small-Appliances/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289937"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Panasonic"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Product Dimensions",
                "value": "13\"D x 12\"W x 10.25\"H"
            },
            {
                "name": "Special Feature",
                "value": "DigitalAuto Shut Off"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Panasonic Flashxpress 4-Slice Toaster Oven"
            },
            {
                "name": "Model Name",
                "value": "FlashXpress"
            },
            {
                "name": "Finish Type",
                "value": "Silver"
            },
            {
                "name": "Power Source",
                "value": "Corded Electric"
            },
            {
                "name": "Temperature Range",
                "value": "250 - 500 Degrees Fahrenheit"
            },
            {
                "name": "Item Weight",
                "value": "8.5 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Panasonic"
            },
            {
                "name": "ASIN",
                "value": "B008C9UFDI"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "NB-G110P"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 9,113 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,611 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #8 in Toaster Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "June 11, 2012"
            },
            {
                "name": "Capacity 410 Gallons",
                "value": "Wattage 1300 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 8.5 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Panasonic NB-G110P Small on your Countertop, Big on Features The Panasonic FlashXpress Compact Toaster Oven uses efficient infrared technology and one-touch controls to bake, toast, and reheat perfectly, with an intelligent design that neatly fits on any countertop.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e0d38f97-a922-424e-82b0-3c19bcb37f84.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Ready in a Flash—No Preheating Required Evenly toast, bake, brown, and reheat to perfection without the need for preheating! High-efficiency quartz and ceramic heating elements are positioned in the front and back to cook food quickly and evenly from the inside and out. Six Auto-Cook Menus One-touch controls help you make your favorite foods fast and perfectly, from toast to waffles and pizza. Simply press the button and get hot, fresh meals and delicious sides just the way you want them.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e43d125f-2b49-4f56-af95-d046f4bcf331.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e73dda97-4f04-4423-a1f0-badfbe8ef412.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            },
            {
                "media_text": "Connected Baking Rack Automatically pulls out when you open the door, to help keep hands and fingers safe from heat. Smart Sensor Turns heat on and off automatically to help maintain the perfect temperature and help keep foods from burning. Auto Shut-Off When cook time is over, the FlashXpress turns off to prevent overcooking or burning. Included Accessories Square baking tray, perfect for pizza up to 9 inches in diameter or up to 4 slices of bread, plus a removeable crumb tray.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6ba6110-dd06-44c2-bb43-6e9abe98b8d8.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/253a2f9a-9135-434e-94d1-25375eb604b3.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dcb9a823-5402-466a-91b2-441b396c1ff9.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7bcb2798-c279-4a67-bd4d-71314cd325ac.__CR0,0,300,225_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "How big is the inside of the oven? Internal dimensions (W x D x H): 10.2 x 9.8 x 4.1 inches. Comes with a 9-inch square baking tray, a perfect fit for personal pizzas or up to four slices of white bread. How does auto shut-off work? At the end of the pre-set time or manually selected cook time, the unit will shut off on its own, preventing food from burning. What is the benefit of FlashXpress heating elements? The two heating elements heat up quickly so the oven does not require preheating. Positioned at the front and back of the oven, they toast, bake, and brown foods evenly inside and out. Can I use this for more than just toast? The FlashXpress Toaster Oven can be used to make meals, sides, and snacks, using either one of the six auto-cook buttons or by manually setting the oven temperature and time. Why does the light turn on and off during cooking? The toaster has a smart sensor which turns the heat on and off automatically to maintain the perfect temperature and prevent burning.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e0d38f97-a922-424e-82b0-3c19bcb37f84.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6bfb272d-0d0f-474b-b94b-928a24fc7a66.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e43d125f-2b49-4f56-af95-d046f4bcf331.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e73dda97-4f04-4423-a1f0-badfbe8ef412.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6ba6110-dd06-44c2-bb43-6e9abe98b8d8.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/253a2f9a-9135-434e-94d1-25375eb604b3.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dcb9a823-5402-466a-91b2-441b396c1ff9.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7bcb2798-c279-4a67-bd4d-71314cd325ac.__CR0,0,300,225_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tom JohnsonTom Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY76QQKKYQAS3AXETYBQ5GSY3LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3THIZXHUHGMNY?ASIN=B008C9UFDI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2021",
                "reviewTitle": "5.0 out of 5 stars The Perfect Toaster Oven",
                "reviewText": "I wanted a toaster oven to avoid using our big oven for small items . Searching for one that fit into our crowded counter space, this one was one of the smallest and not that expensive. I read all the manufacturer's information, watched their videos, and read many of the 1 and 2 star reviews before I decided to get one 6 weeks ago. Pluses: small foot print, no preheat, simple controls, and speedy toasting. When it came I read all the instructions and info on cooking various things in it. Then I kept a record of my experiments. No cookbook included, just cooking guides. Looked online for recipes for this oven, found a few and printed them out.After using it a while I learned a lot. Watch carefully as your food browns, it will go very fast once browning starts. Be prepared to experiment: making a personal 7\" or smaller pizza is easy. Roasting peppers is easy too. If the food is not cooked enough, put it back in and heat it some more. Line the oven tray with non-stick aluminum foil. Do not put anything that will drip onto the grid, use the oven tray or heat resistant cookware (metal or ceramic). I collected recipes and took notes.One recipe for roasted party potatoes takes 40 to 50 minutes in the big range oven. In this oven it took 25 minutes, saving a lot of power and heating up the kitchen. Controls are very simple to use. Bread toasts perfectly. Whole wheat bread takes the #4 setting. White bread the middle #3. Easy to try again if not as dark as you want, just be prepared to hit the power button to turn it off as soon as you have what you want.One reviewer did not like this oven because the door does not seal!!! Look at the door, it is made to have a gap so it will vent. ALL OVENS VENT. Your large kitchen oven vents, probably through one of the burners. They have to vent or they will fill with steam and vapors and odors.Super easy to remove the grid to clean it off, read the directions. Crumb tray easy to remove to clean off. After using this oven for a week I did what I should have done at the start -- I looked online for reviews. I found a number of sites that rated this as the #1 toaster oven of 2020. Many rated it in the top 5 or top 10 of all toaster ovens rated.Con: you cannot cook food that oils or greases come out of, like steaks or bacon, unless it is wrapped in foil. The infrared lamps might ignite the hot oil that collects on the tray. You cannot use anything flammable like parchment paper (unless it is trimmed so the paper is not exposed to the radiant heat. I prepared a recipe for frozen home fries that is intended to be cooked in a skillet. They cooked crisp like French fries and took as long as it did in a skilled. Frozen French fries are great cooked in this oven. Corn tortilla chips should not be heated, they might ignite as they are dry and thin. Toasting biscuits or similar items is a snap. Bagels, flat breads, pizza crusts.Note: I wanted to use a small Pyrex dish I have in this oven, but the cautions on the package cautioned against toaster ovens. Called Corning about this IR lamp oven, they do not recommend using Pyrex in it as they have no experience with this type oven. Note: Since around 2000, Pyrex glassware is no longer heat resistant anymore. It is not the original borosilicate glass that Pyrex has been made from for the last century. Pyres is now soda lime glass, like regular common glassware, and not meant for hot ovens. I bought some small vintage Corning Visions cookware that fit in the oven. I can also use my vintage Corning Pyroceram cookware.I love this toaster oven, it is perfect for our needs. Quick and simple. Keep notes on the temperature and time settings you use until you get a good feel for different recipes. I prepare my 7\" pizza crusts with pizza sauce, toppings (putting soft or cooked things first, then raw veggies & mushrooms on top. Cook at 425F for 5 minutes. Remove tray and top with cheese. Then cook at 425F for 4 to 5 more minutes. Mozzarella melts beautifully and starts to get toasty brown. Just don't leave during the last several minutes - watch carefully and be ready to hit the power button.One of the best purchases I've ever made. Love this oven. Oh, don't put your hand in the oven while the flash lamps ore on - the radiant infrared will burn you instantly. I know this from working with infrared lamps in an R&D lab. Turn off the oven before you reach inside.",
                "reviewVotes": "193 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91oTIAaHFyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "nishiko",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3QYWUSZCGLRE7HPXY3IDGG4LEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZLHBCIC3N0D5?ASIN=B008C9UFDI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Fast, quiet, no toxic plastics, quality build, simple and reliable to use!",
                "reviewText": "This is expensive for its size, but punches above its weight in quality and speed & usefulness. It fits most things you'd want to cook in a small toaster oven and cooks/reheats fast and reliably with precise time control, and with no pre-heating required.I loved it so much, when my first one broke after a few years, I ordered another.I cook vegan burgers in it, turkey burgers (and anything like those), tofu, tempeh, onion rings, fries, small baking jobs, etc etc.And the best part is, it's metal inside so I'm not getting any of the toxics from all the plastics in most basket style air-fryers (and this is made better than most of those too).It's also extremely quiet while cooking, which is super nice.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Straight Up",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEC7YGINBJ7LU2JQFGZQSRDB7TRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SS4HC07B587?ASIN=B008C9UFDI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 23, 2021",
                "reviewTitle": "5.0 out of 5 stars Near perfect, missing one feature",
                "reviewText": "I have an Elite long slot pop-up toaster and a Gourmia 8 qt basket style air fryer. Those two have worked well and I've been happy with this setup. Still, I've always intrigued by the idea of a small super fast toaster oven.Counter space being limited I put the Elite pop-up toaster (crazy toaster, bread flies out of it) on the kitchen counter and my Gourmia air fryer in a back room. Both are always at the ready. Then I saw this deal and everyone raved so much I figured why not join the cult? I could get rid of the pop-up toaster and possibly the air fryer. Not so fast!Toasting: First impressions of the Panasonic, not overly impressed. The controls are a little wonky, but everyone knows this. It toasts more evenly than my pop-up toaster, but not incredibly so. Interestingly, my popup toaster is just as fast as the FlashExpress and easier to operate. There's no real toasting speed advantage (both take about 2 1/2 minutes) with the Panasonic over a regular pop-up toaster, it just makes better toast.Space: I thought the FlashExpress would fit on my counter, but you need 4 inches clearance at the back, whereas the pop-up toaster is a cool touch and sits neatly up against the wall. Sure the FlashExpress is small for a toaster oven, but the pop-up toaster takes up much less space. I ended up putting the Flash in the back room next to my air fryer and countertop pizza oven.Reheating: The Gourmia 8 qt air fryer is a better toaster oven for reheating certain items. It's just as fast if not faster and cooks more evenly and thoroughly. It's also more flexible as you can put just about anything in it and cleanup is a breeze. For anything saucy/messy I use foil pans/sheets. (Pro tip: Buy some of those grill mats and cut them to the size you need, instant durable non-stick mat for your toaster oven or air fryer). 9 inch foil pans and foil sheets fit in both. Cleaning the Panasonic could be difficult and you have to watch those infrared rods (cheese or other dripping items).For leftover pizza, cold or frozen, I use the air fryer. I put the slice on a foil sheet and hit start. It goes into pre-heat, but that's my cooking/re-heat cycle. When the sound goes off to add food the pizza is done and frequently over-done. I did the same with the Panasonic and selected 5 minutes. It was done in about 4 1/2 minutes. The air fryer was done in about the same, but I preferred the flavor and taste of the air fryer reheated slice. That said re-heating food is very good and easy in the Flash/Express.Cooking Time: It's fast for toast, but what about frozen items? You can do a small 9 inch frozen pizza in the Panasonic in 12 - 14 minutes. I have a Wisco pizza oven that cooks up to a 14 inch pizza in 14 minutes. Again, Panasonic's speed claims are based on comparisons to \"toaster ovens\". In my early tests the FlashExpress is not much faster than a pop-up toaster or an air fryer, but I still like it.Warnings: There are many standard typical warnings, but here's two that caught my eyeThe FlashExpress Owners Manual instructs not to \"bake bread with butter or jam. There is a chance the bread will catch fire\". It's an odd warning that your bread might catch on fire.How about this? \"After use: Turn off the unit by pressing the power button, The lamp goes out. Remove the power plug.\" Are you kidding? Every time you use it??? That's just not happening. I'm not going to do that and I imagine most people don't either. It's probably a liability issue or maybe somebody's oven caught fire just plugged in EEK!What I like:I do like that the toasting rack comes out when you open the door. It operates slickly and your food is easy to grab. Also, it does a really nice job toasting Mestemacher Vollkornbrot too. It's that weird, flat, dense, super healthy German bread that is IMO only good toasted. Pop-up toasters are not very good for this type of bread because it can fall apart or get stuck in the toaster. With the FlashExpress you can carefully top your flat bread with whatever you like and toast for about 4 - 5 minutes. It's outstanding for that. Also, the bright lights allow you to see your food so well it's the perfect \"melt\" machine, you can get that tuna melt just right. Add cheese a half minute before being done toasting and it will melt to perfection. Reheating items is excellent too because this toaster oven gives you such a good view of what you're cooking that you can stop it before overcooking.What I don't like: It's missing one feature. This toaster would be perfect if it had a broil or \"bagel\" function. Sometimes you want to toast only one side of bread or just melt with the top element. Sadly, you can't do it as there's no ability to cook with only the top element. You could use the pan to block the lower elements but it would be better if it had the controls to just shut it off.The lights are super bright and it is odd when they cycle and turn on and off over and over. When using the presets for toasting they stay on, but if you to a timed \"bake\" selecting temperature and time they cycle on and off. It's like there's a scientific experiment being performed. The manufacturer warns not to stare at the light rods, they say it's bad for the eyes. I'll defer to them on this one.In summary, it generally does what they say it does, and it has a very good track record. If you're in the market for a small speedy toaster oven this is it (or the Breville Mini). I caught this deal and paid $84. I wouldn't pay the $119 price. The FlashExpress is not replacement for an air fryer but some people don't need an air fryer. I've been testing all kinds of food in it and I'm definitely keeping it. It's interesting and a lot different than any other toaster oven I've used. It's actually fun to use, something I would have never thought I'd say about a small appliance.",
                "reviewVotes": "164 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "IRIS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 9, 2023",
                "reviewTitle": "So easy and quick!",
                "reviewText": "Simple and safe enough for my 10 years old to toast his own bread in the morning.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 20, 2021",
                "reviewTitle": "Perfect Toaster Oven!",
                "reviewText": "I absolutely LOVE this toaster oven! It’s the perfect size and excellent quality. I looked at so many toaster ovens on line but it’s hard to find one that’s actually good at making toast! I have an oven so I don’t need to make a cake or whole chicken in my toaster oven. I wanted a toaster oven to cook small things that I don’t want to heat up a whole oven for and toast. This is perfection! I love the controls along the bottom. Very easy to use. Heats up fast. Comes with a good quality tray. Looks amazing on my coin! Came super fast and well packed. Love it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rosita",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 25, 2020",
                "reviewTitle": "Muy satisfecha y contenta con el horno/tostador",
                "reviewText": "Es un horno tostador excelente por su tamaño, tecnología y funcionalidad. Es además estético y muy completo: funciones predeterminadas, conversión visible de grados F/C , luz y un tamaño excelente. Estoy muy satisfecha de la compra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Bournival",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 16, 2021",
                "reviewTitle": "This is a little marvel of an oven",
                "reviewText": "This mini oven is kind of magic; the flash element is very bright and gets the oven very warm almost instantly; no need to preheat. Compared to my convection oven I save almost 15 minutes at the highest temperatures. It is really fast to cook or reheat. You have to be careful when reheating food because that flash element can burn fast. On the down side, the controls for toast colour and time are a bit rudimentary and there's a 30 minutes limit. Cleaning the oven and grill is easy but the provided metal tray got brown and there's no way I found to get rid of the stains. Also, this is a small oven so space and height is limited inside. This oven is great to warm up food and bread, toast of any size, pizza and the top to keep warm plates. Great to reheat frozen french fries or any type of frozen fried food. They say not to use cooking paper but if you are careful, you can use it too. A great mini oven for the kitchen.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gunnar Ehlert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 14, 2021",
                "reviewTitle": "Me encantó",
                "reviewText": "Muy buen horno eléctrico, potente, los programas predeterminados si funcionan, de tamaño no tan convenció al pero bastante útil.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}