{
    "remaining_requests": 35297,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Breville-BOV800XL-1800-Watt-Convection-Toaster/dp/B001L5TVGW",
    "body": {
        "name": "Breville Smart Oven Toaster Oven, Brushed Stainless Steel, BOV800XL",
        "price": "$269.95$210.55",
        "originalPrice": "$269.95",
        "rawPrice": 269.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Breville-BOV800XL-1800-Watt-Convection-Toaster/dp/B001L5TVGW",
        "soldBy": {
            "sellerID": "A1RHZSN6VRQHCL",
            "name": "Everything Kitchens",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1RHZSN6VRQHCL&asin=B001L5TVGW&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "Only 2 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41jPEjCQ3fL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41XVub5ih7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41D5Sa0CtBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rFMFUUt4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rZPSW15VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515SEvhYaAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oi-LcunAL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Breville Store",
            "link": "https://www.amazon.com/stores/Breville/page/EBBDE160-83A6-4DE3-A1B2-C27D03CABFF6?ref_=ast_bln"
        },
        "brand": "Breville",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 8275,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 21 hrs 12 mins.",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The Breville Smart Oven with Element iQ System is for the home cook who needs a convection countertop oven with high performance and versatility; Reduce your cooking time by up to 30% using the convection setting and choose from 9 cooking functions.Voltage : 110–120 Volts.",
            "ELEMENT iQ SYSTEM: Using 5 independent quartz elements, smart algorithms steer power to where and when it's needed to create the ideal cooking environment for perfect results every time; Fast 1800 Watt preheat gets your meals on the table more quickly",
            "CONVECTION POWERED: The Smart Oven's convection setting reduces cooking time by up to 30%; An inbuilt fan circulates the hot air within the oven which speeds the cooking process by raising hotter air and sinking colder, less dense air for quicker heating",
            "9 COOKING FUNCTIONS: versatile countertop oven with 9 cooking functions to guide you to perfection: Toast, Bagel, Bake, Roast, Broil, Pizza, Cookies, Reheat and Warm",
            "LARGE CAPACITY: Large 18.5 x 15.7 x 11.1 inch interior with enough room for 6 slices of bread, 6 cup muffin tray and a 13 inch pizza, made to perfection",
            "LCD DISPLAY: LCD display to easily access the built in smart functionality, choose from 9 cooking functions; The LCD also indicates when pre-heat has completed and automatically begins to count down on the cooking time for perfect results",
            "NON STICK CAVITY COATING: The walls on the inside of the oven feature a non stick coating for easy cleaning",
            "INCLUDED ACCESSORIES: 12 x 12 inch Enamel Baking Pan; 12 x12 inch Enamel Broiling Rack and 13 inch Non-Stick Pizza Pan",
            "WARRANTY: 1 Year Limited Product Warranty; Power: 1800 Watts; Voltage: 110 to 120 Volts",
            "Place the oven on a flat, dry surface. Ensure there is a minimum distance of 4” (10cm) of space on both sides of the appliance."
        ],
        "description": "Every Breville product begins with a simple moment of brilliance. The Breville Smart Oven began with the simple fact that different foods require different methods of heating: some, like baked goods, need to be cooked evenly; others, like meats, need to be seared on top. Most toaster ovens fail to distribute heat in a consistent way throughout their interiors, let alone change heat distribution to suit the different foods being prepared. This is how the Breville Smart Oven stands apart: whatever the food, it adjusts its heat distribution for perfect results. The Smart Oven is equipped with Element IQ cooking technology, which adjusts the power of the five individual quartz heating elements to cook food more evenly and quickly. This sophisticated heating system distributes heat throughout the oven when and where it is needed, to guarantee more efficient cooking. Nine different menu options allow users to choose the best setting for the food they are cooking. In addition to dynamically distributing heat to different areas, the Smart Oven can adjust the wattage of its heating elements for even more cooking flexibility. Most ovens have elements with fixed wattage that can only switch between ON and OFF, but Element IQ functions much like a dimmer on a light switch, increasing or decreasing element power with a simple turn of the knob. For example, broiling requires high heat from above in order to melt and brown, so the Smart Oven activates 1500W of high heat from the top elements of the oven. On the other hand, toast needs to be cooked evenly on both sides without drying out the inside, so the Smart Oven uses high radiated heat from above and below (1800W distributed between four elements) to crisp the outside quickly. Baking utilizes another feature of the Smart Oven that contributes to even heating: convection heating. Convection cooking uses a fan to circulate hot air so all sides of the food cook at the same rate. This is particularly important for baked goods, such as cookies and cakes, which need to be cooked evenly all the way through. Each of these nine functions is preset with recommended settings, taking the guesswork out of cooking. However, each can be customized according to recipe, volume of food, or personal taste. Customized settings will remain in the memory of the oven until changed or until the oven is unplugged from the wall outlet, streamlining your cooking process. The Smart Oven is carefully constructed from the most durable materials. It is attractively housed in Reinforced stainless steel, a striking addition to any kitchen. The elements themselves are composed of quartz, rather than the metal elements found in other toaster ovens. Quartz responds more quickly to heat change, which results in more even heating throughout the oven. The roomy interior is coated with a non-stick material that can safely withstand high temperatures, making cleanup easier. A crumb/drip tray that is accessible from the front of the oven (rather than the back, like many other toaster ovens) also makes it easier to clean between cooking sessions. In addition, the oven includes a patented magnetic auto-eject rack: small magnets embedded on the sides of the oven door pull the wire rack halfway from the oven when the door is opened, making food easier to remove and preventing burns. At 18.5 x16.25 x11.25 inches, the Breville Smart Oven is not too small but not too large. It is larger than most toaster ovens, with space to comfortably fit six slices of toast, a 13-inch pizza, or a whole Chicken. However, as a countertop convection oven, it is more space-efficient than a conventional wall oven. A smaller oven means less time to heat up and less time to cook, perfect for preparing a meal in a hurry (or for cooks who like to create in the heat of the moment). This also translates into a cooler kitchen (particularly convenient in the hot summer months) and less energy consumed.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Toaster Ovens",
                "link": "https://www.amazon.com/Toaster-Ovens-Toasters-Small-Appliances/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289937"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Breville"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Product Dimensions",
                "value": "11.1\"D x 18.5\"W x 15.7\"H"
            },
            {
                "name": "Special Feature",
                "value": "Programmable"
            },
            {
                "name": "Control Type",
                "value": "Knob Control"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Breville BOV800XL Smart Oven 1800-Watt Convection Toaster Oven with Element IQ, Silver"
            },
            {
                "name": "Model Name",
                "value": "BOV800XL"
            },
            {
                "name": "Finish Type",
                "value": "Polished"
            },
            {
                "name": "Power Source",
                "value": "Air-Powered"
            },
            {
                "name": "Cable Length",
                "value": "3 Feet"
            },
            {
                "name": "Item Weight",
                "value": "1 pounds"
            },
            {
                "name": "Department",
                "value": "unisex"
            },
            {
                "name": "Manufacturer",
                "value": "Breville"
            },
            {
                "name": "ASIN",
                "value": "B001L5TVGW"
            },
            {
                "name": "Item model number",
                "value": "BOV800XL"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 8,275 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,327 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #30 in Toaster Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "November 14, 2008"
            },
            {
                "name": "Capacity 0.8 Cubic Feet",
                "value": "Wattage 1800 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 1 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page To Guide You to Perfection Toast 6 slices, Bagel, Bake, Roast, Broil, Pizza, Cookies, Reheat and Warm To Steer Power Where It's Needed Smart algorithms create the ideal cooking environment, for perfect, crispy golden results Inbuilt Fan Circulates Hot Air Convection speeds the cooking process by raising hotter air & sinking colder air for quicker heating To Easily Access Functionalities LCD display to more easily access the built in smart functionality, choose from 9 cooking functions Next page 1 9 Smart Cooking Functions 2 Element iQ System 3 Convection Powered 4 LCD Display",
                "media_link": []
            },
            {
                "media_text": "Choose your oven 9 cooking functions Settings 10 cooking functions 6 Slices; 13\" Pizza Capacity 6 Slices; 13\" Pizza Convection Powered Element IQ System LCD Display 9 cooking functions Settings 8 cooking functions 6 Slices; 13\" Pizza Capacity 4 Slices; 12\" Pizza Convection Powered Element IQ System LCD Display 9 cooking functions Settings 8 cooking functions 6 Slices; 13\" Pizza Capacity 4 Slices; 11\" Pizza Convection Powered Element IQ System LCD Display",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28862193-6f97-476d-9c00-6885879773ea.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ce1003d-dfa0-4c65-a3a0-5719b39b44fb.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d618925-2358-4c63-a9d3-551f36306bb4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c081c5f2-d7ae-422a-882f-06e1e37ea838.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3b39349-1d6c-4bb9-af68-14dc703cd358.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c338ec61-c2dd-448b-8dfd-d2a5f36f019a.__CR0,0,488,700_PT0_SX488_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4c0678ec-5bd6-41c9-b14a-17f383097c71.__CR0,0,488,700_PT0_SX488_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4dde0ad-54e4-46a1-a922-7f7489e01b26.__CR0,0,488,700_PT0_SX488_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Karl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGECWBJ6EUXJSGUYAS7EMJLURWNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UYCHHXEOVGTG?ASIN=B001L5TVGW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2008",
                "reviewTitle": "5.0 out of 5 stars Beauty and Function - What more can you ask for?",
                "reviewText": "I love this product - it is a pleasure to use, functions beautifully, and is beautifully designed.The other reviewers have already said much of what I would have written. The 'Out of Box Experience' is superb. As another reviewer noted, the packaging is quite a bit like Apple's (see photos) - attractive graphics on an inner box protected in an outer, recyclable box. The oven itself, when compared to the Cuisinart TOB-165 that we have been using (or even the stainless steel TOB-195 model), is like comparing an Apple Mac to a Dell: visually more stylish and appealing, better engineered 'guts', and once operated, functionally very well thought out.A few years ago, our old toaster oven died and we migrated to the Cuisinart which, like this Breville BOV800XL, is a convection oven / toaster / broiler. We liked it so much, that we gifted several more to friends and family. Ah, if only this Breville had ben available then...The Breville is so vastly superior in every way - function, capacity, ease of use, and ease of cleaning. I cannot recommend it highly enough.The timer on the Breville turns the oven off at the end of any kind of cycle as you would expect - toast, bagel, bake, broil, pizza, etc.This is hugely wonderful compared to the Cuisinart unit which only turns itself off after toasting - you have to remember to turn it off when in any other mode. (The Cuisinart's timer is 'dumb' - just a beeper.) Also, each Breville cycle has smart default settings, and can remember your own settings for temperature and time, or slices (toast) and darkness, etc.The BOV800XL accomodates a 13\" pizza pan (included). We made two pizzas tonight to test the oven, one fresh (deli) the other frozen. I dialed the 'pizza' setting, dropped the default 450 temperature to 425, accepted convection mode, and accepted the default 12\" size for the fresh pizza and pressed the on button. Once preheated, the oven beeped for the pizza to be inserted. At the end of the timed cycle, the oven turned off and beeped again: perfect pizza!I then did a 9\" frozen Amy's pizza. Similar procedure as above, but dialed the size knob down to 9\" and pressed the 'frozen food' button. Again, perfect at the end of the cycle.Toast setting works great - up to 6 pieces of toast, as does the bagel setting, which toasts the top at a higher temp then the bottom to make the top crispy and the bottom warm but still soft. Frozen waffles come out great - crunchy outside and moist inside, instead of all dried out.For baking, a 13\" x 9\" baking pan easily fits inside as does, of course, the larger pan that comes with the unit, loaf pans and small muffin pans.The glass door conveniently labels the three rack positions for broil, toast/cookie/bagel/pizza, and bake/roast/reheat/warm.The crystalline-looking heating elements (three on top, two on the bottom) seem to heat faster, and more evenly, than the metallic elements in other counter-top ovens. Depending on the mode/cycle, the oven enables or disables certain elements, and changes the wattage of others.The crumb tray in the front answer another of my big complaints about the Cuininart. No effort to pull the tray out at any time to brush off crumbs, or wash off accidental spills. (The Cuinsart's crumb tray slides out of the rear of that unit, requiring minor gymnastics - enough to put it off until it is really gross.)The stainless finish and assembly is of high quality, and the oversized handle and control knobs give a feel of quality as well (and match current upper to high end major appliances).No doubt I'll have more comments after we use the Breville BOV800XL for a few months, but for now, I can only sing its praises.----------Boring details:Dimension Comparison to Cuisinart TOB-165/195:The Breville being slightly larger permits it to be used for items that otherwise would have to go into a regular oven. The interior of the Breville is 13 1/2\" x 11 1/2\" x 5\" high (to clear the elements), with a curved recess in the back so that a nearly 13\" pizza pan fits. The Cuisinart is 11 1/2\" x 9 3/4\" x 5\" which cannot accommodate pizza, nor a 13 x 9 pan and toasts only 4 pieces of bread.The small increase in interior space which results in so much greater versatility is at the expense of only an inch of counter space required. The Breville exterior is roughly 18 1/2\" wide x 16\" deep x 10 3/4\" high compared to the Cuisinart 17 1/2\" wide x 14\" deep x 10\" high.Electrical Notes:As others note, the oven uses a maximum of 1800 watts, which is basically all that a 15 amp circuit has to offer (most home kitchens will have either 15 or 20 amp circuits). So, you shouldn't use other power hungry appliances on the same circuit as the BOV800XL. As noted in the owner's manual, you must have a grounded 3-prong outlet, which any modern home will have. Even though my kitchen is 20 years old, I'm fortunate that the electrician had included three circuits for appliances so no problems here.With regard to those concerned about the short cord: do note that electrical codes require that outlets on kitchen counters be serviced by a minimum of two separate circuits and be no more than 2 feet from one another (4 feet at a corner). Even under older codes that permit outlets up to 6' apart, the 3' cord is adequate.Installation note:This is a countertop oven. When operating, nothing should be within 4\" of any side. Because some people are accustomed to GE/Black and Decker toaster ovens that mount under cabinets, do note that that is NOT an option here because of the high heat and clearances required. You really do need to have enough counter space to accommodate the unit.UPDATE November 2014: the door spring broke today, so the door flops open. That mine lasted almost 6 years of daily use is remarkable as I read many reports of other people's springs breaking after 3 or 4 years of use. This is painful to repair...as so many screws have to be removed and contortions with the dangerously sharp metal case performed. Steps can be found online. Heading to a hardware store tomorrow to find a close match to the spring. My old spring broke on BOTH ends. Given that I got 6 years out of the oven, I won't reduce my 5 star review, although I feel that an item this expensive should be easier to repair.",
                "reviewVotes": "1,352 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJ6UHXFF3T2Q3XB7SP52767HZLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HUE0AUG4YTWO?ASIN=B001L5TVGW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2010",
                "reviewTitle": "5.0 out of 5 stars More Lexus than Fararri - Intuitive, Quality Construction, Simple Elegance",
                "reviewText": "After fairly extensive research, this is the single best toaster oven on the market, and if you can afford the price tag, totally 100% worth it. I bought one and loved it. I gave one to my sister for her birthday and quickly it became the desired item within my family ... In the end I think I purchased 5 of them. I love well-designed products with simple interfaces. Analog toasters have a nice simple interface - time, temp, mode (toast / bake / broil). Digital toasters have better components, but tend to have cluttered and unintuitive interfaces. This Breville toaster is a nice blend between the two. The interface is at least as intuitive as a simple analog toaster, but the quality is so much higher.Pro: * Construction Quality - The construction quality is excellent. It has a solid feel and is aesthetically quite pleasing. The handle is nice and wide, and despite a few reviews that mentioned issues with burning one's hand while opening the toaster, I've never had an issue, nor do I fully understand how that would be possible. The door is balanced such that it opens easily, yet doesn't fall into the counter if you let it go. The elements are ridiculously over-engineered. My previous $50 toasters would burn out after a few years when the elements wore out. Due to the quality of the quartz elements, I don't envision ever having that issue with this device. It seems solid and built to last. And the quality and sturdiness provide a simple beauty that makes the over pleasant to look at and use. * Design & Aesthetics: Controls - The four controls are intuitive and simple - time, temp, mode, GO. The digitized rotating knobs are faster, more intuitive, and more pleasant than the crappy up/down buttons or number-pad found on most other digital devices. Toast longer? Spin the bottom knob. Toast hotter? Spin the top knob. Toast the same as last time? Press GO. Rather than spinning freely, each knob has discrete positions that are subtle but can be felt tactilely. Most of the time my oven sits at a single setting, and I just press the GO button, and it works with the simplicity of an old-fashioned toaster. The \"GO\" button is also the \"STOP\" button - when running, the GO button instantly lights up a red perimeter, making it blindingly obvious ... toggle it back and forth like a light switch and there will be zero confusion what is happening. * Design & Aesthetics: Display - The display is large, high-contrast, and uncluttered. When idle, the screen is passive, readable with the lights on, but emitting no light of it's own. Touch any control and the display lights up, readable at any light and or sobriety level. * Design & Aesthetics: Racks&Magnets - The magnetic bits on the door cause the rack to pull out about half-way when opening the oven -- this is a nice touch and very convenient in a subtle way that you don't even notice after a few days. I was a bit surprised at my parent's house when the rack _didn't_ pop out, and I had to reach into the oven to pull out a piece of toast. To me, that is the hallmark of this device, and indeed of any truly well designed consumer appliance - you stop noticing the features that were so deliberately engineered into it and use it intuitively. For a longer discourse on the subject, check out \"The design of everyday things\" by Donald Norman. * 5 High Quality Heating Elements - The 5 elements are excellent. Being a bit wider, they distribute heat more evenly. They heat up quickly and do a good job maintaining consistent temp. Bread will toast consistently to the same level every time and evenly across the surface. As if that wasn't enough precision, Breville added something called \"ElementIQ\", basically a fancy branding name for the logic that reduces toasting time when the toaster starts hot, providing fairly consistent results between the 1st set of toast and the 2nd despite the difference in starting conditions (cold-start vs hot-start). They did that right too; the adjustment happens at the beginning and time is still counted in seconds for the actual toasting session. Want something to keep toasting for longer? Just spin the time knob to the right and the \"seconds remaining\" will keep going up. * Like a Swiss Army knife, closed. - The oven has lots of \"features\" - broiling, multi-hour convection baking, a bagel mode, etc - but these modes are all subjugated under that smaller \"mode\" knob. You could probably bake a turkey in this oven, but I have a real oven for that. 99.99% of the time it sits in \"toast\" mode and does what any $50 toaster would do, just with more elegance, precision, and consistency. If you are looking for one of those ovens that can multitask, that box is definitely ticked. The other modes are intuitive too. Rotate the mode knob and the display shows the list of 10 or so different ways to heat food. The mode list is one level deep, so no complicated submodes or \"settings\" or anything like that.Con:* The one surprise I had was that there is no \"full power\" mode. Toast is the only mode to use all 5 elements, but refuses to use convection. The convection modes use 4 or fewer elements. Also, toasting temp is measured in slices of bread up to 9, vs the degF temp for the baking modes. In the first week I had the device, I really wanted to put it through it's paces and run it on HIGH with convection and watch it do to a piece of bread what a magnifying glass under the sun does to an ant. :). This is sadly not possible. Even on toast on the highest temp setting, the device does not run at full power. It uses those 1800 watts to come to temp really quickly, but 1800 watts continuous would probably exceed the design temp by quite a lot and melt something metal. Don't worry, it will toast quite well. After the first week, I stopped caring about seeing how much power I could pump into one unsuspecting starch vessel, put the toaster on medium (~6 of 9), and let it give consistent tasty results every morning. I guess that makes this toaster more Lexus than Fararri.There are a bunch of other high price premium toasters on the market sporting a variety of features. None of them seem to have the same elegance, simplicity and thought-through design. Buying a basic $50 analog controlled toaster makes sense if you want to be frugal. But if you want to take a step up and own a nice appliance, you won't regret this choice. Just don't make the mistake of splurging $200 on a half-assed hack that has whizz-bang features poorly implemented. This is the only high-end toaster I've come across that justifies paying a premium.Well done Breville. In a world with very few truly well designed products, this is one. Then again, at 5x the price point, it damn well should be.",
                "reviewVotes": "49 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 24, 2016",
                "reviewTitle": "hay que ingeniárselas para conseguir recetas para horno de convección, pero...",
                "reviewText": "Es un horno estupendo. Tengo dos semanas con él. Amazon entregó en tiempo y forma.Es una pequeña gran inversión y vale la pena. Las indicaciones en español, la conversión de grados F a C, el sistema de convección que lo caracteriza, funciona muy bien...Me gustaría complementar con otra rejilla para poder sacar más provecho a todo el horno.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dannymackinnon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 11, 2015",
                "reviewTitle": "Quality Product",
                "reviewText": "I've been using this toaster oven for over five months now and in my opinion it's great. I had a cheaper and smaller one before this and while it was sufficient, this model beats it in every department from quality of construction to ease of use. It has a large easy to read screen with many adjustable presets for different cooking options. It's the perfect size for a single person or couple and I barely use my regular oven anymore which saves on energy and time since this toaster oven quickly preheats and cooks food faster compared to regular ovens. It can also replace your regular toaster if counter space is tight and can toast six slices of regular sized bread at once. It also has a large removable crumb tray which makes clean up a breeze. The only limitations I have with this toaster oven is when I'm cooking large batches of baked goods or a turkey or ham, otherwise I cook everything else in this toaster oven. Included with the toaster oven is one wire rack, one 13 inch pizza pan and one baking pan with a removable broiler insert.Pros:Easy to useQuality constructionRoomyQuick and even cookingLooks goodCons:Fairly large size might be a problem with limited counter spaceMore expensive then other toaster ovens but you do get what you pay forMight not be big enough when cooking for several people but that problem is inherent with all toaster ovens",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RUL ROME",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 6, 2020",
                "reviewTitle": "Si buscan horno eléctrico esta es la única opcion",
                "reviewText": "Excelente producto lo mejor en hornos",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claire Hatch",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 2, 2013",
                "reviewTitle": "Exactly what I was looking for. Compact, quick, doesn't heat up the kitchen",
                "reviewText": "I needed a small oven as we are now a family of two and I do not like to turn on my big oven for small portions. I needed to be able to roast, bake and grill (broil) and I have always wanted to have convection. I got all of this in one small oven. I was worried that it might not fit on my limited counter space but there was no problem finding a space and it fits in nicely. I have had the oven for approximately 3 weeks and have used it at least once a day, if not twice. I have baked muffins, made croutons, broiled tenderloin steaks, roasted tomatoes, baked bread, and so many other things. Every function worked beautifully for my purpose. I have only used it for toast once and am happy to continue to use a toaster as we only do 1 piece of bread at a time so no need to warm up this oven. It did toast nicely though.Cleaning is easy. The pans that come with the appliance just wipe clean, even with burnt on fat (eg roasted tomatoes and broiled steak) - a delight.I would say this oven is ideal for empty nesters or newlyweds but am not sure how it might fit into a larger families' lifestyle. Also, I have yet to see an electric bill - my other oven is gas and I didn't use it often so there may be a slight increase in energy usage. Its worth it.Overall the best I could have hoped for.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeduan Cornejo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 20, 2015",
                "reviewTitle": "La mejor compra de electrodoméstico que he hecho",
                "reviewText": "Tengo este horno desde hace 4 meses y lo uso a diario. Desde pan tostado que sale increíble hasta hacer pollos enteros, pizza, albóndigas o cualquier cosa que necesite una cocción precisa. Desde que tengo este horno hemos cocinado mucho mas en casa y estamos comiendo más sano. Muy recomendado.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$269.95",
                "sellerName": "Peppercorn",
                "sellerRating": "5"
            },
            {
                "price": "$269.95",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            },
            {
                "price": "$269.95",
                "sellerName": "Chefs Corner Store",
                "sellerRating": "4.5"
            }
        ]
    }
}