{
    "remaining_requests": 35230,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/WerkWeit-Toaster-Oven-Convection-Functionality/dp/B0BW8JY2KR",
    "body": {
        "name": "WerkWeit Toaster Oven - 38QT XXL Convection Oven Stainless steel Countertop Oven with 9-in-1 Functionality, Digital Control, Eco Display Mode & Larger Interior Capacity",
        "price": "$129.99",
        "originalPrice": "$159.99",
        "rawPrice": 129.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/WerkWeit-Toaster-Oven-Convection-Functionality/dp/B0BW8JY2KR",
        "soldBy": {
            "sellerID": "A187GE3LU0HE29",
            "name": "dapei mall",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A187GE3LU0HE29&asin=B0BW8JY2KR&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $10 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51xS9kotHjL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51s6sdpDpUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51G5aikJ2kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hEAMRawvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5180YRVP60L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F4oAT9DFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1FCcwPqxmL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: WerkWeit",
            "link": "https://www.amazon.com/WerkWeit/b/ref=bl_dp_s_web_23567351011?ie=UTF8&node=23567351011&field-lbr_brands_browse-bin=WerkWeit"
        },
        "brand": "WerkWeit",
        "merchantInfo": "dapei mall",
        "customerReview": "3.6 out of 5 stars",
        "customerReviewCount": 25,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Saturday, February 17. Order within 9 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The WerkWeit toaster oven is a must-have kitchen essential for anyone who wants to cook quick and healthy meals. This versatile appliance doubles up as a toaster oven, oven, convection oven countertop, countertop oven, and roaster oven, ensuring you have all the functions to cook an array of dishes.",
            "With a massive 38QT interior capacity, this oven offers more than enough space to cook for the entire family. The 9-in-1 functionality enables you to bake, broil, roast, toast, dehydrate, reheat, convection cook and more. Whether you're making your favourite crispy chicken wings or dehydrating fruits, this oven can do it all with ease.",
            "The convection function ensures that heat is evenly distributed throughout the oven cavity, so all your food cooks thoroughly, evenly, and quickly. Its digital control simplifies the cooking process and lets you control everything with just a touch, making the oven easy to operate even for beginners.",
            "Plus, the Eco display mode helps you save power by turning off the display, which is a great feature for those who are environmentally conscious. With a stainless-steel body, this appliance is durable and complements any kitchen décor. The WerkWeit toaster oven is an excellent addition to any home and perfect for those who are looking for an all-in-one appliance to cook delicious, healthy meals.",
            "With a spacious 38QT interior capacity, this countertop oven allows you to cook larger portions of your favorite dishes in one go. Enjoy perfectly cooked and evenly heated meals thanks to the oven's convection function, optimizing airflow for fast and delicious results."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Convection Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289934"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "WerkWeit"
            },
            {
                "name": "Product Dimensions",
                "value": "13.38\"D x 19.48\"W x 13\"H"
            },
            {
                "name": "Special Feature",
                "value": "Temperature Control"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Item Weight",
                "value": "24.6 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0BW8JY2KR"
            },
            {
                "name": "Customer Reviews",
                "value": "3.6 3.6 out of 5 stars 25 ratings 3.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#430,851 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #147 in Convection Ovens"
            },
            {
                "name": "Date First Available",
                "value": "February 20, 2023"
            },
            {
                "name": "Capacity 38 Quarts",
                "value": "Wattage 1400 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Finish Type Stainless Steel"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0960b60c-7a0e-4160-b08c-5adfad798a99.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a640c0d7-bd4f-46b9-938f-529d40f5af4c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bcda69ce-1745-407d-b8a3-ae32e44b72ff.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ecfbe85-df82-48a0-89f4-560e1cc10143.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1b8390ec-e41e-45eb-82ca-4504ea17bc39.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Debby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYUURZRLPAJQN3IYM3UGC5OJTYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25ZDZ67A1UD20?ASIN=B0BW8JY2KR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Very nice - heavy duty!",
                "reviewText": "This toaster oven/air fryer has so versatile and I love that it has a rotisserie setting! It was a little intimidating at first, but it is very easy to learn how to use it. The instructions are very easy to understand, and they are very helpful. It is large and takes up a good bit of counter space. It is very nice not to have to heat up the whole kitchen though to make toast, air fry some veggies or even rotisserie a whole chicken!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marlene T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUC3M5QUAHYEGOOMWEWIJRZG4VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BMSRGTAM5OPW?ASIN=B0BW8JY2KR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars simple, basic toaster oven, nothing fancy",
                "reviewText": "This is very simple to use. It is very basic with no fancy features added. It has four displays with knobs in a column on the right side. Two are for the temperature, one is for the timer and the bottom one is for the function that is needed. The knobs are turned to set temp and timer and function. After set, push in knob. The food should already be in oven and then it will start heating up. Once it's heated up it will start cooking. It is large, can hold a whole rotisserie chicken, so it does take up a lot of counter space. It took a while to get used to each function because it's a little difficult to figure out the pictures.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lurline Breeden",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMOQN4AK6OOVBJZKRGHDNRK7JCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRSGO98AUN49L?ASIN=B0BW8JY2KR",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2023",
                "reviewTitle": "3.0 out of 5 stars Size",
                "reviewText": "The performance on this oven is good. Unfortunately for me, the oven isn’t big enough to hold many of my baking dishes and pans.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Santos",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF32RWYPIVVAGKP5RMFVV6F3SDRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B8B3Q16ZREWR?ASIN=B0BW8JY2KR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 2, 2023",
                "reviewTitle": "5.0 out of 5 stars I simply love this oven!",
                "reviewText": "This is truly a great tabletop oven. It is easy to use and has plenty of space to easily cook large meals for a family of four. With the different modes you can bake, roast, air fry, toast, defrost and more. I love enjoy making pizza from scratch at home so the pizza mode was the first thing I tried when it arrived. The pizza came out perfect, of course I paid attention to it the entire time since it was my first time using it but the pizza came out great. Overall great oven and I can’t wait to cook more meals in it. Next I’m trying the chicken mode, hopefully is works just as good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LegoGirlLegoGirl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMDTFJO3CTOGPMZ44NFZ7262ULA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G9BH97XQQ7HF?ASIN=B0BW8JY2KR",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2023",
                "reviewTitle": "2.0 out of 5 stars Aggravatingly complex",
                "reviewText": "The media could not be loaded. Cutting to the chase: First, appliance has great capacity, but the overly complex buttons/dials for usage make it a no-go for my household. Second, takes a long time to heat up yet is scorching hot to touch in use. Last, every element feels lightweight and cheap. More details below, but there's no reason to choose this toaster oven---especially if you have kids or elderly people in your family.Getting it out of the box I was shocked and concerned at how lightweight it is, considering the large size. Every bit of it of feels cheap and thin (which could be why it gets so hot to the touch when in use). At first glance it looks super-high-tech but the handles/knobs/door all feel more like a kid's toy and not an appliance going for over two hundred bucks.There are way too many options for cooking. You can choose top or bottom heat or both; dough proofing; defrost; or rotisserie. And there are additional presets for pizza and toast. The bottom dial has the main options, with only small icons to choose from (no words). There are additional buttons to press for convection and rotation (for rotisserie). If you want specific temperatures and time then you have to also set those dials separately. Way too much input required!This is described as \"digital\" but that really just means \"digital display.\" There's no keypad to type in temp/time, you have to manually turn little knobs to roll the numbers up or down.The process to start the machine is confusing. Several times someone thought they had the machine turned on, only to realize it never did anything while waiting for all the inputs to be set. When the machine is preheating, the timer flashes wholly; when it reaches the desired temperature it starts the timer countdown and flashes just the right-hand digit. The standby on/off button flashes CONSTANTLY when it's plugged in, super annoying. Timer is in minutes but for defrost/proof mode it's hours, what why?If you need the oven to preheat, then realize it takes a long time (almost as long as my giant wall oven). Just to get to 350F it took between 10-15 minutes. Heating it up for pizza is ridiculously long. It flashes the timer button while preheating and beeps when it's ready. You're not supposed to press the convection fan button while it's preheating, so that's another step you'll probably forget to do when it's time to put the food inside. And be careful, touch the door or almost any other part (including the handle) and you risk a burn!The instruction manual is the typical nonsense that looks like it was written with AI using Google Translate. Comes with an additional recipe book that's not specific to this toaster oven at all.As for how it cooks, during the 2 weeks I had this in use, we cooked: pizza, toast, frozen chicken strips, cinnamon rolls, brownies, chicken casserole; plus reheating various things. In no case was the result super-fantastic or better than the older GE Toaster Oven it replaced (and that one also had air-fry), the food was fine but not worth all the hassle.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/812HgVS7kbL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/825251c1-a61d-4a09-9e1c-e5e4ea7b701e/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "dave",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHY3NITZK676OUUFIHCV6XMHA7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R83B5FQFF4MKF?ASIN=B0BW8JY2KR",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "1.0 out of 5 stars Not Functional",
                "reviewText": "This \"oven\" is more like a toy or high school science project. It is hard to use,impossible to understand functions,cheaply made and gimmicky",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tissues and RainbowsTissues and Rainbows",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOJCWQBZRRTMFHAUSQ2DXETLQFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15O7MKF1B5VIV?ASIN=B0BW8JY2KR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Large capacity and lots of features",
                "reviewText": "I love my WerkWeit Air Fryer Toaster Oven! It's so easy to use and it makes everything crispy and delicious. I can cook a whole chicken in 38QT of space, or make toast and bagels for breakfast. It has a digital display and a timer, so I don't have to worry about overcooking or burning anything. It also comes with a recipe book and some accessories, like a rotisserie spit and a baking tray. It's definitely worth the money and I would recommend it to anyone who loves fried food but wants to eat healthier.I bought the WerkWeit 38QT Air Fryer Toaster Oven a few weeks ago and I'm very happy with it. It's a versatile appliance that can do everything from air frying, baking, roasting, toasting, and even dehydrating. It has a large capacity that can fit a whole chicken, a 12-inch pizza, or four slices of bread. It also has a digital display and easy-to-use buttons and knobs that let you choose from nine preset functions or customize the time and temperature. The air fryer function works well and makes crispy food without using much oil. The oven also heats up quickly and evenly, and has a light that lets you see inside. The accessories are dishwasher-safe and easy to clean. The only downside is that it's quite bulky and takes up a lot of counter space. But if you're looking for a multifunctional air fryer toaster oven that can handle large batches of food, this is a great option. It's a little pricey but feature rich and I would recommend it to anyone who loves fried food but wants to eat healthier.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/713lGci3rIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71f9KTqWt9L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71h96NhSPPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71p4g9Y4tCL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}