{
    "remaining_requests": 35294,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cuisinart-TOB-260N1-Convection-Toaster-Stainless/dp/B01M0AWSJX",
    "body": {
        "name": "Cuisinart Convection Toaster Oven, Stainless Steel, TOB-260N1",
        "price": "$225.49",
        "originalPrice": "$299.95",
        "rawPrice": 225.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cuisinart-TOB-260N1-Convection-Toaster-Stainless/dp/B01M0AWSJX",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08GKKTNN5"
        ],
        "asinVariationValues": [
            {
                "asin": "B01M0AWSJX",
                "variationName": "Style",
                "variationValue": "Oven",
                "price": "$225.49",
                "variationImageURL": ""
            },
            {
                "asin": "B09W9G8X9V",
                "variationName": "Style",
                "variationValue": "Oven + Basket",
                "price": "$245.44",
                "variationImageURL": ""
            },
            {
                "asin": "B0C983MGRT",
                "variationName": "Style",
                "variationValue": "Oven + Burner, Stainless Steel",
                "price": "$279.48",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41OLUO8E89L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41kR9GsVo L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41bk2-sKeuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410HJ4NcEAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61N2wSRuQGL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Cuisinart Store",
            "link": "https://www.amazon.com/stores/Cuisinart/page/9EA87106-FA2E-4134-BB4D-18194A61B989?ref_=ast_bln"
        },
        "brand": "Cuisinart",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4071,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 7 hrs 12 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "ENDLESS FUNCTIONS: With 1800 watts of power you are able to dual cook, sandwich speed convection, pizza, bake, broil, toast, waffle, bagel, leftover, keep warm including several other options",
            "CAPACITY: Fits 13-inch pizza, 9-inch x 13-inch baking pan and 9 slices of bread. .95-cubic feet inside oven toaster",
            "MUST-HAVE FEATURES: This digital convection toaster oven has large blue blacklist display with door sensor to activate oven and non-stick interior for easy clean up. The Exact Heat sensor maintains precise oven temperature – Always Even toast shade control and a convenient auto-slide rack for convenience",
            "INCLUDED: This beautiful brushed stainless steel unit comes with a 13-inch pizza stone, 2 cooking racks, 9-inch x 13-inch enamel baking pan and broiling pan. Also includes interior light, clock and 2-hour timer with front pull-out crumb tray and recipe book",
            "LIMITED 3-YEAR WARRANTY: Refer to user manual for troubleshooting steps and questions surrounding warranty policies – this product is BPA free"
        ],
        "description": "Cuisinart chef's convection oven boasts 15 cooking functions and offers special settings for speed convection, sandwiches and bagels. Heating power of 1800 watts provides quick heat up time, precise temperature and perfect results every time. The easy-clean nonstick interior is so roomy it can hold a 13-inch pizza, 9 slices of bread, a 9\" x 13\" baking pan or an entire 9-pound chicken. Easiest way to make a real home-cooked meal - every day!",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b?ie=UTF8&node=289933"
            },
            {
                "name": "Toaster Ovens",
                "link": "https://www.amazon.com/Toaster-Ovens-Toasters-Small-Appliances/b?ie=UTF8&node=289937"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Cuisinart"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "16.93\"D x 20.87\"W x 11.42\"H"
            },
            {
                "name": "Special Feature",
                "value": "15 cooking functions, including innovative dual cook, and speed convection."
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Toaster Oven unit^13\" pizza stone^2 cooking racks^9\" x 13\" baking pan and broiling pan"
            },
            {
                "name": "Model Name",
                "value": "TOB-260N1"
            },
            {
                "name": "Finish Type",
                "value": "Polished"
            },
            {
                "name": "Power Source",
                "value": "Corded Electric"
            },
            {
                "name": "Item Weight",
                "value": "32.4 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Cuisinart"
            },
            {
                "name": "ASIN",
                "value": "B01M0AWSJX"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "TOB-260N1"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,071 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,302 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #18 in Toaster Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "September 29, 2016"
            },
            {
                "name": "Capacity 0.95 Cubic Feet",
                "value": "Wattage 1800 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 32.4 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Toaster Oven Broiler Toaster Oven Broiler Convection Toaster Oven Broiler Digital Convection Toaster Oven Broiler Chef's Convection Toaster Oven Item # TOB-40N TOB-1010 TOB-60N2 TOB-135N TOB-260N1 Capacity .5-Cubic Feet .5-Cubic-Feet .6-Cubic-Feet .6-Cubic-Feet .95-Cubic Feet Cooking Functions Toast, Bagel, Warm, Bake and Broil Toast, Bagel, Bake, Broil, Pizza and Keep Warm Toast, Warm, Bake/Pizza, Broil, Convection Bake and Broil Toast, Bagel, Warm, Bake, Broil, Reheat, Defrost, Convection Bake, Convection Broil Toast, Bagel, Waffle, Keep Warm, Bake, Broil, Roast, Pizza, Leftovers, Sandwich, Dual Cook, +30s, Convection Cooking Settings and Defrost Wattage 1800 1800 1800 1800 1800 Convection ✓ ✓ 2-Settings Digital Controls with Timer and Clock ✓ ✓ Slices of Bread 6 6 6 6 9 Size of Pizza 11-Inch 11-Inch 12-Inch 12-Inch 13-Inch Accessories Included Oven Rack, Baking/Drip Pan and Crumb Tray Baking Pan, Wire Rack and Removable Crumb Tray Oven Rack, Broiling Rack, Baking/Drip Pan and Crumb Tray Oven Rack, Baking/Drip Pan, Broil Rack and Crumb Tray 2 Oven Racks, Baking/Drip Pan, Broiling Pan, 13-Inch Pizza Stone and Crumb Tray Oven Light ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bb6dbc33-7993-438e-9121-afee35cbc993.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e27634fd-2d9e-472f-9815-e4c3df38b1c3.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e7e57238-3d1c-43d5-846f-1f6137a675cf.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b010d36d-6c7b-49df-b1d0-85fd136a331f.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2363258-f6bc-4e6c-afa6-a33a40d52a04.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/174fcf25-d272-4055-ad3f-24f435e3bb17.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1b674285-94d2-4eb8-9d4e-08ccc6c2fb4c.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02258ff3-7c6d-446f-b7a4-d2a33b0a94ad.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9aca958e-dfc3-4517-8171-296f4445ecba.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "K. ChanK. Chan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG6F76CPNHTUAFW3PYLPAYQL7PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z9YPHN6HLIV?ASIN=B01M0AWSJX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2019",
                "reviewTitle": "5.0 out of 5 stars Versatile Kitchen Appliance - Definitely Worth the Cost and the Kitchen Counter Space",
                "reviewText": "After having a bad experience with a Breville Convection Toaster Oven breaking down on me after a little over a month, I decided that I really didn’t need a top of the line toaster...but I ended up buying one anyways. The Cuisinart Chef’s Convection Toaster Oven is probably the priciest toaster oven I purchased, but dang, does it work well. This little beast pretty much replaced my standard oven when making oven baked items for my family. I’ve made turkey legs, lamb roasts, oven fries, meatballs, cookies, and even reheated leftovers in this thing with great results. Also, this little oven makes for a great slice of toast - it seems to do it all. The oven heats up quickly, has a great convection setting that makes items like fries and chicken skin crisp, and is relatively intuitive to use.As per suggested by other reviewers, I did paint a few layers of clear nail polish over the buttons prior to use, and I haven’t had any issues with the lettering on the buttons fading or chipping off. The outside of the oven does get a bit hot like most toaster ovens do, but the heat and temperature seems to stay within the oven as well - I didn’t have any issues with heat leaking out the door or the door not completely shutting. This toaster oven comes with two wire racks, metal oven tray with metal rack on top, and a pizza stone. It has a light so you can see clearly into the oven - something I didn’t even know I would need or end up loving - and the timer bell is loud enough to hear, but not so loud that I would wake up everyone in the other rooms when it goes off. The oven automatically shuts off once the timer sounds, so you don’t need to worry about keeping track of the unit to make sure it’s off.In terms of cleaning the unit, it’s relatively easy to clean. I have been wiping down the inside and outside of the unit every few weeks, although it’s recommended to wipe down after every use. My oven doesn’t seem to be getting much build up despite almost daily use, although I would recommend wiping it down if you cook foods in it that have a tendency to splatter oil such as meat. I’ve owned this unit for a little over half a year and find it to be one of the most useful kitchen appliances to have on hand - it definitely earned its spot on my kitchen counter. Overall, this is an attractive, well made, and very useful appliance to have in the kitchen - it’s definitely worth every cent that I paid for it and I would buy it again.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71-3DOdk64L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71Df5Os7GeL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "JB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGFC2HGKLUVDL4MBGQIGW53GOOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27CQS04MS43H?ASIN=B01M0AWSJX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2020",
                "reviewTitle": "5.0 out of 5 stars There's A Learning Curve, But It's Worth It",
                "reviewText": "For more than a year I'd been eyeing this unit as a replacement for my old and beat-up Cuisinart toaster oven, which served us well for a decade or so but had seen better days. Air frying seemed interesting, but I had zero interest in a dedicated appliance, and thewirecutter.com claimed this model air-fried better than any dedicated air fryer. I finally pulled the trigger a few weeks ago, and while the unit has some minor quirks and is missing what I think is a key accessory, it's overall great. First, the quirks:1. The \"beep\" signal is barely audible and the volume and tone can't be changed. Thankfully we all have timers on our phones, in our smart devices, on other appliances, etc. If you are going to be away from the kitchen, you'll want to use one of those instead.2. The temperature can only be adjusted in 25-degree increments. This doesn't matter all that much; recipes that call for 360 degrees will be just fine at 350 (or lower, see #6 below).3. The light stays on for a strangely long time before auto-shutoff. I usually turn it off manually, for fear of hastening that far-off time when the bulb dies.4. For air frying, you absolutely must get a basket so that the air properly circulates around the food. I purchased the \"EaZy MealZ Round Crisper Basket\" which fits this model perfectly and is well worth the $17.5. After a few weeks I still find navigating the cooking options to be a bit awkward, just the first bit when you are selecting a main mode. Eh, not a big deal.6. There is a learning curve. Recipe instructions for regular ovens have to be adjusted, otherwise you will overcook your food. This is apparently true of many appliances of this kind. For most things I've tried so far (from baking banana bread to air-frying chicken wings) I've dropped the temp 50 degrees and/or reduced the cooking time.Speaking of chicken wings, STELLAR in this thing. Crispy as all get-out, and no oil needed. Here's my recipe, if you can call it that as it's so simple:1. Defrost wings sections if frozen, and pat them as dry as possible.2. Place them in the aforementioned basket (which can fit 12-15 pieces) and sprinkle generously with kosher salt.3. No need to preheat the oven; using the \"dual cook\" function, first \"speed conv\" at 350 for 24 minutes, then at 400 for 12 minutes. Carefully transfer to a bowl and toss with whatever sauce you prefer, if any.Air-frying on \"speed conv\" is also brilliant for reheating fast food fries (in the basket, hit them with an oil spray first, five minutes at 325, salt immediately when done cooking) and leftover pizza (either on a piece of foil or directly on the wire rack, 325 or so for several minutes). Haven't tried veggies yet, but I expect similarly great results. For pre-packaged foods, even if the instructions say to defrost first, \"speed conv\" and experience using this unit allows you to get right to cooking without the defrosting.The unit comes with a broiling pan -- pretty straightforward -- and a pizza stone, which works well but can be a pain to clean.All the general toaster oven stuff works great, no need to get into the details here. There's tons of cooking space for a device of this kind, and I find myself using it far more than I ever did our old unit. For small batches of things, it's now my go-to oven/frying device.In short: Expect to spend some time learning how best to use it for whatever it is you like to bake/fry. It won't take long, and once you do, you'll probably love this thing.",
                "reviewVotes": "218 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WW",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 8, 2023",
                "reviewTitle": "Amazing",
                "reviewText": "Can bake 12 muffins, pizza, toast, fast to heat, even heat, fits on my counter a great replacement for a 20 year old Cuisinart toaster oven",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eduardo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 21, 2022",
                "reviewTitle": "Unos días usándolo y hasta ahora encantado!",
                "reviewText": "Funciona de maravilla, es un poco costoso pero esta muy bien hecho y el desempeño es tal cual como dicen. Nunca me había salido tan bien una pizza….",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Splashes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 22, 2022",
                "reviewTitle": "The Best!",
                "reviewText": "I have to say, not only is this a beautiful looking appliance, it is also a great product. Cruisinart thought of everything when they made this machine. Very easy to operate and food comes out perfect every time. The drip pan is so easy to clean, not like the cheaper models that you have to scrub. Cruisinart also thought to make it so you able to adjust the bell so you can hear it. The convection part is quiet but definitely running. I love the speed convection. I haven't found anything that I dislike about this so far. Well worth the money. I've had toaster ovens most of my life, even another Cuisinart. This one is the best!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martin Ocampo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 11, 2021",
                "reviewTitle": "Muy buen producto",
                "reviewText": "Se ve de buena calidad y de cocimiento de acuerdo a manual, aún falta realizar más recetas, pero en lo que lo hemos usado nos ha gustado mucho.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 11, 2022",
                "reviewTitle": "First class service!",
                "reviewText": "I purchased this oven after reading top notch reviews from the NYT and other reputable sites. I used this a lot from air frying chicken wings to pizza (oven comes with a pizza stone), to shepherds pie… Excellent results with everything.What really impressed me was the response from Cuisinart when my oven displayed an error code about 15 months after I received it. This oven has a 3 year warranty so I simply filled out the warranty for online. I received a reply stating Cuisinart would send me a new replacement and to simply cut the power cord on the old one and recycle it. Great service!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}