{
    "remaining_requests": 35320,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Breville-BOV845BSS-Convection-Toaster-Stainless/dp/B00XBOXVIA",
    "body": {
        "name": "Breville Smart Oven Pro Toaster Oven, Brushed Stainless Steel, BOV845BSS",
        "price": "$268.99",
        "originalPrice": "$268.99",
        "rawPrice": 268.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Breville-BOV845BSS-Convection-Toaster-Stainless/dp/B00XBOXVIA",
        "soldBy": {
            "sellerID": "AT9CODMKKC2H1",
            "name": "The Cooks Warehouse",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AT9CODMKKC2H1&asin=B00XBOXVIA&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/413Rn3T6ofL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51dmQt0c8ML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SxCqLnSzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51PdSM-g8wL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mNs3fWf8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417jPbrD1NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vMPKacrgL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Breville Store",
            "link": "https://www.amazon.com/stores/Breville/page/EBBDE160-83A6-4DE3-A1B2-C27D03CABFF6?ref_=ast_bln"
        },
        "brand": "Breville",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 9146,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 21 - 23. Order within 19 hrs 16 mins.",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The Breville Smart Oven Pro with Element iQ System is a high performance countertop oven; Reduce your cooking time by up to 30% using the convection setting and choose from 10 cooking functions as an interior oven light guides you to perfection",
            "Element iQ System: Using 5 independent quartz elements, smart algorithms steer power to where and when it's needed to create the ideal cooking environment for perfect results every time; Fast 1800 Watt preheat gets your meals on the table more quickly",
            "Convection Powered: The Smart Oven Pro's convection setting reduces cooking time by up to 30%; An inbuilt fan circulates the hot air within the oven which speeds the cooking process by stripping away the cold air that surrounds your food",
            "10 Cooking Functions: versatile countertop oven with 10 cooking functions to guide you to perfection: Toast, Bagel, Bake, Roast, Broil, Pizza, Cookies, Reheat, Warm and Slow cook",
            "Smart Oven with Slow Cook Function: Take your time to tenderize and develop complex flavors using the slow cook function, designed for long cook times at low temperatures; Slow Cook for up to 10 hours before the setting automatically turns to keep warm",
            "Large Capacity: Large 18.5 x 15.7 x 11.1 inch interior with enough room for 6 slices of bread, 13 inch pizza, roast chicken and a 9 cup muffin tray and even for slow cooking with a 4.4 qt Dutch oven",
            "Interior Oven Light: Integrated oven light automatically turns on at the end of the cooking cycle to help you see inside; Auto shut off and independently controlled button; Replaceable componentry like your regular large oven",
            "LCD Display: LCD display to easily access the built in smart functionality, choose from 10 cooking functions; The LCD also indicates when pre-heat has completed and automatically begins to count down on the cooking time for perfect results",
            "Included Accessories: One Oven Rack; 12 x 12 inch Enamel Baking Pan; 12 x12 inch Enamel Broiling Rack and 13 inch Non-Stick Pizza Pan",
            "Warranty: 1 Year Limited Product Warranty; Power: 1800 Watts; Voltage: 110 to 120 Volts"
        ],
        "description": "The smart oven Pro with element IQ is an essential tool for the cook who desires a countertop oven that bakes the perfect pizza pie, crispy yet chewy cookies, toasts evenly and roasts succulent meat. The convection setting reduces cooking time by up to 30%. with element IQ - 5 independent quartz heating elements move the power where it's needed most, above and below the food. Each element adjusts automatically for the setting you choose, to deliver the right cooking temperature at the right time ensuring the precise cooking process for the meal you are creating. Voltage -110 -120 volts , Power - 1800 watts.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Convection Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289934"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Breville"
            },
            {
                "name": "Color",
                "value": "Brushed Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "14.5\"D x 18.5\"W x 11\"H"
            },
            {
                "name": "Special Feature",
                "value": "Alcohol-Free"
            },
            {
                "name": "Control Type",
                "value": "Knob Control"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Toaster oven^12\" x 12\" enamel broiling rack^12\" x 12\" enamel baking pan^13\" non-stick pizza pan^Wire rack^Crumb tray"
            },
            {
                "name": "Model Name",
                "value": "BOV845BSS Smart Oven Pro Countertop Oven"
            },
            {
                "name": "Finish Type",
                "value": "Brushed"
            },
            {
                "name": "Item Weight",
                "value": "22.8 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Breville"
            },
            {
                "name": "ASIN",
                "value": "B00XBOXVIA"
            },
            {
                "name": "Item model number",
                "value": "BOV845BSSUSC"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 9,146 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,101 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #3 in Convection Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 1, 2013"
            },
            {
                "name": "Capacity 1 Cubic Feet",
                "value": "Wattage 1800 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 22.8 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Powered by Element IQ Bakes the perfect pizza, make delicious cookies, toast evenly and roast succulent meat intelligently Promotes Hot Air Circulation Convection speeds the cooking process by raising hotter air and sinking colder air for quick heating Tenderize And Develop Complex Flavors Slow cook for up to 10 hours before the setting automatically turns to keep warm Easily Access Built-in Smart Functionality Choose from 10 smart cooking functions including Toast, Bagel, Bake, Roast, Pizza and more See Your Progress Automatically turns on when you open the door and at the end of the cooking cycle Next page 1 10 Cooking Functions 2 Convection Powered 3 Slow Cook Function 4 LCD Display 5 Interior Oven Light",
                "media_link": []
            },
            {
                "media_text": "Choose your oven 10 cooking functions Settings 9 cooking functions 6 Slices; 13\" Pizza Capacity 6 Slices; 13\" Pizza Convection Powered Element IQ System LCD Display 10 cooking functions Settings 8 cooking functions 6 Slices; 13\" Pizza Capacity 4 Slices; 12\" Pizza Convection Powered Element IQ System LCD Display 10 cooking functions Settings 8 cooking functions 6 Slices; 13\" Pizza Capacity 4 Slices; 11\" Pizza Convection Powered Element IQ System LCD Display",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c64b2d61-43c0-45fa-b72a-e87af5adfb6b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d618925-2358-4c63-a9d3-551f36306bb4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c081c5f2-d7ae-422a-882f-06e1e37ea838.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4b9059d-9a90-4bf1-9f33-964e9267b529.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d22c636a-e085-4263-9928-4460bb55163d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d0c45c9-7b80-487e-ab63-c495017b3949.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c76509c-f63a-4c25-9d7f-cbbb62c90bd5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3b869215-1b38-47f3-93ab-29946a1e3348.__CR0,0,488,700_PT0_SX488_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4c0678ec-5bd6-41c9-b14a-17f383097c71.__CR0,0,488,700_PT0_SX488_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4dde0ad-54e4-46a1-a922-7f7489e01b26.__CR0,0,488,700_PT0_SX488_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Connorj",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2SMCPOALTJXPTASSKTJR2RXZNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GYCHLM0X5AP5?ASIN=B00XBOXVIA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2017",
                "reviewTitle": "5.0 out of 5 stars So far, I am in love with this oven.",
                "reviewText": "Mine just arrived today, and I am in love with it. If it was legal, I would marry it. I bought it as a stand in for a defective oven in the house I rent. While I work on getting the landlord to replace the bad stove/oven unit, I needed something I can cook in that is not going to burn my house down. So, toaster oven and an induction cook top is my solution. Not to mention that these both will be useful after the stove issue is resolved. I have been debating getting a toaster over for literally a couple of years and with my ever-climbing electric bill, only cooking for one, and my oven being defunct, I decided to go for it.Then the questions became...Which one?How big?Features?I REALLY did not want to spend this much on a toaster over. But I couldn't bring myself to buy and El Cheapo, and then hate it for being not big enough, not having features I want as a serious cook, etc. Then reliability complaints about just about every model toaster oven on the market.I read review after review, on and off Amazon, and ultimately the reviews on both thesweethome.com and Cook's Illustrated sold me on the Breville. It was a toss up between the Breville and the Cuisinart TOB-260N1. There were a couple of deciding factors that led to the win for Breville. One was the fact that the Breville has a replaceable bulb for the light. The Cuisinart does not have a replaceable bulb. Another factor was the display. A lot of people didn't care for the display on the Cuisinart and liked the display on the Breville far better. Lastly, there were a number of complaints about the overall construction of the Cuisinart and general quality control. i.e. Inconsistent gap around door, etc.So I decided that for the sake of about $50 over the life of the unit, I would take the plunge and buy the Breville. I am very glad I did. I still have some reservations about longer term quality, but time will be the judge on that score.Much of why I like it is a direct result of just how bad my oven was. However, this thing is still pretty darned great on its own merits. It heats up fast, does not dry out my frozen pizzas, makes reasonably decent toast, and will do pretty much anything I would need a full-sized oven for, with a perhaps an exception here or there.First thing I did was cook a 12\" frozen pizza. It came out perfect. I can't wait to try a fresh made pizza. There was the slightest of uneven doneness right at the front of the oven, which I solved by giving the pizza a 180 degree turn a couple of minutes before it was done. And that was more an issue of me being picky than anything else. Then I made toast. It makes toast as well as my starting-to-flail Cuisinart toaster. Perfect toast was so far down my list as to not really be factor. One doesn't buy a toaster oven for perfect toast, if one really wants success. (My opinion, of course.) This makes more than adequate toast for me. I can always whip out the old toaster if I want to get picky about it.I have an addiction to Trident brand fish sticks sold at my favorite warehouse store. ADDICTION, I tell you. But I hated trying to cook them in my nightmare oven. Cooked unevenly, burning the crap out of them before heating them through. Not to mention heating a huge oven for a few fish sticks. So I am just over the moon excited to try cooking fish sticks in my Breville tonight.I have only done a couple of things with it today as a test run, but my first impressions are really favorable. I am confident this will do everything that I expect and want it to do.Initial impression of manufacturing quality is very good. Nothing weird. No parts that don't quite fit. No obviously poorly made parts. Instructions are good. I find it very easy to use, although I did actually read the manual first. I love, love, love the oven light.I have found that my fancy Oxo 9 x 13 cake pan does not fit in it. There is a rim on that pan that doesn't clear the light on the inside. And my 13 1/8 th inch pizza stone does not fit, by a hair. Not a surprise. I expected that, based on the specs. Not a big deal for me. I will get a cake pan that fits, and a little bit smaller pizza stone. Just something to bear in mind on larger pans with rims or handles that might not clear the light or make for a tight fit.Edit: I realized that I had tried to put my OXO 9 x 13 pan in on the middle rack. Doh! It would actually be used on the bottom rack position. Not the middle. So it does actually fit.All in all, I am super pleased with this toaster over. It isn't even as big as I was thinking it would be. I was thinking it would be tank-like on my counter, but it actually fits very nicely and doesn't look monstrous. It's a very attractive unit, to boot.Time will tell on longevity. I do have some concerns there. I have also yet to do any serious cooking in it, so we will see how this holds up to expectations. With those caveats, I would already recommend this product as a serious contender for someone looking for a countertop oven that will see real duty.",
                "reviewVotes": "65 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3WOAZVUCISK2KAUPLSTVTI4RVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RAMKP54LEAQM?ASIN=B00XBOXVIA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Breville Toaster Oven Rocks!",
                "reviewText": "We haven't owned our Breville for very long, but so far it exceeds our expectations. We use a toaster oven for the majority of our cooking. When our old Avanté Elite began to cook unevenly, it was time for a replacement. After reviewing dozens of others, we decided to splurge on the Breville Smart Oven Pro. It's slightly larger than our old oven while still fitting onto our cramped counter space. It's easy to operate with the LED display and function, temperature, and time knobs. This oven preheats quicker than any other toaster oven we've owned. It's quiet, even on the convection setting, cooks evenly, makes perfect toast, and is a breeze to clean. We highly recommend this Breville Smart Oven Pro!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debbie Lee Wesselmann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTI7JZOGGBVHROXHXDT6VPA64IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TKPNEZ5FKAS5?ASIN=B00XBOXVIA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2018",
                "reviewTitle": "5.0 out of 5 stars Forget Lesser/Cheaper Toaster Ovens!",
                "reviewText": "I had heard that the Breville line of \"toaster ovens\" were the best, but I had still put off owning one, simply because of the price. Now I question why I even bothered with the others. The Breville Smart Oven Pro is a convection oven, as my last toaster oven claimed, but it is worlds apart from Black & Decker/Hamilton Beach/Oster models because it actually works well as a small oven. I'm not talking about reheating, broiling, and toasting -- I'm talking about real baking and roasting in addition to those. The reason this oven is such a success is the wide array of options that are fine-tuned to the specific task you need.The main settings for the Breville are toast, bagel, bake, roast, broil, cookies, pizza, reheat, warm, and slow-cook. Within some of those categories, you can choose \"frozen\" -- that is, the oven heats the food prior to cooking it. For example, I can choose bagel, which toasts on one side, or frozen bagel, which heats the bagel before toasting it. You can select 1-6 slices of toast for optimal performance. You can cook with or without convection. (I almost always use convection, although a recipe that requires a precise time would be better without.) An interior light illuminates when the food is done or when you manually turn it on. The smooth dials, coupled with an illuminated digital display, make everything easy and inspired confidence that the oven will actually last longer than the cheaper models I've had in the past.The oven's interior is spacious but not huge. The main interior, taking away the jut-outs that hold the racks, is 13.5\" wide and 11 3/4 deep, but there's a rounded cut-out in the back to make room for the end of a 13\" pizza pan. The oven comes with said 13\" pan, with about 12\" of usual space, and a two-piece broiler/drip pan. It has one rack which can be placed in one of three positions. It's probably big enough to cook a roast chicken or turkey breast; since I don't tend to roast meat often, that's not something I've tried. My 9\" x13\" pans are a little too large for the oven because they have lips with handles. Keep in mind that most pans measure the interior area and not the whole pan when supplying measurements. A disposable foit pan of that size should be no problem. I love that the rack, when placed in the middle position, gets pulled out by the door when you open it.The oven does get hot on top, and care must be taken to pull the oven away from walls to give some clearance around all sides for the heat to dissipate.If you think of this as an auxiliary oven and not a toaster, it's worth every penny. It preheats quickly and cooks evenly. The stainless body is heavier and better built than my previous stainless toaster oven, giving me confidence that it will last. I love that it is a much more efficient option than my wall oven for smaller baking/roasting tasks. Yes, it gets hot, but it certainly doesn't heat my kitchen up the way my oven does. I'm looking forward to using it in the summer months for exactly that reason.-- Debbie Lee Wesselmann",
                "reviewVotes": "62 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucia Raphael",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 2, 2024",
                "reviewTitle": "Lo que esperaba para esta clase de horno y más.",
                "reviewText": "Lo utilisé desde el día de recepción, es mucho más fácil de usar que el horno de gas, tiene una serie de funciones pro- programadas que facilita el uso, recomiendo la lectura de las instrucciones para mayor aprovechamiento. Mis galletas de navidad quedaron fantásticas en este horno y tuestas deliciosamente el pan :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 10, 2023",
                "reviewTitle": "Tremendous value on a quality product.",
                "reviewText": "This Breville Toaster Oven replaces a previous Breville, which I'd had for 15 years of excellent use. (The elements burned out, but all digital controls worked perfectly.) As in the previous item, it heats quickly, produces excellent results for a range of baking foods, has easy digital controls with bright digital displays and is attractive. This is my \"primary\" oven as it makes little sense to use my standard and very large oven - especially in the heat of summer.The pricing was nearly a hundred dollars less than another store. Delivery was in 48 hrs. With good care, this oven should last a decade or more.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos J. Vallejo Dabdoub",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 28, 2024",
                "reviewTitle": "Breville es garantia.",
                "reviewText": "Lo compre como reemplazo a mi antiguo horno de Breville, que duro 10 años. En el hago de todo: tostador, horno, para calentar, etc etc. Es buenisimo y vale la pena cada centavo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TheMightyQ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 5, 2020",
                "reviewTitle": "Have had some nice toaster oven in the past, but this is by far the best in every sense of the word.",
                "reviewText": "This is not a compact toaster oven so look else where if you want a compact one.It has been almost a year, and this is not only a good looking oven, but it is well made, well design, and most importantly has all of the ergonomic features and functions. It does what is was made to do and it does it well.!Toasts are toasted evenly and according the the browning setting.Bake item are baked evenly; as good if not better than a full size oven.The broil setting browns as a broiler should do.This is like a mini version of a full size oven without the bulky size. Great if you need to cook something extra while the main oven is busy with your rack of primerib. Great if you want to heat something small and don't want to turn on big oven. It toast bread, bagel, bake pizza, bake cookies (have not tried yet).Lights comes on when you open the cover to put in your food. Turns off one it's start cooking. Comes back on a few seconds before the cooking is completed with beeping indicator!Magnets on the door pull out the wire rack without hinges or other do hickies!All of the features are intuitive to use and make sense. The amount of details that went into the design this oven is incredible! Nothing is missing.Cleaning tray is easily accessible and clean in less than 10s.Breville got this right and it is well worth the price.I rarely rate anything so high, but Breville got this so right (at least with the Smart Oven Pro), and wish other company (K A, De L) would follow suit. A little healthy competition to breed innovations.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alioska",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 27, 2023",
                "reviewTitle": "Excelente horno para pan casero",
                "reviewText": "Me ha encantado mucho el horno, especialmente en cuestiones de panadería casera es buenísimo, hornea de manera uniforme cualquier pan, muy preciso, atención a clientes excelente, muy recomendable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$279.95",
                "sellerName": "Peppercorn",
                "sellerRating": "5"
            },
            {
                "price": "$279.95",
                "sellerName": "The Kitchen Clique",
                "sellerRating": "5"
            },
            {
                "price": "$279.95",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}