{
    "remaining_requests": 35090,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/T-fal-Stainless-Convection-Countertop-Capacity/dp/B0CFRLXSHD",
    "body": {
        "name": "T-fal 9 in 1 Toaster Oven Air Fryer Combo Stainless Steel Convection Countertop Oven, Fast Heatup, 7 Pound Chicken Capacity, Extra Crispy Results, Toast, Bake, Air Fry, Reheat, Broil",
        "price": "$187.18",
        "originalPrice": "$199.99",
        "rawPrice": 187.18,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/T-fal-Stainless-Convection-Countertop-Capacity/dp/B0CFRLXSHD",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "Only 9 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51fccQQP0SL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61g79wf8zgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51b0Q7x JoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/517j6umDWEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ii5LUCi9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5149I6LdfKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61oGHrkXnbL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the T-fal Store",
            "link": "https://www.amazon.com/stores/T-fal/page/01E7004C-006C-4C56-AD9B-BC5A6A5F2B2E?ref_=ast_bln"
        },
        "brand": "T-fal",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 27,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 6 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Air Fryer & Oven for ultimate versatility: Combine the power of a traditional oven with the convenience of an air fryer! From crispy fries to succulent roasts – this all-in-one appliance makes it effortlessly possible with the preset cooking functions – Air Fry, Air Broil, Air Bake, Broil, Bake, Toast, Warm, Reheat, Bagel – and the adjustable temperature range – from 175°F to 450°F .",
            "Healthy and tasty results: Taste the difference with the Extra Crisp technology delivering the perfect mix of heat and airflow for an irresistible golden-brown finish with little to no oil",
            "Family-sized capacity: Enjoy a generous 21QT capacity that serves up to six people — enough place for a whole roasted chicken up to 7 pounds, 6 slices of bread, a 12-inch pizza, 13 cookies, and much more",
            "Time & energy saving: Cook your meals in no time while saving energy! Unlike a traditional oven, there is no preheating needed ensuring quick but always perfect results for your daily needs",
            "Convenient accessories: The air frying basket, wire rack, food tray and crumb tray will help you cook your favorite recipes to delight the entire family"
        ],
        "description": "Easy Fry Air Fryer Oven Multifunctional 21 QT is a combination air fryer and oven offering endless possibilities for healthy and delicious home-cooked meals. With 9 cooking functions and a generous 20 L/ 21 QT capacity, Easy Fry Air Fryer Oven Multifunctional is ideal for families and gatherings of up to 6. Roast potatoes or a whole rotisserie chicken up to 7 pounds, grill fish, and so much more. Save energy and make a tasty meal faster than in a standard oven, for less time spent in the kitchen and more doing things you love.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Convection Ovens",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289934"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "T-fal"
            },
            {
                "name": "Color",
                "value": "Stainless Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "16.14\"D x 13.7\"W x 12.6\"H"
            },
            {
                "name": "Special Feature",
                "value": "Temperature Control"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Wire Rack, Crumb tray"
            },
            {
                "name": "Model Name",
                "value": "FW601D50"
            },
            {
                "name": "Item Weight",
                "value": "25.2 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "T-fal"
            },
            {
                "name": "ASIN",
                "value": "B0CFRLXSHD"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "FW601D50"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 27 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#148,030 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #72 in Convection Ovens #115 in Toaster Ovens #414 in Air Fryers"
            },
            {
                "name": "Date First Available",
                "value": "August 15, 2023"
            },
            {
                "name": "Capacity 20 Liters",
                "value": "Material Stainless Steel"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "GREAT MULTIFUNCTIONALITY Get creative with the 7 preset functions (Air Fry, Air Broil, Air Bake, Broil, Bake, Toast, Warm) & 2 manual functions (bagel, reheat). COOK SIMULTANEOUSLY Innovatively designed with three distinct rack levels (top, middle, bottom), it enables you to cook up to 2 two different dishes simultaneously. IDEAL FOR FAMILY MEALS With its generous capacity, fitting a chicken up to 7 pounds, our Oven Air Fryer lets you create heartwarming family memories with delightful meals.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3274982c-0eb1-403d-90f1-990e35a08308.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/05685fc7-7c3a-4089-8bbf-7e026fa238f8.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/49854c5a-a149-423d-8438-88f103cf204c.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "AUTHENTIC FLAVOR AND TEXTURE The Extra Crisp technology delivers a perfect mix of heat and air flow to create an outstanding harmony of flavor and texture, with minimal to no oil. SIMPLE TO USE DIAL SETTINGS Our Oven Air Fryer features intuitive rotating dials, enabling you to easily customize settings to match your desired recipe. SLEEK STAINLESS STEEL DESIGN Its sleek and modern design blends into your kitchen decor, turning everyday cooking into a sophisticated experience.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/73caaf70-18d5-43bb-93be-d5839a470708.__CR0,0,600,600_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b6bb6719-42ac-46d2-8dba-c2197b4bba70.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d5416509-622f-42e4-b69b-ad5555de9324.__CR0,0,600,600_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/dd2b73b9-d8ea-4df6-a460-e2d1f60f0aeb.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3274982c-0eb1-403d-90f1-990e35a08308.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/05685fc7-7c3a-4089-8bbf-7e026fa238f8.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/49854c5a-a149-423d-8438-88f103cf204c.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/73caaf70-18d5-43bb-93be-d5839a470708.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b6bb6719-42ac-46d2-8dba-c2197b4bba70.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d5416509-622f-42e4-b69b-ad5555de9324.__CR0,0,600,600_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6f575a49-0b87-4429-b0fa-b60fc7760e49.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/747db44b-7700-45a8-a102-f67b5f157f4b.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jewelry Trends",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOC5ZA3FRL5RAF2232OIIPLNK3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AO229GEAB7EN?ASIN=B0CFRLXSHD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent appliance! Cooks food faster saving time and electric!",
                "reviewText": "This 9 in 1 toaster oven / air fryer oven combo by T-fal is exactly as described on the website listing. I did not hesitate to order this oven because I trust the T-fal name, and I have other cooking tools made by this company. They always produce top notch quality appliances and tools, and this air fryer combo oven is no exception!I actually wanted this particular model because it is closer to the functionality of the convection toaster oven that I am so used to using in my kitchen. I love that it doesn't have any digital controls, so there are less chances of failure in the future. The knobs are intuitive so I am not guessing at the time or temperature once I choose a preset cooking function. One of the best features is the big capacity of the interior. I have the ability to cook a whole 12\" pizza from frozen which was amazing! My fries came out really crispy in much less time. I could never make crispy fries in my old oven because they would burn at the ends and get hard and dry out before they would crisp up.One thing I've noticed about this air fryer oven is it's ability to cook the food much faster, so it doesn't have time to dry out. Everything gets crispy on the outside, and stays moist and juicy on the interior. Another thing I really like is dinner is done much faster because you don't have to wait for the preheat function to be done. My range oven takes 16 minutes to get the temperature at 400 degrees which is a waste of time and money on electric. I won't be doing that long preheat anymore thanks to this appliance! I am still experimenting with different meals and functions, but as it stands for now, I love my new T-fal air fryer oven and I would recommend it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ken DuenwaldKen Duenwald",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOC5IT2UOZYLZRHBJZSKVJJ2X3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VNUYNJF5I36L?ASIN=B0CFRLXSHD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Functional and powerful countertop oven with some drawbacks.",
                "reviewText": "Initial impressions, this is a very sleek and professional looking oven at a fairly decent price coming from a well known brand. Decent design, the knobs are well positioned. Celsius and Fahrenheit temperatures being included is a touch. Its also pretty compact and doesn't take up as much space as one might think. Having convection as well as an air fryer built into a countertop oven at this price is certainly noteworthy. As far as performance, this oven does very well. The convection is very strong and there are certainly no complaints regarding its ability to cook foods at a relatively high speed. Overall its very comprehensive and the results so far in terms of food itself cooked in the oven have been very good.There are some drawbacks however that prevent me from giving this five stars. Couple minor issues: the door doesn't feel as solid or robust and that brings into question the durability. Also, the interior light stays on while cooking and I couldn't find a switch or button to turn it off during the cooking process. While it may not seem like a problem now, what worries me is the light burning out faster than other similar oven models.The biggest issue though with this oven are the knobs themselves. The knobs are fairly stiff and aren't as smooth to rotate as I would like. But the bigger issue is the knobs can heat up quite significantly during use, especially during longer periods of high temperature cooking (30-40 minutes or longer at 400 degrees F for example). The knobs aren't necessarily burning hot, but they are hot enough to where keeping your hand on it without a glove for any longer than say 10 seconds will start to feel uncomfortable. I don't know if this is an issue with this specific model or even just with my unit only, but thats something that shouldn't happen. Oven controls should never heat up during use regardless of temperature.In almost every way that matters, this oven delivers quite well. But it does have some issues, some minor, some more so like the knobs heating up. And thats why I'm stopping short of recommending this outright. Rather, I would say consider this and other reviews as well as shop around for others within the same price before purchasing.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71AGcu+10NL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melinda Upchurch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH72CCXWRBXJEG24NA67H4GB32DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R292UBIS77I0T0?ASIN=B0CFRLXSHD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent kitchen tool!",
                "reviewText": "We replaced our toaster, microwave and air fryer with this one item! We love it. Trying to simplify our lives and this was perfect",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monica GrusenmeyerMonica Grusenmeyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4EBIQGWDPRFVOUW7YPE26Z7X5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BPQIAP4UBHAV?ASIN=B0CFRLXSHD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Very Well-Made, High-Quality, Versatile, Efficient, Reliable, Portable!",
                "reviewText": "Absolutely thrilled with this T-fal air fryer/toaster/oven combo! My spouse and I recently retired and have been living in our rental home for nearly a decade. Over the years, we've encountered countless appliance issues with the original 30-year-old equipment. The dishwasher never worked, the washing machine broke (which we ended up replacing ourselves), and our gas stove/oven, well, it's seen better days. We've had to resort to lighting it with matches, and it tends to scorch our food from below. Missing shelving and other problems have been a constant source of frustration. It seemed like our complaints to our landlords fell on death ears.But then, we brought this T-fal air fryer/toaster/oven combo into our lives, and it's an absolute game-changer! Despite our outdated and small kitchen, this appliance fits perfectly on our kitchen counter, instantly giving the space a modern and sleek stainless steel upgrade. It's clearly high quality, well-made and heats up in no time, eliminating the need for tedious preheating.The size is just right - compact on the outside yet surprisingly roomy inside. We can now cook multiple dishes simultaneously, and they come out perfectly cooked in record time. The multifunctionality of this appliance is a dream. We've used it to prepare everything from roast dinners for the visiting family to crispy roast potatoes, succulent chicken, and heavenly veggies. Nothing burns, and the cooking time is cut in half, not to mention the added health benefits.I absolutely love the air frying basket, it's a fantastic feature, delivering the crispiest French fries, popcorn chicken, and popcorn shrimp. And the fact that it can toast and broil opens up a world of culinary possibilities that we're excited to explore.With the included wire rack, food tray, and crumb tray, our meals have never tasted this good. We're anticipating lower power and gas bills since our old oven took forever to preheat. Plus the portability of this appliance means we can take it with us when we eventually move from this rental. In fact, we haven't used our old stove/oven once since getting this air fryer/toaster/oven combo. All of this, and it's reasonably priced. I paid close to this amount for our old,much smaller air fryer.I can't recommend this appliance highly enough. It has truly transformed our cooking experience. If you're looking for versatile, efficient, and stylish kitchen upgrade, this is the one to get!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61-noTlb8QL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/610wsIhyDLL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61r559aikmL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61yPFxtrUXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71HHM6Ks7cL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71tBZq2JAuL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}