{
    "remaining_requests": 35227,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Nostalgia-BST3AQ-Electric-Breakfast-Coffeemaker/dp/B07YFDM4V7",
    "body": {
        "name": "Nostalgia 3-in-1 Breakfast Station - Includes Coffee Maker, Non-Stick Griddle, and 4-Slice Toaster Oven - Versatile Breakfast Maker with Timer - Aqua",
        "price": "$79.99$67.99",
        "originalPrice": "$79.99",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Nostalgia-BST3AQ-Electric-Breakfast-Coffeemaker/dp/B07YFDM4V7",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CCBBQB4C"
        ],
        "asinVariationValues": [
            {
                "asin": "B07YFDM4V7",
                "variationName": "Style",
                "variationValue": "Aqua Breakfast Station",
                "price": "$79.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07WFHZ8RM",
                "variationName": "Style",
                "variationValue": "Red Breakfast Station",
                "price": "$59.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BSHPBNZY",
                "variationName": "Style",
                "variationValue": "Yellow Breakfast Station",
                "price": "$79.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41os7tZTIiL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51wEK6xQYLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5175uOAYF6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FaLQMaWJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51d4ebztW4L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Nostalgia Store",
            "link": "https://www.amazon.com/stores/Nostalgia/page/BEF8C71C-F2C2-4777-8128-A4BCA210DCF5?ref_=ast_bln"
        },
        "brand": "Nostalgia",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 5053,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 5 hrs 59 mins",
            "FREE delivery Sunday, February 18. Order within 5 hrs 59 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "ALL-IN-ONE BREAKFAST SOLUTION: Start your day off right with our versatile breakfast station. This 3-in-1 appliance includes a 4-cup coffee maker, a large griddle for cooking eggs, bacon, and pancakes, and a toaster oven that can hold up to four slices of bread.",
            "SPACE SAVER: Our compact breakfast maker machine is designed to save countertop space while providing a convenient solution for cooking your favorite breakfast meals. The stylish design makes it a great addition to any kitchen decor.",
            "COFFEE MAKER: This coffee maker brews up to 4 cups at a time in minutes so you can enjoy a cup of coffee while your food cooks. It comes with a glass carafe, a coffee scoop, and a reusable filter.",
            "FAMILY-SIZED GRIDDLE: The large non-stick griddle offers plenty of room to fry eggs, omelets, pancakes, sausages, bacon, hashbrowns, and other breakfast foods. It also comes with a glass lid.",
            "NOSTALGIA: From designs inspired by early 19th century America to the timeless appeal of our appliances, we offer unique, novel, and fun products for the family. We preserve the past, embrace the present, and look forward to the future."
        ],
        "description": "The Nostalgia 3-in-1 Breakfast Station is the ultimate appliance for whipping up a delicious and hearty meal for the whole family. This breakfast station combines a 4-cup coffee maker, a large non-stick griddle, and a multi-functional toaster oven. The coffee maker effortlessly brews up your favorite coffee, while the large electric griddle's non-stick surface is perfect for cooking a variety of breakfast meats and eggs. The toaster oven can hold up to four slices of bread at a time and is also suitable for small frozen pizzas, hot sandwiches, desserts, and more. The compact design is perfect for small spaces, dorm rooms, and tiny houses. Save time and energy with Nostalgia 3-in-1 Breakfast Station, designed to make your mornings easier and more enjoyable.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Toasters",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289938"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Nostalgia"
            },
            {
                "name": "Color",
                "value": "Aqua"
            },
            {
                "name": "Product Dimensions",
                "value": "11.5\"D x 19.25\"W x 12\"H"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Control Type",
                "value": "Knob"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Breakfast station, coffee carafe, coffee scoop, reusable coffee filter, griddle lid, oven tray, wire rack, crumb tray"
            },
            {
                "name": "Model Name",
                "value": "Retro 3-in-1 Family Size Electric"
            },
            {
                "name": "Finish Type",
                "value": "Non-stick"
            },
            {
                "name": "Cable Length",
                "value": "11.5 Inches"
            },
            {
                "name": "Item Weight",
                "value": "13.97 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Nostalgia"
            },
            {
                "name": "ASIN",
                "value": "B07YFDM4V7"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "Nostalgia"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 5,053 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,052 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #139 in Toasters"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "September 26, 2019"
            },
            {
                "name": "Capacity 4 Fluid Ounces",
                "value": "Wattage 1500 watts"
            },
            {
                "name": "Material Plastic",
                "value": "Item Weight 13.97 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Nostalgia Retro 12-Cup Coffee Maker Nostalgia Retro Wide 2-Slice Toaster Nostalgia Retro Countertop Microwave Oven Nostalgia Retro Convection Toaster Oven Nostalgia Retro Electric Water Kettle Nostalgia Retro Breakfast Station Function Start your morning out right with a freshly brewed pot of coffee! Featuring automatic shut off and pause-and-serve to pour a cup mid-brewing cycle Equipped with two large toasting slots to accommodate a variety of breads and 5 browning levels Sure to stand out in any kitchen, this microwave features 12 pre-programmed setting and 800 watts of power Great for baking, convection baking, toasting and broiling a wide variety of tasty meals, snacks and desserts Powerful, 1500-watt kettle rapidly boils up to 1.7 liters of water in just minutes 3-In-1: This versatile breakfast station covers your entire morning breakfast, allowing you to make your Coffee, toast and eggs all at once Capacity 12 Cup 2 Slice 0.9 Cu Ft 0.7 Cu Ft 1.7 L 3-in-1 Available Colors Aqua, Red, Black, Pink, Yellow, Cream Aqua, Red, Black, Pink, Yellow Aqua, Red, Black, Pink, Yellow Aqua, Red Aqua, Red, Pink Aqua, Red, White, Pink, Yellow",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/dffcc0e3-0b00-4419-8cab-fff7e75b9329.__CR0,20,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e198dd4e-7014-4d54-a989-b613d0b4002d.__CR0,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5eb65e13-9ed0-4522-b007-19693b495d39.__CR0,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07d90b76-946e-44bf-b89e-14a7b6d88c3c.__CR0,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/33147a61-36be-41d2-b6b7-b82774d88ca5.__CR0,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d8823f11-aa99-49cb-b754-46c9a3e80d42.__CR0,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3050f3d-fe3b-4b66-b10a-fa9934dd5fed.__CR0,0,1500,3000_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LT.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3LKJ6JOEYXQ35VOPFHI53U46MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGCJD04BQOAIS?ASIN=B07YFDM4V7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Watch video- burritos in 15-20 minutes",
                "reviewText": "The media could not be loaded. I'll post a video.. its small decent size.. Made tea this morning and a few burritos 🌯. It's not big.. so no pizza's unless you cut before cooking. The lid tray at the bottom is your catch tray.. so remember to wash after each cook. Haven't tried the griddle.. had to swap my lid top Handel, this ones was missing.. luckily I had one.. so heads up.. other than that ... I've made square pizza 🍕 😋 burritos and biscuits. Nachos tomorrow Yaya!! No drips or leaks from the coffee pot. Came very well packaged box in a box with Styrofoam sides. I think with aluminum foil I could cook steak and chicken.. ohhhh ideas 💡 lol ohhhh red vinaigrette on raw flesh with onions peppers and season's wrapped, with cressed sides folded and broiled for 1 hour.. making you hungry hungry? 😋 wish u had one now doesn't it lol..update 01/19/2024 I've noticed that the heating element reduces in temperature as the timer clicks to zero.. so if your cooking bacon you might need to just keep turning the timer to max to keep it at a constant heat.. other than that.. its big enough to cook 4 ego waffle st one time.. the coffee maker is wonderful.. ohh one issue is the rack is not as big as the toaster racks.. it fits and works if you don't overload it with weight.. overall it's a good purchase and money well spent..",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8d42d87e-6705-41b7-a3e0-9addc1b859c0/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Cathrine M. JonesCathrine M. Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEHCUUMBAWN2GMM4V7RALY3V6GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JHUJCDMFNNQD?ASIN=B07YFDM4V7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Super convient for cooking and making coffee in RV",
                "reviewText": "I got this delivered yesterday and used it today. I love it. So easy to clean and cook on. It's a little larger than I anticipated it to be, but fits right on my RV kitchen counter. I wanted this because I've been using my single serve Kuerig with regular coffee, not kcups, and it was becoming a hassle to make the send cup of coffee. I also love bagels, eggs and bacon for breakfast. This was so easy to use. Living in an RV, you have so much space to use, so if I wanted to cook breakfast, I have to move things around to get to my stove. The clean up on this things was so easy. I have only two complaints at this time: 1. I added 2.5 cups of water to coffee make but it only made 2 cups. 2. The griddle cover should be bigger, as when cooking bacon, some of the bacon grease that filled around the edges spit out even with griddle covered.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71s1Y0kT8DL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71v2UfZ7P7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Gui7vE97L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "GEDGED",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7OEI3KZP7UHKENNC4EZBANS6NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RECBG18FG8DEX?ASIN=B07YFDM4V7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 25, 2021",
                "reviewTitle": "4.0 out of 5 stars Great 3-in-1 Griddle + Oven + Coffee Maker for Car Camping or Hotel.",
                "reviewText": "I was looking for an Oven + Cooking station to carry in my car trunk when I go camping and sleep in the car.I was hesitating between the Teal Elite Gourmet Americana 2-Slice and the Red Nostalgia BST3RR. Both are small 3-in-1.I've bought both to compare them as I felt that there was not enough information on the product pages.First impressions:The Teal Americana is smaller and the coffee maker feels low-end plasticky.The Teal Americana has only one burner top and one bottom, where the Red Americana has two heating elements in the same positions.At first glance, I really liked that the Red Americana's griddle is the entire size of the oven: any bacon grease splatter will stay on the griddle, while it will land on the teal body on the other one. After using the Teal Americana during a trip, there is no bacon grease spatter due to the glass cover.Both are cute and playful. You want to make something to play with it... very fun toys.The buttons of the Red Nostalgia have a flat portion: one knows where they point to. The Teal Americana has round buttons with a minuscule indentation. I had to paint a white line on them to be able to see where they point.The coffee pot of the Teal Americana looked more secure in a moving car due to its 3 walls, but in the end, it's the Red Nostalagia carafe which is held stronger by the pressure of the no-drip ball.The oven rack of the Teal Americana is tied to the door and moves slightly with the door is opened. The Red Americana is independent of the door and has two positions (one for Teal Americana).Dimensions / Measurements: Length (similar): 19\" for the Red Nostalgia vs 18.5\" for the Teal Americana.Body depth (Teal Americana is way smaller): 7.3\" for Teal AmericanaBackspace needed (when water tank open): similarHeight: similar.Griddle Volume: Big surprising difference: the big Red Nostalgia's griddle is very flat and shallow. I was only able to pour 200 milliliter of water before it reached the cover. The cover also did feel very secure to me, feeling very twisted (see picture). The Teal Americana is much smaller in surface, but has a much bigger depth. I was able to pour 550 milliliter before reaching the cover mark. The Teal contains almost 3X more liquid than the Red.Coffee Pot: Similar: the Red Nostalgia is graduated for 3 cups and contains 522ml, while the Teal Americana is graduated for 4 cups and contains 515ml.Power: I plan to use one for Car Camping powered by the inverter from a Portable Power Station like a MaxOak BlueTTi, so I was especially interested in the Watts in operation. I used a Welltop Plug-in Socket Power Meter, Voltage Watt Energy Meter which gives instant+min+max watts used to measure. All numbers rounded to the nearest 5.Coffee Maker Only: Teal Americana: 605W vs Red Nostalgia: 570W = 6% difference = similar.Top Griddle Only: Teal Americana: 490W vs Red Nostalgia: 850W = 75% difference. No surprise here as I expected the two heating elements to burn 2X the power.Bottom Oven + Top Griddle together (no Coffee Maker): Teal Americana: 760W vs Red Nostalgia: 740W = suprisingly similar. Big surprise here. I reran the test multiple times, and indeed, when the four heating elements of the Red Nostalgia are on, I was seeing less power - 740W - than when only the top two were on - 850W -.Bottom Oven Only: Teal Americana: 290W vs Red Nostalgia: 340W = 17% difference.All on: Coffee Maker + Bottom Oven + Top Griddle: Teal Americana: 1300W vs Red Nostalgia: 1250W. Keeping the surprise, the Red Nostalgia uses less power when everything is turned on.The Red Nostalgia reaches its maximum power of 1350W when the bottom oven is off, and the Coffee Maker and the Top Griddle are both on.As I am very limited by my current inverter (600W) and its batteries, I went with the Teal Americana.My Teal Americana fits in the 40 Liter, 22 Inch Duffle Bags for Women, Men, Travel Heavy Duty (Black) from Trail Maker also bought on Amazon.Already used it on a few day trip where we were staying in hotel (no power limitations there) with fridge and no kitchen. It was used everyday and it was so nice to have breakfast in the room (in bed?) and be able to cook / reheat takeout. I recommend hat you get one of those 3-in-1 if you travel by car and camp or hotel.",
                "reviewVotes": "456 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/815HYtaBeLL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81GCPokb6cL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81Rso6lu3tL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81ZbZ8AXCxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91-Uy88HcqL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91CpU64wYJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91Rpe5Bzx7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91k9H9zpWzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91t3v4nhUbL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91uTZMCeucL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "LAURA LOULAURA LOU",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJSXAFHQFAW72PRWRE5O32NQ3CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDZ029POZ1UOH?ASIN=B07YFDM4V7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars 9/10",
                "reviewText": "Ok, the machine works great. Fabulous little combo machine, I'm a single nomad so its actually perfect for me.HoweverThe dials. Did not come painted.It took me 6 months, 3 ruined meals, and 60 seconds to add some silver paint to the ridges in the dials and NOW it is 10/10. Would buy again.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61GRzpj-yIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAQFZZKZUS35MVASNR5DOYH2GZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ISTMWB78B7MO?ASIN=B07YFDM4V7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars One of the most convenient products vie ever purchased",
                "reviewText": "This has become a staple in my household for breakfast. The toaster oven although basic, functions perfectly. The griddle works great but requires time in-between batches of pancakes or eggs to reheat the griddle. The coffee maker works flawlessly but should allow the coffee to sit about 10 minutes to bring it at peak temperature. Overall, this works a advertised and would recommend this to anyone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonio Rangel Garduño",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 7, 2023",
                "reviewTitle": "Funcional al 100%",
                "reviewText": "Es excelente calienta muy rápido, es muy bonita y todo es funcional.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jon bridge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 17, 2023",
                "reviewTitle": "Neat machine",
                "reviewText": "Unique and can be used for lots. Camping, van living, bachelor apartment. Fits a small area and replaces a couple large kitchen items.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cris Rivera",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 30, 2022",
                "reviewTitle": "Pequeño y práctico.",
                "reviewText": "Es muy práctico si vives en un espacio reducido o solo quieres cocinar para ti. También es útil cuando tu compañía de gas hace mantenimiento. Fácil de manejar, lo que no me agrada tanto es el cable de alimentación eléctrica, ya que es muy delgado y hay que tener cuidado. de que este conectado correctamente a una toma de corriente. El diseño es compacto y muy atractivo, las piezas son de gran calidad. Se pude tener un desayuno rico y divertido.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sandra castro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 25, 2021",
                "reviewTitle": "Hello",
                "reviewText": "The media could not be loaded. hello thank you very much I love this little oven it is magic it cooks with incredible power! I am very happy I really recommend for breakfast in the morning that happiness!🥰",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/C1ea65y4LcS.mp4"
                }
            },
            {
                "reviewerName": "KacyKacy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 24, 2022",
                "reviewTitle": "Not for UK",
                "reviewText": "Even with an adapter, it is just simply not compatible with the U.K.’s 240 V 50 Hz AC electrical circuit. This thing will explode. Even if you do plug it in with an adapter you can get a converter and a step down but that would cost a lot more than the product don’t buy it if you’re in the UK",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61xWZWUOUAL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$79.99",
                "sellerName": "National Houseware Supply LLC",
                "sellerRating": "4"
            }
        ]
    }
}