{
    "remaining_requests": 35329,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cuisinart-TOB-40N-Classic-Toaster-Broiler/dp/B004JMZGM2",
    "body": {
        "name": "Cuisinart TOB-40N Custom Classic Toaster Oven Broiler, 17 Inch, Black",
        "price": "$99.95",
        "originalPrice": "$99.95",
        "rawPrice": 99.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cuisinart-TOB-40N-Classic-Toaster-Broiler/dp/B004JMZGM2",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09N68VYY5"
        ],
        "asinVariationValues": [
            {
                "asin": "B004JMZGM2",
                "variationName": "Style",
                "variationValue": "Toaster Oven",
                "price": "$99.95",
                "variationImageURL": ""
            },
            {
                "asin": "B0BRM8VSPQ",
                "variationName": "Style",
                "variationValue": "Toaster Oven + 2-Slice Toaster",
                "price": "$146.94",
                "variationImageURL": ""
            },
            {
                "asin": "B0C981X9DD",
                "variationName": "Style",
                "variationValue": "Toaster Oven + Can Opener, Black",
                "price": "$116.93",
                "variationImageURL": ""
            },
            {
                "asin": "B0C982JZ7C",
                "variationName": "Style",
                "variationValue": "Toaster Oven + Toaster Oven",
                "price": "$128.05",
                "variationImageURL": ""
            },
            {
                "asin": "B0C983C3KN",
                "variationName": "Style",
                "variationValue": "Toaster Oven + Toaster, White",
                "price": "$139.94",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $14.96 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41pAlDAJsXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41OpA8LnNjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61O1biGt-DL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81YaigwooeS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/611lRbUgAuS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Cuisinart Store",
            "link": "https://www.amazon.com/stores/Cuisinart/page/9EA87106-FA2E-4134-BB4D-18194A61B989?ref_=ast_bln"
        },
        "brand": "Cuisinart",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 6194,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 17 mins",
            "FREE delivery Monday, February 19. Order within 7 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "ENDLESS FUNCTIONS: With 1800 watts of high-performance power you are able to toast, bagel, bake, broil, pizza and keep warm including other options",
            "CAPACITY: Fits 11-inch pizza or 6 slices of toast. .5-cubic feet inside oven toaster, Always EvenTM toast shade control offers consistent results slice after slice",
            "MUST-HAVE FEATURES: The toaster oven has a stainless steel front with a cool-touch handle and easy-grip dials, easy-clean nonstick interior which makes cleaning up easy. Automatic shutoff safety feature, Always Even toast shade control for even toasting and a convenient auto-slide rack to remove cooked food easily",
            "INCLUDED: This beautiful stainless steel toaster oven comes with a baking pan, wire rack, front removable crumb tray with cool touch grip and a recipe book",
            "LIMITED 3-YEAR WARRANTY: Refer to user manual for troubleshooting steps and questions surrounding warranty policies – this product is BPA free"
        ],
        "description": "Compact cooking versatility and modern design make this countertop Custom Classic™ Toaster Oven Broiler an ideal choice for your lifestyle. Brushed stainless and black housing is outfitted with a wire rack, broiling rack and baking/drip pan to handle your tasting, baking, and broiling needs. The nonstick interior and removable front crumb tray are easy to clean. The Always Even™ Shade Control monitors the toasting temperature and will automatically adjust the timing to produce the desired toast every time; auto slide-out rack means convenient, hands-free loading and removal of foods. The cool touch handle and automatic shutoff means safety is ensured.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Kitchen & Dining",
                "link": "https://www.amazon.com/kitchen-dining/b/ref=dp_bc_aui_C_2?ie=UTF8&node=284507"
            },
            {
                "name": "Small Appliances",
                "link": "https://www.amazon.com/kitchen-small-appliances/b/ref=dp_bc_aui_C_3?ie=UTF8&node=289913"
            },
            {
                "name": "Ovens & Toasters",
                "link": "https://www.amazon.com/ovens-toasters/b/ref=dp_bc_aui_C_4?ie=UTF8&node=289933"
            },
            {
                "name": "Toaster Ovens",
                "link": "https://www.amazon.com/Toaster-Ovens-Toasters-Small-Appliances/b/ref=dp_bc_aui_C_5?ie=UTF8&node=289937"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Cuisinart"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "11.74\"D x 17\"W x 8.35\"H"
            },
            {
                "name": "Special Feature",
                "value": "Manual"
            },
            {
                "name": "Control Type",
                "value": "touch"
            },
            {
                "name": "Door Style",
                "value": "Dropdown Door"
            },
            {
                "name": "Included Components",
                "value": "Toaster Oven"
            },
            {
                "name": "Model Name",
                "value": "Cuisinart TOB-40N Custom Classic Toaster Oven Broiler"
            },
            {
                "name": "Finish Type",
                "value": "Brushed"
            },
            {
                "name": "Power Source",
                "value": "Corded Electric"
            },
            {
                "name": "Cable Length",
                "value": "2.5 Feet"
            },
            {
                "name": "Temperature Range",
                "value": "200 - 450 Degrees Fahrenheit"
            },
            {
                "name": "Item Weight",
                "value": "12.9 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Cuisinart"
            },
            {
                "name": "ASIN",
                "value": "B004JMZGM2"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "TOB-40N"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 6,194 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,559 in Kitchen & Dining (See Top 100 in Kitchen & Dining) #11 in Toaster Ovens"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "January 23, 2011"
            },
            {
                "name": "Capacity 0.5 Cubic Feet",
                "value": "Wattage 1800 watts"
            },
            {
                "name": "Material Stainless Steel",
                "value": "Item Weight 12.9 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Toaster Oven Broiler Toaster Oven Broiler Convection Toaster Oven Broiler Digital Convection Toaster Oven Broiler Chef's Convection Toaster Oven Item # TOB-40N TOB-1010 TOB-60N2 TOB-135N TOB-260N1 Capacity .5-Cubic Feet .5-Cubic-Feet .6-Cubic-Feet .6-Cubic-Feet .95-Cubic Feet Cooking Functions Toast, Bagel, Warm, Bake and Broil Toast, Bagel, Bake, Broil, Pizza and Keep Warm Toast, Warm, Bake/Pizza, Broil, Convection Bake and Broil Toast, Bagel, Warm, Bake, Broil, Reheat, Defrost, Convection Bake, Convection Broil Toast, Bagel, Waffle, Keep Warm, Bake, Broil, Roast, Pizza, Leftovers, Sandwich, Dual Cook, +30s, Convection Cooking Settings and Defrost Wattage 1800 1800 1800 1800 1800 Convection ✓ ✓ 2-Settings Digital Controls with Timer and Clock ✓ ✓ Slices of Bread 6 6 6 6 9 Size of Pizza 11-Inch 11-Inch 12-Inch 12-Inch 13-Inch Accessories Included Oven Rack, Baking/Drip Pan and Crumb Tray Baking Pan, Wire Rack and Removable Crumb Tray Oven Rack, Broiling Rack, Baking/Drip Pan and Crumb Tray Oven Rack, Baking/Drip Pan, Broil Rack and Crumb Tray 2 Oven Racks, Baking/Drip Pan, Broiling Pan, 13-Inch Pizza Stone and Crumb Tray Oven Light ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/313f444f-86fe-4835-bca1-9f7a3e8a1a68.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b41015a1-ef8d-4100-b8e4-7ce178b77761.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3169f675-7dbe-49b7-a146-c00186f8cebe.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7271795c-6c63-4738-8cd2-1c92cd8391db.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2363258-f6bc-4e6c-afa6-a33a40d52a04.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/174fcf25-d272-4055-ad3f-24f435e3bb17.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1b674285-94d2-4eb8-9d4e-08ccc6c2fb4c.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02258ff3-7c6d-446f-b7a4-d2a33b0a94ad.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9aca958e-dfc3-4517-8171-296f4445ecba.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Adam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF2KMDTMBOJYRXFLY3WA6BLASAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HHV28KF3FVAC?ASIN=B004JMZGM2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2011",
                "reviewTitle": "5.0 out of 5 stars The Goldilocks of Toaster Ovens",
                "reviewText": "My more expensive, super fancy Krups toaster oven recently kicked the bucket after about 4-5 yrs of service, and it was time to replace it. While my Krups was a good toaster oven (before it died), it took up a lot of space on the counter, it was expensive to buy, and frankly it had a lot of features (convection) and interior space that I just don't use and don't think are necessary in a toaster oven. So when I shopped for a replacement, I decided to go downmarket a bit.Problem is, the toaster oven market is bifurcated towards two extremes and IMO neither is ideal. On the low end, are super cheap pieces of junk. On the higher end, are expensive behemoths that take up all your counter space and have a lot of features that most of us will never use. Now I'll admit, for someone who lives in say a small apartment and doesn't have a regular oven, the second type may make sense. But I live in a house with a regular kitchen and I have a regular oven and a cooktop, as well as a gas grill and a big green egg. What this means is, I'm not going to be roasting a whole chicken or searing steaks or baking any cakes or cooking thanksgiving dinner in my toaster oven. What I mostly use my toaster oven for is 1) toast! and 2) heating up things like leftover pizza or empanadas or really anything else that will get soggy in the microwave but you don't want to wait for the regular oven to preheat when alls you want to do is heat up a single item, and 3) odd things like maybe an open faced sammich or something. So really, anything small that you want to heat up quickly yet still have it be crispy. I have a hunch a large percent of toaster oven owners use them pretty much like I do and want a quality product but don't want a $300 large convection toaster oven taking up all our counter space, but also don't want to trust the $20 hunk of junk that looks like it will die in 2 weeks and can't toast evenly.This toaster oven is a good choice because:1) It's simple - toast, bagel, bake, broil. The analog controls are simple to use, and unlike a digital keypad it \"remembers\" what your last setting was (for say toast darkness or oven temp), which you are likely to use repeatedly. Some reviews complained the controls are hard to read, and I don't find this to be a problem although I do have good near-sight vision. The crum tray is easy to remove, clean, and replace.2) It works - nice even toasting. Heats up quickly for reheating items. I was surprised at how light it was out of the box, but it works well so this doesn't appear to be a problem.3) It's a fair price - way cheaper than the expensive convection ovens, but not so cheap as to be garbage4) Small footprint - doesn't take up much counter space yet still big enough for everything I want a toaster oven to do. Honestly if something can't fit in this thing I have no problem firing up the regular oven.Now, there seem to be 2 basic complaints on this model and I don't find either to be a problem:1) No timer - who cares? I'm only using it for toast (which does shut off when it reaches desired darkness) and to heat up small stuff that only takes a few minutes, I can hang around and keep an eye on it. Again, this seems like more of a problem for people who want to bake a cake or something and I don't know why you'd want to use a toaster oven to do that.2) A lot of people complain that the toast comes out too dark - I'm puzzled by these complaints as I find it extremely easy to set the toaster to desired darkness. The medium setting comes out pretty much what I'd expect medium toast to be, and more importantly you have infinite adjustability with the analog controls so it shouldn't take you much experimenting to figure out how you want it. One person even complained they had this for over a month and couldn't get toast that wasn't burned - I'd say this person either got a defective unit, or they are severely challenged when it comes to the operation of small electronics and/or employing the trial and error method.Overall - there should be more toaster ovens in this segment. If you don't routinely roast whole prime ribs or do hard core baking in your toaster oven, this should suit your needs well.Edit: Well, 3 1/2 years later, one of the coils was coming apart and my girlfriend threw the Cuisinart away because she claims that's a fire hazard! Replacement is a Kitchenaid unit purchased from Costco (which also doesn't have a lot of unnecessary bells and whistles, although it's a bit bigger). The new Kitchenaid definitely does not toast as quickly or evenly as the trusty old Cuisinart! I wish we'd just bought another as it's replacement. 3 1/2 years isn't too bad for a toaster oven that was used fairly often and not really taken care of, rarely cleaned etc. I stand by my old 5 star review.",
                "reviewVotes": "1,494 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alyssa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENOSUE65N4UEUXZ6ZBGMLI6J23Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20SW2EQ13186B?ASIN=B004JMZGM2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2013",
                "reviewTitle": "5.0 out of 5 stars A+!",
                "reviewText": "We just moved into a new apartment, and are slowly filling it up with appliances. We made the outrageous decision to not buy a microwave or a toaster, and bought this instead. No regrets!1. It toasts well. It's pretty darn even, the only times I've had trouble are when I don't put the bread quite in the middle, and that's my fault. It doesn't take long at all, and you can fit four pieces of decent sized bread in there comfortably, without smooshing them together.2. When setting it to the bake option, it heats up so fast! Obviously it would (especially compared to the large oven) but man is it nice, especially when you want to cook one mini frozen pizza or a single potato or something.3. The broiler function broils successfully. Not much more to say except yes it does get hot enough, so yay.4. It is SO EASY to clean! The little tray just slides out with no problem for a quick wash, and then right back in. No awkward maneuvering around racks or anything of the sort.As far as doing its job, this little toaster oven has not let me down. It looks nice on the counter, and doesn't take up too much room in our tiny apartment kitchen. Like other reviewers have said, it does get hot, which means nothing can be stored on top of of or even next to it, but its not really a big deal. Just be careful not to touch the darn thing and you'll be okay.Our MAIN ISSUE with it is the damn beeping. When your toast is done it beeps incredibly loudly, and a very unnecessary FIVE times. It's so loud that my first thought is nearly always \"Oh no the toast is burnt and the smoke alarm went off!\" Not the sort of panic one needs in the morning.If anything horrible happens, I'll update this review, but until then all is well!Great buy!",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SMC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTPLCBPVT23FAWFCLT3GTEMA6JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L4U0YK0R4NSO?ASIN=B004JMZGM2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2023",
                "reviewTitle": "4.0 out of 5 stars Second Time Around",
                "reviewText": "I bought one of these in 2011 and it lasted 10 years. I think for a simple inexpensive plain old toaster oven it did very well for that long, with use at least four times a week. I stopped using it when it got the split in the bottom rod others have mentioned, and while I agree that this should never happen, I hope they have this problem fixed, because in the meantime, I ordered and returned four other brands/kinds of toaster ovens (some with air fryer added).The four I returned all had aggravating problems, such as never getting the temperature right on anything no matter how much experimentation, hard to clean, inability to see the food cooking, too small to hold a reasonable amount of food, confusing settings (whether digital or not), and burned fingers from poorly designed doors and racks. Some of these were a lot more expensive than this one.So, I am crossing my fingers and ordered this one again, because it cooks very well. I can use the baking function at the same temps as the big oven, and everything comes out right. Toast comes out well, as does broiling. The space inside is large and wide enough for our small-for-two glass baking dishes, and they do just fine, and in about the same amount of time as the big oven. My only complaint is that I need to put on my strong glasses to read the function buttons, but it's a quick learn which is which. It also gets hot on the top and front, but most toaster ovens do. I just steer clear and make sure the oven has plenty of room to itself on the counter. I know it seems crazy to buy something that had a problem the last time, but it's the best I've found for everyday functioning.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Margaret Angelastro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNKQWGYFLYIVTPNKLWVONFSBMZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SPXJS79AEIRF?ASIN=B004JMZGM2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Cusinart Toaster Oven",
                "reviewText": "Had this previously, died after years. Bought a less expensive, Black and Decker, Horrible product. Difficult to turn on and off. Catches toast afire quickly. I just purchased the Cuisanart AGAIN. A wonderful product!! Easy to dial to each source wanted. Large space, top quality product. I love it. We get what we pay for.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marc allain",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 16, 2023",
                "reviewTitle": "Love it",
                "reviewText": "We had the same one for 10 years. Happy to find the exact replacement. Great smaller size than what is out there now. Does great bagels.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Salomon Duek",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 22, 2020",
                "reviewTitle": "Mejor!",
                "reviewText": "El mejor hornito",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelly C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 31, 2014",
                "reviewTitle": "Reliable Toaster",
                "reviewText": "Although this toaster is a little larger than what we were looking for, it has performed perfectly so far and looks nice on the counter. The hooks on the door that pull out the rack are very handy and have made removing items from the toaster very easy. The toasting function is very consistent, and the unit heats up fairly quickly for broiling or oven functions.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 8, 2018",
                "reviewTitle": "It has multiple functions which I have tried and work great. It's extra large for bigger meals and has ...",
                "reviewText": "This oven is a bit bigger and fancier than my old Betty Crocker one. It has multiple functions which I have tried and work great. It's extra large for bigger meals and has a nice look. I don't like the black exterior but looking at the stainless steel one, it would have cost $30+ more for a stainless steel one and more functions/features I probably wouldn't use. I normally just bake in my oven.I am curious about that metal piece in the oven on the left hand side. I find it gets in the way when you are baking at the middle level. Does anyone know what this is for? I love the fact that the crumb tray is a removable tray vs the hinged one from my old oven. If you're looking for durable, affordable, and stylish, this oven fits the criteria.Pros:StylishMulti functionsPull out crumb trayLarge cooking surfaceCons:Black exteriorNo timer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Witkowskyj",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 9, 2014",
                "reviewTitle": "Toaster Oven",
                "reviewText": "Functional unit that is the perfect fit. Not to big or small. Controls are easy to understand and use. Excellent cooking and toasting results.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$98.95",
                "sellerName": "Highflyer214",
                "sellerRating": "4"
            },
            {
                "price": "$99.95",
                "sellerName": "Kitchen Kapers",
                "sellerRating": "5"
            }
        ]
    }
}