{
    "remaining_requests": 683,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/March-Book-One-John-Lewis/dp/1603093001",
    "body": {
        "name": "March: Book One",
        "price": "$8.25$8.25",
        "originalPrice": "",
        "rawPrice": 8.25,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/March-Book-One-John-Lewis/dp/1603093001",
        "soldBy": {
            "sellerID": "A2OGGFVC1TNCU1",
            "name": "Revolver Market",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2OGGFVC1TNCU1&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81tM8xMJNjL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "John Lewis",
            "link": "https://www.amazon.com/John-Lewis/e/B001ILM7LA/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Revolver Market",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 4385,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 29 mins",
            "FREE delivery March 2 - 11 on orders shipped by Amazon over $35",
            "Or fastest delivery March 1 - 7"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2"
            },
            {
                "name": "Community & Culture",
                "link": "https://www.amazon.com/Ethnic-National-Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2365"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Top Shelf Productions; 1st edition (August 13, 2013)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 128 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1603093001"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1603093002"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 13 - 16 years"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN760L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.56 x 0.39 x 9.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,971 in Books (See Top 100 in Books) #9 in Biographies & History Graphic Novels #50 in Black & African American Biographies #327 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 4,385 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/a00b55ef-14f5-49c4-930f-4fa0737bba43.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5a6beed1-5493-4117-abab-fad0e622a795.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8f239073-c791-4541-be4a-f03a4933f6b2.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6efba99b-f1d8-49c4-9caf-7f3f19e3edf9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2ba8bd1a-c102-48d0-ae68-a24da8a4fc48.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/121d5ca1-c51e-489d-b6fd-585d62ce0f39.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3a64bb3c-8548-4b48-92de-6cb9bcd9443a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/864a1bca-37bd-4530-a625-dc62bdc43401.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jamusu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOQW6WYUD7HQXM46BPDJ2LZRNSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10YG9W0D1ZB7X?ASIN=1603093001",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2016",
                "reviewTitle": "5.0 out of 5 stars A MUCH NEEDED MEMOIR OF A NOT SO DISTANT SHAMEFUL ERA IN AMERICAN HISTORY.",
                "reviewText": "\"March: Book One\", the first book of a trilogy in the graphic novel format, is a tantalizing account of, “The United States Civil Rights Movement”, as seen through the eyes of United States Congressmen John Lewis. Written by Lewis and his co-writer Andrew Aydin, with illustrations by Nate Powell, this autobiographical memoir delivers to the reader an acute awareness of the unjust trials and tribulations forced upon Black Americans by White Americans during this not so distant era in American history.Currently, it is difficult to fathom what it was like to be a Black American living under the dark hateful and ominous cloud of segregation. Most young Americans of todays generation have little to no knowledge of this oppressive ideology and hierarchy of racial bias that was widely accepted as the norm. Even those Americans familiar with this period sometimes view these acts of injustice as memories that should be forgotten or no longer discussed. This is a faulty misconception in that a more thorough understanding of race relations in this country will never be fully attained unless we as a society actively confront this shameful time period in our history with compassion and respect. \"March: Book One\", can be used as a vehicle to bring about this understanding.This autobiographical memoir is an emotional visual rendering of historical significance that follows Lewis' life from his very humble farming beginnings, to his college years whereby he fought for basic human rights not given Blacks due to social segregation based on racial discrimination. It also follows his present day life as a U.S. Congressman while preparing for the inauguration of President Barack Obama. It provides the viewer a look into the pivotal role he played in abrogating the atrocities of segregation through measures of non-violent resistance, although he and many others were violently attacked by those intent on keeping things the same.These events are masterly interwoven to form a very enjoyable reading/viewing experience. Lewis and Aydin's astutely written text transports the reader back to these moments; arduously unjust moments that can only be accurately written by a person who actually lived through them. Powell's mesmerizing illustrations show Lewis and a number of heroic figures as they organized marches, protests, and student sit-ins at, “White Only”, restaurants that more often times than not led to their arrests. Powell also masterfully used varying shading techniques and brush strokes that brilliantly rendered a tension filled atmosphere befitting Lewis and Aydin's accompanying text.“March: Book One\", by Lewis, Aydin, and Powell is an invaluable lesson for any society interested in achieving deep-rooted social change in the face of discrimination and segregation as based on racial biases. As a lover of American history and avid graphic novel/comic book reader with a small collection of over 3,000 titles, I found this graphic novel a joy to read and study. It is well written and beautifully illustrated. Also, the layout is easy to follow; granting those who have never read a graphic novel or comic book a perfect entry into this medium.I, as a result, emphatically suggest you purchase this award winning graphic novel as a means of learning of the sacrifices made by this legendary living icon (Congressman Lewis) as related to his fight to attain basic civil rights and equality stripped away from Blacks by the United States Government during \"The American Civil Rights Movement\".Let it be known, I do not view, “March: Book One”, as an attempt to demonize the United States Government or those individuals who participated in these now socially unacceptable acts of in humanity. I instead see it as a historical document of record that reveals the tremendous strides this country has consciously made the past sixty years or so to combat discrimination and segregation as based on racial biases. Although there is still more work to be done, it is clear that things have changed for the better.The fact that the events within the pages of this graphic novel occur less often, give me hope that we as American's will continue to repentantly grow in this area. This will in return ensure we do not repeat the sins of our past while attempting to usher into existence a United States of America indicative of the writings of our forefathers.My only gripe which is embarrassingly petty on my behalf has to do with the year long wait for the release of “Volume Two\" of this trilogy. Most graphic novel/comic book collectors are severely impatient when it comes to obtaining the next issue of an ongoing series, a category I am admittedly a part of. I will be as I am extremely grateful to have been granted the opportunity of owning a copy of this most wonderful piece of literary genius.Respectfully,Jamusu.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wiredweird",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7EPZEJCL3KKSMZVCBYPGGTPISQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WAPOJAFYJF1J?ASIN=1603093001",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2013",
                "reviewTitle": "5.0 out of 5 stars Comics assigned in history class?",
                "reviewText": "It's going to happen - and \"March\" could well be the first such assignment.This presents a graphic-novel bio of Rep. John Lewis (D), an influential activist in the 1960s civil rights movement. The word \"graphic\" applies in other ways than just the graphic-novel medium, though. It graphically brings back the violence of that era (without the most disturbing imagery), violence against the Americans asking for basic rights as Americans, police letting it happen. It captures some of the realities of the era, like planning an interstate road trip so as to avoid the whites-only enclaves along the way. (Planning the trip from refuge to refuge brought to mind the Underground Railroad of an earlier era, serving an eerily similar purpose.) It also brings to life the heroism of non-violence, the bravery to stand in the way of hatred and violence without responding in kind. In one brief passage, \"March\" notes honorable and determined people who, on looking deep within themselves, could not find that special kind of bravery. Face the enemy, yes; face with peace, no.So much comes together to make this an exceptional record. There's Lewis himself, a recognized and honored leader of the movement, who continues to work for equality today. There's the raw drama of the time, and especially of the non-violence movement. There's that moment in living history captured before it can fade. These events occurred fifty or more years in the past, and the ones who lived it won't live forever. The time to record their stories in their words won't last that much longer. There's also Nate Powell's stunning artwork. I've valued his delicate and expressive use of the comic idiom since I first saw it , and this volume demonstrates his skill at its highest peak to date. And, I'm sure that blurb on the back cover by a living former U.S. president was not given lightly.I can't ignore the possibility that Lewis engaged in this project at least partly as a political and publicity ploy. Politicians need to get their name in front of people, and keep getting it there, and he's a politician. If that's the case, so be it. People do things for multiple reasons. \"March\" remains a valid, moving, first-hand historical record whatever the motivations of its creators might be. (Powell expected to get paid for his work, I'm sure, but that doesn't invalidate the mastery displayed here.) This has my highest recommendation.-- wiredweird",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa Shea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHY4XGQ6YJW6H5MBKBSFHMGENFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JN9A9NPPFMQA?ASIN=1603093001",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2017",
                "reviewTitle": "5.0 out of 5 stars A must-read for all ages",
                "reviewText": "I'm sure there are some people out there who still think of all graphic novels as being for small children. Quite the opposite. \"March\" demonstrates how incredibly powerful the graphic format can be for conveying mood and emotion. The story comes to life in a way which straightforward words might not have easily achieved.In March we take a first-hand look at the struggles of the Civil Rights era. It is probably hard for some younger readers to realize that the US society was like this only the blink-of-an-eye ago. Bathrooms would be for whites only - someone who was not white would be beaten if they tried to use it. Only whites could sit to eat at lunch counters.College students who saw how unjust this was went through rigorous training to lobby for a change in a *peaceful* manner. They practiced how to stay silent even when abused. How to wait it out. This was an absolute key to everything. Do not give in to the hate. Do not lower oneself to the level of the bigoted attacker. Practice patience and peace.These are lessons we *all* can learn. There are still rampant injustices now. There are still racist bullies out there, clearly. The more we can all band together, stand up, and peacefully but determinedly remain strong, the more we can overcome. The more we can bring about a change.And, as an added note, I adored the sections about him growing up with his chickens. That's what I would have been like - caring for them and burying them in little graves. It adds a human touch that really brings the story to life.Both the Kindle (ebook) and the paperback versions of this are equally stunning.Highly, highly recommended for all ages.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Isaac Vergne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 6, 2020",
                "reviewTitle": "Great books, innovative!",
                "reviewText": "A innovative way to tell such a important story. Important not only to the Americans, but to citizens of any country that faced and is facing racism and prejudice in any way?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Oskr",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 28, 2019",
                "reviewTitle": "Perfecto estado y antes de lo esperado",
                "reviewText": "Excelente novela gráfica sobre la lucha de los derechos de los afroamericanos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kuschel17",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 8, 2020",
                "reviewTitle": "Spannend!",
                "reviewText": "Ein tolles Buch.....dem die Grafik mal wieder das besondere Etwas gibt....ich freue mich auch die weiteren Bände ?! Wenn diese kommen....",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emi Bevacqua",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 26, 2020",
                "reviewTitle": "Am buying books 2 and 3 of this series immediately!",
                "reviewText": "I love that John Lewis was inspired by a comic book based on Martin Luther King's quest for civil rights, and have no doubt that March will go on to galvanize future leaders making gains in social justice as well. This book truly is on par with Maus and Persepolis for historical accuracy, unflinching realism, and cultural ethos. Both my 12-yr olds agree with me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sahana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 18, 2019",
                "reviewTitle": "Amazing insight into the struggle of African Americans",
                "reviewText": "Wonderful story that gives you an insight into the fight of young African American students against segregation. This can be read by children and adults of all ages and I think it's a worthy inclusion into everyone's read list.The book quality is great but if you don't want to spend 400rs for a small book you might want to give it a miss. If you are a graphic novel fan go right ahead and buy it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.98",
                "sellerName": "ZBK Books",
                "sellerRating": "4.5"
            },
            {
                "price": "$3.80",
                "sellerName": "symposia",
                "sellerRating": "5"
            },
            {
                "price": "$8.02",
                "sellerName": "Murfbooks",
                "sellerRating": "5"
            }
        ]
    }
}