{
    "remaining_requests": 483,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cold-Blood-Truman-Capote/dp/0679745580",
    "body": {
        "name": "In Cold Blood",
        "price": "$11.79$11.79",
        "originalPrice": "",
        "rawPrice": 11.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cold-Blood-Truman-Capote/dp/0679745580",
        "soldBy": {
            "sellerID": "A2OGGFVC1TNCU1",
            "name": "Revolver Market",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2OGGFVC1TNCU1&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/613Du3aDx8L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Truman Capote",
            "link": "https://www.amazon.com/Truman-Capote/e/B000APW81E/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Revolver Market",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 21730,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Amazon.com Review \"Until one morning in mid-November of 1959, few Americans--in fact, few Kansans--had ever heard of Holcomb. Like the waters of the river, like the motorists on the highway, and like the yellow trains streaking down the Santa Fe tracks, drama, in the shape of exceptional happenings, had never stopped there.\" If all Truman Capote did was invent a new genre--journalism written with the language and structure of literature--this \"nonfiction novel\" about the brutal slaying of the Clutter family by two would-be robbers would be remembered as a trail-blazing experiment that has influenced countless writers. But Capote achieved more than that. He wrote a true masterpiece of creative nonfiction. The images of this tale continue to resonate in our minds: 16-year-old Nancy Clutter teaching a friend how to bake a cherry pie, Dick Hickock's black '49 Chevrolet sedan, Perry Smith's Gibson guitar and his dreams of gold in a tropical paradise--the blood on the walls and the final \"thud-snap\" of the rope-broken necks. Review \"A masterpiece ... a spellbinding work.\" —Life\"A remarkable, tensely exciting, superbly written 'true account.' \" —The New York Times\"The best documentary account of an American crime ever written ... The book chills the blood and exercises the intelligence ... harrowing.\" —The New York Review of Books From the Inside Flap With the publication of this book, Capote permanently ripped through the barrier separating crime reportage from serious literature. As he reconstructs the 1959 murder of a Kansas farm family and the investigation that led to the capture, trial, and execution of the killers, Capote generates suspense and empathy. About the Author TRUMAN CAPOTEwas born September 30, 1924, in New Orleans. After his parents’ divorce, he was sent to live with relatives in Monroeville, Alabama. It was here he would meet his lifelong friend, the author Harper Lee. Capote rose to international prominence in 1948 with the publication of his debut novel, Other Voices, Other Rooms. Among his celebrated works are Breakfast at Tiffany’s, A Tree of Night, The Grass Harp, Summer Crossing, A Christmas Memory, and In Cold Blood, widely considered one of the greatest books of the twentieth century. Twice awarded the O. Henry Short Story Prize, Capote was also the recipient of a National Institute of Arts and Letters Creative Writing Award and an Edgar Award. He died August 25, 1984, shortly before his sixtieth birthday. Excerpt. © Reprinted by permission. All rights reserved. I The Last to See Them Alive THE village of Holcomb stands on the high wheat plains of western Kansas, a lonesome area that other Kansans call \"out there.\" Some seventy miles east of the Colorado border, the countryside, with its hard blue skies and desert-clear air, has an atmosphere that is rather more Far West than Middle West. The local accent is barbed with a prairie twang, a ranch-hand nasalness, and the men, many of them, wear narrow frontier trousers, Stetsons, and high-heeled boots with pointed toes. The land is flat, and the views are awesomely extensive; horses, herds of cattle, a white cluster of grain elevators rising as gracefully as Greek temples are visible long before a traveler reaches them. Holcomb, too, can be seen from great distances. Not that there is much to see--simply an aimless congregation of buildings divided in the center by the main-line tracks of the Santa Fe Railroad, a haphazard hamlet bounded on the south by a brown stretch of the Arkansas (pronounced \"Ar-kan-sas\") River, on the north by a highway, Route 50, and on the east and west by prairie lands and wheat fields. After rain, or when snowfalls thaw, the streets, unnamed, unshaded, unpaved, turn from the thickest dust into the direst mud. At one end of the town stands a stark old stucco structure, the roof of which supports an electric sign--DANCE--but the dancing has ceased and the advertisement has been dark for several years. Nearby is another building with an irrelevant sign, this one in flaking gold on a dirty window--HOLCOMB BANK. The bank closed in 1933, and its former counting rooms have been converted into apartments. It is one of the town's two \"apartment houses,\" the second being a ramshackle mansion known, because a good part of the local school's faculty lives there, as the Teacherage. But the majority of Holcomb's homes are one-story frame affairs, with front porches. Down by the depot, the postmistress, a gaunt woman who wears a rawhide jacket and denims and cowboy boots, presides over a falling-apart post office. The depot itself, with its peeling sulphur-colored paint, is equally melancholy; the Chief, the Super-Chief, the El Capitan go by every day, but these celebrated expresses never pause there. No passenger trains do--only an occasional freight. Up on the highway, there are two filling stations, one of which doubles as a meagerly supplied grocery store, while the other does extra duty as a café--Hartman's Café, where Mrs. Hartman, the proprietress, dispenses sandwiches, coffee, soft drinks, and 3.2 beer. (Holcomb, like all the rest of Kansas, is \"dry.\") And that, really, is all. Unless you include, as one must, the Holcomb School, a good-looking establishment, which reveals a circumstance that the appearance of the community otherwise camouflages: that the parents who send their children to this modern and ably staffed \"consolidated\" school--the grades go from kindergarten through senior high, and a fleet of buses transport the students, of which there are usually around three hundred and sixty, from as far as sixteen miles away--are, in general, a prosperous people. Farm ranchers, most of them, they are outdoor folk of very varied stock--German, Irish, Norwegian, Mexican, Japanese. They raise cattle and sheep, grow wheat, milo, grass seed, and sugar beets. Farming is always a chancy business, but in western Kansas its practitioners consider themselves \"born gamblers,\" for they must contend with an extremely shallow precipitation (the annual average is eighteen inches) and anguishing irrigation problems. However, the last seven years have been years of droughtless beneficence. The farm ranchers in Finney County, of which Holcomb is a part, have done well; money has been made not from farming alone but also from the exploitation of plentiful natural-gas resources, and its acquisition is reflected in the new school, the comfortable interiors of the farmhouses, the steep and swollen grain elevators. Until one morning in mid-November of 1959, few Americans--in fact, few Kansans--had ever heard of Holcomb. Like the waters of the river, like the motorists on the highway, and like the yellow trains streaking down the Santa Fe tracks, drama, in the shape of exceptional happenings, had never stopped there. The inhabitants of the village, numbering two hundred and seventy, were satisfied that this should be so, quite content to exist inside ordinary life--to work, to hunt, to watch television, to attend school socials, choir practice, meetings of the 4-H Club. But then, in the earliest hours of that morning in November, a Sunday morning, certain foreign sounds impinged on the normal nightly Holcomb noises--on the keening hysteria of coyotes, the dry scrape of scuttling tumbleweed, the racing, receding wail of locomotive whistles. At the time not a soul in sleeping Holcomb heard them--four shotgun blasts that, all told, ended six human lives. But afterward the townspeople, theretofore sufficiently unfearful of each other to seldom trouble to lock their doors, found fantasy re-creating them over and again--those somber explosions that stimulated fires of mistrust in the glare of which many old neighbors viewed each other strangely, and as strangers. THE master of River Valley Farm, Herbert William Clutter, was forty-eight years old, and as a result of a recent medical examination for an insurance policy, knew himself to be in first-rate condition. Though he wore rimless glasses and was of but average height, standing just under five feet ten, Mr. Clutter cut a man's-man figure. His shoulders were broad, his hair had held its dark color, his square-jawed, confident face retained a healthy-hued youthfulness, and his teeth, unstained and strong enough to shatter walnuts, were still intact. He weighed a hundred and fifty-four--the same as he had the day he graduated from Kansas State University, where he had majored in agriculture. He was not as rich as the richest man in Holcomb--Mr. Taylor Jones, a neighboring rancher. He was, however, the community's most widely known citizen, prominent both there and in Garden City, the close-by county seat, where he had headed the building committee for the newly completed First Methodist Church, an eight-hundred-thousand-dollar edifice. He was currently chairman of the Kansas Conference of Farm Organizations, and his name was everywhere respectfully recognized among Midwestern agriculturists, as it was in certain Washington offices, where he had been a member of the Federal Farm Credit Board during the Eisenhower administration. Always certain of what he wanted from the world, Mr. Clutter had in large measure obtained it. On his left hand, on what remained of a finger once mangled by a piece of farm machinery, he wore a plain gold band, which was the symbol, a quarter-century old, of his marriage to the person he had wished to marry--the sister of a college classmate, a timid, pious, delicate girl named Bonnie Fox, who was three years younger than he. She had given him four children--a trio of daughters, then a son. The eldest daughter, Eveanna, married and the mother of a boy ten months old, lived in northern Illinois but visited Holcomb frequently. Indeed, she and her family were expected within the fortnight, for her parents planned a sizable Thanksgiving reunion of the Clutter clan (which had its beginnings in Germany; the first immigrant Clutter--or Klotter, as the name was then spelled--arrived here in 1880); fifty-odd kinfolk had been asked, several of whom would be traveling from places as far away as Palatka, Florida. Nor did Beverly, the child next in age to Eveanna, any longer reside at River Valley Farm; she was in Kansas City, Kansas, studying to be a nurse. Beverly was engaged to a young biology student, of whom her father very much approved; invitations to the wedding, scheduled for Christmas Week, were already printed. Which left, still living at home, the boy, Kenyon, who at fifteen was taller than Mr. Clutter, and one sister, a year older--the town darling, Nancy. In regard to his family, Mr. Clutter had just one serious cause for disquiet--his wife's health. She was \"nervous,\" she suffered \"little spells\"--such were the sheltering expressions used by those close to her. Not that the truth concerning \"poor Bonnie's afflictions\" was in the least a secret; everyone knew she had been an on-and-off psychiatric patient the last half-dozen years. Yet even upon this shadowed terrain sunlight had very lately sparkled. The past Wednesday, returning from two weeks of treatment at the Wesley Medical Center in Wichita, her customary place of retirement, Mrs. Clutter had brought scarcely credible tidings to tell her husband; with joy she informed him that the source of her misery, so medical opinion had at last decreed, was not in her head but in her spine--it was physical, a matter of misplaced vertebrae. Of course, she must undergo an operation, and afterward--well, she would be her \"old self\" again. Was it possible--the tension, the withdrawals, the pillow-muted sobbing behind locked doors, all due to an out-of-order backbone? If so, then Mr. Clutter could, when addressing his Thanksgiving table, recite a blessing of unmarred gratitude. Ordinarily, Mr. Clutter's mornings began at six-thirty; clanging milk pails and the whispery chatter of the boys who brought them, two sons of a hired man named Vic Irsik, usually roused him. But today he lingered, let Vic Irsik's sons come and leave, for the previous evening, a Friday the thirteenth, had been a tiring one, though in part exhilarating. Bonnie had resurrected her \"old self\"; as if serving up a preview of the normality, the regained vigor, soon to be, she had rouged her lips, fussed with her hair, and, wearing a new dress, accompanied him to the Holcomb School, where they applauded a student production of Tom Sawyer, in which Nancy played Becky Thatcher. He had enjoyed it, seeing Bonnie out in public, nervous but nonetheless smiling, talking to people, and they both had been proud of Nancy; she had done so well, remembering all her lines, and looking, as he had said to her in the course of backstage congratulations, \"Just beautiful, honey--a real Southern belle.\" Whereupon Nancy had behaved like one; curtsying in her hoop-skirted costume, she had asked if she might drive into Garden City. The State Theatre was having a special, eleven-thirty, Friday-the-thirteenth \"Spook Show,\" and all her friends were going. In other circumstances Mr. Clutter would have refused. His laws were laws, and one of them was: Nancy--and Kenyon, too--must be home by ten on week nights, by twelve on Saturdays. But weakened by the genial events of the evening, he had consented. And Nancy had not returned home until almost two. He had heard her come in, and had called to her, for though he was not a man ever really to raise his voice, he had some plain things to say to her, statements that concerned less the lateness of the hour than the youngster who had driven her home--a school basketball hero, Bobby Rupp. Mr. Clutter liked Bobby, and considered him, for a boy his age, which was seventeen, most dependable and gentlemanly; however, in the three years she had been permitted \"dates,\" Nancy, popular and pretty as she was, had never gone out with anyone else, and while Mr. Clutter understood that it was the present national adolescent custom to form couples, to \"go steady\" and wear \"engagement rings,\" he disapproved, particularly since he had not long ago, by accident, surprised his daughter and the Rupp boy kissing. He had then suggested that Nancy discontinue \"seeing so much of Bobby,\" advising her that a slow retreat now would hurt less than an abrupt severance later--for, as he reminded her, it was a parting that must eventually take place. The Rupp family were Roman Catholics, the Clutters, Methodist--a fact that should in itself be sufficient to terminate whatever fancies she and this boy might have of some day marrying. Nancy had been reasonable--at any rate, she had not argued--and now, before saying good night, Mr. Clutter secured from her a promise to begin a gradual breaking off with Bobby. Still, the incident had lamentably put off his retiring time, which was ordinarily eleven o'clock. As a consequence, it was well after seven when he awakened on Saturday, November 14, 1959. His wife always slept as late as possible. However, while Mr. Clutter was shaving, showering, and outfitting himself in whipcord trousers, a cattleman's leather jacket, and soft stirrup boots, he had no fear of disturbing her; they did not share the same bedroom. For several years he had slept alone in the master bedroom, on the ground floor of the house--a two-story, fourteen-room frame-and-brick structure. Though Mrs. Clutter stored her clothes in the closets of this room, and kept her few cosmetics and her myriad medicines in the blue-tile-and-glass-brick bathroom adjoining it, she had taken for serious occupancy Eveanna's former bedroom, which, like Nancy's and Kenyon's rooms, was on the second floor. The house--for the most part designed by Mr. Clutter, who thereby proved himself a sensible and sedate, if not notably decorative, architect--had been built in 1948 for forty thousand dollars. (The resale value was now sixty thousand dollars.) Situated at the end of a long, lanelike driveway shaded by rows of Chinese elms, the handsome white house, standing on an ample lawn of groomed Bermuda grass, impressed Holcomb; it was a place people pointed out. As for the interior, there were spongy displays of liver-colored carpet intermittently abolishing the glare of varnished, resounding floors; an immense modernistic living-room couch covered in nubby fabric interwoven with glittery strands of silver metal; a breakfast alcove featuring a banquette upholstered in blue-and-white plastic. This sort of furnishing was what Mr. and Mrs. Clutter liked, as did the majority of their acquaintances, whose homes, by and large, were similarly furnished. Other than a housekeeper who came in on weekdays, the Clutters employed no household help, so since his wife's illness and the departure of the elder daughters, Mr. Clutter had of necessity learned to cook; either he or Nancy, but principally Nancy, prepared the family meals. Mr. Clutter enjoyed the chore, and was excellent at it--no woman in Kansas baked a better loaf of salt-rising bread, and his celebrated coconut cookies were the first item to go at charity cake sales--but he was not a hearty eater; unlike his fellow-ranchers, he even preferred Spartan breakfasts. That morning an apple and a glass of milk were enough for him; because he touched neither coffee or tea, he was accustomed to begin the day on a cold stomach. The truth was he opposed all stimulants, however gentle. He did not smoke, and of course he did not drink; indeed, he had never tasted spirits, and was inclined to avoid people who had--a circumstance that did not shrink his social circle as much as might be supposed, for the center of that circle was supplied by the members of Garden City's First Methodist Church, a congregation totaling seventeen hundred, most of whom were as abstemious as Mr. Clutter could desire. While he was careful to avoid making a nuisance of his views, to adopt outside his realm an externally uncensoring manner, he enforced them within his family and among the employees at River Valley Farm. \"Are you a drinking man?\" was the first question he asked a job applicant, and even though the fellow gave a negative answer, he still must sign a work contract containing a clause that declared the agreement instantly void if the employee should be discovered \"harboring alcohol.\" A friend--an old pioneer rancher, Mr. Lynn Russell--had once told him, \"You've got no mercy. I swear, Herb, if you caught a hired man drinking, out he'd go. And you wouldn't care if his family was starving.\" It was perhaps the only criticism ever made of Mr. Clutter as an employer. Otherwise, he was known for his equanimity, his charitableness, and the fact that he paid good wages and distributed frequent bonuses; the men who worked for him--and there were sometimes as many as eighteen--had small reason to complain. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 50 mins",
            "FREE delivery March 4 - 15 on orders shipped by Amazon over $35",
            "Or fastest delivery March 2 - 12",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 13 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NATIONAL BESTSELLER • The most famous true crime novel of all time \"chills the blood and exercises the intelligence\" (The New York Review of Books)—and haunted its author long after he finished writing it. On November 15, 1959, in the small town of Holcomb, Kansas, four members of the Clutter family were savagely murdered by blasts from a shotgun held a few inches from their faces. There was no apparent motive for the crime, and there were almost no clues. In one of the first non-fiction novels ever written, Truman Capote reconstructs the murder and the investigation that led to the capture, trial, and execution of the killers, generating both mesmerizing suspense and astonishing empathy. In Cold Blood is a work that transcends its moment, yielding poignant insights into the nature of American violence. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9"
            },
            {
                "name": "Americas",
                "link": "https://www.amazon.com/Americas-History-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4808"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Knopf Doubleday Publishing Group (February 1, 1994)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 343 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0679745580"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0679745587"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 1040L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.11 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 8.5 x 5.43 x 0.15 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#598 in Books (See Top 100 in Books) #1 in Criminology (Books) #9 in U.S. State & Local History #12 in Murder & Mayhem True Accounts"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 21,730 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "judgechris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPB5TH2LCE6QDVWJN376JAUH5DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23GKAVOL62VL2?ASIN=0679745580",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Thought-Provoking",
                "reviewText": "This is the story of a truly awful and pointless crime--the murder of an outstanding community leader, his wife and two of his four children. There was no motive for the murders save to eliminate witnesses to an unsuccessful robbery of their home. The story follows the crime and the criminals as justice slowly unfolds. Truman Capote explores the death penalty and the complicated issues that surround its use. The law, of course, has continued to evolve since the time of these murders in the late 1950s, but the debate over the death penalty continues in those states that still employ it. One is left to wonder whether those sentenced to death are almost always mentally ill and whether society would not be more just imposing life without parole or institutionalization in a hospital for those who are criminally insane than in imposing the death penalty.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason West",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVJTXNNKK34X6BYL7VLZKAMCOSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBMJGQAM3ZQ9R?ASIN=0679745580",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2022",
                "reviewTitle": "4.0 out of 5 stars In Cold Blood is a well written book",
                "reviewText": "Throughout this novel, it discusses the death penalty and the judicial system’s role in deciding the outcome of the trial. In Cold Blood, written by Truman Capote, illustrates how quickly a small town turned on each other in the mists of tragedy when they believed the murderer to be one of their own. The book follows the life and death of the Clutter family and the lifespan of Perry and Dick. Perry and Dick are both convicted felons, Capote illustrates their lives together after they were released from jail as well as flashbacks from times in their life before jail. Perry Smith and Dick Hickok were partners after jail despite the dramatic contrasts in their childhoods. Perry had a traumatic childhood, with 2 of his siblings dead before the time he turned 30. He also suffered from a motorcycle accident which disfigured the lower half of his body and caused him to become addicted to painkillers. Dick lived a somewhat normal childhood with 2 loving parents. The Clutter’s were a well-respected wealthy family in the small town of Holcomb, Kansas. On November 15, 1959, the Clutter family was killed with a shotgun held a few inches away from their face. Alvin Dewey, the lead detective on the case, struggled with finding a motive for their murders as there were almost no clues. This novel follows the Clutter family case with new clues and a possible motive coming to light. The title In Cold Blood tells the reader that the novel is going to be about a merciless killing that we later find out was driven by greed. Truman Capote won the O. Henry Memorial Short Story Prize twice for his short stories such as A Tree of Night and was a member of the National Institute of Arts and Letters. In Cold Blood was Truman Capote’s only true crime novel, however, he wrote many other novels such as Other Voices, and Other Rooms. In Cold Blood was published in 1965. Truman Capote well illustrates how easy it is for people to become mistrusting and turn on each other. By the end of the novel the citizens of Holcomb as well as the individuals involved in the trial are on edge and are beginning not to trust each other. Capote creates a good hook and intrigues the reader by telling the reader from the start that the Clutter family is going to be killed. The reader will learn throughout the novel that people change and not everyone can be trusted no matter what you have gone through with that person. In Cold Blood is mainly for people ages 16+ because the details of the murder are not appropriate for children under that age. In Cold Blood is intriguing and unlike most true crime books that I have read, because of the immense detail Truman Capote puts into the backstories of all the characters including the other convicts and individuals Perry and Dick encounter in their travels. In Cold Blood is available on Amazon and at Barnes and Noble for prices ranging from $10.29-$16.95 depending on where the book is purchased.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Longoria",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPFXNPJYDIN2TF3ZGSLUM2FJR4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29DU8EJ9PNBZT?ASIN=0679745580",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars A Masterpiece",
                "reviewText": "Have read it numerous times and completely engrossing every time. Absorbs you into the pathos of Holcomb and the horror that men render. An utterly unique work that has never been duplicated.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kirk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4WFTT237QUIGRXDK5UFFNBLRKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27Z7OXNTQR2CH?ASIN=0679745580",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Still a Classic",
                "reviewText": "Mr Capote's book hardly needs my endorsement. I did wonder if a book written almost 60 years ago, still holds up to its reputation as a classic, in its genre. I can say without reservation, that it does. The research and in-depth background on all the primary principals is incredible. The reader comes to know the victims, as well, as the perpetrators. There is something haunting about all of them. I think it will be a long time before, I forget any of them. While it is difficult to sympathize with killers, I can't help but wonder if a few things in their lives had gone differently, if they might not have become productive members of society. The extraordinary kindness of the sheriff's wife is an example we can all learn from. The poignant ending reminds us that despite great tragedy, life goes on.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julia ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKRVJUMZTDMS3OJFS4CXFSDUECQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R99FMWQJ7D4RL?ASIN=0679745580",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars what i needed",
                "reviewText": "ordered for school and it’s the right book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Whitt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXOTLFZWWNAJBDJU7HK6TIEMESQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30B9MBV4CRX4I?ASIN=0679745580",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2016",
                "reviewTitle": "3.0 out of 5 stars but it just made each part drag on and seem like there was never going to be an end",
                "reviewText": "In Cold Blood is definitely a well written book and I had been wanting to read it for a year or so, but I don’t think I realized how slowly the plot was going to go. Capote added a lot of details which makes sense because it is necessary to know as much as you can about the family and murderers, but it just made each part drag on and seem like there was never going to be an end. Having all of the details was helpful, but not always necessary, like reading about Nancy’s boy troubles, or moving around her schedule to help a girl learn to bake a pie. The details about how different Dick and Perry, the murderers, were different was beneficial because it helped you try to understand their motive for the acts that they committed. I think that Capote not coming in as someone who interviewed people and maintaining his position as a narrator did not help the over-detailing issue. Overall, I think it is a very well written book for it to be one of the first books of its kind, but I do believe that in some places it is too detailed and just drags on for many pages before it gets back to the point.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "m querns",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2024",
                "reviewTitle": "You feel you are there.",
                "reviewText": "I love Truman Capote writing style an interesting case for sure! Another can't put it down book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniella BeneditoDaniella Benedito",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 23, 2023",
                "reviewTitle": "Livro chegou antes do prazo, sem defeito é o que eu havia pedido.",
                "reviewText": "The media could not be loaded.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ojTk-52-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wfN0vDgCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zDMvMcYDL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/F1TEGRYbQNL.mp4"
                }
            },
            {
                "reviewerName": "Giorgio GastaldelloGiorgio Gastaldello",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 15, 2024",
                "reviewTitle": "Great Book",
                "reviewText": "Still a very modern approach to one of the saddest life realities!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Z20obsc2L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "jose maria cazorla gahete",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 22, 2022",
                "reviewTitle": "rapidez",
                "reviewText": "todo correcto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frida Vizcaino",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 8, 2020",
                "reviewTitle": "Excelentes condiciones",
                "reviewText": "Excelente libro, excelente material, lo compré de regalo de cumpleaños y le encantó",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}