{
    "remaining_requests": 443,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Essential-Guide-Writing-Novel-Complete/dp/153736118X",
    "body": {
        "name": "The Essential Guide to Writing a Novel: A Complete and Concise Manual for Fiction Writers: Second Edition",
        "price": "$11.95",
        "originalPrice": "",
        "rawPrice": 11.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Essential-Guide-Writing-Novel-Complete/dp/153736118X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61oTv+fDHKL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "James Thayer",
            "link": "https://www.amazon.com/James-Thayer/e/B000AR9MNE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 123,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author James Thayer is the author of thirteen critically acclaimed novels. Clive Cussler called him \"a master storyteller.\" Thayer teaches novel writing at the University of Washington extension school, and is a regular contributor on writing techniques to Author Magazine."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The New York Times Book Review said James Thayer's \"writing is smooth and clear. It wastes no words, and it has a rhythm that only confident stylists achieve.\" The Essential Guide to Writing a Novel is a practical, step-by-step manual on how to craft your novel. The Essential Guide presents a set of tools for large issues such a story development and scene construction (Kirkus Reviews said Thayer's novels are \"superbly crafted,\") and it also examines techniques that will make your sentence-by-sentence writing shine \"Thayer's prose is clear and clean,\" said the Seattle Times. How do the masters do it? The Essential Guide shows you the techniques of writers such as John Grisham, Maeve Binchy, Jeffery Deaver, and Charles Dickens. What makes their novels hard to put down? How do Mario Puzo, Sinclair Lewis, Patricia Cornwell, and Tom Wolfe make their stories so riveting and their prose so good? The Essential Guide sets out their techniques in concise detail. Just beginning your novel? Or in the middle of the novel and needing some guidance? The Essential Guide to Writing a Novel will show you the way. Among the many topics: The six traits necessary for a successful protagonist and three more traits that will make him or her stand out. Twenty-two techniques that will make your character's dialogue compelling. Creating dynamic settings that advance the story. Point of view-a critical skill--made easy. Five pace-killers and how to avoid them. Plotting the novel using the advantage shift. Constructing scenes to propel the reader to the next scene. \"Thayer writes a vivid tale,\" the Cleveland Plain Dealer said. In The Essential Guide to Writing a Novel, he'll help you write your own vivid tale. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ CreateSpace Independent Publishing Platform; 2nd edition (September 17, 2016)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 286 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 153736118X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1537361185"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.6 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#149,441 in Books (See Top 100 in Books) #457 in Fiction Writing Reference (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 123 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sotto voce",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPR3DAGWZHHNZW2LBMTXU3PLSLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3THIIHRX4FXQN?ASIN=153736118X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2012",
                "reviewTitle": "5.0 out of 5 stars Compelling 25,000' level view",
                "reviewText": "What I really liked about Thayer's book is its strange effect on future reading (rather than writing). I catch stuff I've never noticed before. It's been interesting on the post-read side. I hope I can transfer the skills. I've lately done a lot of technical/scientific writings that verge on fiction to one degree or another.After 40 some years of technical/science writing as a pup physicist, then proofing the increasingly esoteric stuff as a 30-something, then begrudgingly approving the drivel of incoherent ramblings in my 40's ... I'm back to writing again. Thayer helps one to know how much one doesn't know about the stuff that makes writing vivid. A sizzling hot, medium-energy physics proposal may be in my future!This is a quick, concise read of do and do not's. Of these how-to-write-good books, this one leaves the reader the opportunity to consider the published, edited snippets of high-octane novel writers. It's a great primer to pick up on `habitual' bad practice and for logical reasons. Since Thayer, I've been testing other author's practices and deconstructing dialogue, settings, `moving forward', etc.Applying the Thayer `method' has been an eye-opening experience. Several of Thayer's referenced big name writers might learn a thing or three reading Thayer. An editor can go wild with the `dialogue' do's and don'ts.I have read one less than popular author since this read that was Thayer-perfect in my dissecting opinion (good book too!). I read a big machine author that was full of Thayer 'violation's' and that could have easily spruced up his offering with Thayer. There is a startling qualitative difference in a Thayer followed novel.I left you with at least 1 Thayer mistake in writing this review ... can you find it?",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert A. Impallomeni",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBQP4R4FAIAIEDZ5TEM2BZHZ6NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AYM23D4RUUHD?ASIN=153736118X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Best Novel Writing Book",
                "reviewText": "This is the best novel writing book out there and it’s great to use in addition to the authors podcast.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYFCYJTSLVGPRXLOC4ILTEZCH2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T74AYOX0RI6N?ASIN=153736118X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2012",
                "reviewTitle": "4.0 out of 5 stars Great \"30,000-Foot View\" guide to writing",
                "reviewText": "This book truly is an \"essential\" guide. The key word in the title is \"Concise\". While there are chapters on subjects that are truly essential, the material is more 'concise' than it is thorough. There are dos and don't s for each topic, as well as examples from published authors. I believe it is a great guide, and I would also recommend delving further into each topic with additional books or references to continue the study of the craft of writing.I would honestly say that the only thing that bugged me about this book was the excessive amount of quotes in first few chapters. Naturally, you have to start somewhere, so Thayer started the book with the \"Basic Ingredients\", \"Before Sitting Down at the Desk\", \"Our Production Style\", and \"Organizing to Start\" chapters. The meat of the those chapters were great tidbits of advice, but in my opinion, there were too many quotes from other authors or historical figures regarding those subjects. On some pages there are as many as 6 different quotes! \"I prefer to write my novels this way\" said Stephen King. Another Author said \"I do it this other way because that is what works for me!\" I understand he was trying to illustrate that successful authors do not all write in the same manner, but I just felt there was just an excessive amount of those quotes. I found myself losing interest and skimming those chapters. I didn't see that continue in the rest of the book to that degree, which is why I still enjoyed this guide.This book is a great guide. I have highlighted, flagged and made notes throughout the book, so I anticipate this guide to be very useful in the future.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SeattleFictionFan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEODICMYPXTL7YB66ZFFWCFJGOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OTTMZ8NR9L2Z?ASIN=153736118X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2010",
                "reviewTitle": "5.0 out of 5 stars Money well spent",
                "reviewText": "Imagine spending a year of your life toiling over your first novel only to find that you made an amateurish mistake from the get go that dooms your novel to a rewrite. I don't want to go through that sort of pain, so I took Thayer's class. For those who can't, this book is the next best thing; maybe even better since most of my notes are illegible.Thayer has condensed thirty plus years of professional writing experience and five years teaching experience into a comprehensive, yet surprisingly concise book. This is not a 700 page endless tome. And by the way, don't take his word for any of it. Nearly every point he makes in the book is backed by quotes and excerpts from celebrated authors and editors. That may be the best part about it. Thayer has not tried to carve out his own niche on writing, setting his own rules and regulations to the craft. Quite the contrary, he has tried to learn from the best and pooled all that information into one resource. He speaks to the author that wants to write a commercially viable book. His teachings are about getting you published, not about making that one in a million experimental art piece.The book starts with creating a writing routine, then it covers character, scene and story development, then points of view and controlling pace, and finally a series of useful sections on the craft of writing itself (like how to write dialogue, and avoiding worthless modifiers). About the only thing that it didn't cover in detail is obtaining an agent and writing a query letter. And I would not describe it as a story development book. The basics of story are talked about, but Thayer does not delve into the depths of dissecting the Hero's Journey. That subject is a slippery art and this book focuses on concrete tips that will improve your writing immediately.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angelika Fiol",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 25, 2024",
                "reviewTitle": "Solid information about how to write a novel",
                "reviewText": "This is a very good book about how to write a novel. Yes, of course, he could have written a smaller book without the quotations of other authors and the repetitions but this way you get a better grasp of the techniques. That is exactly what makes the content stick better in your mind. I know the author from his podcast on Spotify and bought the book so that I can look up things again, that I heard in the podcast. As a beginner I can really recommend his book. I would also suggest to read some of his novels too, so you can see how he uses his knowledge to actually write something. His novels are not only entertaining, you can learn a lot from them about writing and you will deepen your knowledge of what you have learned in the podcasts or from this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MCG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 8, 2013",
                "reviewTitle": "THE ESSENTIAL GUIDE TO WRITING",
                "reviewText": "Désirant améliorer mes connaissances dans l'art de la belle écriture , je ne pouvais manquer de consulter ce livre. Très utile et important quant à son enseignement, il vous livre tous les secrets (ou presque!) pour donner un âme à nos personnages de fiction.Je le recommande à tous.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lyn Alexander",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 20, 2011",
                "reviewTitle": "a fine, practical primer",
                "reviewText": "Five stars for energy, clarity, and organization starting at A and driving through to Z. An excellent starter manual for anyone who throws down an unfinished read, thinking \"I can write a better novel than that.\" The old hand at writing novels will also find much of value. Thayer pulls no punches: he is explicit about structuring a novel, giving lots of flexibility to your approach, spelling out what works and why it works, and giving step-by-step instructions (1 - 2 - 3 - 4...) for structuring, as well as excellent guidance in editing. Readers today are looking for immediate action, immediate engagement, realism, gripping story lines, sympathetic not-too-perfect characters, clear writing, and easy style - everything that the author himself is known for. He goes through the usual problems, from finding the time and place to write, through to editing your own work before submitting it to agent or publisher, and includes a nice little section about grammatical and stylistic no-no's.The best part of this book, aside from its clarity and organization, is that it addresses the problems of writing for today's readers, who have much less patience than even ten years ago. Today's readers were weaned on television, the instant entertainment.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$14.35",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            },
            {
                "price": "$14.36",
                "sellerName": "Anderson Family Library",
                "sellerRating": "5"
            },
            {
                "price": "$14.36",
                "sellerName": "North Star Book Company",
                "sellerRating": "4.5"
            }
        ]
    }
}