{
    "remaining_requests": 567,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Night-Elie-Wiesel/dp/0374500010",
    "body": {
        "name": "Night",
        "price": "$6.27",
        "originalPrice": "$13.00",
        "rawPrice": 6.27,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Night-Elie-Wiesel/dp/0374500010",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41q79HAd7jL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51L34HQk9bL.jpg",
            "https://m.media-amazon.com/images/I/514Y1AwlrtL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Elie Wiesel",
            "link": "https://www.amazon.com/Elie-Wiesel/e/B000AP933K/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 20709,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 44 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 13 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9"
            },
            {
                "name": "World",
                "link": "https://www.amazon.com/World-History-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5035"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 0374500010"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Hill and Wang; Revised edition (January 16, 2006)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 120 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9780374500016"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0374500016"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 570L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 4.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.39 x 8.26 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#239 in Books (See Top 100 in Books) #1 in Historical European Biographies (Books) #2 in Jewish Holocaust History #18 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 20,709 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Claudia Moscovici",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCIBPOYALZDTNIQXBTFG3PQFFHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QWZCPZGEJB2K?ASIN=0374500010",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2015",
                "reviewTitle": "5.0 out of 5 stars mentioned that Mendes-France was suffering like Jesus, Elie Wiesel responded",
                "reviewText": "Elie Wiesel’s Night: Shedding Light upon the DarknessElie Wiesel’s Holocaust memoir, Night (New York, Hill and Wang, 2006, translated by Marion Wiesel), is one of the best-known and most highly acclaimed work about the Holocaust. The New York Times called the 2006 edition “a slim volume of terrifying power,” yet its power wasn’t immediately appreciated. In fact, the book may have never been written had Wiesel not approached his friend, the novelist Francois Mauriac, for an introduction to the French Prime Minister Pierre Mendes-France, whom he wanted to interview. When Mauriac, a devoted Catholic, mentioned that Mendes-France was suffering like Jesus, Elie Wiesel responded, in the heat of the moment, that ten years earlier he had seen hundreds of Jewish children suffer more than Jesus did on the cross, yet nobody spoke about their suffering. Mauriac appeared moved and suggested that Wiesel himself write about it. The young man took his friend’s advice. He began writing in Yiddish an 862-page manuscript about his experiences of the Holocaust. The Central Union of Polish Jews in Argentina published in Yiddish an abbreviated version of this book, under the title And the World Remained Silent. Wiesel later translated the text into French. He called it, more simply and symbolically, Night (La Nuit), and sent it to Mauriac, who helped Wiesel find a publisher (the literary and small publishing house Les Editions de Minuit) and wrote its Preface. The English version, published in 1960 by Arthur Wang of Hill and Wang, received strong critical acclaim despite initially modest sales. Elie Wiesel’s eloquent and informed interviews helped bring the difficult subject of the Holocaust to the center of public attention. By 2006, Oprah Winfrey selected Night for her high-profile book club, further augmenting its exposure.This work is definitely autobiographical—an eloquent memoir documenting Wiesel’s family sufferings during the Holocaust—yet, due to its literary qualities, the text has been also read as a novel or fictionalized autobiography. The brevity, poignant dialogue, almost lyrical descriptions of human degradation and suffering, and historical accuracy of this multifaceted work render Night one of the most powerful Holocaust narratives ever written.Elie (Eliezer) Wiesel was only 15 years old when the Nazis entered Sighet in March of 1944, a small Romanian town in Northern Transylvania which had been annexed to Hungary in 1940. At the directives of Adolf Eichmann, who took it upon himself to “cleanse” Hungary of its Jews, the situation deteriorated very quickly for the Jewish population of Sighet and other provincial towns. Within a few months, between May and July 1944, approximately 440,000 Hungarian Jews, mostly those living outside of Budapest, were deported to Auschwitz aboard 147 trains.Wiesel’s entire family—his father Chlomo, his mother Sarah, and his sisters Tzipora, Hilda and Beatrice—suffered this fate. Among them, only Elie and two of his sisters, Hilda and Beatrice, managed to survive the Holocaust. However, since the women and the men were separated at Auschwitz upon arrival, Elie lost track of what happened to his sisters until they reunited after the war. In the concentration camps, father and son clung to each other. Night recounts their horrific experiences, which included starvation, forced labor, and a death march to Buchenwald. Being older and weaker, Chlomo becomes the target of punishment and humiliation: he’s beaten by SS officers and by other prisoners who want to steal his food. Weakened by starvation and fatigue, he dies after a savage beating in January 1945, sadly, only a few weeks before the Americans liberated the concentration camp. Throughout their tribulations, the son oscillates between a paternal sense of responsibility towards his increasingly debilitated father and regarding his father as a burden that might cost him his own life. Elie doesn’t dare intervene when the SS officer beats Chlomo, fearing that he himself will become the next victim if he tries to help his father. In the darkness and despair of Night, the instinct of self-preservation from moment to moment counteracts a lifetime of familial love. Even when Elie discovers the death of his father in the morning, he experiences through a sense of absence: not only his father’s absence, as his bunk is now occupied by another inmate, but also the lack of his own human response: “I did not weep, and it pained me that I could not weep. But I was out of tears. And deep inside me, if I could have searched the recesses of my feeble conscience, I might have found something like: Free at last!...” (112)Night is offers a stark psychological account the process of human and moral degradation in inhumane conditions. Even the relatively few and fortunate survivors of the Nazi atrocities, such as Elie, became doubly victimized: the victims of everything they suffered at the hands of their oppressors and the victims of everything they witnessed others suffer and were unable or, perhaps more sadly, unwilling to help. Although Night focuses on the loss of humanity in the Nazi concentration camps, the author’s life would become a quest for regaining it again, in far better conditions, if at least one condition is met: caring about the suffering of others. As Wiesel explains to his audience on December 10, 1986 during his acceptance speech of the Nobel Prize in Oslo, his message to his son--and his message to the world at large—is about the empathy required to keep the Holocaust memory alive. He reminds us all, “that I have tried to keep memory alive, that I have tried to fight those who would forget. Because if we forget, we are guilty, we are accomplices. … We must take sides. Neutrality helps the oppressor, never the victim. Silence encourages the tormentor, never the tormented” (118).Claudia Moscovici, Holocaust Memory",
                "reviewVotes": "80 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "OKsally",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2AO7QAEI4I3AOEO4O2G6742QTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JWTDTPV1QX13?ASIN=0374500010",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Always Remember",
                "reviewText": "No more important a book to read than this on this Remember Auschwitz Day. We must never let it happen again!!!!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arlene Sanders",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNYZNKSVCCUH2TMXQODJGNUUSOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15BCSAE648KFC?ASIN=0374500010",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 3, 2010",
                "reviewTitle": "5.0 out of 5 stars Some Thoughts about NIGHT -- Today",
                "reviewText": "The risk inherent in writing about the Holocaust is that today's readers have a hard time believing it. Those of us who did not experience the horrors of living in a Nazi death camp cannot begin to understand what it was like. Battered women and severely abused children living today, trapped in circumstances they cannot escape, may come close.But most of us have no frame of reference. Nothing in our experience even remotely compares.This \"I can't believe it\" mentality was also common among non-Jewish civilians who lived in Germany during the Third Reich--when Adolf Hitler was in power (1933-1945).Even as \"night\" descended on Wiesel's little town--Sighet, Transylvania (Hungary)--the Jewish people could not believe what was happening. Moishe the Beadle was \"deported\" by the Hungarian police, crammed into a cattle car and taken to a forest in Poland to be executed with other Jews. Incredibly, Moishe escaped and returned to Sighet with his story:\"The train had stopped. The Jews were ordered to get off and onto waiting trucks. The trucks headed toward a forest. There everybody was ordered to get out. They were forced to dig huge trenches. When they had finished their work, the men from the Gestapo began theirs. Without passion or haste, they shot their prisoners, who were forced to approach the trench one by one and offer their necks. . . .\"Moishe's escape was a miracle. He was wounded in the leg and left for dead. In Sighet, he went from house to house, telling his story, but the people refused to listen. Even the young Elie Wiesel did not believe him.The denial continued. In Jewish families about to be transported to Auschwitz, \"the women were boiling eggs, roasting meat, preparing cakes, sewing backpacks.\"Wiesel does not challenge us to comprehend the gas chamber deaths of his mother and little sister Tzipora. Instead, he writes what we can grasp: \"Tzipora was holding Mother's hand. I saw them walking farther and farther away; Mother was stroking my sister's blond hair as if to protect her. And I walked on with my father, with the men. I didn't know that this was the moment in time and the place where I was leaving my mother and Tzipora forever.\"Wiesel describes with remarkable restraint a vicious beating he receives from a Kapo: I felt the sweat running down my back. \"A-7713!\" I stepped forward. \"A crate!\" he ordered. They brought a crate. \"Lie down on it! On your belly!\" I obeyed. I no longer felt anything except the lashes of the whip. \"One!. . . Two!. . .\" he was counting. He took his time between lashes. Only the first really hurt. I heard him count. \"Ten. . .eleven!. . .\" His voice was calm and reached me as through a thick wall. \"Twenty-three. . .\" Two more, I thought, half unconscious. The Kapo was waiting. \"Twenty-four. . .twenty five!\" It was over. . . . \"Listen to me, you son of a swine!\" said Idek coldly. \"So much for your curiosity. You shall receive five times more if you dare tell anyone what you saw! Understood?\" I nodded, once, ten times, endlessly. As if my head had decided to say yes for all eternity.Elie Wiesel's magnificent NIGHT bridges that enormous gulf between \"I can't believe it\" and the mind-numbing, horrific sinking in of the realization of \"Oh, dear God, this really happened.\" His account is straightforward, almost matter-of-fact, with a minimum of frenzy, inordinate dwelling on flames of infernos, prolonged death throes, or metaphysical discourses about evil.He does talk about his relationship with God throughout the ordeal. And of course about his father, who was with him in Auschwitz and Buchenwald.Why did Wiesel write this book? He tells us:\"There are those who tell me that I survived in order to write this text. I am not convinced. I don't know how I survived; I was weak, rather shy; I did nothing to save myself. A miracle? Certainly not. If heaven could or would perform a miracle for me, why not for others more deserving than myself? It was nothing more than chance. However, having survived, I needed to give some meaning to my survival. . . .\"In retrospect I must confess that I do not know, or no longer know, what I wanted to achieve with my words. I only know that without this testimony, my life as a writer--or my life, period--would not have become what it is: that of a witness who believes he has a moral obligation to try to prevent the enemy from enjoying one last victory by allowing his crimes to be erased from human memory. . . .\"I am grateful for this book and for Marion Wiesel's excellent and sensitive translation of her husband's memoir. Some great literature has come out of the Holocaust. In my opinion, Elie Wiesel's NIGHT is the best book, and certainly one of the most deeply moving among these works.Arlene Sanders",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Floyd E. Bucher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3KTJ6VPR4AETCE5L4Q2PARSNHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LL3X9QMI827I?ASIN=0374500010",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 7, 2023",
                "reviewTitle": "4.0 out of 5 stars A must read",
                "reviewText": "This book should be read by every free person on earth. He will give a glimpse into what man is capable of. Freedom is not free.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amichai",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3RVGI24KA3HDCTW3PG5LHLZ5FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28JQM5O5619KO?ASIN=0374500010",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Never Again",
                "reviewText": "Reading this from a survivor of the Holocaust. It saddens me that the world has forgotten and history has repeated itself on 7 October 2023. There is an evil out there and this time we as jews are fighting back. We will not be rounded up, put our faith in humanity. We have realized more than ever we need to depend upon Elohim, ourselves and our people. Am Israel Chai",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Daly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE3XOYJBAVFUCY2ZUC7CEFDSG5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVA90QLTVS9UD?ASIN=0374500010",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Historical Memoir of one of Society’s Worst Atrocities",
                "reviewText": "This fantastic book is a personal account of Elie Wiesel’s experiences in concentration camps during World War II. It is a disturbing read, but it is a necessary read. These types of atrocities continue, and we need to speak up and take action to stop them.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Robinson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV3N3KORGLEAJHUUZPMCJMXEZTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37IZEPHBKR7IL?ASIN=0374500010",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars A must read!!",
                "reviewText": "Every human being could make a difference if we would could focus on our likeness and not on our differences! OPEN YOUR EYES!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dubus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIS55NFHH5WWS5L4V57ZU54GK4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1C9MMK0BLCJQZ?ASIN=0374500010",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Heartbreaking",
                "reviewText": "So heartbreaking. A horrible time in our world history. Every book I read about this atrocities makes me wonder how so many humans could be brainwashed to hate other humans. Never forget so it never happens again!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Parsa Sojoodi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 3, 2024",
                "reviewTitle": "Valuable",
                "reviewText": "This book was very good to learn about the history of the WWII. I really loved this book. You need to do an exegetical analysis of this book to fully understand, and also, you can't understand it by reading it only once.Amazing. Absolutely amazing!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gavin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 27, 2023",
                "reviewTitle": "A 20th century classic",
                "reviewText": "Re-reading this has made me appreciate 20th century history and its implications so much more.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Minka",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 31, 2023",
                "reviewTitle": "Grim And Horrible.",
                "reviewText": "Words are scarier than a horror movie. Most inhuman act recorded in this book. This is my first Holocaust read and it shook me. I'll never read Holocaust related book ever........ (Not within a year).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nidia Valladares Palma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 26, 2020",
                "reviewTitle": "Un relato que da vida a la esperanza en la humanidad",
                "reviewText": "Un acogedor relato sobre la estupidez humana y la animalidad que vive en cada uno de nosotros, sin embargo, en cada página se muestra el corazón de la humanidad, lleno de esperanza, de ilusiones que aún lejanas defienden lo más valioso que poseemos: la vida.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 18, 2020",
                "reviewTitle": "Very good",
                "reviewText": "Fast delivery, the book in good shape",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}