{
    "remaining_requests": 464,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/One-Mans-Wilderness-50th-Anniversary/dp/1513261649",
    "body": {
        "name": "One Man's Wilderness, 50th Anniversary Edition: An Alaskan Odyssey",
        "price": "$16.99 $14.98",
        "originalPrice": "$19.99",
        "rawPrice": 16.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/One-Mans-Wilderness-50th-Anniversary/dp/1513261649",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61C8-yO7H2L.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/51e --TLfbL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Richard Louis Proenneke",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Richard+Louis+Proenneke&text=Richard+Louis+Proenneke&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "Sold by Ryan to make a Dollar and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 2098,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"[Proenneke's] journals from the text of this handsome book, and his sparkling color slides illustrate it with a beauty that tugs at your heart and sets your heels to itching just a little. You owe yourself the pleasure of this book.\" ― Biloxi Sun Herald\"The best modern piece of prose about Alaska, the one that gives the truest picture of what living in the bush today is like for the lone individual.\" ― Anchorage Daily News\"This book made a big splash when it debuted in 1973. Keith based the text on the journals and photography of Richard Proenneke, who, after racking up years of 50-hour work weeks, did what many of us only fantasize about: he chucked it all and went to live in the woods. . . Proenneke has become an icon for naturalists. Though few will follow Proenneke's lead, his story can be quite inspiring.\" ― Library Journal\"Richard Proenneke, an emigre from Iowa to Alaska, kept a journal during the time he was fulfilling his dream of living in an altogether undeveloped part of Alaska. Parts of the journal have been made into a book by Sam Keith, along with colored photos that prove Alaska is certainly one of, if not the, most beautiful places anywhere.\" ― Boston Globe\"It is soul-reading -- the simplicity of a man's inner feelings stated in terms which leave no misunderstandings . . . A classic of its kind.\" ― Lansing State Journal\"Many of us will never realize the dream of such an escape from our hectic, complex life to that of the solitude of the wilderness. But in the pages of this book we can share with a man who lived his dream. The book is certain to bring much pleasure to anyone who loves the outdoors.\" ― Portsmouth Times\"This is a record of a man in our own time who went into the bush. It is the story of a dream shared by many, fulfilled by few, brought into sharp focus by the beautiful color photographs and the simple account of Proenneke's life.\" ― Burlington Free Press\"Sometimes it is difficult for a person to know their strengths and weaknesses while living among others; one way to discover them is to live alone. Of course, most people will never venture far from the comforts of home, but Proenneke felt the call of the wild and lived the second part of his life in Alaska. . . . Keith and Proenneke were coworkers on Kodiak Island and formed a friendship that lasted for decades. . . Keith’s writing is clear and descriptive; one can sense each strike of the ax and draw of the knife. The reader feels he is experiencing the adventure as well. The journal descriptions of the Alaskan wilderness flow from the page to the reader.\" ― Foreword Reviews About the Author Richard Proenneke retired from his job as an operator and mechanic at age fifty to live the next thirty years of his life in the wilds of Twin Lakes, Alaska. There he built a cabin, hunted and gathered his own food, educated himself as a naturalist, and recorded his activities and findings in journals and on film. His time was later made into the 2003 PBS documentary Alone in the Wilderness and written in the book One Man’s Wilderness, published in 1973 by his friend Sam Keith. Proenneke returned to civilization in 1999 and died at the age of 82 in 2003 in Hemet, California.Sam Keith met Richard Proenneke in 1952 at the Kodiak Naval Base in Alaska, where the two became friends exploring the Kodiak and Afognak Islands together. He graduated from Cornell University with a degree in English, with aspirations to become a writer. His 1973 book One Man’s Wilderness became a bestseller and has sold hundreds of thousands of copies worldwide. Keith died in 2003.Nick Offerman is an actor, author, comedian and woodworker who is known for his role as Ron Swanson in the NBC sitcom Parks and Recreation. He co-hosts the crafting show Making It with Amy Poehler, and heads Offerman Workshop, a collective of woodworkers and makers in Los Angeles."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs 3 mins",
            "FREE delivery February 26 - 28 on orders shipped by Amazon over $35",
            "Or fastest delivery February 23 - 25"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Winner of the National Outdoor Book Award.Celebrating the 50th anniversary of when Dick Proenneke first broke ground and made his mark in the Alaskan wilds in 1968, this bestselling memoir features an all-new foreword by Nick Offerman plus color photographs not seen in print for over 20 years.To live in a pristine land unchanged by man...to roam a wilderness through which few other humans have passed...to choose an idyllic site, cut trees, and build a log cabin...to be a self-sufficient craftsman, making what is needed from materials available...to be not at odds with the world, but content with one’s own thoughts and company...Thousands have had such dreams, but Dick Proenneke lived them. He found a place, built a cabin, and stayed to become part of the country. One Man’s Wilderness is a simple account of the day-to-day explorations and activities he carried out alone, and the constant chain of nature’s events that kept him company. From Dick’s journals, and with firsthand knowledge of his subject and the setting, Sam Keith has woven a tribute to a man who carved his masterpiece out of the beyond.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Crafts, Hobbies & Home",
                "link": "https://www.amazon.com/Home-Garden-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=48"
            },
            {
                "name": "Home Improvement & Design",
                "link": "https://www.amazon.com/Home-Improvement-Design-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=6158312011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Alaska Northwest Books; Anniversary edition (September 11, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 272 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1513261649"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1513261645"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.56 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,732 in Books (See Top 100 in Books) #18 in Travelogues & Travel Essays #36 in Traveler & Explorer Biographies #578 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 2,098 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alex",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWKVSTGPJOLTA2ZKF6BHF4FDX4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH77T5059511P?ASIN=1513261649",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars fantastic read",
                "reviewText": "What a great way to experience the wilderness with another man’s eyes! Great details, and marvelous views from the words of a great writer, and adventurer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZQ4LWJYIVNHK4C4CRBFCDYCIMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9BP8VBK1DVA?ASIN=1513261649",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent Book!",
                "reviewText": "Excellent book! Wow...what this man accomplished with just hand tools! Really a cool story! Buy this for the outdoorsman in your life!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Terry Shipman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPKTQ3LJSBQOKDBKX5S7HUXL57A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TQHY1T6JY7K1?ASIN=1513261649",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars AWESOME BOOK",
                "reviewText": "This is one of the best books I’ve read on The Alaskan Wilderness! I truly thought I lived each day with him!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josef Jurkowitsch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBHBH2EMSTUQ3KY4GZGKDHJCWCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PPL1T1EEUYAJ?ASIN=1513261649",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Worth the updated edition",
                "reviewText": "Great Anniversary updated book... great text and photos.. So Worth it...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mike w.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJGTOSATK4D4YKZQ6R2UHH2N5TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X5K6JUA1LPC1?ASIN=1513261649",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars great read",
                "reviewText": "no dislikes",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7IUOT7VGUHD4RF3VHBRAVBTB5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19DHD0PT1JNCL?ASIN=1513261649",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2023",
                "reviewTitle": "4.0 out of 5 stars One man, one wilderness",
                "reviewText": "I first became aware of folk figure Richard Proenneke years back. I was fascinated that one man can spend a good chunk of his life in solitude with his natural surroundings.I finally picked up this book and took a dive into finding out how he spent his days at Twin Lakes. We, as readers, are taken back into 1960's Alaska to witness the life of Richard Proenneke.\"Dick\" moved to Twin Lakes in his early 50's and built a log cabin from the ground up, with supplies flown in courtesy of his friend \"Babe\" Alsworth. One has to admire Proenneke's values and work ethic. Though my attention briefly wandered during the more technical aspects of the book (mostly about the construction of his cabin), Proenneke makes up for that with his philosophical insight and attention to detail describing other activities in his everyday life.One can find some stoic gems in Proenneke's diary entries. I believe the secret to his overall happiness revolved around being busy and finding joy in simple pleasures. From picking blueberries to kayaking down the river, Proenneke found bliss in his surroundings. So much so that he spent the next 30 years of his life at his forest dwelling.Proenneke, who was a lifelong bachelor, is somebody to admire in today's world of conformity and noise. There aren't many men like him today, especially in our modern world of consumerist delights. Reading about his first year in Twin Lakes was a rewarding read, even if I tended to get distracted during certain passages of the book.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leslie Conrad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFW5ANFE3KRIYCDBS3PYM2N655MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3THRHU8MB1HFC?ASIN=1513261649",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2023",
                "reviewTitle": "5.0 out of 5 stars If you like minimalist living this is the book",
                "reviewText": "This book could relax the most stressed person simply by putting yourself in the moment as he builds and survives the Alaskan wilderness. Given it happened in the 70's makes it that more impressive. You'll likely not watch any of the Alaska reality shows again the same way.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGB7YTHKGEZHCS5M4FRFFZHANPWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H62VKZAFH7YA?ASIN=1513261649",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2023",
                "reviewTitle": "5.0 out of 5 stars awesome adventure",
                "reviewText": "this is a great book about striking off alone into the wilderness. Easy and amusing read with some very nice pics of th Alaskan wilderness",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marilynn Seifert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 20, 2024",
                "reviewTitle": "My husband couldn’t put this book down.i",
                "reviewText": "I’ll read it next! Amazing true story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nigel pearce",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 17, 2023",
                "reviewTitle": "Wonderful account of building a log cabin in the wildernesses",
                "reviewText": "Captivating story about one man escaping the rat race to build a log cabin and live at one with nature a great read for any outdoor enthusiast",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eduardo Amil T. Alves",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 1, 2021",
                "reviewTitle": "A much needed book.",
                "reviewText": "Great read. Dick Proenneke's life in the wilderness is full of poetry, respect for nature and lessons of master carpentry. His reflections about the needs of men and the speed of information and it's consequences were the wake up call we did not hear, and whose price we pay now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 6, 2022",
                "reviewTitle": "Gutes Buch",
                "reviewText": "Für jemanden, der mit diesem Thema etwas anfangen kann, sehr lesenswert.Die im Tagebuch geschriebene, wahre Geschichte eines außergewöhnlichen Mannes,führt einem in eine vollkommend andere Welt mit ausreichend Platz für seine eigene Vorstellungskraft und kommt ohne jegliche reißerische Elemente aus. Für jemanden der die wirkliche Natur liebt absolut empfehlenswert.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 4, 2020",
                "reviewTitle": "One of best books I have read.",
                "reviewText": "The book has literally transported me halfway across the globe and also in time. I so enjoyed every word of it. I was a pleasure to understand Dick Proenneke and realise how simple and beautiful person he was. How he built the cabin, his attention to details despite no one was going to inspect his cabin, his views about hunting unnecessarily and how he lived like he was part of the twin lakes ecosystem than an outsider, everything makes him special. A great great read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}