{
    "remaining_requests": 524,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/MCU-Marvel-Studios-Joanna-Robinson/dp/1631497510",
    "body": {
        "name": "MCU: The Reign of Marvel Studios",
        "price": "$23.00$23.00",
        "originalPrice": "",
        "rawPrice": 23.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/MCU-Marvel-Studios-Joanna-Robinson/dp/1631497510",
        "soldBy": {
            "sellerID": "A2PTFCA406K9UV",
            "name": "bellwetherbooks",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2PTFCA406K9UV"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61z1ygoAsgL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Joanna Robinson",
            "link": "https://www.amazon.com/Joanna-Robinson/e/B0CKQRSQBH/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "bellwetherbooks",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 419,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Marvel’s inescapable obsolescence is the best argument for MCU; the genre should be studied with the same rigor as film noir. The book’s admiration for Marvel movies works in its favor, freeing the writers to skip straight to the gossip, like the relative who pulls you aside at Thanksgiving to whisper about your cousin’s divorce.\" ― Amy Nicholson, New York Times\"MCU is a thoroughly reported history of the world-conquering movie company and its products. Robinson, Gonzales and Edwards set out to write 'the most thorough, authoritative history of Marvel Studios to date,' and that is exactly what they have done. In the gap between power and its parody, between heroism and humiliation, glints something far more arresting than the most impressive special effects: humanity, with its airs and affectations and occasional flares of unexpected valor.\" ― Becca Rothfeld, Washington Post\"Over the course of more than 500 pages and hundreds of interviews, the authors explore how an iconic 20th-century comic-book brand pretty much willed itself into becoming this century’s most potent box-office force. The focus is not on a critical dissection of the individual movies; instead, the book concerns itself with the people and decisions that have shaped Marvel Studios from before Iron Man through today. With The Marvels’ box-office performance (or lack thereof) prompting a wave of stories about the studio at a crossroads, this feels like a potential epitaph for the company’s first epoch.\" ― Josef Adalian, Vulture\"A highly entertaining, well-researched, wide-ranging, detailed, and objective examination of one of the greatest Hollywood success stories. Documenting this specific story illuminates the universal story of big-budget studio filmmaking in the 21st century. There will never be another story like the Marvel Studios story, and maybe there shouldn’t be. But those who want to understand this phenomenal story can do no better than read MCU: The Reign of Marvel Studios.\" ― Michael Curley, PopMatters\"Not to skip to the post-credits scene, but the book is necessary reading for anyone who fancies themselves an MCU fan... Honest and unmerciful... [MCU] delivers a wealth of new context... It’s a testament to the authors that the narrative thread remains easy to follow given the growing expanse of Marvel Studios’ reach.... There is no better document charting Marvel’s improbable rise and total disruption of the Hollywood paradigm.... Readers are sure to learn something new on every page, from which MCU stars first auditioned for roles years earlier to exactly what happened with Edgar Wright’s Ant-Man. A volume of trivia, drama, and humor, MCU: The Reign of Marvel Studios belongs on every Marvel fan’s bookshelf.\" ― Carlos Freytes, Agents of Fandom\"MCU reveals the real saga behind the Marvel Cinematic Universe.... A fresh backstage perspective into the successes, failures, and twists that have spanned Marvel’s long production history. I thought I knew everything there was to know about the MCU, but the book is filled with revelations I never imagined... [MCU] is not only enlightening, but enthralling.\" ― Cosmic Circus\"A superb chronicle of how Marvel Studios conquered Hollywood…. This definitive account of the Hollywood juggernaut thrills.\" ― Publishers Weekly, starred review\"[A] compulsively readable book... Marvel fans and film aficionados alike will appreciate this highly recommended, smashing insider look at one of entertainment’s greatest success stories.\" ― Library Journal, starred review\"The book every MCU fan needs to read.\" ― Alan Sepinwall, author of The Sopranos Sessions\"A deeply researched and engagingly written spin through Marvel history that gives credit where it’s due, without papering over cracks. Even the biggest fan will find new revelations and new perspectives in the often first-hand accounts of the studio’s climb to world dominance.\" ― Helen O’Hara, Empire Magazine\"A riveting, deeply researched history of the collaborative wizardry and backstage showdowns behind Marvel Studios’ popcorn-movie empire.\" ― Douglas Wolk, author of All of the Marvels\"A gift. Comprehensive, accessible, and entertaining, MCU makes for a great primer on a modern pillar of Hollywood entertainment.\" ― Nicholas Quah, Vulture and New York Magazine\"Robinson, Gonzales, and Edwards deliver the definitive chronicle of the greatest cinematic achievement of all time. An absolute treasure trove of depth and detail that will delight both new Marvel fans and Marvel zombies from way back, like me.\" ― Jeff Cannata\"I thought I was an authority on the Marvel Cinematic Universe, but I was wrong. This impeccably researched and reported tome is both a propulsive page turner and a real peek behind the curtain into how you build a cultural phenomenon, brick by obsessive brick.\" ― Marc Bernardin, screenwriter and comic book author About the Author Joanna Robinson is a writer and podcaster at the Ringer. She lives in Oakland, California.Dave Gonzales is a graphics producer, animation director, and popular podcaster. He lives in Denver, Colorado.Gavin Edwards is the New York Times–best-selling author of thirteen books, including The Tao of Bill Murray. He lives in Charlotte, North Carolina."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 9 mins",
            "FREE delivery February 27 - 28.",
            "Or fastest delivery February 22 - 27."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "INSTANT NEW YORK TIMES BESTSELLER\"A superb chronicle of how Marvel Studios conquered Hollywood…. This definitive account of the Hollywood juggernaut thrills.\" ―Publishers Weekly, starred review The unauthorized, behind-the-scenes story of the stunning rise―and suddenly uncertain reign―of the most transformative cultural phenomenon of our time: the Marvel Cinematic Universe. Marvel Entertainment was a moribund toymaker not even twenty years ago. Today, Marvel Studios is the dominant player both in Hollywood and in global pop culture. How did an upstart studio conquer the world? In MCU, beloved culture writers Joanna Robinson, Dave Gonzales, and Gavin Edwards draw on more than a hundred interviews with actors, producers, directors, and writers to present the definitive chronicle of Marvel Studios and its sole, ongoing production, the Marvel Cinematic Universe. For all its outward success, the studio was forged by near-constant conflict, from the contentious hiring of Robert Downey Jr. for its 2008 debut, Iron Man, all the way up to the disappointment of Ant-Man and the Wasp: Quantumania and shocking departures of multiple Marvel executives in 2023. Throughout, the authors demonstrate that the original genius of Marvel was its resurrection and modification of Hollywood’s old studio system. But will it survive its own spectacular achievements? Dishy and authoritative, MCU is the first book to tell the Marvel Studios story in full―and an essential, effervescent account of American mass culture. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Humor & Entertainment",
                "link": "https://www.amazon.com/Entertainment-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=86"
            },
            {
                "name": "Movies",
                "link": "https://www.amazon.com/Movies-Entertainment-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Liveright (October 10, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 528 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1631497510"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1631497513"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.71 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.5 x 1.7 x 9.6 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,927 in Books (See Top 100 in Books) #2 in Action & Adventure Movies #5 in Movie Direction & Production #8 in Movie History & Criticism"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 419 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28177073-ccaa-4de0-a150-e11637bb8498.__CR0,0,4042,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d37b7939-52de-4763-8f1b-f42754598527.__CR0,0,4042,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dfee598d-92c0-47d9-8c82-8b7327736273.__CR0,0,4042,1250_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Josue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHA6FOPJZ255RNTLGDTQO3P4G5MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28KUFTNALZ5AX?ASIN=1631497510",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Had no idea how much effort and coincidence allowed the most perfect comics universe on screen.",
                "reviewText": "This book shows the humanity behind a studio I believed to be a robot/alien/wizard that acted on what it believed to be the best ideas. Makes total sense this is a business and it’s ruled by what is going to sell best and the sea of people involved needs to talk and discuss and have arguments just as any other business in the world. It’s incredible what I thought was the best strategy is basically a series of extraordinary coincidences. And the present failed state of the MCU is a reflection of the countless tries people at the top have made in order to make a proper process out of the successful mess. Recommended read for any person who has seen one of this movies and wondered how the sausage gets made.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Admiralu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXGGU72IX7R6COV66FDWLTQRTWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20AC0AMTOMN94?ASIN=1631497510",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Comprehensive History of the MCU",
                "reviewText": "This book is a wonderful in-depth story of the Marvel Cinematic Universe. Filled with great stories, behind the scenes goodies and interviews with key personnel, it tells the story of a most unlikely studio who achieved success few have been able to match. From Ike Perlmutter and Avi Arad, to the genius of Kevin Fiege who assembled a team that told compelling stories of what used to be little known characters, made new fans and box office gold. It makes the confusing early days, quite clear and introduces you to the complicated list of players.While it is comprehensive, I would have loved more coverage of Civil War and Endgame. The film sections were great, but didn't spend as much time as I would've liked on some cast stories. VFX is heavily covered as is the writing staff, creation of various shows and films and the unique culture crafted that Fiege nurtured despite the views of Pearlmutter and the committee that oversaw early productions. The section with Sony was very interesting, finding a way to work Spider-Man into the MCU.The book covers the triumphs and lows and a glimpse into the uncertain future of the next phase of entertainment. Key to all this is Fiege. I wish he had a Star Wars trilogy- he would do Knights of the Old Republic the justice it deserves. The authors made this an enjoyable read/listen (I listened to the audiobook).",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joseph Kucharski III",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIAGVWH6F6JRBXP3K4VJ342GY6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NDFZS00WZLRO?ASIN=1631497510",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Fans of sausage making will not be disappointed",
                "reviewText": "The “tell all” MCU book is an entertaining and enjoyable read. The style is more of a compilation of previously-read articles and gleaned trivia from director commentaries than an outright oral history compendium but the authors do a successful job of telling a deep and definitive story of Marvel Studios. Fans of sausage making will not be disappointed.MCU includes it all, True Believer: the good (the artistic reign of Kevin Feige), the bad (arguably most post-Endgame theatrical releases and a vast majority of the streaming shows), and the ugly (the bigoted, racist, one-percenter Ike Perlmutter).For as exhaustive of a read as it is, MCU also ends rather quickly. Granted, there probably is not a lot to tell specifics wise on any of the post-Endgame releases, but the conclusion is as abrupt as Thanos’s snap. Yet it also ends positively. Feige is still in control. And even though She-Hulk was a disastrous slip in quality control, if anyone can get Marvel out of this tail-eating loop of inane “Phases” and back into good, complex, superhero movies, it is Kevin Feige. ‘Nuff Said.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barry Kim Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQDLF67PTT37J4FOSBYKYXUVCXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XLQ4UC4J8X9R?ASIN=1631497510",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars The book was amazing",
                "reviewText": "Yes, the book the book was amazing great good for anybody that loves comics and movies!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert R Ruch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM5D3KJ4IDVXNJC7QBCDHUJO7XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X5VBDRY2S1HC?ASIN=1631497510",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome!",
                "reviewText": "If you are a Marvel fan, this is the book for you! The authors do an excellent job telling the story and providing an inside view into how Marvel became what it is today. So glad I read it and enjoyed every page.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G.A. Arboleda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOCDHJZS7E7DMYB5WZK6FIIJRZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JD8N5MV38PHJ?ASIN=1631497510",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Engaging and Well-Researched",
                "reviewText": "I learned a lot about my favorite movie franchise and had fun the whole time! The authors make this entertainment history very entertaining!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMV6WZ4WR5H2V6JT6KFGINDKESA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EJT447JS25R0?ASIN=1631497510",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "4.0 out of 5 stars solidly researched and written",
                "reviewText": "Probably 3.5 stars. Well researched, well written. Drags a bit at times due to researched details, but still very comprehensive.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dm7b5",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGYLBTJCKFMQP6NTOS2IQQS56PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15C7UY8CWBZ2M?ASIN=1631497510",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Very interesting, even if you’re not a superfan",
                "reviewText": "I loved the behind-the-scenes stories and learning how various aspects of the movie business work - strategies, politics, pivots, etc.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "iROBOT",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 10, 2024",
                "reviewTitle": "An excellent insightful account of the highs and lows of the MCU!",
                "reviewText": "A well written, fair book that perfectly captures the history of Marvel Studios, from being revolutionary in producing successful blockbuster sagas to the interesting power struggles behind the scenes. Highly recommended for both Marvel fans and film fans.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heisenberg",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 1, 2024",
                "reviewTitle": "Comprehensive and Honest",
                "reviewText": "A comprehensive and honest compilation of the History of the MCU and Marvel Studios taking us behind the scenes of the making of the most successful franchise in Cinematic History",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katrin Kröning",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 1, 2023",
                "reviewTitle": "Per amanti del mondo Marvel",
                "reviewText": "Riccamente illustrato ripercorre la linea temporale del MCU. Fantastico regalo per amanti dei film ma anche dei fumetti Marvel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Florin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 28, 2023",
                "reviewTitle": "Very interesting book !",
                "reviewText": "I recommend it to the fans who want to find out more details from the “back stage” of the production team",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ronan Lennon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 19, 2023",
                "reviewTitle": "Clear eye view of the MCU story",
                "reviewText": "This is an engagingly written overview of the MCU story from the start to mid 2023. It is not a full business story, although there is quite a bit of that , and it is not a reading of the text academic style book either (thankfully). It draws from a very wide range of sources, some of which will be new to readers who have followed the MCU since the beginning. The pen pictures of the main people are sharp and revealing with good anecdotes to support their views. This is not a heliography of Kevin Fiege or of the MCU project itself, the on the fly improvisation in the grand plan shown here is pretty amazing and borderline unprofessional. The only gripe that comes up is a half chapter near the end about representation which comes across as an op Ed rather than reporting. Sorry I have been reading avengers comics since the mid 70s and Carol Danvers has been a good character but never a popular one.This is a very good book if you are anyway interested in this story.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$18.54",
                "sellerName": "allnewbooks",
                "sellerRating": "4.5"
            }
        ]
    }
}