{
    "remaining_requests": 421,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hate-U-Give-Angie-Thomas/dp/0062498533",
    "body": {
        "name": "The Hate U Give: A Printz Honor Winner",
        "price": "$10.19 $8.88",
        "originalPrice": "$18.99",
        "rawPrice": 10.19,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hate-U-Give-Angie-Thomas/dp/0062498533",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71DZv5+s67L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Angie Thomas",
            "link": "https://www.amazon.com/Angie-Thomas/e/B01LXYCVWA/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by ZBK Wholesale and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 48317,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 12 hrs 58 mins",
            "FREE delivery February 27 - 29 on orders shipped by Amazon over $35",
            "Or fastest delivery February 26 - 28",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest Same-Day pickup Today 2 PM - 6 PM. Order within 1 hr 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Meet the Author Angie Thomas Angie Thomas was born, raised, and still resides in Jackson, Mississippi as indicated by her accent. She is a former teen rapper whose greatest accomplishment was an article about her in Right-On Magazine with a picture included. She holds a BFA in Creative Writing from Belhaven University and an unofficial degree in Hip Hop. She is an inaugural winner of the Walter Dean Myers Grant 2015, awarded by We Need Diverse Books.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Balzer + Bray; 1st edition (February 28, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 464 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0062498533"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062498533"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 15+ years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL590L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 9 - 12"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 0.042 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 8.3 x 5.9 x 1.6 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,847 in Books (See Top 100 in Books) #2 in Teen & Young Adult Fiction on Peer Pressure #7 in Teen & Young Adult Fiction on Prejudice & Racism #11 in Teen & Young Adult Fiction about Emotions & Feelings"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 48,317 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Hate U Give 8 Starred Reviews Junior Library Guild Selection New York Magazine - 11 Young-Adult Books for Stoking the Feminist Fire The Fader - 7 Writers of Color You Should be Reading in 2017 Teen Vogue - 10 Diverse Books by YA Authors of Color to Read in 2017 Entertainment Weekly - 20 Books We Can’t Wait to Read in 2017 Bustle - 16 Young Adult Novels to Read in 2017, According to YA Authors Featured in the New York Times, Cosmopolitan, Essence, and more! Meet the Author Angie Thomas Angie Thomas was born, raised, and still resides in Jackson, Mississippi as indicated by her accent. She is a former teen rapper whose greatest accomplishment was an article about her in Right-On Magazine with a picture included. She holds a BFA in Creative Writing from Belhaven University and an unofficial degree in Hip Hop. She is an inaugural winner of the Walter Dean Myers Grant 2015, awarded by We Need Diverse Books.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c1a6a4c5-b2f8-403b-877b-43b61f0da592._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cf6832d3-477a-4950-80ee-4c2f2210e4b6._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "A powerful debut - School Library Journal. This story is necessary. This story is important. - Kirkus Reviews. Heartbreakingly topical - Publishers Weekly. An important and timely novel that reflects the world today’s teens inhabit.- VOYA .",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8e51d5d9-7118-4d14-9bba-9a2276de105c._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/23a4f68e-e479-4307-b833-905fdb0ea1da._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b62ae83f-649c-4435-8b6c-79fb8349ef90._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f043712f-4655-4c8a-b60f-fca1e4c6ca9f._SL220__.JPG"
                ]
            },
            {
                "media_text": "A message that will resonate with all young people concerned with fairness - Bulletin Center for Children's Books. A powerful, in-your-face novel - Horn Book. Thomas’s clear and honest writing moves beyond sound bites to represent the real people and communities behind the headlines - Shelf Awareness. A marvel of verisimilitude - Booklist.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ccf7098e-1a89-4aa0-a60f-29ffed7e2c8e._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/59265976-d29b-4bf9-a007-d39a2ddbc460._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/6184cc9b-c3f6-4684-b84b-eefad8b44252._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f889f0e3-bb04-4e61-a59c-a30b0c354557._SL220__.jpg"
                ]
            },
            {
                "media_text": "The Hate U Give On The Come Up Concrete Rose Angie Thomas 2-Book Box Set Find Your Voice: A Guided Journal Writing Your Truth Read the whole series! Angie Thomas’s #1 New York Times bestselling, award-winning debut inspired by the Black Lives Matter movement, about a teen girl who is the only witness to her friend’s fatal shooting by a police officer. The highly anticipated second novel by Angie Thomas is about a teen girl whose dreams of a career in rap music turn into a desperate necessity when her family home burns down. Angie Thomas revisits Garden Heights seventeen years before the events of The Hate U Give in this searing and poignant exploration of Black boyhood and manhood. Two stories, one remarkable family saga—the paperback box set of the #1 New York Times bestselling novels The Hate U Give and Concrete Rose. An illustrated, guided journal that takes aspiring writers from idea to draft, featuring writing prompts, tips, and more.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/c1a6a4c5-b2f8-403b-877b-43b61f0da592._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cf6832d3-477a-4950-80ee-4c2f2210e4b6._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/21a8a51f-aff3-4fe2-b7c8-d26ba758d8b7._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8e51d5d9-7118-4d14-9bba-9a2276de105c._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/23a4f68e-e479-4307-b833-905fdb0ea1da._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b62ae83f-649c-4435-8b6c-79fb8349ef90._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f043712f-4655-4c8a-b60f-fca1e4c6ca9f._SL220__.JPG",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ccf7098e-1a89-4aa0-a60f-29ffed7e2c8e._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/59265976-d29b-4bf9-a007-d39a2ddbc460._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6184cc9b-c3f6-4684-b84b-eefad8b44252._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f889f0e3-bb04-4e61-a59c-a30b0c354557._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7bb64b01-cc12-47fc-8957-2459699b276e.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cbecc998-e89c-429b-9bc6-12d620a4354a.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/893066d7-646e-416f-a528-46ebbb63b90b.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/799cf9f7-7823-4bb7-80d8-341d9002bae4.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed17e9a0-0d30-4921-bbe3-f8ff165dd913.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lynda Wolters",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE36YNXJWWOXAYEDI5YXI22VTE3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WFE6VO339EVA?ASIN=0062498533",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars A book that should be gifted and gifted and gifted",
                "reviewText": "REQUIRED READING FOR ALL HUMANSA great book stays with you, like a dozen shot tequila hangover. The Hate You Give is the type of book that will stop you in your tracks, take your breath, and make you evaluate yourself. The Hate You Give is riveting and an absolute must read.Sixteen year old Starr is caught between her worlds of white privilege school, where she and her brothers, Seven, and Sekani, commute 45 minutes to get the best education available, and the ghetto where she lives, where bullets spray her neighborhood, and colors equate to gang loyalty.While at a party in her ‘hood over spring break, shots ring out and she and her best friend, Khalil dash for his car and take off, only to get pulled over by a white cop. Unarmed, Khalil is shot three times in the back and dies on the street with Starr holding him. What follows is expected, rioting, opinions, lack of justice, and lines drawn between blacks and whites, including at Starr’s 99% white school and with her white friends.I read for many reasons: entertainment, relaxation, education. I try to stay away from the over-hyped, I don’t tend to know if something is a movie (I’m more of a nose in a book kinda gal rather than eyes on the screen), and I do my best to stay well-rounded (read: I try to see all sides). But there are some things that need to be shouted from the rooftops. YOU NEED TO READ, THE HATE YOU GIVE.Angie Thomas’ debut novel, written some years back, is as relevant then as it is today. Read this book. Look inside yourself, your knee-jerk thoughts and behaviors, and see if you too don’t come away hungover, wrung out, and emotionally exhausted. We must do better.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reviewer Mac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2MFRMKOR5CR32WFNXB2OS6YIIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R259NKK9KD9HFF?ASIN=0062498533",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 11, 2018",
                "reviewTitle": "5.0 out of 5 stars Brutally Honest and Compelling",
                "reviewText": "I know I’m a little late to the program with this one as I’ve been hearing people gush about this book for quite a while already — and rightly so! I just finished it and what an amazing story! Though The Hate U Give is marketed as a Young Adult book, I feel that this inspiring book that should be on everyone’s TBR list — regardless of age, gender or race.--The Setting --The story revolves around and is told from the point of view of Star Carter, a 16 year old black girl who is trying to live in two different worlds: one being Garden Heights, the all black crime-ridden neighborhood where she lives and grew up in — and the other being Williamson Prep, the predominately white upper middle-class high school to which her parents send her and her two brothers.While at school, she carefully measures her behavior, limits her slang and generally portrays an easy-going attitude as she tries to fit in with her rich white schoolmates. She even has a white boyfriend, Chris, whose existence she’s not yet told her father about because she’s worried he’ll judge her for dating a boy who isn’t black.Though it can be challenging at times, Staar is always careful to keep her two worlds separate. --Her Family --Staar has a great relationship with her family and it’s evident that she loves them. Her mother works at the hospital and is an excellent role model of a strong, no-nonsense woman. Her father, a former gang member, is now a respected member of the community having left his gang life behind and now works hard to provide for his children and be a positive role model for them. He owns the neighborhood grocery store at which Staar helps out from time to time.But things aren’t easy for Staar and her family. She lives in a neighborhood where drive-by shootings, drug lords, gang leaders, and turf wars are a part of everyday life. --The Incident --But one night her world is shattered when she and her childhood best friend Khalil are pulled over by a policeman for a routine traffic stop. The officer pulls Khalil out of the car and, even though Khalil was unarmed and made no threatening moves toward the officer, the policeman shoots him in the back three times, killing him. So Staar ends up being the only witness to what actually happened — and her life and the life of those around her entirely change as a result. Though traumatized and enraged, Staar is faced with a choice: stay silent or accept who she truly is in order to obtain justice for Khalil.Now I will say that the scene of Khalil’s murder is horrifying and gut-wrenching, and regretfully, not uncommon, as many of us have seen on the news far too often in recent times. Still, that didn’t make it this part of the book any easier — or less heartbreaking — to read. The young man’s funeral was equally heart-hurting, as we saw firsthand how destroyed his family and friends were. Instead of reading a byline in a newspaper or hearing a brief clip on the television, we are fully immersed in the situation in this story and are placed in the shoes of those who are directly involved. In this way, the story was so raw and so real that at times, I forgot that I was reading fiction. The author did an excellent job of bringing this story to life, allowing us to empathize with everyone involved. We read about the challenging issues facing the black community in the news, but this novel brought them to life for the reader, allowing us to see the lives behind the new bylines. In this way, we can’t help but realize that things are often a lot more complicated and multilayered than portrayed by the media.--The Aftermath --Still grieving Khalil’s death, Staar is put in an extremely tough position given that she’s the only witness to the incident. Though it may seem clear to an outsider of what the best course of action is for her to take, things are not always as easy and clear-cut as they may seem — and it’s uncertain how we would react or not react if we found ourselves in a similar situation. Following the aftermath of the shooting, I felt the author did an excellent job of portraying the fear, confusion, rage, and mistrust that Staar experiences as she processes her friend’s brutal murder and through it all, tries to find herself and her voice in the middle of the fallout. But not only that, we see firsthand how such a violent, tragic and senseless loss can shake a community to its core.--The Police --Though the officer clearly was at fault here, I felt that the author didn’t demonize the police or place all of the blame on them. Yes, there are definitely some bad police officers out there, but there are also good ones.In fact, Staar’s uncle was a police officer who, on more than one occasion, let her know that not all of the officers at his precinct are trigger-happy racists and that many of his fellow officers vehemently disagreed with the action of their corrupt colleague and those like him.--My Verdict --The Hate U Give is phenomenal. This is the brutally honest kind of book that will stay with you for a long time after having read it and perhaps may cause you to look at life differently after having read it. At the very least, it may cause us to question that which we’ve come to accept as “normal”. This was a gripping story that not only packed an emotional punch but was also an excellent fictional treatment of real-life racial issues facing America today. Though Ms. Thomas openly treats the issue of police brutality, she also demonstrates in a very real way the day to day violence plaguing inner-city neighborhoods. This is a timely book whose importance cannot be overstated. Though the book deals with heavy issues and is not always comfortable to read, there are plenty of light and fun parts as well — especially the often amusing scenes in which Staar interacts with her friends and family. While the book will make you cry, it will, in places, make you laugh with joy as well.Throughout the book, the author weaves in themes of police brutality, racial profiling, hard choices, injustice, white privilege how young black men get pressured into dealing drugs, the challenges of living in gang-ridden neighborhoods, the everyday violence and danger that people living inner-city neighborhoods face — and does it with expert storytelling.This is an honest and compelling book that I hope will be around and in people’s minds for many years to come. Definitely a 5-star read for me. Recommended!!!This review was originally posted on my blog at rogerhyttinen.com.",
                "reviewVotes": "62 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maryann Miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTM4UM2BCVPD6CGKD4AXJ4WZQ6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O72RZ3AQG19W?ASIN=0062498533",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2023",
                "reviewTitle": "5.0 out of 5 stars A Stunning Story",
                "reviewText": "This is a first-hand look at the experiences of people directly involved with the tragic killing of Black men and women by White police officers, and Ms. Thomas draws us into the story in a way that we can empathize with everyone involved. It’s one thing to read news reports about such events, but we don’t often get a real understanding of the issues challenging a poor black community.Poverty that makes the temptation to get with a gang and make money selling drugs hard to resist.Living in such a neighborhood that makes everyone a suspect in the eyes of police.Fear of the gangs that makes a person just want to duck their head and pretend that everything is okay.Living with the danger of drive-by shootings and other violence of the inner city.As I read the story and shared with Starr the absolute horror of seeing her friend get shot, I could empathize, but only to a point. We, mostly White folks, who have never had to listen to The Talk, or see what Starr had to see, have no idea. Not really. Racism is so complicated, and the Black community experiences things we will just never know first-hand.The push-pull between Starr’s wanting to speak out and fear of doing so, was so real. And I loved what her mother said at one point, “Sometimes you can do everything right and things will still go wrong. The key is to never stop doing right.”At first I didn’t understand why the author chose to have Starr and her brothers go to a school in an affluent White neighborhood, but as the contrasts between her life and theirs came clearer and clearer, I got it. The cluelessness of one of her school friends about racism in the past and present, reflects the positions of so many people today who want to just erase the injustices and pretend they never happened. “We can just be friends.”The characters are nicely drawn, and it was nice to hear distinct voices. Each spoke in a way that reflected their past and education, and Starr worked hard to leave her “ghetto” speak at home when she went to school. That contrast added another layer to the story, as does her relationship with a White boyfriend, Chris. During the aftermath from the killing of Starr’s friend, she and Chris have to explore their feelings for each other in a way they never had to before.The Hate U Give isn’t always an easy read, but it it an important one. We as a society can’t ignore the facts of racism and how it affects so many people, and this book give us those facts in an engrossing story with a wonderful main character. I highly recommend it.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 9, 2022",
                "reviewTitle": "Ilustrativo de una realidad cotidiana",
                "reviewText": "Libro excelente para comprender los entornos de violencia en los que se desarrollan los jóvenes en algunos contextos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lorenzo Angori",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 24, 2023",
                "reviewTitle": "Libro",
                "reviewText": "Ok",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monika S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on July 29, 2022",
                "reviewTitle": "Damaged book",
                "reviewText": "The cover page of the book was folded and damaged",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yanisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on March 5, 2022",
                "reviewTitle": "Just read it",
                "reviewText": "JUST DUCKING READ IT",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mohana Mukherjee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 30, 2021",
                "reviewTitle": "Everybody should read.",
                "reviewText": "This is not just a book, not just a story, not just a plot, not just a character. Rather, it's a hard, powerful, loud smack in the face of age-long injustice, brutality, inhumanity of White people on minor Black people.The book is inspired by the #/BlackLivesMatter movement, where sixteen year old Starr, witnesses her best friend, who is an unarmed black boy, be killed by a police officer. Starr is scared to speak up, constantly battling what to do, because more than one attempts are made to shut her up and there's never any justice for this heartless killings. The book is a journey of Starr where she understood how much value her voice holds.There's no necessity for my Baba to teach me when I was a kid that how I'd be alert if a policeman comes near me. Because simply he trusts them, and he knows no matter what, they're meant to save us if we've done nothing wrong. But it shook me to the core that at some place, a kid of seven years old or less than that, getting a lesson from her Dad that how she'd outstretch her hands clear infront so that the cops could see it and never do something which they don't want to, because the hands which are supposed to protect them also, have an age-long history of killing them, just because their skin is black.And this ruthless killings are still happening even in 2021. Everytime the incidents are same, just a different name. Sometimes it's George Floyd, sometimes it's Stephon Clark, sometimes it's Michael Brown, sometimes it's Carlos Carson and the list goes on. It horrifies me that everyone of them, were unarmed when they got killed and was doing nothing wrong. On top of that, most of the killer cops got no punishment at all. I've realized now, that how much pain, anger, and frustration the author must've felt growing up in between all of this and she poured all of those in these 444 pages. While reading those pages, I could feel those frustrations, to such an extent that I wanted to scream out loud, bang my head on wall in anger or cry out badly just by reading this. I've never experienced a book giving me the chance to feel all the existing emotions in the world all at once. What if, I was one of them, I can't think!Lastly, I'd say, racism is not a foreign topic, if I've to be real honest here. Even in India, people judge others on the basis of their skin colour obviously not at the cost of someone's life, not that extreme. But we all can agree why till now brands like Fair & lovely exists. Even in 2021, beauty equals to fairness?! Think.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$4.95",
                "sellerName": "Erigone Books",
                "sellerRating": "5"
            },
            {
                "price": "$9.20",
                "sellerName": "Buy AM",
                "sellerRating": "5"
            }
        ]
    }
}