{
    "remaining_requests": 650,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Harlem-Hellfighters-Max-Brooks/dp/0307464970",
    "body": {
        "name": "The Harlem Hellfighters",
        "price": "$12.69$12.69",
        "originalPrice": "",
        "rawPrice": 12.69,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Harlem-Hellfighters-Max-Brooks/dp/0307464970",
        "soldBy": {
            "sellerID": "A1F5ORSGF7UA9M",
            "name": "Dream Books Co.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1F5ORSGF7UA9M&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/714sU5w5CLL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Max Brooks",
            "link": "https://www.amazon.com/Max-Brooks/e/B001IGLRRU/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Dream Books Co.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 615,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 25 mins",
            "FREE delivery Tuesday, February 27 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Del Rey; NO-VALUE edition (April 1, 2014)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 272 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0307464970"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0307464972"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 12 years"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN780L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.09 x 0.63 x 9.1 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#50,452 in Books (See Top 100 in Books) #28 in Historical & Biographical Fiction Graphic Novels #43 in World War I History (Books) #425 in World War II History (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 615 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Richard C. Geschke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFOLBOIMCFFBPJLTSP7EMDFNGFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIMR4BCPYEUPA?ASIN=0307464970",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 13, 2014",
                "reviewTitle": "5.0 out of 5 stars Dusting Off a Little Known Vignette of Military History",
                "reviewText": "In the long history of war we have many instances of minorities who are treated many times as less than second class citizens. This is very inherent in the imperial armies of the French in Indo-China and Northern Africa and the British all around the world where the sun never set on its Empire. Such anomalies were in existence in all of the United States Armed Forces throughout the late 18th and the entire 19th century and half of the 20th century. During this time frame the black men of these times served in the military very often times as support troops doing menial tasks very much like slaves prior to the Civil War. During the 19th century we see for the first time that blacks were used in the Indian Wars of the West and were given the name of Buffalo Soldiers. This piece of historical fiction is based on factual material written by Max Brooks and illustrated in black and white by Caanan White which gives us a detail account that many Americans have no knowledge of. This being the centennial of the start of WWI, we are also given an education of a black 369th Regiment from New York. The fact that this unit was one of the first American units to be deployed to France and the French at this time were in desperate need of fresh combat troops to be the needed fodder to fight the German Hun, we see the 369th fighting not with other American units but rather the French. At this time in American history the American army would not use a black regiment to fight in any combat arm during WWI. However the French needed bodies and for them the color of the skin did not matter. Brooks shows the frustrations and the injustices that the black soldiers had to endure. What the author also brings to the table is that this regiment was one of the most decorated of all the units in WWI. It endured the most time of all American units on the combat line. If you go to Harlem today you can visit the 369th Regiment Armory and see a monument of the Harlem Hellfighters so named by their German adversaries on the Fields of Flanders. This book gives a wonderful history of this unit and is an enduring story which should be imbedded into American Military History.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Heiss",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG333IRPK4DVJPF3DA5PHQ3BVPQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5WG50HMZ6WJ7?ASIN=0307464970",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2017",
                "reviewTitle": "5.0 out of 5 stars A parent's review: excellent",
                "reviewText": "We don't know what we are capable of.Woodrow Wilson knew what would happen if black soldiers returned from Europe victorious, having made the world \"safe for democracy.\"The Harlem Hellfighters fought a double war: they fought the terrifying war against the Germans, and they fought the insinuating, sly racist oppression of their own president, Woodrow Wilson. Wilson was an uncloseted democrat racist, and his appointees understood that the black soldiers had to be sternly repressed, or else they might succeed.The book is excellent in its depiction of different social classes and accents, especially in the beginning of the bok where the recruitment is shown. At times it is difficult to figure out who is who as the people are being blown to bits, but usually the next frame calls out the name of the deceased, so you can figure it out.Black and white graphics, a lot (a LOT) of bodily fluids, and people being blown to smithereens.The book does show the sickening racism against these soldiers by dishonorable democrat politicians, like Mayor John F Floyd and Woodrow Wilson himself. And of course, it looks at the soldier's feelings of bitterness, resentment, and the desire for violent revenge that arose from their treatment. You see a race riot on page 39.The book offers good historical quotes: from WEB DuBois on page 77, from Irvin S. Cobb on page 124, and the Alan Seeger poem \"I have a Rendezvous with Death.\" There is a great discussion on page 175 on dignity and respect, and an excellent summary of what these men overcame. The graphics offer very good sensory information, and one of the best visual tricks involves \"remembering.\" Great presentation of the graphics. As a parent, I highly recommend this book.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laurie Nerat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBQO6N2IW3BNE725FXBS5CIQHUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24U83FXE68BS8?ASIN=0307464970",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2014",
                "reviewTitle": "4.0 out of 5 stars seemed like a perfect fit",
                "reviewText": "I'm not really a big fan of graphic novels, but I bought this for my husband - who loves comic books & history, seemed like a perfect fit. I love history so I read it too. The topic is really interesting - the Harlem Hellfighters, a little known group of black soldiers from World war I (I specifically did not use African American - because some of the men were from Caribbean islands). The story is very gritty and it focuses mostly on the racial issues of the time period and the race issues faced by the soldiers - which left a lot of the war story untold. I learned a great deal, but at times I felt like the story was demonizing all white people and in some ways diminishing the heroic actions of the black soldiers by implying their only motivation was to kill white people. The book does do a tremendous job of showing the ugly side of war, the horrible conditions and the brutality of combat. I really like the concept of using graphic novels to teach about history, but I wish this book was a bit more balanced in its approach.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erin Danes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 28, 2023",
                "reviewTitle": "Great story and yes it’s a graphic novel",
                "reviewText": "I see lots of people surprised and leaving angry reviews that it’s a graphic novel. Yes it’s a graphic novel. Compelling story, the graphics make it even more raw. A wonderful read about some undercooked heroes of the First World War.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Audrey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 23, 2019",
                "reviewTitle": "Bon livre",
                "reviewText": "Un bon livre, qui retrace l’histoire des Afro-américains venus combattre en France pendant la Première Guerre Mondiale. Le format BD est parfait pour comprendre ce point de l’histoire souvent oublié...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 17, 2018",
                "reviewTitle": "Good historical Comic",
                "reviewText": "great Comic with inside into a very certain time and place in history, very unknown to me prior and made me interested to research more about it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Massimiliano Palladini",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 8, 2017",
                "reviewTitle": "Una storia di guerra, eroismo e discriminazione",
                "reviewText": "Un bel pezzo di storia americana ai più sconosciuto fatto di guerra, eroismo e discriminazione. Incredibile pensare che questi uomini non potevano combattere nell'esercito del loro paese per motivi razziali, tuttavia mostrarono il loro valore in battaglia. Bellissimi i disegni di White e anche i testi di Brooks meritano. Consigliatissimo agli amanti del periodo storico purché abbiano padronanza dell'inglese.Amazing WWI comic book, Harlem Hellfighters story is worth telling, a story made of war, heroism and discrimation. I can't believe they were forbidden to serve in the US Army because black, however they proved their valor on the battlefield. Highly recommended to WWI fans, White and Brooks did a great job !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. A. Croucher",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 12, 2015",
                "reviewTitle": "Good introduction to graphic novel format.",
                "reviewText": "This was a present for my husband, his first graphic novel. Adult content, interesting story linked to true story.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.06",
                "sellerName": "Revolver Market",
                "sellerRating": "4.5"
            }
        ]
    }
}