{
    "remaining_requests": 439,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Washington-Black-Esi-Edugyan/dp/0525563245",
    "body": {
        "name": "Washington Black",
        "price": "$10.59$10.59$8.22$8.22",
        "originalPrice": "$18.00",
        "rawPrice": 10.59,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Washington-Black-Esi-Edugyan/dp/0525563245",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51-I b8kvFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/315z7FkPeyL.jpg",
            "https://m.media-amazon.com/images/I/51QN4AW4kqL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Esi Edugyan",
            "link": "https://www.amazon.com/Esi-Edugyan/e/B001KCZ3E0/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by tLighthouse Books and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 8704,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Amazon.com Review An Amazon Best Book of September 2018:: Washington Black is that rarest of novels: a hybrid that knows exactly what it is. The story begins as an antebellum novel about Wash, an 11-year-old slave working on a Barbados plantation run by a sadistic master. When Christopher, the master’s brother, takes Wash under his wing and teaches him to read, the novel turns more toward adventure and scientific exploration. There are inventions, twists, and turns; there is danger and intrigue; there is travel and growth. What holds everything together is author Esi Edugyan’s writing chops. She is a precise writer who has created a world that seems whole and all-embracing. Her characters are fully realized human beings. The weight of personal freedom is a theme that winds through the book, as does the opposing weight of cultural and societal expectations. There is so much to digest here, and so much to enjoy, that readers may well be tempted to read this book twice. --Chris Schluep, Amazon Book Review Review MAN BOOKER PRIZE FINALIST • One of the Best Books of the Year: The Boston Globe ● The Washington Post ● Time ● Entertainment Weekly ● San Francisco Chronicle ● Financial Times ● Minneapolis Star Tribune ● NPR ● The Economist ● Bustle ● The Dallas Morning News ● Slate ● Kirkus Reviews“Extraordinary. . . . Edugyan is a magical writer.” —The Washington Post“A daring work of empathy and imagination.” —The New York Times Book Review “Soaring. . . . Washington Black contains immense feeling.” —Entertainment Weekly “An inspiring story of freedom and self­discovery.” —Time “Enthralling.” —The Boston Globe “Sparkling . . . full of truths and startling marvels.” —San Francisco Chronicle “Powerful.” —The Seattle Times “Lush, exhilarating.” —The New Yorker“Edugyan has created a wonder of an adventure story, powered by the helium of fantasy, but also by the tender sensibility of its aspiring young hero.” —NPR“Washington Black’s presence in these pages is fierce and unsettling.” —Colm Toibin, The New York Times Book Review “A gripping historical narrative exploring both the bounds of slavery and what it means to be truly free.” —Vanity Fair “Brutal, magical, urgent and exuberant.” —Minneapolis Star Tribune“Imaginative and dynamic. . . . With equal parts terror, adventure and humanity, Washington Black reads like a dream collaboration between Jules Verne and Colson Whitehead.” —The Dallas Morning News “Exuberant and spellbinding. . . . The novel is not only harrowing and poignant in its portrayal of the horrors of slavery on a Caribbean plantation but liberating, too, in its playful shattering of the usual tropes. The result is a book about freedom that’s both heartbreaking and joyfully invigorating.” —Simon Sebag Montefiore, The Wall Street Journal “Masterful. . . . [A] wondrous book.” —The Economist “Edugyan’s language is exquisite, and the life story of her titular slave . . . is a swashbuckling adventure.” —Vulture “Profoundly humane.” —The Times (London) “As harrowing a portrayal of slavery as Colson Whitehead’s The Underground Railroad, but also a globe-trotting, page-turning adventure story. A historical epic with much to say about the present-day world.” —The Guardian “A wildly imaginative exploration of what it means to be free.” —Financial Times “Elegant, nuanced. . . . Edugyan illustrates the complexity of identity and explores what defines us. Is it what surrounds us, such as family? Or is it what is inside us?” —The Christian Science Monitor “A thoughtful, boldly imagined ripsnorter that broadens inventive possibilities for the antebellum novel.” —Kirkus Reviews (starred review) About the Author ESI EDUGYAN is author of the novels The Second Life of Samuel Tyne and Half-Blood Blues, which won the Scotiabank Giller Prize and was a finalist for the Man Booker Prize, the Governor General’s Literary Award, the Rogers Writers’ Trust Fiction Prize and the Orange Prize. She lives in Victoria, British Columbia. Excerpt. © Reprinted by permission. All rights reserved. Part I Faith Plantation, Barbados 1830 1 I might have been ten, eleven years old – I cannot say for certain – when my first master died. No one grieved him; in the fields we hung our heads, keen­ing, grieving for ourselves and the estate sale that must follow. He died very old. I saw him only at a distance: stooped, thin, asleep in a shaded chair on the lawn, a blanket at his lap. I think now he was like a specimen preserved in a bottle. He had outlived a mad king, outlived the slave trade itself, had seen the fall of the French Empire and the rise of the British and the dawn of the industrial age, and his usefulness, surely, had passed. On that last evening I remember crouching on my bare heels in the stony dirt of Faith Plantation and pressing a palm flat against Big Kit’s calf, feeling the heat of her skin baking up out of it, the strength and power of her, while the red sun­light settled in the cane all around us. Together, silent, we watched as the overseers shouldered the coffin down from the Great House. They slid it rasping into the straw of the wagon and, dropping the rail into place with a bang, rode rattling away. That was how it began: me and Big Kit, watching the dead go free. His nephew arrived one morning eighteen weeks later at the head of a trail of dust-covered carriages driven directly from the harbour at Bridge Town. That the estate had not been sold off was, we thought at the time, a mercy. The carriages creaked their slow way up the soft embankment, shaded by palm trees. On a flatbed wagon at the rear of the caravan sat a strange object, draped in canvas, as large as the whipping boulder in the small field. I could not imagine its purpose. All this I remember well, for I was again with Big Kit at the edge of the cane—I rarely left her side in those days—and I saw Gaius and Immanuel stiffly open the carriage door and extend the step. I could see, at the Great House, pretty Émilie, who was my age, and whom I would glimpse some evenings dumping the pans of wash water into the long grass outside the scullery. She descended the first two steps of the verandah and, smoothing out her apron, fell still. The first man to emerge, carrying his hat in his hands, had black hair and a long, horselike jaw, his eyes darkened by heavy brows. He raised his face as he descended and peered around at the estate and the men and women gathered there. Then I saw him stride back to the curious object and walk around it, inspecting the ropes and canvas. Cradling a hand to his eyes, he turned, and for a frightening moment I felt his gaze on me. He was chewing some soft-textured thing, his jaw working a little. He did not look away. But it was the second man, the sinister man in white, who seized my attention. This was our new master—we all could see it at once. He was tall, impatient, sickly, his legs bending away from each other like calipers. Under his three-cornered white hat a shock of white hair burst forth. I had a sense of pale eyelashes, an uncooked pallor to his skin. A man who has belonged to another learns very early to observe a master’s eyes; what I saw in this man’s terrified me. He owned me, as he owned all those I lived among, not only our lives but also our deaths, and that pleased him too much. His name was Erasmus Wilde. I felt a shudder go through Big Kit. I understood. His slick white face gleamed, the clean white folds of his clothes shone impossibly bright, like a duppy, a ghost. I feared he could vanish and reappear at will; I feared he must feed on blood to keep himself warm; I feared he could be anywhere and not visible to us, and so I went about my work in silence. I had already seen many deaths: I knew the nature of evil. It was white like a duppy, it drifted down out of a carriage one morning and into the heat of a frightened plantation with nothing in its eyes. It was then, I believe now, that Big Kit determined, calmly and with love, to kill herself and me. 2 All my childhood I’d had no one; only Big Kit, as she was known in the cane. I loved her and I feared her. I was around five years old when I angered the quarters-woman and was sent to live in the brutal hut below the dead palm tree, Kit’s hut. On my first evening there, my supper was stolen and my wooden bowl cracked; I was struck hard on the side of my head by a man I did not know, so that I staggered and could not hear. Two little girls spat on me. Their ancient grandmother held me down with her talons biting into my arms and cut my handmade sandals from my feet for the leather. That was when I first heard Big Kit’s voice. “Not this one,” she said softly. That was all. But then some monstrous charge of dark energy, huge, inexorable as a breaker, poured towards us and picked the old woman up by the hair as though she were a boneless scrap of rag, toss­ing her aside. I stared, terrified. Big Kit just glared down at me with her orange eyes, as if disgusted, and then returned to her stool in the dark corner. But in the morning I found her squatting beside me in the pale light. She offered her bowl of mash, traced the lines in my palm. “You will have great big life, child,” she murmured. “Life of many rivers.” And then she spat in my hand and closed my fist so that the spit ran between my knuckles. “That is first river, right there,” she said, start­ing to laugh. I adored her. She towered over everyone, huge, fierce. Because of her size and because she was a Saltwater, a witch in old Dahomey before being taken, she was feared. She would sow curses into the dirt beds under the huts. Rooks would be found eviscerated, hang­ing in doorways. For three weeks she forcibly took food from a strong smith’s apprentice each morning and night and ate it in front of him, scooping with her fingers from his bowl, until some understanding was reached between them. In the smouldering fields she would glis­ten as if oiled, tearing up the wretched earth, humming strange songs under her breath, her flesh rippling. Some nights in the huts she would murmur in her sleep, in the low, thick language of her kingdom, and cry out. No one ever spoke of that, and in the fields the next day she would be all scorched fury, like a blunt axe, wrecking as much as she reaped. Her true name, she once told me, whispering, was Nawi. She had had three sons. She had had one son. She had had no sons, not even a daughter. Her stories changed with the moon. I remember how, some days, at sunrise, she would sprinkle a handful of dirt over her blade and murmur some incantation, her voice husky, as though overcome with emotion. I loved that voice, its rough music. She would suck air through her teeth and squint up her eyes and begin, “When I was royal guard at Dahomey,” or “After I crush the antelope with my hands, like this,” and I would stop whatever task was at hand, and stand listening in wonder. For she was a marvel, witness to a world I could not imagine, beyond the reach of the huts and the vicious fields of Faith. Faith itself darkened under our new master. In the second week, he dismissed the old overseers. In their place arrived rough men from the docks, tattooed, red-faced, grimacing at the heat. These were ex-soldiers or old slavers or just island poor, with their papers crushed into a pocket and the sunken eyes of devils. Then the maim­ings began. What use could we be, injured so? I saw men limp into the fields, blood streaming down their legs; I saw women with blood-soaked bandages over their ears. Edward had his tongue cut out for backtalk; Elizabeth was forced to eat from a full chamber pot for not cleaning the previous day’s thoroughly. James tried to run away, and to make an example of him, the master had an overseer burn him alive as we watched. Afterwards, in the embers of his pyre, an iron was heated and we filed past the charred horror of him, one by one, and were branded a second time. James’s was the first of the new killings; other killings followed. Sick men were whipped to shreds or hanged above the fields or shot. I was still a boy, and cried at night. But with each new death Big Kit only grunted in grim satisfaction, her orange eyes narrowed and fierce. Death was a door. I think that is what she wished me to under­stand. She did not fear it. She was of an ancient faith rooted in the high river lands of Africa, and in that faith the dead were reborn, whole, back in their homelands, to walk again free. That was the idea that had come to her with the man in white, like a thread of poison poured into a well. One night she told me of her intention. She said we would do it quickly. It would not hurt. “Do it frighten you?” she whispered, where we lay in the hut. “To be dying?” “Not if it don’t frighten you,” I said bravely. I could feel her arm draped protectively over me in the dark. She grunted, a long, dark rumble in her chest. “If you dead, you wake up again in your homeland. You wake up free.” I made a little shrug of one shoulder at that, and she felt it, and turned my chin with her fingers. “What is it, now?” she asked. “You don’t believe?” I did not want to tell her; I feared she would be angry. But then I whispered, “I don’t have a homeland, Kit. My homeland here. So I wake up here, again, a slave? Except you won’t be here?” “You come with me to Dahomey,” she murmured firmly. “That how it works.” “Did you ever see them? The dead, waked up? When you in Dahomey?” “I saw them,” she whispered. “We all saw them. We knew what they were.” “And they were happy?” “They were free.” I could feel the day’s exhaustion descending on me. “What it like, Kit? Free?” I felt her shift in the dirt, and then she was gathering me in close, her hot breath at my ear. “Oh, child, it like nothing in this world. When you free, you can do anything.” “You go wherever it is you wanting?” “You go wherever it is you wanting. You wake up any time you wanting. When you free,” she whispered, “someone ask you a ques­tion, you ain’t got to answer. You ain’t got to finish no job you don’t want to finish. You just leave it.” I closed my heavy eyes, wondering. “Is really so?” She kissed my hair just behind my ear. “Mm hm. You just set down the shovel, and you go.” *** Why, then, did she delay? The days passed; Faith grew harsher, more brutal; still she did not kill us. Some presentiment, some warn­ing perhaps, stayed her hand. One evening she led me out into her little vegetable garden, where we were alone. I saw the sharp, rusted blade of a hoe in her hands, and started to tremble. But she only wished to show me the little carrots beginning to sprout. Another night, she woke me and led me silently out into the darkness, through the long grasses to the dead palm tree, but this too was only to instruct me not to speak of our intentions. “If any hear it, child, we be separated true,” she hissed. I did not understand why we waited. I wanted to see her homeland, I told her. I wanted to walk in Dahomey with her, free. “But it must be done right, child,” she whispered to me. “Under a right moon. With right words. The gods cannot be summoned otherwise.” But then the other suicides began. Cosimo cut his own throat with an axe, Adam punctured his wrists using a nail stolen from the smithy. Both were found bled out in the grass behind the huts, one after the other, in the mornings. They were old Saltwaters, like Kit, believers that they would be reincarnated in their ancestral lands. But when young William, who had been born on the plantation, hanged himself in the laundry, Erasmus Wilde himself came out among us. He walked slowly over the lawns in his dazzling white clothes, an overseer trailing a few steps behind. The overseer wore a tattered straw hat and was pushing a wheelbarrow. The cradle of the barrow held a wooden post, a tangle of grey sacking. They crossed the grass in the harsh sun, pausing just at the edge of the cane, where we had been assembled. In the hot, bright air, the new master studied us. I could see the flesh on his face and hands, waxen and bloodless. His lips were pink, his eyes a very piercing blue. Slowly he walked the line of our bodies, staring at each of us in turn. I could hear Big Kit breathing roughly above me and I understood she too was fright­ened. When the master looked at me, I felt the scorch of his gaze and lowered my eyes at once, shivering. The air was stagnant, redolent of sweat. Then the man in white gestured behind him, to the overseer. That man twisted the handles of the barrow, dumping its load in the dirt. A murmur passed through us, like a wind. Sprawled there in the dirt, in a heap of grey clothes, was Wil­liam’s corpse. His face was a rictus of pain, his eyes bulging, his tongue black and protruding. Some days had passed since his death, and strange things were happening already to his body. He looked corpu­lent, bloated; his skin had become mottled and spongy. A slow horror filled me. The master’s voice, when at last he called out to us, was calm, dry, bored. “What you see here, this nigger, killed himself,” Erasmus Wilde said. “He was my slave, and he has killed himself. He has therefore stolen from me. He is a thief.” He paused, folded his hands at the small of his back. “I understand that some of you believe you will be reborn in your homelands when you die.” He looked as though he might say more, but then he fell silent and, turning abruptly, gestured to the overseer at the barrow. That man crouched over the body with a large curved skinner’s knife. He reached around and cupped his callused palm under Wil­liam’s chin and began to saw. We heard the terrible wet flesh tearing, the crunch of the bones, saw the weird, lifeless sag of William’s body as the head came away. The overseer stood and raised the severed head in both hands. Then he walked back to the barrow and took out the long wooden post. Hammering it into the dry earth, he drove William’s head onto the sharp end. “No man can be reborn without his head,” the master called out. “I will do this to each and every new suicide. Mark me. None of you will ever see your countries again if you continue to kill yourselves. Let your deaths come naturally.” I stared up at Kit. She was peering at William’s head on its spike, the bulge of its softening flesh in the sun, and there was something in her face I had not seen in her before. Despair. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 15 hrs",
            "FREE delivery Tuesday, February 27 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "MAN BOOKER PRIZE FINALIST • ONE OF THE NEW YORK TIMES BOOK REVIEW'S TEN BEST BOOKS OF THE YEAR • “A gripping historical narrative exploring both the bounds of slavery and what it means to be truly free.” —Vanity FairEleven-year-old George Washington Black—or Wash—a field slave on a Barbados sugar plantation, is initially terrified when he is chosen as the manservant of his master’s brother. To his surprise, however, the eccentric Christopher Wilde turns out to be a naturalist, explorer, inventor, and abolitionist. Soon Wash is initiated into a world where a flying machine can carry a man across the sky, where even a boy born in chains may embrace a life of dignity and meaning, and where two people, separated by an impossible divide, can begin to see each other as human. But when a man is killed and a bounty is placed on Wash’s head, they must abandon everything and flee together. Over the course of their travels, what brings Wash and Christopher together will tear them apart, propelling Wash ever farther across the globe in search of his true self. Spanning the Caribbean to the frozen Far North, London to Morocco, Washington Black is a story of self-invention and betrayal, of love and redemption, and of a world destroyed and made whole again.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9822"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Vintage; Reprint edition (April 9, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0525563245"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0525563242"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 830L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.19 x 0.82 x 7.9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#63,479 in Books (See Top 100 in Books) #160 in Black & African American Historical Fiction (Books) #388 in Men's Adventure Fiction (Books) #5,049 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 8,704 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/9dc3d089-697c-4956-8e6a-5db217b1c05b.__CR0,0,1200,1200_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/615018c3-e089-4c7e-8ab9-0939d05333d4.__CR0,0,1200,1200_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1bdccee0-3d78-41e6-ab7b-61fb1b66e554.__CR0,0,1200,1200_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZUQOACVX2VK7KFTZEIMZTVUIXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VZ5OPXB55Q1G?ASIN=0525563245",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing read",
                "reviewText": "This book is very interesting. Nicely crafted and definitely keeps the readers attention. Read this as a family and each of us enjoyed it and had various perceptions of certain parts. It’s a conversation piece you should add to your collection immediately.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave Carlson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEETPVXPWNOPMKHS5JXDZCO4V7TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G6MF2ZDTSFIP?ASIN=0525563245",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2023",
                "reviewTitle": "4.0 out of 5 stars Good read. But only good; not great.",
                "reviewText": "Reasonable plot but no compelling redemptive conclusion.Reasonable plot but compelling redeeming conclusion. Worth the read as entertainment.Thank you",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Schuyler T  Wallace",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFROG6KWT4XLA7ZUOBDJSUQDJHAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK8HF0GYWLXFO?ASIN=0525563245",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2019",
                "reviewTitle": "5.0 out of 5 stars AUTHOR IS MASTERFUL AT DEPICTING THE SENSUAL SIDE OF WRITING",
                "reviewText": "Novelist Esi Edugyan has proven once again, in “Washington Black,” to be fully in control of our five senses. As in her previous novel, “Half-Blood Blues,” her ability to invoke sensory reaction to her writing is strongly reflected in this tribute to the urge to be free and accepted.Washington Black, a young boy slave on a Barbados sugar plantation, is chosen to be his master’s brother’s manservant. The eccentric Christopher Wilde, a naturalist, explorer, scientist, and abolitionist takes the boy on a wild journey that starts with a flying machine and continues by Underground Railroad and ship until, eventually, the pair finds themselves in the frozen expanse of the Arctic where Wilde disappears. It’s a sort of “Around the World in Eighty Days” with much darker implications.It’s a brilliant story of revelation, invention, and determination by a boy who, though frightened by events that challenge his young imagination, finds a life of evasion that evolves into love, as he seeks autonomy from his racial bonds and the severe disfigurement from burns suffered during his early association with his mentor. Although he eventually becomes a free man, he never really recovers from the trauma suffered during his early days of slavery.Edugyan gathers the threads of existence in blistering hot Barbados, the frozen expanse of the Arctic, the stuffy dampness of London, and the simmering deserts of Morocco and weaves a tapestry of feelings that the reader can actually sense. Her lyrical word play is magnificent. It’s a display of talent that is worthy of greatness.Her parents emigrated from Ghana, settled in Canada, and Edugyan now lives in Victoria, British Columbia. She admits to suffering a bit of horror as she lived through slavery’s dire existence while researching her novel, but feels it was important to the authenticity of her writing. The book was a finalist for the 2018 Man Booker Prize and well deserving of the honor.Schuyler T WallaceAuthor of TIN LIZARD TALES",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "amachinist",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4T24GSTULR4XLXZLFP42XRDEXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN5XPMM28MWLP?ASIN=0525563245",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2018",
                "reviewTitle": "3.0 out of 5 stars Decrescendo",
                "reviewText": "The time span of this novel is from 1830-1836 with a plot line divided into four distinct sections. The story begins on the Faith Plantation in Barbados where sugar cane is grown and harvested. This section is brilliantly written! Edugyan is unsparing in her portrayal of the physical and emotional brutality of slavery. The reader meets George Washington Black, a six year old child born into slavery. Wash's family is unknown to him and his desperation to \"belong to\" another human being is palpable. A Dahomean slave named \"Big Kit\" takes on the \"role\" of mother. Serendipitously, Wash is chosen by the younger brother of the plantation owner, to serve as his scientific assistant. Under the watchful eye of Christopher \"Titch\" WIlde, the boy learns some reading and math skills, but especially hones his ability to draw natural objects. After the two prepare for a trip aloft in a hot-air balloon, the novel begins to unravel..The reader is forced to suspend all credibility from that point onward. Titch and Wash are saved in a storm from the sinking \"Cloud-cutter\", sail up the coast of the United States and elude a bounty hunter by escaping to the Arctic. Wash wends his way alone to Nova Scotia only to meet up with a marine biologist and his daughter. There is more travel on deck for Wash to Europe and even Morocco. There are too many characters and dead-end story meanderings in too many venues. It absolutely dispels the major themes of the effects of slavery and the need to belong to a family. Sadly, a great start has a very unsatisfying finish.",
                "reviewVotes": "180 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Minnesota Senior",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSZ4NQ736RNWVWFCZ4EY3M2AFYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OU93QTUWVX2O?ASIN=0525563245",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 8, 2019",
                "reviewTitle": "4.0 out of 5 stars Interesting, but not altogether satisfying read",
                "reviewText": "It was an interesting read in many ways, but it also, for me, fell a bit short. I rated it 4 star based mostly on the beautifully crafted prose. At times though, I thought the colorful descriptions actually got in the way of what the author was trying to convey. I found this to be particularly true during the second part of the story. I found myself skimming to see what was really going to happen.The adventures of young Washington, I thought, lacked credibility from the time they launched their balloon and throughout the rest of the story. The interesting parts for me were the brutal contrast between world of white slave owners, or even white non slave owners and black people whether slaves or freedmen. However, the thoughts and words that the author gave to the protagonist seemed beyond what a young black slave, educated though he was by his white master, were a bit beyond what one might expect for a person in his circumstances. They seemed rather too sophisticated and subtle for his age and experiences. Of course, I get the sense of abandonment that Black felt from Titch.In summary, I will say again it was an interesting story, but I was not blown away by it. I actually thought the ending was a bit weak and anticlimactic.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Purple",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on October 29, 2020",
                "reviewTitle": "Tedious read",
                "reviewText": "I started this book with high hopes, after reading some other reviews, but I really struggled to get through it. The first part held my attention more, with its depiction of a slave's life on a plantation, and it seemed to promise enthralling adventures. However, the narrative never took off and the tale seemed to meander aimlessly without ever capturing my interest. A series of characters were introduced that served no particular purpose and the main characters never came alive for me. Some gruesome episodes just added to a sense of unease and detachment from the story and I only finished the book because I kept hoping that it would all seem worthwhile at the end. It wasn't.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NKhatami",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 11, 2018",
                "reviewTitle": "An incredible journey woven together by one of our finest writers",
                "reviewText": "I was a little late in coming to Esi Edugyan's work - despite the hype that surrounded Half-Blood Blues and all the accolades it received in 2011, I didn't get around to reading it until this past year. Once I did, I was blown away and couldn't wait to pick up her latest - this gem of a book. Washington Black is nothing short of a master work, further pushing the boundaries of Canadian literature and showing a writer already at the height of her powers.The wonder and force of this novel lie not only in the leaps of imagination that take the reader from a sugar plantation in Barbados to the farthest reaches of the planet, but even more so in the painstaking character development that make the protagonist and those he meets on his journey come to life as if they were with us in the flesh. Washington's life - his joys, his fears, and his anxieties - are laid bare through evocative descriptions that take us into the action with him, as early as the opening pages where he meets the new owner of the plantation where he's made to work:\"His slick white face gleamed, the clean white folds of his clothes shone impossibly bright, like a duppy, a ghost. I feared he could vanish and reappear at will; I feared he must feed on blood to keep himself warm; I feared he could be anywhere and not visible to us; and so I went about my work in silence.\"The descriptions of Washington's inner life never seem forced, hitting the mark with pithiness and precision to convey the moral complexity of the predicaments that come his way. At the heart of these puzzles is the question of freedom. Even after he leaves the plantation, Washington is haunted by this question, navigating new terrains and relationships with the painful truth that despite his tenacity and brilliance, the colour of his skin is always with him as a mark of perceived inferiority. But even as he's impeded at every turn, Edugyan imbues his story with hope, a manifestation of the great gift inside him, a set of feats that the reader can't help but equate with the author's own extraordinary act of creation. What emerges out of these nuanced layers of meaning, then, is a testament to the will to overcome the barriers of ignorance and oppression.Through the expansiveness of her vision, Edugyan's writing takes us beyond what most Canadian literature has confined itself to, soaring to more worldly vistas with virtuosic feats of language. Any reader who appreciates a sense of adventure driven by spellbinding prose is bound to be captivated like Washington on his journey, as on the first time he's spirited away to a new vision, looking down on the world with a new perspective:\"I can barely describe the sight of it. I saw the threatening sky below, a great red crack of light, like a monstrous eye just opening. The sky was still black where we were, but the wind was already hurling us seaward. I watched the half-cut cane fields in the faint light, the white scars of harvest glistening like the part in a woman's hair.What did I feel? What would anyone feel, in such a place? My chest ached with anguish and wonder, an astonishment that went on and on, and I could not catch my breath. The Cloud-cutter spun, turned gradually faster, rising even higher. I began to cry - deep, silent, racking sobs, my face turned away from Titch, staring out onto the boundlessness of the world. The air grew colder, crept in webs across my skin. All was shadow, red light, storm-fire and frenzy. And up we went into the eye of it, untouched, miraculous.\"There are too many brilliant passages like this in the novel to list: they're left for readers to discover like little jewels generously strewn throughout. Esi Edugyan is not only an artist who deserves all the praise for the universal appeal of her storytelling, but even more so a writer's writer - a gifted wordsmith to admire and learn from. Even if you doubt that (!) pick up this book to find out for yourself.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S & B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 22, 2019",
                "reviewTitle": "Great book... Beautiful cover!",
                "reviewText": "This is a fun book with genuinely great writing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Len",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 31, 2018",
                "reviewTitle": "A good but not compelling read with an ending that fizzles into oblivion.",
                "reviewText": "Although the plot was fairly straight forward, I’m a little confused as to what it was all about. The story begins with Washington Black as a young slave of African descent working on a plantation in the Bahamas. Small of stature, he might have been the victim of much abuse if not for the unlikely presence of a woman of imposing bulk who him provided him both comfort and protection in the fields and at night in their shack.Then, he gets noticed by Titch, one of the plantation owners two sons because he is the perfect size to be used as ballast for his Storm Catcher, a balloon he believes can carry him across the Atlantic. As Titch becomes acquainted with the young Washington, he discovers the boy’s talent for drawing and numbers, both skills that can be used to further his scientific endeavours.This could be a novel about origins that wanders off on journey of a scientific nature. For that reason, I found this book to be a good but not compelling read with an ending fizzles into oblivion.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rupali",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 1, 2019",
                "reviewTitle": "Unputdownable",
                "reviewText": "Wonderful book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$10.59",
                "sellerName": "Prime Goods Outlet",
                "sellerRating": "5"
            }
        ]
    }
}