{
    "remaining_requests": 639,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tyranny-Graphic-Lessons-Twentieth-Century/dp/1984859153",
    "body": {
        "name": "On Tyranny Graphic Edition: Twenty Lessons from the Twentieth Century",
        "price": "$12.98 $11.47",
        "originalPrice": "$16.99",
        "rawPrice": 12.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tyranny-Graphic-Lessons-Twentieth-Century/dp/1984859153",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41xYGpJ502L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51o2GERnGaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vTH5lAvAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VPqkFtDpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uTNwuTTwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HS HO6knL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kkkN9AVbL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Timothy Snyder",
            "link": "https://www.amazon.com/Timothy-Snyder/e/B001H6N9K4/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Jenson Books Inc and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 2514,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Timothy Snyder is brilliant. On Tyranny is a must read, a clear-eyed guidebook for anyone seeking to learn from history to help us understand the present. It is a manual for how to protect and preserve Democracy. The past teaches us that we, as individuals, must act to reaffirm and protect the freedoms and institutions that we collectively cherish. Listen, learn, be kind and courageous. This stunning new edition beautifully illustrated by Nora Krug makes the lessons jump off the page, into our hearts, filling us with the urgent imperative: act now, before it is too late.”—Ken Burns “A more concise, profound, or essential book on the subject does not exist. Snyder’s masterwork is a stunning reminder of the myriad, insidious forms oppression takes. Now beautifully illustrated by Nora Krug, On Tyranny is a bellwether for what we must be awake to, and fight against.”—J.J. Abrams, filmmaker, Star Trek and Star Wars: The Force Awakens “Vastly important, deeply affecting, powerful, magnificent.”—Philippe Sands, author, East West Street and The Ratline “Timothy Snyder’s On Tyranny is already an essential read, but the book’s analysis of the mechanics of authoritarianism, fascism, and other forms of tyranny is even more potently delivered in its graphic edition, illustrated by Nora Krug. Krug’s playful but powerful and evocative drawings and diagrams amplify the important ideas in On Tyranny and serve as the sugar to help the reader digest the medicine of the book’s cautionary look at threats to democracy. We are often told to visualize things that are crucial to commit to memory. In the graphic edition of On Tyranny, Nora Krug has visualized and rendered some of the most valuable lessons of the 20th century which will serve all citizens as we shape the future.”—Shepard Fairey, artist and activist “On Tyranny is one of the most important books of our time, and Krug enriches Snyder's powerful, accessible text with a transcendent humanity. This book should be read and experienced by everyone, its lessons carved into our hearts.”—Nate Powell, graphic novelist, March and Save It for Later “It is impossible to overstate the urgency of Timothy Snyder’s handbook for recognizing and resisting the normalization of barbarism. Nora Krug illustrates with soulful beauty and the moral clarity of an artist who never flinches. The combination is as hopeful as it is devastating. Krug’s illustrated edition of On Tyranny is more than an instant classic. It is an act of resistance—and a gift of love.”—Joshua Oppenheimer, filmmaker, The Act of Killing and The Look of Silence About the Author Timothy Snyder is the Housum Professor of History at Yale University and a member of the Committee on Conscience of the United States Holocaust Memorial Museum. He is the author of the bestselling books Bloodlands: Europe Between Hitler and Stalin and Black Earth: The Holocaust as History and Warning. His work has received the literature award of the American Academy of Arts and Letters, the Hannah Arendt Prize, and the Leipzig Book Prize for European Understanding. Snyder is a frequent contributor to The New York Review of Books and the Times Literary Supplement and a former contributing editor at The New Republic.Nora Krug is the author of the graphic memoir Belonging and an associate professor at Parsons School of Design in New York. Her drawings and visual narratives have appeared in The New York Times, The Guardian, and Le Monde diplomatique. Her short-form graphic biography, Kamikaze, about a surviving Japanese World War II pilot, was included in editions of Best American Comics and Best American Nonrequired Reading. She is the recipient of fellowships from the Maurice Sendak Foundation, Fulbright, the John Simon Guggenheim Memorial Foundation, and the Pollock-Krasner Foundation, and of medals from the Society of Illustrators and the New York Art Directors Club. Excerpt. © Reprinted by permission. All rights reserved. PrologueHistory does not repeat, but it does instruct. As the Founding Fathers debated our Constitution, they took instruction from the history they knew. Concerned that the democratic republic they envisioned would collapse, they contemplated the descent of ancient democracies and republics into oligarchy and empire. As they knew, Aristotle warned that inequality brought instability, while Plato believed that demagogues exploited free speech to install themselves as tyrants. In founding a democratic republic upon law and establishing a system of checks and balances, the Founding Fathers sought to avoid the evil that they, like the ancient philosophers, called TYRANNY. They had in mind the usurpation of power by a single individual or group, or the circumvention of law by rulers for their own benefit. Much of the succeeding political debate in the United States has concerned the problem of tyranny within American society: over slaves and women, for example. It is thus a primary American tradition to consider history when our political order seems imperiled. If we worry today that the American experiment is threatened by tyranny, we can follow the example of the Founding Fathers and contemplate the history of other democracies and republics. The good news is that we can draw upon more recent and relevant examples than ancient Greece and Rome. The bad news is that the history of modern democracy is also one of decline and fall. Since the American colonies declared their independence from a British monarchy that the Founders deemed “tyrannical,” European history has seen three major democratic moments: after the First World War in 1918, after the Second World War in 1945, and after the end of communism in 1989. Many of the democracies founded at these junctures failed, in circumstances that in some important respects resemble our own. History can familiarize, and it can warn. In the late nineteenth century, just as in the late twentieth century, the expansion of global trade generated expectations of progress. In the early twentieth century, as in the early twenty-first, these hopes were challenged by new visions of mass politics in which a leader or a party claimed to directly represent the will of the people. European democracies collapsed into right-wing authoritarianism and fascism in the 1920s and ’30s. The communist Soviet Union, established in 1922, extended its model into Europe in the 1940s. The European history of the twentieth century shows us that societies can break, democracies can fall, ethics can collapse, and ordinary men can find themselves standing over death pits with guns in their hands. It would serve us well today to understand why. Both fascism and communism were responses to globalization: to the real and perceived inequalities it created, and the apparent helplessness of the democracies in addressing them. Fascists rejected reason in the name of will, denying objective truth in favor of a glorious myth articulated by leaders who claimed to give voice to the people. They put a face on globalization, arguing that its complex challenges were the result of a conspiracy against the nation. Fascists ruled for a decade or two, leaving behind an intact intellectual legacy that grows more relevant by the day. Communists ruled for longer, for nearly seven decades in the Soviet Union, and more than four decades in much of eastern Europe. They proposed rule by a disciplined party elite with a monopoly on reason that would guide society toward a certain future according to supposedly fixed laws of history. We might be tempted to think that our democratic heritage automatically protects us from such threats. This is a misguided reflex. In fact, the precedent set by the Founders demands that we examine history to understand the deep sources of tyranny, and to consider the proper responses to it. Americans today are no wiser than the Europeans who saw democracy yield to fascism, Nazism, or communism in the twentieth century. Our one advantage is that we might learn from their experience. Now is a good time to do so. This book presents twenty lessons from the twentieth century, adapted to the circumstances of today. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 1 hr 24 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 7 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER • A graphic edition of historian Timothy Snyder’s lessons for surviving and resisting America’s arc toward authoritarianism, featuring the visual storytelling talents of renowned illustrator Nora Krug“Nora Krug has visualized and rendered some of the most valuable lessons of the twentieth century, which will serve all citizens as we shape the future.”—Shepard Fairey, artist and activistTimothy Snyder’s New York Times bestseller On Tyranny uses the darkest moments in twentieth-century history, from Nazism to Communism, to teach twenty lessons on resisting modern-day authoritarianism. Among the twenty include a warning to be aware of how symbols used today could affect tomorrow (“4: Take responsibility for the face of the world”), an urgent reminder to research everything for yourself and to the fullest extent (“11: Investigate”), a point to use personalized and individualized speech rather than clichéd phrases for the sake of mass appeal (“9: Be kind to our language”), and more.In this graphic edition, Nora Krug draws from her highly inventive art style in Belonging—at once a graphic memoir, collage-style scrapbook, historical narrative, and trove of memories—to breathe new life, color, and power into Snyder’s riveting historical references, turning a quick-read pocket guide of lessons into a visually striking rumination. In a time of great uncertainty and instability, this edition of On Tyranny emphasizes the importance of being active, conscious, and deliberate participants in resistance.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Politics & Social Sciences",
                "link": "https://www.amazon.com/Politics-Social-Sciences-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3377866011"
            },
            {
                "name": "Politics & Government",
                "link": "https://www.amazon.com/Politics-Government/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5571255011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Ten Speed Graphic; First Edition (October 5, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 128 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1984859153"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1984859150"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 7.01 x 0.39 x 9.96 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,061 in Books (See Top 100 in Books) #6 in Historical & Biographical Fiction Graphic Novels #11 in Graphic Novel Adaptations #12 in Civics & Citizenship (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 2,514 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed26c0da-3526-4da9-84d1-a4ec0553480e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/804ccd36-85b4-4497-9c70-a0adfc4cf3c7.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4cf4bd97-70f3-4d96-9189-67e8eb63cad1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29a38d33-5f9e-4624-a421-45112fd376e4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ff949135-f467-4f78-8484-f69aad7f4e7c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9680853f-7a21-4112-b87b-4e1ef12c99bc.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/72c3eea1-f279-4055-a1fe-380799e2e047.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A. Barger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW7POUROLMGRKZLKXFJ3XWAUMHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24ME0KMFLF2Y4?ASIN=1984859153",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 27, 2023",
                "reviewTitle": "5.0 out of 5 stars An Important Book/A Crucial Warning",
                "reviewText": "This book draws on history to tell us the dangers threatening our current liberal democracy and things we can do to resist the rise of authoritarianism. Just read it.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQFX6Z5BHEQHZOH7TXP5RQT7TKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BRLZAOBD51W2?ASIN=1984859153",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Every American should read this!",
                "reviewText": "An historical view of worldwide threats of Communism and Fascism presented in a fascinating artistic approach. I read his text only version in 2015 and it was chilling. Seven years later, this graphic version is heart stopping. It is chock full of historic references few Americans have learned in school. I read a section every day, but one could also approach this book as a quick read. Thankfully, this book is free of references to any current politicians.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janice E Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTR4LJSOOAKX4IKEVAGZPDRW35Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O8HXGDLMK9D5?ASIN=1984859153",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Snyder to the forefront!!",
                "reviewText": "I have previous editions of this book from Timothy Snyder. I learned a lot with the first edition, when I was introduced by Rachel MADDOW. For some reason the addition of the graphical setup has helped me understand even more.I wish more people would read it so there would be a wider understanding of what’s happening in our country…before it becomes too late to save our precious democracy.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEB7MYINUSZQHYY365HM355QLAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E3TNT40U5CQQ?ASIN=1984859153",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Should be required reading",
                "reviewText": "Learn from history how people respond to oppression. Read and act to help keep our country from becoming an autocracy. An important book!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lauri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6O2P3YZV4N4LZIYCVYXS2BF2JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MQJNA2WDUBG?ASIN=1984859153",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent read",
                "reviewText": "I highly recommend this book to anyone who does not believe in banning books. It might cause some critical thinking.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robespierre",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQBV4UB2JYCF6NMVWXTG4KMB6DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZBDUAMDKF9NZ?ASIN=1984859153",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 13, 2022",
                "reviewTitle": "4.0 out of 5 stars This Essential eBook Must Be Read on a Tablet!",
                "reviewText": "Snyder is not making a \"partisan\" argument in this book; he is using past and modern examples of tyrants, autocrats and would-be autocrats to show exactly what the reader should look for. Those who are unhappy with the use of a single president to illustrate the issue seem unaware that previous presidents did not look for ways to reverse an election after the fact. There are many examples of dishonest presidents, rigged campaigns and vote suppression over the centuries, but autocracy is a different beast. Those who throw around words like *fascist* to describe pushiness or policies they hate have not grasped what fascism is. This book explains that and how to avoid, oppose and survive it.That said, you should not buy the Kindle edition if you expect to read it on a Kindle. To enjoy this Kindle-unfriendly format, you must download the Kindle app on a tablet and read it there. iPods, Surfaces, PCs and so on work quite well. If all you have is a Kindle, look for another format and don't waste your time. My opinion is that Amazon should make a PDF of this book available to customers who buy the book.I'm rating the book itself 5 for content, but the eBook 3 for recalcitrance, which makes this a solid 4.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cyndie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJGDZ4UBRQ47RRX54BTUIU6CJTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10L84KNIN0N8M?ASIN=1984859153",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2023",
                "reviewTitle": "5.0 out of 5 stars A must read for Adults ; taught to their children",
                "reviewText": "I have some of the last years been grieving about history not being taught in schools to my grandchildren. So now, I realize it is our own responsibility to teach them the language and content of this book to secure their freedom in the future!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGPC2MREW5VZUHSSEUJRCKKXITA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HPI351MZGJ6Y?ASIN=1984859153",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2021",
                "reviewTitle": "5.0 out of 5 stars Hope",
                "reviewText": "The book gave me HOPE that even I, a disabled, retired U.S. citizen, can do something to stop the White Nationalism ignited by a recent President. White Nationalists scream for \"freedom\" but by its very definition, Nationalism does not mean freedom for ALL...as protected by the U.S. Constitution. This is why almost all Republicans mock and disregard the Constitution daily. Once they abolish the Constitution, they will have the power and everyone else loses their freedom.If you don't believe that can happen in the USA, remember 9/11. We never imagined that could happen here. Foreign terrorist failed in their first attempt to destroy the World Trade Towers...then succeeded.Domestic Terrorists failed in their 1st coup attempt on 1/6/21. How long before they succeed depends entirely on what each of us does today to stop them.We must fight back in every way we can.Read the book...then do whatever you can to save OUR democracy. I started by supporting American institutions like investigative newspapers who are NOW on the first line of our defense.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan Walker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 5, 2021",
                "reviewTitle": "I wish I had Timothy Snyder as a professor!",
                "reviewText": "I have read most of Timothy Snyder's books -- and seen him on tv. He is, in my view, extremely perceptiveand clear in his views. This \"graphic\" addition offers added charm. A great present for folks concerned withwhere the world is today-- and how to navigate wherever it is going!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G. Pellegrino",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 4, 2023",
                "reviewTitle": "On Tyranny.",
                "reviewText": "Magistrale e le illustrazioni accompagnano il testo con grande efficacia. Dovrebbero adottarlo nelle scuole.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mitzi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 22, 2022",
                "reviewTitle": "Excellent book",
                "reviewText": "This was a gift to my mother, who could look back and remember and relate to many of the happenings addressed in this book. I had already bought my own and it made for great inter-generational discussion (across the pond). Thought provoking book and the graphics too. Highly recommend for others to read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Xavier Herbert -Will",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 28, 2023",
                "reviewTitle": "A must for all interested in the world and freedom",
                "reviewText": "I gave this edition as a birthday gift to my eldest grandson, as a most important awakening to the spoilers of humanity and personal freedom.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William Edmondson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 16, 2021",
                "reviewTitle": "Should be required reading.",
                "reviewText": "Demonstrates how past democracies were turned into autocracies and dictatorships.You Americans are already well down that road. You better get a grip before it is too late.Seems like too many of you have already drunk the Kool-aide.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}