{
    "remaining_requests": 697,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Open-Borders-Science-Ethics-Immigration/dp/1250316960",
    "body": {
        "name": "Open Borders: The Science and Ethics of Immigration",
        "price": "$8.97",
        "originalPrice": "",
        "rawPrice": 8.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Open-Borders-Science-Ethics-Immigration/dp/1250316960",
        "soldBy": {
            "sellerID": "A2XAZ8JI5FY49I",
            "name": "Marlton Books",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2XAZ8JI5FY49I&asin=1250316960&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91N9JPbPubL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Bryan Caplan",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Bryan+Caplan&text=Bryan+Caplan&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "Marlton Books",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 766,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 27 - 29."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Politics & Social Sciences",
                "link": "https://www.amazon.com/Politics-Social-Sciences-Books/b?ie=UTF8&node=3377866011"
            },
            {
                "name": "Politics & Government",
                "link": "https://www.amazon.com/Politics-Government/b?ie=UTF8&node=5571255011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ First Second (October 29, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 256 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250316960"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250316967"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 13 - 17 years"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.4 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.6 x 3.35 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#153,543 in Books (See Top 100 in Books) #29 in Immigration Policy #66 in Educational & Nonfiction Graphic Novels #118 in Emigration & Immigration Studies (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 766 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A Person who Reads",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBC6VUMHNVRDPLG3GV7QBAYJDRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QAQ7X43E4V7Q?ASIN=1250316960",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2021",
                "reviewTitle": "5.0 out of 5 stars Excellent book - pay no mind to the detractors",
                "reviewText": "As a disillusioned former libertarian living in a state currently being (ineptly) run by libertarians, I've developed a real loathing for the Libertarian party and its ideology. However, if all libertarians were as ethically consistent as Bryan Caplan, I would have a lot more respect for them (though I would still disagree on some key points).The first thing I want to say about this book and its reviews: Ignore the anti-immigration reviewers who are accusing the book of using a bunch of \"straw-men\" to misrepresent their true ideas (which they don't want to share, of course). As a public policy researcher, I've studied some immigration policy myself - the ideas used against immigration are generally not complex, nor nuanced, nor intelligent, frankly. Knee-jerk fear-motivated backlash rarely tends to be well-thought-out. I doubt a lot of them even know what a strawman is, aside from a word they throw around on the internet when they can't make another argument, but don't want to admit that their current arguments have been debunked.Defense of the book aside, Caplan's libertarianism is a bit glaring at times, as is his training as an economist. His idealistic faith in the power of the free market and U.S. culture does seem a little bit magical at times. This ideological bent does not actually diminish any of his arguments, in my view, because, as flawed as the U.S. system is, his arguments are still true. Immigrants generally DO benefit from coming here, and the U.S. DOES benefit from having increased immigration. There are plenty of non-graphic-novel sources that you can find to back this up, if you are too uppity to accept truth just because it's drawn in a humorous way by an excellent artist.Caplan's idealistic faith in the power and goodness of the U.S. economy DOES keep him, however, from making one of the more powerful arguments against closed borders (at least, in my opinion), which is that many U.S. companies (especially the agricultural industry) deliberately lobby for immigration restrictions while encouraging \"illegal\" immigration. Why? Because \"illegal\" immigrants have less freedom to compete in a supposedly \"free market\", and thus are easier to exploit! Illegal immigrants, out of fear of being arrested and losing an important source of income (however meager) for their families back home, are often subject to near-slavery (and in some cases, actual, literal slavery) by their employers. In addition to being horribly immoral, this system depresses wages for \"legal\" agricultural workers by giving employers the ability to easily undercut their wage demands by exploiting near-slave labor. Because these workers are paid under the table, less money goes into taxes as well. And as Caplan argues - young, ready-to-work immigrants, even with less education, are the most valuable for the U.S. economy, so forcing these folks into an exploitative 'shadow economy' is bad for everyone, even if it does mean you get to buy milk super cheap. The legal \"work visa\" system is not much better because, again, it restricts workers from competing in the market, thus depressing wages and opening them up to significant exploitation.The solution to the problems I'm talking about is clearly not \"more restrictions on immigration\" or \"more border cages\", or \"more roving paramilitary police squads for hunting down illegal immigrants\" (which should be terrifying for any freedom-loving American - if they can hunt down other people and throw them in cages, they can do the same to you, just as easily). Neither of these solutions have worked, and we certainly have tried them. Instead, a clearer path to legal immigration (as would be the case with open borders) would lead to the economic benefits that Caplan expertly details in this book, while also addressing one of the rotten pockets of corrupt pseudo-capitalism that keep dragging this country down.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eva Hnizdo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQMC6IH64N7DJMOQOXIULOD6I6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SH8THHBWKIWO?ASIN=1250316960",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Everything you need to know about emigration problem",
                "reviewText": "The best book about emigration and how obvious conclusiond are often wrong. I have gited this book to many friends.It's perfect",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William KielyWilliam Kiely",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYZA4UFTR6A5M47VQXQCHOYVSBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQWY53P716AAH?ASIN=1250316960",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2019",
                "reviewTitle": "5.0 out of 5 stars Immigration laws deprive people of their basic rights",
                "reviewText": "If you're like 73% of Americans, you either think immigration should be kept at its present level or decreased. While support for immigration is on the rise, only 27% of Americans think the level of immigration should be increased. Even fewer people believe that national borders should be opened completely so that people can be free to live and work where they'd like. Yet in Open Borders economist Bryan Caplan and cartoonist Zach Weinersmith make the case that open borders is the only moral policy prescription.From Chapter 1, \"Global Apartheid\" (pictured): \"Immigration laws tell peaceful people where they're allowed to live and work. Immigration laws don't merely *allow* discrimination, they *require* it. It's wrong to tell people where they can live or work because they're black... or women... or Jews. Why isn't it equally wrong to tell people where they can live or work because they were born in Mexico, Haiti, or India?\"Opening borders would roughly double world GDP, hastening the end of poverty and unleashing an unprecedented level of wealth leaving almost everyone better off. Even if U.S. Immigration and Customs Enforcement wasn't committing a great injustice by preventing peaceful people from living and working where they'd like, we'd all benefit immensely by letting each other immigrate freely.If you're not convinced, I recommend you get a copy of Open Borders. It addresses common fears that many people have about allowing foreigners to immigrate, and explains that even if you're still concerned, there are keyhole solutions that are less unjust than blanket restrictions on immigration that you should support instead. Many of these keyhole solutions are in effect currently and just need to be expanded. Don't deprive people of their basic rights to live and work where they'd like because of their race, sex, religion, or birthplace. Join the 27% of Americans who support increased levels of immigration.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71dp79Jmt6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81jhBBy9jpL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rajat Sirkanungo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 13, 2024",
                "reviewTitle": "Free Market. Free Trade. Open Borders.",
                "reviewText": "If you believe [like me] that Capitalism maximizes happiness (or wellbeing) and reduces poverty, suffering, and deaths, then this book is a must read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BalooZ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 23, 2023",
                "reviewTitle": "Excellente BD",
                "reviewText": "J'aime beaucoup l'auteur, pour son dessin et surtout pour son humour et son spectre d'intérêts et de connaissances très large !Je recommande la lecture de cette BD, pour l'ouverture d'esprit à avoir sur l'immigration.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 26, 2022",
                "reviewTitle": "Informative book that will challenge your worldviews",
                "reviewText": "Loved reading this book. It has a lot of good points and is for right wing and left wing people alike. If you are right wing you will find many of your fears answeredy if you are leftwing you will get valuable arguments and facts you didn't knew before. It's US centric but that doesn't really is a big problem except if you are set in your mind about this issue in your country anyway.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Garrett M. Petersen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 1, 2019",
                "reviewTitle": "Great book with great endnotes",
                "reviewText": "I devoured this book! Couldn't put it down.Caplan and Weinersmith present the science and ethics of immigration in an exhaustive and entertaining way. The book addresses the many different justifications for migration restrictions, from fiscal and economic concerns to concerns over culture and IQ, and it offers excellent rebuttals to each of them. The authors went out of their way to treat the critics' views fairly on their own terms—a rare feat given the current state of the culture war.After reading this book, I wanted to know about some of the topics in more detail, so I flipped to the endnotes, which are a treasure trove of additional discussion, useful citations, and mathematical details behind all the stats. Don't skip the endnotes!Whatever your views on migration, you are bound to find this book challenging and enlightening.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Conor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 30, 2019",
                "reviewTitle": "An outstanding and honest examination of the case for open borders",
                "reviewText": "I'm a long-time fan of both Caplan and Weinersmith so I entered this book a little biased, but I finished it thoroughly impressed beyond what I expected.Caplan methodically examines the case for open borders immigration from an economic and moral perspective, then proceeds to consider objections from financial, cultural and political standpoints. Sceptics of immigration should find that they get a fair hearing here - Caplan's goal is to take objections seriously and while he does of course land on open borders as a conclusion, he avoids being snide or insulting towards his detractors in the process.Caplan then considers 'keyhole solutions' that could address concerns without restricting immigration, which pro-immigration folks should consider to temper out idealism with pragmatism. Finally, a range of moral arguments in favour of open borders are considered, ranging from utilitarianism to Christian ethics, demonstrating that the case for free immigration is robust across many ethical frameworks.This book was delightfully entertaining to read and Weinersmith's illustrations are a perfect companion. I can't recommend this book enough - not just to fellow open borders shills, but also to those simply curious about the topic and interested to see where we're coming from.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.98",
                "sellerName": "8 trax media",
                "sellerRating": "5"
            },
            {
                "price": "$12.19",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}