{
    "remaining_requests": 458,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sharp-Objects-Gillian-Flynn/dp/0307341550",
    "body": {
        "name": "Sharp Objects (Sharp Objects: A Novel)",
        "price": "$10.87 $6.50",
        "originalPrice": "$18.00",
        "rawPrice": 10.87,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sharp-Objects-Gillian-Flynn/dp/0307341550",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "80",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71-JO+PSPwL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Gillian Flynn",
            "link": "https://www.amazon.com/Gillian-Flynn/e/B001JP3W46/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by -OnTimeBooks- and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 63417,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review NEW YORK TIMES BESTSELLER“A first novel that reads like the accomplished work of a long-time pro, the book draws you in and keeps you reading with the force of a pure but nasty addiction...Flynn's book goes deeper than your average thriller. It has all the narrative drive of a serious pop novel and much of the psychological complexity of a mainstream character study. All in all, a terrific debut.”—Alan Cheuse, The Chicago Tribune“A compulsively readable psychological thriller that marks [a] dazzling debut...[Flynn] has written a clever crime story with astonishing twists and turns, and enough suspense for the most demanding fans of the genre. But it is the sensitive yet disturbing depiction of her heroine that makes this an especially engrossing story...Flynn's empathic understanding of her major characters leads to storytelling that is sure and true, and it marks her a write to watch.”—Chicago Sun-Times“To say this is a terrific debut novel is really too mild. I haven't read such a relentlessly creepy family saga since John Farris's All Heads Turn as the Hunt Goes By, and that was thirty years ago, give or take. Sharp Objects isn't one of those scare-and-retreat books; its effect is cumulative. I found myself dreading the last thirty pages or so but was helpless to stop turning them. Then, after the lights were out, the story just stayed there in my head, coiled and hissing, like a snake in a cave. An admirably nasty piece of work, elevated by sharp writing and sharper insights.”—Stephen King “Not often enough, I come across a first novel so superb that it seems to have been written by an experienced author, perhaps with 20 earlier books to his or her credit. I'm extremely excited to discover my first debut blowout this year, a sad, horrifying book called Sharp Objects...[Flynn] is the real deal. Her story, writing and the characters will worm their way uncomfortably beneath your skin...But this is more literary novel than simple mystery, written with anguish and lyricism. It will be short-listed for one or more important awards at the end of the year...Sharp Objects is a 2006 favorite so far. I doubt I'll ever forget it.”—Cleveland Plain Dealer“A deeply creepy exploration of small-town Midwestern values and boasts one of the most deliciously dysfunctional families to come along in a while...[Flynn] handles the narrative with confidence and a surprisingly high level of skill...Wind Gap ends up the sort of place you'd never want to visit. But with Sharp Objects, you're in no hurry to leave.”—San Francisco Chronicle “Brilliant...Powerful, mesmerizing...A stunning, powerful debut from someone who truly has something to say.”—San Jose Mercury News “One of the best and most disturbing books I have read in a long time...Flynn never stoops to the gratuitous, and the torment produces haunting characters that hung around my imagination long after I had finished the book. Her skillful blending of old tragedies with new culminated in an 'oh-my-gosh' moment that I never saw coming. This book simply blew me away.”—Kansas City Star “Don't look here for the unrelenting self-deprecation and the moping over men common chick lit...I promise you'll be thoroughly unnerved at the end.”—Newsweek “First-time novelist Flynn is a natural-born thriller.”—People Style Watch “A witty, stylish, and compelling debut. A real winner.”—Harlan Coben “Flynn delivers a great whodunit, replete with hinting details, telling dialogue, dissembling clues. Better yet, she offers appalling, heartbreaking insight into the darkness of her women's lives: the Stepford polish of desperate housewives, the backstabbing viciousness of drug-gobbling, sex-for-favors Mean Girls, the simmering rage bound to boil over. Piercingly effective and genuinely terrifying.”—Kirkus Reviews (starred review) “Fans of psychological thrillers will welcome narrator/Chicago Daily Post reporter Camille Preaker with open arms...As first-time novelist Flynn expertly divulges in this tale reminiscent of the works of Shirley Jackson, there is much more to discover about Wind Gap and, most of all, about Camille.”—Library Journal “This impressive debut novel is fueled by stylish writing and compelling portraits...In a particularly seductive narrative style, Flynn adopts the cynical, knowing patter of a weary reporter, but it is her portraits of the town's backstabbing, social-climbing, bored, and bitchy females that provoke her sharpest and most entertaining writing. A stylish turn on dark crimes and even darker psyches.”—Booklist “[A] chilling debut thriller...[Flynn] writes fluidly of smalltown America.”—Publishers Weekly“[Flynn]] offers up a literary thriller that's a doozy...and she does it with wit and grit, a sort of Hitchcock visits Stephen King, with plenty of the former's offstage and often only implied violence, and the latter's sense of pacing and facility with dialogue...This is not a comfortable novel of touchy-feely family fun. Rather, it is a tough tale told with remarkable clarity and dexterity, particularly for a first-time author.”—Denver Post“A tense, irresistable thriller...Flynn's first-person narration is pitch-perfect, but even more impressive is the way she orchestrates the slim novel's onrushing tension toward a heart-stopping climax.”—Seattle Post-Intelligencer“Darkly original...Flynn expertly ratchets up the suspense...A disturbing yet riveting tale.”—People“Skillful and disturbing...Flynn writes so well. Sometimes she dips her pen in acid, sometimes she is lyrical, but always she chooses her words deftly...She has an unsparing eye for human imperfection and for the evil that moves among us.”—Washington Post“Using understated, almost stark prose, Flynn paints a jagged, unflinching portrait of the vise-like psychological bonds between women, and how their demons lead to the perpetuation of cruelties upon themselves and others. The end result is an unsettling portrait of how long emotional wounds can last- and how deeply they hurt.”—Baltimore Sun“More in the tradition of Joyce Carol Oates than Agatha Christie, this one will leave readers profoundly disturbed. But from the first line...you know you're in the hands of a talented and accomplished writer.”—The Boston Globe“[A] breathtaking debut...Written with multiple twists and turns, Sharp Objects is a work of psychological prowess and page-turning thrills.”—Richmond Times“As suspenseful as the V.C. Andrews books you shared in high school, but much smarter.”—Glamour“Sharp Objects is one of the freshest debut thrillers to come around in a long while. It's a gripping, substantive story, stripped of cliche, and crafted with great style. The characters are refreshingly real, burdened with psychological issues that enrich the story. And the ending, which I was positive I could predict, is unpredictable. Sharp Objects is, indeed, quite sharp.”—Augusten Burroughs“Sharp, clean, exciting writing that grabs you from the first page. A real pleasure.”—Kate Atkinson, author of Case Histories and One Good Turn About the Author Gillian Flynn is the author of the #1 New York Times bestseller Gone Girl, for which she wrote the Golden Globe–nominated screenplay; the New York Times bestsellers Dark Places and Sharp Objects; and a novella, The Grownup. A former critic for Entertainment Weekly, she lives in Chicago with her husband and children. Excerpt. © Reprinted by permission. All rights reserved. Chapter One My sweater was new, stinging red and ugly. It was May 12 but the temperature had dipped to the forties, and after four days shivering in my shirtsleeves, I grabbed cover at a tag sale rather than dig through my boxed-up winter clothes. Spring in Chicago. In my gunny-covered cubicle I sat staring at the computer screen. My story for the day was a limp sort of evil. Four kids, ages two through six, were found locked in a room on the South Side with a couple of tuna sandwiches and a quart of milk. They'd been left three days, flurrying like chickens over the food and feces on the carpet. Their mother had wandered off for a suck on the pipe and just forgotten. Sometimes that's what happens. No cigarette burns, no bone snaps. Just an irretrievable slipping. I'd seen the mother after the arrest: twenty-two-year-old Tammy Davis, blonde and fat, with pink rouge on her cheeks in two perfect circles the size of shot glasses. I could imagine her sitting on a shambled-down sofa, her lips on that metal, a sharp burst of smoke. Then all was fast floating, her kids way behind, as she shot back to junior high, when the boys still cared and she was the prettiest, a glossy-lipped thirteen-year-old who mouthed cinnamon sticks before she kissed. A belly. A smell. Cigarettes and old coffee. My editor, esteemed, weary Frank Curry, rocking back in his cracked Hush Puppies. His teeth soaked in brown tobacco saliva. \"Where are you on the story, kiddo?\" There was a silver tack on my desk, point up. He pushed it lightly under a yellow thumbnail. \"Near done.\" I had two inches of copy. I needed six. \"Good. Fuck her, file it, and come to my office.\" \"I can come now.\" \"Fuck her, file it, then come to my office.\" \"Fine. Ten minutes.\" I wanted my thumbtack back. He started out of my cubicle. His tie swayed down near his crotch. \"Preaker?\" \"Yes, Curry?\" \"Fuck her.\" Frank Curry thinks I'm a soft touch. Might be because I'm a woman. Might be because I'm a soft touch. Curry's office is on the third floor. I'm sure he gets panicky-pissed every time he looks out the window and sees the trunk of a tree. Good editors don't see bark; they see leaves--if they can even make out trees from up on the twentieth, thirtieth floor. But for the Daily Post, fourth-largest paper in Chicago, relegated to the suburbs, there's room to sprawl. Three floors will do, spreading relentlessly outward, like a spill, unnoticed among the carpet retailers and lamp shops. A corporate developer produced our township over three well-organized years--1961-64--then named it after his daughter, who'd suffered a serious equestrian accident a month before the job was finished. Aurora Springs, he ordered, pausing for a photo by a brand-new city sign. Then he took his family and left. The daughter, now in her fifties and fine except for an occasional tingling in her arms, lives in Arizona and returns every few years to take a photo by her namesake sign, just like Pop. I wrote the story on her last visit. Curry hated it, hates most slice-of-life pieces. He got smashed off old Chambord while he read it, left my copy smelling like raspberries. Curry gets drunk fairly quietly, but often. It's not the reason, though, that he has such a cozy view of the ground. That's just yawing bad luck. I walked in and shut the door to his office, which isn't how I'd ever imagined my editor's office would look. I craved big oak panels, a window pane in the door--marked Chief--so the cub reporters could watch us rage over First Amendment rights. Curry's office is bland and institutional, like the rest of the building. You could debate journalism or get a Pap smear. No one cared. \"Tell me about Wind Gap.\" Curry held the tip of a ballpoint pen at his grizzled chin. I could picture the tiny prick of blue it would leave among the stubble. \"It's at the very bottom of Missouri, in the boot heel. Spitting distance from Tennessee and Arkansas,\" I said, hustling for my facts. Curry loved to drill reporters on any topics he deemed pertinent--the number of murders in Chicago last year, the demographics for Cook County, or, for some reason, the story of my hometown, a topic I preferred to avoid. \"It's been around since before the Civil War,\" I continued. \"It's near the Mississippi, so it was a port city at one point. Now its biggest business is hog butchering. About two thousand people live there. Old money and trash.\" \"Which are you?\" \"I'm trash. From old money.\" I smiled. He frowned. \"And what the hell is going on?\" I sat silent, cataloguing various disasters that might have befallen Wind Gap. It's one of those crummy towns prone to misery: A bus collision or a twister. An explosion at the silo or a toddler down a well. I was also sulking a bit. I'd hoped--as I always do when Curry calls me into his office--that he was going to compliment me on a recent piece, promote me to a better beat, hell, slide over a slip of paper with a 1 percent raise scrawled on it--but I was unprepared to chat about current events in Wind Gap. \"Your mom's still there, right, Preaker?\" \"Mom. Stepdad.\" A half sister born when I was in college, her existence so unreal to me I often forgot her name. Amma. And then Marian, always long-gone Marian. \"Well dammit, you ever talk to them?\" Not since Christmas: a chilly, polite call after administering three bourbons. I'd worried my mother could smell it through the phone lines. \"Not lately.\" \"Jesus Christ, Preaker, read the wires sometime. I guess there was a murder last August? Little girl strangled?\" I nodded like I knew. I was lying. My mother was the only person in Wind Gap with whom I had even a limited connection, and she'd said nothing. Curious. \"Now another one's missing. Sounds like it might be a serial to me. Drive down there and get me the story. Go quick. Be there tomorrow morning.\" No way. \"We got horror stories here, Curry.\" \"Yeah, and we also got three competing papers with twice the staff and cash.\" He ran a hand through his hair, which fell into frazzled spikes. \"I'm sick of getting slammed out of news. This is our chance to break something. Big.\" Curry believes with just the right story, we'd become the overnight paper of choice in Chicago, gain national credibility. Last year another paper, not us, sent a writer to his hometown somewhere in Texas after a group of teens drowned in the spring floods. He wrote an elegiac but well-reported piece on the nature of water and regret, covered everything from the boys' basketball team, which lost its three best players, to the local funeral home, which was desperately unskilled in cleaning up drowned corpses. The story won a Pulitzer. I still didn't want to go. So much so, apparently, that I'd wrapped my hands around the arms of my chair, as if Curry might try to pry me out. He sat and stared at me a few beats with his watery hazel eyes. He cleared his throat, looked at his photo of his wife, and smiled like he was a doctor about to break bad news. Curry loved to bark--it fit his old-school image of an editor--but he was also one of the most decent people I knew. \"Look, kiddo, if you can't do this, you can't do it. But I think it might be good for you. Flush some stuff out. Get you back on your feet. It's a damn good story--we need it. You need it.\" Curry had always backed me. He thought I'd be his best reporter, said I had a surprising mind. In my two years on the job I'd consistently fallen short of expectations. Sometimes strikingly. Now I could feel him across the desk, urging me to give him a little faith. I nodded in what I hoped was a confident fashion. \"I'll go pack.\" My hands left sweatprints on the chair. I had no pets to worry about, no plants to leave with a neighbor. Into a duffel bag, I tucked away enough clothes to last me five days, my own reassurance I'd be out of Wind Gap before week's end. As I took a final glance around my place, it revealed itself to me in a rush. The apartment looked like a college kid's: cheap, transitory, and mostly uninspired. I promised myself I'd invest in a decent sofa when I returned as a reward for the stunning story I was sure to dig up. On the table by the door sat a photo of a preteen me holding Marian at about age seven. We're both laughing. She has her eyes wide open in surprise, I have mine scrunched shut. I'm squeezing her into me, her short skinny legs dangling over my knees. I can't remember the occasion or what we were laughing about. Over the years it's become a pleasant mystery. I think I like not knowing. I take baths. Not showers. I can't handle the spray, it gets my skin buzzing, like someone's turned on a switch. So I wadded a flimsy motel towel over the grate in the shower floor, aimed the nozzle at the wall, and sat in the three inches of water that pooled in the stall. Someone else's pubic hair floated by. I got out. No second towel, so I ran to my bed and blotted myself with the cheap spongy blanket. Then I drank warm bourbon and cursed the ice machine. Wind Gap is about eleven hours south of Chicago. Curry had graciously allowed me a budget for one night's motel stay and breakfast in the morning, if I ate at a gas station. But once I got in town, I was staying at my mother's. That he decided for me. I already knew the reaction I'd get when I showed up at her door. A quick, shocked flustering, her hand to her hair, a mismatched hug that would leave me aimed slightly to one side. Talk of the messy house, which wouldn't be. A query about length of stay packaged in niceties. \"How long do we get to have you for, sweetness?\" she'd say. Which meant: \"When do you leave?\" It's the politeness that I find most upsetting. I knew I should prepare my notes, jot down questions. Instead I drank more bourbon, then popped some aspirin, turned off the light. Lulled by the wet purr of the air conditioner and the electric plinking of some video game next door, I fell asleep. I was only thirty miles outside my hometown, but I needed one last night away. In the morning I inhaled an old jelly doughnut and headed south, the temperature shooting up, the lush forest imposing on both sides. This part of Missouri isn't quite mountainous, but the hills are massive, like giant rolling swells. Hitting a summit, I could see miles of fat, hardy trees broken only by the thin strip of highway I was on. You can't spot Wind Gap from a distance; its tallest building is only three stories. But after twenty minutes of driving, I knew it was coming: First a gas station popped up. A group of scraggly teenage boys sat out front, barechested and bored. Near an old pickup, a diapered toddler threw fistfuls of gravel in the air as his mother filled up the tank. Her hair was dyed gold, but her brown roots reached almost to her ears. She yelled something to the boys I couldn't make out as I passed. Soon after, the forest began to thin. I passed a scribble of a strip mall with tanning beds, a gun shop, a drapery store. Then came a lonely cul-de-sac of old houses, meant to be part of a development that never happened. And finally, town proper. For no good reason, I held my breath as I passed the sign welcoming me to Wind Gap, the way kids do when they drive by cemeteries. It had been eight years since I'd been back, but the scenery was visceral. Head down that road, and I'd find the home of my grade-school piano teacher, a former nun whose breath smelled of eggs. That path led to a tiny park where I smoked my first cigarette on a sweaty summer day. Take that boulevard, and I'd be on my way to Woodberry, and the hospital. I decided to head directly to the police station. It squatted at one end of Main Street, which is, true to its word, Wind Gap's main street. On Main Street you will find a beauty parlor and a hardware store, a five-and-dime called Five-and-Dime, and a library twelve shelves deep. You'll find a clothing store called Candy's Casuals, in which you may buy jumpers, turtlenecks, and sweaters that have ducks and schoolhouses on them. Most nice women in Wind Gap are teachers or mothers or work at places like Candy's Casuals. In a few years you may find a Starbucks, which will bring the town what it yearns for: prepackaged, preapproved mainstream hipness. For now, though, there's just a greasy spoon, which is run by a family whose name I can't remember. Main Street was empty. No cars, no people. A dog loped down the sidewalk, with no owner calling after it. All the lampposts were papered with yellow ribbons and grainy photocopies of a little girl. I parked and peeled off one of the notices, taped crookedly to a stop sign at a child's height. The sign was homemade, \"Missing,\" written at the top in bold letters that may have been filled in by Magic Marker. The photo showed a dark-eyed girl with a feral grin and too much hair for her head. The kind of girl who'd be described by teachers as a \"handful.\" I liked her. Natalie Jane Keene Age: 10 Missing since 5/12 Last seen at Jacob J. Asher Park, wearing blue-jean shorts, red striped T-shirt Tips: 588-7377 I hoped I'd walk into the police station and be informed that Natalie Jane was already found. No harm done. Seems she'd gotten lost or twisted an ankle in the woods or ran away and then thought better of it. I would get in my car and drive back to Chicago and speak to no one. Turns out the streets were deserted because half the town was out searching the forest to the north. The station's receptionist told me I could wait--Chief Bill Vickery would be returning for lunch soon. The waiting room had the false homey feel of a dentist's office; I sat in an orange endchair and flipped through a Redbook. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 3 mins",
            "FREE delivery February 29 - March 4 on orders shipped by Amazon over $35",
            "Or fastest delivery February 27 - 29"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NOW AN HBO® LIMITED SERIES STARRING AMY ADAMS, NOMINATED FOR EIGHT EMMY AWARDS, INCLUDING OUTSTANDING LIMITED SERIESFROM THE #1 NEW YORK TIMES BESTSELLING AUTHOR OF GONE GIRLFresh from a brief stay at a psych hospital, reporter Camille Preaker faces a troubling assignment: she must return to her tiny hometown to cover the murders of two preteen girls. For years, Camille has hardly spoken to her neurotic, hypochondriac mother or to the half-sister she barely knows: a beautiful thirteen-year-old with an eerie grip on the town. Now, installed in her old bedroom in her family's Victorian mansion, Camille finds herself identifying with the young victims—a bit too strongly. Dogged by her own demons, she must unravel the psychological puzzle of her own past if she wants to get the story—and survive this homecoming.Praise for Sharp Objects“Nasty, addictive reading.”—Chicago Tribune “Skillful and disturbing.”—Washington Post “Darkly original . . . [a] riveting tale.”—People",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10457"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Crown; Reprint edition (July 31, 2007)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 254 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0307341550"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0307341556"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL770L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.19 x 0.58 x 7.98 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,781 in Books (See Top 100 in Books) #192 in Murder Thrillers #476 in Psychological Thrillers (Books) #795 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 63,417 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ricci",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDYPCB3FK7DHQNU7YW6RPZY6AAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ0SLT4L939NT?ASIN=0307341550",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars love everything about it",
                "reviewText": "Twisted, raw and pain filled honesty. Clear picture of how we can love someone but also hurt them at the same time. Great book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dino Parenti",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEQY4KKHSM4OXPR3CUAKSQGN34Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PPFE3O7LTMBI?ASIN=0307341550",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2014",
                "reviewTitle": "4.0 out of 5 stars Women at war",
                "reviewText": "(Original review appears in Pantheon Magazine at http://pantheonmag.com/book-review-sharp-objects-by-gillian-flynn/)At some point in most novels, a paragraph or single sentence, cleverly situated in a way that isn’t expository, etches in thumbnail the major theme of a work. The better ones find ways to incorporate it as direct function of character, as in the following:\"I felt no particular allegiance to this town. This was the place my sister died, the place I started cutting myself. A town so suffocating and small, you tripped over people you hated every day. People who knew things about you. It’s the kind of place that leaves a mark.\"So muses Camille Preaker, Gillian Flynn’s restless reporter and sardonic anti-heroine from her debut novel, Sharp Objects. With the current buzz still humming over her latest book, Gone Girl—with film adaptation by David Fincher slated for October of 2014—revisiting her first book seems an apropos primer of this dark and penetrating author.Camille’s a journalist for The Daily Post, the “fourth largest in Chicago,” a newspaper with its head barely above water, and whose editor, Frank Curry, mines the cold-case files for the next human interest tale sure to snag a Pulitzer. When the disappearance of a second girl occurs in the town of Wind Gap, Missouri, he dispatches the reluctant Camille at once to get the scoop.There’s only one problem: Wind Gap is Camille’s home town. Wind Gap hasn’t been good to Camille, a place she has shunned for eight years. A place she describes as “One of those crummy towns prone to misery.” She says this not from dread, but from a quietly haunting intimacy with torment. At the start of the novel, we learn that Camille’s been freshly released into the world after spending several months under psychiatric care. She’s a cutter, specifically of words. Her body is a monument to insecurity and anger, starting at the age of thirteen with Wicked carved into her left hip, and stopping at twenty-nine with Vanish. The only unmarred spot on her body is a circle of perfect skin the size of a fist, on the small of her back which she could never reach.As with most any self-mutilation, it’s but the physical manifestation of deeper emotional traumas, in Camille’s case prompted by the death of her younger sister, Marian, from an ambiguous illness. The tension surrounding this mysterious passing serves as lynchpin for her strained relationship with her mother, Adora, Wind Gap’s unspoken matriarch. Wealthy, priggish, steeped in passive-aggressiveness and secrets, Adora is never sparing of her disdain for Camille, telling her in a casual manner: “You remind me of my mother. Joya. Cold and distant and so, so smug. My mother never loved me either. And if you girls won’t love me, I won’t love you.”The other of the girls she refers to is Camille’s half-sister, Amma, a sexually hyper-developed thirteen year-old who heads a clique of equally spiteful girls, and who in many ways is her mother’s equal in cruelty and malice.Rattling between the warring factions of her mother and step-sister, Camille attempts to investigate the abduction-murders in Wind Gap. When the missing girl, Ann Nash, turns up dead not long after her arrival in town—found strangled within a cleft between two buildings, her teeth yanked out (a virtual carbon-copy of the first victim, Natalie Keen)—Camille finds little help from the male authorities. Men view her as suspicious, an outsider with a dubious agenda, yet the scorn doesn’t surprise or upset Camille. She’s used to it. Other than her boss, Frank, who’s a well-meaning but scattershot father-figure, men are often portrayed as dichotomies rather than with any subtlety or depth. They’re afterthoughts, fleeting, a part of the scenery. This isn’t a detriment to the book; they are as Camille sees them based on her experiences. Bill Vickery, the police chief, is an all-business cipher, dismissive of theories that don’t fit his own. The fathers in the book, namely those of the two victims, as well as her own step-father, Alan, are ineffectual and milquetoast. Even one of the chief suspects, the second victim’s father, Bob Nash, is such a laconic wallflower that even Camille’s suspicion of him is passive.Her impulse is to be drawn towards the damaged sorts. The dark and the indifferent. She says of some teenage boys preening on the street: \"Those kids, cocky and pissed and smelling like sweat, aggressively oblivious of our existence, always compelled me.\"Two men eventually serve this function for Camille. The first is a cocksure detective visiting from Kansas City, Richard Willis. His interest in Camille is obvious to her from the start, and though attracted to him as well, she’s apprehensive. She keeps him at arm’s length, at first engaging in a mutual pact of information gathering from his end in exchange for company and candor from hers. But the dearth of intimacy in her life eventually topples the pact into the sexual, albeit mostly clothed in Camille’s case, as she’s reluctant to let any man know that she’s a cutter.That revelation is ultimately bestowed upon John Keen, the second victim’s older brother and on-again, off-again murder suspect in what passes for the book’s most tender, affectionate scene in a roadside motel.It isn’t long though before Camille realizes that her best chance to secure clues or leads resides within the secretive cliques of female enmity prevalent in Wind Gap. It is a private world where women hurt each other both overtly and passively, even at funerals. Where gossip is both weapon and shield, wielded for social advancement. This antagonism lies at the core of Sharp Objects. The book is less murder mystery and more an exploration of the cruelty that women inflict upon one another, be it friend to friend, classmate to classmate, sister to sister, or mother to daughter—all of which play a role, often spanning multiple generations.Not even the two murder victims are immune from this hostility, as it is gradually learned through Camille’s piecemeal interrogations of witnesses and suspects. The first victim, Natalie, had assaulted a female classmate back in Philadelphia; “They saved her left eye,” is all we’re left to know. The second victim, Natalie, is a chronic biter, one of her victims being Adora who used to watch over both girls at different points, thus relegating her eventually to the suspect list.But the cruelty isn’t limited to others. They’re just as adept in dispensing it upon themselves. Self-abuse runs rampant, from Adora’s intractable plucking out of her eyebrows while tending to her dying daughter, Marian, to Camille’s equally impulsive drinking and cutting, the latter acting as a coping refrain throughout.Number of synonyms for “anxious” carved in my skin: eleven, she ponders at one point. Later on it’s, Unworthy flared up in my leg, followed by, Belittle burned on my right hip, and so the scoring goes.At the heart of it all burns a generational war over control, status, and vanity. Camille and Adora’s relationship, cleaved forever with the death of Marian, is in a persistent state of escalation, even in absentia. Upon Camille’s return to Wind Gap, Adora wastes no time exercising all the petty cruelties and power-plays while shamelessly utilizing the plausible deniability of victimhood, all of which Camille is privy to from the get go.Every tragedy that happens in the world happens to my mother, and this more than anything about her turns my stomach.Adora’s grief at having lost Marian has become a virtual hobby, one that she attempts to relive again through her two other daughters. Camille soon realizes that the milk and pills Adora’s been giving them both as “relaxants,” are in actuality making them sicker by the day, especially Amma who’s been subjected to it longer. This prompts Camille to track down the nurse that ministered to Marian during her final days, and through the rediscovering of original medical files that had been tampered with, it is learned that Adora had been slowly poisoning her first daughter for years.Much of this serves the logistical and procedural facets of the book however, which in many respects is the least important aspect of an otherwise compelling but ruthless character study of a woman at war to wrest her identity from history and genetics. When the killer of the two girls is eventually “revealed,” you’re more beleaguered by the inevitability of it than you are shocked. But it’s only because Flynn has artfully played with genre expectations and structures to lead one to such a conclusion. A twist is added near the end that upends the original reveal, and it’s a shocking revelation if unexpected, a sad one if anticipated. A kind of perverse circle has closed, and in the middle sits Camille, perhaps finally with the determination to pierce through it.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L A S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXIVEZN7FHNFSC3O4ABU2S2HLNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R198VJOYU2OAMA?ASIN=0307341550",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Would read again",
                "reviewText": "Book in great condition!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cat Daddy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEJFSB3KPUEXS7AWHCRQG4JHRNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZQ82AEDAALIL?ASIN=0307341550",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "3.0 out of 5 stars TV show was better in my opinion",
                "reviewText": "And that is very rare. I really like the idea but don’t think that it was executed very well. I feel that so many instances and conversations were unnecessary in the story telling, and this really could have been wrapped up sooner. Gillian really gave bone work where it wasn’t needed and skimmed where it was.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Harlequin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJPWLS2KTKV4DUC4MFQJUYT2SCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KNH42ODCZ0SI?ASIN=0307341550",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2023",
                "reviewTitle": "4.0 out of 5 stars I have some thoughts",
                "reviewText": "Camille is a messed up character. I’m gonna be honest, I totally watched the HBO remake before reading the book so I had expectations, I expected a gothic murder mystery. What I got was a incredibly flawed broken character that was too damaged for relatability. With the cutting, sexual trauma, and her need for intimacy so tied to parental love that it was off putting - I get the desire of children who never experienced love to what to replace their parents, but this takes it to a whole new level.You reading this book and you realize that this person is mentally coming of a child without any real understanding of what adult relationships should be or how families should interact with each other and it is really hard to get past the damage that has already been done to truly enjoy the story.Another reviewer commented on the male characters basically being window dressing, presented as one dimension props for the story. Which aside from John, the only male character who acted with any form of agency of his own, that’s something I found to be true. I feel like if your gonna have characters present for the large majority of the story, have the be secondary characters that drive the plot forward, they need to be more the 1 dimensional troupes.Light spoilers about the ending ahead:I feel like the main Camille needed to be less outside of the norm to be relatable, is it common for a child who was never allowed to be one to assign other adults parental roles, sure. But this takes that to the extreme, making it a unsatisfying ending to what is a roller coaster of trauma. It just doesn’t feel like a win or a loss, just more of the same.I wouldn’t say I enjoyed this book, but I am glad I read it. Generally this is outside of my normal horror genre preferences and I really may have come to this book expecting a lot more from Flynn then she had the ability to give. It is something I do with dramas, reading more into them then was what intended. I just see a bunch of different ways this could have been a more put together story, all of them small tweaks that would have left me more satisfied with the resolution then I was. It’s worth the read, I’m not unset I bought it, I just don’t see a re-read happening.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janice L. Peterson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEONUGTBB67JSKGQQKAOULBBYROQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ID8TYQL6ESL4?ASIN=0307341550",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars another page-turner",
                "reviewText": "Flynn has done it again. Page after page keeps turning. It’s 3:00am! When will I learn. Sharp Objects is a bit dark at times but continues to come up with the unexpected.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bento Jose Pereira Lira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 17, 2023",
                "reviewTitle": "excelente. recomendo",
                "reviewText": "excelente. recomendo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Skuam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 27, 2023",
                "reviewTitle": "Heartbreaking",
                "reviewText": "First I saw the series and they traumatized me. A couple of years later I decided to read the book because I am a Gillian Flynn's fan. I made me more sad than traumatized, but I have to say I still enjoy reading her books, they are real page turners and I like how her characters are flawed but still endearing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amber D",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 18, 2023",
                "reviewTitle": "Outstanding / deserves 6 stars",
                "reviewText": "I think I am genuinely addicted to reading, I read such a lot- like ‘200 books a year ‘lot’’. Some weeks I can read a book almost daily- much rarer are the weeks when I have read maybe only one or two books. This one I devoured in around 24 hours (a long train journey carved out some guilt free reading time yesterday- and I had to take the afternoon off work today to read some more of this book. Some time after midnight, I had finished it). It was incredibly good- and a long time since I’ve read a book this good. I don’t want to spoil it for the next reader so will just say that I found this book absolutely outstanding- an incredible piece of writing that is still affecting me long after I have read the last word. Parts of it were so well written that I read them twice - just for pleasure- before moving on in the story. That never happens! The character descriptions were so well written and the depiction of the small town American society so beautifully drawn- I felt like these people were real. (It always astounds me when I am so into a book and I look up from the pages- I am shocked to find myself back in my own life.). It was such a great read. I can’t recommend this book enough. In fact - I may have to go back and read it again- I am such a saddo I am missing Camille.I have read the author’s more famous work (Gone Girl) previously but some years ago. I might have to start reading that again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "YB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 12, 2023",
                "reviewTitle": "Deeply disturbing but brilliant",
                "reviewText": "For context, I had already seen the TV serie (with Amy Adams), so knew what to expect. As I had found it very interesting, I went back to \"the source\", and it was definitly worth it.The characters are really well described, with Camille's trauma emerging little by little in very clear images (or should I say words on her skin ?) ; Adora's and Amma's troubles are presented step by step, with clues clearly present so the end is definitly well prepared. If Adora's trouble is fairly clear from the beginning (though the scope remains to be revealed), Amma playing on her double image - and some of her words to her sister, reveal only progressively the damage.You may sometimes want to shake some \"sense\" into Camille (specially a later chapter), but with her issues her behavior is largely explainable.The last chapters particularly I could not put down, even knowing the end, as the author really made you feel this sickness, this urgency, this decay. I felt torn between deep sadness and disgust for these sick mother/daughter relationships, and the fascination of the excellent description of these relationship.Definitly a book well written and worth reading because of the psychology, just expect to get out of there quite shaken (and in my case, thankful for a healthy relationship with my mother!)“Lately, I've been leaning towards kindness.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.C.P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on October 18, 2022",
                "reviewTitle": "Nice suspense triller",
                "reviewText": "The book came correctly and really fast. The book itself is awesome, a very good thriller.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.54",
                "sellerName": "InfiniteWares",
                "sellerRating": "4.5"
            },
            {
                "price": "$10.54",
                "sellerName": "Shakespeare Book House",
                "sellerRating": "5"
            }
        ]
    }
}