{
    "remaining_requests": 549,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Zero-Fail-Rise-Secret-Service/dp/0399589015",
    "body": {
        "name": "Zero Fail: The Rise and Fall of the Secret Service",
        "price": "$6.00",
        "originalPrice": "$30.00",
        "rawPrice": 6.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Zero-Fail-Rise-Secret-Service/dp/0399589015",
        "soldBy": {
            "sellerID": "AIBHMZLWIBJNH",
            "name": "Book_Outpost",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AIBHMZLWIBJNH&asin=0399589015&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91wvq0pDghL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Carol Leonnig",
            "link": "https://www.amazon.com/Carol-Leonnig/e/B083JKWH8N/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Book_Outpost",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 7412,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$3.99 delivery February 22 - 27.",
            "Or fastest delivery February 21 - 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Politics & Social Sciences",
                "link": "https://www.amazon.com/Politics-Social-Sciences-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3377866011"
            },
            {
                "name": "Politics & Government",
                "link": "https://www.amazon.com/Politics-Government/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5571255011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Random House (May 18, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 560 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0399589015"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0399589010"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.5 x 1.62 x 9.54 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#15,187 in Books (See Top 100 in Books) #5 in Law Enforcement (Books) #7 in Law Enforcement Politics #25 in United States Executive Government"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 7,412 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/728d9817-b11e-4f8d-8cae-fc54a1277dea.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90f91ff5-dc81-44b6-a57e-79686fac95ce.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6d1d8fa-e1f7-4fb3-ae85-0a7eebdba4d0.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/137861b0-e765-4033-8157-43695caf01d2.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jo Manning, Published Author",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAXIUWB6J2UZT644MHOBDQ26PMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NANZ7NN5KNAB?ASIN=0399589015",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2021",
                "reviewTitle": "5.0 out of 5 stars Yeah, the truth hurts!",
                "reviewText": "The review I wrote for the miamiartzine: An Investigative Look at the Failures of The U.S. Secret Service ... Washington Post Reporter Unleashes Many SecretsFrom the pen of Carol Leonnig, a three-time Pulitzer Prize-winning Washington Post investigative reporter is an expose, a book that chronicles a litany of failure on every level.According to Leonnig – who has been researching the Secret Service for years and counts many sources in the SS for her information – this important organization charged with protecting the leaders of our government consistently falls down on its job.This is not a pleasant book to read. It is, in fact, devastating. Should readers be skeptical about the facts?Readers will draw their own conclusions, of course, based in part on their political leanings, but the instances cited should give a good deal of cause for alarm.Leonnig's bottom line? The Secret Service is broken. It has been broken for many years, and a lack of competent leadership (with a never-ending revolving door of directors), back-biting amongst agents, the politicizing of those agents, insufficient money to run operations and to pay agents and staff adequately, abysmally poor training of agents, and a shocking lack of knowledge of the most basic technological implementations – no-brainers – that should have been put in place to ensure physical safety, is well analyzed by Leonnig. And, yes, I do believe her.The instances of incompetence, from bad leadership to bad agent behavior, to outright blunders that should never have occurred in an organization that should have been technologically savvy in protecting the lives of United States presidents, their families, and others in the administration of this country, is astounding. Truly, it borders on the unbelievable.Here is some of the history of the organization.The Secret Service began as part of the Department of the Treasury during the aftermath of the Civil War. It was founded in 1865 to combat the widespread counterfeiting of U.S. currency and to stifle the use of various forms of Confederate monies used by the Confederacy. It was not until 2003 that it became free of the Treasury Department. (It is now under the Department of Homeland Security.) From its home page, this is its mission statement:Today, the Secret Service's mission is two-fold: protection of the president, vice president and others; and investigations into crimes against the financial infrastructure of the United States.These “others” include the president and vice president's immediate families, former presidents, their spouses and their children, major presidential and vice-presidential candidates and their spouses, and visiting foreign heads of state.Here is a summary of their duty to protect, concisely stated from Wikipedia, which is as good a source as I have seen describing their mandate:The Secret Service also provides physical security for the White House Complex the Treasury Department building, the vice president’s residence, and all foreign diplomatic missions in Washington, D.C.The protective mission calls for the coordination of manpower and logistics with local and state law enforcement as well as visiting, assessing, and securing sites where the government and other officials they protect might be in attendance. A crucial part of the institution's job is to thoroughly assess threats against those that they are in charge of protecting. Nothing is to be considered too minor to be overlooked, from threats on social media, to published manifestos, to hearsay, to shouts at rallies and on the streets.Agents and others have provided leaked information extensively to the author. Indeed, leaking seems to be one thing that Secret Service agents do very, very well, If only they did their jobs as well. And there are a good deal of facts to support what Loennig's sources have told her.Here are some historical facts learned from this book.Did you know that President Abraham Lincoln might not have been assassinated if the agent in charge of guarding him had not stepped outside for a few minutes. (Had you heard this before? I had not.)Getting closer to the present day, President Jack Kennedy might have survived Dallas if agents had – as they should have done – investigated every floor of the buildings his motorcade passed by, including the Texas School Book Depository. This was routine, but it was not done. And he might have well survived that last bullet, the one that killed him, if he had not insisted that the agents guarding him not stay as close to his body as they knew they should have. But Kennedy disliked having agents too close to him physically. (He knew better, huh? Nope, it turned out that he didn’t.)Bill Clinton was another president who did not like his Secret Service agents too close. It prevented him from shaking hands with the public, reaching out to crowds and seeking the most attractive women in any audience. And, yes, let us talk about that. Both Kennedy and Clinton had a history of serial adultery and clandestine meetings with women not their wives. Secret Service agents spent many hours outside of doors where trysts took place. Were these countless women ever vetted by agents? No, they weren’t, we learn in Leonnig's book.Any of them could have been up to no good, possibly even in the pay of foreign enemies. Incredible behavior on the part of these presidents. (What Leonnig has to say about Monica Lewinsky – and Hillary Clinton – that’s food for thought, also.)Another ugly revelation – and incidents of this bad behavior and lack of respect for the institution's mission have been widely reported and substantiated – was the indiscriminate carousing of Secret Service agents while supposedly guarding presidents and their entourages abroad. There was the news from Cartagena, Colombia. Boozing and cavorting with prostitutes. How can any reputable agency tolerate such behavior? But instances like these went on for years. Boozing also caused accidents and led to the firing of top officials in the Secret Service.There have been multiple instances over the last decades of potentially dangerous individuals getting onto the White House grounds (the White House’s code name is Crown, by the way, for those of you who might be interested in the Secret Service codes for individuals and places). There has even been a breach of Crown proper itself. Yes, someone did get in when radio signals between agents did not function properly – and when agents stepped away from their delegated positions.Another instance was when one of the main doors to Crown, going up to the presidential quarters, was breached. In 2014, a mentally ill fellow got in with a knife. It was extremely lucky that he was tackled inside, but he got far.President Barack Obama received many, many death threats, even before he took office. Yes, many were investigated and dealt with, but the instance above happened during one of his terms of office. Rather scary. He was out of town, but his two young daughters and mother-in-law were there.President Donald Trump was a nightmare in many respects for the Secret Service. Of course, for starters, he did not understand its role and kept confusing it with the FBI. He also used the Secret Service and bankrolled with taxpayer dollars, took golfing trips that demanded protection, as well as all the trips abroad for members of his family. (In only two months of his administration, the cash-strapped Secret Service paid out $20 million for services rendered.) And his organization charged the Secret Service (hint, that’s us again, the taxpayers) when they were put up in various Trump hotels.In another fact presented in the book, President-elect Joe Biden was not automatically given Secret Service protection, owing to a combination of factors that included Trump-leaning members of the Service reluctant to do their jobs and Trump calling out the legitimate election as a fraud.In addition to the boozing and carousing with prostitutes, many other rules assumed sacrosanct were broken regularly. One that came to public attention only recently were the alleged relationships between a Trump daughter and a Trump ex-daughter-in-law and two handsome (well, they would be, wouldn’t they?) Secret Service agents. Verboten, this fraternization, strictly verboten. The agents were re-assigned. (A lot of re-assigning goes on in the Secret Service, as you will learn when you read the book.)While I applaud the work that went into this revealing book, and I understand that the Secret Service had many successes, too, the bad outweighs the good, in my opinion.It is an extremely disheartening read. While you may be glad you read it, you may be sorry on the other hand.The U.S. Secret Service is a national disgrace and needs to be scrubbed clean from top to bottom.Zero fail? Massive fail, more like.We can only hope that Leonnig's book, as it puts the Secret Service under a glaring spotlight, brings about a call to action.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rita J. Newhouse",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHKWR7SF3ZS3FTHWBOSABKEBMJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SLBOXXMODR3H?ASIN=0399589015",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2022",
                "reviewTitle": "5.0 out of 5 stars Secret Service",
                "reviewText": "et ServiceZero Fail by Carol LeonnigZero Fail: The Rise and Fall of the Secret Serviceby Carol Leonnig12518301RJ Newhouse's reviewJan 09, 2022 · editThe Secret Service was formed to catch counterfeiters and check forgers impeding economic recovery after the Civil War. With the assassinations of Garfield and McKinley, Congress charged it with presidential protection. Most agents have been upstanding and willing to give their lives if necessary, but the Service has always been understaffed, political though forbidden, riddled with jealousy for positions, suffered from incompetent leadership, scandals involving drinking & sex, racism, old equipment, and always short of funds to properly do its job.Several agents drank into the early morning hours of Nov. 22, 1963, buildings went unchecked, & JFK was murdered. Protocol was not followed, & George Wallace was shot. Nixon used the Service for political gain, ordered evidence of the shooting to be planted to show Democrats were responsible, and had them install the recorder in the Oval Office that led to his downfall from Watergate. Crowds were allowed too close leading to 2 attempts on Ford's life. A decision to forego bullet proof vests ended in Reagan's near death.Agents loved Bush41, esp Barbara who treated them like sons, fed them, invited them to BarBQs, so when Clinton elected, enthusiasm waned. They covered for his sex indiscretions. His morning jogs often ended up with a woman in a room at the YMCA.Lewinsky hung around the Oval Office flirting and was reassigned to the Pentagon. A despondent man crashed a plane on the WH lawn proving agents not prepared for an air attack. Another hater shot at the WH 11 times before tackled by civilians. Most agents disliked Hillary intensely, she afraid they would tell family secrets.With 9/11, Bush 43 was kept in a known air position for 30 minutes. VP Cheney could not get into a locked bunker and would have been killed had a plane crashed into the WH.A man in a car shot at the WH and hit the 2nd floor residence 7 times.Not discovered for 4 days after being told by witnesses. Agents had thought it was a gang shooting and stood down.Obama's daughter and mother in law were there sleeping. A sex scandal coverup with prostitutes in Columbia was discovered by the press and reported. A fence jumper in 29 seconds got past 124 agents and double security systems and inside the WH to the steps leading up to the residence area.Protection during the Trump term was extremely chaotic, stressful, exhausting & expensive. A lone woman protester at a rally was literally dragged out after Trump yelled,\"Get 'em the hell outta here.\" No one helped her. He refused to increase needed funds but cost millions. Every trip to Mar a Lago cost $3,2 M w/ 70 agents for each one. He made 26 golf trips out of 30 weekends while his large and protected family made 650 trips out of town.Agent golf carts the first 3 months cost $35 K. Melania's stay in Trump Tower supposedly so son could finish out the school term was secretlya delay to renegotiate a prenuptial agreement to get a bigger settlement if a divorce. Agents had to protect a 58 floor skyscraper and the streets around it, even after she left as the sons stayed costing $26 M. Trump got $6.3 M for agents' rent and utilities at the Tower.Estimates for Trump's travel for his one term cost taxpayers $600 M. If agents not loyal to him he wanted them dismissed, esp if they were fat, and he made fun of them calling one Dumbo the Elephant because he had large ears.He found Camp David boring, so in the summer, he went to his clubs in NJ & VA where he avoided hundreds of thousands of taxes by growing some hay & a few goats. Junior's wife was dating an agent as was daughter Tiffany.Morale among the agents was very low as funds not there to pay them, even for work done during the campaign. Members ranked it one of the most miserable places to work in the federal government. Yet, as Trump manipulated the Service for political ends, many agents supported him. They helped promote the lie that the election was rigged and stolen, attacked peaceful protesters so he could walk to the church and hold the Bible upside down, and did not give Biden the full protection he deserved when elected.This review of book is practically another book. The conclusion reached is that the Secret Service is a flawed agency in need of a better strategy, and desperately in need of the money needed to do its job.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SirThomas46",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 5, 2021",
                "reviewTitle": "Zero Fail is brilliant",
                "reviewText": "Carol Leonnig is a brilliant writer. She is a Pulitzer Prize author. This book outshines anything she has ever done. The Republican that I am most angry at is Abraham Lincoln. Why? Because if he had posted two guards outside his box at the Ford theatre, American history would be so different. 🤔🇺🇸👍",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 11, 2022",
                "reviewTitle": "Dispelling an illusion (for me)",
                "reviewText": "Whenever I thought of the secret service, I thought of an elite- with the most important task in the world. Protecting the powerful people of american policies.The look behind the scenes showed the usual bureacracy, a circle of old men, more luck than skill- it was fascinating.Fascinating, like watching a trainwreck. In a morbid kind of way. The amount of reasearch that had to go with this book is simply amazing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mrs b kenway",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 23, 2021",
                "reviewTitle": "Arrived within a couple of days in perfect condition",
                "reviewText": "Look forward to reading soon, have added to my pile of recent books with a related theme.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 1, 2022",
                "reviewTitle": "Very interesting book",
                "reviewText": "Great book to read.excellent author",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Big Daddy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 12, 2021",
                "reviewTitle": "A frightening expose",
                "reviewText": "This is a great book that reviews in detail the Secret service failures, the politics and the old boys club attitude that has severly hampered its role and function.The details on the Kennedy Assassination is frightening as is the failures during the Obama years and the deleterious affects of the tRUMP administration.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$13.99",
                "sellerName": "Papa Global,LLC ✨📕📗📘✨",
                "sellerRating": "5"
            },
            {
                "price": "$13.99",
                "sellerName": "bookicooki",
                "sellerRating": "4.5"
            },
            {
                "price": "$15.60",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}