{
    "remaining_requests": 433,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/My-Friend-Dahmer-Derf-Backderf/dp/1419702173",
    "body": {
        "name": "My Friend Dahmer",
        "price": "$9.37$9.37",
        "originalPrice": "",
        "rawPrice": 9.37,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/My-Friend-Dahmer-Derf-Backderf/dp/1419702173",
        "soldBy": {
            "sellerID": "A3AM3URTMSBDCO",
            "name": "Clickgoodwill",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A3AM3URTMSBDCO"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51nwvgHf1TL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51nla9 GxDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41BBPhS0S6L.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Derf Backderf",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Derf+Backderf&text=Derf+Backderf&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "Clickgoodwill",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1850,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs",
            "$3.99 delivery Tuesday, February 27.",
            "Or fastest delivery February 21 - 23."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2"
            },
            {
                "name": "True Crime",
                "link": "https://www.amazon.com/true-crime-biographies-memoirs-books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11314"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Abrams ComicArts; Illustrated edition (March 1, 2012)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 224 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1419702173"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1419702174"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 1.05 x 9.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#52,064 in Books (See Top 100 in Books) #20 in Educational & Nonfiction Graphic Novels #140 in Serial Killers True Accounts #274 in Murder & Mayhem True Accounts"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,850 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mr. E",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYGEAJEWHSINPT4X4FJVGIUPVPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO4ZR7CWH7K0M?ASIN=1419702173",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 28, 2012",
                "reviewTitle": "5.0 out of 5 stars The most socially relevant comic book since Spiegelman's \"Maus\"",
                "reviewText": "In \"My Friend Dahmer\" Derf Backderf has created a work that should be required reading for all school counselors, educators, and indeed anyone with an interest in the psychology of alienated outsiders. This is probably the single best work on the early origins of a serial killer that has ever seen print. All the warning signs of troubled youth are presented clearly in a very engrossing manner. The work is tastefully done. The art, while cartoonish, sets a great mood for the story. The horrid excess of Jeff Dahmer's crimes are left unseen, as it should be. What is truly fascinating about people like Dahmer is not the gory details of their violence, but the psychology that unleashes such horrors.Derf really captures the essence of high school of that era. I was an early 80s student, myself, and little had changed by that point. I knew plenty of people much like the ones shown here. As a Dungeons & Dragons nerd, I too was near the bottom of the social ladder, much like Derf and Dahmer were. I can attest to the authenticity of Derf's portrayal of high school life of 30-odd years ago. As I read, I found myself wondering about the whereabouts of marginal characters I knew in my own school, like \"Einerschteiner\", \"Squiddy\" and the infamous \"Onion\". I'm just glad I haven't read about them in the newspapers.Derf himself had a ringside seat to the genesis of notorious serial murderer Jeffrey Dahmer's psychosis as a teen in 1970s small town Ohio. Derf was the leader of a group of self-described \"band nerds\" who associated with Dahmer in a strange blend of hero worship, fascination, pity, and disgust. Derf and his friends based a whole quasi-mythology and much of their banter and social interactions on Dahmer's desperate and bizarre attempts to gain peer acceptance through sick humor. Dahmer seems to have deeply infiltrated almost every aspect of Derf and friends' high school life. One is reminded of Alfred Jarry's creation of his absurdist play, Ubu Roi, based on stories he and his school friends made up about their strange and eccentric physics teacher.Derf generally treats Dahmer as sympathetically as possible, noting how his disturbed behavior and alcoholism, while blatantly obvious to his peers, was overlooked by every single adult in Dahmer's life. Derf even shows how he and his friends egged Dahmer on to ever greater lengths of weirdness and unacceptable behavior, culminating in an unforgettable trip to a local mall where they paid Dahmer $35 to run amok for two hours. Ironically, this episode was the 'last straw' that resulted in their disassociation from him due to discomfort with his ever-worsening freakish persona.I cannot give this any less than five stars, however one area that I think Derf held back on was the central character of Dahmer. I'm not saying he should have showed his killings or grotesque fantasies, I just think Derf consciously or unconsciously tended to dehumanize Dahmer, rendering him more as a caricature of a lunatic than an actual human being. The scenes of Dahmer alone or with his parents do not have this problem, just the scenes of his interactions with others in his peer group. I do understand that Dahmer had this crazed persona he hid behind at school, but I am sure he was a little more articulate than presented here, especially with the members of Derf's \"Dahmer Fan Club\". Clues in the end notes to Derf's book reinforce this, as well as the articulate nature of the interviews with Dahmer that I have seen in documentaries.In the book, Dahmer's dialogue is mainly restricted to loud exclamations of \"THMAAAA!\" and \"BAAAAA!\". (This is a depiction of Dahmer's cruel mockery of a handicapped man who was employed by his mother.) However, in an actual 70s high school year book cartoon done by Derf and included in the text, many quoted \"Dahmerisms\" are included that prove that Dahmer was in fact possessed of an eccentric and somewhat obscure sense of humor, rather than being a non-stop bellowing lunatic. Unfortunately Derf only allows Dahmer to act as a real human in a couple of scenes; notably, one where he manages to maneuver himself and several classmates into a meeting with Vice President Mondale during a trip to Washington DC.Understandably, Derf must have wanted to distance himself from Dahmer as much as possible in the making of this book. He had the unenviable task of telling the story of his boyhood friendship with one of the most horrible serial killers of modern times while at the same time avoiding being tarred with the same brush, so to speak. Derf constantly throws in little anecdotes to emphasize the normalcy of his own life as he recounts the bizarreness of Dahmer's. Perhaps Derf was reluctant to show himself and his friends interacting with Dahmer on any level deeper than a \"bemused observer\" capacity. Certainly, Dahmer was a real weirdo, but it would have been fascinating if Derf had added one or two scenes where Dahmer actually interacted a little with his peers. Undoubtedly there must have been incidents like that, as I doubt someone of Derf's imagination and intellect would have been so thoroughly captivated by a guy whose sole schtick was a loud, ugly impression of a cerebral palsy sufferer.All in all, I cannot recommend this book highly enough. It would have been interesting to see at least one or two of Dahmer's more lucid interactions with classmates, and to find out a bit about how he functioned academically (I understand his IQ was about 145), but these are very small complaints indeed given the general exceptional quality of this book. We may still not know the whole explanation behind the descent into horrific madness of an intelligent, pleasant looking boy with a well-to-do family and a caring father, but Derf's graphic novel does as much or more to explain it as any of the other literature on this all-around tragic subject. Five Stars.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Theboysmama",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5CGU2ZV74CIFEO6P3KETY7QQGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DY1RRX1EFGBY?ASIN=1419702173",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Really cool",
                "reviewText": "It's pretty cool to see inside the mind of how is serial killer was as a child. But to see him in the light of his friends and high school, it's so different. I mean obviously he's a terrible person who did terrible things. But it's weird to always know that serial killers started out at some point as just a child trying to fit in and find their way in life",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott Slemmons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNNA6PWC526R4M5PMM72PZCPX2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27OAPY4NZVCXA?ASIN=1419702173",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2017",
                "reviewTitle": "5.0 out of 5 stars Friends and Killers",
                "reviewText": "So once upon a time, there was this guy named Jeffrey Dahmer. You might’ve heard of him. In 1991, he got caught trying to abduct a guy in Milwaukee, and police found a human head in his refrigerator, along with human remains stored in barrels and various severed body parts scattered around his apartment. He’s one of the most notorious serial killers in history.Back in ’91, there was an editorial cartoonist called Derf Backderf working for a paper in Cleveland. His wife, also a reporter at the paper, calls him, tells him about this serial killer they’ve arrested in Milwaukee, and drops a bomb on him — Backderf graduated from high school with the guy.So Backderf spends a few years wrestling with the fact that he was friends with a future serial killer and eventually sits down, does a ton of research, and creates this graphic novel, “My Friend Dahmer,” a retelling of his interactions as a teenager with this kid who everyone laughed at and no one really understood.Backderf and his circle of friends discovered Dahmer after he’d started impersonating a person with cerebral palsy and throwing fake epileptic fits to get attention. Dahmer was a stone freak, but his antics were amusing in the juvenile way we all enjoy when we’re in high school, and they encouraged him as much as they could, even calling themselves the “Dahmer Fan Club.” Backderf remembers him as a really strange kid, sometimes disturbing, usually harmless, often depressing. He drank heavily in high school — a fact that a number of students were aware of, but that every teacher apparently missed — hiding beer and hard liquor around the school grounds so he’d always be able to sneak out and find something to drink.Ultimately, it’s a really sympathetic portrait of Dahmer. Not to say that it’s entirely Dahmer-positive — Backderf says more than once that Dahmer is a kid he feels tremendous sympathy and empathy for — but that goes away when he crosses the line into murder. But Backderf knew Dahmer as a sad, strange kid with parents struggling through mental health issues and a very nasty divorce. Dahmer wanted attention, like a lot of kids, he was darkly funny, like a lot of kids, and he was conflicted when he realized he was gay, like a lot of kids. Of course, not a lot of kids also realize they’re necrophiliacs and have to struggle with urges to do violence to others. But even then, Backderf recognizes that Dahmer went through a very stressful high school career and kept himself together — admittedly with huge doses of alcohol — until after graduation.Backderf says that he thinks Jeff Dahmer, the disturbed teenager, could have been saved if only the adults in his life had paid closer attention to him and cared enough to get involved. We’ll never know for sure, of course, but that doesn’t do anything to make this book any less fascinating.This is a pretty thick book, and I burned through it as fast as I could, including the section detailing Backderf’s research and notes. Backderf’s writing about Dahmer is captivating and humanizing in all the best ways — this isn’t something that glorifies a serial killer, but instead asks us to look at how the serial killer was created, at Dahmer’s depressingly rotten youth, at all the ways this kid was failed by the grownups who were supposed to be helping him.The setting is also pretty amazing — Revere High School in West Allis, Ohio in the mid- to late-1970s is a great backdrop for all of this to happen. Locked-down schools, zero tolerance, and No Child Left Behind were 20-30 years in the future, and the book is both stereotypically ’70s-ish and simultaneously timeless — we’ve all felt this way about school, we’ve all been freaked out by our adolescent hormones, we’ve all wondered whether we’d survive to get out of school and wondered what happened to the people we used to hang with.This isn’t a horror story, at least not in the traditional sense. If you read it hoping for blood and gore and psycho killer mayhem, you’re going to be very disappointed. If we can call it horror at all, it’s more a matter of the horror of how one person can go from being a pretty normal kid to the kind of lunatic who’d kill 17 people. It’s a heck of a good story, and I think you should read it.",
                "reviewVotes": "104 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sami",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 14, 2023",
                "reviewTitle": "Fabuloso",
                "reviewText": "Es un clásico que uno debe de tener",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 20, 2023",
                "reviewTitle": "Great graphic novel",
                "reviewText": "Good art work from a person who grew up with the man, providing another point of view on such a disturbing topic.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71aAlJ1LCoL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vanessa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 15, 2024",
                "reviewTitle": "Fumetto Top",
                "reviewText": "Libro ben fatto e accurato. Non credevo che fosse così pesante e alto🥰 quindi super soddisfatta",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juliana Soto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 12, 2023",
                "reviewTitle": "Gut",
                "reviewText": "Wir beschrieben, und interessante Handlung",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colin baker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 4, 2023",
                "reviewTitle": "Brilliant",
                "reviewText": "It’s good how they made it into a graphic novel. really enjoyed the artwork.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.59",
                "sellerName": "Devine11llc",
                "sellerRating": "4"
            }
        ]
    }
}