{
    "remaining_requests": 517,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Making-Comics-Storytelling-Secrets-Graphic/dp/0060780940",
    "body": {
        "name": "Making Comics: Storytelling Secrets of Comics, Manga and Graphic Novels",
        "price": "$25.99$25.99$20.73$20.73$25.99",
        "originalPrice": "$28.99",
        "rawPrice": 25.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Making-Comics-Storytelling-Secrets-Graphic/dp/0060780940",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51S5BAoNilL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Fk23eBAHL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Scott McCloud",
            "link": "https://www.amazon.com/Scott-McCloud/e/B000AQ1NPK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by HigherEdBooks5 and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 1493,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 3 hrs 39 mins",
            "FREE delivery February 29 - March 3 on orders shipped by Amazon over $35",
            "Or fastest delivery February 27 - 29",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 13 hrs 9 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "History & Criticism",
                "link": "https://www.amazon.com/History-Criticism-Literature-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10204"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ William Morrow Paperbacks; 1st edition (September 5, 2006)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 264 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0060780940"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0060780944"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 10.1 x 6.7 x 0.7 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#26,331 in Books (See Top 100 in Books) #5 in Comics & Graphic Novel History & Prices #8 in How to Create Comics #12 in Educational & Nonfiction Graphic Novels"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 1,493 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ari Arts",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDY3FHZJMWJ7E6CEURQZNIH5J5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZR4EUXXM1QT3?ASIN=0060780940",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Book Review",
                "reviewText": "Bought this book for my College Art of Comics and was pleasantly surprised. Great content and is very entertaining. Highly Recommended for future comic book creators.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ray Cassavoy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWFIGY2MDL7QY5DF4H4M2GEUCOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM5QAAWS0KKF7?ASIN=0060780940",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Lovely read!",
                "reviewText": "Had to get this for school but the book was super fun! i love how its in a comic form and also talk about on how to make a comic too! Love the break down sections to help out",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ed-Fred",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY3BQR47RKLEL6AZR7CY2I3ZV3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPCR8YQ60LUVW?ASIN=0060780940",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Delivery was fine",
                "reviewText": "It was fine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael D. Sweeney",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMH5LM6SF2OXLH5S22KMW6IRYSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE7WW2BH903KX?ASIN=0060780940",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 3, 2007",
                "reviewTitle": "5.0 out of 5 stars Decent work in an under-served field",
                "reviewText": "This book has two audiences.Many people will have come to this book through Scott's earlier \"Understanding Comics,\" and read it to further their understandings of comic book history and the evolution of the comic-book language. I do not come from that direction and can not offer a review on those grounds.Where I come from is as a long-time scribbler trying to learn how to tell a story in comic-book format. I learned of this book through mention in the blogs of practicing story-board artists, and as I understand it, it is one of a very small number of books to deal in detail with that part of comic book are that is larger than a single panel (Will Eisner's book is one of, perhaps the one, standout.)There are a lot of \"how to draw comics/manga\" books out there. The vast majority of them deal with what is inside the panel. (The vast majority of them, particularly the Americanized Manga ones, tend to be less \"Here's how to draw\" than \"Here's something I drew. Now just draw like that!\")(Ben Edlund drew a marvellous satire of this in a filler strip titled \"How to draw The Tick.\"; \"First draw a sphere. Now draw a horizontal line bisecting the sphere. Now draw The Tick, holding a bisected sphere.\")Scott is dealing with the interaction between the panels. How you break a story into parts, how you organize, how to develop moods and settings, how to pace. I could only wish for more. Perhaps the format is a bit at fault. The illustrations are lovely but too often serve more as a supporting visual for what is basically talking-head commentary. And the commentary, the meat of what he is saying, is crammed into balloons and margins and perhaps ends up being less complete than it could be.In many cases, though, the integration of text and picture is useful and elegant.There are odd surprises in what he chooses to cover with what depth. The treatment of various panel arrangements that work (and don't work) is surprisingly brief (perhaps there wasn't much more to say?) But there is an absolutely wonderful section on drawing facial emotion that is almost long and detailed enough to be a book on its own.Perhaps my greatest quibble with this book is Scott can not quite step away from a larger perspective of the evolution and purpose of sequential art. He ends too many thoughts with \"But who knows what the future will bring?\" How about a few more didactic pronouncements on good storytelling methods, and save the musings on Art with the leading capitalization for his other books.Scott, wisely, spends very little time on tools and perspective, and essentially no time at all on basic anatomy and drawing. However, the pages on drawing backgrounds and character design -- among others -- are great little refresher courses. But you need to know how to draw before you go into this book. You need to look elsewhere for human anatomy -- even elsewhere to find out how to lay out that perspective grid Scott shows off to good effect in several drawings. In fact, that old standby \"How to Draw Comics the Marvel Way\" makes a pretty good companion piece to this book as it give a good basic orientation to comic book page terminology, simple linear perspective, comic-book anatomy, pencilling and inking.All in all, not the best book there could be on figuring out how to go from a script to fifteen pages of little boxes -- but one of the best books you can find that goes into any detail on the subject.And, of course, it is a delight to read. Marvelously illustrated, cleverly scripted -- and one of those books that will send you scurrying to your own drawing pad, eager to try out some of the things he suggests.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Ye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF66FDITAL42DAC5JWQH3LUTWQZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DL55SFVPEJND?ASIN=0060780940",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Good overview and thoughtful perspectives.",
                "reviewText": "Before picking this book up, I have already stumbled in the dark and put out a few self published graphic books. During this blind stumbling, I have managed to get decent enough art skills to try putting together a graphic novel. However, I have no idea where to dip my toes in this vast ocean of story telling through pictures. I have the skills to draw pictures, but yet still very green in terms of how to organize a page, different techniques, and how to make a story flow in pictures. This book opened my eyes to a lot of different ideas and save my “toes” from having to stumble blindly like I have historically done. Scott McCloud has a vast library of knowledge in comics, mangas, and graphic novels; and he imparts his knowledge so eloquently in this book. The best part is that this book is in the form of a comic, and you know what they say, a picture is worth a thousand words, so any concept that are in the book can be easily grasp through illustration. I highly recommend reading it, for those of us who are aspiring to elevate our art.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dale Kettley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOG5B6G6UEW5UXRVMSR3HRN4FGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP1N1YFHHGNY2?ASIN=0060780940",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2023",
                "reviewTitle": "4.0 out of 5 stars As advertised",
                "reviewText": "Product was exactly as described and prompt delivery",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jake",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOBMUDNUK7S7KTNVHCFOOPBNI6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RY9N2RJ24A8M?ASIN=0060780940",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 5, 2021",
                "reviewTitle": "5.0 out of 5 stars Wonderfully Entertaining for an Educational Book",
                "reviewText": "This book is fantastic so far. I have been wanting for a long time to get into writing a graphic novel or a web comic, but never knew where to start. I also have a hard time sitting down and reading informative articles, posts, or other books.McCloud's book is fantastic if you're like me; the entire \"book\" is written as a comic book, and is also very entertaining. He goes through the various pieces of writing comics, including panel choice, transition choice, character design, word choice, etc. And in quite a bit of detail at that.Since the entire book is illustrated, there are a variety of actual EXAMPLES of the things he is talking about, as well as references from other comic and manga artists to show how they might accomplish thing A or thing B. Not to mention his own illustrations that he creates for specific examples are hilarious at times.Every chapter has a large section going into more details about specific pages and panels throughout the chapter, adding additional detail where it is needed and any clarification you might have wanted on a specific topic. Additionally, there are exercises he provides that are all helpful to reinforce the chapter topic, getting you into actually practicing writing comics.I haven't finished going through the whole book yet, have barely finished the second chapter, but I absolutely love it. It seems like an invaluable resource to anyone wanting to get into writing their own comics. I will be investing in his other two books as well once I finish going through this one!",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg A. Marshall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAIO7OANJFTLEDPLERKIO43FZ3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QRA9WF04JRHG?ASIN=0060780940",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 11, 2023",
                "reviewTitle": "5.0 out of 5 stars McCloud Gives A Masterclass On Creating Comics",
                "reviewText": "This is a substantive tome, and it's not a lightweight read by any stretch. I've read a lot of quote-unquote how-to books that are light on substance and heavy on fluff. This book is for the thinking comics creator. Lots of valuable tricks of the trade as well as the psychology of creating comics from the creative aspect. A thorough, introspective read. Not a quick read, but an informative and truly helpful one. Highly recommended! Five Stars and more!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "elsa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 20, 2023",
                "reviewTitle": "Un libro muy completo",
                "reviewText": "Es un libro muy completo, ya seas principiante o avanzado, te ayuda mejorar tu estilo. Es muy didáctico. Sin duda una herramienta de gran ayuda si te interesa el mundo del cómic, el manga y las novelas gráficas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark A. Davy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 18, 2021",
                "reviewTitle": "Great for people that want to have a better understanding of what goes into making a great story.",
                "reviewText": "I bought this as a gift for someone else. They had seen it in the library before, and had loved it. So for those whom have an interest in comic books and manga, manhua and graphic novels (or tankubon), this is for you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "eliaskafouros",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 8, 2023",
                "reviewTitle": "Simply amazing!",
                "reviewText": "Delightful, philosophical, to the point and so much fun to read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 7, 2023",
                "reviewTitle": "A Follow up of Understand Comics",
                "reviewText": "After reading Understanding Comics, I took another punt and bought Making Comics and again it paid off. I definitely feel like I have learnt so much more than I thought I would. From interesting facts to ways to incorporate certain features of a comic into my own, the book really has blown me away. The series Scott McCloud has produced is definitely a must buy before delving into the world of creating comic books. Like a fool I jumped straight in with no research a except a few comic books I own, instant regret after reading these.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 28, 2023",
                "reviewTitle": "Great book",
                "reviewText": "a lot of depth and study gone into cartoning, excellent book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$20.26",
                "sellerName": "Prime Deals, USA",
                "sellerRating": "4.5"
            },
            {
                "price": "$21.62",
                "sellerName": "indoobestsellers",
                "sellerRating": "4.5"
            },
            {
                "price": "$25.99",
                "sellerName": "Fifty Third Street Books",
                "sellerRating": "5"
            }
        ]
    }
}