{
    "remaining_requests": 664,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Normandy-Graphic-Invasion-Fortress-Histories/dp/0760343926",
    "body": {
        "name": "Normandy: A Graphic History of D-Day, The Allied Invasion of Hitler's Fortress Europe (Zenith Graphic Histories)",
        "price": "$19.99 $16.16",
        "originalPrice": "",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Normandy-Graphic-Invasion-Fortress-Histories/dp/0760343926",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91lwwP0x4QL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Wayne Vansant",
            "link": "https://www.amazon.com/Wayne-Vansant/e/B008BKOA16/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by gatecitybooks and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 249,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 27 mins",
            "FREE delivery February 26 - 28 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 23"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Zenith Press; First Edition (September 15, 2012)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 104 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0760343926"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0760343920"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 13 - 17 years"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN960L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.95 x 0.55 x 9.1 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#102,626 in Books (See Top 100 in Books) #40 in Educational & Nonfiction Graphic Novels #89 in Biographies & History Graphic Novels #918 in World War II History (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 249 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "D. Ryan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKPQSKMJ4EDDUFO22A7GBMRCRAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JRL2IHDYEMM7?ASIN=0760343926",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2013",
                "reviewTitle": "5.0 out of 5 stars An insightful concise book by Vansant",
                "reviewText": "In this NORMANDY 102-page full-color trade, in 15 chapters of 6 to 10 pages each, Vansant covers various chronological aspects of the Normandy invasion, from U.S. entry into the war in Europe, up through planning and execution of \"Operation Overlord\", the final Normandy seige with gliders, paratroopers, air combat and the beach invasions, the liberation of Paris from the Nazis, up through August 1944.Vansant's NORMANDY is remarkably informative for such a concise volume. And its attention to detail in accurately illustrating uniforms, tanks and planes is greatly appreciated.My one complaint is the 6\" by 9\" size of the book. I would have preferred a standard 7\" X 10\" size trade, that is the standard for comic book trade collections. It is a sturdy book with a tight binding, and a slightly larger size would make the book to be less difficult to pry open, and the art easier to appreciate in a larger size. I also wish Vansant had included more panels of maps, detailing the movements of troops at points througout the vast scope of what is described in NORMANDY.Vansant's work is worth seeking out, in its accurate portrayal of various battles throughout history, from the Nazi battles, to the Civil War, to the Pacific War. And as far as I know, Vansant got his start illustrating the Vietnam war in Marvel's THE 'NAM for several years, back in the mid/late 1980's. And two other World War II stories in SAVAGE TALES (1987) issues 7(\"Tiger Tiger\", about a Panzer tank fighting in Russia) and 8 (\"Chindits\", about British jungle fighters in Burma in 1944).Vansant's newer work is slightly rougher than his 80's/90's work, but still very precise and detailed. I'd compare his work to that of Sam Glanzman, Gray Morrow, John Severin and Michael Golden.And it's great to see a comics illustrator drawing war stories that makes an effort to tell a story with more than just a riproaring action story, but one where you walk away with factual information about actual combat. Chapter 14 ,\"The Killing Ground\", hit me especially hard in portraying the bloodbath horrors of war. I wouldn't want to be one of the Nazis in that bombarded field of 10,000 bodies.I previously purchased BATTLE GROUP PEIPER by Vansant(1991) , which despite being in black-and-white and a shorter 32-page historical comic book, was in some ways more interesting to me than NORMANDY, because it followed one Waffen SS commander (Peiper) through the weeks of Battle of the Bulge.(Peiper is breifly mentioned in the NORMANDY book, although \"Battle of the Bulge\" events in BATTLE GROUP PEIPER occur after the events depicted in NORMANDY.)The only other weakness (unlike the 1991 separate 32-page BATTLE GROUP PEIPER story I mentioned above) is that in the scope of the 102-page NORMANDY book it focuses on an overview narrative, rather than spending any length of time on any one soldier or commander, and is therefore less personal than BATTLE GROUP PEIPER is. And is more of an overview synopsis. But still loaded with compelling and informative history.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pvt. W. G. Kirby Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3WT4C2AD4XOBRBYL5523X636YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39PGGJA0JFYO2?ASIN=0760343926",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2013",
                "reviewTitle": "5.0 out of 5 stars The \"comic book\" of my youth grows up.",
                "reviewText": "Hey, you've got to love these new \"Graphic Novels\" of the present day. Way back in the day of he 1950s and 60s, I used to scoop up change wherever it was left laying about( no, not service tips and I didn't steal from my family or friends, but I always saved the change and kept it when it was ok...) I could go to the news stand and for a dime or less, all of the DC comic heroes were mine...and Sgt. Rock, the Haunted Tank, Gunner and Sarge( BUDDA- BUDDA) , were all mine too. Art work was great, stories good to....to a kid and it seem to more than a few adults too. I remember the shock when the costs went to 12 cents...then to 15 cents...then girls and life came along and the comics stayed in boxes in the basement. But the comic book survived. Now they are larger, better printed, perfectly bound with stiffer covers...and a bit more costly..but worth it. And there's a myriad of novels to select from. So I'm collecting comics again, it seems. And the term \" comics\" does not apply any longer, if it did back in the day! No comedy in these stories told now...\"graphic\" is a better description...but not lurid or extreme as the old \" pre- code comics\" were. This graphic novel is the story of the Allied forces and their endeavors from June 5 through early August 1944, the Normandy Campaign. It's in full color and GRAPHIC detail of the carnage faced by the line soldiers of both sides in battle. Historically it's right on the button for dates, locations, quotations, etc. Equipment is shown correctly in version, color and useage. The historical events are explained so that anyone of any age who can read will learn and be entertained. Bach in my day ( here we go again), there was a series on comics of this same nature put out by Dell Publishing on WWII historical events. Detail, color, etc. just as we have in this modern publication, but in a smaller size. The Bataan Death March, Pearl Harbor, John Kennedy and PT-109 , and so on we're a few of those topics..boy, I wish Mom hadn't cleaned out the box I had of those... I even recall the artist who illustrated most of those comics, a Navy destroyer veteran named Sam Glanszman. The illustrators of this book are in the same league as Sam! Don't miss this one. If more military history is to be done in this format, they've got my pocket change !",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joseph J. Truncale",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRLKD4CWAO43F4EEM6RKZM6BPCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UMJCCY5XPK8F?ASIN=0760343926",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2013",
                "reviewTitle": "5.0 out of 5 stars An interesting and detailed graphic novel that tells the story of the Normandy invasion.",
                "reviewText": "One of the most important battles of World War 11 was D-Day. This excellent illustrated graphic novel covers the Normandy invasion in more detail than I expected. The main generals and other important figures are mentioned in this book. The decisions that were made which turned the battle for the Allied forces are explained, as well as Hitler's mistake of not listening to his Generals makes this book a great read. The book is organized into fifteen chapters. They are as follows:Chapter (1) Second Front Now. (2) How peaceful the land looked. (3) Hitting the beaches. (4) Blooding Omaha. (5) The skin of their teeth. ((6) The tigers of Villers-Bocage. (7) Death in the Hedgerows. (8) The devil's children. (9) The capital of ruins. (10) Blood and thunder. (11) The cobra strikes. (12) \"Come and get us!\" (13) Third army rampage. (14) The killing ground. (15) :Aux barricades!\"In conclusion, this beautifully illustrated graphic novel will be of interest to anyone who desires a brief overview of this important World War 11 battle, which was the turning point in the war. It may motivate readers to seek out more detailed information on the Normandy invasion.Rating: 5 Stars. Joseph J. Truncale (Author: Never Trust a Politician: A critical review of politics and politicians)",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnarkyMuzikLover1977",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 7, 2020",
                "reviewTitle": "Wayne Vansant is the best of them all",
                "reviewText": "I Love World War 2 stories whether their based on truth or just made up stories and Wayne Vansant delivers both.I think I have all the Wayne Vansant WWII graphic Novels that I'm aware off and everyone's a winner gaining 5 stars for each as I've never been disappointed yet.Not only is the Artwork great (prefer the Coloured to Black & White), but the speech and what other Graphic Novelists seem to forget or not add is Information or a Paragraphs of writing going with each picture (not entirely sure what the exact word for it is) ... Battle Of The Bulge and Normandy are 2 of my faves and the 3 books of Waffen SS are pretty good too. Think I have around 10 or more by Wayne as I have other stories by other Graphic Novelists on WW2 but they lack the info paragraphs that Wayne DOES NOT. I even noticed silly things like an odd picture here and there where a soldier might have a cigarette lit....well done Wayne (yes people soldiers on all sides smoked so let it be shown) to be fair I've always loved the Commando Picture Comic Books compared to Battle Comics because like Wayne, Commando Comics (and Valiant war comics) included Paragraphs as well as just speech....Thumbs Up Wayne looking forward to more WW2. Love to See Battle Of Britain or even Dunkirk (starting at Belgium of course) as I'd know Wayne Would do these stories better than the others.These books especially Normany and Battle of the Bulge should be in schools for kids to learn more as these are done Brilliantly.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SLS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 16, 2019",
                "reviewTitle": "Reluctant readers",
                "reviewText": "I bought this for a ww2 mad reluctant readerBecause it’s more pictures less words, he’s happy to engage in it where he’s really not keen to read books with just writingHe’s 11 so it’s not too childish - really pleased with it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Matthew C. Wolski",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 22, 2015",
                "reviewTitle": "Excellent book",
                "reviewText": "Really really good book. Lovely iillustrations and covers all the main facts of the battle as fought by British, Canadian, American, Polish, French and German perspectives. Doesn't dumb down the history.Its not a comic book but a lot of text supplemented by some decent art work. Great for the kids if they want to learn history but good for adults too.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erik",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 18, 2020",
                "reviewTitle": "Wrongly cutted pages",
                "reviewText": "I am disapointed to get this beautiful comics book with wrongly cutted first 54 pages.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MRS B MARTIN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 8, 2015",
                "reviewTitle": "Five Stars",
                "reviewText": "A xmas present which was well receeived",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$12.97",
                "sellerName": "beethovens_books",
                "sellerRating": "5"
            },
            {
                "price": "$13.73",
                "sellerName": "indoobestsellers",
                "sellerRating": "4.5"
            },
            {
                "price": "$14.66",
                "sellerName": "A Plus Textbooks",
                "sellerRating": "5"
            }
        ]
    }
}