{
    "remaining_requests": 431,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Farm-City-Education-Urban-Farmer/dp/0143117289",
    "body": {
        "name": "Farm City: The Education of an Urban Farmer",
        "price": "$17.90$17.90",
        "originalPrice": "",
        "rawPrice": 17.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Farm-City-Education-Urban-Farmer/dp/0143117289",
        "soldBy": {
            "sellerID": "AN5KEDQK14C7D",
            "name": "MoonAndLight",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AN5KEDQK14C7D&asin=0143117289&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/A1gah6bTfKL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Novella Carpenter",
            "link": "https://www.amazon.com/Novella-Carpenter/e/B001K8J69C/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Shakespeare Book House",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 415,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 10 hrs 59 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 6 hrs 29 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9"
            },
            {
                "name": "Americas",
                "link": "https://www.amazon.com/Americas-History-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4808"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Books; 1st edition (May 25, 2010)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 288 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0143117289"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0143117285"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.48 x 0.64 x 8.4 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#221,159 in Books (See Top 100 in Books) #215 in Animal Husbandry (Books) #2,572 in Women's Biographies #7,005 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 415 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Christine Lee Zilka",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH45QET5KRNFIAYCBTXHMBZ7NZMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVPD3HC8QZQZD?ASIN=0143117289",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 5, 2009",
                "reviewTitle": "5.0 out of 5 stars Amazing read",
                "reviewText": "Farm City is an awesome read, written by Novella Carpenter, whose book I rank up with Bill Buford's wonderful Heat, with the spirit of Michael Pollan's Omnivore's Dilemma. And I love the voice-Novella the narrator often wonders why people open up to her and accept her so readily (among others, Chris Lee of Eccolo, who teaches her how to prepare pork from her pigs); the voice of the narrator (straightforward, funny, unblinking to the point of childlike wonder, compassionate) is hers, and as a reader I found myself liking her so very much.I mean, she describes her community in the ghetto with compassion and humor (describing the \"tumbleweeds\" as \"tumbleweaves\").I've been meaning to buy the book at one of our local stores, at one of Novella's book tour readings, but my availability did not intersect with her schedule. And so I ordered the book off Amazon-but for as long as I waited to buy her tome, I wasted no time in cracking it open and settling in for what turned out to be an absorbing, delightful, educational reading of a book that drips with optimism and moxie in a world that has in recent months, gone dark and brooding.Novella has a farm. She has a farm on an abandoned lot in a part of Oakland nicknamed \"Ghost Town,\" near the freeway and BART tracks. I've visited her farm and was astonished on my first visit to discover an oasis in a part of town that is not a destination site for many-most people drive past it on the freeway, ride past it on BART, there are very few grocery stores, and abandoned lots are many. Like the Valley of Ashes in F. Scott Fitzgerald's The Great Gatsby. But on her street corner, behind a chain link fence, is a lot full of green vegetables and myriad fruits, with a quiet symphony of animal noises.The farm is serious work, with its share of tragedy: some of her birds die at the mercy of wild neighborhood dogs. Because the abandoned lot on which she squats and plants the garden is purposely unlocked, sometimes others come by and harvest things without permission. (This, she takes in stride-it's not \"her\" land and she willingly shares the harvest). A farm, rural or urban, is not a perfect fairytale. Nature is unpredictable-but rewarding and complex, too.When Novella's animals are slaughtered (by her or, rarely, by a third party), it is not a heartless act but a very complex one; sad, respectful, awful, spiritual, and ultimately, pragmatic.When she buys pigs at auction, unsure of what \"Barrow\" or \"Gilt\" might mean, she asks a boy, \"Does G mean `girl'?\" The way she describes the boy's reaction, \"He looked at me as if he might fall over from the sheer power of my enormous idiocy. Then he nodded, so stunned by my stupidity he couldn't speak,\" is so full of humility and frank humor that I was bowled over as a reader. I laughed out loud. (lol to you). Most writers in the foodie/food realm are so pompous and full of themselves, that I was truly delighted and charmed by Novella here.I'm always interested in novel structure, and I took a quick look at how Novella structured Farm City: Rabbit, Turkey, Pig. (Those who read her blog know she has added goats to her farm in recent years).The book is written, more or less, chronologically-because Novella really did start with rabbits, moving on to turkeys, and then pigs. But I still found the livestock-centric structure interesting and effective because yes, to a farmer life and time revolves around the livestock at hand.The book is on Oprah's list of 25 books to read this summer, and deservedly so.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAYDQ5MWSG7LHLFKQVYEFK2TXUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZQIYT9OPCTTB?ASIN=0143117289",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2016",
                "reviewTitle": "4.0 out of 5 stars Not your average day English book",
                "reviewText": "Farm City was assigned to me as a book that I had read in my college English 100 class and let me tell you one thing, this book is not your average enlish book such as Hamlet or the Scarlett Letter. This book was refreshing and unique in so many ways, Who knew that the story of an Urban Farmer could be so interesting? Novella's narration of her road to being the Urban Farmer of Ghost town shows that dedication is key because does not mention this but during the time that Novella was being an Urban Farmer she was also a student at UC Berkely. Juggling a garden and school is not an easy feat so Miss Carpenter has my respect. The book overall is an easy read that could probably be read in one sitting if one has the dedication to do so. It's better to take your time with this book there is moments that will have you take a double take or make you stare in horror at what you had just read. R.I.P to all the animals lost in the making of this book, there will be brutal murders of animals in this book. But don't let that stop you from enjoying the overall narration of Novella Carpenter.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mystic Manifesting",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLZOVLICKMMHZ6JVWIBV25KLDRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5J2VCUEBXHJP?ASIN=0143117289",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2009",
                "reviewTitle": "5.0 out of 5 stars An entertaining adventure in raising livestock in the inner city",
                "reviewText": "This book tells two stories: Novella Carpenter's education in urban farming and what it's like living in an Oakland ghetto. The gardening focus is on raising animals, not vegetable gardening.Carpenter and her boyfriend Bill move from Seattle to California and rent an apartment in the Oakland inner city amongst the homeless, the eccentric, the drug addicts, the poor. They choose their location because it is next to an abandoned lot they intend to turn into an urban garden.The story opens with the arrival of some baby chickens, geese and ducks and ends with Carpenter receiving expert instruction by a local chef on the making of salumi from a pig she raised. On this journey Carpenter writes about acquiring bees, harvesting honey, caring for rabbits, turkey temperament, and killing these animals for dinner. We share the sadness over the senseless loss of lifestock from marauding dogs, the threatened loss of her garden to development, and the ultimate betrayal by a lousy butcher.The characters that inhabit her neighborhood are fascinating and varied, and we come to enjoy the ghetto culture that sometimes threatens but demands compassion and courage from her as she ventures into this milieu in search of food for her charges.Carpenter's passion for more escalates to her acquisition of two pigs. She and her boyfriend find themselves exhausted after nightly raids of restaurant and grocery store dumpsters, and her neighbors aren't too keen on the stench. But the payoff is exceptionally rewarding as she and her friends celebrate in feast the exquisite taste of the lives that were in her care.This is a great book for all those frustrated city dwellers (like me) who dream of making their own salumi, eating fresh eggs or having fresh turkey raised with compassion for Thanksgiving. It is also eye opening on how much work and dedication it takes to be an urban farmer of livestock.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Egirl1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQEUNNTMOYM3RRKYRUYSIKTXXUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VC3IDEUN4JL3?ASIN=0143117289",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Great read,",
                "reviewText": "I loved the book. Didn’t want to put it down. Carpenter I s a great storyteller, even the parts you really don’t want to face.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RL",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 24, 2023",
                "reviewTitle": "super!!",
                "reviewText": "bon rapport qualité prix pour livre fabuleux ! je le recommande vivement",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R de Bulat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 6, 2014",
                "reviewTitle": "a good and thought provoking book to read",
                "reviewText": "Overall, this is an enjoyable book; it is modish, in that more and more people living in cities want to connect in some way with more natural surroundings, but it is not a manual for the gardener or urban farmer. Instead, it is an account of someone who, raised in the countryside, wishes to make sense of and give value to, inner city living, escaping some of its harsher realities and achieve something that is, hopefully, life enhancing. Novella Carpenter's account is a struggle, not only to juggle a work / life balance, but one that encompasses growing food in what is a near hostile environment. She uses a seemingly abandoned lot next to her apartment and introduces to her appropriated garden plants and wildlife including bees, fowl, rabbits and latterly, a pair of heritage pigs, Clearing and planting, attempting to live exclusively from what she can produce, learning to kill and coping with the consequences of this most unnatural of acts - at least for the city dweller, are the subjects for this book that she describes with humanity and a degree of humour and a little despair, at times. Fattening her pigs, scrounging dumpsters for suitable waste to feed them, learning to make salumi - Italian fermented and preserved sausages and salamis - the joy of their produce, tempered somewhat by their slaughter and the whole meaning of producing food for subsistence is the summation of the book and what makes it so enjoyable to read. There is not a great deal for vegetarians, here, but it is, at least, honest in confronting what it actually means to eat meat that acknowledges a debt owed to the animals whose deaths are not taken lightly and might make you think the next time you pick up a vacuum pack from the supermarket meat counter.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ltaylor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 27, 2011",
                "reviewTitle": "Hilariously insightful",
                "reviewText": "I bought this book as part of a sustainable food program and loved it. Novella Carpenter is a down home girl who writes in a get down and get dirty manner. Hilarious in some instances and strikingly realistic in others. If you are interested in the backyard chicken, you had better realize what happens after they stop laying (which is in 12 - 14 months at most) and be ready to deal with it. Novella has been incredibly resourceful-more than most would be in her position but she neither trivializes the problems nor overly glorifies the successes-they are just simply the end result she was looking for.I can't imagine that most people would take the steps she took to start her flock of chickens, tend to her pig, or 'meet' her neighbourhood restauranteur and baker but her activities will make you try to clearly envision her quandries...you'll feel like you know her when you're done.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff Muir",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 17, 2020",
                "reviewTitle": "Fantastic - deeply inspiring",
                "reviewText": "I love this book. There are no punches pulled and no sugar coating but it is deeply inspiring none the less.Mini setbacks and failures are part and parcel of growing food and Novella discusses these alongside the triumphs. A great book. Well worth the price. Please write more!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole Holloway",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 9, 2020",
                "reviewTitle": "Great read, funny and unique!",
                "reviewText": "Excellent book. I love books about farming and homesteading, and it was a wonderful change of pace to see the story told in such a different setting. The cast of characters added so much to the story. The best part though was the proof that the food crisis can be solved without monoculture crops and industrialization. Low income and those most at risk can benefit from urban farms.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$18.00",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}