{
    "remaining_requests": 628,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Passage-India-M-Foster-ebook/dp/B09ZV7SJ6Y",
    "body": {
        "name": "A Passage to India",
        "price": "$0.49",
        "originalPrice": "",
        "rawPrice": 0.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Passage-India-M-Foster-ebook/dp/B09ZV7SJ6Y",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Uv++3gx0L._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "E. M. Foster",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_ebooks_1?ie=UTF8&field-author=E.+M.+Foster&text=E.+M.+Foster&sort=relevancerank&search-alias=digital-text"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 4069,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Religion & Spirituality",
                "link": "https://www.amazon.com/Religion-Spirituality-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158280011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09ZV7SJ6Y"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Grapevine (May 9, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 9, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2434 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 340 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#51,456 in Kindle Store (See Top 100 in Kindle Store) #4 in Christian Ethics (Kindle Store) #6 in Christian History #24 in Ethics in Christian Theology"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 4,069 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Gary Severance",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3VSKH5TIZVKXMWNJTRRENRWEJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MJLSPSAZVEY4?ASIN=B09ZV7SJ6Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 10, 2014",
                "reviewTitle": "5.0 out of 5 stars Rites of Passage",
                "reviewText": "E. M Forster was born in England in 1879 and died in 1970. As a child, he inherited enough money from his great aunt to travel and live as a writer after attending public school and King's College, Cambridge. His interest in writing was influenced at Cambridge by membership in a discussion society called the Apostles that included a number of intellectuals such as John Maynard Keynes and Ludwig Wittgenstein. Forster maintained a loose association with the group during the early 1910s and 1920s as it added members and became known as the Bloomsbury Group. The Group was composed of a variety of creative individuals including writers of fiction. Virginia Woolf was an active member. After leaving Cambridge, Forster traveled with his mother extensively in Europe where he developed ideas for subsequent novels including: A Room With A View , Where Angels Fear to Tread , and Howards End . For years, he maintained a privacy regarding his homosexual identity and behavior understanding that it would limit his freedom to publish his work.In the early 1920s, Forster worked in India as the private secretary for a Maharaja during the period of the British Raj. The Raj was a time of occupation of India by British diplomats and soldiers who imposed some controlled structure on the economic and legal system of the largely disparate states within the country ruled loosely by a monarchy. After returning to London from India, Forster published A Passage to India in 1924 based on his experiences during the period when British influence was waning and an Indian Independence movement was developing.The novel is an interesting character study involving structure opposed to substance, self-control over impulse, conformity versus individual freedom, restriction of thought rather than tolerance, and arbitrary racial discrimination limiting open enculturation. There are several characters described in stereotypical ways with representatives of the British ruling and middle classes in the Raj and Hindu, \"Moslem\", and royal leaders within Indian society. These descriptions set the stage for the interaction of four main characters that illustrate the complexity of two cultures seemingly unyielding in their Western versus Eastern world views.In the novel the reader's attention is focused on the interactions and perceptions of four main characters: Dr. Aziz, Miss Adela Quested, Cyril Fielding, and Mrs. Moore:Dr. Aziz is an Indian physician who works at a British hospital. He is a Muslim man strongly influenced by his religion but intellectually active in his beliefs and impulsive in his emotions and actions. He is tolerant of differences in cultures within his country and the strained relationship between Indians and the British. The tolerance, however is largely on the surface, and when his religious beliefs and secular freedom are threatened by the actions of the Raj, he is quick to feel strong resentment.Adela Quested is a young British teacher who has traveled to India to see if she and a British magistrate are compatible for marriage. Like Dr. Aziz, Adela seems outwardly open to new experiences. She seems to be tolerant in learning about the exotic Eastern culture of India. The reader sees that she is actually intolerant and frightened but fancies herself an enlightened woman willing to step beyond the conventions of her British character. Adela regresses to her British comfort zone in a panic when confronted with the mysterious and unstructured life of India.Cyril Fielding is a teacher at a small British college for Indian citizens. Now in his early middle age, the unmarried administrator has maintained his life of personal intellectual and emotional freedom by keeping a low profile within the British foreign service system and maintaining an open attitude about British and Indian tension during the Raj. He seems to be more willing to understand the cultural differences between West and East than Adela because he has maintained a personal code of ethics largely hidden from both the British and Indian people in the rural district. He is a clever individual who has assumed a role that conforms minimally to the expectations of each culture. He is insightful and aware that his surface behavior is accepted with reservations by both groups and is content to have independence in the deep structure of his personality. Although Fielding is not an avowed homosexual, the reader gains some interesting indications from the character of Forster's private life. Unlike the author, Fielding returns to England, marries a very British woman, and returns to India a more structured man but largely conflicted in his hidden personal identification.Mrs. Moore is an elderly British widower who has accompanied Adela during the trip from England to India. She is the mother of the British magistrate that the younger woman has come to visit. Mrs. Moore is a lifelong British subject who has reached the endpoint of caring, having lived her life for her children with a feminine stiff upper lip. In somewhat delicate health, the trip has been a major sacrifice for Mrs. Moore, but she has done her escort duty. Because of her end of life situation and active life review, she is open to the spiritual aspect of Indian life that is so different from her British structured religious beliefs. Unlike Adela, Mrs. Moore is willing to open herself to Eastern thoughts and beliefs with a substantial lowering of psychological defenses. She seeks answers to the question, what is the meaning of her life of service to her family that cost her own freedom and dignity? Specifically, when can she stop taking responsibility for others and come to some meaningful resolution of the doubts about her life decisions? When faced with negative conclusions during her life review, she embraces a delusion of a tolerable, structured life and begins a journey back to her British home.I highly recommend this novel (Forster's last published work of fiction) for readers who want to examine their own depth of understanding of life and their tolerance of the lives of others in chaotic times. An interesting experience I had reading the novel was an illusive desire to live during the early decades of the 20th Century in India to see how I would react personally to a rapidly changing world perspective. Of course, parallel, dramatic cultural challenges exist in the U. S. today, but perhaps we are too close in time to the effects of the challenges to develop the comprehensive point of view presented in A Passage to India.",
                "reviewVotes": "50 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "georgette haydu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGN5VCLJ3B4CYIWA4R2HROHFYGTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DRWYMI5M2742?ASIN=B09ZV7SJ6Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "4.0 out of 5 stars View of colonialism",
                "reviewText": "Very nice study of the complexities involved in the occupation of India by the British. The inner workings of the Muslim mind take the reader through the complexities of culture vs. friendship in the character of Dr. Aziz.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ben G Raimer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5254ZAXQADC3VS5FVWIGRBVFOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35FYWCJ1OP0IS?ASIN=B09ZV7SJ6Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Forster never disappoints.",
                "reviewText": "This classic tale of the cast and class struggles and particularly the conflict between Anglo Indian, British, and the different Indian religions themselves is viewed from a authentic and historically accurate view of in foresters novel. The characters are well developed and truly typical of those that are recounted in history of pre-1950 India as it struggles for independence in spite of the ability to bring native Indians into common goals due to centuries of class and religious differences among themselves.The picture of the elite British tiling class and their lack of understanding of Indian’s people, prejudice and caste are accurate. I lived in India in the 1970s and the roots of that separatism were still prevalent.Really excellent book that deserves the international praise it has received.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nathan Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLPOCPIS6VEXICX5A4VGVXFK7BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25VAICNLPRG2O?ASIN=B09ZV7SJ6Y",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2021",
                "reviewTitle": "3.0 out of 5 stars What happens in India...",
                "reviewText": "I am no literary critic so this is just my opinion.I read this book after being disappointed with \"A Room With a View\" (which was rec'd by a friend.) Forster doesn't seem to like any of his characters in \"Room.\" It was difficult at times. The book was interesting in spite of that so I decided to read \"Passage\" which I guess is considered his masterpiece.\"Passage\" is much better in my opinion. I enjoyed this book. The story is sometimes touching, sometimes funny, sometimes tragic, sometimes fascinating. Very memorable. I enjoyed the look at the \"British Invasion\" of Indian culture. I found the term \"Anglo-Indian\" interesting. I guess this term pre-dates the common term \"African-American.\"The story, for me, fell off a bit in the end. After such a great buildup it is a hard pay-off. In many ways this book reminded my of \"Huckleberry Finn.\" There is a clash of cultures and a young man (though much older in \"Passage\") trying to make his way. He is very sympathetic even though he doesn't always do the right thing.The writing here was enjoyable. Good flow in my opinion. The characters were well-drawn. I liked this book a lot even though I probably don't agree with a lot of what Forster has to say about life. I can appreciate his views on the problems of the British occupation of India though, problems which underlie the conflict in this book but are not dealt with head-on (which is again similar to \"Huckleberry\"). I can also appreciate and sympathize with him and his characters regarding the human experience - the sadness, the hopes and joys dashed, the little bright spots, the people that come and go - even though I may fundamentally disagree with him in is ultimate conclusions.I read a hard copy edition of this book published by Everyman's Library. Like all books in this series it is sturdy, well-bound, with quality layout, paper, and font.I don't regret buying/reading this book at all and will probably end up reading Howard's End and maybe even Maurice. (I am always skeptical of books that get published after the author dies, like maybe he/she didn't really want to publish it.)",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "caroline johnson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 4, 2024",
                "reviewTitle": "Passage to India",
                "reviewText": "As described, arrived on time",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bikash Chakrabarty",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 2, 2023",
                "reviewTitle": "Woww",
                "reviewText": "Masterpiece",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elena",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on July 31, 2023",
                "reviewTitle": "Perfette condizioni",
                "reviewText": "Consegna puntuale e libro in perfette condizioni.Ora leggerò.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elisabeth Hewson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 21, 2021",
                "reviewTitle": "A brilliant time travel into colonial India",
                "reviewText": "Nothing is only bad or only good. Like the English in India. Colonial arrogance and misunderstanding of other cultures that do often more bad than good although meant well, brilliantly interwoven in a psychological plausibel plot.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Y. P. Cruz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 27, 2021",
                "reviewTitle": "Lovely",
                "reviewText": "EM Forster writes beauty, love, thought, doubt, sadness, friendship, wisdom... He writes them, with words he makes them, he writes humanity itself, he is like a writing god... ,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}