{
    "remaining_requests": 585,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Maus-Survivors-Father-History-Troubles/dp/0679748407",
    "body": {
        "name": "Maus I & II Paperback Box Set",
        "price": "$15.82$15.82",
        "originalPrice": "",
        "rawPrice": 15.82,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Maus-Survivors-Father-History-Troubles/dp/0679748407",
        "soldBy": {
            "sellerID": "A3C7JXQNNZPQG3",
            "name": "Olivia-Products",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A3C7JXQNNZPQG3&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91fTooRs3VL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Art Spiegelman",
            "link": "https://www.amazon.com/Art-Spiegelman/e/B000APXXEK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Olivia-Products",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 11544,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 17 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Books/b?ie=UTF8&node=9"
            },
            {
                "name": "World",
                "link": "https://www.amazon.com/World-History-Books/b?ie=UTF8&node=5035"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 0679748407"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Pantheon; Reprint edition (October 19, 1993)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 2 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9780679748403"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0679748403"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.09 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.81 x 1.04 x 9.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,095 in Books (See Top 100 in Books) #3 in Biographies & History Graphic Novels #8 in Jewish Holocaust History #172 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 11,544 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e17f4448-aad9-432f-98d2-f3f759a21e68.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "K. Reisdorf",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQNZ324GIVPOPW7ODSA623A6FZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSSSBWREFE1TL?ASIN=0679748407",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars it shouldn't be a banned book",
                "reviewText": "My NY's resolution was to read a banned book that I did not already have in my library. I had no interest in a graphic novel or reading any more about the Holocaust, so I randomly chose this book to fulfill my resolution. Wow. I couldn't put it down. A son recording the old country accent was very effective as was the ordeal through his father's personal experience from one generation removed. I didn't see any reason to ban it except the banners' own antisemitism. I was emotionally touched and am grateful that Mr. Spiegelman wrote it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeremy David Stevens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXRPNC45VY5IFRCLG7OQ3UHC7EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYR6KW1HO38CM?ASIN=0679748407",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2020",
                "reviewTitle": "5.0 out of 5 stars A Story of Genocide, Survival, Trauma, and Love",
                "reviewText": "The Complete Maus is a graphic novel that tells two stories, one set in 1930s and 1940s Europe, and the other in roughly present day 1980s America, when and where the book was being written.The first story is one that breaks the fourth wall in that it’s the story of the author, Art Spiegelman, and his father, the elderly Vladek Spiegelman. Art is a cartoonist interviewing his father about what it was like to be a Polish Jew during the buildup to WWII. He tells the story of his (as well as his wife Anja’s) trials and ultimate survival of the war and the Holocaust. As the story progresses, we discover that Vladek has remarried to another survivor named Mala in the years since Anja passed away in 1968. But that relationship is a complicated one (to say the least) as Vladek is a deeply flawed man in his old age. These flaws cause rifts between Art and Vladek as well. This first story zeroes in on these complications between Vladek, Art, and Mala.The second story is a love story between Vladek and Anja as a young couple facing the dangerous and genocidal landscape of WWII Europe. Throughout the late 1930s until the war ended in 1945, the two relied on each other for the strength to survive. Even when things were at their most bleak, while both were imprisoned in Auschwitz, they managed to get messages back-and-forth to each other, and Vladek even managed to get his wife some food here and there. Once the war ended and they both escaped with their lives, Vladek found Anja again back in their hometown and they made a life together, eventually having a son named Art in 1950. The book is full of details about what many Jewish people experienced during the war. Anja came from a wealthy family, and Vladek was a successful business owner himself. But they all started losing their businesses and money as the landscape started to change. Vladek and Anja survived being sent to the ghettos in large part due to Vladek’s determined, clever, resourceful fortitude. They hid in bunkers with dirt and mice. In Auschwitz, Anja nearly died of starvation, and Vladek nearly of typhus. They were both tortured and beaten by Nazis, and Vladek was nearly murdered by Nazis on several occasions. They both lost nearly their entire families to the Nazis, including their first son Richieu, their parents, siblings, cousins and friends.The two stories come together near the end as the timelines merge. That’s when the point is really driven home about how Vladek’s experiences in the war affected his psychology in later years. Although Vladek is a sympathetic character in his youth (smart, clever, resourceful and someone the reader really roots for), he is not depicted that way as an elderly man. This is a big part of the struggle for Art, attempting to reconcile the cheap, stubborn, argumentative (and sometimes racist) elderly man with the man he was in his youth.Vladek wasn’t the only one who suffered as a result of the trauma experienced during the war. Anja had suffered from some sort of affliction that saw her hospitalized before the war, but she committed suicide in 1968. And Art battled the ghost of his dead brother Richieu, whom he had never met. When it seemed that a being sent to a work or death camp was imminent, Anja’s sister thought she could get her kids to safety in the countryside, so Anja and Vladek sent their very young son Richieu with her, hoping he’d have a better chance of surviving. Ultimately when she and the kids were hunted by the Nazis, she killed herself and all the kids to prevent them from suffering a more painful death upon capture. And even though Richieu was dead before Art was ever born, he lived with his dead brother’s ghost ever-present as he grew up in Richieu’s shadow.In the book, people are drawn as animals. For example, Jews are drawn as mice and the Nazis are cats. I don’t know whether it makes the work more or less impressive as a result, but I almost completely forgot that they were mice and cats within a couple of pages. What makes this book great for me is the storytelling, not the metaphor.This is the story of two lovers who survived one of the most terrible times in human history. They relied on each other, and even under the worst of circumstances, they persevered together. And it was also the story of the aftermath, the damage done and the trauma inflicted upon those who did manage to survive and the generations that followed.I’ve never been a big graphic novel fan, but this is a fine piece of work.This book made me think of a poem written by Leonard Cohen poem from his book “Let Us Compare Mythologies” –'Lovers'During the first pogrom theyMet behind the ruins of their homes –Sweet merchants trading: her loveFor a history full of poems.And at the hot ovens theyCunningly managed a briefKiss before the soldier cameTo knock out her golden teeth.And in the furnace itselfAs the flames flamed higher.He tried to kiss her burning breastsAs she burned in the fire.Later he often wondered:Was their barter completed?While men around him plundered.And knew he had been cheated.",
                "reviewVotes": "229 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karissa Eckert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTP676UYEDVCDRACYZMRK7HO5MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TAAZ7DX8C72H?ASIN=0679748407",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 8, 2022",
                "reviewTitle": "5.0 out of 5 stars Amazing graphic novel, so well done!",
                "reviewText": "Series Info/Source: This is the complete Maus graphic novel. I got a copy of this as a Christmas Gift.Thoughts: The dense writing style and heavy lined black and white artwork were a bit intimidating at first but once I got started reading the story I didn’t even notice it or find it hard to read. This story is completely engrossing. Spiegelman does an amazing job of alternating between the past and the present and recounting the intense and sad story of his father living through the Holocaust. What amazed me is he did in a way that was incredibly impactful without ever being too dark.I was completely engrossed in this book from page one. And I quickly grew to love Maus’s father and his family. I was continually surprised how much of Maus’s father’s survival was because of how resourceful his father was. His father is extremely adaptable and takes on every chance he has to learn a new skill, this (along with quite a bit of luck) is the number one thing that leads to him surviving the nightmare of the Holocaust.Is this an uplifting book? Not really, it is more of a cautionary tale. Even though his father survives the Holocaust, the effects continue to echo through his life many years later. The people who survived the events of the Holocaust have to live with the Holocaust forever in their minds and this continues to affect their families generations later. So much thought and skill went into telling this story; it was just incredibly well done.There is some irony to the fact that I asked for this for Christmas and then shortly after it was banned in Texas because of inappropriate content. I don’t know how to tell people this…but the whole Holocaust was inappropriate and it would be really hard to tell an accurate story of what happened without going into some of the violence and death that happened.Is the violence and death presented in an excessive way in this book? Most definitely not. Discussions of the gas chambers and killing of children in the streets of ghettos are addressed matter of factly. Hiding in piles of dead people’s shoes and witnessing the aftermath of a gas chamber are things that really happened. At the time these people were trying to survive one atrocity after another; the atrocities were fact and they are presented as such in this book. People did what they could to keep themselves and their families safe.Should you have your five year old read this? Well do you want to explain the Holocaust to your 5 year old? I might hold off for a bit. We talked about the Holocaust with my son in late elementary/early middle school. He actually checked out this very book from his middle school library and had A LOT of questions for us after he read it. They were excellent questions and we had some very good and thoughtful discussions as a family because of this book. This is a incredibly valuable way to learn about the Holocaust. I think it should be available for everyone in middle school and older to read.My Summary (5/5): Overall I was incredibly impressed with this graphic novel and the amazing job it did blending the past of the Holocaust with the effect it continues to have on people’s day to day lives. I would recommend to middle grade and up readers because the Holocaust is a complicated topic and kids need to be a certain age in order to begin to comprehend cruelty on this scale. Is this book excessively violent or “Inappropriate”? No, not at all. It addresses the topic with excellent candor wrapped into an incredibly engaging story of one man’s survival of these horrific events.",
                "reviewVotes": "57 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYCDJRVYVUDD7OWYQTRCN54AYKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M74FI8ZWFQ1F?ASIN=0679748407",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Surviving a survivor of the Holocaust",
                "reviewText": "Art Spiegelman’s class GN duo tells of his experience trying to document his father’s life before and after Auschwitz. In his wonderful parable for a modern age, surviving his father, and all his quirks and trauma, is a challenge in itself. Vladek and Art’s relationship is fraught with guilt, regret, and pain, but is a story worth reading. This book should be required reading in every high school.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jaime O.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOY455HKCFQZWL6FCUPZUQ3T22Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFFTNXNE6LVAP?ASIN=0679748407",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent book in a format for kids.",
                "reviewText": "We're in Floruda and I have started building a library of banned books for my Granddaughter who. This was an excellent way to explain the holocaust in a kid friendly format.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shawn Bishop",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 1, 2023",
                "reviewTitle": "Great Book",
                "reviewText": "This book is well worth the money. I found it very compelling reading and educational to boot. A full length graphic novel that not only confirms what we thought we knew about the holocaust, but forces you to think about all the people that were affected. Very deserving of the prizes and awards this books has received.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Govind Pilla",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 26, 2024",
                "reviewTitle": "MUST READ Jewish litrature",
                "reviewText": "MUST READ Jewish literature",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "the_dungeoneer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 23, 2024",
                "reviewTitle": "Incredible book",
                "reviewText": "I had been meaning to read this for years, and I'm glad I did. Incredible and raw, the images are so well expressed. The themes are common knowledge, but the way it is depicted is unique and in a way visceral. I recommend this book, it's a page turner and eye-opener.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniele Fanin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 7, 2024",
                "reviewTitle": "Tutto OK",
                "reviewText": "Articolo in linea con la descrizione e consegnato regolarmente.Nulla di negativo da segnalare",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 9, 2023",
                "reviewTitle": "@miss_books_isa",
                "reviewText": "⭐️⭐️⭐️⭐️⭐️📖18/2023📖MausArt Spiegelman⭐️ Art Spiegelman tells the story of his father, Vladek, during the World War II. Vladek and his wife Anja were Jews living in Poland, they suffered violence, hunger, they lost their parents, families, friends, their little boy died, they were sent to Auschwitz where they got separated. They survived, but Anja took her own life years later and Vladek had some traumas his whole life.⭐️ The worst darkness of humanity. The author also talks about negative aspects and actions of his father, his obsession for money during his whole life, some deals he did during the war to survive, etc. I don't really understand why. We could say that people learn from History and that any other war is possible... but humans can't stop the fighting and the suffering... again and again and again.⭐️@miss_books_isa",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}