{
    "remaining_requests": 595,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lets-Talk-About-Teens-Relationships/dp/1984893149",
    "body": {
        "name": "Let's Talk About It: The Teen's Guide to Sex, Relationships, and Being a Human (A Graphic Novel)",
        "price": "$15.99$15.99$4.79$4.79$15.99",
        "originalPrice": "$17.99",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lets-Talk-About-Teens-Relationships/dp/1984893149",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41RYEgP9oXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51CuW2M4bdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41jxGtZKCNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51frkdl6UvL.jpg",
            "https://m.media-amazon.com/images/I/513uvCI-TaL._SX35_SY46.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Erika Moen",
            "link": "https://www.amazon.com/Erika-Moen/e/B00MASFG5O/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by HPB Inc..",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 444,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews From School Library Journal Gr 9 Up-Don't be afraid. Yes, there are drawings of naked bodies in this book (mostly in the \"Body Image\" section), and, yes, readers will learn about some of the ways the human body is wired for pleasure. And the detailed drawings of genitals are not solely in service of explaining how babies are made. But every panel of this book, every anatomical drawing, every conversation over tea or in a tent, is loaded with crucial information about consent, respect, consideration, and boundaries. A magnificently varied cast of characters confess their insecurities to their best friends, siblings, crushes, lovers, and hookups and in return receive reassurance, information, and practical advice. Readers will learn about a laundry list of activities, including sexting, masturbation, gender, and fantasies, along with health issues such as safe sex and a couple of the less pleasant aspects of relationships: jealousy and rejection. Moen and Nolan have been making comics about sex for years-their comic Oh Joy Sex Toy has even been exhibited at the Tate Modern in London. Moen's richly individualistic characters keep the pages turning, despite some fat word balloons-the result of personality-rich dialogue and precision, which is important when it comes to topics like identity and relationships. A palette of browns, pinks, and grays continues the celebration of bodies of all shades and shapes. A sprinkling of profanity (including the odd F-bomb) must be noted as it may affect a school library's ability to shelve it. VERDICT Real talk about relationships and sex.­Paula Willey, Enoch Pratt Free Lib., Baltimoreα(c) Copyright 2011. Library Journals LLC, a wholly owned subsidiary of Media Source, Inc. No redistribution permitted. Review “A refreshingly inclusive read…. offering comprehensive, no-nonsense information on sex and sexuality.” —Publishers Weekly, starred review“Honest, normalizing, and sex positive…. Puts the graphic in the graphic-novel format, in the best and most educational way.” —Kirkus Reviews,starred review“Every panel of this book… is loaded with crucial information about consent, respect, consideration, and boundaries…. Real talk about relationships and sex.”—SLJ“A frank and open minded look at sex, relationships, and self-understanding.” —Booklist About the Author Erika Moen and Matthew Nolan are both full-time, professional cartoonists and comic book creators. They've been married for twelve years and working together for the past eight. They reside in Portland, OR. Together they run a sex education focused webcomic called Oh Joy Sex Toy, which has won an assortment of accolades over the years and was even featured in the Tate museum in London, England. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 18 mins",
            "$3.99 delivery February 23 - 26.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 11 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Is what I'm feeling normal? Is what my body is doing normal? Am I normal? How do I know what are the right choices to make? How do I know how to behave? How do I fix it when I make a mistake? Let's talk about it.Growing up is complicated. How do you find the answers to all the questions you have about yourself, about your identity, and about your body? Let's Talk About It provides a comprehensive, thoughtful, well-researched graphic novel guide to everything you need to know. Covering relationships, friendships, gender, sexuality, anatomy, body image, safe sex, sexting, jealousy, rejection, sex education, and more, Let's Talk About It is the go-to handbook for every teen, and the first in graphic novel form.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Random House Graphic (March 9, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 240 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1984893149"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1984893147"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 14 - 17 years"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL720L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 9 - 12"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.01 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.69 x 0.74 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#46,642 in Books (See Top 100 in Books) #6 in Teen & Young Adult History Comics #202 in Teen & Young Adult Social Issues #1,092 in Graphic Novels (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 444 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a304fd0a-fce8-4d25-b7d1-98f1ab2af1fd.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dffc2f87-8a40-46e4-bf75-5c20411f33f2.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f3d00752-5b48-4546-a078-72bea7343f54.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d91af843-e007-483b-8d11-7567b74b75e4.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Danae",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFW2W4OVBX5T3K445Q7LTJQUZDWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20XHSF8YV5ZI?ASIN=1984893149",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars A must have for young people",
                "reviewText": "Love this book! It’s covers the big topics briefly and gives young people a starting point to learn what’s normal about their bodies/feelings/relationships/sexuality. Heavy emphasis is placed on consent and finding what feels right for you (even if that’s not participating in sex at all). I appreciated the mention of how porn has the potential to be destructive and also being conscientious of where you’re sourcing it and the emphasis that porn is a performance and not reality. This book encourages self exploration without pressure and provides emotional/social/physical safety guidelines for those just learning about their sexuality. The brief chapter on fantasizing/kinks was also very concise and clear. Many popular misconceptions are corrected throughout the book. As a 30 year old, I would have LOVED to have this kind of education and validation as I navigated my tween/teen years. Much of the baggage I’m still working through could have been avoided if I had access to this book. I am thankful resources like this exist for young people today.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thrill Seeker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJHFZTARW7BYTDHE4BZM54GSARQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GF9NCVL82YHE?ASIN=1984893149",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for students AND adults",
                "reviewText": "This book provides a wealth of sex-positive health information. Geared toward teens, but also perfect for adults who may have had sub-standard (or none) sex ed themselves. Emphasizes safety, personal choice, models consent, and is body, gender, and sexual practice inclusive. A must read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSO6YRPPHMPQMBYSTB2XKUQE5HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OQQY4E3ZCIO6?ASIN=1984893149",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "1.0 out of 5 stars Read this before buying this book.",
                "reviewText": "Much of the content in this book is good information, unfortunately there is also some bad content. This book encourages polyamorous and homosexual relationships. It recommends that teens watch as much porn as possible and to have sex with as many partners as possible.If you think that is all great then this book is perfect for your teen/preteen. If you are trying to raise your children with a higher moral fiber, then this book is NOT for you.There is nothing wrong with the material in this book, BUT it is not appropriate for children or teens. It's adult content in cartoon format.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chelsea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWM44M2DDF2JHNLSS6NLS3WSOXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E7RY6ZBCQ39K?ASIN=1984893149",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Age Appropriate",
                "reviewText": "I decided to read this book due to a small group in my community that wants this removed from the teen/young adult section and instead put in the adult section of the library.Out of context, this book sounds like a terrible choice for a teenager however, after having read it, I find that it's completely appropriate book for the age group it's targeting.It covers a wide rage of topics that the average teen might have questions about. It's informative, and written in a style of how teens would talk to each other.This is perfect for a teenager that's too embarrassed to talk to an adult about the subject matter, or worried that their friends will tease them about not knowing certain information.It's also very repetitive on making sure you have consent with your partner should you choose to do anything together. Within each topic covered this comic encourages teens to be happy in their skin, to love themselves how they are, and to treat others the way they'd like to be treated.It's a very inclusive book, with many of the illustrations showing different disabilities such as one being in a wheelchair, another showing misding limbs or prostheses. Sign language is even depicted in one part.The nude images of the bodies and done in an accurate, yet cartoonish way that's tastefully graphic.I liked this comic and feel comfortable having my 15 year old son read this.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXH5D5PKACLJEBHOODCC66UZSVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z44054U25CAR?ASIN=1984893149",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars This book is perfect!",
                "reviewText": "This. Ok was perfect for my tween! I have loaned it out so many times in not sure where it is! I may have to order another copy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Florida Foodie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKZFPDJ6CJYFOYJRJHAVAULRMFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IV43O0NEMZ4Y?ASIN=1984893149",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Grandma APPROVES!",
                "reviewText": "This book has been banned from our Palm Beach County Florida Public Elementary School Libraries. I ordered and read it cover to cover because I was concerned that an educational book on sex with such great reviews and in an appealing graphic novel format was being banned. It is quite explicit, but the artwork (with detailed labels) is informative without being too realistic. It is helpful to know what the correct names of body parts are, as a child or adult. It is difficult to ask questions about body parts if you do not have words for them. There is nothing pornographic (intentionally arousing) about the content. Elementary School seems too young to me, but I believe children have become much more sexually aware and active much younger than when I was a child (b.1945). I am sending this book along to my daughter for her two children (ages 14 and 12) to share with them when she thinks they are ready. It is important for children to know FACTS, not just learn from other children. I can recall my college girlfriends believing that a bottle of Coca-Cola used as an after-sex douche was an effective contraceptive! As well as many other equally incorrect and potentially dangerous ideas about sexual practices.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5HKTFCXULDOABSJYIM52SP6SNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UDRPUD4HW54O?ASIN=1984893149",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Deeply entertained by the negative reviews here -- know what you're getting",
                "reviewText": "This book is a \"Just Say Know\" book not a \"Just Say No\" book. If you're uncomfortable with queer and trans people's existence or frankness about sex and masturbation -- this is not the book for you. However, unless you're magically restricting your teens access to the internet and peers, they are getting info -- lots of it (a lot that is inaccurate.) Personally, I think this book does a great job imparting really important information about relationships, boundaries/consent, desire, and handling rejection. It also has section of porn and sexting because whether or not parents want to think about it, kids are familiar with both.So be forewarned.But I think this is a great book for some difficult and complex subjects that are definitely on young people's minds whether they themselves are actually particularly interested in sex and dating or not.",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 25, 2023",
                "reviewTitle": "Beautiful",
                "reviewText": "This book is beyond brilliant. My heart hurts for those giving this book poor reviews. How much shame they must walk around with.This is the most neutral, body positive, sex positive, realistic, healthy, educational, shame-free book you could wish for.I am so grateful for it, and so proud to be able to give it to my kids.Every human should read it.Beautiful.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 7, 2022",
                "reviewTitle": "A great addition to learning",
                "reviewText": "My son is 10 and has lots of questions. This book is definitely too old for him right now, but he is very good at reading and researching at the level that’s right for him.He knows I have the answers and if he doesn’t want to hear me say it, he now knows that this book covers it for him.It’s in his bedroom, he picks it up and puts it down. Last night he told me that he read a page he didn’t understand. It was about intersex and so we opened the pages and talked about it together. We talked about how one day one of his friends may feel like this. They may even confide in him. He said it would be a hard conversation but now he would be ready and would understand instead of feeling weird or laughing.Then he closed the book and talked about Sonic the hedgehog.This book delivers in a way that he understands and makes things matter of fact. I wish it had existed when I was young. I’m ashamed of how little I understood about people who were ‘different’ to me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 28, 2021",
                "reviewTitle": "Excellent, approachable resource!",
                "reviewText": "I got two copies of this book. One for my teens, and another for a friend's teen. This material is so well done, well presented, the art is great, there's nothing pretentious or preachy about it. Super inclusive, and each rtopics is told through little stories between the characters.I love that it's not just about sex and bodies, too. There's a lot about HOW to navigate the social aspects of relationships, jealousy, and emotions.Now if I could only get my teens to not be TOO embarrased to read it...",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs Venning ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 11, 2022",
                "reviewTitle": "Covers all the ‘in between’ that never gets explained. Fully recommend it.",
                "reviewText": "The ‘sex’ talk is more than just explaining about being safe and The book explains in detail information to my teenager that I couldn’t.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blythe Underys",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 17, 2021",
                "reviewTitle": "One of the best books in a while",
                "reviewText": "This book is amazing. It covers everything in a very progressive way. Thank you for writing this book!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.83",
                "sellerName": "indoobestsellers",
                "sellerRating": "4.5"
            }
        ]
    }
}