{
    "remaining_requests": 543,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Reflections-Revolution-France-Edmund-Burke-ebook/dp/B0BD4MJTLB",
    "body": {
        "name": "Reflections on The Revolution in France",
        "price": "$0.59",
        "originalPrice": "",
        "rawPrice": 0.59,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Reflections-Revolution-France-Edmund-Burke-ebook/dp/B0BD4MJTLB",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71-cPfJ5M6L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Edmund Burke",
            "link": "https://www.amazon.com/Edmund-Burke/e/B001H6GQOK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 569,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Politics & Social Sciences",
                "link": "https://www.amazon.com/Politics-Government-Philosophy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=305951011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BD4MJTLB"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Grapevine India (July 21, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 21, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 793 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#103,956 in Kindle Store (See Top 100 in Kindle Store) #7 in Philosophy Methodology #9 in Good & Evil Philosophy #28 in Philosophy of Good & Evil"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 569 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Geoff Puterbaugh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2JU5HJAIWZMR33EJSPW555CRMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R58MNMN3T7F9?ASIN=B0BD4MJTLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2010",
                "reviewTitle": "5.0 out of 5 stars A classic, & still relevant (!) to our times",
                "reviewText": "I don't think anyone involved in my education ever required me to read this book, which I find one of the most interesting books of the last 500 years.As an example of Burke's thinking, let's turn to the \"natural rights\" of man: \"life, liberty, & the pursuit of happiness.\" The traditional defense of these arguments has been that they derive from God, or from Providence, or from Nature (whatever \"Nature\" with-a-capital-N might turn out to be!)But by now, there is an entirely different, Burkean argument for these rights. I can't put the argument with Burke's eloquence, but he would say that these are **American** rights, declared at the founding of our nation, and since then handed down from generation to generation as a priceless birthright, as the proper inheritance of every American citizen. They don't have to \"derive\" from anywhere except the American political tradition, the American political inheritance, which we should be on constant guard to protect, so that we may hand the same precious birthright on, to our children and grandchildren.Burke's analysis of the French National Assembly is masterful, and also contains lessons for today. What impressed Burke strongly was the devotion of the revolutionaries to abstract ideas, and the fact that they delivered the government of France into the hands of incompetents. Almost 300 of the 600 were petty lawyers, plus some illiterate peasants and a few merchants --- \"and you expect these people to run a government?\" Burke would ask, adding, \"especially after all legitimate power had been destroyed?\" He tellingly notes that NONE of the members of the National Assembly had any experience with government, and so (obviously) they were not up to the task.Compare and contrast this with the current situation in Washington, where almost none of the appointees or czars has any experience with running a business, much less a government. Burke would be saying, with sarcasm, \"Well, what would you expect?\" You cannot govern through mere abstractions such as \"Hope\" and \"Change.\" If you want to deal with the outside world, you need a Secretary of State with some experience in foreign affairs. If you want to help the economy recover from a bad shock, you need some people with experience at doing so. If you want to plug an oil leak, do NOT send out for more professors --- send out for people with experience at plugging oil leaks.Burke points out a huge list of other problems, such as the mob in Paris demanding that ALL bishops be immediately hung from the lampposts, the endless series of murders, assassinations, and \"expropriations\" which led France into chaos, and then the Great Terror. By the time Napoleon swings by to pick up the broken pieces, and begin his own career as a murderer of Europeans by the millions, you may at least find yourself wondering whether Edmund Burke was not right: establishing and running a successful government is not a task for children or for ideologues. An essential factor is respect for what has gone before, and the old American attitude of \"if it ain't broke, don't fix it.\"I recommend this book very highly, and would only caution that it makes for slow reading, because every single sentence is pregnant with thought.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Pappie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYWHJ5VJKQGH7LELOJIFA6Y5MGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J6JNI2MCHYZF?ASIN=B0BD4MJTLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 5, 2017",
                "reviewTitle": "5.0 out of 5 stars Great then Great now",
                "reviewText": "Love Edmund Burke. He was, I believe, one of the greatest writers and statesmen of his time. His command of the English language was superlative. He cannot be surpassed for eloquence. Anyone who has even a cursory interest in the French Revolution cannot ignore his writings. Burke stands like a great and majestic British Oak tree underneath whose strong and spreading branches you can find shade and take rest.Burke was fighting, in reality, proto-communism. He saw with prescient clarity where the Jacobin philosophies would lead. He sounded a clear warning about the dire and destructive consequences that the French Revolution would unleash.He immediately saw that the French Revolution was not at all what it ostensibly claimed to be —Liberty, Equality, Fraternity. It was instead a rebellion; a rebellion against authority-- any authority- all authority- in any form. The heralded “empire of light and reason” would bring forth a dark and dangerous ochlocracy.Of course, if you’re any student of history you will have heard of the debate between Burke and Thomas Paine. Although Paine does well in arguing his case- his points do have weight and merit, he cannot approach Burke in eloquence, beauty of language or power of metaphor.Burke will stand, as he has stood for over two hundred years, as a beacon and light over and against those who have claimed- and continue to claim- that only they know what’s best for mankind.",
                "reviewVotes": "74 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Else Brit Rosli",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLN57UGDQB3H6PXUNMOVI34TF3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7KEQRCLY0GD5?ASIN=B0BD4MJTLB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 16, 2018",
                "reviewTitle": "4.0 out of 5 stars What is most brilliant is that Burke Was clearsighted about the problems the ...",
                "reviewText": "I must reread the book once more to make definit opinion on the different problems the book describes.What is most brilliant is that BurkeWas clearsighted about the problems the revolution created in the making of a New state when the old regime was torn away,The propertyOf the Church,the property of the nobles were taken and the laws of the state had not Been ready for major changes.To make big changesYou must be prepared with a goverment,New laws and the wise action in keeping some of the old traditions to show the people that You haveSome respect for the history of your country like England etc.in the glorious revolution.Burke SAW that sertain groupes of people had no powerAnd This could start a revolution in other countries also.Some authors like Edward Gibbon and Jacob Burchardt (both very famous) did not likeRevolutions either.The Russian revolution was May be more necessary,but made the country ready for Stalin and in France for Napoleon.Was This a good solution?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marc Labonne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL6IJ6COAV4KUYVH4K37AHZTJ5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WPH2YIPMITA?ASIN=B0BD4MJTLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Great",
                "reviewText": "Great",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "joe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOCLKKEZBRCSOHT25XTIKDNTSXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R81X01SCMXL66?ASIN=B0BD4MJTLB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2015",
                "reviewTitle": "5.0 out of 5 stars The first Conservative",
                "reviewText": "Edmund Burke, politician, philosopher and historian, know as the father of conservatism. When the revolution in France broke out with the death of the King and the revolution being led by sidelined liberal radicals, Burke was horrified. In his reflections he shows just that, his horror and critique of where the revolution went wrong. Burke is a classic figure in the late 18th and early 19th century. Although not in opposition to the basic revolutionary principles, he disliked how the revolution was going about bringing in its ideas of liberty and equality, out with the old and in with the new. Burke was more of a gradualist, believing in growth of kingdoms, nations, and politics among other things. To paraphrase Burke’s own words in the book that we must take to heart, what is a tree without its roots?",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Augustin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 19, 2023",
                "reviewTitle": "Very good wisdom",
                "reviewText": "Can be a hard read however it offers a glimpse of what our ancestors wished to both achieve and the dangers of a poor revolution",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vishal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 15, 2019",
                "reviewTitle": "Finely wrought",
                "reviewText": "A scathing polemic against the follies of French revolution written in a most ornate, almost filigreed, style, which has come to be identified as typical Burkean mode of writing. The winding style can be a bit thoroughgoing initially, but once you've got the hang of the tempo you will see why even the most strident critics of Burke would kill to be able to write like him.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cristiano Mestriner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 17, 2013",
                "reviewTitle": "A origem do conservadorismo",
                "reviewText": "Esse livro é fundamental para quem quer entender o surgimento do pensamento intelectual conservador. Burke com uma lucidez magistral desmonta literalmente aquele que talvez seja o maior fetiche da humanidade, a Revolução Francesa. Eu quando jovem era marxista e acreditava no socialismo. O tempo foi passando e eu fui ficando mais moderado até conhecer Burke e Tocqueville. Lendo e relendo esse livro pude notar quão mal formada é nossa intelectualidade, que nos ensina Rousseau, Marx, Bourdier, Foucault, mas nunca leu um gigante como Burke nem cita que existe um autor como ele. Um livro indispensável.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 26, 2017",
                "reviewTitle": "Obra Prima",
                "reviewText": "Grande clássico do conservadorismo, que nas escolas passa batido ou é confundido com mero reacionarismo. A tão idealizada pela esquerda moderna Revolução Francesa, que ascendeu um governo mais autoritário e mais belicoso (Napoleão), é desconstruida pelo brilhante autor.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 17, 2018",
                "reviewTitle": "very beauty",
                "reviewText": "very beauty",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}