{
    "remaining_requests": 548,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Personal-Memoirs-Ulysses-S-Grant-ebook/dp/B0B3XZZQ2Y",
    "body": {
        "name": "Personal Memoirs of Ulysses S. Grant",
        "price": "$0.49",
        "originalPrice": "",
        "rawPrice": 0.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Personal-Memoirs-Ulysses-S-Grant-ebook/dp/B0B3XZZQ2Y",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/8191rQ0SLhL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ulysses S. Grant",
            "link": "https://www.amazon.com/Ulysses-S-Grant/e/B000AQW28W/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 4338,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biography-Memoir-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=154754011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B3XZZQ2Y"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ ASA Books (June 10, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 10, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 14887 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 835 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#37,555 in Kindle Store (See Top 100 in Kindle Store) #8 in Biographies of Journalists #21 in Biographies of Political Leaders #30 in Journalist Biographies"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 4,338 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Edward Francis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKQKATCVXVYEZZ4G67U7RYCGRYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36CLIHYEKAI0T?ASIN=B0B3XZZQ2Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Should be taught in every US History class",
                "reviewText": "I'm going to start with the negative. The descriptions of troop movements can be hard to follow. Grant doesn't talk much about his personal life or his drinking problem. There's typical 19th century century world views when it comes to certain topics and peoples that may be grating to a modern reader. He uses now outdated terms to describe groups of people. The memoir ends at the end of the Civil War so there's nothing about Grant's very interesting later life.Otherwise this is a gem of American literature. It's the best memoir I've ever read. You get everything from Grant's thoughts on bullfighting to the Civil War. When reading this I began to realize how underrated Grant is as a general. In many ways he was the first modern general. He doesn't use these terms but from the text you realize he uses emerging communications, emerging transportation networks, espionage, psychological warfare, army/navy cooperation, and controversially total war. He's also both harsh and kind to the enemy when each one is called for - at the beginning he's demanding unconditional surrender at the end he's lenient so the war ends. But most importantly he of all the union generals realized and executed a coordinated attack with multiple armies attacking in multiple places. When reading the descriptions of the Union army during the later part of the war it feels almost overwhelming with the amount of Union armies moving while the Confederates seem rather static. Granted it's a biased source but it's striking how dynamic the Union forces are once Grant gets control.As for the text itself I was surprised by Grant's tongue in cheek snarkiness in certain occasions. It made me realize why people thought there was a Mark Twain influence (he published the book)But by far the most important part of the book is where Grant deftly describes the causes of the Civil War. There's a part toward the beginning of the book and another towards the end where Grant very clearly and concisely lays out his thoughts on why the war happened- and yes he assets slavery was the root cause. This should taught in every US high school. This isn't some revisionist historian this is from a primary source. A man who was a key player in the some of the most important events in US history and someone who should once again get his due from historians",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sotto voce",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPR3DAGWZHHNZW2LBMTXU3PLSLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DXKRRR9DCN64?ASIN=B0B3XZZQ2Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 10, 2020",
                "reviewTitle": "5.0 out of 5 stars Extraordinary detail. Must read for Civil War clarity",
                "reviewText": "Much has been said lately of the Civil War. Grant's Civil War autobiographical has been on my read list for some years, so it seemed timely to visit the place and time after Grant's statue was toppled recently. I do not doubt that Grant's words are NOT on the reading list of this era's MSM and revisionist historical recollections.The book is written for and was a best-seller among veterans and general readers of both sides. It passed muster with the combatants. Grant's narrative is amplified on Kindle, providing easy search of names and places. In several engagements, the place names have changed since the events, and one wonders if they are not perhaps lost in history.Grant pulls no punches clearing up the matter of what the Civil War was about. It was over the slavery period. Grant, in crystal clarity, describes the reason and rationale of ending slavery at that moment in US history. That was the whole of the Civil War. There was no US future as had been demonstrated in the admission of new states under the dual politics of slave vs free. No other reasons cited to this day approximately approach the force of ending slavery, as told by Grant. Revisionist historians claiming the Civil War was not about slavery at all are ignorant, liars or both. If Grant's word had not rung true when this narrative became a global bestseller, it would have never been a bestseller.Grant is never seen to admire rebel generals as hero's. He knew most of them from West Point and the Mexican War. One by one, Grant correctly judges and anticipates his opponents with unnatural canny and defeats them. Every one of these generals was a traitor in Grant's cold accounting. That Northern MSM of the day championed rebel generals, lied about confederate casualties and bemoaned equally erroneous high Union body counts. The MSM hated Lincoln.Grant has a special place for treasonous Northern journalists. Credentialed Northern journalists are cited by name and given Lincoln's permission to accompany and record Grant and his Hdqtrs most important decisions. They systematically and suddenly disappear, freely moving into Confederate lines to divulge the plans, watch the outcome, report the calamity they stoked to simply disappear back into that media establishment.Grant was thoroughly familiar with the MSM of the times fake news and hoax playbook. The Confederacy never had a chance of victory, yet the media kept that silent. How the MSM narrative could be sold and believed in the North to nearly elect the do-nothing McClellan over Lincoln is a said chapter.The Confederate government was rotten to its core. Confederate civilians were not free; they were looted, impressed male ages of 14 to 60 and the women used as thralls to maintain the hopeless war machine. Confederate state citizens were held in a state of violence as virtual prisoners. There was no Confederate 'Bill of Rights\". Grant takes the reader on that journey to illustrate precisely why.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason Byrne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 10, 2022",
                "reviewTitle": "A hero we owe a lot to.",
                "reviewText": "General Grant is firm but fair in his assessment of his and others' performances during the American Civil War. He always finds a reason to praise someone even when he is critical of them. His career has been pilloried by those who hate the man that saved the Union and has only undergone rehabilitation in recent years. He saved the Union which ended slavery in the US having been considered a failure into his late 30's. His life should serve to inspire others to see that we all have a calling and could change the lives of so many people no matter how low you and others may think of yourself now.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rahul Anil Kumar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 23, 2017",
                "reviewTitle": "MRP is 599, not 699. Got it for ...",
                "reviewText": "MRP is 599, not 699. Got it for 390. I will not attempt to review a book which has achieved universal acclaim as a masterpiece",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter Boettcher",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 23, 2024",
                "reviewTitle": "Personal Memoirs of US Grant.",
                "reviewText": "Purchased the Kindle edition. Have read many various books on the American Civil War and having just read US Grant memoirs, one can appreciate the life that he had in those times.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marc Ranger",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 18, 2016",
                "reviewTitle": "You cannot understand the Civil War fully before having read Personal Memoirs.",
                "reviewText": "I bought this book as a complement to my knowledge of the Civil War. US Grant goes through his military career and every battlefield he was involved in during the Mexican and Civil War. Even if the stories of the battlefield movements are sometimes hard to follow, many operations being done simultaneously and without the benefit of military charts or plans to fully understand them, the reader will learn very fast that US Grant was not only courageous and deternined, he was also a military genious. More so than Robert E Lee who mainly fought defensively in a country he knew well, backed by the population who informed him of all the Union's movements. In fact, almost every offensive action Lee undertook during the War ended in defeat.However, what I enjoyed even more was Grant's political assessment of the Civil War reasons and roots. Those are way clearer than anything you can ever read on the subject. Also, Grant's view about Lincoln, Stanton, and many of his colleagues, be it Union or Confederate, are treasures to read. His frankness about Jefferson Davis, Robert E Lee, James Longstreet, George Meade, Phil Sheridan or William Sherman is astonishing.You cannot understand the Civil War fully if you haven't read Personal Memoirs.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lettore appassionato",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 6, 2015",
                "reviewTitle": "Un generale che odiava la guerra",
                "reviewText": "La visione della Storia che ci offrono i nostri studi e ancora di più il nostro provincialismo ci lascia all'oscuro di eventi importanti e decisivi, solo perché si sono verificati lontano dall'Europa o dall'Italia. La Guerra di Secessione americana, contemporanea della parte più decisiva del nostro Risorgimento, meriterebbe una maggiore attenzione da parte nostra. E' stata la più sanguinosa nella storia degli USA ed ha anticipato per molti versi le strategie e le tecniche di combattimento della I Guerra Mondiale. La figura di U.S. Grant emerge, fra i protagonisti di quel conflitto, come quella di uno stratega acuto, un genio militare e un uomo pragmatico e nello stesso tempo generoso e ironico. La sua autobiografia, scritta in un inglese elegante nella sua piana semplicità, ne mette in risalto le qualità, prima fra tutte la capacità di riconoscere i meriti dei suoi sottoposti (in particolare il generale Sherman) anche a costo di sminuire i propri. Ricca di aneddoti anche divertenti e spesso autoironici, non è mai autoalogiativa. Particolarmente significativo è il disprezzo che dichiara verso i generali che brigavano per ottenere incarichi e la sua ammirazione per quelli che gli incarichi se li meritavano sul campo. Il libro si legge come un romanzo ed è fra i pochi che, terminata la lettura, inducono a desiderare di rileggerli al più presto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}