{
    "remaining_requests": 573,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dynamic-Laws-Prosperity-Catherine-Ponder-ebook/dp/B0B1DHWKD5",
    "body": {
        "name": "The Dynamic Laws of Prosperity",
        "price": "$0.49",
        "originalPrice": "",
        "rawPrice": 0.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dynamic-Laws-Prosperity-Catherine-Ponder-ebook/dp/B0B1DHWKD5",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/51-RCnT3KzL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Catherine Ponder",
            "link": "https://www.amazon.com/Catherine-Ponder/e/B001JS67QI/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1250,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Self-Help",
                "link": "https://www.amazon.com/Self-Help-Transformation-Health-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=156563011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B1DHWKD5"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ GED Books (May 13, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 13, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 583 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 331 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#87,752 in Kindle Store (See Top 100 in Kindle Store) #112 in Self-Esteem Self-Help #264 in Motivational Self-Help (Kindle Store) #313 in Emotional Self Help"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,250 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dr. Joy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW74I56L65XLECTU4G45AYU5KSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R117DDUGPTNMO6?ASIN=B0B1DHWKD5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2011",
                "reviewTitle": "5.0 out of 5 stars Seeking Properity",
                "reviewText": "As a spiritual person, I really seek to read things that are going to help me make the right decisions. As a wife I take into account that the decisions that I make cannot be done in a vacuum. That being said when I first learned of Catherine Ponder's and her work on creating a more centered life around positive thoughts and knowing that you do deserve happiness made me realize that life was more that just the simple decisions that we believe we are making. That a prosperious life is one filled with hard work, sacrifice, and love.In one of the reviews the author writes that there haven't been any real life applications to Ponder's work since she stopped writing and that the stories she referenced in her work have dried up. Some of the negative reviews have also centered on the fact that people feel that her books promote the idea that you just have to believe that you can prosper and not do any work. While this perception may be apparent for some that was not what I gleaned from her writing and others like her. The books helped me to focus on the fact that I control the choices I make (not necessarily the outcomes but how I react), I can change my perception of a situation into the positive, and the optimism helps to get you further than pessimism. That being said, it is up to us to find the inner strength to act and do the work. Just reading a self-help book isn't going to open you up to living and doing the work to have a \"satisfying life\". We have to decide to stand up for the things we believe in, set attainable goals (even when others say no way), and believe that we are deserving of the best.After reading the Dynamic Laws of Prosperity I made the decision to go back to school and work on my PhD. The book helped me to remember that completing the goal of finishing school was possible. That I had to stay focus, do the work, and then remember that God would help me in every decision that I will make. I do hope if you read her work that you keep in mind that it is up to you to put the time in. Yes, if you put the time in and really try then good things may happen.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Jo Shaffer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGESW4K45DFN7QRV5QGIYLXLUQXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RPP2SGGIJ9C5?ASIN=B0B1DHWKD5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2008",
                "reviewTitle": "5.0 out of 5 stars You'll Want to Read This Wonderful Book with a Highlighter, Pen & Paper",
                "reviewText": "If you don't get past the Introduction of this wonderful book, you will still have learned one of the many valuable lessons that it has to offer: \"There's Gold Dust in the Air for You!\" This nugget of wisdom evolves as Catherine Ponder tells the story of a salesman whose standard response to the \"How's business\" question was always \"Business is wonderful because there's gold dust in the air!\" And for him there was. Because he said it was so, each contact resulted in sales and people always remarked of him, \"Everything he touches turns to gold.\"According to Catherine Ponder the basic law of prosperity can be thought of as radiation and attraction: \"that what you radiate outward in your thoughts, feelings, mental pictures and words, you attract into your life and affairs.\" But she goes on to explain that we don't get something for nothing; that we must give before we receive. Further, if you wish to enjoy more prosperity and success in life, you must \"boldly and deliberately take hold of your thoughts and feelings and redirect them toward prosperity and success.\"The tools she gives us to achieve our own prosperity and success are sprinkled liberally throughout the entire book. It is a gold mine of powerful, pointed affirmations and poignant, real life stories that guide inspire and motivate action. Affirmations are a form of command Catherine advises; you make your world with words. \"Through verbally affirming or declaring the good you want, rather than continuing to talk about what you don't want, you begin to make firm in the mind and in the invisible ethers the good you desire. As you continue to affirm the desired good, it rushes forth as a visible result.\" She also suggests writing lists and letters as practical, hands-on means to achieving goals and finding solutions to problems.Here is Catherine Ponder's Three-Step Formula for Prosperity:\"First, daily write out your notes of desired good. Second, mentally image the successful results. Third, boldly and deliberately affirm and command those successful results to appear. If you persist daily in following these three simple steps, you will not be able to stop the floodtide of good from overflowing into your life.\"Some of the other topics covered are work, generating love and good will, financial independence, children, prayer, \"genius\" powers, intuition, health, self-confidence, and \"charm.\"Get out a highlighter, pen and paper to use as you read, because I guarantee you that you will be taking notes and copying affirmations as you excavate them from Catherine Ponder's \"The Dynamic Laws of Prosperity\" classic text.- Mary Jo Shaffer, [...]",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNTZNWVSHOSW4KW6ASYANZJADWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REUXB6S10GCJH?ASIN=B0B1DHWKD5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Read",
                "reviewText": "This was a wonderful book. Actually it has changed how I live each day. I am conscious of what I say and I study and practice many of these laws, and have seen great results.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristal Burgess",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKNNJ5D5R3ZYSV65BYF5I5IVNZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18FIYYA57COFP?ASIN=B0B1DHWKD5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2023",
                "reviewTitle": "5.0 out of 5 stars A Must Read!",
                "reviewText": "Catherine Ponders words are life changing. The affirmations in this book alone if done consistently and purposeful will yield amazing results. If you are looking for inspiration, motivation, with instruction to make your life better no matter who you are or where you are in life, this is the book!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOAYWHXDSVW33IBECWGN2PVOXGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DFMAPGKU4522?ASIN=B0B1DHWKD5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 8, 2017",
                "reviewTitle": "4.0 out of 5 stars Waist Trainer- great Costomer service",
                "reviewText": "While this product wasn't what I expected their customer service is very helpful and efficient. I purchased this under the assumption that it could be used while exercising however this is not the case.If you are looking for a waist trainer to wear under your clothes this is the item for you. The shoulder support is great. I also liked that the bustier came with 3 levels so you can tighten or wear it more lose to your liking.Again while this wasn't what I envisioned it for its a great waist trainer for under your clothes.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 15, 2023",
                "reviewTitle": "A must-read for a better life!",
                "reviewText": "Worth reading, unlike other books on prosperity and abundance, this one is far more interesting, easy to read, and apply. The author has gone above and beyond to support her claims she made about the power of positive thinking with real-life examples that happened in the lives of people who practiced what she preached.Would recommend this book to people looking for positivity, and blessings in their lives.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JMM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on May 7, 2023",
                "reviewTitle": "Many practical abundance tíos",
                "reviewText": "Thoroughly enjoyed the book. This is one you need to study Jam packed with useful information to put in practice.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Glauber Cardoso de Oliveira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 1, 2018",
                "reviewTitle": "Inspiring! blessedly...",
                "reviewText": "The book is a classic about the overview of a prosperous life that everyone must read to get its powerful teachings by yourself.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ekaterina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 4, 2019",
                "reviewTitle": "Wonderful and efferctive",
                "reviewText": "It was my preferred reading when going to work and helped to tune myself in a right way. With this book I’ve got more positive attitude to myself and my world, more active inner activity, more hope and more attention to wonderful things which I meet and for which I’m very grateful ))I’ll definitely read this book again!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick Grimshawe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 15, 2017",
                "reviewTitle": "Learn Prosperity Thinking",
                "reviewText": "This book is filled weekend with ideas on how to think prosperity into your life. Within the chapters of this book all area of your life are covered and what affirmations would best start the flow of abundance to you.The book uses an abundance of affirmations. I underlines many for use in specific situations but there are many simple easy to remember affirmations . My favourite is the ten times rule which I've been using every day.The book is an easy read, however the language is dated and depending on you personal concept of God might need you to rework some of the affirmation.This book really changed my mental landscape for the better.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}