{
    "remaining_requests": 444,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Olga-Dies-Dreaming-A-Novel/dp/B093TPQD82",
    "body": {
        "name": "Olga Dies Dreaming: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Olga-Dies-Dreaming-A-Novel/dp/B093TPQD82",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/519qP18cqxL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Xochitl Gonzalez",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Xochitl+Gonzalez"
        },
        "brand": "Xochitl Gonzalez",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 5793,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"All three narrators are Puerto-Rican born and deliver the Spanish passages with musical grace, thereby enhancing an already fine novel.\" (The Washington Post)“The narrators’ accents and code-shifting create a vibrant auditory experience. In particular, Guerra’s luscious voice conveys Olga’s transformation from fighter to a compassionate woman as she overcomes dualities and finds wholeness within herself.”–BookPageA blazing new talent debuts with the story of a status-driven wedding planner grappling with her absent mother, her glittering career amongst New York’s elite, and her Puerto Rican roots in the wake of Hurricane Maria.It’s 2017, and Olga and her brother, Pedro “Prieto” Acevedo” are bold-faced names in their hometown of New York. Prieto is a popular Congressman representing their gentrifying Latinx neighborhood in Brooklyn while Olga is the tony wedding planner for Manhattan’s powerbrokers.Despite their alluring public lives, behind closed doors things are far less rosy. Sure, Olga can orchestrate the love stories of the one percent, but she can’t seem to find her own...until she meets Matteo, who forces her to confront the effects of long-held family secrets....Twenty-seven years ago, their mother, Blanca, a Young Lord-turned-radical, abandoned her children to advance a militant political cause, leaving them to be raised by their grandmother. Now, with the winds of hurricane season, Blanca has come barreling back into their lives.Set against the backdrop of New York City in the months surrounding the most devastating hurricane in Puerto Rico’s history, Olga Dies Dreaming is a story that examines political corruption, familial strife, and the very notion of the American dream—all while asking what it really means to weather a storm.A Macmillan Audio production from Flatiron Books Read more",
        "breadCrumbs": [
            {
                "name": "Audible Books & Originals",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_1?ie=UTF8&node=18145289011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18574426011"
            },
            {
                "name": "World Literature",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18574521011"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18574541011"
            },
            {
                "name": "Latino American",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=18574544011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "11 hours and 42 minutes"
            },
            {
                "name": "Author",
                "value": "Xochitl Gonzalez"
            },
            {
                "name": "Narrator",
                "value": "Almarie Guerra, Inés del Castillo, Armando Riesco"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 04, 2022"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B093TPQD82"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,190 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #14 in Latino American Literature #41 in Hispanic American Literature & Fiction #269 in Family Life Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Cathryn Conroy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW6562N3JURITICBRTMOQFVZVDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DNJTN8W384LB?ASIN=B093TPQD82",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 8, 2023",
                "reviewTitle": "5.0 out of 5 stars A Big, Weird Novel! A Remarkable and Powerful Book That Is Also a Really Good Read",
                "reviewText": "This is a remarkable and powerful story that is also a really good read, but the best description of all comes straight from author Xochitl Gonzalez: It's a big, weird novel.It is a novel about a lot of things: Puerto Rican politics, political corruption, the close-knit diaspora of Puerto Rican communities in New York City, and a bit of Puerto Rican history. But more than all that, this is a very human novel—a story about breaking free from social restraints and family expectations and fully realizing your dreams…of becoming who you were meant to be.This is the story of Olga Acevedo and her brother Prieto Acevedo. It's the summer of 2017, and the two are part of a large and loving Puerto Rican family in Brooklyn. Still, their lives are grounded in a deep and abiding heartache. They were abandoned by their mother, Blanca, when Olga was 12 and Prieto was 15 when she left the country to follow a fringe figure to fight as a revolutionary for an independent Puerto Rico, while their father left them for drugs, becoming a heroin addict who eventually died of AIDS.Ivy League graduate Olga, now 41, is the wildly successful owner of an upscale wedding planning business, while Prieto, who is recently divorced with a young daughter he adores, is the U.S. congressman for their Brooklyn district. Olga may plan gorgeous weddings for New York's upper crust, but she has no love life of her own beyond meaningless sex with a series of men she never allows to get emotionally close. And Prieto may be a political wunderkind, but he is being blackmailed as he harbors a personal secret that he is terrified could erupt in a devastating, personal scandal at any time.Just as Olga meets a wonderful and loving man named Matteo who may change her life in ways she never imagined, Prieto is so consumed with his own secrets that he shuts out those who love him most, especially Olga. It is Matteo who forces Olga to examine all the secrets and lies that have consumed her family's past and present. But Olga and Prieto can no longer hide in the emotional armor they have erected around themselves because Blanca comes roaring back in their lives days after Puerto Rico is consumed by Hurricane Maria in September 2017. What their mother asks of each of them after all these years of separation is astonishing in an eye-popping horrifying way, and their reaction to her is equally astonishing in an eye-popping gratifying way. (Oh, this is good!) That said, the ending is a bit unsettling…and maybe a portent of things to come.I so enjoy reading books about cultures that are not my own because I learn so much. And because this is a novel with a compelling story and vivid characters, I seemingly became part of that culture while I was immersed in the pages of the book. That is the magic of reading. It allows us to embrace an empathy and understanding we wouldn't otherwise have.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barbara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWAA4B5TQ74A6DRX2JHEVMKHV3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1USMI4XKUBCYT?ASIN=B093TPQD82",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Enlightening",
                "reviewText": "I really enjoyed this novel, especially the second half. The first half was slow, but it really picked up halfway through. I learned a lot about the Puerto Rican diaspora and saw another side to the statehood issue.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy Kilgore, author of Wild Mountain, a novel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMIZAJC25UJMLMSL3YVFARQVL6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFZ036FUCOIY3?ASIN=B093TPQD82",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Powerful story, political insights",
                "reviewText": "A formidable accomplishment. A young woman grows from her life as a wedding planner, with superficial values and an in with the super-rich New Yorkers into integrating the disparate influences and experiences and the social realities of her Puerto Rican heritage. Well-drawn characters: the stereotypical privileged rich white lawyer with a conscience goes through his own agonizing growth crisis, while Olga struggles with her values and direction. The absent mother is a great portrayal of a highly principled but inhumane 70s radical and as well brother Pietro, an agonized closeted gay man who has a social conscience but gets caught up in the politics and corruption of New York City. Gonzalez' grasp of New York politics, as well as the art and music scene, is impressive. In the course of the story she writes highly sophisticated intellectual commentary on these as well as the struggles and political realities of the Puerto Rican people both in the US and in Puerto Rico. This is a wonderful weaving together of all these elements in a powerful story.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheryl Greeson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA7QDOJEBELXBIQ6EFB2MHZGTXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F8BYS1FTTWQ5?ASIN=B093TPQD82",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "3.0 out of 5 stars Just Okay",
                "reviewText": "I liked the storyline, but parts were slow moving so it took me a long time than expected to finish the book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGY35AWFVYALEQHZOZEK5AN4SJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5EQJYZ97F5I2?ASIN=B093TPQD82",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "4.0 out of 5 stars Olga 4 stars",
                "reviewText": "I really liked this book. It really blended real politics with the fiction of the story. Olga isa very real character and so is everyone else in her family that I could imagine. The nuance of colonialism and the ramifications it has here and in the colonized nations is represented and how it tears families apart. I enjoyed this book for the family drama and the politics!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TERESA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2L2MJIPUWUXIUZUK2PRX2HAQXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NAXOVS57LAK0?ASIN=B093TPQD82",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Hooked me right away",
                "reviewText": "I’m currently reading this book now. I bought it because my book club decided on this book. I’m glad they did. I am really enjoying it. I have been reading a lot of books lately that center around women falling for a man and don’t get me wrong I love a good love story but sometimes it becomes predictable. This book is not that at all. I would recommend this book to anyone really. It’s a good easy read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Ting",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBELDIRTJLMUGFJF3MOX2NJFOTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2187K60227H3S?ASIN=B093TPQD82",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars A novel with multiple layers",
                "reviewText": "I didn’t know what to expect when I started to read the book. I thought I would learn more about Puerto Rico through the characters. But the book is so much more. It’s about abandonment, family love, and acceptance. And along the journey, I learned more about the history and politics that define Puerto Rico. A great book that never feels pedantic.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ms jenny heath",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 10, 2024",
                "reviewTitle": "A good read",
                "reviewText": "Fantastic story draws you in Informative on Puerzo Rico history & politics well written",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Selvam S",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 16, 2023",
                "reviewTitle": "Nice book",
                "reviewText": "Nice book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 30, 2022",
                "reviewTitle": "a fantastic piece of fantasy",
                "reviewText": "It was a delightful read. I felt educated on Puerto Rican history as well as entertained. The story and themes were universal. I saw myself in many characters despite not being Puerto Rican. When good things happened to the characters it felt delightful bc knowing their struggles it felt very earned. I thought the male characters could have been more authentic though.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 21, 2023",
                "reviewTitle": "Great read",
                "reviewText": "Couldn’t put it down. Loved it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Romulus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 19, 2022",
                "reviewTitle": "An early twenties classic",
                "reviewText": "A great tour de force. Brooklyn's latest contribution to the evolution of the English language, a vivid snapshot of nuyorican culture and its challenges.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}