{
    "remaining_requests": 633,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Religious-Affections-Jonathan-Edwards-ebook/dp/B0BGRSQKY6",
    "body": {
        "name": "Religious Affections",
        "price": "$0.75",
        "originalPrice": "",
        "rawPrice": 0.75,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Religious-Affections-Jonathan-Edwards-ebook/dp/B0BGRSQKY6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71E9wGiVfcL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jonathan Edwards",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_ebooks_1?ie=UTF8&field-author=Jonathan+Edwards&text=Jonathan+Edwards&sort=relevancerank&search-alias=digital-text"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 289,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Religion & Spirituality",
                "link": "https://www.amazon.com/Religion-Spirituality-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158280011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BGRSQKY6"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Grapevine India (September 24, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 24, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 719 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 491 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#152,586 in Kindle Store (See Top 100 in Kindle Store) #9 in Christian Dictionaries & Encyclopedias #51 in Folklore & Mythology #243 in Folklore & Mythology Studies"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 289 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Matthew Everhard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKOCAQTZYNKYUXYQE5H247D3FEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R316Y54F06VHMZ?ASIN=B0BGRSQKY6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 24, 2014",
                "reviewTitle": "5.0 out of 5 stars One of the Most Theologically Significant Works on Revival and Regeneration",
                "reviewText": "Overview: The Religious Affections is for very good reason considered one of the most important works of Jonathan Edwards in particular and one of the most excellent and helpful treatises on Christian spirituality in general. Caught in both the glory and the drama of the First Great Awakening, Jonathan Edwards was tasked with the responsibility to defend God’s mighty outpouring of grace from both its detractors and its extremists.In this great work, Edwards sets out to accomplish three major goals (1) he shows from Scripture that the religious affections (“the more vigorous and sensible exercises of the inclination and will of the soul”) are indeed true manifestations of real Christian spirituality and of the holy life (2) he warns of a number of “experiences” that cannot either verify or falsify the reality of one’s professed conversion and (3) he enumerates several factors that are indicative of true conversion and regeneration. Chief among these last factors (as the quote below demonstrates) is the fruit of holy living—or Christian practice—carried out in the believer’s life.Application: This great work has a number of applications and uses. First and foremost it helps to delineate what true conversion looks like. In Edwards’ day it was hard to prove that one was truly “converted.” Often the Puritans looked for a series of finely ordered “steps” in one’s testimony of professed faith. The burden of proof lay heavy. In our day, it is much easier—we must simply give an “altar call” story, or a similar anecdote of “accepting Jesus into our heart.” Edwards speaks to both extremes by evaluating the conversion experience with a truly Biblical grid of analysis.Edwards shows that true conversion does indeed transform both the inward man, in his “affections” (love, joy, fear of the Lord, etc.) as well as the outward man in living out the will of God in his daily experience. Pastors who are prayerfully evaluating their flock, as well as those unsure of their own salvation, will find this work deeply helpful in this regard.Critique: While this particular reviewer is mostly sympathetic to Edwards’ position about conversion, many of my charismatic and Pentecostal friends will likely find some fault with Edwards’ teaching on the inner-life of spiritual experience. Throughout, Edwards is particularly hard on those who claim to have received such things as visions of Christ or strong “impressions” of particular Scripture passages upon the heart as being too easy to manipulate and falsify. While he is surely right in showing that these things cannot prove that one is a Christian, some readers (but not all) will feel he has gone too far in assessing the supernatural revelations of the Holy Spirit to the human mind in a negative fashion.Best Quote: “From what has been said, it is manifest that Christian practice, or a holy life, is a great and distinguishing sign of true and saving grace. But I may go further and assert that it is the chief of all the signs of grace, both as an evidence of the sincerity of professors unto others, and also to their own consciences” (p. 326-32).-Matthew Everhard is the Senior Pastor of Faith Evangelical Presbyterian Church in Brooksville, Florida",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr. C.H.E. Sadaphal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLG3TRU4QOMAP7CMNDFZTW5D5LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Q6HXSPSVXSOU?ASIN=B0BGRSQKY6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2021",
                "reviewTitle": "5.0 out of 5 stars (4.9 stars) Gain a biblical understanding on the nature & distinguishing features of true religion.",
                "reviewText": "In essence, Religious Affections provides criteria for answering a crucial question: How does one distinguish between genuine and false piety? Edwards provides twelve signs that are marks of the former. Now why would the author write such a treatise? The historical context of this work was the 18th century Great Awakening, where spiritual revival swept through colonial America. Undoubtedly, there was an explosion of spiritual light but with it also came that which was counterfeit. There was therefore a heightened need for biblical discernment. Subsequently, what Edwards masterfully does in this work is make a biblical argument that true religion is neither lifeless morality of the mind or uninformed zeal of the heart. Instead, in his own words, his aim is to show “the nature and signs of the gracious operations of God’s Spirit,” and how they are to be distinguished from those things that are not of a saving nature and are (in actuality) the products of the men’s minds. In other words, true piety is what God produces by His grace; it’s not what men think grace is or what they experience.Edwards provides twelve signs (e.g., holiness, humility and Christian practice) that are all the effects of the Spirit working within. What the reader will quickly learn is that because true religion consists in religious affections, our chief affections ought not to be in the things of this world. Accordingly, what the reader will walk away with from this book is twofold: (a) the ability to discern between the true and the false; (b) a strong conviction to look upwards to the Lord in order to work out your own salvation “with fear and trembling.”Finally, what oozes from every page in Religious Affections is a sense of awe and a reverent “weightiness” of God’s glory; these are attributes often absent in the writings of modernity, whose authors are often flippant and treat the name of God with a cheeky casualness. Undoubtedly, Edwards is one of the most important theologians in the history of the Christian church and Religious Affections is an excellent introduction to the output of one of the most gifted minds in the history of the Christendom. Truly, this text is saturated with golden nuggets of wisdom that will yield dividends for years to come.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pastor Eric",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEX3AUL6ZJ7ENOVEIZUVFKP5ZUTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M2SKDN9K6HH9?ASIN=B0BGRSQKY6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2022",
                "reviewTitle": "5.0 out of 5 stars A Classic Read for All Christians",
                "reviewText": "Jonathan Edwards was one of the primary figures in the First Great Awakening. As a minister, he witnessed God's work firsthand as people's hearts were brought to life through the gospel. It was through his preaching, and the gospel work of other faithful men, that multitudes came to profess faith in Jesus Christ. However, the awakening was not without critics. Many questioned the religious excesses that seemed to accompany the revival sweeping across colonial America. How could one be sure if lives were truly being changed or merely given to emotional experiences? Jonathan Edwards penned The Religious Affections as a response to such conjecture.Within this classic volume, Edwards seeks to differentiate true religion from false religion. He acknowledges that affections and works play a part in the Christian life, but that the mere presence of certain emotions or acts of service do not confirm faith as genuine. So carefully and thoroughly Edwards plumbs the depth of scripture to walk readers through twelve ways in which true faith is measured. In the end, believers are pointed to the presence of the fruit of the Spirit and its manifestation in the lives of the saints.Examination of one's claim to faith is good and proper. Every believer should be able to answer the question: \"How do I know that I am saved?\" Within this exhaustive treatise on the subject, readers will find Edwards trademark logic on full display as the scriptures are laid out clearly for all to see. This is a book that should be essential reading for all believers.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 14, 2018",
                "reviewTitle": "Grande obra",
                "reviewText": "Uma obra que todi cristão deve ler...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carole \"Reggae\"",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 1, 2014",
                "reviewTitle": "Great book.",
                "reviewText": "Wonderful little book, full of wisdom.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin O'Connor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 29, 2015",
                "reviewTitle": "Insightful, thorough and utterly biblical.",
                "reviewText": "Edward's work in this treatise is thorough and biblical. It is not easy reading, but it is some of the best reading I have ever done on Christian experience and assurance. This is am incredibly helpful book and I gladly recommend it. As long as Christians will need to discern between true and false religion, this book will continue to be read.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C Maciver",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 27, 2018",
                "reviewTitle": "My overall view.",
                "reviewText": "An important work by which we may examine ourselves whether we are genuine believers or not. I would highly recommend it to others.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. A. Reddick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 7, 2013",
                "reviewTitle": "A Classic",
                "reviewText": "This book is a classic for anyone studying theology. I used it as a reference in my dissertation on the Awesomeness of Nature and find that it provides some excellent references for everyday life.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}