{
    "remaining_requests": 477,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Christmas-Carol-Charles-Dickens-ebook/dp/B07LBXKYDS",
    "body": {
        "name": "A Christmas Carol",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Christmas-Carol-Charles-Dickens-ebook/dp/B07LBXKYDS",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81cfl0PSliL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Charles Dickens",
            "link": "https://www.amazon.com/Charles-Dickens/e/B000APYNYE/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 37438,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Children's eBooks",
                "link": "https://www.amazon.com/Childrens-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=155009011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07LBXKYDS"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ JA (December 12, 2018)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ December 12, 2018"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 688 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 82 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ B08N37KG5B"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,103 Free in Kindle Store (See Top 100 in Kindle Store) #2 in Children's Christmas Books (Kindle Store) #10 in Classic Short Stories #28 in Fiction Anthologies"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 37,438 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "GMorrison",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWCPRE6DLGY4YMZGSMXCLUBI7VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8CRSPQ0X1GJB?ASIN=B07LBXKYDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2015",
                "reviewTitle": "5.0 out of 5 stars A Christmas Carol Book Review (MS. LANGLIE! HERE IT IS!)",
                "reviewText": "“I will honor Christmas in my heart, and try to keep it all the year. I will live in the Past, the Present, and the Future. The Spirits of all Three shall strive within me. I will not shut out the lessons that they teach. Oh, tell me I may sponge away the writing on this stone,” (Dickens 144) the once miserly, old Scrooge pledges desperately to the Ghost of Christmas Yet To Come as they stand over Scrooge’s future grave, following their witnessing of the nightmarish images of his own forthcoming death and its pitiable consequences. Charles Dickens’ charming and clever classic tale of Ebenezer Scrooge and his change of heart has touched a countless number of people over generations. This five-star novel’s utterly moving message and immense genius will touch many more to come, and urge others to make the pledge to “honor Christmas in [their own hearts], and try to keep it all the year,” (Dickens 144), as Scrooge so thoroughly did himself that one Christmas night.Originally published in the year of 1843, A Christmas Carol summons us to Victorian London, contemporary to the year the story was published. The selfish, stingy, miserly, and miserable, old Ebenezer Scrooge broods in his hatred for the Christmas Season, as Scrooge greatly detests happiness, generosity, love, and family. Christmas Eve night, he is haunted by the ghost of his old business partner, Jacob Marley, who appears to Scrooge with a long, heavy chain made from all of the terrible things that Marley pursued in life. Marley warns Scrooge that he is doomed to Marley’s same, terrible fate unless he changes the way he lives his life. So he tells Scrooge that three more Spirits will haunt him during the course of the night. We all know the story: the Ghosts of Christmases Past, Present, and Yet To Come visit Scrooge and show him moments in his lifetime in order to instill in Scrooge the idea to stop being so dreadful and instead to become compassionate. Throughout Scrooge’s tale, Charles Dickens introduces to us three different methods (one for each of the three spirits) as the tools for a person, such as Scrooge, to change one’s life. A very prominent theme portrayed in A Christmas Carol, is how the application of these three methods will change someone’s heart.The Ghost of Christmas Past is the first of the three to appear to Scrooge and the first to apply one of Dickens’ methods to change Scrooge’s heart. The Ghost of Christmas Past takes Scrooge back to his childhood and early years to show him all of the people he has loved. He sees his beloved, younger sister, Fan, the mother of his ever-encouraging nephew, Fred; he sees the jolly man to whom he was once apprenticed, Fezziwig, and the jovial love he showed to all his family and friends; and Scrooge also sees his former fiancée, reliving not only the scene of when she left him due to his growing greed, but also the images of the happy life she led after she left him. Seeing these people in his past renews Scrooge’s spark of love for his family and friends. Dickens’ first step to a change of heart— love.The jolly Ghost of Christmas Present succeeds the Ghost of Christmas Past and leads Scrooge through the existing world to see all those who were currently celebrating Christmas. He shows Scrooge the Cratchits, the family of Scrooge’s clerk Bob Cratchit, demonstrating to Scrooge how his habit of penny-pinching and ill behavior toward Bob Cratchit is affecting the poor, struggling family, in particular Bob Cratchit’s crippled son, Tiny Tim. This helps Scrooge feel regret for the decisions he has made and become more generous to those in need. The second method to the changing of Scrooge’s heart was the feeling of regret.Then the wraithlike Ghost of Christmas Yet to Come appears to Scrooge and shows him scenes from the future. At first, these scenes meant nothing to Scrooge as he saw the people of London’s disgraceful response to a terrible man’s death until Scrooge realized that this terrible man was Scrooge himself. This sudden realization at the setting of Scrooge’s own future grave was the sign of his complete conversion to kindheartedness. He felt absolute fear of the images he saw, and wanted nothing more than to reverse them. Hence, The Ghost of Christmas Yet to Come applied the final method of transformation— fear for the future’s terrible consequences.So there are the keys to Scrooge’s conversion— love, regret, and fear for the future. The theme of how the application of these three methods is the key to changing someone’s frame of mind I believe is both valid and properly conveyed. With the help of the three spirits that fateful, Christmas Eve night, Ebenezer Scrooge realized that he must always have, “the Spirits of all Three… strive within [him, and] not shut out the lessons that they teach,” because if he went back to not loving, not feeling regret and guilt, and not being wary or fearful of future consequences, Scrooge would return to the greedy, wicked state in which he had found himself the night before. But that theme isn’t the most prominent in Dickens’ A Christmas Carol. The most prominent theme is the happiness one feels when one shows more benevolence, and I think that Dickens displayed this intent more than thoroughly by the end of his tale. And how true that is. Scrooge would’ve gone on living his rotten life with no lasting legacy when he died if it were not for the spirits’ visits. Instead, he spent the rest of his years becoming “as good a friend, as good a master, and as good a man, as the good old city knew, or any other good old city, town, or borough, in the good old world,” (Dickens 158).In Charles Dickens’ flawlessly written tale of A Christmas Carol, Scrooge learns that happiness can come to us if we will forget self and worldly gain, concentrating instead on helping others and learning to embrace the love of family and friends. Dickens’ clear, concise, and beautiful depiction of the world’s most beloved Christmas story second only to Christmas’ inspiration is one that everyone would benefit from reading. And may those who read it, remember themselves to “honor Christmas in [their hearts], and try to keep it all the year,” (Dickens 144).",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EmeraldJade",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSB7477EM4NNUJSUMPVL7P6BWUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U3GMYH3VY9A9?ASIN=B07LBXKYDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful Little Book",
                "reviewText": "The book arrived in excellent condition and was Packaged with Perfection!! Couldn't ask for a better Seller! The book itself is just beautiful! Love the pen and ink illustrations as well as the font type which makes for ease of reading! I would highly recommend this Seller and this wonderful book to all!! 10 Stars and more! Thank you so very much!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Team L 3",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHN32HAACZZMGF4GYGWPPIP3Y3AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SFK3SQ2OSQN4?ASIN=B07LBXKYDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful Illustrations & Print",
                "reviewText": "The illustrations you can get lost in looking at.This book is excellent quality. The stock & vibrancy of illustrations make this a book to enjoy all year through - especially at Christmas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "***Toy Collector***",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5NFKDKQNEYV76GKH7BMXNTHKSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3O9NVNW5JXROK?ASIN=B07LBXKYDS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 10, 2023",
                "reviewTitle": "4.0 out of 5 stars One Of My Favorite Books",
                "reviewText": "The plot of this novel is well-known. In this story, Ebenezer Scrooge visits with the ghosts of Christmases past, present, and yet to come in addition to the ghost of his old business partner Jacob Marley.This great work was initially published in the middle of the eighteenth century. Charles Dickens' books remain some of the best today. He speaks clearly and compassionately on humanity's struggles and the unfairness of social classes.You must read the book especially if you have only seen one of the several film adaptations.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon Pipke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5P7ZCPVDOWXUR6ZOVFD3CPNKUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17Y1X7ZN5N9Y3?ASIN=B07LBXKYDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars A Christmas carol",
                "reviewText": "This is a good book to read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A+D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDL4BGA4VFJM63RLKDWH7DCV2FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DK3XZH7CDI3O?ASIN=B07LBXKYDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Good Narrator of a Classic",
                "reviewText": "*Review based on Kindle and Audible Read and Listen*I read or listen to a different version/narration of this book every year. The narrator of this particular version is very good. I enjoyed his deep tone of voice very much! It was not overly dramatic or loud. This would be a good version for families with younger children to listen to.2023",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "melissa kessler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7VSEJHPLQ7CQPFRE5AWJGHFQFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ED1ECW4ETAWL?ASIN=B07LBXKYDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars I love a Christmas Carol",
                "reviewText": "It's a great classic to read and a great page turner. Christmas is my favourite season. I volunteer at a local food pantry when I can",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Izzy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCLXGKBHEUJQC6OAZFDYTKI6XNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13Z9DEXNHVJ74?ASIN=B07LBXKYDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Bah humbug no more",
                "reviewText": "Such a classic tale.this is my favorite Christmas story I have seen many movies and television shows and Charles dickens A Christmas carol is one of my favorite classic stories of all time.i love to reread this tale and I shall read it to my kids as well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 3, 2024",
                "reviewTitle": "I enjoy the classics",
                "reviewText": "Christmas time and been meaning to read this story for a while now, very glad I did.I believe I will make it a tradition for me to go along with the story \"twas the night before Christmas\".",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fernando Marcato Petean",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 25, 2022",
                "reviewTitle": "O mais clássico dos Natais literários!",
                "reviewText": "Trata-se de uma \"cautionary tale\" (narrativa com mensagem educativa ou de precaução). Em que pese um viés de otimismo religioso inocente como o único e correto caminho a ser seguido, a história natalina de Dickens logra transmitir boas vibrações ao mesmo tempo em que nos brinda com as peripécias fantasmagóricas de Scrooge e seus guias do além. Por muitos anos, uma leitura saborosa em cada época natalina.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 6, 2024",
                "reviewTitle": "A great story",
                "reviewText": "Some words idiot like",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "loo33",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 6, 2024",
                "reviewTitle": "livres",
                "reviewText": "conforme à la description",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Buchet",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on December 31, 2023",
                "reviewTitle": "Beautiful illustrated edition",
                "reviewText": "The cover is as beautiful as pictured. The illsutrations add something new to this timeless Christmas classic.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}