{
    "remaining_requests": 525,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Inside-Out-Back-Again-Thanhha/dp/0061962791",
    "body": {
        "name": "Inside Out and Back Again: A Newbery Honor Award Winner",
        "price": "$6.99$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Inside-Out-Back-Again-Thanhha/dp/0061962791",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51 ryGVxcCL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41eljk6cMEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Jaze- A9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415BPaJxqSL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Thanhhà Lai",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Thanhh%C3%A0+Lai&text=Thanhh%C3%A0+Lai&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 7198,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 9 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 14 hrs 9 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b?ie=UTF8&node=4"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Childrens-Books/b?ie=UTF8&node=2966"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ HarperCollins; Reprint edition (January 2, 2013)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 288 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0061962791"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0061962790"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 9 - 12 years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 800L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 3 - 7"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.12 x 0.58 x 7.62 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,202 in Books (See Top 100 in Books) #7 in Children's 1900s American Historical Fiction #12 in Children's Fiction on Social Situations #32 in Stories in Verse"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 7,198 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Inside Out and Back Again Inside Out and Back Again: A Harper Classic When Clouds Touch Us Thanhha Lai Young Readers' Collection Modern classics from #1 New York Times bestselling author Thanhhà Lai A novel-in-verse inspired by the author's childhood experience as a refugee fleeing Vietnam after the Fall of Saigon and immigrating to Alabama A special edition including an author's note, interview, family activity, tips on writing poetry, and discussion questions A stunning sequel picking up two years after Hà and her family arrive in Alabama as refugees from the Việt Nam War An eBook collection including Inside Out and Back Again along with Listen, Slowly",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/029b7ff3-b081-408a-9942-47324b2cdd53.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/242d11d6-1906-4472-abf4-251667e72dc2.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/560d7a4e-3e40-45b6-9cc4-b0cd6769e88e.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/da83f9b1-2ba5-4ad7-bb96-2b98db4eb302.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "L. Gallier",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2LNTJESMTZRGXXJFZ24IWFJ5QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Q1RN0T68EMQ9?ASIN=0061962791",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2016",
                "reviewTitle": "5.0 out of 5 stars Vietnamese culture, refugee story, beautiful writing",
                "reviewText": "Her favorite things are papayas, a dog-eared doll, and her mother. Her name is Ha and as the story opens, she is ten years old, living in Saigon in 1975. When the story ends, she is eleven years old, living in Alabama.Although I don't ordinarily read children's literature, I loved this book. I read it in connection with a graduate level course in Writing Literature for Children.The characters, historical moment, and narrative arc of Inside Out and Back Again fit comfortably yet originally within familiar literary archetypes. Her beloved father is away fighting in the war, and the mother and children are increasingly vulnerable and impoverished, a theme that brings to mind Little Women by Louisa May Alcott. Each day they must choose between staying and fleeing: should they live another day under the harsh conditions of war and the oppression of an autocratic dictatorship, or abandon their duty to their country, community and family? Siblings disagree; loyalties shift. Mother is torn between her duty and desire to wait for her husband, her fear that he may be dead, and her hope for a better life for her children. Ultimately the family climbs aboard a Navy ship in search of safety and winds up with a completely new way of life.Thus begins the voyage, fraught with danger from the very beginning; they begin to second-guess their decision to leave and continue to do so through each hardship they face, and to grieve what they left behind. Ha notes that \"No one would ever believe me but at times I would choose wartime in Saigon over peacetime in Alabama\". At some time or another, every immigrant story I've read expresses the frustration of adjusting to a new culture, the demoralization of \"having to begin again at the lowest level of the social scale\" and for the refugee, \"the shame of abandoning our own country and begging toward the unknown\". Any child who has moved, or changed schools, or even given up a team to move to a higher level or pursue another interest knows these feelings.Ha struggles, as any person would in a new situation, with making her new location a home, and finding her place in her new school and neighborhood. The welcome she receives is often well-meaning but awkward, as when her teacher introduces the class to Vietnam by showing iconic photos of the war, rather than the papaya trees, distinctive foods and humid weather that define Vietnam for Ha. At times, though, her new community greets her with racism and xenophobia; after a brick \"shatters the front window...along with a note\" which \"Brother Quang refuses to translate\", they go door to door with their sponsor to meet neighbors who refuse to open their doors to them. To survive, she learns quickly who to trust, without necessarily knowing what trust is or how she knows. In the case of her family's sponsor, she has no choice but to trust him. In other cases, she watches others to evaluate their trustworthiness, as when two children join her for lunch with giggles that become smiles rather than \"explode into laughter thrown at me\". She calls this diary entry \"Most Relieved Day.\"In this new environment, she has to learn how to solve some of her problems on her own, since her mother doesn't understand the language or culture. She trades her innocence for competence and self-respect by struggling through situations as they arise, standing up for her mother, and receiving help graciously. Ha is growing up.Ha's character emerges authentically and robustly through her own voice. The story is written as Ha's diary, in verse. Allowing Ha to speak for herself puts the reader on a ten-year old level. The diary format frees the author from filling in every detail, thereby focusing on what matters to Ha. Like most people, Ha doesn't write in her diary every day, and she only records significant matters, such as the progress of the first papaya ripening on the papaya tree she planted from a seed. Her birthday wishes, confessed confidentially to her diary, chronicle her disappointments: \"I wish...I could do what boys do and let the sun darken my skin and scars grid my knees...I could stay calm no matter what my brothers say...I had a sister...Father would come home\" . My copy of the book includes an interview with Lai, in which she admits that she \"struggled for fifteen years to tell Ha's story in a voice that would be authentic\". After attempting many different styles, she \"started jotting down exactly what Ha would be feeling, lonely and angry on the playground. The words came out in quick, sharp phrases that captured her feelings in crisp images\", which she wrote in verse form, as entries in a diary. The terse sentence structure evokes the simple thought pattern of a child and the brusque sound of the Vietnamese language being spoken.Ha captures the distinct personalities of her brothers, her classmates, and her neighbors through incisive observation in her diary, zooming in on discrete behaviors of each character to demonstrate their personalities while simultaneously establishing each as a metaphor. Brother Khoi represents Buddhist compassion; when it's his turn to eat the egg their hen lays four times a week, he \"refuses to eat his, putting each under a lamp in hopes of a chick.\" Brother Quang, the oldest, views the world politically, expressing the moral outrage that a grateful refugee feels but can't afford and the cynicism of one who is dependent on a government who bears a great deal of responsibility for their dilemma. For example, \"Mother is...amazed by the generosity of the American government until Brother Quang says it's to ease the guilt of losing the war.\" Because he's the only one who knows English, he serves as a liaison with their new community, highlighting the vulnerability of the family when he refuses to translate or is not around. Brother Vu embraces American culture and, by giving martial arts lessons in the front yard, is the first in the family to assimilate. Lai chose Ha's observations carefully, portraying each person as an individual and as an archetypal character yet exposing them solely within the context of their relationship with Ha.In some ways, the story calls to mind The Diary of Anne Frank: a young girl, recording in her diary her most personal thoughts and her careful observations about her life at a time of extraordinary political upheaval. Like Anne's, Ha's voice is simple and unfiltered, unhindered by intellectual interpretation, the need to justify herself or her story, or exhausting description. After all, a diary is written for the writer, not for an audience. She tells what happened, how she felt about it and what she did about it, then skips to the next matter of interest to her. Inside Out and Back Again is not technically an autobiography and is not a contemporaneous diary, but forty-something year old Lai seems to have invoked her own inner ten year old, letting her tell the story in her own words, affirming the significance of herself as sufficient context, never mind the sweep of history in which she exists. In doing so, Lai gives the reader a rare gift: the opportunity to experience the historic, cultural, social and psychological richness of a great humanitarian tragedy through the eyes of a child.Ha experiences the world primarily as a member of the family; she is always the smallest and youngest of four children, and the only girl in a family of three boys. Readers in these positions in a family will relate easily to Ha's experiences. At different times, she and her siblings find ways to irritate each other but also to comfort and even rescue each other. Ha particularly loves her mother, and many of her diary entries detail the qualities of her mother that matter the most, for example the love, sorrow, and tenderness conveyed when her mother says, \"You deserve to grow up where you don't worry about saving half a bite of sweet potato\" Her mother's beautiful eyes, as well as her modesty, sensitivity, and compassion come up frequently. We sense her father's memory slipping away when the image of a helpful uncle comes to mind more readily than the appearance of the father she knows only through photographs. The family relationships are characterized by love, loyalty and trust. There is enough drama outside this family to keep the story rich without introducing family dysfunction as well.The use of verse tightens the writing; there is no excess. The whole book can be read in less time than it takes to read a dense article in the Sunday New York Times. Her diary records her fantasies, disappointments, and experiences honestly and authentically in the staccato sentences of a smart young girl. The lyrical structure makes room for imagery that might interrupt an organized prose and frees Lai to use incomplete sentences for emphasis: “No more migration. No more letters. No more family”. Animals are at work in ordinary human endeavors and her emotions are expressed in physical terms. As Ha's mother sews the small backpacks that will hold everything they take with them when they leave Saigon, \"the stitches appear in slow motion, the needle a worm laying tiny eggs that sink into brown cloth\". When she gives the bully at her new school in Alabama his come-uppance, he looks \"like a caged puppy.\" Righteous indignation is \"an old, angry knot expanded in my throat”, happiness is when \"Mother's lips curl upward\", and anxiety is when \"dragonflies do somersaults in my stomach\" When she screams in anger, \"a lion's paw rips up my throat\" and when she can scream no more and is in the arms of a loving adult, she continues to \"thrash about like a captured lizard\"Lai resists the temptation to lay out the grand narrative of Vietnam, since Ha clearly doesn't have the bigger picture. Instead she interjects key historical facts here and there as Ha hears about them in a more personal context. For example, on her birthday, Ha wishes for her mother to tell her stories of her childhood in North Vietnam, and her escape to the South just as \"the country divided in half...North and South closed their borders. No more migration. No more letters. No more family\". As the family weighs their options, Mother explains life under communism: \"Suddenly Quang will be asked to leave college. Ha will come home chanting the slogans of Ho Chi Minh, and Khoi will be rewarded for reporting to his teacher everything we say in the house\". Thus the reader is given a child-size introduction to the themes of civil war, oppression, and communism without compromising Ha’s naïve perspective.Ha is not preoccupied with the war or politics, but it comes up as “in the distance bombs explode like thunder…distant yet within ears…not that far away after all”, and when the weekly current events time at school is cancelled because the war is the only news. Ha introduces other aspects of Vietnamese life: Vietnamese food, the heat and humidity on a particular day, and her papaya tree. She details how she celebrates Tet, lists the special foods and clothes she enjoys during the festivities, and expresses her smug excitement that although Tet is technically everyone's birthday, she, as the youngest child and only daughter, is allowed to celebrate the anniversary of the actual day she was born.Suspense kept the pages turning even as I wanted to relish the vivid imagery. I found myself biting my nails, wondering: Is Father alive, and will they be reunited? Will the war reach them before they escape? Will they survive the journey? Why does her brother stink? Will their cowboy sponsor in Alabama exploit them? Will the bully clobber her? Will she ever fit in? And ultimately, will they be okay?This story helps the reader empathize with the life of refugees and immigrants, a theme as relevant now as it ever was. I cried, holding the book to my chest, when she sacrificed the only item she brought with her from Saigon by choice in a show of unity with her brother, when she listed what they left behind in Saigon, when South Vietnam ceased to exist, when she ate her lunch in the bathroom at school, when some of the Alabama neighbors refuse to be neighborly, when the bully chased her, when her mother lost her wedding ring, and when they decided to give up hope that her father was alive. I felt completely helpless witnessing her vulnerability as a child, as a defector, as a daughter, as a baby sister, as a refugee, as a speaker of \"second hand\" English, as a small person for her age. I held my breath as she courageously faced each challenge, as some of those who could have hurt her, didn't, and as those who hurt her experienced consequences. I felt her frustration but laughed at her sweetness as she complained, \"whoever invented English should have learned how to spell\".Is this children's literature? It deals with mature themes, but Lai maintains the integrity of the voice by allowing Ha to record in her diary things that she saw or overheard but didn't understand, and giving them a personal context since a child her age would likely not care about the political significance. When Ha quotes her university-age brother saying, \"One cannot justify war unless each side flaunts its own blind conviction” and follows up with her own thought that \"Since starting college, he shows off even more with tangled words,\" Lai doesn't have to interpret. She trusts the reader to understand that Ha admires her brother, recognizes the importance of what he's saying, wants to be a part of the conversation, and bristles at the limitations of her ability to understand.Supposedly, anything can be written more concisely. In Inside Out and Back Again, Lai wrung out every excess word. “It’s over; Saigon is gone”. Supposedly, writing should “Show, Don’t Tell.” Lai tells just enough. We know it’s hot, humid and crowded as Ha’s family boards the boat to leave Saigon because “our family sticks together like wet pages” We know they have become poor because “Mother measures rice grains left in the bin. Not enough to last till payday” Each short diary entry is complete in itself yet serves to hold the narrative.In this quick read, there is enough tension to shred the reader’s nails, enough vulnerability to soften the reader’s heart, and enough humor to dry the reader’s eyes. There is no magic in this novel, no fairy godmother, no imaginary friend. Every situation is no doubt being played out around the world millions of times every day.I loved this book so much that I started reading her most recent book, Listen Slowly. The main character in that book was annoying, which is not unusual in children's literature, but she stayed annoying for too many pages. I felt like she could have been redeemed a bit earlier, and I didn't finish the book to find out when and if she was.",
                "reviewVotes": "106 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "amy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7UUDFCP47ERW52WAU47ZQS7E3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29GXHJ6TCODGJ?ASIN=0061962791",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved",
                "reviewText": "My 10 year old daughter LOVED this book and says it is one of her favorite books ever. Would highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRFUTLRPKZOD5SM2IY4DOYNKZEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37AZJFFOOMODA?ASIN=0061962791",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "4.0 out of 5 stars A good book",
                "reviewText": "The prose was really pretty. I liked the emotion. It was an interesting view of an immigrant family. I really liked the characters.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOATT24JEKYW6OUVUAC7ZDDNUGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TZ644PJIP93G?ASIN=0061962791",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Encapsulating Prose",
                "reviewText": "Fascinating how using such few words paints such visual images, stirring up emotions-proving less really is more. I couldn’t stop reading until finished, I was that enthralled.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6VTEVX6KRLTCALAMBAV2BXWJAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RWUFU41T1643?ASIN=0061962791",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderful story",
                "reviewText": "My daughter reads this book repeatedly. The writing flows and is peaceful for her.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "OpheliasOwn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQLIVRC4THQRBQB2UG2V4WYCJQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33W6G1NKNBW8A?ASIN=0061962791",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2012",
                "reviewTitle": "5.0 out of 5 stars Breathtaking, Heart Stopping, Beautiful, Sad",
                "reviewText": "Every now and then a story comes along that leaves you breathless. It is so beautiful you think about it more and more. Finishing the book doesn't stop you from thinking about it. You tell people about the book, pass it on to others, and think about it some more. This is how I felt about Inside Out and Back Again by Thanhha Lai. I couldn't get it out of my mind.Ha's family is from North Vietnam, but her parents made the decision to leave the north and move south to escape the Communists. Ha's father has been missing for years, but they all hope he will return home one day. Ha knows she should be a good girl, but she can't help it sometimes. During the New Year, she knows her brother is supposed to be the first out of bed in the morning because boys are good luck. That doesn't stop her from putting her big toe on the ground before he gets out of bed. She doesn't like being told girls aren't good luck too. When Ha's uncle tells them they must escape Vietnam as the war comes their way, they reluctantly leave the only home they have ever known.The journey from Vietnam is very scary and involves a ship and the hope of rescue. When they see the American ship, they know they are saved, but their future is uncertain. They wait for a long time to be chosen by an American host family. When they are chosen by a Cowboy, they begin their new life in Alabama. There Ha experiences prejudices and alienation by people who just see her as Vietnamese. As different. She and her brothers struggle to learn English and fit in in this scary new land. Most of all, she misses her father. Ha lives more \"life\" in her few short years than most people live in a lifetime.Inside Out and Back Again is a book written in verse. While the writing reads a lot like prose, enough so for someone to understand it easily, it is still incredibly beautiful and melodious. As you read each short chapter, you find yourself amazed by how powerful each bit is. As with most poetry, each word is carefully chosen for maximum power and effect. No emotion is wasted, no word is unnecessary. The book left me reeling from philosophical statements that force you to examine the world and life as a whole. This is a powerful book that you won't forget for a long time.I would suggest this book for any class or tutoring situation where you will have the opportunity to read it aloud with a child. It is so beautiful and full of discussion-worthy content, you will be happy to spend time picking your way through it. The language is not complex, but the meaning behind it is. The story of a young child leaving a war-stricken land is so foreign to our students it would make a good learning experience as well. They will learn a lot from Ha and her family. In fact, I guarantee they will think about Ha for long after you finish the final stanza.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 24, 2023",
                "reviewTitle": "Brilliant!",
                "reviewText": "So much conveyed with so few words! I loved this book and I will always remember it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pooja Kamani",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 3, 2022",
                "reviewTitle": "Surprised and how because it’s so wonderful",
                "reviewText": "Loved how it is written. Such an innocent story and so well captured. Heartbreaking at a times and funny too. Glad to have stumbled upon this gem.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra V",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 15, 2020",
                "reviewTitle": "Excelente",
                "reviewText": "Muy buen libro, me dejo sin palabras. Aprendes muchas expresiones en inglés. Además, aprendes valores con las experiencias de los protagonistas, sin duda una opción excelente para crecer en todos los sentidos de la vida.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul Watkins",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 23, 2023",
                "reviewTitle": "Beutifully written",
                "reviewText": "Written in poetry-style prose, so a quick read. I picked it up intending to read it over a few nights, like other books, but couldn't put it down. Had to read the whole thing as it was so easy to get immersed in the protagonist, who is a 10-year-old Vietnamese refugee. Highly recommended for all ages 8 and up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suad",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 28, 2018",
                "reviewTitle": "Very profound!",
                "reviewText": "This was a very interesting read. Told completely through verse, it tells such a complete story that I was very impressed and surprised at how much I enjoyed it.This book tells the story of Ha, a little girl, who found herself immigrating to the United States with her family after the fall of Saigon. It is a story about holding on to your past, your home, your family, and struggling to move forward into the future.It is a story that tells the difficult journey of leaving a place you are so attached with to finding a new home in Alabama, learning a new language, making new friends, eating food you are not familiar with and having a new life.It was very heartfelt and very profound, and the fact that it is based on the author's experiences makes it all the more real. I enjoyed it a lot more than I expected to.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}