{
    "remaining_requests": 682,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Unwanted-Stories-Syrian-Refugees/dp/0358452147",
    "body": {
        "name": "The Unwanted: Stories of the Syrian Refugees",
        "price": "$12.88$12.88",
        "originalPrice": "",
        "rawPrice": 12.88,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Unwanted-Stories-Syrian-Refugees/dp/0358452147",
        "soldBy": {
            "sellerID": "A3QKO60TRLL19A",
            "name": "Bridge_Media",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3QKO60TRLL19A&asin=0358452147&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "Only 3 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81A8fqHOXBL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Don Brown",
            "link": "https://www.amazon.com/Don-Brown/e/B001HCY54M/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Yellow Book Sales",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 213,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 14 hrs 29 mins",
            "FREE delivery February 29 - March 5."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b?ie=UTF8&node=28"
            },
            {
                "name": "Education & Reference",
                "link": "https://www.amazon.com/Teen-Young-Adult-Education-Reference/b?ie=UTF8&node=3344092011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Clarion Books; Reprint edition (July 13, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 112 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0358452147"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0358452140"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12 years and up"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 - 9"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.62 x 0.25 x 10.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#424,643 in Books (See Top 100 in Books) #34 in Civil & Human Rights Books for Young Adults #47 in Teen & Young Adult Politics & Government #12,332 in Graphic Novels (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 213 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Montzalee Wittmann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDX66BRR74GD3TQ4EWR44444YUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HGCNQFGBLDFI?ASIN=0358452147",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 17, 2021",
                "reviewTitle": "5.0 out of 5 stars A very hard hitting book! More should read it!",
                "reviewText": "The Unwanted: Stories of the Syrian RefugeesBy Don BrownThis book starts out by explaining how all of it started and escalated. It follows the typical Syrian family or families and how they try to escape and where they would have to go and how. What they would have to encounter along the way. What would be the likely outcome. Where are most of the refugees now? How are they living? Why are they not getting help? All is explained in here in a way that makes sense and none of it is the refugees fault. None! They are trying to survive! To keep their kids alive! I would do the same.It's a heartbreaking thing that's happening and it's the same as South America. But no one wants to help the immigrants that are fleeing for their lives either! Not even the new president. Shameful!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brows by C 😉",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEG6CAHMOKJLPEMUNRZDYUQHFSUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWH47NQVF7IDD?ASIN=0358452147",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2022",
                "reviewTitle": "5.0 out of 5 stars Fast shopping.",
                "reviewText": "Fast shipping. Thank you or thanks Amazon! My daughter needed to read this for a class project that was due on a Monday. Book came Sunday afternoon and she was able to complete her project. Luckily you had the book because Barnes and Noble did not.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "W Ward",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMSAA32A4LVFJUWTCABC6S6GGQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12I0HPM9OQ607?ASIN=0358452147",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 11, 2022",
                "reviewTitle": "4.0 out of 5 stars Great story telling of horrific events",
                "reviewText": "Don Brown illustrates this story very well. This was a required book for my critical thinking class. I had never read an illustrated novel before this, and each page captured my attention until the end. If you want to know some of what the Syrian refugees experienced, read this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Sheehan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJ5KZMN5RZY7ABXSGHGIX7Z37LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SEOR8RQPBJSJ?ASIN=0358452147",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 27, 2021",
                "reviewTitle": "5.0 out of 5 stars Sad but hopeful",
                "reviewText": "I am reading this with a group of students. The pictures aid in comprehension. This is a heartbreaking situation, but the author does a good job of including hopeful tales along with the desperate ones.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cecelia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7YSWPOTAG5DUVPGLHWXNZRB4VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21G8KHLLZSC4O?ASIN=0358452147",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 18, 2022",
                "reviewTitle": "5.0 out of 5 stars Necessary reading",
                "reviewText": "In my spare time, I like to read fiction. If you’re familiar with my blog, you’ll know I especially lean toward the science fiction and fantasy end of the fiction spectrum. However, as a teacher, I must often read beyond my personal preference to find texts that will inform as well as entertain. Add that to the fact that my students prefer graphic novels (and why wouldn’t they – they’re accessible texts!), and I find myself searching graphic novel lists for nonfiction to incorporate in my classroom library. One excellent nonfiction graphic novel I read a few years ago (and put on the bookcase afterward), The Unwanted: Stories of the Syrian Refugees by Don Brown, has been quite popular with my 9th and 11th grade students.Don Brown’s book is haunting nonfiction that outlines the ongoing conflict in Syria and shares individual anecdotes of Syrian refugees fleeing that violence. He keeps the context streamlined – this is not a sprawling war epic, but a general timeline peppered with vignettes to personalize the sheer scope of the war and its consequences. In retelling personal stories of some of the 6 million refugees, Brown does not delve too deeply into sectarian or religious divides, but instead outlines the enormity of the need, and the proportionally tiny U.S. response. The Unwanted is a brutal indictment of American self-absorption.I don’t know what you remember about your teenage years, but I remember having a rapacious curiosity about the world – wanting to know (or experience) all of the things my parents had deemed me too young for, or had perhaps purposely left out of my education. I see that same thirst for knowledge in many of my students: they’re angry at the state of the world, constantly taking in new information, and want to know WHY they were never told about some of the deep inequalities and tragedies of the past and the present. They want to know why we don’t tell the dark secrets – why we aren’t honest. I believe that books like The Unwanted are exactly the sort of texts that we can and should share with children. I don’t mean to prove that we do care, or to absolve ourselves, but to keep stories alive, and to look the truth straight on and without flinching.Brown clearly means for this title to be educational – it is especially suited for use in politics and current events (even years after its first publication!!) units. The content is sobering, tragic, and at times violent. I can envision pairing it with Elie Wiesel’s Night, or in a graphic novel unit with Marjane Satrapi’s Persepolis or Art Spiegelman’s Maus.As a graphic novel, it’s important to address the art style. Brown uses pen and ink with digital paint in washed out colors – a palette of browns and grays for the most part. This color scheme matches the seriousness of the content. Brown’s illustrations are quite spare – facial expressions are not very clearly depicted, and the linework at time feels sparse as well. When first reading the book, I did not love the art style – but I came around – I think it is as necessary and important to the storytelling as the anecdotal, vignette-style prose.In all, The Unwanted is one of the most honest, unvarnished graphic novels for young adults on the refugee experience – and I’ve read a fair few. Its honesty asks something of its reader. I think the world needs more books like it.Recommended for: readers ages 12 and up; it is necessary reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZRJKLFYB2EDR5V3DE2ZKGU5C6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAMXZRVD19K4Z?ASIN=0358452147",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 18, 2019",
                "reviewTitle": "5.0 out of 5 stars This book is wanted",
                "reviewText": "This graphic novel begins with a peaceful drawing of a child and a map with the location of Syria and its cities in the world. It quickly introduces the first act of rebellion against Assad in 2011. Brown jumps right into the brutality of the Syrian Civil War and the dangers that everyday Syrians encountered. There are examples of Assad’s attempts to silence his people and the atrocities acted out upon them, both in text as well as in descriptive drawings. Brown includes a variety of different examples of the ways that people left Syria and where they were going. There is no direct plot line in this story but it flows together wonderfully. There are descriptions of the boats people traveled on their interactions with the smugglers and fellow refugees. Text bubbles provide the reader with the thoughts that crowd the minds of the refugees along with their hopes and desires for a life of safety for themselves and their children. The book includes facts and figures that breakdown the statistics of the refugee crisis. There are pages that show the impact of Islamophobia on the acceptance and help offered to refugees. The book returns to the little girl from the beginning and the hope all refugees share.The Unwanted is a stunning graphic novel that tells and shows the impact of the Syrian refugee crisis. The images depicted show the terror and hope on the faces of men, women, and children as they seek safety in a new land. Don Brown includes facts and figures as he weaves the tales of refugees together. He shares their pain and worries and the harsh realities of what it is like to be a person who has to flee the country that they love. His depictions are factual and he provides a lengthy list of sources and further readings. The images are heart-wrenching and bring to life the sparse text to truly impact the effect of this crisis on the reader. The book is nuanced in its approach to capturing the many lives that have been affected but does a great job at stressing the dangers that refugees face and the risks that they are willing to take. This is a great book to introduce readers to the Syrian refugee crisis and would be a wonderful addition to any classroom.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah Bishar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUF7G4A7VW6YNSK44N2ZWZ2WMMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J6S74DPHS1GN?ASIN=0358452147",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 13, 2020",
                "reviewTitle": "3.0 out of 5 stars Good illustration",
                "reviewText": "I like how the text was formatted and the illustration was unique. It explained thoroughly and showed how people were feeling and thinking.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "9447914010301202202112022021030104197449",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on February 6, 2023",
                "reviewTitle": "Don Brown’s storytelling ability is unquestionable",
                "reviewText": "How ravaged Syria was is a shocking fact to know. What is more shocking, however, is the burden that the surrounding countries bore by accepting Syrian refugees at the expense of the well-being of their people. I do not have the heart to tell the countries which closed the borders to the refugees to open up their borders.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$12.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}