{
    "remaining_requests": 447,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Tattooist-of-Auschwitz-audiobook/dp/B07BYXSLF4",
    "body": {
        "name": "The Tattooist of Auschwitz: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Tattooist-of-Auschwitz-audiobook/dp/B07BYXSLF4",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/5192ZvlVAkL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Heather Morris",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Heather+Morris"
        },
        "brand": "Heather Morris",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 161407,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "This beautiful, illuminating tale of hope and courage is based on interviews that were conducted with Holocaust survivor and Auschwitz-Birkenau tattooist Ludwig (Lale) Sokolov - an unforgettable love story in the midst of atrocity.In April 1942, Lale Sokolov, a Slovakian Jew, is forcibly transported to the concentration camps at Auschwitz-Birkenau. When his captors discover he speaks several languages, he is put to work as a Tätowierer (the German word for \"tattooist\"), tasked with permanently marking his fellow prisoners.Imprisoned for more than two and a half years, Lale witnesses horrific atrocities and barbarism - but also incredible acts of bravery and compassion. Risking his own life, he uses his privileged position to exchange jewels and money from murdered Jews for food to keep his fellow prisoners alive.One day in July 1942, Lale, prisoner 32407, comforts a trembling young woman waiting in line to have the number 34902 tattooed onto her arm. Her name is Gita, and in that first encounter, Lale vows to somehow survive the camp and marry her.A vivid, harrowing, and ultimately hopeful recreation of Lale Sokolov's experiences as the man who tattooed the arms of thousands of prisoners with what would become one of the most potent symbols of the Holocaust, The Tattooist of Auschwitz is also a testament to the endurance of love and humanity under the darkest possible conditions. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10177"
            },
            {
                "name": "Cultural Heritage",
                "link": "https://www.amazon.com/Cultural-Heritage-Fiction/b/ref=dp_bc_aui_C_5?ie=UTF8&node=8946929011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "7 hours and 25 minutes"
            },
            {
                "name": "Author",
                "value": "Heather Morris"
            },
            {
                "name": "Narrator",
                "value": "Richard Armitage"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 04, 2018"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07BYXSLF4"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,454 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #5 in Jewish Literature (Audible Books & Originals) #11 in Jewish Literature & Fiction #13 in World War II Historical Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ashli Lyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHROXYZ54UUDT6D3YW3Q6BQ5GC2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AU82STD4S0JI?ASIN=B07BYXSLF4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful, Traumatizing, & Heroic",
                "reviewText": "Lale is an amazing person and his love and drive is truly inspiring. His love for Gita was something unworldly. Even in the end, the only time he mourned was her passing after living a lifetime with her. I can say this book is truly to moving and heartfelt. There were so many moments where I felt lost and like I needed to stop reading but I couldn’t. Lale and Gita’s story is one I will never forget. It is so easy to forget that these survivors are real and what they went through and unforgivable nightmare. This book is a reminder that even in darkness, you can find light. I’m so glad they found each other. Bless Lale, he is a true hero of war.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth Eyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFULKRGPENTKP5FYILHHD53TNBJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EI7QAUZNA642?ASIN=B07BYXSLF4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Well Written-I Could not Put It Down",
                "reviewText": "Although story is horrible because of all they went through, it is truly inspiring that they had such strength of spirit and will to live. I’m o pleased that photos were included and a well thought-out afterward. The fact that this was a personal account just made it hit home even harder and evokes emotions of sadness for them all but joy that people actually triumphed over these atrocities. I look forward to reading The Three Sisters and Cilka’s journey lol people whom have at least a small connection to Lale and Gita.. Well done. I do not think I have ever read a book this quickly, and attenively. My heart goes out to all those who suffered and those who know them.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JHSiess",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4QWSK6PEY7RKELK2WPE7EKPVSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33P7G6EJE8HPH?ASIN=B07BYXSLF4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2019",
                "reviewTitle": "4.0 out of 5 stars We must never forget which is why The Tattooist of Auschwitz is must-read historical fiction",
                "reviewText": "The book is a fictionalized, powerful account, set during a period of history that must never be forgotten. As the story opens, Lale Sokolov is a dapper twenty-five-year-old ladies' man who has been raised by his mother and sister to dote on and respect women. He enjoys female companion, but has not yet found the woman with whom he wants to spend his life. He is shocked at the manner in which he and the other men on the train are treated, realizing that his life will never be the same, a reality that is reinforced when a number -- 32407 -- is forcibly tattooed onto his arm. \"He grasps his arm, staring at the number. How can someone do this to another human being? He wonders if for the rest of his life, be it short of long, he will be defined by this moment, this irregular number: 32407.\" Lale resolves to survive.Lale's horror is magnified when he is recruited to assist Pepan, the camp's Tätowierer. Pepan assures Lale that he can help him survive. \"You want me to tattoo other men I don't think I could do that. Scar someone, hurt someone . . .\" Papan convinces Lale by reminding him that if he doesn't take the job, \"someone will who has less soul than you do, and he will hurt these people more.\" And so Lale swears to perform the job in the most compassionate way possible, given the circumstances.Morris relates the various ways in which Lale risked his life to help others, and did indeed survive confinement in place where hope was in short order most of the time. By some, he was branded a \"collaborator\" but he used his ingenuity and courage to take advantage of opportunities to save as many others as possible, including the beautiful young Gita with whom he instantly falls in love. She refuses to tell him about her past, her family, where she came from, or even her last name. For Gita it is too painful and she wants to forget because when she is with Lale she is able to escape reality for a few moments. She promises to tell him on the day they leave Auschwitz, but insists they \"have no future.\" Lale refuses to give up, telling her about his vow to survive. \"We will survive and make a life where we are free to kiss when we want to, make love when we want to.\"At its core, The Tattooist of Auschwitz is a love story, illustrating the power of love to provide comfort and distraction through dreams of and plans for the future, inspire selfless and risky action, and sustain and inspire during the darkest hours when it appears that hope is only for the naive or unenlightened.Remaining steadfastly committed to his vow is a challenge for Lale, of course. At times he feels nothing but despair, wondering how he is even \"still breathing, when so many aren't?\" Lale falls into an existence that is comfortable as compared to so many others because, as the Tätowierer, he works with a handful of other prisoners and is removed from the most inhumane conditions to which others are subjected. About that, he feels guilt, especially when he sees others die before his eyes or be brutally herded onto trucks with the knowledge that he will never see them again. Like Lale, Gita is painfully aware of the number of people who have passed through the camps because she works in the office processing paperwork.Lale did, in fact, find Gita after the liberation of the camps, and they married in October 1945. In the camp, Gita told Lale that someday he would honor all of those lost \"by staying alive, surviving this place and telling the world what happened here.\" And he did. \"I need to be with Gita,\" he said. But it was her death that inspired him to at last tell his story. \"He wanted it to be recorded so, in his words, 'it would never happen again.'\"The Tattooist of Auschwitz is difficult to read because of the subject matter, as well as the knowledge that it is largely based upon the actual experiences and observations of Lale, an ordinary man who, like so many others, was thrust into extraordinary and unimaginable circumstances. But therein also lies its strength. Morris relates Lale's story in a straight-forward, unrelenting manner, detailing how he was stripped of his very identity and assigned a number, along with his freedom, dignity, and possessions, and separated from his beloved family, most of whom he never saw again. Morris details, sans judgment, the things Lale did to survive, challenging readers to question what choices they might make.Morris did not visit Auschwitz until 2018. Once there, she stood on the concrete step that led down into Crematoria #3 and apologized, on behalf of Lale, to the 1.5 million people exterminated there. \"He wrongly felt it was his fault that he couldn’t save the souls who died there,\" Morris relates. \"Lale’s motto in Auschwitz was, 'If you wake up in the morning, it is a good day.' He believed you owed it to yourself and those around you to make the day the best it could be.”Through Morris, Lale has at last, and for all time, honored those who were lost \"telling the world what happened\" there.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emily Brozeski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDCEJO2NY6G5S5D7WSRGE3HBT2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J639A9M40TXV?ASIN=B07BYXSLF4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Incredible",
                "reviewText": "Such an amazingly written book. So much emotion, I couldn’t put it down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJSBOXDKIW2CJCOKNLZY7LBIOVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKIVMIL7RWRT4?ASIN=B07BYXSLF4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars such a great book",
                "reviewText": "I thought this was an excellent book. Yea, some parts may be hard for some readers, but these are things that happened, and I don’t feel like that are too graphic or gory. It’s a story and survival and a story about love. Definitely recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thelma",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKPMOKDIKEQOGSG2YF2UTGYA6ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTN6XKKKUY4MB?ASIN=B07BYXSLF4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2021",
                "reviewTitle": "5.0 out of 5 stars Thank you Lale for your Amazing story!",
                "reviewText": "I was waiting to read Three sisters the third book of this series but when I found that I had to read the first three books of The Tattooist of Auschwitz I decided to start from the beginning and pick up the first book of this series.I'm happy that I did that as The Tattooist of Auschwitz was an amazing story and book that I really was missing from it.. this is the story of Lale Sokolov and Gita.Lale was a Slovakian Jew, transported to the concentration camps at Auschwitz-Birkenau on April 23, 1942, with the number 32407. He survived the worst because of his intelligence and charismatic ways to help and see through many of the other Jews and people who were constantly arriving at these camps as well as he spoke many languages that helped him to secure the most valuable opportunities and jobs to survive.Lale was the tattooist of the camp, a job that will provide him with food, jewels, and many favors that eventually can save his life and the life of many others, he trusted many but at the same time, he was careful to continue helping in a low key manner so the SS and the guards will not find out his moves around the camp.Lale's life was not an easy one to learn, what he went through in real life was hard for only one to endure. I was really sad to read many of the things he constantly had to endure thinking how can he still be so composed and not lose his mind? but after all, he was the glue that helped many to survive. I'm glad Lale's family was able to share his story with us. it is many of the amazing stories people have to hear and learn.The strength, the optimist, and the creativity Lale had, the way he was able to help others. people love him as he always brought hope. for sharing his food and many other things the other people needed in the camps, he was a great man.Gita was transported to Auschwitz on April 13, 1942, with the number 34902 she didn't know what was going to happen to her, she only fears she will lose herself in the middle of these walls. she was about to meet the only person that will matter the most and will change her life forever, he was the only one that was able to help her and her friends, he has become the reason for her to continue this journey called life.One of the saddest moments of the book definitely was the Gypsy part. it did break me and made me feel terrible. I wanted to hug Lale at that moment immenselyMany great secondary characters helped to build this world, and helped Lale and Gitas during their journey, and also that contributed to Lale's work and life. Leon, was an amazing help, I cried so much with what he went through, he didn't deserve any of that he was a great friend to Lale, Gita, Dana, Ivana, Cilka, Jakub, even Baretski was a good character.The Tattooist of Auschwitz is the real story of Lale, a man who was kind, empathic, and with a heart of gold that his love for Gita was the only thing that helped him to survive the terrible things SS and the Nazis were constantly doing to them.Amazing book, I can wait to continue this journey.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina L Bloom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJQXOW7LHBYOON2JZLLCJAQVG6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18NNYC10M8XB8?ASIN=B07BYXSLF4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "4.0 out of 5 stars Amazing story",
                "reviewText": "I liked the straightforward story. This is a horrible period of time in history. The story was told but not in great detail, which I appreciated. It was heartwarming ready about Lale and Gita.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martín Lozano",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 5, 2023",
                "reviewTitle": "Muy envolvente",
                "reviewText": "Buen estilo que atrapa.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tanya Burnett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2023",
                "reviewTitle": "A Wonderful Book to add to School reading lists",
                "reviewText": "As time wages on we are losing so many of the people and stories we NEED to hear. Those soldiers that saw so much, lost so much. And especially the results of following blindly, following in fear, and how that following can and did lead to millions of people, mostly Jews, being murdered and thrown away.Seeing what working together to help those in your community can accomplish, helping each other to succeed, then saying that the people that do that are disgusting and because of that they should die.. unfortunately Jews have dealt with that for centuries. Imagine if all the religions were encouraged to support each other and their friends businesses in a healthy way. And then saw how each of those could help each other. And if faith is not your thing, no problem, imagine helping others and KNOWING they would help you.Every biggot and senior in high school should read this, to see how blind faith in a group that would throw you under the bus in a second to protect themselves are not the path that will actually give them happiness or any peace. Believe in what you think is right, ask questions find the truth. This book shows what horrible things being a follower of people that cast blame on anyone but themselves for their own problems can be. When you think of it you don’t hear much about the followers, just the leaders of those groups. The people that we celebrate and truly remember are those that stood against them, who beat them by surviving, who put their lives at risk to do the right thing for your fellow human. Those are who we erect statues for and celebrate. I was raised Catholic and could not follow a doctrine so full of judgement, I believe in faith, and admire those that follow their beliefs in what I think a God of all would want. We are better than we think… keep fighting for the good you",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 21, 2023",
                "reviewTitle": "Conmovedor",
                "reviewText": "Recomiendo esta lectura para a todo aquel que le guste leer sobre el Holocausto. Una historia de amor que se surge y se desarrolla en el peor de los infiernos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B. Steffen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 27, 2021",
                "reviewTitle": "Eine ehrliche und offenbar ungeschönte Geschichte.",
                "reviewText": "Dieses Buch beweist, dass auch mit einem schwarzen Stift in Graustufen gedacht, skizziert und geschrieben werden kann. Im Grunde ist der Held der Geschichte aus heutigen Blickwinkel das, als was er auch selber sieht: Ein feiger Kollaborateur. Doch Schwarz / Weiß ist angesichts des Dramas kein geeignetes Bewertungsmuster. Und so kommt es, dass sich eine helle, leichte, Zeichnung hinter dem Erzählten entwickelt, die den Ausgang der Geschichte bestimmt. Einen Ausgang, der klar besagt, dass ein fester Wille, ein stabiles ethisches Gerüst, Sensibilität und Liebe sich nicht nur auf unsere Überlebenschancen auswirken, sondern auch unseren Weg nach einer schlimmen Zeit mit positiver Energie zu füllen vermögen.Ich bin stolz darauf, dieses Buch gelesen zu haben. Und ich bin traurig darüber, dass wir als Menschen auch weiterhin nicht verstanden haben, wie schmerzhaft Dogmatismus sein kann.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Annu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on July 28, 2021",
                "reviewTitle": "Heart Touching!!",
                "reviewText": "The book has so much memories that one went through during Holocaust. Innocent lives lost, losing loved ones, found love amid survival, heartbreaks, torture, trust and faith, anything you could think of...Highly recommended!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}