{
    "remaining_requests": 621,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Strange-Fruit-Uncelebrated-Narratives-History/dp/1938486293",
    "body": {
        "name": "Strange Fruit, Volume I: Uncelebrated Narratives from Black History (1)",
        "price": "$13.74$13.74$13.05$13.05",
        "originalPrice": "$23.95",
        "rawPrice": 13.74,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Strange-Fruit-Uncelebrated-Narratives-History/dp/1938486293",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71e6P576B5L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Joel Christian Gill",
            "link": "https://www.amazon.com/Joel-Christian-Gill/e/B00JGTXJW2/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by ZBK Wholesale and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 83,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Still more thoughtful reflections come from Joel Christian Gill’s graphic novel Strange Fruit: Uncelebrated Narratives from Black History, which unpacks its power through drawings and pointed text that chronicle the trials and triumphs of black Americans who struggled against prejudice more than a century ago. At a moment when racial inequities have ignited this nation, Mr. Gill offers direction for the road ahead from the road behind. \u0097 The New York TimesThese offbeat stories of heretofore-obscure African-American pioneers are filled with heartbreak and triumph. Without whitewashing the realities of slavery and racism, Strange Fruit has a wry, welcoming tone \u0097 much aided by Gill’s dynamic, inventive storytelling. After reading about such real American heroes as chess master Theophilus Thompson, bicycling champion Marshall \u0093Major” Taylor, and lawman Bass Reeves, I’m eager to learn more!\u0097 Josh Neufeld, writer/illustrator of A.D.: New Orleans After the DelugeBy the time I finished reading Strange Fruit, I thought, let the comic-book sellers have their mythic superheroes; through Joel Gill, we can have our own. But, instead of flying around in capes or spinning webs, the superheroes in Strange Fruit are extraordinary-ordinary black folks making 'a way out of no way.' The difference: they really lived. \u0097 Dr. Henry Louis Gates, Jr. Alphonse Fletcher University Professor, Harvard UniversityStrange Fruit is an evocative and richly illustrated tour through the shadowed corners of Black History. Gill shares these nine stories simply and with deep thoughtfulness and reverence to voices that-- the reader will quickly be convinced-- need to be heard. \u0097 Andrew Aydin, author (with Rep. John Lewis) of March: Book OneStrange Fruit is black history as you've never seen it before. Working with a striking palette of ruby reds, rich browns, bleached-out blues and deep piney greens, author/artist Joel Christian Gill conjures up forgotten firsts and impassioned everymen in a cartoon style that's at once cheeky and epic, naive and majestic. \u0097 The Chicago TribuneIf you think comics and graphic novels are the domain of \u0093superheroes and stuff” and \u0093for kids,” then brace yourself for an epiphany. Yes, you’ll find some superheroes and kids’ comics within these pages, but you’ll also find ordinary people striving for the extraordinary. \u0097 Foreword ReviewsThe short narratives are conversational in tone and the accompanying detailed images convey tragic beauty. Gill doesn’t shy away from portraying brutal scenes, but does so without sensationalism. \u0097 School Library JournalAre you always on your child to READ SOMETHING, anything, except a comic book? Well, Strange Fruit is a graphic historic novel, and you’ll want him to read it. \u0097 Terri \"The Bookworm Sez\" SchlichenmeyerWhat Gill has done in this first volume of his collected Strange Fruit mini-comics is pretty remarkable. He’s infused each of these stories with a huge amount of information, humor for kid readers (\u0093Slavery stinks”), humor for adults (when a child is born it appears to be launched out of the mother by jet propulsion, making the umbilical cord not unlike a bungee cord), and a full spectrum of comics storytelling devices. \u0097 The A.V. ClubReaders of the short stories in Strange Fruit quickly learn to appreciate the playful succinctness of Gill’s iconographic language. He knows when to use humor and sight gags to advance the story. (On the experience of enslavement, Henry \u0091Box’ Brown remarks: \u0091This stinks.’) But Gill knows when more serious cultural cues are needed too, as in the two-page spread where Brown’s body, shown curled inside a wooden box, silently tumbles from slavery to freedom. \u0097The Hooded UtilitarianOne of the most interesting heroes in the book is Marshall \u0093Major” Taylor (1878\u00961932), America’s first black champion in any sport \u0097 and in cycling, no less, which remains one of the least diverse athletic endeavors even today. Just as the bicycle was beginning to play an important role in the emancipation of women, Taylor, known as The Black Cyclone, attained another feat of equality on two wheels as he bulldozed through the walls put up by racism to break numerous world records and win the world one-mile track cycling championship in 1899. \u0097 Maria Popova of the blog, Brain Pickings blogSuperbly penned and illustrated, STRANGE FRUIT: Uncelebrated Narratives from Black History, Volume 1 is indubitably a work of love. Earmarked as one-of-a-kind, this graphic novel is not only an additional masterpiece to black history, but also a delightfully educational read for both young and old. \u0097 Anita Lock of the blog, 20 Something ReadsFrom the original black pro basketball star to a magician’s greatest illusion, become more familiar with these lives which made a positive difference, despite prejudice. \u0097Katie Mack of the blog, YA Love Gill’s book fills a definite void in America’s painfully white history books, but on top of that, it’s just a really good read. Gill doesn’t sugarcoat\u0097not everyone gets a happy ending\u0097but the book is visually witty, engaging, and well researched. History truly comes to life under Gill’s skillful hand. \u0097 Foreword ReviewsAstonishing, inspiring, and enraging true stories from American history that you should have been taught in school. \u0097 UnshelvedThis is a must for all libraries, classrooms and homes. It is the perfect way for all of us to start exploring that shared history we have, in new and different ways. \u0097Nancy Joyce of the blog, What'cha ReadingI was really impressed by this book. Gill clearly did his research to get his point across, and is clearly saying there are more African American people who did cool things that aren’t being recognized. And he’s right. \u0097 Emily Althea of the blog, Fangirls Are WeGill’s graphic novel series is a tool with which to discuss African Americans, social justice and a shared history. \u0097 The Philadelphia TribuneWe need stories of excellence and defiance alongside stories of oppression and Gill provides that much needed complexity by helping readers explore how black people excelled despite systematic oppression, thus adding strength to their already remarkable feats. \u0097 Teach, Think, Sweat blogI highly suggest instead that you read Joel Christian Gill's excellent nonfiction collection of hidden Black American history by the same name, published by Fulcrum [...] You'll be much happier, might learn about some new, real-life heroes, and will be supporting actual diversity in comics. It's a win all around, and shows that discerning comics readers are too savvy to fall into self-congratulatory traps. \u0097 Panel PatterVoted a Great Graphic Novel for Teens by the Young Adult Library Services Association.Chosen as a Summer 2015 Graphic Novel Pick by the Young Adult Library Services Association.Chosen as a Finalist for the Best Young Adult Graphic Novel by the Cybils Awards (Children's and Young Adult Bloggers Literary Awards).Voted a BEA Buzz Book by Shelf AwarenessFeatured on HuffPost LiveChosen by Publishers Weekly for their Notable African-American-Interest Titles of 2014Chosen by the New York Times as \u00939 Books That Would Make Great Gifts”10 Best Indie Comics / Graphic Novels of 2014 by ForeWord ReviewsFeatured on the Black History Month Recommended Reading List from A Room of One's Own BookstoreIncluded on the Top 100 Books for Holiday Gift-Giving from The Milwaukee Journal Sentinel About the Author Joel Christian Gill is the inaugural chair of Boston University’s Master of Fine Arts (MFA) in Visual Narrative and associate professor in the CFA School of Visual Arts. He is also a cartoonist and historian who speaks nationally on the importance of sharing stories. He is the author of the acclaimed memoir Fights: One Boy's Triumph Over Violence, cited as one of the best graphic novels of 2020 by the New York Times and for which he was awarded the 2021 Cartoonist Studio Prize. He wrote and illustrated Fast Enough: Bessie Stringfield’s First Ride and the award-winning graphic novel series Strange Fruit: Uncelebrated Narratives from Black History, as well as three volumes of Tales of The Talented Tenth, which tell the stories of Bass Reeves, Bessie Stringfield, and Robert Smalls. He has just completed the graphic novel of Ibram Kendi's National Book Award–winning Stamped from the Beginning: The Definitive History of Racist Ideas in America, forthcoming in June 2023. Gill has dedicated his life to creating stories to build connections with readers through empathy, compassion, and, ultimately, humanity."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 4 hrs 43 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 9 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Strange Fruit Volume I is a collection of stories from early African American history that represent the oddity of success in the face of great adversity. Each of the nine illustrated chapters chronicles an uncelebrated African American hero or event. From the adventures of lawman Bass Reeves, to Henry “Box” Brown’s daring escape from slavery.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Politics & Social Sciences",
                "link": "https://www.amazon.com/Politics-Social-Sciences-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3377866011"
            },
            {
                "name": "Social Sciences",
                "link": "https://www.amazon.com/Social-Sciences-Nonfiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11232"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Chicago Review Press - Fulcrum; Illustrated edition (May 1, 2014)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 176 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1938486293"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1938486296"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.1 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 8 x 0.5 x 10 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#431,095 in Books (See Top 100 in Books) #40 in Teen & Young Adult History Comics #201 in Educational & Nonfiction Graphic Novels #428 in Historical & Biographical Fiction Graphic Novels"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 83 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/aefaffdf-bdc8-488c-8525-77289d3697f1.__CR0,0,1293,400_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d4f104cb-af4a-4ae9-a7b2-a45412a7bd4a.__CR0,0,1293,400_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5b2e8df2-fd35-46d4-b0dc-622b50d42b43.__CR0,0,1293,400_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d92db768-b7e1-4f43-97b6-6125f6565dfd.__CR0,0,1293,400_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b4ea2ba2-8c36-480e-adff-d5a939caea0c.__CR0,0,1293,400_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ebeth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2WEM4JWTJJGQVGDEE5TSWSHE3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB374DDU5KZUR?ASIN=1938486293",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2014",
                "reviewTitle": "5.0 out of 5 stars A Picture and A Thousand Words",
                "reviewText": "Strange Fruit. I've heard the song and I know the story. These hidden narratives illustrated by Joel Christian Gill bring more light to the experience, and in a method that can be understood not only by the most serious of scholars, but by the 4th and 5th grade student just learning about the history of America and the blood that cries out from her \"success\" story. This book is an excellent way to introduce some issues that most have to search out on their own, in a mutually beneficial way to America and to her citizens. What an awesome talent, to tell the story in this way. Looking forward to Volume II.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynn Lowery",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHOWWIJRMUFOAYYUEYSYMTDCD6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J5L5F359ZYOI?ASIN=1938486293",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2018",
                "reviewTitle": "5.0 out of 5 stars Strange Fruit is a treasure",
                "reviewText": "A great book and am looking forward to Vol. II. Very important for kids and adults alike to learn and appreciate this country's history and the important contributions from African Americans throughout time. It is heartbreaking to understand the meaning of the title. Well done. My only criticism is I would prefer a glossary or section and the back of the book instead of notations in the stories themselves. Highly recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RebesM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6ZUZ4VMO2IUEOU3VMILCD72ZUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37LA33BT5C122?ASIN=1938486293",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2014",
                "reviewTitle": "5.0 out of 5 stars Telling the Never-Before-Told Stories of African American Heroes",
                "reviewText": "When the esteemed Dr. Gates is willing to write a foreword for a book, you know it's something special. And \"Strange Fruit\" delivers - this graphic novel uses amazing illustration and top-notch storytelling techniques to bring to life the untold tales of real-life African American heroes. Racism is shown with menacing illustrations of \"Jim Crow\" - readers of all ages will know just what is being conveyed, and the struggles that beset these amazing Americans. A beautiful and important first effort by an up-and-coming author!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennings Bunn, Jr.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3YI7V27VNVXS7ZJL2B5J2BOHOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22B13266E5JX5?ASIN=1938486293",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 4, 2019",
                "reviewTitle": "5.0 out of 5 stars Excellent Seller",
                "reviewText": "The book is excellent, came on time, in great condition. Tell stories of Black Americans who excelled, or were disrespected. These are all true. Recommended!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elena",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3PLXSZIWXFOMEG6B6TKATRI63Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTKBK1WZY7SHU?ASIN=1938486293",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 20, 2018",
                "reviewTitle": "4.0 out of 5 stars Good Info, Unexpected Comic",
                "reviewText": "I wasn't expecting it to be a comic, but it was still a great read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nathan King",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7RVG2RPUVSWISM2CZRKJLTLODA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OZPX4OWQ5O3I?ASIN=1938486293",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2015",
                "reviewTitle": "5.0 out of 5 stars Amazing Book",
                "reviewText": "This is an amazing book full of stories that have been all too often ignored by the history books. Strange Fruit brings to light these amazing individuals and inspires the reader to want to dig deeper and learn more.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "THOT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWQW6FMOFT2PU474VXPY7DIOFRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X5G5A0CQR5J9?ASIN=1938486293",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 31, 2017",
                "reviewTitle": "5.0 out of 5 stars Bought as a 🎁. I have to read 1st ...",
                "reviewText": "Bought as a 🎁. I have to read 1st. Filled with interesting fact about things thathappened in MA. & NE",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris Henson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBQ57W57YJDMEXYLMRP4LZ3OVBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3S5NV56PQZFH4?ASIN=1938486293",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2016",
                "reviewTitle": "5.0 out of 5 stars Important historical information, beautifully illustrated!",
                "reviewText": "Gill has done an amazing job crafting this book. Each story is a thought-provoking, conversation-starting journey providing valuable insights into the African-American experience. Brilliant. Educational. And vital.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dennis Weir",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 14, 2022",
                "reviewTitle": "Beautiful book, no inscription.😢",
                "reviewText": "I received my copy of Strange Fruit this morning and I am looking forward to reading it, however, unlike the description which claims ‘Inscribed, signed with original drawing’, my first page is, sadly, quite uninscribed. I suggest that in order to prevent further disappointment to eager readers, this enticing bit of information be eliminated to prevent further disappointments to readers. I am still looking forward to reading this!Days Later…I just read Strange Fruit. The art work is stunning, the stories very moving. I want everyone to read it.❤️❤️❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}