{
    "remaining_requests": 554,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Book-Five-Rings-Miyamoto-Musashi/dp/9389440556",
    "body": {
        "name": "The Book of Five Rings (Deluxe Hardcover Book)",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Book-Five-Rings-Miyamoto-Musashi/dp/9389440556",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ENJUHC0eL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31c1SjUilbL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Miyamoto Musashi",
            "link": "https://www.amazon.com/Miyamoto-Musashi/e/B001IYXBKS/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4173,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 13 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b?ie=UTF8&node=1064954"
            },
            {
                "name": "Office & School Supplies",
                "link": "https://www.amazon.com/Office-Supplies/b?ie=UTF8&node=1069242"
            },
            {
                "name": "Tape, Adhesives & Fasteners",
                "link": "https://www.amazon.com/Tape-Adhesives-Fasteners/b?ie=UTF8&node=1069320"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ General Press (September 20, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 82 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9389440556"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-9389440553"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 6.3 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 8.5 x 5.5 x 0.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#44,785 in Books (See Top 100 in Books) #58 in Office Book Rings"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,173 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dark horse",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZIQOQIXBZCUGN7V244WUMHDRLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29UIVXEK1D029?ASIN=9389440556",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars As described",
                "reviewText": "The book came as described and in very good condition. A family member of mine is a huge fan. Thank you for prompt delivery also before Christmas 👍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jack",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQU4OL25V5NGJ6U3I4GIUX3DM3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X37ADV11LHU?ASIN=9389440556",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars It's nice hardcover book",
                "reviewText": "Most of the information you can find on wikipedia, but if you are a book lover, this isn't a bad buy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSA4HZFF62MEFEFO3LBSUM2VPRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W80OIBV56J5M?ASIN=9389440556",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Understand Broadly",
                "reviewText": "I like that the book teaches you strategy of how to fight with short & long Sword. How to take steps and move.This book could have been more detailed but it was done 300 years ago. Wish he explained more about the void book. Wanting more is what makes this book special. Understanding Broadly is what he teaches about strategy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeremy Ellis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4RDD3KTKL4SXBDXFMHP3GZ7KSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J78GRS8949ZZ?ASIN=9389440556",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Insightful, necessary life lessons",
                "reviewText": "I live my life by the ways of Christ. I am also a student of Bushido and this is the bible of samurai!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SCM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVFOB6G56RXONEFTLV26PEXROPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CORA726B387?ASIN=9389440556",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2017",
                "reviewTitle": "5.0 out of 5 stars Immediately Applicable and Relatable for anyone studying strategy or training themselves to find and leverage advantage in their",
                "reviewText": "I would place Musashi-san's Book of the Five Rings on par with classical teachers like Sun Tzu, Laozi. His book lacks detail compared to some of the classics, but that is one of its strengths. He spends approximately 1/6th of the short book on the movements and tactics for sword-fighting, which may be of varying value to readers - depending on their interest on the subject.Sun Tzu's \"The Art of War\" places emphasis on large scale military operations; which lends itself to modern business (in the mind of the reader, and in many modern expositions on a domain-by-domain basis) - supply chains, market saturation, globalization, operational budgeting, etc., Musashi-san's \"Way\" is likewise applicable. Musashi-san focuses on large scale and small scale (individual) battle, offering useful comparisons and contrasts. For me, the individual focus was extremely insightful and personal. It may suit individuals who have situations of high responsibility or discretion (e.g., negotiations, debate, martial arts, software development), or cases where an individual does not have an abundance of resources or allies - and opportunity is gained through competition.The book is highly quotable, and I found myself reading this short <100 page book over a month's time because every few pages gave me something to think about, research, mull over, and discuss. Almost paradoxically, his vagueness and insistence that the reader practice, research, and train builds toward a thesis - \"By learning one thing, one should know 10000 (myriads).\"As a retired IT person and CIS college instructor - my lesson on any topic was not to memorize procedures or things easily looked up in technical references; but principles, how information flows, how to identify processes (and problems in them), to detect the presence of patterns, or put simply \"How is this problem or system similar or different from others you've encountered. I wish I had known about this book sooner, as he does an excellent job demonstrating this approach to learning.",
                "reviewVotes": "114 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William J. Bahr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIRZVPIH3T2WT7Z3ZKVGGBSL3YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12V4GLCBGYA7U?ASIN=9389440556",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2022",
                "reviewTitle": "3.0 out of 5 stars A classic?",
                "reviewText": "So what are the five rings? The book never says. But certainly not the traditional (from 1912) five Olympic rings said to signify the five continents at the time: Africa, Asia, Europe, Oceania (Australia and New Zealand), and the Americas. Most probably the rings signify five scrolls (viewed as chapters or sections): 1. Earth (intro with housebuilding metaphor of martial arts, leadership, and training); 2. Water (basic techniques and fundamental principles); 3. Fire (heat of battle and timing); 4. Wind (style), and 5. Void (mindlessness; muscle memory?).To expand on “ring” 1, Earth, here is some general advice in the way of principles from the author:1. \"Do not think dishonestly.\"2. \"The Way is in training.\"3. \"Become acquainted with every art.\"4. \"Know the Ways of all professions.\"5. \"Distinguish between gain and loss in worldly matters.\"6. \"Develop an intuitive judgment and understanding for everything.\"7. \"Perceive those things which cannot be seen.\"8. \"Pay attention even to trifles.\"9. \"Do nothing which is of no use.\"Yes, the book does deal with swordsmanship instruction and mentions the author’s success with a combination of a long and short sword, but recommends only practicing with the long sword and then with just one hand. Unfortunately, no illustrations are available, and the reader is probably left clueless as to what is advised for the best Samurai sword-fighting technique ever, carrying the author to winning sixty-one duels and writing his book around age sixty-one, dying shortly thereafter in 1645 AD.Here is some advice throughout the rest of the book: Generally speaking, the Way of the warrior is resolute acceptance of death. Think broadly (in high-level concepts). Think calmly. Disrupt your opponent’s plans and techniques. Strike when he is undecided. Divide and conquer. Put your opponent into inconvenient positions. Discover your opponent’s weaknesses and attack weak points. View the situation from your opponent. Surprise your opponent. Emotions can be catching: throw physicalities and emotions such as yawning, sleepiness, and calmness onto your opponent; then strike. It is often easier to not attack directly; go indirectly…for the “corners.” Shouting can cause confusion in your enemy. Maintain the initiative; don’t let your enemy recover from a strike. Don’t become preoccupied with small, irrelevant details; move to a higher perspective. Confuse, irritate, and terrify your enemy. Become familiar with all aspects of your opponent; don’t focus on any one particular thing, but the whole person and situation. Seize upon your enemy’s disorder and derangement, and so destroy his hope of recovery. Practice; learn, think. Do not be influenced by your opponent. Train diligently to attain this spirit. Know as much as you can about relevant things.IMHO, beyond these widely known strategic concepts, the author does not go into much useful detail. He makes no apology for this, often leaving you with just a comment equivalent to “Go think about this for a while.” OTOH, if you’re not familiar with the above concepts, perhaps buying the Kindle version of the book for ninety-nine cents might be a worthwhile investment.Of possible interest, here’s another book, one that does give specific examples of strategy, tactics, philosophy, and even swordsmanship, and derives universal, memorable lessons therefrom: Strategic Advantage: How to Win in War, Business, and Life",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shawn PethelShawn Pethel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL3LZNLVTFI4P3FQ2H6X6Q7VGCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSFGDOZRHSWXA?ASIN=9389440556",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Wowoowowow!!!!!!!!!",
                "reviewText": "It's a nice hard back and has beautiful pictures and illustrations in it as well as including all five books of the five rings it also has some delightful insight that wasn't in some of the other books",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71T-glQjrOL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "J.F.C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJKTGM2NQPJQDH65PGMFPFVUCLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SA722P8MV2GI?ASIN=9389440556",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2023",
                "reviewTitle": "5.0 out of 5 stars GREAT FOLLOW UP TO THE ART OF WAR",
                "reviewText": "SHORT, METICULOUS & TO THE POINT. WARFARE FROM A SAMURAI PERSPECTIVE. THE ART OF WAR WARFARE FROM A GENERAL PERSPECTIVE. BOTH BOOKS ARE A MUST READ & LISTEN TO.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nooh Muhammad",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 24, 2023",
                "reviewTitle": "Intellectual read",
                "reviewText": "It’s a bit of a boring book but you need to persevere through that to understand it’s meaning.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Markélov",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on July 8, 2023",
                "reviewTitle": "Not Worth Your Money - Choose a Different Edition",
                "reviewText": "I recently purchased \"The Book of Five Rings: The New Illustrated Edition\" by Miyamoto Musashi, and I can only express profound disappointment. The quality of this edition is nothing short of a disaster, severely lacking in both aesthetic and literary standards.Firstly, the book's size is an impractical A4. Combined with paper of such low quality that it feels thin and cheap, the physical presentation is a letdown.Unfortunately, the misrepresentation doesn't stop at the physical properties. This edition is advertised as an \"Illustrated Edition\", which naturally led me to expect a generous inclusion of images that would enhance my understanding of the text. Sadly, the reality was far from it. The book contains a mere five black and white images, making the 'illustrated' claim a gross exaggeration.Most egregious, however, are the numerous spelling mistakes and text formatting issues that are littered throughout the book. Reading it feels like navigating through a maze of typographical errors that makes an otherwise enriching experience into a chore.It's quite shocking, but it feels like someone hastily copied the text from a legitimate version of the book into a word document, failed to run a simple spellcheck, and rushed it into publication for quick profit. This lack of care and respect for the material is blatantly apparent and enormously frustrating.In conclusion, I would strongly advise potential buyers to steer clear of this edition. It is a poor and disrespectful representation of Musashi's timeless classic. Don't waste your money on this subpar product. Instead, invest a bit more in a quality edition that truly honors the stature of \"The Book of Five Rings\". The higher cost will be more than justified by a vastly superior reading experience.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "5 star",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 6, 2023",
                "reviewTitle": "Content",
                "reviewText": "I liked the content",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Djimbus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 12, 2023",
                "reviewTitle": "Typo",
                "reviewText": "The fact that I got this book for about 4 bucks is great, but the spelling mistakes and typos really make it hard to really immerse myself fin the book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kunde2003",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 5, 2022",
                "reviewTitle": "Inspirierend",
                "reviewText": "Sollte man gelesen haben",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}