{
    "remaining_requests": 508,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Invisible-Child-Survival-American-Pulitzer/dp/0812986954",
    "body": {
        "name": "Invisible Child: Poverty, Survival & Hope in an American City (Pulitzer Prize Winner)",
        "price": "$10.89",
        "originalPrice": "",
        "rawPrice": 10.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Invisible-Child-Survival-American-Pulitzer/dp/0812986954",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81JoiixH2lL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Andrea Elliott",
            "link": "https://www.amazon.com/Andrea-Elliott/e/B091GKXPLQ/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 2556,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b?ie=UTF8&node=2"
            },
            {
                "name": "Community & Culture",
                "link": "https://www.amazon.com/Ethnic-National-Biographies-Memoirs-Books/b?ie=UTF8&node=2365"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Random House Trade Paperbacks (May 17, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 640 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0812986954"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0812986952"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.2 x 1.27 x 7.97 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#20,839 in Books (See Top 100 in Books) #15 in Poverty #29 in Sociology of Class #103 in Black & African American Biographies"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 2,556 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1ea4d7ba-c6d2-4773-83b0-523dd24aee06.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d34a9037-fec7-456f-b571-5029d4f69b43.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b510d406-aaad-408d-9087-001a537efd30.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2cec2fff-feee-4239-abe6-3eefc54e94fc.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mark Oresic",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDPT7MY6TYHWMYKVVKRLVSET5FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18YRRNMQMH55G?ASIN=0812986954",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2021",
                "reviewTitle": "5.0 out of 5 stars An Exposé on Systemic Racism",
                "reviewText": "This book review is for; ‘Invisible Child: Poverty, Survival and Hope in an American City’; by Andrea Elliott. // Its publication or release date was October 5, 2021; and it showed up on my doorstep on the same day, having pre-ordered it from Amazon; and while I’ve written book reviews before on Amazon, this review is a first of its kind in that I’m submitting this review prior to completing the book. // I was highly motivated to buy the hardcover of this book, and two others, all of which share a somewhat similar theme about ‘Critical Race Theory’ and ‘Systemic Racism’. Two things in particular, motivated me; 1) since both of these culturally sensitive topics are currently being hotly contested, specifically in relation to their validity or the lack thereof, I’ve decided to do my own research on these topics, in order to purposely cut out all the static, noise, and vitriol, from those adamantly against these two topics getting a fair hearing by all those like myself who care and want to educate themselves on these crucial issues, especially during these turbulent times when so called ‘American Patriots’ honestly think that loyally serving their country equals getting involved in an ‘Insurrection’ and/or ‘Domestic Terrorism’; or who hold so called sincere sympathies with those who were involved in the highly questionable behavior in and around the U.S. Capital on January 6, 2021; and, 2) the second motivation to purchase this book was found within just one paragraph within a recent (9-28/10-1-2021) New York Times article, titled: ‘When Dasani Left Home’, which was written by this book’s author (Andrea Elliott), which singular paragraph in its entirety is quoted as follows: “Dasani’s roots in Fort Greene (Brooklyn, N.Y.) reached back four generations, to her great-grandfather Wesley Sykes, who left North Carolina to fight in Italy with the Army’s segregated all-Black regiment, the Buffalo Soldiers. After returning home in 1945 as a triple Bronze Service Star veteran, Sykes married and migrated north to Brooklyn, where it was nearly impossible for a Black family to get a mortgage. While the G.I. Bill lifted millions of white veterans into the middle class – helping them go to college, start businesses and become homeowners – Black veterans were largely excluded. Sykes, who was trained in the Army as a mechanic, wound up mopping floors and pouring concrete in Brooklyn, working more than 30 low-wage jobs. He and his wife, Margaret, settled for a rent-subsidized apartment in Fort Greene Houses, the complex Dasani would come to know as ‘the projects’.” // Having finished this quoted paragraph, I ask the reader of this review to carefully read the above quoted paragraph a second time to purposely try to discover all the myriad ways in which Systemic Racism is being exposed and described therein. // My simple proposition is as follows: If racism is indeed a long standing problem in America; then it stands to reason, that the first step toward finding substantial solutions to eradicate or at least mitigate the destructive consequences of same, would be to inform and educate ourselves about the twin topical issues – Critical Race Theory and Systemic Racism – of our current socially and politically turbulent American culture. // In my limited opinion, this book, ‘Invisible Child’, has more to do with Systemic Racism, than Critical Race Theory, particularly in the form of an exposé which expertly serves to highlight the destructive multi-generational effects of Systemic Racism; and to that point, before closing this review, I would like to recommend two very good books dealing directly with Critical Race Theory, as follows: 1) ‘Critical Race Theory: An Introduction’; by Richard Delgado and Jean Stefancic; 3rd Edition; Copyright 2017; New York University Press; and, 2) ‘Critical Race Theory: The Key Writings That Formed The Movement’; Foreword by, Cornel West; Edited by, Kimberlé Crenshaw, Neil Gotanda, Gary Peller, and Kendall Thomas; Copyright 1995; The New Press, New York; ISBN 978-1-56584-270-0 (hc.); ISBN 978-1-56584-271-7 (pbk.).",
                "reviewVotes": "74 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jayde Casper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXQQBJNRMW4DQOLFJYS25DNYHVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L0JSJIFQUUN0?ASIN=0812986954",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing book",
                "reviewText": "Amazing book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S.R.O.N",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPMU2RA65YY2PO2ONUM4WU37LWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20I1ZLDF9UYMA?ASIN=0812986954",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "5.0 out of 5 stars O",
                "reviewText": "I consider myself a member of a society that is aware of the struggels of everyday people. This book however took me on a journey that made me realized that as a socitey we are and have continued to fail some of our percious population. Despite all the agencies, efforts and of individuals the core issues still remains.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GadgetChick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHCSU56FVK7FTHBABKONNRDKOGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YTKQDOUSFD77?ASIN=0812986954",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2022",
                "reviewTitle": "4.0 out of 5 stars An excellent story of one girl's life, but a story that will unfortunately repeat, over and over",
                "reviewText": "I had read Andrea Elliott's stories about Dasani in the NYT as they were being published, including her update as Dasani reached young adulthood. I bought this book as I was interested in reading the story as a continuous narrative, and also getting some additional context based on content Elliott was not able to include in the NYT stories. So I did not go into this book expecting to be surprised by any aspect of the story.What was surprising to me is that I realized, as I read the book, I had read this story before - and I'm not talking about the NYT coverage. I had read this same story when I read The Glass Castle by Jeannette Walls; I had read this same story when I read Random Family by Adrian Nicole LeBlanc. I read it when I read There Are No Children Here by Alex Kotlowitz, and I read it way back in the mid 1990s when I read Myth of the Welfare Queen by David Zucchino. Black families, white families, brown families; Appalachia, Philadelphia, Chicago, New York. Alcohol, heroin, crack, opioids. The stories are all different, and they are all the same. Here is the story.Two people who are emotionally unstable, addicted to substances, or both, meet, and have many more children than they are capable of taking reasonable care of. The children are not conceived accidentally - in fact, at least some of the many children are intentionally conceived to fill emotional holes in the lives of the parents, and some others are intentionally conceived to obtain more benefits for the parents (which are not always the ones issued by the government). The parents use drugs and/or alcohol; they stop using drugs/alcohol briefly; they get jobs; they lose jobs. They move their children from place to place to place, making it so the children cannot maintain ties to any adult or child other than their parents or siblings - this, too, is partially intentional. The children develop insecure, unhealthily codependent bonds with their parents and to their siblings. The family dysfunction continues until the children reach adult age, at which point, some of the children escape the prison of their family - and some do not. For the children who do not escape, they begin the cycle again, by having their own children they cannot adequately take care of.Every single book I listed above (with the exceptions of the Walls memoir, but this kind of comes through in her book as well) contains a thesis about how it's simply the lack of money that necessitates that children like Dasani must grow up in desperate circumstances, lacking the basics of daily living that most of us take for granted. Unfortunately, in every single book, at some point it becomes clear that there is no amount of money that would have fixed the lives of the children. Because in every single book, at some point, the adults in charge of the childrens' lives receive cash assistance, or rent subsidies, or even windfall cash - Dasani's family received all three simultaneously, at one point - and yet their problems don't get fixed. It's not just the lack of money that creates a family like Dasani's, and indifference to the poor doesn't create the situation that Dasani found herself in as a child (in fact, once her story appeared in the NYT, many people stepped forward to offer financial assistance to her and her family). Families like Dasani's - and like Jessica's and Coco's in Random Family, and like Jeannette Walls' in The Glass Castle, etc. etc. are created by people who are incapable of being good parents deciding to have many children they cannot take care of. It's not a very politically-correct conclusion in this day and age. But over, and over, and over, we see it is the truth.The book offers no such conclusion (not surprising), and points no fingers at anyone but New York politicians, or Capitalism, or Society, as responsible parties in creating Dasani's terrible childhood. When it's clear to me - and other people quoted in the book - that the responsible party is Dasani's mother, Chanel, enabled by her stepfather, Supreme. Chanel at one point is receiving a generous rent subsidy that allows her to house her family in a decent home in Staten Island, along with cash assistance, and then gets an inheritance from her mother, and still cannot pull herself together to create stability for her family. (In Random Family, people receive windfalls of as much as $70,000 and squander the money quickly, instead of using the windfall cash to create stability for their children and grandchildren. In Walls' book, her parents inherit her grandmother's considerable estate and squander it, ending up in worse poverty than what they'd experienced before.) What seems clear to many people featured in the book - the principal at Dasani's school; the coach of Dasani's performance team - seems to elude the author: Dasani's problem is her parents. At one point, Dasani's principal says that she cannot think of another parent of a child in the school as irresponsible as Chanel. Yet Elliott repeatedly gives Chanel a pass on her abominable selfishness, irresponsibility and callousness toward her own child, because apparently, its everyone's fault that Chanel acts like this - everyone, that is, except Chanel.I don't think income inequality is a good thing. I believe that the kind of assistance that was provided to Dasani's family is a worthwhile thing for our society to provide to many impoverished people. I do believe we have a responsibility to care for the less fortunate in our society, especially those who take steps to help themselves. What I don't believe is the author's thesis that somehow, it New York City's fault that Dasani was raised not just in poverty, but in an unstable, desperate, abusive, neglectful, shamefully inadequate situation. The minute Dasani was born to Chanel, and Chanel decided to parent Dasani instead of relinquishing her for adoption, the die was cast. Dasani had no chance. All that could have changed Dasani's destiny would have been the much-earlier intervention of ACS into her life, removing her from her mother's indifferent and haphazard care. That didn't happen. So here we are.The book is a worthwhile read, but by continuing to blame Society, or Rich People Who Don't Care About the Poor, or Gentrification, or whatever other nebulous bogeyman the author can think of, we give parents like Chanel a pass, and thus guarantee that there will be infinitely more Dasanis of all races, religions, geographic regions, etc., growing up in poverty, unable to escape their dysfunctional families. Unfortunately, at this point, after nearly 30 years of reading these stories, I have no faith in the idea that we can stop this from happening. I think this is honestly just part of our human condition - Dasani's tale is one as old as time.",
                "reviewVotes": "119 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXJYKKRO7XK5QLCR72DID5YSHPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM4XQH4WTKDRS?ASIN=0812986954",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "5.0 out of 5 stars REPEATED ERRORS:",
                "reviewText": "Bless these children for. Beating the messed up system. what hard lives they have had, more help to parents would have helped in my thoughts..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 22, 2023",
                "reviewTitle": "learning a lot",
                "reviewText": "Touching & moving. A glimpse into lives of children and family, with historical and sociological analysis provided.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amruta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 22, 2023",
                "reviewTitle": "So called pampered poor!",
                "reviewText": "I see drug addiction and irrationality as the issues here, not the poverty. Irrationality to have 8 children when unable to feed them, not gaining meaningful employment, leaving a good school for street life! Birthing children when unable to properly look after them should now be considered as a crime.Lost all sympathy when Dasani left the Hershey'sand joined the reds.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 30, 2022",
                "reviewTitle": "Une oeuvre indispensable !",
                "reviewText": "Une œuvre magnifique, indispensable et au-delà du récit de résilience , universelle !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HL",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 7, 2022",
                "reviewTitle": "Fascinating, maddening and utterly absorbing",
                "reviewText": "Don’t be put off by the length - this is an absorbing read and one which has you cheering and shouting in equal measures as you watch both ‘the system’ and Dasani’s family shape her future in varying measures at different times. It is heartbreaking that this story is so current and whilst the author obviously has her views, I feel that the writing was sensitive and balanced. I urge you to buy it.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheri",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 30, 2022",
                "reviewTitle": "A masterpiece",
                "reviewText": "Brilliantly written account of one family’s struggles with homelessness, various public assistance programs and desperate poverty, all while maintaining deep family bonds. Mandatory reading for those who have never been hungry or experienced housing insecurity, this book races along like a gritty urban novel but leaves the reader with a strong understanding of life without privilege but with plenty of racism and judgment.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}