{
    "remaining_requests": 510,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Drawing-Words-Writing-Pictures-Graphic/dp/1596431318",
    "body": {
        "name": "Drawing Words and Writing Pictures: Making Comics: Manga, Graphic Novels, and Beyond",
        "price": "$29.65$29.65",
        "originalPrice": "",
        "rawPrice": 29.65,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Drawing-Words-Writing-Pictures-Graphic/dp/1596431318",
        "soldBy": {
            "sellerID": "A1C3QU77DDT2KW",
            "name": "indoobestsellers",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1C3QU77DDT2KW&asin=1596431318&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71oZmz8-5qL._SX679_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jessica Abel",
            "link": "https://www.amazon.com/Jessica-Abel/e/B001IODR6G/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Good_oldbooks",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 209,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$3.99 delivery February 29 - March 7.",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 14 hrs 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "History & Criticism",
                "link": "https://www.amazon.com/History-Criticism-Literature-Fiction-Books/b?ie=UTF8&node=10204"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ First Second; First Edition (June 10, 2008)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1596431318"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1596431317"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 15 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.79 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 9 x 0.65 x 12.1 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#72,902 in Books (See Top 100 in Books) #4 in Comic & Graphic Novel Literary Criticism #9 in Comics & Graphic Novel History & Prices #16 in How to Create Comics"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 209 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Matthew Grant",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGF2QRIL5EA3MUYT3XVWTHJWAL2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19PN1POE3SU6?ASIN=1596431318",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2019",
                "reviewTitle": "5.0 out of 5 stars Book is absolutely incredible, physical format is a tad frustrating...",
                "reviewText": "In the vast sea of How-To comics books, this is a gem. Most books are pretty much the same re-hash of material with a different face. Here's basic tools, here's basic anatomy, here's basic perspective, here's a little figure drawing, tweak to fit a genre, done. So many of these books are out there. Few and far between, however, are books that actually offer new and more in-depth information about comics creating that can't really be found elsewhere. This is that book. This book really breaks down what makes comics and goes in depth with the various techniques involved with creating comics (both writing and drawing). It goes beyond the simple, this is how you draw, or this is what you should be making marks with, and really tells you useful things that are applicable to the actual work involved with producing comics. I keep coming back this book (and it's sequel) and picking up new information. Comics is a journey and it's nice that there is a book out there that really has something to offer for comics creators.That said, the physical format of the book is a little frustrating. It is super wide (24 inches when open), and completely awkward to read unless you have it laying down on a desk or a table. I'm not really sure why they do this -- I feel like they could have easily made it into a more convenient shape -- there are frequent instances of pages where there is only a little writing in the corner with vast blank areas, so I'm just wondering... why?!? I dunno. I want to read this on the sofa, or in a chair and it just flops everywhere. A little frustrating.That's my only gripe about this book though. I won't knock it any stars for that. The information inside this is well worth the struggle to read it. If you are a comic creator, you really should not be without this book. I would say it is a must have.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Parka",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZIEKUO4V2R3Q3ZBWOBJRJQQL4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10L2OLXGT8D38?ASIN=1596431318",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2010",
                "reviewTitle": "5.0 out of 5 stars Almost like attending a real life course",
                "reviewText": "The media could not be loaded. Drawing Words and Writing Pictures is more of a course that a book on drawing comics. The authors Jessica Abel and Matt Madden, both comic artists and teachers, have designed the book to follow a 15-week semester. It's easy to follow and each lesson builds on the previous.The course is comprehensive and covers everything from paneling, storytelling, transitions, lettering, inking, character development, etc. Basically every form of education you need to create your own comic.Each lesson has plenty of illustrated examples from the authors and other artists like Craig Thompson, Osamu Tezuka, Paul Pope, etc. You're exposed to many styles, genre and ways of creating comics. The instructions are so clear it's almost like hand holding, but of course you still have to do all the hard work. And the lessons end with homework so you can actually practice what was taught -- practical.This is a really helpful guide on drawing comics. Highly recommended to aspiring comic artists. Well worth the price.This is as close as it can get to attending a real comics drawing class.(More pictures are available on my blog. Just visit my Amazon profile for the link.)",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/A1UndIjMDqS.mp4"
                }
            },
            {
                "reviewerName": "John Aquino",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQGEX22DXDBLWI2QXTE5XAVJ4SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3700DU4LJ52PX?ASIN=1596431318",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 21, 2021",
                "reviewTitle": "5.0 out of 5 stars Delivered Promptly & In Excellent Condition",
                "reviewText": "Regarding the book:Drawing Words and Writing Pictures: Making Comics: Manga, Graphic Novels, and BeyondIt got here quick, without any noticeable damage.The chapters seem to be thorough in explaining each aspectof creating comic book art.The generous quantity of illustrations to demonstrateare helpful too.I especially like the diagramshowing what to expect from dip pen nibswhen it comes to how they performand how they feel when using them.Overall, a good product. :-)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jack HinkJack Hink",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5DLUSUXXJQNBOH3GRQUN2M6CYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZCXKJ4DS33Q8?ASIN=1596431318",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2017",
                "reviewTitle": "4.0 out of 5 stars A Teacher's Perspective",
                "reviewText": "95% of artists who completed course this would find themselves improved.The type is indeed too small and the space not always well used.The tone is friendly, personal, non-pedantic. I think the opening section, analyzing what a comic is, and comparing the different names for comics in different languages, IS interesting. More importantly, it gets you thinking--fundamentally--about what it is you're about to get into.If one struggles through that (brief!) opening part, finding it too heady, not entertaining enough, one may not have the optimal mindset for getting the value of this book. Yet still benefit from it.Drawing Words and W;riting Pictures wisely suggests specific ways of \"socializing\"your comics learning, and does all it can to compensate for the lack of an in-room teacher. Kudos! The material on Character and narrative arc are wonderful and rightly presents those two topics almost in tandem.I love that a section on inking is titled \"Softening the Black.\" That gets at the purpose of almost all the tools and techniques of inking. It's a fundamental insight that I don't think you'd find in any other such book.Abel and Madden guide you in practical matters, like setting up your inking kit and working area, doing exercises, caring for your back.The weakest part I think is the chapter on lettering. Abel and Madden come at comics from a Europhilic, Fantagraphics-y mindset that emphasizes sincerity and sweat over polish and efficiency and urge people to learn hand lettering. Fair enough. The rules of lettering are the same -- or most definitely should be -- but the book's lettering dos and don'ts are near-non existent.Incredibly, some of their illustrations feature the roundly and justly reviled font Comic Sans! Equally bizarre, to anyone with even a semi-professional background, they don't know and don't teach the rule on how to use serifed capital Is. Nothing shrieks \"amateur\" in work samples like seeing that serifed I in the middle of a word.They say you can get a font made of your hand lettering (a great idea), but don't say where.Another weakness is that--like a million how-tos before-- this book shows you 6 or 7 different mouths, for example, IN ISOLATION and moves on. Faces are way too important to be given this once-over lightly treatment. Here is where the authors should have looked to the world of animation to show how features interact and contribute to an overall attitude/expression. See the immaculate attachment from Disney's Big Hero 6. On the plus side, they do talk about how other parts of the face can affect the shapes of eyes.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71LpqQBbO9L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 7, 2022",
                "reviewTitle": "Excelente",
                "reviewText": "Es un curso excelente. Desde el primer momento es totalmente práctico. Sea cual sea tu nivel de dibujo, comienza de una vez a establecer escenas y dibujar situaciones, lo que te despega el miedo a la página en blanco. Excelente para mí que me estoy iniciando",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pastedechouan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 29, 2020",
                "reviewTitle": "A masterpiece",
                "reviewText": "I do not understand the negative or hesitant comments about this book. It is a real masterpiece. A compendium of information that was very difficult to get before. People who were born with the Internet and the possibility of getting everything at the click of a button don't realize how lucky they are. This book (and its companion) is an event in itself.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 9, 2019",
                "reviewTitle": "Valeu a pena",
                "reviewText": "Muito bom para iniciantes na arte de HQ.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "karen voncripps",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 27, 2014",
                "reviewTitle": "The US is better (with some research) at training artists to make a ...",
                "reviewText": "I am working my way through this book. I am learning as i go. When i am done, i plan to get my story and start...this book is divided into lessons. the writers have been there, done it and now teach it. This is their lesson plan. The US is better (with some research) at training artists to make a living out of art, what was once called 'commercial art'. Hers in the UK, not so much. And the information can be hard to find and learning a battle. If you want to do a graphic novel, get this book. The information you will get is great, the structured lessons will teach you something, and that is what you need.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan L. Werneck",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 1, 2018",
                "reviewTitle": "Manual prático para curso de quadrinhos",
                "reviewText": "Ótimo livro para aprender mas também para ensinar quadrinhos, dividido em 15 aulas. Pode ser usado tanto por pessoas estudando por conta própria, em grupos, ou em sala de aula. Propõe muitos exercícios e questionamentos interessantes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$32.61",
                "sellerName": "Prime Deals, USA",
                "sellerRating": "4.5"
            },
            {
                "price": "$38.34",
                "sellerName": "Publisher Direct",
                "sellerRating": "4.5"
            },
            {
                "price": "$40.47",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}