{
    "remaining_requests": 452,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tiger-Bravos-War-Divisions-Wandering/dp/0998854204",
    "body": {
        "name": "Tiger Bravo's War: An epic year with an elite airborne rifle company of the 101st Airborne Division's \"Wandering Warriors\", during the height of the Vietnam War",
        "price": "$12.99$12.99",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tiger-Bravos-War-Divisions-Wandering/dp/0998854204",
        "soldBy": {
            "sellerID": "AXYZZR3H84CRD",
            "name": "Valentines 01",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=AXYZZR3H84CRD&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/516fBR6fhcL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61MA8ZOlOvL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Rick St John",
            "link": "https://www.amazon.com/Rick-St-John/e/B001K8SEGI/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Valentines 01",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1035,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 13 hrs 2 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 2 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 13 hrs 2 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2"
            },
            {
                "name": "Leaders & Notable People",
                "link": "https://www.amazon.com/Leaders-Notable-People-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2396"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Currahee Press LLC (August 22, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 356 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0998854204"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0998854205"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.05 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.81 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#109,892 in Books (See Top 100 in Books) #75 in Vietnam War Biographies (Books) #105 in United States Military Veterans History #198 in Vietnam War History (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,035 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Scott Hedegard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRMXB6VJSXLKRDICWOU7KYC2OXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VSRAOERE7AA9?ASIN=0998854204",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 21, 2020",
                "reviewTitle": "5.0 out of 5 stars One of the great war time books ever",
                "reviewText": "Most of us have seen a bumper sticker Vietnam vets sometimes have on their vehicles: \"If you didn't go, you wouldn't know\". I am a acolyte of that particular expression, and my decision to first read Stanley Turnow's great book on Vietnam from the view of the various nations whom, without a single exception tried over the millenia to control this tiny strip of jungle and mountains bordering the South China Sea. What they did not realize, or learn, including the United States, is that the Vietnamese were a proud people, full of their own traditions, religious beliefs, customs, etc. and were particularly ferocious when it came time to defend their land. Turnow would examine the history of this little nation thoroughly through the eyes of the big shots, so to speak, who in typical arrogant and detached fashion thought lives of soldiers conscripted or enlisted to try to impose their rule were just so much gun food. John F. Kennedy for all his adulation we hear today, was very adamant about going there, first under cover of advisors, but he wanted war. Bobby Kennedy was all for it, and we were off. But that remains to be read in the Turnow book. What \"Tiger Bravo's War\" by Rick St. John, a member and commander of this company within the 101st Airborne does is give us over a year in the lives and deaths of this legendary Division, following the men in campaign after campaign, numerous \"search and destroy\" missions, both against the North Vietnamese Army (NVA) and the Viet Cong and as the same targets to the enemy who simply wants the invaders to leave and allow them to run their own country, thank you very much. There is no uber patriotic grandstanding here: while it's true many hawks in D.C. were petrified of communism, one fact left out of history conveniently for them is the fact that China was in no condition or able to expand its world at the time, which was the excuse most often given for going over in the first place. Mao Tse-Tung had systematically starved eight million people just a few years earlier in the late 1950's by selling all his country's grain and other food reserves to the U.S.S.R. to try to curry favor, as the U.S.S.R. was always much much more powerful, and pulling the strings from clear back in Moscow, a situation not much different from today. But war means money from a capitalist/imperialist point of view. One Vietnamese gentleman was talking to Turnow and said Americans do everything for money and care not a whit for anything else. So, Tiger Bravo had to endure the jungles, diseases, devastation, loss and horror of war, including the infamous Tet offensive, where VC and NVA troops spread out in secrecy all over South Vietnam and attacked multiple cities and military bases all from dozens of directions, with no clear front, flank, or rear. It was guerrilla warfare at its most effective. The book is heartbreaking. Each soldier was burdened with every possible indignity and direct threat to his life you could imagine, and as the war lagged on, and more and more service personnel seriously questioned the validity of their being out in the terrible heat and constant threat of their lives 24-7, as nothing ever seemed to progress. St. John does a superb job taking us inside his world, from unloading off choppers into hot landing zones under intense fire, entering kill zones unwittingly where VC and NVA soldiers far more equipped to intense jungle warfare and every other situation imaginable. It is a story of bravery under incredible conditions, a few instances of cowardice but overall a camaraderie of soldiers brought together to fight as one, protect and get home alive. There was never an excuse for Vietnam, but that young men still laid down their lives, suffered horrible injuries and fought for their country is incredible. This is a great book that does more to open our eyes to this long sick war than anything I've read or watched in some time.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James S. Roach Jr.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4BL7ILG47URNYMG37QQBMSYOQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWU79O68XG30N?ASIN=0998854204",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2017",
                "reviewTitle": "5.0 out of 5 stars And I think that TIGER BRAVO’S WAR is a very good, well written history of our year in Viet ...",
                "reviewText": "I was a 20 year old Lieutenant in this book. A rifle platoon leader in Tiger Bravo. And I think that TIGER BRAVO’S WAR is a very good, well written history of our year in Viet Nam. It captures our initial youthful optimism, and also our growing realization as the months passed, that many of us would never see home again. But we were proud that we were doing dangerous and USEFUL work.“The purpose of life is not to be happy. It is to be USEFUL, to be honorable, to be compassionate, to have it make some difference that you have lived, and lived well.” Ralph Waldo EmersonWe were young men in Viet Nam, and I am sure that it was my family’s faith in the American government that was the reason I was willing to serve in the Army. I was operating on trust, as most young soldiers were. Trust that our President and political leaders were acting wisely and that our risks and sacrifice in Viet Nam were in fact \"defending freedom\", and making a positive difference in the fight against the worldwide spread of Communism.During the Viet Nam War there were two story lines that dominated the debate - First Story Line was that the US Military was in Viet Nam to defend the world from the spread of Communism. And it was the patriotic duty of young American men to contribute to that defense. Second Story Line was that the USA was fighting the wrong war, in the wrong place at the wrong time. Some even contended that Communism was a benign force, that was more appropriate to poor agricultural societies (such as Viet Nam)But with the 1990s publication of the books \"Communism Black Book\" and \"Death by Government\" RJ Rummel - it is has become clear that Communist Countries killed somewhere between 100 and 250 million of their own citizens during the 20th Century. The North Vietnamese government by itself killed 1,669,000 of their own unarmed, defenseless citizens. Communism makes Adolf Hitler and his World War II Nazi Henchmen look like amateurs. So in retrospect, it is obvious to me, that in Viet Nam we were fighting on the Right Side of History...So it seems to me that our service in Viet Nam was not only being USEFUL to our country but also being USEFUL to all of mankind…",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MR DAVE B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 26, 2023",
                "reviewTitle": "Brings reality to a what was a T V war to many",
                "reviewText": "Once again politics results in brave people paying the ultimate price for their stupidity while they bask in the glory",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MaryE",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 18, 2017",
                "reviewTitle": "In the words of those who served",
                "reviewText": "My brother was a member of Tiger Bravo; like many veterans, he didn't talk much about his year in Vietnam. This book gave me a sense of the conditions in which he lived and fought: the smells, the sounds, the sights, and even the occasional light moments. What stunned me was the list of those KIA. I'd forgotten how young they were - how young we all were. The author was the company's twenty-three year old first lieutenant. In writing this book he called upon not only his own memories, correspondence and reports, but also those of the men he led. A good read. Includes maps, photos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doug Eaton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 14, 2018",
                "reviewTitle": "Four Stars",
                "reviewText": "loved the book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martin Callow",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 11, 2020",
                "reviewTitle": "Good book",
                "reviewText": "Cracking read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$15.27",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            },
            {
                "price": "$15.28",
                "sellerName": "Franklin's Collections",
                "sellerRating": "4.5"
            }
        ]
    }
}