{
    "remaining_requests": 503,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Outlining-Your-Novel-Map-Success/dp/0978924622",
    "body": {
        "name": "Outlining Your Novel: Map Your Way to Success (Helping Writers Become Authors)",
        "price": "$11.79$11.79",
        "originalPrice": "",
        "rawPrice": 11.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Outlining-Your-Novel-Map-Success/dp/0978924622",
        "soldBy": {
            "sellerID": "A1FQLTL85I1GP6",
            "name": "Purple Ukulele Mercantile",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1FQLTL85I1GP6&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/51pMAJ4vPZL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "K. M. Weiland",
            "link": "https://www.amazon.com/K-M-Weiland/e/B002RCXQ00/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Purple Ukulele Mercantile",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2532,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author K.M. Weiland lives in make-believe worlds, talks to imaginary friends, and survives primarily on chocolate truffles and espresso. She is the internationally published author of the Amazon bestsellers Outlining Your Novel and Structuring Your Novel, as well as the western A Man Called Outlaw, the medieval epic Behold the Dawn, and the epic fantasy Dreamlander. When she's not making things up, she's busy mentoring other authors on her site helpingwritersbecomeauthors.com. She makes her home in western Nebraska. Find out more about her fiction at kmweiland.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 7 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 7 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 13 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Can Outlining Help You Write a Better Story?Writers often look upon outlines with fear and trembling. But when properly understood and correctly wielded, the outline is one of the most powerful weapons in a writer’s arsenal.Outlining Your Novel: Map Your Way to Success will:Help you choose the right type of outline for youGuide you in brainstorming plot ideasAid you in discovering your charactersShow you how to structure your scenesExplain how to format your finished outlineInstruct you in how to use your outlineReveal the benefitsDispel the misconceptionsIncludes exclusive interviews with ten respected authors, answering important questions about outlining.Outlining can organize your writing and help you take your stories to the next level. Find out how! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ PenForASword; 6.1.2011 edition (July 1, 2011)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 192 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0978924622"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0978924621"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 4 - 6"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.44 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#56,390 in Books (See Top 100 in Books) #85 in Writing Skill Reference (Books) #148 in Fiction Writing Reference (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,532 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Anne Gross ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENY7S3O5EGWBD4H6FBZAUUA5ANQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXSQTDMS3CCAR?ASIN=0978924622",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Inspiring and Informative",
                "reviewText": "This book made everything really clear for me about outlining my book and also helped me actually look forward to the task of structuring my novel. Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcie Seidel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERLGNSL5HZO55NDYXKMKX5LFLEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BYMWUCK0EN7W?ASIN=0978924622",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Outlining your novel makes us cringe; but….",
                "reviewText": "For years, the topic of outlining my novel, or any writing project, brings fear and white knuckles to my heart. I have read different versions of outlining concepts, theories and applications. But no one seems to cut to the chase, as well as K.M. Weiland. She is a master of her craft. And I thank God I found her. I’ve been listening to her podcast for several years now, being educated and inspired. Best decision I made was to get on her mailing list. Now I endeavor to embrace her whole writing techniques series. There is a sea of teaching books out there, many recommended by other writing groups and clubs. Many are well researched and annotated. But there are few that you really look forward to returning to. K.M. Weiland totally met the mark on this and I’m enjoying this book thoroughly and look forward to doing the workbook. Yes, I’m very glad I bought it. My only complaint if any is the actual print inside the book. The headers are grayscale, not 100% black. It can be remedied by highlighters, which will happen. Otherwise the book is well structure. I will be recommending this book and others in her series to my aspiring author friends.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LoveBoardGames",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5R7RPMMEBMQ2SEQVB4NWCKWZSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NXC9XGCFDRIO?ASIN=0978924622",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2014",
                "reviewTitle": "4.0 out of 5 stars It \"feels\" heavily focused on character development versus outlining a novel",
                "reviewText": "Rating System:1 star = abysmal; some books deserve to be forgotten2 star = poor; almost a complete waste of time3 star = good; worth the effort4 star = very good; what writing should be5 star = fantastic; must own it and share it with othersHere is my \"outline\" of this book. . .Chapter 1 - Arguments & myth-busting of whether you should outline or notChapter 2 - Understanding different types of outliningChapter 3 - Turning an idea into a storyChapter 4 - Jump into summarizing your scene listChapter 5 - Developing Characters part 1 - Motives & DesiresChapter 6 - Developing Characters part 2 - BackstoryChapter 7 - Developing Characters part 3 - PersonalityChapter 8 - Developing Characters part 4 - Reacting to SettingChapter 9 - POV and story structure basicsChapter 10 - Fleshing out your outlined scenesHaving read and owned no less than six(6) books on outlining and having outlined for the last five or six NaNoWriMo's, I had to add this book to my library when I saw it.WHY only TWO STARS overall?Many of the chapters are pretty short, except the ones on character development. Those chapters \"felt\" like they were three times as long as any other chapter, which is why I'm left with a sense that this is a method intended for character driven stories. No love for plot-driven stories (can anyone say \"most Hollywood blockbuster plots?\").Some chapters are real short, such as Setting and Story Structure, since entire books could be devoted to helping you world build or analyze different types of story frameworks. As proven by this author having a separate book on story structure titled: Structuring Your Novel: Essential Keys for Writing an Outstanding Story .In addition to the chapters being short and feeling like the topic covered were light, how these chapters translate into an actual outline is a little more vague. . .at least it was ambiguous for me.WHY at least THREE STARS overall?What adds credibility to the author's work is near the end of several chapters we get an different author's interview on the power of how outlining has helped them write their stories and get published. I like that!Also, I like the Summary / Checklist at the end of most chapters. For my analytical mind, I needed the checklist! I can more easily quantify the steps to work through as suggested by the author. . . thanks to the list.WHY I ended up rating this a FOUR STARS:I'm more analytically minded and I want a complete list of what steps I need to go through to outline. This book is written for a more organic process.You'll more \"organically\" create an outline that grows and evolves, as you flesh out your characters and answer key questions about your story versus a method that \"tells you\" to create a framework such as:1. Protagonist introduced in Act 1 = check;2. Romantic Involvement escalates in Act 2 = check3. Chance of first kiss after story Resolution = check4. etc. . . .This book is not meant to give you a scene-by-scene blow of \"use this framework\", but to help you answer questions and develop your own outline. If you want a more scene-by-scene framework, I suggest The Marshall Plan for Novel Writing OVERALL:I don't think you should ONLY limit yourself to reading this book to help you outline or develop your novel. Instead it's a supplement to other outlining/novel planning books.What this book is helping me do is flesh out my characters more, which is resulting in new story opportunities, which I can then translate those opportunities into the \"organic\" outline.Thus, this book is a good addition to one's library.TESTIMONIAL:It wasn't till I switched from being a discovery writer to outline writer that I more than TRIPLED my daily word count. Also, I've completed more first drafts because of outlines. Lastly, if I had to take a break, the outline helped me jump back into the fiction story or the non-fiction book a lot quicker.Just my two cents.",
                "reviewVotes": "47 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kym McNabney",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4APLODR5CG5TCC5NVIICMQRHNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22RY9VJ4SQIH?ASIN=0978924622",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2015",
                "reviewTitle": "5.0 out of 5 stars A MUST READ FOR THE STRUGGLING WRITER",
                "reviewText": "My writing journey has been a slow one. My life is full, and I'm in a busy season of my life. Still, the desire to write is constantly present.Once I made the outrageous decision to write a novel, I picked up a copy of Stephen King's, On Writing. Though it inspired me to dive in, it failed to give me concrete structure; hence, I became a seat-of-the-pants writer. I've gain knowledge along the way, perfecting my craft as I go from published and unpublished authors, the internet, classes, workshops, books on writing, and from reading others work. If there is one thing that can be said about writers it is that many have a strong opinion of whether one should be a pantser (Seat-of-the-pants-writer) or a plotter (An outliner).I plunged full force into writing, though a bit unsure, content in my approach. Over time, the words of outliners began to sink in. Then I hit a brick wall. I realized my writing was missing something, and if I were not mistaking, it meant I needed to change my approach to staring a novel. I began to add different methods such as characterization and goal, motivation, and conflict charts. Still my stories lacked.Convinced that I needed to make some serious changes, I gave in to the idea that I needed to do some major legwork before beginning a story. When I spotted OUTLINING YOUR NOVEL: MAP YOUR WAY TO SUCCESS by K.M. WEILAND, I read the reviews and pondered the thought of purchasing it. Did I really want to become an outliner? Could I even do it?Something I have learned over time is the variations of the words pantsers and plotters. It is not an all or nothing approach, or one-size-fits-all. One of the things that drew me to MS WEILAND'S book on outlining is her attitude of the two approaches. She neither overly praised one or badmouthed the other. It was all about finding the unique formula fit for you.My copy of OUTLINING YOUR NOVEL: MAP YOUR WAY TO SUCCESS is packed with handwritten notes, highlights and dog-eared pages. It is truly a wealth of information and an eye-opening experience. You know a book is worth every penny when you have a light bulb moment.With too many examples to list, I will note the simplicity and examples MS WEILAND chose in OUTLINING YOUR NOVEL: MAP YOUR WAY TO SUCCESS was instrumental in creating a book on the craft that will influence my writing forever. The book is written in a way that will have you looking forward to reading it each day, completing it from cover to cover.To be honest, I was on the fence whether to purchase this book, having several books I've read on the craft of writing, as well as waiting to be read on my shelf. I am certainly glad I listened to the five star and not one star, reviews. I would not label this book for \"new writers\", but for struggling writers, which can be at any point of one's journey.So impressed was I with MS WEILAND'S knowledge on writing and her style in OUTLINING YOUR NOVEL: MAP YOUR WAY TO SUCCESS , I purchased a couple of her novels.Information on OUTLINING YOUR NOVEL: MAP YOUR WAY TO SUCCESS:* Help you choose the right type of outline for you* Guide you in brainstorming plot ideas* Aid you in discovering your characters* Show you how to structure your scenes* Explain how to format your finished outline* Instruct you in how to use your outlineReveal the benefits:* Ensures cohesion and balance* Prevents dead-end ideas* Provides foreshadowing* Offers assurance and motivationDispel misconceptions:* Requires formal formatting* Limits creativity* Robs the joy of discovery* Takes too much time",
                "reviewVotes": "96 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah Wile",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 26, 2022",
                "reviewTitle": "Helped me regain my motivation to write!",
                "reviewText": "Great read! Definitely recommend that you pick this book up and read it if you need a push to keep writing / like me need to know why you aren't quite getting the hang of this whole writing thing. Where are you doing wrong? What are you missing? How can you fix it? And why can I never seem to finish writing a single story and only get mad/ frustrated.I would 100% recommend that you pick this book up and give it a read. It definitely helped me regain my motivation to write.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Parnham",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 2, 2024",
                "reviewTitle": "Well worth reading.",
                "reviewText": "For authors learning their craft, this book gives sound advice and good examples of how to outline a story. If you are a Pantser (Discovery writer) and you want to learn the art of outlining, this book is for you. If you are a beginner, you will learn a lot from this book. I thoroughly recommend this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H. De Boer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 23, 2023",
                "reviewTitle": "lovely book",
                "reviewText": "This book makes a lot clear for a newbie like me. I thoroughly enjoyed reading it.Clear recommendation from me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P N G",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 8, 2021",
                "reviewTitle": "Useful",
                "reviewText": "I found the book useful. The author interviews were slightly repetitive, but despite that, it's a good read and a helpful resource for anyone who writes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rafael Lois",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 27, 2019",
                "reviewTitle": "Ótima ferramenta! Amazing tool!",
                "reviewText": "Linguagem simples e clara, mostra bem como usar um outline para qualquer peça escrita. Uma ótima leitura para quem quer profissionalizar a escrita.Clear and simple language, it brings a good way to utilize an outline in any written piece. A must-read to anyone who wishes to take their writing to a professional level",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}