{
    "remaining_requests": 710,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Numb-This-Memoir-Mass-Shooting/dp/0316462098",
    "body": {
        "name": "Numb to This: Memoir of a Mass Shooting",
        "price": "$12.99$12.99",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Numb-This-Memoir-Mass-Shooting/dp/0316462098",
        "soldBy": {
            "sellerID": "A2QVWT0ESGUXPH",
            "name": "ThriftBooks-Phoenix",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2QVWT0ESGUXPH"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51hW5uBGS8L.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/61wtZurkmGL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kindra Neely",
            "link": "https://www.amazon.com/Kindra-Neely/e/B0BFDKFRWX/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ThriftBooks-Phoenix",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 32,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “I started Numb to This right before the shootings at the grocery store in Buffalo. I finished it the day before the shootings at the elementary school in Texas. Kindra Neely’s graphic memoir reminds us that mass shootings leave far more victims than just the people who end up in caskets. This searing, raw, and honest account offers a window to those who want to empathize, and a mirror for those of us who may find ourselves in her shoes.”―April Henry, New York Times bestselling author of Girl, Stolen*\"Via realistic dialogue, tense relationship dynamics, and turbulent emotional highs and lows, Neely astutely asserts the importance of hopeful defiance in the face of the numbness and resignation that often accompanies feelings of powerlessness.\"―Publishers Weekly, starred review About the Author Kindra Neely is an artist and writer based in southern Oregon. Her art journey began with the amazing community and encouragement she received at Umpqua Community College. She took her first drawing class Drawing Nature at UCC and still likes to hike the trails regularly to sketch flowers and ferns. Numb to This is her debut graphic novel."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 15 hrs 32 mins",
            "FREE delivery February 27 - March 4.",
            "Or fastest delivery February 21 - 23."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "This searing graphic memoir portrays the impact of gun violence through a fresh lens with urgency, humanity, and a very personal hope. Kindra Neely never expected it to happen to her. No one does. Sure, she’d sometimes been close to gun violence, like when the house down the street from her childhood home in Texas was targeted in a drive-by shooting. But now she lived in Oregon, where she spent her time swimming in rivers with friends or attending classes at the bucolic Umpqua Community College. And then, one day, it happend: a mass shooting shattered her college campus. Over the span of a few minutes, on October 1, 2015, eight students and a professor lost their lives. And suddenly, Kindra became a survivor. This empathetic and ultimately hopeful graphic memoir recounts Kindra’s journey forward from those few minutes that changed everything. It wasn’t easy. Every time Kindra took a step toward peace and wholeness, a new mass shooting devastated her again. Las Vegas. Parkland. She was hopeless at times, feeling as if no one was listening. Not even at the worldwide demonstration March for Our Lives. But finally, Kindra learned that—for her—the path toward hope wound through art, helping others, and sharing her story.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Little, Brown Ink (October 11, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0316462098"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0316462099"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12 years and up"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.3 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.65 x 1.2 x 8.3 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#218,494 in Books (See Top 100 in Books) #17 in Teen & Young Adult Biography Comics #23 in Teen & Young Adult History Comics"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 32 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Riley Maddox",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGA4FQ66JAQH7BZUL27VLLG7CPMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LNKRHSSQZKOK?ASIN=0316462098",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Simultainiously Dark and Colorful",
                "reviewText": "An intense rendering of one persons experience involved in a tragic event that has become all too commonplace. The novel provides both a vivid telling of such a traumatic incident as well as an honest understanding of how the effects of one event can be rehashed in your brain over and over.The art style is warm and colorful, providing both powerful images of the anxiety and fear felt in the moment as well as the bright color that fills our lives, even when it feels dim.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "F. Zschiegner-Bleich",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXBXSRIW4TYJ7QEWEPNRVR2GIWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OAUE54AQ81U8?ASIN=0316462098",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Very important read",
                "reviewText": "I'm so glad this was published. It confronts a very important issue that goes along with mass shootings; the emotional impact they have on people. Great read and since it's a graphic novel, it helps reluctant readers understand it all easier.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deborah L. Klein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNC7ZRB72QF2ZRDEFGZC4JGDLPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KBH6W6QNR0EH?ASIN=0316462098",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2022",
                "reviewTitle": "4.0 out of 5 stars Moving In Spite of Itself",
                "reviewText": "This book surprised me in that I never thought someone could suffer post-traumatic stress just from being in the vicinity of a mass shooting. As Kindra relates the shooting on her school campus, she hears the gunshots but is several buildings away from the incident. Still, she shows how even that limited exposure left her struggling to cope for years. I’m glad I learned that truth from this book.In many places the book presents a kind of collage of images without dialogue or narration. I sometimes had difficulty understanding what these images were intended to communicate, which was frustrating. Also, the narration at times felt heavy-handed.Despite its shortcomings, the book did move me, especially the scenes at the March for Our Lives. I’m glad that Kindra is in recovery. I recommend this book to all sensitive, thinking people.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan R.Susan R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPNFWBEP6QOMDRAEBNXOKMS43TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19K51I2MV2P49?ASIN=0316462098",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2022",
                "reviewTitle": "5.0 out of 5 stars A beautiful story of finding hope after tragedy",
                "reviewText": "Kindra Neely is unflinching in telling of her experience as a survivor of a mass shooting. It’s a story that can be told by far too many, and Neely underscores that survivors are individuals, each with their own path through. Numb to This is beautifully illustrated and told, and ultimately is a story of persistence, friendship, and hope.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71E38-Ws2CL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71KjgXrr8kL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ce+7R37fL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pNyB-FZfL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5UOTFFAKF7TDSVTMZH7DZ2MKVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33KNTZ6VAR2VF?ASIN=0316462098",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2023",
                "reviewTitle": "5.0 out of 5 stars From One Survivor to Another, I love this",
                "reviewText": "Shooting survivors often get the line, \"But you didn't DIE.\" We are often guilted into feeling like we are making things about ourselves, but Kindra does a great job in this memoir of showing the aftereffects of a school shooting. Her experience mirrored mine in many ways and explained things that I could not put into words myself. Every new shooting on the news I'd a retrauma: it comes with nightmares, panic attacks, and constant checking of your surroundings. Many people suffer from depression. People kill themselves. This is very true. The victim number for shootings doesn't end with the event. It affects the community long afterwards, as families, friends, and victims try to piece their lives back together.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cecelia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7YSWPOTAG5DUVPGLHWXNZRB4VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HWSQSKECPSXT?ASIN=0316462098",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2022",
                "reviewTitle": "5.0 out of 5 stars Heart-wrenching and incisive",
                "reviewText": "There’s a lovely tradition in the high school I work at where teachers to post the title of the book they’re currently reading on their classroom door. I was puttering around last Friday, packing up before Winter Break, and I changed my sign over to show my latest read, Kindra Neely’s graphic novel Numb to This: Memoir of a Mass Shooting. A student who has struggled in my class asked me about it, and then wanted to see the book, and then asked when is it gonna be on the bookshelf? I was reading a library copy, but you can bet I placed an order for this one as soon as I had a spare moment. In my opinion, there’s nothing better than finding a book (the right one, the one they choose!) for that student who needs it. And on top of that, this book is a must-read – an important, shattering story from a gun violence survivor – a chance to listen to someone share what that aftermath looks and feels like.Kindra Neely survived the Umpqua Community College mass shooting in Oregon in 2015, and her beautiful, poignant, and searing memoir of the years after is absolutely required reading. There’s some background and context-setting, but the majority of Neely’s book focuses on the day of the shooting and what happened next: how she reacted in the short- and long-term, the impact of PTSD on her life, and the reality of a suicide attempt: all while presenting a front to the world. In the 300 pages of this debut graphic novel, Neely lays herself bare for a purpose, saying “I…went looking for a book about how to deal with the aftermath of a shooting, but I couldn’t find one. Maybe I could make a book to show people like me that they aren’t alone, or that their feelings are normal.”Neely’s story is not just one of trauma, though it does deal with that. It keeps the tension between hope (she survived, she keeps surviving, she finds meaning in making art & helping others) and realism (there are bad days full of fear, depression is very real, and some people are uncomfortable around those who are open about their trauma). The pacing and scene changes are also telegraphed well and keep the “journey” of Neely’s life (narrative) moving. It is also heartwarming to see the real-life friends come alongside Neely in tough moments, and vice versa, even though no one is without flaws (except maybe Neely’s mom). The supportive, healthy relationships and networks from her life are excellent guides for young readers to follow, internalize, and model in their own lives.Pacing and storytelling in the graphic novel format rely so much on the art… and I just want to say that Neely’s art is fabulous. I would have no idea that this was a debut – her style and linework are polished, modern, and evocative. The emotion bleeds through the pages, and while this volume is in full color, I think Neely’s neat linework and focus on facial expressions would work in any color palette. There’s doesn’t seem to be a predominant or overarching color theme, but teals and purples show up quite a bit in scenes set in Oregon, and harsh yellows and reds during moments of stress and trauma. Overt symbolism of dragonflies appears throughout (and is explained directly in the text).Overall, Neely’s story and art are indistinguishable/inseparable – and the result, a compulsively-readable volume, allows her to be vulnerable in the service of helping others. Numb to This is heart-wrenching and incisive and belongs in every high school library in the country.Recommended for: high school nonfiction collections, and anyone ages 14+ who has been touched by a mass shooting in some way (at this point, everyone in the US).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Edgar Mihelic, MA, MA, MBA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP6VSEK3Y5MHGJCG2RGHM2EHCLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26KPZM7T85SR7?ASIN=0316462098",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2022",
                "reviewTitle": "4.0 out of 5 stars We have all become \"Numb to this\".",
                "reviewText": "I enjoyed this graphic memoir of what it is like to deal with the tragedy of being in a mass shooting and the fear and uncertainty and ptsd that comes with it.Neely explores how she worked through it on her own and found a way out in her creative output. It's also a cry that we should put fewer people through the ordeal that she went through.The thing that really struck me when I was reading it - not the tragedy, or the personal story, or the remembrance of all the people we've lost - what struck me was that I cannot for the life of me remember the coverage or the event that is central to this text.We have had so many of these shootings that it's not just her, but we have all become \"Numb to this\".",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}