{
    "remaining_requests": 638,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Buried-Sky-Extraordinary-Climbers-Deadliest/dp/0393345416",
    "body": {
        "name": "Buried in the Sky: The Extraordinary Story of the Sherpa Climbers on K2's Deadliest Day",
        "price": "$10.83 $8.78",
        "originalPrice": "$17.95",
        "rawPrice": 10.83,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Buried-Sky-Extraordinary-Climbers-Deadliest/dp/0393345416",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/410UGGwt-fL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51MyZrniF3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Tk4h6nfkL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Peter Zuckerman",
            "link": "https://www.amazon.com/Peter-Zuckerman/e/B001KIUZ1K/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Vivé Liber Books LLC and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3913,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Enthralling…phenomenal research and vivid writing create a memorable portrait not only of the events on the mountain but also of the people who make modern high-altitude climbing possible.\" ― Michael J. Ybarra, Wall Street Journal\"Easily the most riveting and important mountaineering book of the past decade.\" ― Outside\"An indispensable addition to the genre…a long-overdue historical correction to the familiar mountaineering story.\" ― Matthew Power, Men's Journal\"An absorbing book that goes beyond the typical mountaineering tale…This book is mesmerizing.\" ― Sharon Haddock, Deseret News\"It’s a testament to the thrills in this book that I scoured the notes, eager to learn how the authors wrote their account…The authors’ commendable documentary about the people who carry the gear is overtaken by the chilling adventure story of one terrible day on the mountain.\" ― Smithsonian Magazine\"This compelling story brought back from K2’s slopes is a worthy tale about a little-known aspect of these high-stakes climbs.\" ― Colleen Kelly, Minneapolis Star Tribune\"Through phenomenal research, Zuckerman and Padoan have dug deeper than anyone else into one of the most mysterious tragedies in mountaineering history. Thanks to their efforts, the heroism and humanity of the Sherpa climbers who saved lives shine through the chaos and grief of that awful day on K2.\" ― David Roberts, co-author of K2: Life and Death on the World's Most Dangerous Mountain and author of Limits of the Known\"An informative and inspirational book…I couldn’t put it down.\" ― Jamling Tenzing Norgay, son of Tenzing Norgay, author of Touching My Father's Soul\"Buried in the Sky reveals the heroic deeds of the Sherpa…[It] brings to light how immensely strong, loyal, and talented the Sherpa climbers are. Finally credit is given, where credit is due.\" ― Ed Viesturs, bestselling author of No Shortcuts to the Top and K2: Life and Death on the World’s Most Dangerous Mountain\"I admired Buried in the Sky and enjoyed it, too. Because the authors did their homework and wrote their story well, and most of all, because credit is given at long last to those who deserve it most.\" ― Peter Matthiessen, author of The Snow Leopard\"The Sherpas climb off the page and carry a narrative that is as fast and as gripping as their superhuman ascents.\" ― Michael Kodas, author of High Crimes: The Fate of Everest in an Age of Greed About the Author Peter Zuckerman is a non-fiction writer. He has received some of the most prestigious recognitions in American journalism. At age 26 he won the Livingston Award, the largest, all-media, general reporting prize in America. His writing has also received is the National Journalism Award and the Blethan Award.Amanda Padoan is a historian who writes about communities affected by armed conflict. She holds degrees from Harvard and University of Cambridge. Her first book, Buried in the Sky, received the National Outdoor Book Award."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 13 hrs 24 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 13 hrs 24 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Winner of the National Outdoor Book Award and the Banff Mountain Book Award for Mountain Literature \"Gripping, intense…Buried in the Sky will satisfy anyone who loved [Into Thin Air].\" ―Kate Tuttle, Boston GlobeWhen eleven climbers died on K2 in 2008, two Sherpas survived. Their astonishing tale became the stuff of mountaineering legend. This white-knuckle adventure follows the Sherpas from their remote villages in Nepal to the peak of the world’s most dangerous mountain, recounting one of the most dramatic disasters in alpine history from a fascinating new perspective.Winner of the NCTE George Orwell Award and an official selection of the American Alpine Club Book Club. 16 pages of illustrations; 8 maps",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9"
            },
            {
                "name": "Asia",
                "link": "https://www.amazon.com/Asia-History-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4884"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ W. W. Norton & Company; Reprint edition (May 3, 2013)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0393345416"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0393345414"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.8 x 8.3 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#42,107 in Books (See Top 100 in Books) #2 in Mountain Ecology #19 in Mountain Climbing #84 in Hiking & Camping Instructional Guides"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 3,913 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Pete",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECFZLOMVQ5POXAUDKKWS4UHAD5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SUOMUE7TZ9PX?ASIN=0393345416",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "A tremdendous book. So real and raw. The author pulled me in and kept me hooked from beginning to end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RTM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMCVDMOC4AOXTXEF42RNZQIYOGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GH1WMT7ZPH1D?ASIN=0393345416",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2019",
                "reviewTitle": "4.0 out of 5 stars Mountaineering from the Sherpa's Perspective",
                "reviewText": "This book offers an unique perspective on what has unfortunately become a familiar story: too many people, from different countries, with varying levels of skill and experience, attempt to climb a famous but very dangerous mountain (in this case K2) at the same time by the same upper route to the summit. In 2008, nearly 40 climbers made this choice to take advantage of a narrow window of good weather. 11 died during a 24 hour period, and many others barely escaped with their lives. The well-written narrative is hard to put down, as the climbers try to make decisions and work together in this extreme high altitude environment. What makes this book different is that the authors focus most of this book on two of the climbers, Nepalis from the Sherpa people, giving their life stories in detail. Driven by a desire to escape poverty, achieve status, and support their families, they first serve as porters for climbing expeditions, then become skilled, accomplished climbers themselves. The authors provide interesting information about the Sherpa people, and their involvement in mountaineering. The reader also learns about the complex, unstable political situation in Nepal during their Civil War, which drove many rural families to the cities (primarily Kathmandu). While reading this, I thought about the great changes Western climbers have brought to the Sherpa people, both good and bad. 94 Sherpas have died on Mt Everest alone. More and more non-Nepali climbers will seek the summits of the world's highest mountains. Many of these people will depend on Sherpas to make their dreams a reality.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phillip S. Groman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAGPJNQC5PZS4IHIK3XXP7D2RIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYHMJW16EBUDI?ASIN=0393345416",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Speedy order fulfillment",
                "reviewText": "Book was as described, in good condition, pages torn or dog eared, very speedy delivery!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AumTatSat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTRPUPU2Y5EL3YGXMXNNSEDFSBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4HBX9IJ8H8G9?ASIN=0393345416",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Couldn't put it down",
                "reviewText": "Very sensitively, beautifully written epic. So many individual and cultural backgrounds and stories entwined in this book. Absolutely fascinating. I loved it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bradley M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFL6QKR54VCOHB3HXC3PMVSETHPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHXTV2U0HYM9T?ASIN=0393345416",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2017",
                "reviewTitle": "4.0 out of 5 stars A Brief and Thorough Perspective.",
                "reviewText": "I knew nothing about the tragedy in this book, prior to reading this. So, the beginning of the book immediately tapped into my desire to know ‘What happened?” And “Who made it through and what was it like for them?” This book intertwines Nepali history and culture with the story of the 2008 K2 disaster.Reading this gave me a similar, immersive experience that I also received when reading ‘Into Thin Air,’ that made me feel like I was up there, helplessly watching this unfold.The authors really captured a rich, but brief lesson history of Nepal and the practices/beliefs of the Sherpas. This was one of the strongest aspects that made this book stand out from most other mountaineering books - our perspectives is not of a western eye.Buried in the Sky also did a wonderful job at capturing the personality of the Savage Mountain. Although not quite as tall as Everest, you quickly learn how nature behaves on this mountain, and why mere height is far from the only factor that makes K2 the danger that it is.The only thing that I may find to be a con to this book was it's length - it's much shorter than I expected it would be.",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KatieDidnt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGYBXS23PDVDMEAROPZQ7F3PGKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33RWT10XELY1G?ASIN=0393345416",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2023",
                "reviewTitle": "3.0 out of 5 stars Great Story,told choppy",
                "reviewText": "This was a good book. Just too many characters to keep separated with the amount of jumping around the story did. I felt duped half the book since the story of the actual climb doesn't occur to over half way through. Lots of excess information that could have been left out to focus on the actual 2 main surviving Sherpas and their trek as opposed to historical long winded stories that were really not needed to flesh out this story. Glad I read it,felt educated,but wouldn't recommend to friends.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Guesswho",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZDZQXOHDCSDXE47ZT2SWDCRM5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11DBBAODIT1RR?ASIN=0393345416",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Great story",
                "reviewText": "Good book and great story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Drea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOOQGFTMX7KOZB5SIZJCVLXHRIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I0FLFH4UTNYR?ASIN=0393345416",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Great gift for adventure lovers.",
                "reviewText": "I got this as a gift for the adventure lover in my life. He loved it. He said it was so well written he didn't want to put it down. It wasn't just about the climbing either, it also talked about culture. Would definitely recommend. In fact he liked it so much, I might purchase a copy for myself.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "clauwau",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 13, 2023",
                "reviewTitle": "A tragic story",
                "reviewText": "The prologue explains that many versions of the K2 tragedy exist and recollection of the events is sometimes blurred by the traumatic events that happened. This book is extremely well researched and written. A must read for anyone interested in finding more about this very tragic expedition.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 30, 2023",
                "reviewTitle": "Very well researched!",
                "reviewText": "The book was a great read! Well researched and very detailed!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Giorgio Scappini",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 11, 2018",
                "reviewTitle": "Another view",
                "reviewText": "there have been plenty of movies and documentaries on the K2 tragedy, but none is as comprehensive as this book. Seen from the eyes of the High Altitude Porters who were there it really tell the story as it happened while international media only focused on Western climber.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sanjay Kothary",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on January 10, 2024",
                "reviewTitle": "Tiny print",
                "reviewText": "Very small print. Didn’t read the book. The review is for the print size of the book. Even if the book is fantastic ( going by the accounts of others ) it’s pointless if the print size is this tiny. Disappointed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Margaret",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 28, 2022",
                "reviewTitle": "Extraordinary heroism on the world's cruellest mountain",
                "reviewText": "I found this account of the tragic ascent of K2 in 2008 in which 11 climbers and porters lost their lives deeply moving. Set against the sheer stupidity and mercenary motives which led far too many teams to attempt to scale the mountain's deadly Bottleneck, so narrow it could only be traversed in single file, in a tight weather window of two or three days, it is the heroism of a few that stays with me. Some of the actions of Sherpas and other porters plus the odd Western climber were extraordinarily brave- these men must have known their chances of survival were minimal. I found the first few chapters a bit slow going but as the story progressed I appreciated the background knowledge they provided on individuals and the pressures they faced in various ways. As the tragedy unfolded I found the descriptions of what they endured and the decisions they made at critical times deeply affecting. A great testament to true mountaineers.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}