{
    "remaining_requests": 488,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/All-That-Remains-Sue-Black-audiobook/dp/B07MGHLVWQ",
    "body": {
        "name": "All That Remains: A Renowned Forensic Scientist on Death, Mortality, and Solving Crimes",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/All-That-Remains-Sue-Black-audiobook/dp/B07MGHLVWQ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/5193QaSV20L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sue Black",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Sue+Black"
        },
        "brand": "Sue Black",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4504,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "For fans of Caitlin Doughty, Mary Roach, and CSI shows, a renowned forensic scientist on death and mortality.Dame Sue Black is an internationally renowned forensic anthropologist and human anatomist. She has lived her life eye to eye with the Grim Reaper, and she writes vividly about it in this book, which is part primer on the basics of identifying human remains, part frank memoir of a woman whose first paying job as a schoolgirl was to apprentice in a butcher shop, and part no-nonsense but deeply humane introduction to the reality of death in our lives. It is a treat for CSI junkies, murder mystery and thriller fans, and anyone seeking a clear-eyed guide to a subject that touches us all.Cutting through hype, romanticism, and cliché, she recounts her first dissection; her own first acquaintance with a loved one’s death; the mortal remains in her lab and at burial sites, as well as scenes of violence, murder, and criminal dismemberment; and about investigating mass fatalities due to war, accident, or natural disaster, such as the 2004 Indian Ocean tsunami. She uses key cases to reveal how forensic science has developed and what her work has taught her about human nature.Acclaimed by bestselling crime writers and fellow scientists alike, All That Remains is neither sad nor macabre. While Professor Black tells of tragedy, she also infuses her stories with a wicked sense of humor and much common sense. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Medical Books",
                "link": "https://www.amazon.com/Medical-Professional-Technical-Books/b?ie=UTF8&node=173514"
            },
            {
                "name": "Medicine",
                "link": "https://www.amazon.com/Medicine-Medical-Professional-Technical-Books/b?ie=UTF8&node=265542"
            },
            {
                "name": "Internal Medicine",
                "link": "https://www.amazon.com/Internal-Medicine-Medical-Books/b?ie=UTF8&node=227203"
            },
            {
                "name": "Pathology",
                "link": "https://www.amazon.com/Pathology/b?ie=UTF8&node=227692"
            },
            {
                "name": "Forensic Medicine",
                "link": "https://www.amazon.com/Forensic-Medicine/b?ie=UTF8&node=227695"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 22 minutes"
            },
            {
                "name": "Author",
                "value": "Sue Black"
            },
            {
                "name": "Narrator",
                "value": "Angela Dawe"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 05, 2019"
            },
            {
                "name": "Publisher",
                "value": "Brilliance Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07MGHLVWQ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,317 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #12 in Biology (Audible Books & Originals) #19 in Biographies of Science & Technology Leaders #44 in Scientist Biographies"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Andantelle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHO55K6FN26PGAJ2EE6LV7OF3MFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OASB9EAKS64Z?ASIN=B07MGHLVWQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars One-of-a-Kind Book",
                "reviewText": "This is truly a one-of-a-kind book. The subject matter—cadavers—would never be on my reading list. But I purchased this book based on a positive review.The author Susan Black is an expert in the field and writes passionately on this delicate subject. She and her colleagues treat the deceased with dignity while studying the magnificent human anatomy.Her many personal stories give levity to the text and many I-didn’t-know-that moments. I was most impressed when she sent a letter to the Prime Minister advocating for the identification of deceased remains in a conflict. Bravo on a job and book well done!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Salima",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHEFUHPVNLBRXV46UDO2YGMIDCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ARZ6SD1Y1TE8?ASIN=B07MGHLVWQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2021",
                "reviewTitle": "5.0 out of 5 stars I could not put down this book! It's a page turner for sure.",
                "reviewText": "Sue Black is an amazingly gifted writer! I could not put this book down. It's written professionally, scientifically, with immense respect both for the wonders of life, and for the intricacies and changes that occur to our bodies after death. Sue Black advocates for how important it is to help medical students by pre-planning (if wished) one's own body as a donation to science, and she describes in introspective detail the gratitude felt by anatomy students who examine a deceased corpse, as they learn about the incredible intricacies of the human body. Sue Black vividly and humbly recalls her own experience as a medical student when she first learned how to dissect a donor cadaver, and learned about the human body, and the deep relationship of awe, humility, respect she developed with the cadaver she was assigned to.This whole book, even though it deals all the time with bodies and body parts (rotting, to a certain extent, most of the time), is never gross. The author is methodically descriptive, never offensive, and -- at least for me as her reader -- she really helped me think about my own mortality in realistic terms, as just one more fact of life, the terminal fact of life, in fact, and about how to cherish every living day on earth, and why. As she writes, we all eventually meet death, why not meet \"her\" (she engenders death as a female, several time in the book) prepared and serene for this extraordinary encounter which will happen only once for each one of us.Sue Black has a dry sense of humor permeating the pages. My thinking is that the best reader for this book is someone already relatively at peace with the concept of death, someone curious to know what happens biochemically to the human body once oxygen no longer flows to the cells, and someone interested in probing how each of us leaves a legacy when we die: a corporal one, and one of memories generated by all the various adventures we create when we meet other fellow human beings who cross our path on earth.I think a good subtitle for this book would be something along he lines of \"How to Read a Dead Body Like a History Book about the Life of That Specific Person.\"While Sue Black stays in the background in most pages (she is professionally a forensic anthropologist -- I did not even know that such a thing existed before I read her book -- and most of what she writes is, in fact, about her job and its challenges), the last chapter is finally devoted to herself: a portrait of what she has learned about life and about death, having been for decades in her profession.The author comes across as a woman you would want to meet and take a peaceful walk with one quiet afternoon, just chatting about life and death. This has become easily one of my favorite books. I can't wait for Sue Black's next book to be published.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bernard Lavallee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOLLQN3S73VWZN3PNTKI3PMOA3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R1D7TON306VX?ASIN=B07MGHLVWQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "4.0 out of 5 stars quite a book",
                "reviewText": "Very interesting and at times very gruesome. The author seems to dwell on death as though it’s simply another phase of life. Isn’t death the end of life! You won’t forget this book if you read it through and you may disagree with her but it’s hard to ignore her honesty.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Keri McManusKeri McManus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUF34KILI347UPEDR3LHRQZICOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R177G4LNIBOV96?ASIN=B07MGHLVWQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2023",
                "reviewTitle": "5.0 out of 5 stars I legit cannot put this book down!",
                "reviewText": "I am absolutely obsessed with this book. I literally cannot put it down. All I want to do is indulge in the contents of its pages, while I am snuggled up in a warm blanket.If you love anatomy, true crime, don't mind the topic of death, and love a good read, I highly suggest this book!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51q8iZ5ejOL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ulsSrHwcL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scarf lady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM6ZBCTAUSUZ2JAVKTMZ74QSQ3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2831N40CZFI8J?ASIN=B07MGHLVWQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2023",
                "reviewTitle": "5.0 out of 5 stars A great book by a truly great woman",
                "reviewText": "This is about the hardest job, told with honesty and humor, emphasis on the difficulty, the purpose, and excellence of the men and women who do it. You don’t have to work in the field to learn a lot.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ash",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHD2737H32DKT4XWJ6CR57O37YAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11RCOHKC8EP?ASIN=B07MGHLVWQ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 2, 2023",
                "reviewTitle": "3.0 out of 5 stars All That Remains: A Renowned Forensic Scientist on Death, Mortality, and Solving Crimes",
                "reviewText": "Kind of interesting but a little boring.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HeyHelloHowdy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBLODRJ75FXNOSVWRFI6NXYGQ4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPGQO06DNY1WW?ASIN=B07MGHLVWQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2020",
                "reviewTitle": "5.0 out of 5 stars Interesting Read",
                "reviewText": "This is a fascinating book with a subject that usually makes people uncomfortable. Black takes an unapologetic look at death and immortality. She has stories of her youth that helped shape her outlook on life and her profession. She offers a pragmatic look on death and dying and how sometimes the process is worse for the living.Her chapter on disaster victim identification is eye opening. I knew the importance of identifying victims, but I never thought much about it when conventional means are unavailable or when an unknown number of people are involved. She provides an outline of why having a response team for such disasters is important for all countries.The chapter on Kosovo was illuminating. Both from the horrible acts of humanity and her ability to succinctly tell the story without doing a disservice to the victims.It’s an excellent book on a fascinating subject. I recommend this to anyone interested in forensic anthropology or true crime.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "motype",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHO2VEXLAECDXIYWVUM2RFYXYGHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCNTBC2YXT97A?ASIN=B07MGHLVWQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2022",
                "reviewTitle": "4.0 out of 5 stars So interesting",
                "reviewText": "Though I could not ever be an anatomist (my heightened perception of smell makes many things impossible for me), the subject is fascinating, educational and maybe one day I’ll even be able to use one of the bits of knowledge I learned here to answer a question that comes up in my daily senior citizen life as a library clerk. Or to liven up a boring evening out with friends. (I love Sue Black’s sense of humor.)",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carolyn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 23, 2023",
                "reviewTitle": "Great Sue Black book",
                "reviewText": "This is a great Sue Black book. Because of her job she deals with death and trying to identify remains of bones. She does this with great kindness to the bones and hopes to find answers for relatives. People want to know how someone died. She deals with consideration she shows this by her writing.Naturally her job has taken her to Kosovo to try and identify remains.She comes across as a considerate person with a job most of us would not want to do.This is well written and in a style that can be read easily.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bill Babichuk",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 29, 2021",
                "reviewTitle": "Unexpectedly delightful",
                "reviewText": "The writer writes with a steady hand, slowly revealing her admirable self as she simultaneously introduces her craft by taking our hands and leading us through her own introduction to it. Thoroughly engaging.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany Lima",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 5, 2019",
                "reviewTitle": "Muito bom",
                "reviewText": "Do jeito que eu esperava! Perfeito",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deada",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on October 12, 2020",
                "reviewTitle": "Ottime condizioni!!!",
                "reviewText": "Ho scelto di comprare quello usato, con un costo ridotto quasi il doppio del prezzo. La spedizione è stata molto puntuale e le condizioni del libro erano ottime...non saprei neanche distinguere uno nuovo. Grazie!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eme",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 1, 2019",
                "reviewTitle": "Excellent!",
                "reviewText": "As a person very interested in medicine, this book has been great. I found it’s written in a very realistic and down-to-earth way. Thank you very much, Dr. Black!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}