{
    "remaining_requests": 419,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Writing-Breakout-Novel-Insider-Fiction/dp/158297182X",
    "body": {
        "name": "Writing the Breakout Novel: Insider Advice for Taking Your Fiction to the Next Level",
        "price": "$14.98$14.98$9.97$9.97",
        "originalPrice": "$18.99",
        "rawPrice": 14.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Writing-Breakout-Novel-Insider-Fiction/dp/158297182X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61jhIFvn83L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Donald Maass",
            "link": "https://www.amazon.com/Donald-Maass/e/B001JASU0W/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Zoom Books Company and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 616,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            ""
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 58 mins",
            "FREE delivery February 27 - 29 on orders shipped by Amazon over $35",
            "Or fastest delivery February 26 - 28"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Take your fiction to the next level!Maybe you're a first-time novelist looking for practical guidance. Maybe you've already been published, but your latest effort is stuck in mid-list limbo. Whatever the case may be, author and literary agent Donald Maass can show you how to take your prose to the next level and write a breakout novel - one that rises out of obscurity and hits the best-seller lists.Maass details the elements that all breakout novels share - regardless of genre - then shows you writing techniques that can make your own books stand out and succeed in a crowded marketplace.You'll learn to: • establish a powerful and sweeping sense of time and place • weave subplots into the main action for a complex, engrossing story • create larger-than-life characters that step right off the page • explore universal themes that will interest a broad audience of readers • sustain a high degree of narrative tension from start to finish • develop an inspired premise that sets your novel apart from the competitionThen, using examples from the recent works of several best-selling authors - including novelist Anne Perry - Maass illustrates methods for upping the ante in every aspect of your novel writing. You'll capture the eye of an agent, generate publisher interest and lay the foundation for a promising career. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Writer's Digest Books (January 1, 2002)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 272 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 158297182X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1582971827"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 8.9 x 5.98 x 0.65 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#113,483 in Books (See Top 100 in Books) #136 in Authorship Reference #226 in Writing Skill Reference (Books) #340 in Fiction Writing Reference (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 616 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Christine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6OO3DHE4OF6PNPDL4O4XZ3GOHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZEW0Q1LFGMGJ?ASIN=158297182X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Before you write...",
                "reviewText": "Read this book. Period.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JLD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4WY5RPX3GE6KFWRIJFVBXF77SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R933CEHEGXUD?ASIN=158297182X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2012",
                "reviewTitle": "5.0 out of 5 stars Breakout::Breakout book",
                "reviewText": "Writing the Breakout Novel is clearly a book that every aspiring writer should consider reading.As far as to say that Donald Maass is a definitive source or this is a definitive work would be presumptuous.There are quite a few definitive ideas in here that I believe every writer should know. And I believe it is presented with an entertaining and authoritative air.I must admit that I made the mistake of reading The Fire in Fiction first and I don't believe that it is quite as informative as this book is. It in fact reads mostly like mini reviews of some of the author's favorite book.What Writing the Breakout Novel has is both a readers and an agents eye view of necessary elements in writing to entertain your readers and keep their interest.I think the best thing that I came away with, from this reading, was something I'd already suspected. That is that when as a writer I struggle to rein myself in as regards purple prose, showing rather than telling, writing active as opposed to passive, and other such nonsense; I have to keep in mind the ideal of balance in all these areas.I think that his book makes it clear that these are all stylistic parts of writing that can either enhance or detract from the story and that as with many other things there is a time and place for everything.Yes there are things an author should try to do to be more marketable and those are covered here, but Donald is in no way preachy about these ideas. I believe Donald is quite clear that there is a need for balance and his notion is not to make all writers write the same- but, to make them all write better.I'm not sure that my writing will ever reach the level of respectability that he holds out for, but I think I can easily see where I need to improve and that's what counts as to how this book works as a tool.I will definitely recommend this along with other tools to all of my friends and even those who help me edit my work.I especially like the notion I was able to take away that when questioning things like POV (point of view) and tense that it is not as some would try to make a person believe ; too difficult and not recommended for a new author to go down such a path; but it's more likely that the style around what the author is trying to do just needs to be focused to make it more readable.And Donald Maass gives examples and ways for this to be accomplished.It the difference that you see when trying to do a do it your self task at home and someone comes and says.\"You are going about that the wrong way.\" Then they walk away.They could have at least shown you the right way- but maybe they don't know the right way.What Donald Maass says here is let me show you how to make that work.Two thumbs up.J.L. Dobias",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacqui Murray",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYCJGF2DYH4CUEZFE4VVNG2DWBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ENQBDGRRL3JN?ASIN=158297182X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2010",
                "reviewTitle": "4.0 out of 5 stars Only One Mistake--the Rest Belongs in Your Reference Library",
                "reviewText": "I have a library of books on how to write, each supposed to rocket me to the next level, morph me from mid-list writer to best-seller. Each of them provided some tidbit that is now integral to my writing style, something I remember and use every time I sit down at my computer and unleash my muse.Well if I'm honest, some of them were a waste of money. Those, I tossed so they don't remind me how I wasted my hard-earned money.But Writing the Breakout Novel is one I keep as a reference. Donald Maas' voice is one I enjoy. It's down-to-earth, friendly, not pedantic, not judgmental. He doesn't frighten me or make me feel the information he's sharing is something I won't be able to achieve. He's humble about what he's achieved, which makes me feel I too can conquer those mountaintops. Here are some of the high points:* He includes critical aspects of good fiction--premise, time and place, plot, characters, plot techniques, viewpoints, pacing, voice, endings. In fact, he has most of what causes problems for writers.* Each chapter includes a checklist, reminding me what I should have learned from that section. Since this is not casual reading for me--I read these types of books to improve my craft--I like this. For example, the chapter on 'Premise' includes this checklist:o A breakout premise can be builto Plausibility means that the story could happen to any of uso Inherent conflict means problems in your 'place'.* Where most writer's how-to books warn that the preponderance of novels are never published--plead with us not to get our hopes up--Maas has the guts to say, \"If you have indeed written your breakout novel, chances are some people along the road to publication are going to think so, too. Big things are going to happen.\" Wow. Now I'm excited about my prospects. Sure, I heard his disclaimer--if I have indeed written that magnificent novel--but Maas assumes if I've taken his advice to heart, I will write a great novel, and proceeds to explain what the next steps are. He includes Breakout Publishing, Breakout Living, Success, Sequels, Series and Beyond. OMG. I might hyperventilate.The only thing I found wrong in this book was on page 31 when Maas confidently puts in stone words that are probably haunting him as you read my review, \"The e-revolution may not save us; indeed, it may not happen.\" It's happened and woe the writer or publisher or agent who sticks his finger in that dike.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erik D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFK6ESQBEBTQCSJX3TXP7KCIPZZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W548QLN5ZAXX?ASIN=158297182X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 2, 2023",
                "reviewTitle": "5.0 out of 5 stars LOVE LOVE LOVE this book",
                "reviewText": "I’ve read some other reviews that thought this book was too general, but this book was a game changer for me.I’m an advertising copywriter by profession, and am familiar with concepting ideas (basically brainstorming with focus), but the “ what if” prompts and questions along with the examples given in the book was absolutely a game changer for me and helped completely change the conceit/idea of the sequel to the current book I’m writing.Gave me a solution/twist I hadn’t even considered.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeni Teni",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERD6LHBKVKFU5FCKPPPX2YFETFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38UXGD8ET4TAZ?ASIN=158297182X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome!!!!!",
                "reviewText": "I was engrossed. I learned sooooo much!!!! Excellent content and well written.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave Wickenden",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 11, 2022",
                "reviewTitle": "Highly recommended!",
                "reviewText": "Donald Maass is both an author and literary agent who has years of experience in finding what works and what doesn’t in the books that sell. In a clear, concise manner, Maass takes the reader through the different parts of a novel that can elevate your story. Dealing with plot, characters, premise, and other key areas of your story, he gives concrete explanation and example of how any author can elevate their writing.I will definitely be trying some of the strategies in my own stories mentioned in this thought-provoking examination of great writing. Recommended for beginners or seasoned authors.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 19, 2023",
                "reviewTitle": "Un libro super completo",
                "reviewText": "Este es un libro muy completo sobre el arte y el oficio de escritor de novelas. Prácticamente toca todos los puntos esenciales, desde el tratamiento de los personajes, la trama, etc etc. Muy recomendable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 12, 2019",
                "reviewTitle": "Great experience",
                "reviewText": "On time delivery. Quality product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria Schwarzbach",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 18, 2018",
                "reviewTitle": "Absolut interessant auch für bereits erfahrene Autoren",
                "reviewText": "Nicht alle Informationen in diesem Buch sind neu, aber das Buch ermöglichst einen sehr guten Überblick und damit effizientes Arbeiten.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "はた",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on December 26, 2018",
                "reviewTitle": "A good read!",
                "reviewText": "An interesting book filled with good advice and many useful tips. Recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$14.97",
                "sellerName": "BooksterUS",
                "sellerRating": "3.5"
            },
            {
                "price": "$14.98",
                "sellerName": "PrimeBookstore📚",
                "sellerRating": "5"
            }
        ]
    }
}