{
    "remaining_requests": 441,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Writing-Breakout-Novel-Workbook-Donald/dp/158297263X",
    "body": {
        "name": "Writing the Breakout Novel Workbook",
        "price": "$19.94$19.94",
        "originalPrice": "",
        "rawPrice": 19.94,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Writing-Breakout-Novel-Workbook-Donald/dp/158297263X",
        "soldBy": {
            "sellerID": "A1ZWVJTZO5RWFA",
            "name": "ZBK Wholesale",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1ZWVJTZO5RWFA&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61F3aQJmwQL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Donald Maass",
            "link": "https://www.amazon.com/Donald-Maass/e/B001JASU0W/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ZBK Wholesale",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 281,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Donald Maass is a powerful force in the New York book community. As the president and founder of the Donald Maass Literary Agency, he sells more than 100 novels a year, teaches writing workshops across the country, and is a celebrated author in his own right. His personal writing credits include 14 novels (published under pseudonyms), The Career Novelist and Writing the Breakout Novel. Donald lives in New York City."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 13 hrs",
            "FREE delivery February 27 - 29 on orders shipped by Amazon over $35",
            "Or fastest delivery February 25 - 27"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Make Your Novel Stand Out from the Crowd!Noted literary agent and author Donald Maass has done it again! His previous book, Writing the Breakout Novel, offered novelists of all skill levels and genres insider advice on how to make their books rise above the competition and succeed in a crowded marketplace.Now, building on the success of its predecessor, Writing the Breakout Novel Workbook calls that advice into action! This powerful book presents the patented techniques and writing exercises from Maass's popular writing workshops to offer novelists first-class instruction and practical guidance. You'll learn to develop and strengthen aspects of your prose with sections on: • Building plot layers • Creating inner conflict • Strengthening voice and point of view • Discovering and heightening larger-than-life character qualities • Strengthening theme • And much more! Maass also carefully dissects examples from real-life breakout novels so you'll lean how to read and analyze fiction like a writer. With authoritative instruction and hands-on workbook exercises, Writing the Breakout Novel Workbook is one of the most accessible novel-writing guides available.Set your work-in progress apart from the competition and write your own breakout novel today!",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Writer's Digest Books (January 1, 2004)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 240 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 158297263X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1582972633"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 8.51 x 0.69 x 10.93 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#91,845 in Books (See Top 100 in Books) #28 in Mystery Writing Reference #105 in Authorship Reference #268 in Fiction Writing Reference (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 281 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Judie Meier-Franz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGN5O4DY3WHI3UEPPUUDXGIFJY2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GWETXD6BUMVM?ASIN=158297263X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Good product",
                "reviewText": "A bit slow to send out and arrive, if you need it quickly upgrade shipping. The product itself arrived in good condition and definitely recommend this workbook!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Birdfeeder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3WNCD7J4OAYB2K4F3VJUXBQ7KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ULJVM1WLGXGE?ASIN=158297263X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2014",
                "reviewTitle": "5.0 out of 5 stars The Breakout Novel Workbook!",
                "reviewText": "It is the breakout novel workbook. I read many books on craft of writing, some books giving tips and exercises for writers to do which I almost never did before because they were BORING. I admit this workbook is wonderful. With exercises given to a novelist, a person builds a wonderful story. I did every exercise and couldn't stop. I wrote 15,000 words just brainstorming. No, I didn't finish the project yet. It has so much depth. It will take me awhile to put everything together. But I know I'll never run dry.The author of this workbook teaches you how to motivate your characters whose actions aren't predicted by readers, giving you tips how to build believable twists and suspense throughout.This workbook teaches you how to build three dimentional characters. I wanted to say four dimentional, but the term doesn't exist. It goes beyond everything I have read on building three dimentional characters.He shows you how to build the main plot, subplots, and how to deepen character layers. He combines and puts everything together as a package at the end. And indeed, anyone who goes over these excercise or not will never look the same way at characters and plots.If you're wondering if this workbook contains the same information as the book, I tell you it is MUCH BETTER than a book. If you have to decide, choose this workbook because it gives you lessons throughout and expands on the information given in the book of this series. I did read the book. But the workbook contained ALMOST everything that's in the book and MORE.The book does have just a tiny bit info that's not included in a workbook. I forgot what that tiny bit of info is. But I remember I made a mental note it wasn't so much important. That is most likely why I can't remember it now. It wasn't that important--go figure.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aisling D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVV3PU2DXKRDEJ4DO22IMOFX2UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26H804TM36IMZ?ASIN=158297263X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2022",
                "reviewTitle": "4.0 out of 5 stars Excellent as a stand-alone workbook for your next novel",
                "reviewText": "Since I was already familiar with Donald Maass's previous writing about... well, writing... I skipped the related book and went straight to this workbook.It's complete. It may be all you need to outline and develop your next novel, especially if you're already familiar with story beats, and so on.The book is printed on good paper, and the layout makes it easy to fill in the blanks. Lots of space to write in!All in all, I'd say this is best for someone not quite a beginner, but struggling to make a story work. This workbook can give you the insights you need to see what's missing (or overdone) and turn out a successful novel.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edward D Padilla",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECM7HT27VVOWMGDMBVRUE4HAWHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IYY01CB6LS07?ASIN=158297263X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "Love the exercises",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KMH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3UA5M6FT5ANLKBCUELTYLJY3EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS3JM0ABA8BP3?ASIN=158297263X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2022",
                "reviewTitle": "3.0 out of 5 stars Helpful, but…",
                "reviewText": "Very helpful for a novel in middle stages of composition. Working through the exercises helped me identify some issues that were holding up my progress. I was, however, a bit put off by bizarre examples in the “Larger Than Life Character Qualities” section. Firstly, Maas basically expresses a grudge against a girl in high school who chose to have sex with someone else instead of him (as if a girl who is sexually active is somehow obliged to have sex with any guy who wants her). Secondly, he excuses statutory rape by a character in One For the Money because the teenage female character, a virgin, “willingly accepted his advances.” In fact, oddly enough, all five examples in that section focus on female sexuality. This felt just plain weird to me, undermining Maas’ ethos for me personally. Still I made the best of the book. If you can overlook this sort of thing, it’s a good investment in your craft.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ruth M. Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW4YWSLSUGUGTBUIURIASEZ3ZTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36NSZ1CDJNE5M?ASIN=158297263X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2005",
                "reviewTitle": "5.0 out of 5 stars An Eyeopener for Advanced Students of Fiction Technique",
                "reviewText": "What does an aspiring novelist do when they've read just about all the how-to books out there? This has become my own dilemma, since I've read over 30 of the best fiction writing books (often twice) and am still looking for new insights and pearls of wisdom. It's not a bad idea to read the basics of fiction writing multiple times, since repetition is the surest way to permanently absorb and remember all the many details one must know to succeed in the novel writing market. This is why I heartily recommend Maass' new workbook IF YOU HAVE MASTERED THE BASICS AND ARE READY TO TACKLE THE ADVANCED ASPECTS OF NOVEL TECHNIQUE. Reading his previous book, \"Writing the Breakout Novel\" is imperative, and having read it twice is even better preparation. By expounding on his previous book's instructions and providing over 500 individual tasks to aid in improving and refining what you've already written, Maass has written a workbook that should make a big difference to anyone willing to spend the time and energy required to write a truly great story. This book is not for beginners, and it's not for sissies, but if you are thoroughly committed to succeeding and have already written a substantial part of your manuscript, it can give you the help you need to put you over the top. Bookstores are full of mediocre novels that somehow got published. Donald Maass has set a new standard for excellence. If you're serious, get \"Writing the Breakout Novel\" and \"The Writing the Breakout Novel Workbook,\" and go for it!",
                "reviewVotes": "43 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "prop0017",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2R244Z6HAU3N5QS2O75N7DFF6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSWOEYPMW39A9?ASIN=158297263X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2021",
                "reviewTitle": "5.0 out of 5 stars Best book about the craft I’ve ever read",
                "reviewText": "I read a lot of books on the craft, and this is by far the best book. It’s full of all the insights one needs to write their novel. It inspired me to peel back the layers of my characters. It helped me find a dual plot to give my novel that X factor. I did every exercise and most beyond the page allotted. I especially loved that the exercises were abstract enough to cater to my novel but also reaffirmed what we just learned in that chapter. The examples he shares throughout are strong too. I have a masters in instruction and often feel workbooks can’t find the balance of being entertaining, interesting, educational, and are able to let the reader apply the knowledge that they just learned, but this book has it all.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Happy Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6F4RWIA6O65HMUVG5FZSYUX6YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTUZ6Z8T7LQT9?ASIN=158297263X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 11, 2023",
                "reviewTitle": "5.0 out of 5 stars A terrific help for a writer",
                "reviewText": "This is a really great help to anyone who wants to write a fleshed-out story that readers can feel as they turn the pages.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 6, 2022",
                "reviewTitle": "Excellent workbook, designed to add depth, and powerful story lines to your writing.",
                "reviewText": "The writing is concise, illustrating his suggestions with examples from well-known books. It’s clear to follow and easy to read between very well thought out exercises that you can apply to your work in progress. He tells you what to look for in your own writing to strengthen it. This book certainly makes me think about my own writing and where to add more depth.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abhimanyu Kulkarni",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 27, 2020",
                "reviewTitle": "Satisfied with the purchase",
                "reviewText": "Arrived as promised, well packaged",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sprocket",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 21, 2022",
                "reviewTitle": "Reworking of the Book",
                "reviewText": "This is a reworking of the book to provide blank lines to write stuff on. The exercises in the book are word for word copied in this workbook. So, each question in the original book gets a full page (or close to it) in the workbook. If you have the original book (and that is worth your dime) you do not need the workbook. If you have the workbook then equally you do not need the original book.The packaging left a lot to be desired as well. It was damaged on arrival packed in a paper bag. Amazon maybe could have a look at the durability of the packaging for these larger workbook style books. This may be a better practical buy for writers, or even for a course on writing, than the original book. But it needs to be intact on arrival.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CatsAndBooks",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 22, 2017",
                "reviewTitle": "Stimulating, unpredictable, helpful exercises",
                "reviewText": "This is a great workbook. I found the exercises stimulating and surprising, and they enriched my novel greatly. I used the book several years ago for a dark epic fantasy novel, applying every single exercise, and it really added something extra to my novel, twists that made the story at the same time less predictable and more believable. Since then, I've applied individual exercises to other works of fiction.I believe this book will be inspiring for novelists of all genres. Writers who have progressed beyond the basics of their craft will benefit most. Beginners may not get the full benefit, although they should still be able to gain inspiration. The best time to use this book is when you've finished the first draft, and are ready to rewrite and revise it with more depth, more tension and more interest.It's a large-format paperback and you can write the answers directly into the spaces provided, or in a notebook. I've done both. (Now when I open the book to do exercises for a new work of fiction, I see my old notes for that dark-epic fantasy novel and remember with a surprised smile that this was where certain ideas came from.) There's also a Kindle version, but I've heard from people who bought this that there are formatting problems which make the book nearly unusable.Each assignment comes with information and samples from published novels. At times, this reads like a series of advertisements for books by his literary agency clients, and some people may find this grating. I don't mind, because the examples are well chosen to illustrate the point, and it makes sense that he chose his own clients' work, not just to promote them, but because he could get copyright permission for the excerpts. Something you need to be aware of is that some of the excerpts may not be to your taste - their content may cause offence. For this reason I wouldn't recommend the workbook to young readers.Donald Maass' non-ficton book 'Writing The Breakout Novel' is interesting and readable, but you don't need it for the workbook. The workbook works well on it's own.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JuleM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 3, 2007",
                "reviewTitle": "Geniales Buch für stagnierende Autorenkarrieren",
                "reviewText": "Ich habe das Buch ohne große Erwartungen gekauft, einfach weil ich ein Selfhelp-Writing-Bookfreak bin. Ich dachte nach den vielen Büchern, die ich schon geschrieben habe, könnte ich da nicht mehr wirklich viel lernen. Ha! Irrtum! Es ist großartig, alle Übungen bringen jeden Autor weiter. Man erkennt plötzlich, wo es hakt. Und zwar glasklar. Auch wenn die Aufgaben merkwürdig erscheinen, z.B. man mal überlegen soll, ob man einige Figuren zusammenlegen kann etc. Klar gibt es auch Übungen, die man schon von anderen Büchern kennt ( was ist das Ziel der Figur etc.etc.) aber trotzdem ein Gewinn. Gut auch in Kombi mit dem Buch, aber mir persönlich hat das Workbook am meisten gebracht.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$17.75",
                "sellerName": "Books With J3 LLC",
                "sellerRating": "4.5"
            }
        ]
    }
}