{
    "remaining_requests": 430,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Survived-Attacks-September-Graphic-Novels/dp/133868048X",
    "body": {
        "name": "I Survived the Attacks of September 11, 2001: A Graphic Novel (I Survived Graphic Novel #4) (4) (I Survived Graphix)",
        "price": "$8.24",
        "originalPrice": "",
        "rawPrice": 8.24,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Survived-Attacks-September-Graphic-Novels/dp/133868048X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91nK+BU5A2S._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lauren Tarshis",
            "link": "https://www.amazon.com/Lauren-Tarshis/e/B001JRRKRE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 1062,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"The comic book format works well with intense pacing, searing images and edge-of-your-seat suspense.\" -- San Francisco ChroniclePraise for I Survived the Sinking of the Titanic, 1912 (I Survived Graphic Novel #1):\"The first installment of Tarshis' sprawling prose disaster oeuvre for young readers is reimagined in visually interesting full-color comic panels that support its recognizable thrilling pace and convenient twists. Many of the most exciting scenes are largely wordless, spotlighting the propulsive action amid growing tensions. A fresh and interesting adaptation, making for an easy crowd pleaser.\" -- Kirkus Reviews\"Dark, subdued, inky art sets a somber tone, while a parade of mostly small panels builds suspense and promises to engage readers.\" -- School Library JournalPraise for I Survived the Nazi Invasion, 1944 (I Survived Graphic Novel #3):“A crowd pleaser … Those familiar with this installment will anticipate the traumas and triumphs of the story, while newcomers to the series will also be pulled in; all will be satisfied with the mostly happy resolution … Another effective comics translation in this first-rate series.” -- School Library JournalPraise for Lauren Tarshis's I Survived chapter books:Praise for I Survived the American Revolution, 1776:\"Tarshis successfully blends historical fact with an involving narrative.\" -- School Library JournalPraise for I Survived the Destruction of Pompeii, AD 79:\"Tarshis serves up another gripping adventure... with the light-speed pacing and death-defying maneuvering fans have come to expect.\" -- BooklistPraise for I Survived the Battle of Gettysburg, 1863:\"Informative and breathlessly paced.\" -- Kirkus ReviewsPraise for I Survived the Attacks of September 11, 2001:\"[Tarshis] crafts a dramatic, emotionally intense tale that takes account of 9/11's physical and emotional costs -- short- and long-term -- while ending on an upward beat.\" -- Kirkus ReviewsPraise for I Survived Hurricane Katrina, 2005:\"Expressive illustrations capture the drama of the storm and its aftermath, but the book's real power comes from its exploration of what it means to be a hero.\" -- BooklistPraise for I Survived the Shark Attacks of 1916:\"A gripping story that will hold the interest of reluctant readers.\" -- School Library JournalPraise for I Survived the Sinking of the Titanic, 1912:\"The fast pace and intrinsically fascinating disaster story will keep readers turning the pages.\" -- Kirkus Reviews About the Author Lauren Tarshis's New York Times bestselling I Survived series tells stories of young people and their resilience and strength in the midst of unimaginable disasters and times of turmoil. Lauren has brought her signature warmth and exhaustive research to topics such as the battle of D-Day, the American Revolution, Hurricane Katrina, the bombing of Pearl Harbor, and other world events. She lives in Connecticut with her family, and can be found online at laurentarshis.com.Corey Egbert is a children’s illustrator and author based in rural Virginia. He believes in telling imaginative, funny, and touching stories that empower kids to make their world better. He studied at Snow College, Southern Virginia University, and Syracuse University. Corey lives with his wife, son, and two cats in a little house by the woods. Visit him online at coreyegbert.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 13 hrs 59 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A gripping graphic novel adaptation of Lauren Tarshis's bestselling I Survived the Attacks of September 11, 2001, in time for the 20th anniversary of 9/11.The only thing Lucas loves more than football is his Uncle Benny, his dad's best friend at the firehouse where they both work. Benny taught Lucas everything about football. So when Lucas's parents decide the sport is too dangerous and he needs to quit, Lucas has to talk to his biggest fan.The next morning, Lucas takes the train to the city instead of the bus to school. It's a bright, beautiful day in New York as he heads to the firehouse. But just as he arrives, everything changes -- and nothing will ever be the same again.Lauren Tarshis's New York Times bestselling I Survived series comes to vivid life in bold graphic novels. Perfect for readers who prefer the graphic novel format, or for existing fans of the I Survived chapter book series, these graphic novels combine historical facts with high-action storytelling that's sure to keep any reader turning the pages. Includes a nonfiction section at the back with facts and photos about the real-life event.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Childrens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2966"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Graphix (August 3, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 160 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 133868048X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1338680485"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 10 years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN570L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 3 - 7"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.25 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,311 in Books (See Top 100 in Books) #42 in Children's American Historical Fiction (Books) #175 in Graphic Novels (Books) #459 in Children's Action & Adventure Books (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 1,062 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Zombie Season The Dragonet Prophecy (Wings of Fire Graphic Novel) 39 Clues:Maze of Bones (A Graphic Novel) Legends of Lotus Island: The Guardian Test The Stonekeeper (Amulet) Discover more great books! You know the protocol. You've completed countless drills. Your go-bag is waiting by the door. Yet nothing can truly prepare you for what’s coming. No one is ever ready for zombie season... Not every dragonet wants a destiny ... Clay has grown up under the mountain, chosen along with four other dragonets to fulfill a mysterious prophecy.. He's not sure about the prophecy part, but Clay can't imagine not living with the his best friends. Minutes before she died Grace Cahill changed her will, leaving her decendants an impossible decision: \"You have a choice - one million dollars or a clue.\" Young Plum is shocked to discover that she’s been accepted to the Guardian Academy on Lotus Island, an elite school where kids learn how to transform into Guardians, magical creatures who are sworn to protect the natural world. The first book in Kazu Kibuishi's #1 New York Times bestselling series that features a beautiful but dangerous world of new friends, giant robots, and shadowy enemies!",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2fc48a0b-6097-48c7-8727-5a94e586371a.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0a475f5-2257-4bae-a3c1-b9616ccef622.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6291deff-a9f0-43ad-b1bb-4211c6016a03.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/989ea650-4c82-439c-add8-413a81323118.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/027f4691-9111-45da-9c1a-2d569edf7cdf.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49d4a216-a817-40e3-94bc-0ed837e1aee2.__CR0,0,300,600_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Brittany",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4S554HFFBDNWNQ3VCVRKLRXR6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LXLKR2WO00WC?ASIN=133868048X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2023",
                "reviewTitle": "5.0 out of 5 stars A Powerful and Emotional Retelling of a Tragic Day",
                "reviewText": "I Survived the Attacks of September 11, 2001: A Graphic Novel is an incredibly moving adaptation of the heart-wrenching events that unfolded on that fateful day. As a long-time fan of the \"I Survived\" series, I was eager to see how this graphic novel would capture the essence of such a pivotal moment in history.Lauren Tarshis, the talented author behind the original \"I Survived\" books, has skillfully brought her storytelling prowess to this visual format. The artwork by Corey Egbert is simply stunning, capturing the raw emotions and the terror that engulfed New York City that September morning.What sets this graphic novel apart is its ability to connect readers, young and old, with the experiences of those who lived through the attacks. The story follows a young boy named Jake, who finds himself caught in the chaos as the Twin Towers crumble. Through Jake's eyes, we witness the tragedy unfold, while also discovering the power of friendship, bravery, and resilience.Tarshis masterfully weaves historical facts into the narrative, providing readers with a deeper understanding of the events. The inclusion of real-life testimonials from survivors adds an extra layer of authenticity, making the story all the more poignant. The graphic novel format allows for a visual representation of the devastation, making it a compelling and accessible resource for readers of all ages.As a parent, I appreciate the sensitivity with which the author approached such a difficult topic. She addresses the fear and confusion that children may have experienced during this time, while also emphasizing the importance of hope and unity. It's a testament to Tarshis' talent that she can tackle such a weighty subject matter while maintaining an age-appropriate tone.\"I Survived the Attacks of September 11, 2001: A Graphic Novel\" is an essential addition to any library. It not only provides an engaging reading experience but also serves as a powerful tool for educating young readers about this significant moment in history. This graphic novel is a testament to the resilience of the human spirit and a reminder of the importance of remembering and honoring those who lost their lives on that tragic day.I highly recommend this book to anyone seeking a thought-provoking, emotionally charged, and educational read. Whether you're a fan of the original \"I Survived\" series or new to the franchise, this graphic novel will undoubtedly leave a lasting impact on your heart and mind.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLQOHFO2XQKLKRHXS5SIF5BUADA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SER3CIIAB1SD?ASIN=133868048X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars My son loves these books.",
                "reviewText": "My son is 8 and lives these books!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEPXBVHHV3EVSQZMSGP3TEQTHSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LWHRVACATY21?ASIN=133868048X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2023",
                "reviewTitle": "5.0 out of 5 stars A wonderful depiction of a tragic attack and a pivotal event in U.S. history. An awesome read!",
                "reviewText": "The events of that fateful morning played out so dynamically and exuberantly. Kaboom! Wow! Down they went.Two weeks before, we hear the story of a boy named Lucas, whose uncle got him into sports. With his dad being a NY fireman, his uncle was really there for him and his family. The memory of his dad’s fire accident still haunted him. One of the most horrible days of Lucas’ life was the doctor suggesting he not play football anymore because he’s had so many concussions. He didn’t realize it that a much larger problem was looming ahead.The images of the smoke coming out of those towers were just jaw-dropping. Wow! The pictures looked like war.After the day of Sept 11, Lucas realized what was more important in life.A wonderful depiction of a tragic attack and a pivotal event in U.S. history. An awesome read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQVEVPYKQZOPZPUB4TUFH4VPVWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BDFD4T831FVW?ASIN=133868048X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Interesting topic",
                "reviewText": "My grandson loves reading about factual information and this is appropriate forHis Age group. Written in comic form, a fictional character tells about his life but it incorporates the true event at the end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "flipflops",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWAKWLUCWMPXU6NPHTB5JC54QKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3J268GKZMJTHR?ASIN=133868048X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Great graphic version of the I survived series",
                "reviewText": "The graphic comic series of I survived books are fantastic- my son already loved the series but this takes it to whole new level. He loves them and this was no different. This book does a good job of discussing a very sad and recent memory for a lot of us parents who remember that day vividly with a bit of light heartedness to break up the heaviness. Great quality and seller- highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jamie Martinez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4RL2KCHRWTAYRDERLA42652IFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16ZG7LRCMHVCX?ASIN=133868048X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 14, 2023",
                "reviewTitle": "5.0 out of 5 stars My students love this book!",
                "reviewText": "My students and I have recently become obsessed with the I Survived series. We were ecstatic to find out that there were graphic novels made of the series! I teach English language learners so the pictures help them to understand the book. I will purchase every book made after this!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonymous ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFCLC7A4HO3L2L664FLOCWOQ2VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4L1I4N2JBBE6?ASIN=133868048X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Very touching book",
                "reviewText": "I read this book out loud with my 7 year old son and the way it was written was so touching, it brought us both to tears.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Ann Mason",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSHX4TWPWOICMLKNTQWSSW7CK4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8N5A69NTYESU?ASIN=133868048X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Giftable",
                "reviewText": "My great grandson asked for this. As most who want to see kids succeed even a graphic novel to get them to read is fair game.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jodie wright",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 9, 2021",
                "reviewTitle": "Cam creased pre ordered but cam half creased and had finger print marks",
                "reviewText": "I disliked how this item cam creased",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claudia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 22, 2022",
                "reviewTitle": "My 10 yr old read it in one day.",
                "reviewText": "My son loves graphic novels and the I survived books. He read this one the same day we received it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}