{
    "remaining_requests": 649,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Calling-Dr-Laura-Graphic-Memoir/dp/0547615590",
    "body": {
        "name": "Calling Dr. Laura: A Graphic Memoir",
        "price": "$21.99$21.99",
        "originalPrice": "",
        "rawPrice": 21.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Calling-Dr-Laura-Graphic-Memoir/dp/0547615590",
        "soldBy": {
            "sellerID": "A34MOU1WOG7LRW",
            "name": "Zoom Books Company",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A34MOU1WOG7LRW&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "Only 10 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81MqkqEu5QL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Nicole J. Georges",
            "link": "https://www.amazon.com/Nicole-J-Georges/e/B00DW7SS5M/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Zoom Books Company",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 172,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews From Booklist Alison Bechdel’s Are You My Mother? (2012) explored a lesbian cartoonist’s relationship with her mother, both in the past and in the present. Georges’ memoir may be broadly categorized as examining similar ground in the same format, but here the memories, the mother, and the cartoonist herself bring very different details to the work, and thus provide a very different tale. Georges’ quirky, big-faced, and evocative drawings, tempered by a variety of panel sizes, show the bespectacled author as she comes to terms with her mother’s lies to her as a child about her father being dead; her girlfriend’s impatience with the adult Georges’ tolerance for her mother’s intolerance; the clutch of dogs (and a chicken or three) and the stuffed animals who safeguard Georges’ sense of security in both youth and young adulthood; and the attraction Dr. Laura Schlessinger offers in her pat, specific directions for relief from the discomforts of uncertainty. An excellent graphic memoir offering engaging insights for those who share—or don’t share—any of Georges’ worries and traits. --Francisca Goldsmith Review \"Honest and charming...[Georges] makes her debut as a developed and skilled storyteller.\"-Philadelphia Inquirer \"A charmer.\"-Cleveland Plain Dealer \"A bracing debut from a promising graphic novelist that deals with abuse, forgiveness, and family secrets.\"-Daily Beast \"There's a depth to Georges' work...an intense interest in finding out not just who she is but what it means and why it matters.\"-Oregonian A \"tart, honest graphic memoir.\"-Slate \"A tragicomic graphic memoir with a stunning indie aesthetic.\"-Bookslut “An engrossing, lovable, smart and ultimately poignant trip through a harrowing emotional bottleneck in family life. It's great art, great writing, a great story – I can't wait for what's next from Nicole. What a wonderful book.” -Rachel Maddow \"Engaging...incisive...The author approaches [her story] with the tenacity of a detective.\" -Publishers Weekly \"Nicole Georges spins a riveting family mystery. There's a powerful chemistry going on between her delicate drawings and the probing honesty of her investigations. CALLING DR. LAURA is disarming and haunting, hip and sweet, all at once.\" -Alison Bechdel \"I wouldn't want to live in a world without Nicole! And now no one has to! This book is a charming little gem. An honest glimpse into the life of a self-employed, smart and witty Portland femme gay with an upbringing so weird it's normal.\" -Beth Ditto \"Anyone who knows Portland, OR. will know Nicole J. Georges, the witty girl with the cat glasses and a devoted following for her talents as an illustrator and zinester . . . Whatever the results, one can bet that this new work from Georges will be a good time.\" -Lambda Literary, \"Five New Queer Voices to Watch Out For\" — About the Author Nicole J. Georges is a professor, writer, and illustrator, who has been publishing her own zines and comics for twenty years. She is the author of the Lambda Award-winning graphic memoir Calling Dr. Laura and the diary comic Invincible Summer. She lives in Portland, Oregon. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 14 hrs 25 mins",
            "FREE delivery March 1 - 7 on orders shipped by Amazon over $35",
            "Or fastest delivery February 29 - March 4"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The acclaimed debut graphic memoir by the author of Fetch: “a beautiful and innovative portrait” of young adulthood and confronting family secrets (NPR).When Nicole Georges was two years old, her mother told her that her father was dead. When she was twenty-three, a psychic told her he was alive. Her half-sister, saddled with guilt, admits that the psychic is right and that the whole family has conspired to keep him a secret. Sent into a tailspin about her identity, Nicole turns to radio talk-show host Dr. Laura Schlessinger for advice.Packed cover-to-cover with heartfelt and disarming black-and-white illustrations, Calling Dr. Laura tells the story of what happens to you when you are raised in a family of secrets, and what happens to your brain—and heart—when you learn the truth from an unlikely source. Part coming-of-age and part coming-out story, Calling Dr. Laura is “a tragicomic graphic memoir with a stunning indie aesthetic” (Bookslut). Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Harper Perennial (January 22, 2013)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 276 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0547615590"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0547615592"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.26 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 7.94 x 0.81 x 10 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#803,638 in Books (See Top 100 in Books) #252 in LGBTQ+ Graphic Novels (Books) #359 in Educational & Nonfiction Graphic Novels #23,382 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 172 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tessa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4W6ISPQL453X6QWXZCIIBFBPHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JYDG4RHMHPFL?ASIN=0547615590",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2023",
                "reviewTitle": "5.0 out of 5 stars I love this book so, so much",
                "reviewText": "For starters it has so much delicious story: a family mystery interwoven with a love story, and told with Georges' singular voice - playful, witty writing that is also deeply sincere. (Not to mention her knockout ink wash art style that I cannot get enough of - the details! The patterns!)I was also so moved by the journey she goes on in the book. I feel like so many families have a least one polite fiction or topic that is not discussed (if not more, haha). It takes such courage to pull back the curtain on those family secrets. Georges' story made me to reflect on my own history - what stories have we been told about ourselves and our childhoods? What do those stories cost us?So many laugh-out-loud moments, such artful storytelling, and such a powerful journey. 10/10. Get it for yourself and then get a copy for a friend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J.J. ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGBVD4TAVFQP2PLYZXINTJQWBIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GH47JNHMMG0W?ASIN=0547615590",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 7, 2022",
                "reviewTitle": "5.0 out of 5 stars Couldn't put it down",
                "reviewText": "The title says it all. It's fun, poignant and relatable to anyone who grew up in a family.(Especially dysfunctional families with secrets and lies,so most?) This was the first graphic novel I've ever read and i think i'm hooked",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. T. Crenshaw",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENUST5WV2WXNFGON4NBH37K5AJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YX723ZCN0OMF?ASIN=0547615590",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 5, 2014",
                "reviewTitle": "4.0 out of 5 stars Lovely indie memoir of family disfunction",
                "reviewText": "What a great memoir!Calling Dr Laura is the raw and honest memoir of graphic artist Nicole J. Georges from her childhood to this day and her life in Portland Oregon. The novel focuses on her search for her natural father, her coming out of the closet as a queer, and the process of finding who she is as person. The book has a good deal of her childhood memories and family related issues, which are not adorned or sweetened, but presented in a very naive straight forward way. She could have demonized her mother for the whole story related to her natural father, but she does not so; she does not hide anything bad about her life, experiences or people she comes across, but she does not judge them and focus more on how she felt or feels. How difficult to do and how well done! The narrative alternates the present with episodes of her childhood. The parts about her childhood are really wonderful but also a bit sad.The reading is very engaging. That is so because the book is well paced regarding the subjects presented and how they are presented, the U-turns that the author makes but still coming back to the main road, so to speak. The story is never bland or boring. Although the mystery in the novel is resolved in the epilogue, it lingers throughout the book without being overpowering.I truly liked Georges' style and versatility. She uses different graphic languages and fonts to convey meaning and create atmosphere. Although most of the book is set in interiors, I loved her drawings of road and urban landscapes. The drawings of her childhood episodes, which are very simple and child-like, are just adorable, and very different from the more elaborate and arty drawing for the narration of Nicole's present. I think this is one of those books that would have been great having it in full colour, as the book cover's image is.My favourite scenes are her story of her intestinal problems when she was a kid, the one of the boat when Radar dumps Nickie, and Nickie's fight with her mother in the car about she being a selfish brat. I also love the dog's language balloons she adds when she communicates with her dogs or they don't know what is happening - very cute.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV2UJSDQO2YTWPMVADUPQJCBCOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14CLMQB1LCMFZ?ASIN=0547615590",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 22, 2014",
                "reviewTitle": "5.0 out of 5 stars Would highly recommend for people like me",
                "reviewText": "This is not a review but a personal reaction. Wow! The simplicity of the dialogue and the naïveté of the drawings nevertheless packs a punch to anyone with mother-child issues. And who doesn't have those? It totally threw me when I noticed the sleepiness that came on Nicole whenever she spent time with her mother. It effectively opened my eyes about something I just hadn't seen for 30 years! Despite my wisdom and insight. Blaming Depression for my tendency to sleep life away when in reality it is unfinished work I have with my mother. If this is Too Personal for you, beg pardon, but it shows how a media once thought of as a childhood amusement can be translated to something else entirely. Would highly recommend for people like me, a teeming multitude!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angela M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNBDDPTOUVSN4MBP23PFRUYVRUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R00U99714R9C?ASIN=0547615590",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2014",
                "reviewTitle": "5.0 out of 5 stars lovely all around",
                "reviewText": "I really loved this book, which is not at all surprising since graphic memoirs are my favorite type of book currently. However, Nicole J. Georges has an unusually beautiful style of writing and drawing and I'll definitely watch for future releases from her. I adored this book and purposely made it last two days, although it could have been read in a few hours' time. I just wanted to savor her bittersweet story and the little world created by this lovely novel. Also, the book itself is much larger and heavier than I expected especially for the price paid. It is huge!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shields",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMWBKNCUXPFKFHDU36WQ55FDDSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ON7POUCGUE8A?ASIN=0547615590",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 16, 2018",
                "reviewTitle": "5.0 out of 5 stars Nicole J. Georges Matters!",
                "reviewText": "Another awesome graphic memoir! Nicole does a wonderful job of balancing the dramatic moments of her life with humor. I felt the \"plot\" moved along smoothly and I was genuinely hooked into the \"father\" element of the story. Also, her drawings alone make this a 5 star purchase. The author has a podcast I've started listening to since reading this and she's very entertaining on that as well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sciencenerd",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE75RDPUCICXTB6IOZIH7BVBWJPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35TJP5YXYC0SC?ASIN=0547615590",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2014",
                "reviewTitle": "5.0 out of 5 stars Fainting Goat",
                "reviewText": "I have the paper copy of this book, because graphic novels (or biographic, as the case may be) should be read that way. But I loved it so much, I wanted to have a copy on my Kindle. There are some real gems in this book. My favorite part is where she talks about fainting goats, which seems to be a non sequitur as you're reading it, until it segues into her having a discussion with her partner and, well, I don't want to ruin it for you, but it's particularly brilliant. It reminds me of Allison Bechdel's autobiographical graphic stories, and that is high praise. Great story and well-illustrated.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEPXBVHHV3EVSQZMSGP3TEQTHSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM7O48ZELKH5?ASIN=0547615590",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2021",
                "reviewTitle": "2.0 out of 5 stars Just too weird and stupid",
                "reviewText": "This is about a woman who gets to a palm reader to learn that her real father is still alive.Black and white drawings are stiff and lifeless. Some of the text is hard to read and you can’t really follow the story by the pictures. Her story is not that interesting. She adopts a chicken? Weirdo.Most of it consists of her talking about her wacked-out childhood. I don’t get it. It’s too all over the place. Makes no sense. I thought it would be funny, but it’s just too weird and stupid.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ErinErin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 1, 2023",
                "reviewTitle": "A Healing Remedy for Everyone Who Survived Childhood",
                "reviewText": "I think about Calling Dr. Laura daily, especially in my own healing journey from family secrets and trauma. It’s honours the truth while making us laugh and feel far less alone. Nicole Georges opened up the world of graphic novels to me; I draw daily because of her work. I cannot recommend this book enough. Thank you, Nicole!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81MnliSzRPL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HEN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 4, 2019",
                "reviewTitle": "Why I love Calling Dr Laura",
                "reviewText": "I think I discovered Nicole J Georges some how through Instagram maybe. I found she made comics but also has this great podcast Sagittarian Matters. After listening and following I bought this and Fetch. I love her way of story telling, I love her illustrations/comics (I can't draw people at all, but Nicole's people seem so real!) Really happy that someone like Nicole can share her personal life stories with us and they can speak to us so loudly and we can find comfort in them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Corina Orlinger",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 21, 2013",
                "reviewTitle": "Berührende Biographie",
                "reviewText": "Einen Einblick in die Gedanken und Gefühle gewähren ist das eine, es zeichnerisch zu tun, geht für mich noch einen Schritt weiter. Themen wie Verlassen werden, Coming Out und Ablehnung auf Grund von Religion werden sehr emotional in Bildern gezeigt. Teilweise hat die Autorin einen kindlicheren Stil gewählt. Dies erfolgte, so weit ich das beurteilen kann, absichtlich und zwar an Stellen an denen der Hauptperson etwas peinlich ist. Sehr gelungen! Wer \"Fun Home\" genießen konnte, für den ist dieses Werk ein heißer Tipp!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kirstie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 21, 2015",
                "reviewTitle": "Great read!",
                "reviewText": "I loved this novel.I took it on holiday with me in the summer and ended up spending most of the day reading it under an umbrella on the beach instead of doinf actual holiday things.The illustrations are fantastic. and the story is really gripping. There isn't a dull moment.You can buy signed copies on the author's​ website, and watch her latest doodles on her instagram!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jae steele",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 17, 2014",
                "reviewTitle": "Honest and enjoyable.",
                "reviewText": "I really liked this. When my mind was fried from hours of dense textbook reading, Nicole's book was like dessert. The nonlinear flow of the story made it more engaging. I loved the visual subtext in her drawings. As I went along I kept thinking of people I wanted to recommend it to. The familiarity of \"mom theatre\" from my own childhood cracked me up! The physical size of the book made it kind of a cumbersome bedtime read, but going through it on the couch or at a cafe, no problem.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$15.45",
                "sellerName": "indoobestsellers",
                "sellerRating": "4.5"
            }
        ]
    }
}