{
    "remaining_requests": 714,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Woman-No-Importance-Untold-American/dp/0735225311",
    "body": {
        "name": "A Woman of No Importance: The Untold Story of the American Spy Who Helped Win World War II",
        "price": "$11.99$11.99",
        "originalPrice": "",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Woman-No-Importance-Untold-American/dp/0735225311",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81WKyvh6CWL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sonia Purnell",
            "link": "https://www.amazon.com/Sonia-Purnell/e/B00JECNTIK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 21601,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for A Woman of No Importance:\"[An] excellent biography... if Virginia Hall herself remains something of an enigma — a testament, perhaps, to the skills that allowed her to live in the shadows for so long — the extraordinary facts of her life are brought onto the page here with a well-judged balance of empathy and fine detail. This book is as riveting as any thriller, and as hard to put down\" -- The New York Times Book Review“[A] compelling saga of a remarkable woman whose persistence was honed early on by her battles against low gender expectations and later on by her disability.”– USA Today\"A gripping take… a compelling biography of a masterful spy, and a reminder of what can be done with a few brave people — and a little resistance.” -- NPR.org“Never have I read anything like it. Every page is compelling and demands not just to be read, but absorbed. Every act reflects incredible bravery. This is what heroism looks like…Sonia Purnell has ensured Virginia Hall’s place in that great pantheon.” --FOX News\"Electrifying\" —Smithsonian.com“A fitting and moving tribute to an amazing woman.” – The Economist\"Reads like a detailed novel… Purnell’s fascinating book supports her description of Hall’s life as a ‘Homeric tale of adventure, action, and seemingly unfathomable courage.\" —The Columbus Dispatch \"Sonia Purnell has written a riveting account of Hall’s work as a ferociously courageous American spy… [she] writes with compelling energy and fine detail.\" —The Minneapolis Star-Tribune“Purnell’s writing is as precise and engaging as her research, and this book restores overdue attention to one of the world’s great war heroes. It’s a joy to read, and it will swell readers' hearts with pride.” —Booklist, Starred Review“A groundbreaking biography that reads like a spy thriller…a suspenseful, heartbreaking and ultimately triumphant tale of heroism and sacrifice.” —BookPage, Starred Review“Purnell vividly resurrects an underappreciated hero and delivers an enthralling story of wartime intrigue…fans of WWII history and women’s history will be riveted.” —Publishers Weekly“A remarkable chronicle...this lively examination…shows how, if Hall had been a man, dropping undercover in and out of occupied Vichy, Paris, and Lyon, setting up safe houses, and coordinating couriers for the Resistance, she would now be as famous as James Bond…Meticulous research results in a significant biography of a trailblazer who now has a CIA building named after her.” –Kirkus“Impressively researched and compellingly written, this brilliant biography puts Virginia Hall−and her prosthetic leg, Cuthbert−back where they belong : right in the heart of Resistance history.” —Clare Mulley, author of The Women Who Flew for Hitler: A True Story of Soaring Ambition and Searing Rivalry “In this astonishing, intriguing book, Sonia Purnell presents one of the most breathtaking stories yet told of female courage behind enemy lines. Its strength lies not only in Purnell’s intimate and moving portrayal of Virginia’s secret work, but also in the new light shed on the betrayal, bravery, and bungling of Churchill’s Special Operations Executive for which Virginia worked.” —Sarah Helm, author of Ravensbrück: Life and Death in Hitler’s Concentration Camp for Women “What a fascinating story! Sonia Purnell skillfully takes you deep into the covert operations Virginia Hall led in Nazi-occupied France. Readers will find this tale of her cunning and courage riveting.” —Douglas Waller, author of Wild Bill Donovan: The Spymaster Who Created the OSS and Modern American Espionage About the Author Sonia Purnell is a biographer and journalist who has worked at The Economist, The Telegraph, and The Sunday Times. Her book Clementine: The Life of Mrs. Winston Churchill (published as First Lady in the UK) was chosen as a book of the year by The Telegraph and The Independent, and was a finalist for the Plutarch Award. Her first book, Just Boris, was longlisted for the Orwell prize. Excerpt. © Reprinted by permission. All rights reserved. PrologueFrance was falling. Burned‑out cars, once strapped high with treasured possessions, were nosed crazily into ditches. Their beloved cargoes of dolls, clocks, and mirrors lay smashed around them and along mile upon mile of unfriendly road. Their owners, young and old, sprawled across the hot dust, were groaning or already silent. Yet the hordes just kept streaming past them, a never‑ending line of hunger and exhaustion too fearful to stop for days on end. Ten million women, children, and old men were on the move, all flee‑ ing Hitler’s tanks pouring across the border from the east and the north. Entire cities had uprooted themselves in a futile bid to escape the Nazi blitzkrieg that threatened to engulf them. The fevered talk was of German soldiers stripped to the waist in jubilation at the ease of their conquest. The air was thick with smoke and the stench of the dead. The babies had no milk, and the aged fell where they stood. The horses drawing overladen old farm carts sagged and snarled in their sweat‑drenched agony. The French heat wave of May 1940 was witness to this, the largest refugee exo‑ dus of all time. Day after day a solitary moving vehicle weaved its way through the crowd with a striking young woman at the wheel. Private Virginia Hall often ran low on fuel and medicines but still pressed on in her French army ambulance toward the advancing enemy. She persevered even when the German Stukas came screaming down to drop 110‑pound bombs onto the convoys all around her, torching the cars and cratering the roads. Even when fighter planes swept over the treetops to machine‑gun the ditches where women and children were trying to take cover from the carnage. Even though French soldiers were deserting their units, abandoning their weapons, and running away, some in their tanks. Even when her left hip was shot with pain from continually pressing down on the clutch with her prosthetic foot.Now, at the age of thirty‑four, her mission marked a turning point after years of cruel rejection. For her own sake as much as for the casualties she was picking up from the battlefields and ferrying to the hospital, she could not fail again. There were many reasons why she was willingly jeopardizing her life far from home in aid of a foreign country, when millions of others were giving up. Perhaps foremost among them was that it had been so long since she had felt so thrillingly alive. Disgusted at the cowardice of the deserters, she could not understand why they would not continue the fight. But then she had so little to lose. The French still remembered sacrificing a third of their young menfolk to the Great War, and a nation of widows and orphans was in no mood for more bloodshed. Virginia, though, in‑ tended to go on to the end, wherever the battle took her. She was prepared to take whatever risks, face down any dangers. Total war against the Third Reich might perversely offer her one last hope of personal peace. Yet even this was as nothing compared with what was to come in a life that drew out into a Homeric tale of adventure, action, and seemingly unfathomable courage. Virginia Hall’s service in the France of summer 1940 was merely an apprenticeship for a near suicide mission against the tyranny of the Nazis and their puppets in France. She helped to pioneer a daredevil role of espionage, sabotage, and subversion behind enemy lines in an era when women barely featured in the prism of heroism, when their part in combat was confined to the supportive and palliative. When they were just expected to look nice and act obedient and let the men do the heavy lifting. When disabled women—or men—were confined to staying at home and leading often narrow, unsatisfying lives. The fact that a young woman who had lost her leg in tragic circumstances broke through the tightest constrictions and overcame prejudice and even hostility to help the Allies win the Second World War is astonishing. That a female guerrilla leader of her stature remains so little known to this day is incredible. Yet that is perhaps how Virginia would have wanted it. She operated in the shadows, and that was where she was happiest. Even to her closest allies in France, she seemed to have no home or family or regiment, merely a burning desire to defeat the Nazis. They knew neither her real name nor her nationality, nor how she had arrived in their midst. Constantly chang‑ ing in looks and demeanor, surfacing without notice across whole swaths of France only to disappear again as suddenly, she remained an enigma throughout the war and in some ways after it too. Even now, tracing her story has involved three solid years of detective work, taking me from the National Archives in London, the Resistance files in Lyon, and the parachute drop zones in the Haute‑Loire, to the judicial dossiers of Paris and even the white marble corridors of CIA headquarters at Langley. My search led me through nine levels of security clearance and into the heart of today’s world of American espionage. I have discussed the pressures of oper‑ ating in enemy territory with a former member of Britain’s Special Forces and ex‑intelligence officers from both sides of the Atlantic. I have tracked down files that were missing, and discovered that others remain mysteri‑ ously lost or unaccounted for. I have spent days drawing diagrams match‑ ing dozens of code names with scores of her missions; months hunting for remaining extracts of those strange “disappeared” papers; years digging out forgotten documents and memoirs. Of course, the best guerrilla leaders do not intend to keep future historians happy by keeping perfect records at five in the morning about their overnight missions, and those that do exist are often patchy or contradictory. Where possible, I have stuck to the version of events as told by the people closest to them. At times, however, it has been as if Virginia and I have been playing our own game of cat and mouse; as if from the grave she remains, as she used to put it, “unwilling to talk” about what she did. In her secret universe, when virtually the whole of Europe from the North Sea to the Russian frontier was under the Nazi heel, trust was an unaffordable luxury. Mystique was as vital as a concealable Colt pistol. And yet, in an era when the world again seems to be tilting toward division and extremism, her example of comradeship across borders in pursuit of a higher ideal stands out now more than ever. Nor have governments made it easy to fill in the gaps. Scores of relevant documents are still classified for another generation—although I managed to have a number released to me for this book with the invaluable aid of two former intelligence officers. Still more went up in flames in a devastating fire at the French National Archives in the 1970s, leaving an unfillable hole in the official accounts. Whole batches of papers at the National Ar‑ chives and Records Administration (NARA) in Washington, D.C., have apparently been mislaid or possibly misfiled, a handy list of them appar‑ ently overlooked in a move between two buildings. Only 15 percent of the original papers from Special Operations Executive—the British secret ser‑ vice that Virginia worked for from 1941 to 1944—survive. Yet for all these challenges and twists and turns down dark and hidden alleys, Virginia’s story has never once disappointed: in fact, it has repeatedly turned out to be more extraordinary, its characters more vivid, its significance greater than I could have imagined. She helped to change espionage and the views of women in warfare forever—and the course of the fighting in France. Virginia’s enemies were more deadly, her conduct more daring than many a Hollywood blockbuster fantasy. And yet the swashbuckling tale is true, and Virginia a real‑life hero who kept going even when all seemed lost. The pitiless universe of deception and intrigue that she inhabited might have inspired Ian Fleming to create James Bond, yet she came closer to being the ultimate spy. Eventually every bit as ruthless and wily as the fictional Commander Bond, she also understood the need to blend in and keep her distance from friend and foe alike. Where Bond was known by name to every international baddie, she slipped through her enemies unseen. Where Bond drove a flashy Aston Martin, she traveled by train or tram or, despite her disability, on foot. Where Fleming’s character seemed to rise seamlessly to the top, Virginia had to battle for every inch of recognition and authority. Her struggle made her the figure she became, one who survived, even thrived, in a clandestine life that broke many apparently far more suited to the job. No wonder today’s chief of the British intelligence agency MI6, has revealed that he searches for recruits who do not shout loud and show off but who have had to “fight to get on in life.” Virginia was a human being with the f laws, fears, and insecurities of the rest of us—perhaps even more—but they helped her understand her enemies. Only once did her instincts let her down, with catastrophic consequences. For the most part, though, she conquered her demons and won the trust, admiration, and ultimately the gratitude of thousands in the process. To meet Virginia was clearly never to forget her. Until the moment she retired in the 1960s from her postwar career in the CIA, she was a woman ahead of her time who has much to say to us now. Controversy still rages about women fighting alongside men on the front line, but nearly eight decades ago Virginia was already commanding men deep in enemy territory. She experienced six years of the European war in a way that very few other Americans did. She gambled again and again with her own life, not out of a fervent nationalism for her own country, but out of love and respect for the freedoms of another. She blew up bridges and tunnels, and tricked, traded, and, like 007, had a license to kill. What she pursued was a very modern form of warfare based on propa‑ ganda, deceit, and the formation of an enemy within—techniques now increasingly familiar to us all. But her goals were noble: she wanted to protect rather than destroy, to restore liberty rather than remove it. She neither pursued fame or glory nor was she really granted it. This is not a military account of the battle for France, nor an analysis of the shifting shapes of espionage or the evolving role of Special Forces, although, of course, they weave a rich and dramatic background to Virginia’s tale. This book is rather an attempt to reveal how one woman really did help turn the tide of history. How adversity and rejection and suffering can sometimes turn, in the end, into resolve and ultimately triumph, even against the backdrop of a horrifying conflict that casts its long shadow over the way we live today. How women can step out of the construct of conven‑ tional femininity to defy all the stereotypes, if only they are given the chance. And how the desperate urgencies of war can, perversely, open up opportunities that normal life tragically keeps closed. Of course, Virginia, who served in British and American secret services, did not work alone. The supporting cast of doctors, prostitutes, farm‑ ers’ wives, teachers, booksellers, and policemen have equally been forgotten but often paid dearly for their valor. Just as what they did for the cause was inspired in part by lofty romance and ideals, so also were they aware that failure or capture meant a lonely and grisly death. Some of the Third Reich’s most venal and terrifying figures were obsessed by Virginia and her networks and strove tirelessly to eliminate her and the whole movement she helped to create. But when the hour of France’s liberation came in 1944, the secret armies she equipped, trained, and sometimes directed defied expectations and helped bring about complete and final victory for the Allies. Even that, though, was not enough for her. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 32 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 32 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A NEW YORK TIMES BESTSELLERChosen as a BEST BOOK OF THE YEAR by NPR, the New York Public Library, Amazon, the Seattle Times, the Washington Independent Review of Books, PopSugar, the Minneapolis Star Tribune, BookBrowse, the Spectator, and the Times of LondonWinner of the Plutarch Award for Best Biography“Excellent…This book is as riveting as any thriller, and as hard to put down.” -- The New York Times Book Review\"A compelling biography of a masterful spy, and a reminder of what can be done with a few brave people -- and a little resistance.\" - NPR\"A meticiulous history that reads like a thriller.\" - Ben MacintyreA never-before-told story of Virginia Hall, the American spy who changed the course of World War II, from the author of Clementine.In 1942, the Gestapo sent out an urgent transmission: \"She is the most dangerous of all Allied spies. We must find and destroy her.\" The target in their sights was Virginia Hall, a Baltimore socialite who talked her way into Special Operations Executive, the spy organization dubbed Winston Churchill's \"Ministry of Ungentlemanly Warfare.\" She became the first Allied woman deployed behind enemy lines and--despite her prosthetic leg--helped to light the flame of the French Resistance, revolutionizing secret warfare as we know it. Virginia established vast spy networks throughout France, called weapons and explosives down from the skies, and became a linchpin for the Resistance. Even as her face covered wanted posters and a bounty was placed on her head, Virginia refused order after order to evacuate. She finally escaped through a death-defying hike over the Pyrenees into Spain, her cover blown. But she plunged back in, adamant that she had more lives to save, and led a victorious guerilla campaign, liberating swathes of France from the Nazis after D-Day.Based on new and extensive research, Sonia Purnell has for the first time uncovered the full secret life of Virginia Hall--an astounding and inspiring story of heroism, spycraft, resistance, and personal triumph over shocking adversity. A Woman of No Importance is the breathtaking story of how one woman's fierce persistence helped win the war.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2376"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Books; Reprint edition (March 24, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 368 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0735225311"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0735225312"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.4 x 0.78 x 8.3 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,543 in Books (See Top 100 in Books) #2 in French History (Books) #4 in Women in History #44 in Women's Biographies"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 21,601 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "P. Blevins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5OZRDARE5O55VBCRBHWGYCO5WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V61KWQYYBU2Z?ASIN=0735225311",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2021",
                "reviewTitle": "5.0 out of 5 stars What an amazing woman",
                "reviewText": "A Woman of No Importance: The Untold Story of the American Spy Who Helped Win WWII was written by Sonia Purnell. This book was impossible to put down once you were into it.This is the story of how one woman stood up to be counted and made a difference to the history of the world. Virginia wanted to protect rather than destroy; to restore liberty rather than destroy it. She neither pursued fame or glory, nor was she really granted it She defied stereotyping and served in the American and British Secret Service.Barbara Hall had raised her only daughter (youngest child) to make an advantageous marriage. She wanted Virginia to live as the highest social circle did; but didn’t have the money. Ned was inept at business and failed to keep the family fortune; but not even to raise it. Virginia’s duty was to haul the family fortune back to where it was supposed to be by marrying money.Virginia was outgoing, a pleasure to be around, young men flocked to her, and she defied convention. She rode, shot, hunted, etc. like the boys and yet knew how to act as a young lady. They saw her as a natural leader. Her classmates voted her president of her class, editor in chief, ‘captain of sports, and “Class Prophet”. She was a true “original”. Her brother followed the plan set forth for him in following in his father’s business.She seemed to follow her Mother’s plans when at nineteen, she became engaged to a suitable young man. However, unlike other young ladies of her time, she strenuously objected to his cheating on her. It was the Flapper Era and women showed their independence, Virginia dropped her fiancé for his cheating and left him in her dust. Virginia began looking for a career instead. Limits on what women could do were lifted and she w anted to follow that life. Set on proving she was equal to men in her chosen field. She decided she would do better in school if she did it in Paris. She became a free spirit there and coasted through her classes. Became engaged again; but this time her Father objected and she obeyed him. Heartbroken, she returned home. Returned favoring Women’s emancipation, loved the idea of freedom for everyone and an abiding love for France. She knew five language fluently and the politics of Europe. Witnessed the rise of Hitler and Mussolini. Wall Street crash wiped out family fortune. She tested to enter the State Department but was rejected. She determined to enter by the “back door”Father’s death caused family fortunes to completely collapse and she applied for and obtained a secretarial position in the American Embassy in Warsaw. She was in but definitely by the back door. She did her job with a flair and did it well. Also got a glimpse of the intelligence world. Retook the exams to be in the diplomatic corps but missed the oral exam application deadline. Transferred to Turkey which had even fewer chances to advance. Then tragedy struck. On an organized snipe hunt, she was distracted and failed to keep her gun on safety. She fell and the resulting bullet hit her foot. Unfortunately, gangrene entered her wound and the ultimate result was the amputation of her left leg below the knee. Then sepsis attacked the knee and she once again fought for her life. She dreamed her Father came to her and told her “it was her duty to survive”. Eventually, she was fitted with a prosthetic. She taught herself to walk again and eventually returned to her duties at the embassy, although not back in Turkey; but in Venice. She asked for no favors due to her handicap. She just devised ways to get around as easily as possible and continued her work. She also entertained as her place in society required. She continued to do her duties well and even stepped in for the vice counsel when he was away. She impressed her superiors with her dedication to their work. She tried once more to gain a spot in the diplomatic corps; but was denied due to her leg and an obscure law against amputees being in the corps. She returned to Venice but others took her cause to President Roosevelt. He consulted with Hull and despite his own paralysis and the glowing reports of others on her behalf, he refused to change Hull’s mind. As a result, she was sent from Venice to Estonia. Her replacement in Venice got a promotion and a raise. Her request to stop in Paris for repair on her prosthetic was denied, so she had to pay for the detour herself. In Paris, she made contacts with her friends before going on to Estonia. Here, she was back to mundane work which was beneath her capabilities. There was now no hope of promotion or a raise (not having one in seven years) so she resigned from the State Department. She tried joining the British but couldn’t as she wasn’t British. She did join the French Ambulance service and drove ambulances in some of the worst conditions possible. She was caught in France when the Nazis took over. She found her being an American helped her get fuel needed for the ambulances to bring wounded to Paris for treatment. She noted how she received preferential treatment. However, she decided to return to Britain and looked for some way to help.On her way to Britain, she ran into George Bellows, an undercover British agent. They talked and she told him what was going on in France as she saw it. He saw a passionate and extremely brave young lady. He wired a friend in London telling him of this young lady. His friend was with the newly set up of the SOE. They were having problems finding men to take the positions they offered. Bellows believed Virginia could easily do the job. Meanwhile, she was having problems finding a position since she had quit once. Her Mother finally persuaded her to come home; but it was too late to get a safe ticket home. It was then that she contacted the name Bellows gave her. He invited her for dinner and unknown to her began his interview of her. They quickly decided she was what they needed and grabbed her up. The pay wasn’t any more than the State Department had given her; but the adventure and the fact that she would be helping the French made this offer attractive to her.Thus, Virginia became the first female F Section agent and the first liaison officer of either sex of the SOE. However, obstacles were put in her way by the State Department since she was an American and had resigned from them. In addition, Churchill had in place that women were not to be on front-line service of any kind. Old-fashioned attitudes of women were still in existence. As an American, could she be trusted? For once, her disability did not come into question at all. Eventually, things were approved and she was sent to training, her first step. When she finally started on her first mission, she was given a fifty-fifty chance of survival. This was a blind step for everyone concerned. No one had done this before. She was the first and no one knew what problems would arise. Her cover as a journalist enabled her to send articles on everyday life in France. This enabled the SOE to make sure their agents were well informed about the customs and rules the French had to follow. This enabled future agents to avoid dead giveaways. Since the United States was not at war at this time, she received no help from the US ambassador although some of his staff helped her without his knowledge.",
                "reviewVotes": "90 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Eppenstein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJODPM5BCWZVNCV4PIIG7GDAAFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYS3VBZ1UBJCR?ASIN=0735225311",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2021",
                "reviewTitle": "5.0 out of 5 stars A woman of incredible importance and a book well worth reading about her.",
                "reviewText": "Have you ever heard of Virginia Hall? How about a one legged civilian woman in the OSS that won the Distinguished Service Cross for fighting the Nazis in France with the Resistance? No? Me neither, until I read this book and it's now getting my rare 5 star rating. In 2019 I read <u>Code Name: Lise</u> about a French woman, Odette Sansom, married to an Englishman who was now in the army. She wanted to do her part to aid her adopted country and her homeland and ended up becoming a member of the British Special Operations Executive (SOE) which sent her back to France as a spy. She ended up becoming the most decorated British woman in WWII. I thought Odette's story was incredible and inexcusably unknown but that was before I had read this book about Virginia Hall.Virginia was an American woman from a relatively well-to-do family. She was studying in Europe when the war started between Germany and England and France. She fled to England and ended up in the same SOE that Odette did but well before Odette's involvement. Virginia being multi-lingual was also sent to France and was remarkably talented and successful in her clandestine operations. She was so successful that she far outshined her male counterparts who seemed more interested in getting drunk and hopping in and out of every bed available beside using the money they were supplied to support resistance operations for their lavish lifestyles. But this was a different era and inspite of a war being on a woman's achievements were poo-pooed and unacknowledged. Her warnings that her male colleagues were lying about the available resources and manpower in France these were also disregarded. Virginia became the center of successful SOE activity in Southern France and the most sought after agent by the Nazis. Eventually she was forced to escape France and her escape is an exploit that is not to believed even earning a comment from Chuck Yeager of Sound Barrier fame. Yeager as a downed pilot in WWII that had to escape France by a route similar to that taken by Hall and was dumbfounded by the ordeal the route presented and to have done it on one leg was astonishing.Upon her return to England Virginia's accomplishments were again unacknowledged. Her immediate supervisor thought her deserving of very high praise and put her in for a very distinguished medal but that was denied because such a medal was not given to women. Instead Virginia was given an MBE, Member of the British Empire. Oh, and Virginia's pay rate was one step above a clerk/typist for somebody working in enemy controlled France at the risk of her life. You just can't beat the British for arrogance, ignorance, and elitism unless, of course, you happen to be a member of American bureaucracy of the same era. By now Pearl Harbor had occurred and the U.S. was in the war.The entry of the U.S. into the European war resulted in the creation of the OSS under the leadership of General \"Wild Bill\" Donovan. Since the OSS had no experienced agents Virginia was a shoo-in to be hired away from the SOE and she was. She was sent back to France but this time with more authority and operational control than under the British but with no more respect than that of the British. Her accomplishments became legendary in France and her apprehension by the Nazis and especially by Klaus Barbi, the Butcher of Lyon, became a paramount goal of his regime in Southern France.Her work in France also depicts the operations of the Resistance and the Free French under de Gaulle which are not particularly flattering. Her operations were constantly hampered by the sexism of local Resistance leaders more interested in personal glorification than in taking orders from a mere woman foreigner regardless of the fact that she was the one supplying the weapons and money needed for the fighting. Virginia was also the one with the experience, organization skill, and the selfless focus needed to insure mission success. Eventually the war ends but the egoism, elitism, nationalism, and sexism continued. Many of those that fought with Virginia believed she deserved to be awarded the Legion of Honor but de Gaulle was promoting a myth that France freed itself without the need for foreign assistance let alone the assistance of a foreign woman and such an award was never given though the author did discover that a Croix de Guerre was awarded but never publicly acknowledged.When Virginia returned to the U.S. after years of being in Europe the OSS had been abolished by order of President Truman but the Cold War made such an agency a modern world necessity and the CIA was born. Virginia went to work and eventually retired from the CIA, again without the appreciation or acknowledgement of her experience or abilities. She entered an agency populated by Ivy League good old boys that considered her old school. Of course they were really embarrassed by her achievements, experience and real world spy craft knowledge but she was never given assignments where these skills could be properly utilized. Again, she was just a woman and this was a man's world and she was now being regarded as \"opinionated\" and \"difficult\". At the age of 60, mandatory CIA retirement age, she retired without fanfare. She lived quietly and silently for the remainder of her life. After her death Virginia's contributions and her mistreatment were recognized by the CIA and resulted in her being memorialized on a CIA Hall of Fame and in the naming of a building after her.The author understandably makes much of the ill-treatment Virginia received. However, Virginia practiced a personal code of silence consistent with her role as a spy and never left any record of her exploits or her thoughts. While I agree that she was treated shabbily by the British, the French, and the Americans I wonder if she would agree with the author's level of criticism. Virginia intentionally declined honors and recognition because that wasn't what she fought for and it was a source of difficulty she experienced with those for whom such things were important. She was a woman of her times and ill-treatment by men may not have been as offensive as we would regard it today. I think what you will find in this book is the story of an incredibly idealistic woman with tenacious abilities and unswerving loyalty unconcerned about her personal welfare. She had a job to do for a country she loved and that was all that was important to her. This is a story worth reading about. Enjoy.",
                "reviewVotes": "62 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Regis C Stirling",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBUAZ3YJKWIHQTX43LDND7XLZXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30H6O6817KFE6?ASIN=0735225311",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "4.0 out of 5 stars It is not an easy read, but worth it!",
                "reviewText": "You will learn so much about an incredible American woman and her work in the the French resistance in WWII. She helped to shorten the war according to some generals and organized so many groups and even a prison break. It is hard to keep track of everyone, but definitely worth it. She never got the credit she deserved.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Garth",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2024",
                "reviewTitle": "Looks Like a Great Book",
                "reviewText": "The book was delivered when expected. It is new and in great shape. I haven't read it yet, but it looks like a great read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Berengaria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 27, 2023",
                "reviewTitle": "Una biografía excelente de una mujer sorprendente.",
                "reviewText": "Cuando pedí el libro no conocía al personaje. Quedé sorprendida de lo valiente y dedicada que fue está mujer que vivió en las sombras. Muy bien escrito y ameno. Lo recomiendo ampliamente.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SMR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 19, 2024",
                "reviewTitle": "Where's the movie",
                "reviewText": "Very interesting account of a woman's determination to do right in a cruel world war. Yet continued despite male ego in later years despite her war time experience and skill",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William Connors",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 23, 2023",
                "reviewTitle": "Story of a fascinating woman",
                "reviewText": "Extremely well written and researched book. What Virginia Hall accomplished in fighting Nazi Germany is amazing, which makes it all the more surprising that she is little known. I just wonder how she rationalized working for the CIA after the war when it was suppressing when not killing many (mostly communists) who also fought against the Nazis. It is especially strange that she did not resign when the CIA helped the Nazi butcher Klaus Barbie escape to Bolivia, a man who was responsible for the killing and torture of many people that Ms. Hall worked with (and he also tried very had to get her). But then Ms. Hall was very discreet and did not reveal much about herself, and the author was also unable to view all documents, since some are still classified as secret.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick Ransdale",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 27, 2021",
                "reviewTitle": "(English edition) Incredible story... why isn't she famous?",
                "reviewText": "This true story of an American WW2 heroin tugs at the old heartstrings at times. Hopefully people still read books like this to remind us of the barbarity of the Nazi regime and the bravery of those that opposed it. One can't help thinking, as ever with such courageous women, that if she had been a man her name would be much more well-known. Thoroughly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.00",
                "sellerName": "charlestonsoon",
                "sellerRating": "4.5"
            }
        ]
    }
}