{
    "remaining_requests": 671,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/General-Theory-Employment-Interest-Money-ebook/dp/B0BM3LPGSZ",
    "body": {
        "name": "The General Theory of Employment, Interest, and Money",
        "price": "$0.39",
        "originalPrice": "",
        "rawPrice": 0.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/General-Theory-Employment-Interest-Money-ebook/dp/B0BM3LPGSZ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71GgWfj5DPL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "John Maynard Keyne",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_ebooks_1?ie=UTF8&field-author=John+Maynard+Keyne&text=John+Maynard+Keyne&sort=relevancerank&search-alias=digital-text"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 1022,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "1936 saw the initial release of The General Theory of Employment, Interest, and Money. However, its concepts have been developing for years? Keynes had written to a friend while still a student at Cambridge, expressing his love for \"free trade and free thought.\" The freshness, clarity, and occasionally even ambiguity of Keynes' macroeconomic vision, as well as his spare prose, vivid descriptions, and limpid manner, have all contributed to the continued relevance of his views. High unemployment rates and significant wealth and income discrepancies most worried him. He reasoned that individualism, \"the most potent instrument to enhance the future,\" could only be preserved by limiting both. The 21st century may yet confirm his assertion. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9154158011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BM3LPGSZ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Grapevine India (November 10, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 10, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1591 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 612 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#69,813 in Kindle Store (See Top 100 in Kindle Store) #3 in Consumer Guides (Kindle Store) #4 in Education Research (Kindle Store) #5 in Quotation Reference"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 1,022 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tanthallas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQBJDW465VPQJBLHGLKIPB3DUZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1369N5W6LWFQ5?ASIN=B0BM3LPGSZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2011",
                "reviewTitle": "5.0 out of 5 stars Reality is forced upon poor Robinson's isle.",
                "reviewText": "The goal of the GT was to revolutionize the discipline of economics itself. Keynes' presentation was formal - however the real conflict was not with definitions of economic categories, nor with any economic-theoretic concepts as such, but instead with the entire shape which the 'science' of economics had espoused and its real world limitations. What else does 'revolution' mean but a complete upheaval of what was formerly the word of truth and order. It is the goal of this review to put lay the grounds of the theoretical conflict Keynes waged on conventional thought and unveil the essence of Keynes' disagreement. I The opening chapter of 'The General Theory of Employment, Interest, and Money' is titled 'The Postulates of the Classical Economics'. This is because Keynes himself believed that his challenge was to the theoretical core of what was then the entirety of developed economic theory - apparently the economic-theoretic tradition ranging from Ricardo through Marshall. He called this the 'classical tradition' and identified its inception with the classical political economists as such. In reality Keynes' criticisms had nothing to do with what was classical political economy, but instead with micro-oriented marginalist tradition which had emerged and transformed this study into 'Economics'. Hence they had nothing to do with Ricardo, whom he believed to be his main adversary. The mainstream, epitomized in Keynes' mentor at Cambridge, Alfred Marshall, had long since lost any connection with 'classical' theory as represented by classical political economy - what was being challenged in 'The General Theory' was not classical economy at all, but instead the embryonic form of the now dominant neoclassical economics. Classical economy did not argue, for example, that real wages or prices were fundamentally determined by marginal utilities and disutilities in exchange; thus it was not argued that market prices tended toward a unique full employment equilibrium - central, as we shall see, to Keynes' criticism of the limitations of 'classical theory'. This became theoretically fundamental only after Ricardo's death, with the abandonment of the labor embodied theory of value by the mainstream of economics. The topic of the disconnect Keynes had between the body of economic theory he believed he was critiquing and that body of thought he actually was critiquing is important not for the pleasure of questioning Keynes' erudition. This topic is important because it is actually the key to understanding Keynes' developments in 'The General Theory' itself . Keynes had ultimately linked what are fundamental assumptions and methods which form the bedrock of neoclassical theory with classical political economy, and most especially Ricardo as the height of classical theory, simply because they had an existence within classical theory. Saying something exists is saying nothing of how or why it exists, however, and in the case of classical theory these concepts existed only as assumptions which had direct relation to the particular method the classicists employed. These assumptions were not fundamental to the operation of their entire framework. For classical political economy, market prices were simply spot relations with no fundamental importance in regards to the essential features of the continued reproduction of capitalist production. If there was a drought, corn prices would increase; if there was a good harvest, corn prices would decrease. There was nothing fundamental to be found in markets themselves which explained the uniqueness of capitalism as a mode of production or its tendential movements. As any non-essential feature or friction is abstracted from in order to analyze a system in its purity, in classical political economy it was market relations - supply and demand - which were abstracted from to gain an understanding of the production relations which underpinned capitalist production. This is the root of Keynes' misunderstanding. To say that 'market relations' are abstracted from amounts to the same thing as postulating that markets are in equilibrium. A unique equilibrium, in the sense of full employment of resources, was postulated by classical theory not to explain everything but in order to abstract from what could not explain anything. Even Marx, the critic of classical political economy, makes this abstraction in postulating equal organic compositions of capital in Capital Vol. I. Marx clearly did not believe that there ever existed even proximate to this harmonious equilibrium of supply and demand. Keynes' lack of an understanding of classical theory essentially caused him to equate what was irrelevant for classical theory with what is essential to neoclassical theory. These concepts did have their birth during the last and most developed period of classical political economy; and this period should be identified with Ricardo and the theoretical construct he established - however from these two essentially correct identifications it does not follow that classical economy 'stands or falls' with the validity of either of these concepts. It is neoclassical economics which does. This is no simple coincidence. We have noted that neoclassical economics was in an embryonic form of development at this point in time. It was even fashionable within the discipline of economics at this time, per the influential work of Samuel Hollander, to view the development of economic theory as progressing along the same lines from the time of Smith to its time; being unable to fully grasp the true laws of the market as they were in such early stages of developing them . Thus we have such confused notions straight from Marshall himself that classical theory focused 'almost elusively on the supply side', and Jevons along with the marginalists focused 'almost exclusively on the demand side', whereas it was the relationship between the two that gave us the entire picture. It was only later, with the work of Piero Sraffa, that this view of a linear progression of thought underwent drastic changes. Today, the question of what precisely the classical theorists were developing is largely moot within the discipline of economics - we have before us the truth, why bother arguing trivialities of who said what? If, as this work shall argue, this 'truth' is found to be lacking, it is my suggestion that economists begin to familiarize themselves with their own history. It is only within these 'trivialities' which a proper understanding of the development of economic theory, hence its current shape and its limitations, is to be found. I suggest that Adam Smith and David Ricardo be read and understood, as they are also central to understanding Keynes. II It is the postulates of neoclassical theory which Keynes directly addresses in the 'General Theory'. There is a point at which classical and neoclassical theory have a common base, however this is outside of the realm of economic categories. As such, there is no place for a discussion of the relationship between Keynes and classical theory in an elucidation of what is written within the 'General Theory'. The General Theory is ultimately Keynes' conflict with the postulates of neoclassical theory, which he defines as given in their terms by three interconnected propositions:1) The real wage is equal to the marginal disutility of existing employment;2) There is no such thing as involuntary unemployment;3) Supply creates its own demand.These three propositions are interconnected in the sense that if one is to hold then the other two must necessarily be assumed. For example, if we claim that supply creates its own demand we must already take as given that there is no such thing as involuntary unemployment and that the real wage is equal to the marginal disutility of labor. This is because the assumption that supply creates its own demand is conditional: production in this scenario must be carried out for use, and therefore nothing is produced wherein the goods produced are not destined for final consumption. As the employment of resources is required for the production of goods, and the production of goods is the production of definite use values, then the employment of resources moves parallel to the movement of use value. This means that the production of goods continues to increase, hence the employment of resources continues to increase, until there is no use for them in terms of their specific cost and hence no demand. Any unemployment of labor that exists thus must be voluntary because the 'return' to the factor employed, in this case labor, is not being accepted by that factor - that factor could employ itself at a lower price,hence a lower cost would be attached to the good in question and it would once again find a use and an impetus for being produced. Therefore, what is 'really' not being accepted is in fact the social valuation of the employment of a resource - labor in this case - in producing a specific good. The burden of unemployment in this case falls directly on the unemployed and their unwillingness to work for the price at which society values their effort. Seeing, however, as everyone must produce to consume, it is not an option to withdrawal ones labor without withdrawing ones means of consumption. The market thus regulates societies willingness to employ resources with the actual employment of those resources, and from this it follows that the real wage must be absolutely equal to the marginal disutility of existing employment for supply to create its own demand. We abstract, of course, from 'frictions', i.e., the working of the market mechanism after some external change in environment, or 'interventions' into the mechanism itself, i.e., state regulations, subsidization, or monopoly/monopsony power. These three postulates are more commonly known as one term which defines any and all of them, 'Say's Law'. Say's Law is for Keynes a fiction from which it is difficult to escape. On the one hand it is convenient in that it simplifies what is the problem of the determination of economic categories into a single problem of defining individual choice. The economic-theoretic problem becomes an analytical task performed by taking a specific set of social and institutional factors as given as opposed to an investigation of actual society and its institutions by stripping individuals of their social bond and, in turn, simply assuming a 'base' set of characteristics of these individuals when they partake in exchange relations. It should be noted that already there is a contradiction between the need to abstract from social relations in order to define this individual and on the other hand assume a specific set of social relations in order for individuals to interact. On the other hand, the postulation of Say's Law in appearance seems to be a way to answer problems related to the interaction of individuals in society. Unfortunately, these answers rest upon the fact that in postulating Say's Law we are actually abstracting from social relations in general and thus harmonizing them. In this harmony there exist no social relations binding individuals choices in any way nor does there exist any dynamic tendencies within the way human beings structure their mode of production which determine the production and distribution of social product between individuals. Each is an independent producer and consumer which enters daily into production and exchange to subsist. Exchange becomes a process of normalization of aggregated choices; if a butcher wishes to consume two pounds of meat and a barrel of ale, and if a pound of meat exchanges for half a barrel of ale, then this butcher will produce daily four pounds of meet - two for his own consumption and two to exchange for his ale. Through exchange preferences are revealed, and through exchange the production of goods to meet these preferences becomes normalized. Every individual receives a part of the social product equivalent to the amount of sacrifice which that individual contributed to its materialization. If this construction actually did describe reality, I find it hard to imagine a reason that anyone with the problems of social organization in mind would be opposed to structuring society in a way to yield such results. III The real world does not conform to this harmonic vision. Economic theory has for quite some time been uninterested in conceiving of this problem as one which has its roots in their own methods and assumptions. The question which has been posed by economists is not why has this theory failed to describe reality, but why has reality not behaved as this theory claims it should; what practical factors infringe on the realization of this analytic harmony? The question which Keynes posed was very different. In the midst of the Great Depression, wherein the rift between theory and reality was no longer an academic curiosity, Keynes was concerned with addressing why this analytic construct failed to adequately capture, and thus adequately explain, reality through its own limitations - not why reality failed to 'behave' properly according to a theory. The conclusions drawn by Keynes are that the neoclassical framework simply does not describe reality because it instead focuses its efforts on describing a fictional world which it is believed reality should conform to. The problem with attempting to transplant the requirements of this world onto the real world, that is the problem of its application to reality, stems from the essential features of reality it ignores: time does not matter, accumulation does not occur, and money does not exist. The neoclassical framework describes a barter economy wherein all wants are satisfied by current production and temporal decision making is nonexistent. It does not describe an actually existing monetary economy; it does not address issues which can only be given meaning in an analysis of a capitalist economy. The question posed by Keynes is ultimately one of whether an analysis of a barter economy captures the essential features of what is in reality a monetary economy, and, if not, in what ways does a monetary economy function differently. By distinguishing between a monetary and barter economy, Keynes central criticism revolves around the problems which accumulation and time have for neoclassical theory. Present production need not only serve immediate consumption but instead may be withdrawn from circulation completely in its money form. Not only may it be withdrawn, but it must be withdrawn if production is to be carried out on an expanded scale,. There is thus no longer a harmonic state of simple reproduction where all needs are satisfied indefinitely; wherein a butcher or brewer who, having no use for their surplus good but to exchange it for another, produce and exchange goods which they themselves shall not consume for other immediate consumption needs. Instead, production is now carried out with the necessary goal of maintaining and expanding a given surplus. The decision to accumulate a surplus, however, is a decision made through time; and decisions made through time are decisions made with a consideration to the past and speculation of the future. Ultimately, Say's Law amounts to the notion that all production which does not serve immediate consumption must be production for given consumption in the future. Production must therefore not only be carried out for what is presently useful, but for what is 'known' to be useful in the future. Keynes believed this to be the central premise of 'classical theory', what he called its \"...axiom of parallels...(from which) all the rest follows - the social advantage of private and national thrift, the traditional attitude towards the rate of interest the classical theory theory of employment, the quantity theory of money, the unqualified advantages of laissez-faire...\". This 'axiom of parallels' is essentially a modified form of the 'classical postulates'; modified that is, for an economy which accumulates and thus has a complex web of interrelations through time. These interrelations and the macroeconomic effects which they have were largely ignored by the mainstream of economic theory through their acceptance of what Keynes thought was standard Ricardian doctrine 8. Ultimately, in Ricardo's framework money entered as a factor that could not influence the relative prices of commodities. This is because Ricardo's framework was concerned with analyzing the \"laws which govern the distribution of wealth between the classes which concur in its formation\" - that is, it was a theory of value and distribution. Nevertheless, Keynes identified Ricardo as the creator of the doctrine of money neutrality which came to be known 'The Quantity Theory of Money'. It was this doctrine which Keynes believed tied together the entire fiction of Says Law and made it seem as if it were applicable to an analysis of a monetary economy. This is because in order to claim generality, money must enter the barter economy apparatus as a convenient 'middle man' in the exchange of commodities which has no affect whatsoever on levels of production and employment of resources. The relative value of commodities must be determined by the relative utilities and disutilities of producing and consuming them, and money must only nominally affect them in terms of their absolute price levels - not their exchange ratios. Thus, in order to disconnect the Quantity Theory from Says Law, it must be shown that the introduction of money is not simply a convenience which does away with 'coincidence of wants', but instead something which has appreciable affects on output and employment as a whole. It is precisely this which Keynes does by linking the functions of money to the distinctions which arose in the change from analyzing a barter economy to analyzing a monetary economy. Money is not simply a means of exchange but also a means of payment and a store of value. As a means of payment the role money plays in time takes precedence over its other functions, and the need to establish cash flows from assets and to validate debts on assets becomes central to the continued existence of both capitals and households. As a store of value, the role of money in the process of accumulation, speculation, and security in conditions of uncertainty takes precedence and with it the need to withdrawal money from the realm of circulation into either industrial surpluses or the hoarding functions of liquidity preference. The entire notion of supply being equal to demand is meaningless in this context, as it is clear that money is withdrawn from circulation both in terms of the continued need to establish cash flows or validate debts when money serves as a means of payment and for the simple yet capitalistically essential need to accumulate present wealth and speculate on future wealth when money serves as a store of value. The expansion and contraction of the money supply thus becomes an internal phenomena, and as such its causes and effects are no longer able to be abstracted from. Say's Law is applicable only to an economy which does not reproduce itself on an expanded scale - a static, or steady state. In this state, the entire problem of social demand is done away with a priori by the equivocation of the fact that aggregate returns to all factors equals the aggregate value of commodities produced by those factors with the assumption that the aggregate costs of this output are met by social demand - that is, by aggregate consumption 10 This requires that the entire product of a factor, or the whole of the returns to factors, enters circulation for consumption. To make this the center of an analysis is to make not a capitalist economy which expands and contracts production internally but a static economy in which all consumption, and thus production, is met ad infinitum at current quantitative and qualitative schedules of output a general 'model' of an economy. IV Having established that the postulates of 'classical theory' are not general in the context of a monetary economy, Keynes proceeded to abolish once and for all the principle of neoclassical economic theory which gave the entire framework consistency. As we have noted, The Quantity Theory of Money essentially makes the claim that money is 'neutral' in the sense that its introduction into exchange relations has no affect on the determination of relative prices or the levels of output and employment as a whole. The neutrality of money, however, is the assumption of an external money supply which only changes when the good which serves as money becomes more or less scarce. When money becomes specie, or fiat, this assumption is the assumption of an external money supply which only changes by the state apparatus expanding or contracting the money supply. External in this context means that money is created not within or due to the functioning of the system, but by an external force - be it nature for the classicists or the state for the neoclassicists. As its change in this sense represents a realignment of 'supply', its effects on all economic variables is strictly nominal - markets adjust absolute prices, the denomination of prices in terms of the money commodity, to the new price level while the relative value of commodities, or the exchange ratios of commodities, remains the same. The price level is determined by the product of the money supply and the velocity of money. It has been shown that the distinction between a barter and a monetary economy bring forth the issues of accumulation and time which have their parallel in new roles of money as a store of value and means of payment. Keynes' challenge to the Quantity Theory of Money is simply that money is not a mystical entity which is created externally and having no affect on relative prices, but instead is bound in the macroeconomic web with every other man made device. Money is created internally due to the requirements of the continued existence of capitalist production itself. This is because to produce on an expanded scale there must first exist a means in which to finance this expansion. Furthermore, if we introduce the liquidity preference - that is the need to hold money due to conditions of uncertainty or the desire to hold money as a means to speculate (interest) - a dilemma arises in that industrial financing requires an amount of money which is simply not there to reproduce itself. It is mathematically impossible for the amount of money derived from a given stock of capital in circulation to replenish a given stock of capital, i.e., to reproduce it, if any amount of this money is taken out of the fund which replenishes this stock. Not only will the amount of money required to reproduce the value of existing stock be insufficient, but the amount of money required to reproduce it on an expanded scale will by definition not exist. The problem this poses for the neoclassical framework is that its fundamental determinant - individual choice under heroic assumptions and given conditions - loses all significance in the determination of the real economic variables in question. The problem is one of a limiting force on the available means of financing expanded reproduction. After spending so much time reproaching the unrealistic assumption of production for use in a monetary economy, Keynes makes the topic itself irrelevant in light of the fact that a gap between consumption expenditure and the aggregate of production must be filled by some other source for capital to reproduce itself. How, then, is capitalism to function if there is no way to continue the accumulation of capital? The answer, that is the 'means' to finance expanded reproduction, is the internal creation of money through the creation of debt. Money is created internally because capitalist production requires it. Any specific set of use values which this production was meant to meet under the 'classical postulates' becomes lost in a future of uncertainty; accumulation becoming a means to an end. The fact that production takes place through uncertain time creates a liquidity preference - money as a store of value; the fact that the economy is an economy that accumulates in time necessitates financing of production on higher levels than circulating capital allows - money as a means of payment. Both of these functions of money lead to the internal creation of money; the internal creation of money is inconsistent with the neutrality of money posited by the Quantity Theory, and the affects which the liquidity preference and expanded accumulation have on determining the level of employed resources invalidates the conclusion of the Quantity Theory in that the ratio of exchange is necessarily affected through determining the mass of commodities which are produced. Thus, if by nominal it is meant that money is not real, that is it may be created out of thin air with no connection to the actual utility of a commodity, Keynes agrees. Not only does Keynes agree, but for Keynes this is precisely the reason why a monetary economy does not operate on the basis of Says Law. It is once again the attempt of neoclassical theory to squeeze from one truth another which assumes too much - simply because money exists alongside commodities with no seeming connection to their actual use values does not mean that money acting as exchange value cannot affect the way in which these commodities are produced. To assume this is to assume Say's Law; to assume Say's Law is to assume away money. We have, I hope, left far behind the time in which 'scientific truths' are verified by assuming their initial conditions. V The critique of the neoclassical postulates defined in terms of Say's Law unveiled that what has been accepted as the general determinant of economic variables and the movement of the economy as a whole is untenable. What this critique revealed was that once the economy is analyzed in terms of a monetary economy it becomes necessary to incorporate aspects of production and consumption through time and the accumulation of capital. The incorporation of these phenomena pose a problem for existing theory because it has no method of resolving them short of assuming that they do not exist. This is because within the neoclassical framework all production serves immediate consumption - money in this scenario need only function as a medium of exchange. As such, the economy is analyzed as a barter economy wherein the level of present consumption is at a point were all schedules of use value, utility, are exhausted. It is implicit within this framework that production is carried out for use. As the role of money is limited to this single function, the only aspects of the economy which are seen are those which pertain to this specific function of money. Once it is admitted that money also serves the role of a means of payment and a store of value, the need for a new paradigm which is capable of explaining how the process of expansion and contraction in a capitalist economy is created internally is necessary. Keynes' methodological departure - in actuality a return to the method employed by Ricardo and the classicists - represents a strong shift in this direction. His claim is not that the continuing expansion of the money supply allows for the financing of individual capitals, but that it allows for the aggregate of available circulating money to meet the needs of capital as a whole to expand itself. Individual capitals may or may not have trouble financing their own expansion with a given mass of finance because an individual capital can affect the relative distribution of this mass between capitals. As soon as we realize, however, that the problem is not one of the distribution of surpluses between individual capitals, the determination of which supply and demand on the market play a pivotal role, but the mass of available value to be distributed itself, we are at the point where we can see that the resolution of this issue cannot possibly occur within the market mechanism. This is because when the mass of available money to finance past accumulation fails to reproduce it, or fails to validate it, capitals must liquidate. As capitals liquidate, or simply go out of business, this necessarily involves the unemployment of labor. But it is precisely this labor the return to which forms the substance of consumption, and it is precisely this liquidated capital on which they were formerly employed. How is it then that there can exist a labor market in which marginal utilities and disutilities meet to determine a unique level of employment if in the first place the total mass of labor that can be employed at any time is bounded by the amount of investment in fixed capital? The answer is that the interaction of marginal utilities and disutilities do not determine a unique level of employment consistent with, or tending toward, a full employment of resources, but instead they determine a level of employment consistent with a current level of investment. Competition in the labor market is competition not for the determination of the level of employment but for the relative distribution of the mass of existing value. In this way, Keynes maintains marginalist theory but reduces its role to one of a determination of the relative distribution of existing value.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Emmett Brady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZJZJ7GEJTQPSV2ON4XRJZ2QGKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MIH7H023E7U1?ASIN=B0BM3LPGSZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 18, 2004",
                "reviewTitle": "5.0 out of 5 stars Keynes's General Theory versus the classical-neo. theory",
                "reviewText": "First,let's write down the core of the classical and/or neoclassical theory Keynes criticized in the General Theory.Let p equal the price level,w equal the money wage,MPL equal the marginal product of labor,mpc equal the marginal propensity to spend on consumption goods,mpi equal the marginal propensity to spend on investment goods(capital or producer goods like machinery,equipment or factories)and mps equal the marginal propensity to save .For the classical- neoclassical theory,the economy is at an optimal state on the boundary of both the static and dynamic production possibilities frontiers if the following equilibrium condition holds for the aggregate labor market:w/p=MPL.For Keynes the condition is w/p=MPL/(mpc+mpi).neoclassical theory is a special case where mpc+mpi=1.Keynes's GT is mpc+mpi<or=1[mpc+mpi is <or= to mpc+mps=1].neoclassical theory is the special case of an econony always operating on the boundaries of both PPF's under resource scarcity so that there is an inverse relationship between consumption goods and investment goods.Only in this special case will classical/neoclassical theory be operational.In a statistical sense,classical/neo. theory assumes that on average the economy is on its boundary.The business cycle would consist of minor inflationary/deflationary gaps which would be self correcting through business inventory adjustment alone.None of this is operational if the economy is operating in the interior of either PPF's.Given the stability of the consumption function, Keynes came to the conclusion that the problem was insufficient long run investment due to a highly volatile and unstable mpi in the private sector.The result is an investment gap.Keynes's solution is not deficit finance but having the public sector borrow the inactive private financial funds at existing very low rates of interest to spend as a special capital account on a continuing series of infrastructure projects which will more than pay for themselves over time.If this policy is opposed then Keynes would be willing to copy the wasteful policy of the Egyptian pharaohs and build a series of pyramids over time.Although wasteful,such a policy would close the investment gap and lead back to the boundary of the static and/or dynamic production possibilities frontier.classical/neo. theory would then be operational as long as the mpi's unstable behavior was continually offset by increased public sector/public goods/infrastructure spending.Keynes presented a generalization of neoclassical theory.Keynes starts the GT in chapter 2 where he analyzes the neoclassical theory of the labor market.He notes that the most advanced technical treatmant was presented by Pigou in his 1933 book,The Theory of Unemployment.Keynes demonstrates in the appendix to chapter 19 that Pigou's model of his theory is a special case of Keynes's general model developed in chapters 20 and 21.The primary result of neoclassical theory is that an optimum result (full employment)is obtained in the aggregate labor market if the aggregated real wage(w/p) equals the marginal product of labor(mpl) derived from an aggregated production function(O= phi(N)).This is expressed as w/p=mpl,where w is the money wage,p is the price level,and mpl is the aggregated marginal product of labor.In chapters 20 and 21 Keynes presented his mathematical analysis.This leads to his generalization of the quantity theory's equation of exchange,MV=PO,to incorporate uncertainty and the speculative demand for money besides risk and the transactions demand for money.There are two such generalizations.Chapter 20 analyzes the labor market and the commodity market.Mathematically,there are two ways of expressing Keynes's first generalization in chapter 20-w/p=mpl/ep or the more convenient w/p=mpl/(mpc+mpi).Unless the elasticity ep=1(ep can range from 0 to 1) or the mpc + mpi=<1,the RHS of both equations will rise .This requires that the money wage also rise.Neoclassical theory requires that the money wage fall.The condition that the elasticity ep equal 1 means the economy is operating on the boundary of the aggregate production possibilities function curve because the labor market clearing condition,w/p=mpl, is an economically efficient outcome.It is thus allocatively efficient and productively efficient.In chapter 21,Keynes presents his generalization of the neoclassical equation of exchange with the money market added to the labor and commodity markets.The mathematical generalization now becomes w/p=mpl/e,where e is the elasticity that\"... measures the response of money prices to the quantity of money in an aggregated economy\"(GT,p.305-306).Unless e=1,where e can range between 0 and 1 ,as implicitly assumed by neoclassical economists,the RHS of the above equation will rise and it will be impossible for labor,in the aggregate, to cut its money wage as claimed by neoclassical theory in order to reduce unemployment.Again,the money wage will have to rise.The final point that needs to be cleared up is that Keynes's aggregate supply function is correctly specified and analyzed mathematically in chapter 20 on p.283 and in a footnote on pp.55-56 of the GT.The reader must be able to apply simple integration to Keynes's derivatives.I give the steps below:Go to footnote 1 on p.283 of the GT.Keynes defined P to be expected economic profit.The second line from the bottom of this footnote reads as \" = delta P \", which is the same as\" = dP\".That should actually be \" = delta P w subscript\" due to either (a) a typographical error made by the printer in the GT or (b) because Keynes felt that it was obvious,since he divided D=Z through by w,to get Dw subscript = Zw subscript,which means that you must divide P by w.P is AUTOMATICALLY DEFINED IN TERMS OF WAGE UNITS.Pw subscript is equal to Dw subscript-N.Thus dP(or dPw subscript)=d(Dw subscript - N) =dDw subscript -dN.Simple integration gives the following result- Pw subscript=Dw subscript-N .Divide through by w and you obtain P=D-wN.Add wN to both sides.You get P+wN=D=pO or Z =D.Z=P+wN.w is the money wage.N is aggregate employment.p is the expected price level.O is real output,which is a function of N.D,the expected aggregate demand function,is thus equal to expected total revenue.Z,the expected aggregate supply function,is equal to total variable cost plus expected economic profit.The same analysis and result is contained in footnote 2 on pp.55-56 of the GT.Keynes defines the derivative dZw subscript/dN=dphi(N)/dN =phi'(N)=1,where you use \"d\" instead of \" delta \" notation used by Keynes.Integrate to obtain Z=wN + C,where C is a constant of integration,after you divide through by w.We know that D=Z by definition and that D=pO from chapter 20.We get wN +C=pO or C=pO-wN once we subtract wN from both sides.By definition,C must be equal to actual profit if p is an actual price and expected profit if p is an expected price.Of course,if P=0,then you get Z=wN = total variable cost.(This is the case of constant returns to labor.Note that Keynes covered this case explicitly at the top of p.284, as well as on p.306 of the GT ,in chapter 21.)This,of course is the mistake that Don Patinkin made continuously from 1976-1989 in 3 books and 5 articles-failing to consider that Z is linear in both the diminishing returns and constant returns to labor cases.Of course,in the case of constant returns to labor,you would get a linear 45 degree cross representing the aggregate supply curve.The same mistake is made by all Post Keynesian economists like Sydney Weintraub, Paul Davidson,Douglas Vickers,Jan Kregel, Victoria Chick,Nevile,Skott and Dutt,etc.They fail to consider that Keynes worked with both cases, diminishing returns to labor as well as constant returns to labor,in his microeconomic analysis contained in chapters 20 and 21 of the GT.It is not surprising that the Post Keynesians can not deal with the technical analysis contained in chapters 20 and 21 of the GT and expressed by Keynes in the form of elasticities.Instead,they build their analysis on the claims of a mathematically illiterate economist named Dennis Robertson.It was Robertson who claimed that Keynes's theory of effective demand(D-Z analysis)was contained in chapter 3 of the GT.All Post Keynesians base their work on the assumption that Robertson was correct.Post Keynesians also confuse the D=Z locus,the aggregate supply curve,with Z,the aggregate supply function.All of these errors can be traced back to the original errors made by Dennis Robertson in correspondence with Keynes in Feb.-Mar.,1935 about the first 17 chapters of the GT.Keynes told Robertson very clearly that the analysis of his D-Z model was in a chapter called the Employment Function.Chapter 20 of the GT is titled,\" The Employment Function \".After seventy years it is time for economists to read this chapter upon which KEYNES SAID EVERYTHING DEPENDS.The reason why ed <1 ep <1,e <1, and mpc+mpi<=1 is that the decision to invest in long lived durable capital goods ,within an economic environment of technological and financial change,advance,and innovation,thus creating the problem of technological obsolescence,is made under conditions of Keynesian uncertainty or Ellsbergian ambiguity.Neoclassical theory postulates that there is no uncertainty or ambiguity,only risk ,which is universally represented as the standard deviation of a normal probability distribution.This means that aggregate investment expenditure will not be erratic,unstable,and insufficient over time.Involuntary unemployment can't resultKeynes argues,as does Daniel Ellsberg implicitly,that the assumption of normality is a special case.Hence ,Keynes's generalization that covers ambiguity and/or uncertainty.This means that aggregate investment will be erratic,unstable,unpredictable,and insufficient over time.Involuntary unemployment will result.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Simone",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on March 21, 2023",
                "reviewTitle": "Libro molto interessante. Arrivato in tempo",
                "reviewText": "Spedizione perfetta, il libro è arrivato integro",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Márcio Oliveira ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 2, 2019",
                "reviewTitle": "Recomendação",
                "reviewText": "Excelente livro",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bill Davies",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 29, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "I found this a heavy book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge Fuentes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 21, 2017",
                "reviewTitle": "Fantastic book. It is indeed a fantastic book.",
                "reviewText": "Fantastic book. It is indeed a fantastic book. Fantastic book. It is indeed a fantastic book. Amazing, amazing, amazing, wow wow wow wow wow wow wow wow",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis Díez ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 28, 2018",
                "reviewTitle": "imprescindible",
                "reviewText": "libro cabecera de cualquier economista, aunque sus teorías ya han sido superadas, pero supusieron el nacimiento de la economía moderna",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}