{
    "remaining_requests": 498,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/2034-Novel-Next-World-War/dp/B08BSZRXZ6",
    "body": {
        "name": "2034: A Novel of the Next World War",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/2034-Novel-Next-World-War/dp/B08BSZRXZ6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51AMIi8tHpL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Elliot Ackerman",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Elliot+Ackerman"
        },
        "brand": "Elliot Ackerman",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 12091,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From two former military officers and award-winning authors, a chillingly authentic geopolitical thriller that imagines a naval clash between the US and China in the South China Sea in 2034 - and the path from there to a nightmarish global conflagration.On March 12, 2034, US Navy Commodore Sarah Hunt is on the bridge of her flagship, the guided missile destroyer USS John Paul Jones, conducting a routine freedom of navigation patrol in the South China Sea when her ship detects an unflagged trawler in clear distress, smoke billowing from its bridge. On that same day, US Marine aviator Major Chris \"Wedge\" Mitchell is flying an F35E Lightning over the Strait of Hormuz, testing a new stealth technology as he flirts with Iranian airspace. By the end of that day, Wedge will be an Iranian prisoner, and Sarah Hunt's destroyer will lie at the bottom of the sea, sunk by the Chinese Navy. Iran and China have clearly coordinated their moves, which involve the use of powerful new forms of cyber weaponry that render US ships and planes defenseless. In a single day, America's faith in its military's strategic pre-eminence is in tatters. A new, terrifying era is at hand.So begins a disturbingly plausible work of speculative fiction, co-authored by an award-winning novelist and decorated Marine veteran and the former commander of NATO, a legendary admiral who has spent much of his career strategically outmaneuvering America's most tenacious adversaries. Written with a powerful blend of geopolitical sophistication and human empathy, 2034 takes us inside the minds of a global cast of characters - Americans, Chinese, Iranians, Russians, Indians - as a series of arrogant miscalculations on all sides leads the world into an intensifying international storm. In the end, China and the United States will have paid a staggering cost, one that forever alters the global balance of power. Everything in 2034 is an imaginative extrapolation from present-day facts on the ground combined with the authors' years working at the highest and most classified levels of national security. Sometimes it takes a brilliant work of fiction to illuminate the most dire of warnings: 2034 is all too close at hand, and this cautionary tale presents the listener a dark yet possible future that we must do all we can to avoid.* This audiobook edition includes an exclusive interview with co-author Admiral James Stavridis. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Spies & Politics",
                "link": "https://www.amazon.com/Spy-Stories-Tales-Intrigue-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10493"
            },
            {
                "name": "Political",
                "link": "https://www.amazon.com/Political-Thrillers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7538395011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 49 minutes"
            },
            {
                "name": "Author",
                "value": "Elliot Ackerman, Admiral James Stavridis"
            },
            {
                "name": "Narrator",
                "value": "Emily Woo Zeller, P.J. Ochlan, Vikas Adam, Dion Graham, Feodor Chin"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 09, 2021"
            },
            {
                "name": "Publisher",
                "value": "Penguin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08BSZRXZ6"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,827 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #32 in Military Thrillers (Audible Books & Originals) #37 in Political Fiction (Books) #58 in Political Thrillers (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lance Miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQMO6O6VAAWFCRGEKGE7M5ALVVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QQXOH4407U7D?ASIN=B08BSZRXZ6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 11, 2021",
                "reviewTitle": "5.0 out of 5 stars Important Geopolitical Cautionary Tale",
                "reviewText": "I've read negative comments on this book, and agree some of those points are valid, and yet I give this book five stars and urge voters and those in positions to set policy to read it.The gist and ultimate message of the book is what we should take away.The novel centers on five characters, told from their point of view. I am a geek that prefers focus on technology or science, so this human centered narrative was a turn-off at first. Further in I became more engrossed with the book and saw the relience on characters as an efficient means to convey the military-geopolitical dynamics.I certainly prefer dry, unsentimental military strategy such as in my science fiction military theory short story \"Treason Alaska : The Story of the Treason Trade Route\", which in spite of it's title is more about Chinese-American antagonism and a surprising outcome.Still, I endorse this sentiment drenched 2034 for it's few very important statements Americans need to see. There are pro-Russian statements, and pro-Chinese statements, and are very counter to the a priori moral assumptions we see in US journalism and State Department policy rhetoric.Here are my favorite quotes:On Russia:\"Kolchak began to pontificate about the Rodina, his “Mother Russia,” how in its many iterations, whether they be tsarist, imperialist, or communist, it had never enjoyed the legitimacy of other world powers. “During the empire our tsars spoke French at court,” said Kolchak. “During communism our economy was a hollow shell. Today, under the federation, our leaders are viewed as criminals by the rest of the world. In New York City, or in London, they don’t respect any of us, not even President Putin. To them, President Putin isn’t the grandfather of our Federation; no, to them he is simply another poor Russian, a gangster at best, even though he has retaken our ancestral territories in Crimea, Georgia, and Greater Ukraine; even though he has crippled America’s political system, so that now their president doesn’t even have a party but has to run as one of these enfeebled ‘independents.’ We are a cunning people. Our leader is one of us and is equally cunning.\"On America:\"The America they believe themselves to be is no longer the America that they are. Time changes everything, doesn’t it. And now, it is changing the world’s balance in our [Russia's] favor.”America’s hubris has finally gotten the better of its greatness. You’ve squandered your blood and treasure to what end? ... For freedom of navigation in the South China Sea? For the sovereignty of Taiwan? Isn’t the world large enough for your government and Beijing’s?On War:\"If you know the enemy and know yourself, you need not fear the result of a hundred battles. If you know yourself but not the enemy, for every victory gained you will also suffer a defeat. If you know neither the enemy nor yourself, you will succumb in every battle. -Sun Tzu\"By the way, the dynamics of escalation in the book match the \"If you know yourself but not the enemy, for every victory gained you will also suffer a defeat\" formula.And finally, the ideal the book pursues is in this passage:\"He could feel his loyalties shifting, not from one nation to another, but between those who wanted to avert an escalation and those who believed that victory, whatever that meant, could exist along this spectrum of destruction. Receiving the appropriate authorizations to visit the Defense Ministry suddenly seemed like an irrelevance. He increasingly felt as though his allegiance didn’t reside with any government but with whoever could reverse this cycle of annihilation.\"Spoiler alert, the geopolitical surprise comes from India:\"We are not supporting Beijing. And we are not supporting Washington. We are allied with no one. Our support is for de-escalation. Do you understand?”Yes the book has a mighty big magic wand in the form of Chinese cyber attack ability, but fiction often relies on these implausible rhetorical devices to get the reader to that place the story needs to go, so the reader receives a much needed message.This book has many such needed messages.",
                "reviewVotes": "181 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bob f",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH37ZRGVPGWYCWIJLWIJGMGIRDWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WUACO0940WXA?ASIN=B08BSZRXZ6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 15, 2022",
                "reviewTitle": "4.0 out of 5 stars A good story but",
                "reviewText": "Yearning for a good military fiction set in the near future. Unfortunately this wasn't it. Maybe it's because as an American I have a really hard time with stories like this that start out with America getting gut punched really hard by technology that they have no understanding of, which while is possible is unlikely, and then usually it go on to prevail in the end... End... But with this story of course we did not.All the usual bad actors are present of course like Russia and Iran and now China. Any stories usually start out with decisions made by a state who later winds up regretting it. Maybe they should just think it through before they pull the trigger in the first place?The book does make some very good points though. America is just as likely or more likely to implode from within versus from external factors, although nuclear war probably changes that equation quite a bit.While I would like to see the US disengage from a lot of the world shenanigans that are going on, I think we know that if we did that we'll have more problems down the road then we would confronting it while trying to keep it from escalating into world conflict again.Another issue I have is a tactics that they've used in this book. Why would you send two carrier battle groups into the same situation that you just lost a destroyer battle group without clearly knowing what was the reason that you lost them in the first place? Just dumb things like that make this story less readable to me. I don't question the fact that people make stupid decisions sometimes, but I'd like to see a story where maybe we don't start out with decision after decision being poorly thought out. We're getting to a age now that a wrong move could jeopardize not just one country, but almost the entire population of the world. And while not everybody may die, the standard of living for 99% of the survivors will not be good.Don't forget about that.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonny Katz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 17, 2022",
                "reviewTitle": "bom divertimento",
                "reviewText": "o livro especula sobre a futura geo politica",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wim hermans",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on February 4, 2024",
                "reviewTitle": "2034: A Novel of the <next World War",
                "reviewText": "Heb dit boek niet ontvangen, alhoewel dit zogezegd afgeleverd werd aan een bewoner.Was de hele dag aanwezig en heb niemand gehoord of gezien.Wie was deze bewoner dan ?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Veits",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 18, 2024",
                "reviewTitle": "extremely good (must) read",
                "reviewText": "extremely good read, with only minor defaults (in my opinion). the geopolitical analysis and prognosis over the majority of pages to me appear more profound than the one or other non-fiction book of geopolitical and indo-pacific analyses of recent days.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Umerez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 7, 2024",
                "reviewTitle": "ameno e interesante",
                "reviewText": "Novela amena, sin más. Una aproximación plausible a la escalada de tensiones que podría llevar a una tercera gran guerra. Aunque lo que se describe es una confrontación entre dos potencias más que una guerra mundial entre alianzas internacionales. Novela de fin de semana.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 16, 2021",
                "reviewTitle": "The most exciting book I've read this year!",
                "reviewText": "Its been quite a few years since I read such good fiction, so close to the reality that its almost terrifying.Awesome book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}