{
    "remaining_requests": 681,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Midnight-Garden-Good-Evil-Savannah/dp/0679751521",
    "body": {
        "name": "Midnight in the Garden of Good and Evil: A Savannah Story",
        "price": "$11.69 $7.79",
        "originalPrice": "$18.00",
        "rawPrice": 11.69,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Midnight-Garden-Good-Evil-Savannah/dp/0679751521",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91U0ePVnodL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "John Berendt",
            "link": "https://www.amazon.com/John-Berendt/e/B000APZ8XE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by ZBK Wholesale and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 14048,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Amazon.com Review John Berendt's Midnight in the Garden of Good and Evil has been heralded as a \"lyrical work of nonfiction,\" and the book's extremely graceful prose depictions of some of Savannah, Georgia's most colorful eccentrics--remarkable characters who could have once prospered in a William Faulkner novel or Eudora Welty short story--were certainly a critical factor in its tremendous success. (One resident into whose orbit Berendt fell, the Lady Chablis, went on to become a minor celebrity in her own right.) But equally important was Berendt's depiction of Savannah socialite Jim Williams as he stands trial for the murder of Danny Hansford, a moody, violence-prone hustler--and sometime companion to Williams--characterized by locals as a \"walking streak of sex.\" So feel free to call it a \"true crime classic\" without a trace of shame. Review “Forceful, clear, gripping, Midnight in the Garden of Good and Evil is the best nonfiction novel since In Cold Blood and a lot more entertaining, since Berendt’s book has everything going for it—snobbism ruthless power, voodoo, local color, and a totally evil estheticism. I read it till dawn.”—Edmund White “John Berendt has written a gorgeous and haunting blend of travel book and murder mystery. It is enchanting and disturbing and deeply atmospheric.”—Michael Herr “John Berendt has the ability to make the truth read like an exciting novel. This book is original, funny, and bleak—and it beckons quite alluringly to armchair adventurers who are as curious about human nature as about the nature of certain places. I finished reading it convinced that Savannah, may be the greatest performance artist of our day.”—Ann Beattie “All the old passions are on parade through New South Savannah in John Berendt’s wickedly funny new book.”—Richard Russo From the Inside Flap Shots rang out in Savannah's grandest mansion in the misty,early morning hours of May 2, 1981. Was it murder or self-defense? For nearly a decade, the shooting and its aftermath reverberated throughout this hauntingly beautiful city of moss-hung oaks and shaded squares. John Berendt's sharply observed, suspenseful, and witty narrative reads like a thoroughly engrossing novel, and yet it is a work of nonfiction. Berendt skillfully interweaves a hugely entertaining first-person account of life in this isolated remnant of the Old South with the unpredictable twists and turns of a landmark murder case.It is a spellbinding story peopled by a gallery of remarkable characters: the well-bred society ladies of the Married Woman's Card Club; the turbulent young redneck gigolo; the hapless recluse who owns a bottle of poison so powerful it could kill every man, woman, and child in Savannah; the aging and profane Southern belle who is the \"soul of pampered self-absorption\"; the uproariously funny black drag queen; the acerbic and arrogant antiques dealer; the sweet-talking, piano-playing con artist; young blacks dancing the minuet at the black debutante ball; and Minerva, the voodoo priestess who works her magic in the graveyard at midnight. These and other Savannahians act as a Greek chorus, with Berendt revealing the alliances, hostilities, and intrigues that thrive in a town where everyone knows everyone else. Midnight in the Garden of Good and Evil is a sublime and seductive reading experience. Brilliantly conceived and masterfully written, this enormously engaging portrait of a most beguiling Southern city has become a modern classic. From the Back Cover Shots rang out in Savannah's grandest mansion in the misty, early morning hours of May 2, 1981. Was it murder or self-defense? For nearly a decade, the shooting and its aftermath reverberated throughout this hauntingly beautiful city of moss-hung oaks and shaded squares. John Berendt's sharply observed, suspenseful, and witty narrative reads like a thoroughly engrossing novel, and yet it is a work of nonfiction. Berendt skillfully interweaves a hugely entertaining first-person account of life in this isolated remnant of the Old South with the unpredictable twists and turns of a landmark murder case. It is a spellbinding story peopled by a gallery of remarkable characters: the well-bred society ladies of the Married Woman's Card Club; the turbulent young redneck gigolo; the hapless recluse who owns a bottle of poison so powerful it could kill every man, woman, and child in Savannah; the aging and profane Southern belle who is the \"soul of pampered self-absorption\"; the uproariously funny black drag queen; the acerbic and arrogant antiques dealer; the sweet-talking, piano-playing con artist; young blacks dancing the minuet at the black debutante ball; and Minerva, the voodoo priestess who works her magic in the graveyard at midnight. These and other Savannahians act as a Greek chorus, with Berendt revealing the alliances, hostilities, and intrigues that thrive in a town where everyone knows everyone else. Midnight in the Garden of Good and Evil is a sublime and seductive reading experience. Brilliantly conceived and masterfully written, this enormously engaging portrait of a most beguiling Southern city has become a modern classic. About the Author The son of two writers, JOHN BERENDT grew up in Syracuse, New York. He earned a B.A. in English from Harvard University, where he worked on the staff of The Harvard Lampoon. After graduating in 1961, he moved to New York City to pursue a career in publishing. Berendt has written for David Frost and Dick Cavett, was editor of New York magazine from 1977 to 1979, and wrote a monthly column for Esquirefrom 1982 to 1994. Berendt first traveled to Savannah in the early 1980s, when he realized that he could fly there for a three-day weekend for the price of “a paillard of veal served on a bed of wilted radicchio” [p. 24] in one of New York’s trendier restaurants. Over the ensuing eight years his visits became more frequent and extended, until he was spending more time in Savannah than in New York. Part of the appeal, Berendt says, lay in the city’s penchant for morbid gossip: “People in Savannah don’t say, ‘Before leaving the room, Mrs. Jones put on her coat.’ Instead, they say, 'Before leaving the room, Mrs. Jones put on the coat that her third husband gave her before he shot himself in the head.” (Entertainment Weekly, 3/11/94, p. 52) Since the publication and unprecedented success of Midnight in the Garden of Good and Evil, Berendt has become a Savannah celebrity and was even presented with the key to the city. “I took it down to City Hall one night to see if it would work, but it didn't.” (Syracuse Post Standard, 4/5/1994) Excerpt. © Reprinted by permission. All rights reserved. He was tall, about fifty, with darkly handsome, almost sinister features: a neatly trimmed mustache, hair turning sliverat the temples, and eyes so black they were like the tinted windows of a sleek limousine - he could see out, but youcouldn't see in. We were sitting in the living room of his Victorian house. It was a mansion, really, with fifteen-foot ceilingsand large, well-proportioned rooms. A graceful spiral stairway rose from the center hall toward a domed skylight.There was a ballroom on the second floor. It was Mercer House, one of the last of Savannah's great houses still in privatehands. Together with the walled garden and the carriage house in back, it occupied an entire city block. If MercerHouse was not quite the biggest private house in Savannah, it was certainly the most grandly furnished. Architectural Digesthad devoted six pages to it. A book on the interiors of the world's great houses featured it alongside Sagamore Hill,Biltmore, and Chartwell. Mercer House was the envy of house-proud Savannah. Jim Williams lived in it alone.Williams was smoking a King Edward cigarillo. \"What I enjoy most,\" he said, \"is living like an aristocrat without theburden of having to be one. Blue bloods are so inbred and weak. All those generations of importance and grandeur tolive up to. No wonder they lack ambition. I don't envy them. It's only the trappings of aristocracy that I findworthwhile - the fine furniture, the paintings, the sliver--the very things they have to sell when the money runs out. Andit always does. Then all they're left with is their lovely manners.\"He spoke in a drawl as soft as velvet. The walls of his house were hung with portraits of European and Americanaristocrats - by Gainsborough, Hudson, Reynolds, Whistler. The provenance of his possessions traced back to dukes andduchesses, kings, queens, czars, emperors, and dictators. \"Anyhow,\" he said, \"royalty is better.\"Williams tapped a cigar ash into a sliver ashtray. A dark gray tiger cat climbed up and settled in his lap. He strokedit gently. \"I know I'm apt to give the wrong impression, living the way I do. But I'm not trying to fool anyone. Yearsago I was showing a group of visitors through the house and I noticed one man giving his wife the high sign. I saw himmouth the words 'old money!' The man was David Howard, the world's leading expert on armorial Chinese porcelain. Itook him aside afterward and said, 'Mr. Howard, I was born in Gordon, Georgia. That's a little town near Macon. Thebiggest thing in Gordon is a chalk mine. My father was a barber, and my mother worked as a secretary for the mine.My money - what there is of it - is about eleven years old.' Well, the man was completely taken aback. 'Do you knowwhat made me think you were from an old family,' he said, 'apart from the portraits and the antiques? Those chairs overthere. The needlework on the covers is unraveling. New money would mend it right away. Old money would leave itjust as it is.' 'I know that,' I told him. 'Some of my best customers are old money.'\"* * *I had heard Jim Williams's name mentioned often during the six months I had lived in Savannah. The house was one reason,son, but there were others. He was a successful dealer in antiques and restorer of old houses. He had been president ofthe Telfair Academy, the local art museum. His by-line had appeared in Antiques magazine, and the magazine's editor,Wendell Garrett, spoke of him as a genius: \"He has an extraordinary eye for finding stuff. He trusts his own judgment,and he's willing to take chances. He'll hop on a plane and go anywhere to an auction - to New York, to London,to Geneva. But at heart he's a southern chauvinist, very much a son of the region. I don't think he cares much forYankees.\"Williams had played an active role in the restoration of Savannah's historic district, starting in the mid-1950s. GeorgiaFawcett, a longtime preservationist, recalled how difficult it had been to get people involved in saving downtown Savannahin those early days. \"The old part of town had become a slum,\" she said. \"The banks had red-lined the wholearea. The great old houses were failing into ruin or being demolished to make way for gas stations and parking lots, andyou couldn't borrow any money from the banks to go in and save them. Prostitutes strolled along the streets. Coupleswith children were afraid to live downtown, because it was considered dangerous.\" Mrs. Fawcett had been a member ofa small group of genteel preservationists who had tried since the 1930s to stave off the gas stations and save the houses.\"One thing we did do,\" she said. \"We got the bachelors interested.\"Jim Williams was one of the bachelors. He bought a row of one-story brick tenements on East Congress Street, restoredthe whole row, and sold it. Soon he was buying, restoring, and selling dozens of houses all over downtownSavannah. Stories in the newspapers drew attention to his restorations, and his antiques business grew. He started goingto Europe once a year on buying trips. He was discovered by society hostesses. The improvement in Williams'fortunes paralleled the renaissance of Savannah's historic district. By the early 1970s, couples with children came backdowntown, and the prostitutes moved over to Montgomery Street.Feeling flush, Williams bought Cabbage Island, one of the sea islands that form an archipelago along the Georgiacoast. Cabbage Island was a folly. It covered eighteen hundred acres, all but five of which lay under water at high tide.He paid $5,000 for it in 1966. Old salts at the marina told him he had been duped: Cabbage Island had been on themarket for half that sum the year before. Five thousand dollars was a lot of money for a soggy piece of real estate youcouldn't even build a house on. But a few months later phosphates were discovered under several coastal islands, includingCabbage Island. Williams sold out to Kerr-McGee of Oklahoma for $660,000. Several property owners onneighboring islands laughed at him for jumping at the bait too quickly. They held out for a higher price. Weeks later,the state of Georgia outlawed drilling along the coast. The phosphate deal was dead, and as it turned out, Williamswas the only one who had sold in time. His after-tax profit was a half million dollars.Now he bought far grander houses. One of them was Armstrong House, a monumental Italian Renaissance palazzodirectly across Bull Street from the staid Oglethorpe Club. Armstrong House dwarfed the Oglethorpe Club, and,according to local lore, that was very much its purpose. George Armstrong, a shipping magnate, was said to havebuilt the house in 1919 in response to being blackballed by the club. Although that story was not, in fact, true, ArmstrongHouse was a lion of a house. It gloated and glowered and loomed. It even had a curving colonnade that reachedout like a giant paw as if to swat the Oglethorpe Club off its high horse across the street.The outrageous magnificence of Armstrong House appealed to Williams and to his growing appetite for grandeur.He was not a member of the Oglethorpe Club. Bachelors from middle Georgia who sold antiques were not likely to beasked to join - not that it bothered him. He installed his antiques shop in Armstrong House for a year and then sold thehouse to the law firm of Bouhan, Williams and Levy and went on about the business of living like, if not being, anaristocrat. He made more frequent buying trips to Europe--in style now, on the QE2--and sent back whole containerloads of important paintings and fine English furniture. He bought his first pieces of Faberge. Williams was gaining staturein Savannah, to the irritation of certain blue bloods. \"How does it feel to be nouveau riche?\" he was asked on oneoccasion. \"It's the riche that counts,\" Williams answered. Having said that, he bought Mercer House.Mercer House had been empty for more than ten years. It stood at the west end of Monterey Square, the most elegantof Savannah's many tree-shaded squares. It was an Italianate mansion of red brick with tall, arched windows set off byornate ironwork balconies. It sat back from the street, aloof behind its apron of lawn and its cast-iron fence, not so muchlooking out on the square as presiding over it. The most recent occupants of the house, the Shriners, had used it as theAlee Temple. They had hung a neon-lit scimitar over the front door and driven around inside on motorcycles. Williamsset about restoring the house to something greater than its original elegance. When work was completed in1970, he gave a black-tie Christmas party and invited the cream of Savannah society. On the night of his party, everywindow of Mercer House was ablaze with candlelight; every room had sparkling chandeliers. Clusters of onlookers stoodoutside watching the smart arrivals and staring in amazement at the beautiful house that had been dark for so long.A pianist played cocktail music on the grand piano downstairs; an organist played classical pieces in the ballroomabove. Butlers in white jackets circulated with silver trays. Ladies in long gowns moved up and down the spiral stairs inrivers of satin and silk chiffon. Old Savannah was dazzled.The party soon became a permanent fixture on Savannah's social calendar. Williams always scheduled it to occur at theclimax of the winter season - the night before the Cotillion's debutante ball. That Friday night became known as thenight of Jim Williams' Christmas party. It was the Party of the Year, and this was no small accomplishment for Williams.\"You have to understand,\" a sixth-generation Savannahian declared, \"Savannah takes its parties very seriously.This is a town where gentlemen own their own white tie and tails. We don't rent them. So it's quite a tribute to Jim thathe has been able to make so prominent a place for himself on the social scene, in spite of not being a native Savannahianand being a bachelor.\"The food at Williams' parties was always provided by Savannah's most sought-after cateress, Lucille Wright. Mrs.Wright was a light-skinned black woman whose services were so well regarded that Savannah's leading hostesses hadbeen known to change the date of a party if she was not available. Mrs. Wright's touch was easy to spot. Guestswould nibble on a cheese straw or eat a marinated shrimp or take a bite of a tomato finger sandwich and smile knowingly.\"Lucille . . . !\" they would say, and nothing more needed to be said. (Lucille Wright's tomato sandwiches werenever soggy. She patted the tomato slices with paper towels first. That was just one of her many secrets.) Her clients heldher in high esteem. \"She's a real lady,\" they often said, and you could tell from the way they said it that they consideredthat high praise for a black woman. Mrs. Wright admired her patrons in return, although she did confide that Savannah'shostesses, even the rich ones, tended to come to her and say, \"Now, Lucille, I want a nice party, but I don't wantto spend too much money.\" Jim Williams was not like that. \"He likes things done in the grand style,\" Mrs. Wright said,\"and he's very liberal with his money. Very. Very. He always tells me, 'Lucille, I'm having two hundred people and I wantlow-country food and plenty of it. I don't want to run out. Get what you need. I don't care what it costs.'\"Jim Williams' Christmas party was, in the words of the Georgia Gazette, the party that Savannah socialites \"livedfor.\" Or lived without, for Williams enjoyed changing his guest list from year to year. He wrote names on file cardsand arranged them in two stacks: an In stack and an Out stack. He shunted the cards from one stack to the other andmade no secret of it. If a person had displeased him in any way during the year, that person would do penance comeChristmas. \"My Out stack,\" he once told the Gazette, \"is an inch thick.\"* * *An early-evening mist had turned the view of Monterey Square into a soft-focus stage set with pink azaleas billowingbeneath a tattered valance of live oaks and Spanish moss. The pale marble pedestal of the Pulaski monument glowedhazily in the background. A copy of the book At Home in Savannah--Great Interiors lay on Williams' coffee table. Ihad seen the same book on several other coffee tables in Savannah, but here the effect was surreal: The cover photographwas of this very room.For the better part of an hour, Williams had taken me on a tour of Mercer House and his antiques shop, which was quartered in the carriage house. In the ballroom, he played the pipe organ, first a piece by Bach, then \"I Got Rhythm.\" Finally, to demonstrate the organ's deafening power, he played a passage from Cesar Franck's \"Piece Heroique.\" \"When my neighbors let their dogs howl all night,\" said Williams,\"this is what they get in return.\" In the dining room, he showed me his royal treasures: Queen Alexandra's silverware,the Duchess of Richmond's porcelain, and a silver service for sixty that had belonged to a Russian grand duke.The coat of arms from the door of Napoleon's coronation carriage hung on the wall in the study. Here and therearound the house lay Faberge objects--cigarette cases, ornaments, jewel boxes - the trappings of aristocracy, nobility,royalty. As we moved from room to room, tiny red lights flickered in electronic recognition of our presence.Williams was wearing gray slacks and a blue cotton shirt turned up at the sleeves. His heavy black shoes and thickrubber soles were oddly out of place in the elegance of Mercer House, but practical; Williams spent several hours a dayon his feet restoring antique furniture in his basement workshop. His hands were raw and callused, but they had beenscrubbed clean of stains and grease.\"If there's a single trait common to all Savannahians,\" he was saying, \"it's their love of money and their unwillingnessto spend it.\"\"Then who buys those high-priced antiques I just saw in your shop?\" I asked.\"That's exactly my point,\" he said. \"People from out town. Atlanta, New Orleans, New York. That's where Imost of my business. When I find an especially fine piece furniture I send a photograph of it to a New York dealer.don't waste time trying to sell it here in Savannah. It's not that people in Savannah aren't rich enough. It's just thatthey're very cheap. I'll give you an example.\"There's a woman here, a grande dame at the very apex of society and one of the richest people in the Southeast, letalone Savannah. She owns a copper mine. She built a big house in an exclusive part of town, a replica of a famousLouisiana plantation house with huge white columns and curved stairs. You can see it from the water. Everybody goes,'Oooo, look!' when they pass by it. I adore her. She's been like a mother to me. But she's the cheapest woman who everlived! Some years ago she ordered a pair of iron gates for her house. They were designed and built especially for her. Butwhen they were delivered she pitched a fit, said they were horrible, said they were filth. 'Take them away,' she said, 'Inever want to see them again!' Then she tore up the bill, which was for $1,400 - a fair amount of money in thosedays.\"The foundry took the gates back, but they didn't know what to do with them. After all, there wasn't much demandfor a pair of ornamental gates exactly that size. The only thing they could do was to sell the iron for its scrap value.So they cut the price from $1,400 to $190. Naturally, the following day the woman sent a man over to the foundrywith $190, and today those gates are hanging on her gateposts where they were originally designed to go. That's pureSavannah. And that's what I mean by cheap. You mustn't be taken in by the moonlight and magnolias. There's more toSavannah than that. Things can get very murky.\" Williams stroked his cat and tapped another ash into the ashtray.\"We had a judge back in the nineteen-thirties, a member of one of the city's leading families. He lived one square overfrom here in a big house with tall white columns. His older son was going around town with a gangster's girlfriend. Thegangster warned him to stop, but the judge's son kept right at it. One night the doorbell rang and when the judgeopened the door, he found his son lying on the porch bleeding to death with his private parts tucked under his lapel.The doctors sewed his genitals back on, but the body rejected them and he died. The next day, the headline in thepaper read FALL FROM PORCH PROVES FATAL. Most members of that family still deny the murder ever happened, but the victim'ssister tells me it's true. \"It doesn't end there. The same judge had another son. This one lived in a house on Whitaker Street. He and hiswife used to fight. I mean really go at it, throw each other across rooms and that sort of thing. During one of thosefights, their three-year-old daughter came downstairs unnoticed, just when the husband was getting ready to fling hiswife into a marble-topped table. When the woman hit the table, it overturned and crushed the little girl. They didn'tfind out about it until an hour later when they were picking up the debris from the fight. As far as the family is concerned,that incident never happened either.\"Williams picked up the decanter of Madeira And refilled our glasses. \"Drinking Madeira is a great Savannah ritual,you know,\" he said. \"It's a celebration of failure, actually. The British sent whole shiploads of grapevines over fromMadeira in the eighteenth century in hopes of turning Georgia into a wine-producing colony. Savannah's on the samelatitude as Madeira. Well, the vines died, but Savannah never lost its taste for Madeira. Or any other kind of liquorfor that matter. Prohibition didn't even slow things down here. Everybody had a way of getting liquor, even little oldladies. Especially the old ladies. A bunch of them bought a Cuban rumrunner and ran it back and forth between hereand Cuba.\"Williams sipped his Madeira. \"One of those ladies died just a few months ago. Old Mrs. Morton. She was a marvel.She did exactly as she pleased all her life, God bless her. Her son came home for Christmas vacation one year and broughthis college roommate with him. Mama and the college roommate fell in love; the roommate moved into the masterbedroom with her; Daddy moved into the guest bedroom, and the son went back to college and never came homeagain. From then on, Mr. and Mrs. Morton and the roommate lived in that house under those circumstances until theold man died. They kept up appearances and pretended nothing at all outrageous had happened. Mama's younglover served as her chauffeur. Whenever he dropped her off and picked her up at her bridge parties, the other ladieswould peer out at them through the venetian blinds. But they never let on that they were interested, because nobody,nobody ever mentioned his name in her presence.\"Williams fell silent for a moment, no doubt reflecting upon the recently departed Mrs. Morton. Through the openwindow, Monterey Square was quiet except for the rasp of a cricket and the passing, now and then, of a car unhurriedlynegotiating the turns around the square.\"What do you suppose would happen,\" I asked, \"if the tour guides told that sort of story to their busloads oftourists?\"\"Not possible,\" said Williams. \"They keep it very prim and proper.\"I told Williams that as I was coming up the walk earlier I had heard the guide on one of the tour buses talking about this house.\"Bless their boring little hearts,\" said Williams. \"What did the guide say?\"\"She said that the house was the birthplace of the famous songwriter Johnny Mercer, the man who wrote 'MoonRiver,' 'I Wanna Be Around,' 'Too Marvelous for Words,' and other standards.\"\"Wrong, but not completely off base,\" said Williams. \"What else?\"\"That last year Jacqueline Onassis offered to buy the house and everything in it for two million dollars.\"\"The guide gets C minus for accuracy,\" said Williams. \"And now, I'll tell you what really happened:\"Construction of the house was begun in 1860 by the Confederate general Hugh Mercer, Johnny Mercer's great-grandfather.It was unfinished when the Civil War broke out and after the war, General Mercer was imprisoned and tried for the murder of two army deserters. He was eventually acquitted, largely on the testimony of his son, and released from a jail a broken and very angry man. He sold the house, and the new owners completed it. So none of the Mercers ever lived here, including Johnny. Late in his life, though, Johnny used to drop in when he was in town. In fact, he taped a Mike Douglas show in the front yard. He once offered to buy the house, but I told him, 'Johnny, you don't need it, you'll end up playing houseboy to it just as I have.' And that's as close as he came to ever living here.\"Williams leaned back and sent a thin stream of cigar smoke ceilingward. \"I'll come to Jacqueline Onassis in a moment,\"he said, \"but first I want to let you in on another piece of history that the tour guides never mention. It's anincident I call 'Flag Day.' It happened a couple of years ago.\" He stood up and went over to the window. \"Monterey Square is lovely,\" he said. \"In my opinion, it's the most beautiful of all the squares in Savannah. The architecture, the trees, the monument, the way it all fits together. Moviemakers love it. Something like twenty feature films have been shot in Savannah in the past six years, and Monterey Square is one of their favorite shooting locations.\"Every time filming begins the town goes wild. Everybody wants to be an extra and meet the stars and watch from thesidelines. The mayor and the city councilmen think it's wonderful because the film companies will spend money here,and Savannah will become famous, and that will help tourism.\"But it really isn't so wonderful at all. The moviemakers pay local extras the minimum wage, and Savannah doesn't get publicity after all, because the audiences usually haven't the vaguest idea where the movies have been shot. In fact, the costs to Savannah turn out to be greater than the return if you add up the overtime pay for sanitation men and police and the disruption of traffic. And the film crews are invari-ably rude. They leave piles of litter. They destroy shrubbery. They trample the grass. One crew even cut down a palm tree across the square, because it didn't happen to suit them.\"Well, the rudest bunch of all came to town a couple of years ago to film a CBS made-for-TV movie about the assas-sination of Abraham Lincoln. They selected Monterey Square for an important outdoor scene, but naturally we were not consulted. The night before filming was to begin, the police went around and abruptly ordered all of us to move our cars out of the square and not to enter or exit our houses between ten in the morning and five that afternoon. The film crew then dumped eight truckloads of dirt onto the street and spread it around to make it look like the unpaved streets of 1865. The next morning we awoke to find the square full of horses and wagons and ladies in hoopskirts and a thick coating of dust all over everything. It was intol-erable. The cameras were in the middle of the square aimed directly at this house.\"Several of my neighbors asked me, as a founder and past president of the Downtown Neighborhood Association, to do something about it. I went out and asked the producer to make a thousand-dollar contribution to the Humane Society to show his good intentions. He said he would think it over and get back to me by noon.\"Noon came and went. The producer never responded. In-stead, the cameras began to roll. I decided to ruin his shot, and this is how I did it.\"Williams opened a cabinet to the left of the window and took out a bolt of red cloth. He held it up over his head and unfurled it with a snap of his wrist. It was an eight-foot Nazi banner.\"I draped this over the balcony outside the window,\" he said. He held the banner up so I could get a good look at the big black swastika against a circle of white on a field of bright red.\"I bet that stopped the shooting,\" I said.\"Yes, but only temporarily,\" he said. \"The cameraman switched to the other side of the house, so I moved the flag to the window in the study. They eventually got the shot they wanted, but at least I made my point.\"Williams rolled up the banner and put it back in the cab-inet. \"The furor it caused was something I hadn't expected. The Savannah Morning News splashed the story across its front page, complete with photographs. They wrote vituper-ative editorials and published angry letters. The wire services picked it up too, and so did the television network evening news.\"I found myself having to explain that, no, I was not a Nazi and that I had used the flag to create a time warp in or-der to stop some very inconsiderate filmmakers, who were not Jewish as far as I knew. But I did make one terrible over-sight. I had forgotten that the Temple Mickve Israel syna-gogue is located directly across the square. The rabbi wrote me a letter asking how I happened to have a Nazi flag handy. I wrote back saying my uncle Jesse had brought it back as a trophy from the Second World War. I also told him I collected relics of all sorts of fallen empires and that the flag and a few other World War Two items were simply part of that group.\"\"Then I wasn't mistaken,\" I said. \"That was a Nazi dagger I saw on a table in the rear parlor.\"\"I have several,\" said Williams, \"plus a few sidearms and a hood ornament from a Nazi staff car. That's about the ex-tent of it, though. Artifacts of Hitler's regime are not popu-lar, but they do have historic value. Most people understand that point and know there was nothing political about my protest. The firestorm abated after a couple of weeks, but every so often I encounter a smoldering ember in the form of glaring eyes or people crossing the street to avoid me.\"\"But I gather you haven't been ostracized.\"\"Not at all. Six months after Flag Day, Jacqueline Onassis came to call.\"Williams crossed the room and lifted the lid of a slant-top desk. \"Twice a year,\" he said, \"Christie's auction house has Fabergé sales in Geneva. Last year, the star item in the sale was an exquisite little jade box. It had been widely adver-tised, and there was a lot of excitement about it. The man in charge of those sales was Geza von Habsburg; he'd be archduke of the Austro-Hungarian Empire today if it still ex-isted. Geza's a friend of mine. I've attended those sales for years. Naturally, I flew over for this one, and I said, 'Geza, I'm here to buy that little box.' Geza laughed and said, 'Jim, quite a number of people are here to buy that little box.' I had visions of having to bid against Malcolm Forbes and his ilk, but I thought at least I'd have fun driving up the price. So I said, 'Well, Geza, let's put it this way: If somebody out-bids me and buys that box they're gonna, by God, know they bought a box!' The bidding started at the highest esti-mate. I finally bought the box for seventy thousand dollars. Then I flew back over the Atlantic on the Concorde and had a champagne cocktail with the little box sitting on my linen--covered tray.\"The very next morning, I was down in my basement workshop restoring furniture, jet-lagged and unshaven, when the doorbell rang. I sent one of my assistants, Barry Thomas, up to answer it. He came running back downstairs all out of breath and said a tour guide was at the door and wanted to know if I would show Jacqueline Onassis through the house. I thought, 'This is a bunch of bull,' but I came up anyway and there was the tour guide, and indeed she had Mrs. Onassis waiting in the car.\"I asked her to drive around the block a few times and give me a chance to shave and get the house pulled together. While she did that, I got myself ready and told the boys to do what we call a tour-of-homes lighting. It's a set routine that takes a full ten minutes of turning on lamps, opening shutters, emptying ashtrays and clearing away newspapers. Just as we were finishing, the doorbell rang again, and there was Mrs. Onassis and her friend Maurice Tempelsman. 'I'm awfully sorry I sent you away before,' I said, 'but I just got back last night from the Fabergé sale in Geneva.' With that, Mr. Tempelsman said, 'Who bought the box?' I said, 'Won't you come in and see?' Without another word, he took Mrs. Onassis by the arm and said, 'There it is. I told you we should have bought it.'\"Williams handed me the box. It was a rich deep green, about four inches square. The top was covered with a bril-liant latticework of diamonds punctuated with cabochon ru-bies. In the center, a white oval enamel medallion bore the cipher of Nicholas II in diamonds and gold.\"They were in the house an hour or so,\" said Williams. \"They looked at everything. We went upstairs, and I played the pipe organ, and then we all played roulette. They were completely charming. Tempelsman had what I call a topside dye job. You take a man and dip him bottom side up in hair dye and stop right at the ears. He was an interesting man, very knowledgeable about antiques. In fact, they both were. They'd been traveling down the coast on his yacht, but Mrs. Onassis was very down-to-earth. She was wearing a white linen suit and didn't even bother brushing the dust off her chair when we sat down in the garden. She invited me to come visit her in her 'hovel' the next time I came to New York. When they left, she asked how to get to the nearest Burger King.\"\"What about offering to buy the house for two million dollars?\" I asked.\"She did nothing as crass as that, but she apparently told Tempelsman in front of the tour guide--who reported it to the newspapers, of course--that she wished she owned the house and everything in it. 'But not Jim Williams,' she said, 'I couldn't afford him.'\"I ran my hands over the Fabergé box. The lid swung smoothly on its hinges. The gold clasp fastened with a muted click. As I gazed at this dazzling object, I was only half-aware of a key turning in the front door of Mercer House and of footsteps approaching in the entrance hall. Suddenly, a sharp voice cut the air. \"Goddammit! Goddamn bitch!\"A blond boy stood in the doorway. He appeared to be about nineteen or twenty. He was wearing blue jeans and a sleeveless black T-shirt with the words FUCK YOU printed in white across the front. He was trembling with barely con-trolled fury. His sapphire-blue eyes were blazing.\"What seems to be the problem, Danny?\" Williams asked calmly, without rising from his chair.\"Bonnie! Goddamn bitch. She stood me up! She's runnin' around at all the southside bars. Dammit! I ain't takin' her shit no more!\"The boy grabbed a vodka bottle from the table and filled a crystal glass to the brim. He gulped it down. His arms were tattooed--a Confederate flag on one arm, a marijuana plant on the other.\"Get hold of yourself now, Danny,\" Williams said, speak-ing deliberately. \"Just tell me what happened.\"\"Maybe I was a few minutes late! I got throwed off in my timing. So what! Shit! Her girlfriend said she left 'cause I wasn't there when I said I'd be.\" He glared at Williams. \"Gimme twenty dollars! I need the money. I'm pissed off!\"\"What do you need it for?\"\"None of your goddamn business! I need to get fucked up tonight, if you really wanna know. That's what!\"\"I think you've already accomplished that, Sport.\"\"I ain't anywhere near fucked up enough yet!\"\"Now, Danny, don't go doing that and driving your car. You'll get arrested for sure if you do. You've already got charges against you from the last time you got, quote, fucked up. They're really gonna nail you this time.\"\"I don't give a goddamn about you or Bonnie or the god-damn police!\"With that, the boy turned and abruptly left the room. The front door slammed. Outside, a car door opened and closed. A sharp, prolonged squeal of tires pierced the evening still-ness. There was another squeal as the car rounded the cor-ner of Monterey Square, then another as it turned again and sped down Bull Street. Then all was quiet.\"I'm sorry,\" said Williams. He got up and poured himself a drink, not Madeira this time but straight vodka. Then si-lently, almost imperceptibly, he released a sigh and allowed his shoulders to relax.I looked down and saw that I was still holding the Fabergé box. I was clutching it so tightly I was afraid for a moment I might have dislodged a jewel or two from the top. It seemed intact. I handed it back to Williams.\"That was Danny Hansford,\" he said. \"He works for me part-time refinishing furniture in my workshop.\"Williams studied the end of his cigar. He was calm, controlled.\"This is not the first time something like this has hap-pened,\" he said. \"I have an idea how it will end up. Later to-night, about three-thirty, the telephone will ring. It'll be Danny. He'll be charming and sweet-natured. He'll say, 'Hey, Jim! This is Danny. I'm real sorry to wake you up. Boy, did I fuck up tonight! Ma-a-a-an, did I make some big mis-takes!' And I'll say, 'Well, Danny, what happened this time?' And he'll say, 'I'm callin' from the jailhouse. Yeah, they put me in here again. But I ain't done nothin' wrong. I was goin' down Abercorn Street, see if I could find Bonnie, and I burned a little rubber and turned left real quick, and there was this goddamn police car! Blue lights, sirens. Man, I'm in trouble. Hey, Jim? Think you could come down and get me out?' And I'll say, 'Danny, it's late, I'm tired of this. Why don't you just cool it and relax yourself tonight. In jail.'\"Now, Danny won't like this one bit, but he won't lose his cool. Not now. He'll keep it calm. He'll say, 'I know what you mean, and you're right. I oughta stay in here the rest of my goddamn life. It's been a messed-up life anyhow.' He'll be working on my sympathy now. 'It's okay, Jim,' he'll say. 'Just leave me here. Don't worry about it. Hell, I don't even care. I hope I didn't get you upset. Hope you can get back to sleep all right. See you later.'\"Inside, Danny will be seething because I won't come right down there. He won't show it, though, because he knows I'm the only one who'll help him. He knows I'll call the bonds-man and tell them to go get him out, and they will. But I won't do that until morning, after the drugs have worn off.\"Williams gave no outward sign that he was at all embar-rassed by the human tornado that had just passed through his house.\"Danny has two distinct personalities,\" he said. \"He can switch from one to the other like turning the pages of a book.\" Williams was speaking about Danny with calm de-tachment, just as he had spoken earlier about the Waterford crystal chandelier in the dining room, the portrait by Jere-miah Theus in the parlor, and the judge's son and the gang-ster's moll. But he did not address the most curious question of all: Danny's presence in Mercer House and the fact that he apparently had the run of it. The incongruity was star-tling. Perhaps it registered on my face, because Williams of-fered something of an explanation.\"I have hypoglycemia,\" he said, \"and lately I've been blacking out. Danny stays here sometimes to baby-sit me when I'm not feeling well.\"It may have been the Madeira, or the atmosphere of frank-ness that Williams had inspired with his stories--at any rate, I felt free to observe that blacking out alone might be pref-erable to having this person running loose in the house. Wil-liams laughed. \"Actually, I think Danny may be improving a little.\"\"Improving? Over what?\"\"Two weeks ago, we had a similar scene, but it ended a bit more dramatically. Danny was agitated that time because his best friend had made a disparaging remark about his car, and his girlfriend had refused to marry him. Danny came back to the house and carried on about it, and before I knew what was happening, he had stomped a small table, thrown a bronze lamp against the wall, and slammed a cut-glass wa-ter pitcher on the floor with so much force it made a perma-nent imprint on the heart-pine floorboards. But he wasn't through yet. He took one of my German Lugers and fired a bullet into the floor upstairs. Then he ran out the front door and fired another shot into Monterey Square, trying to knock out a streetlight.\"Naturally, I called the police. But when Danny heard the sirens, he tossed the gun into the bushes, ran indoors, flew up the stairs, and jumped into bed with all his clothes on. The cops were no more than a minute behind him, but by the time they got upstairs, Danny was pretending to be fast asleep. When they 'woke' him, he put on an act of confusion and denied he'd broken anything or shot any guns. But the police noticed tiny drops of blood on his arms from the little splinters of glass that had shot up when he smashed the pitcher on the floor. So they took him off to jail. I figured the longer I left him there the madder he'd get, so the next morning I dropped the charges and got him out.\" I did not ask the obvious question: Why do you have any-thing to do with him? Instead, I asked a question of more immediate concern: \"You said Danny had fired 'one of' your German Lugers. How many do you have?\"\"Several,\" said Williams. \"I need them for security. I'm here by myself a lot, and I've had a couple of robberies. The second robbery was pulled off by a man who was armed with a submachine gun, and I was asleep upstairs at the time. That's when I installed the alarm system. It works fine when I'm out of the house or upstairs, but I can't throw the switch when I'm walking around down here on the main floor, because it'll summon the police. So I keep pistols in strategic places. There's a Luger in the rear library, another in a desk drawer in my office, a third in the Irish linen press in the hall, and a Smith and Wesson in the living room. I've also got a shotgun and three or four rifles upstairs. The pistols are loaded.\"\"That's four loaded pistols,\" I said.\"There's a risk, I know. But I'm a gambler. I have been all my life. You have to be if you deal in antiques and restore houses and go into debt for all of it as I have. But when I gamble I know how to improve the odds. Come, I'll show you.\"Williams led me over to a small backgammon table. He removed the backgammon board and replaced it with an-other plain board lined with green felt.\"I believe in mind control,\" he said. \"I think you can influ-ence events by mental concentration. I've invented a game called Psycho Dice. It's very simple. You take four dice and call out four numbers between one and six--for example, a four, a three, and two sixes. Then you throw the dice, and if any of your numbers come up, you leave those dice stand-ing on the board. You continue to roll the remaining dice until all the dice are sitting on the board, showing your set of numbers. You're eliminated if you roll three times in suc-cession without getting any of the numbers you need. The object is to get all four numbers in the fewest rolls.\"Williams was sure he could improve the odds by sheer concentration. \"Dice have six sides,\" he said, \"so you have a one-in-six chance of getting your number when you throw them. If you do any better than that, you beat the law of av-erages. Concentration definitely helps. That's been proved. Back in the nineteen-thirties, Duke University did a study with a machine that could throw dice. First they had it throw dice when nobody was in the building, and the num-bers came up strictly according to the law of averages. Then they put a man in the next room and had him concentrate on various numbers to see if that would beat the odds. It did. Then they put him in the same room, still concentrat-ing, and the machine beat the odds again, by an even wider margin. When the man rolled the dice himself, using a cup, he did better still. When he finally rolled the dice with his bare hand, he did best of all.\"From the few rounds we played, I could not say whether Psycho Dice really worked. Williams had no doubt that it did. He saw proof of it at every turn. When I needed a five and rolled a two, he proclaimed, \"Aha! You know what's on the other side of a two, don't you? Five!\"I could not let this pass. \"If we'd been betting, I would have lost anyway, wouldn't I?\"\"Yes, but look how close you came. You see, the same concentration that makes Psycho Dice work can make most things in life work. I've never been sick a day in my life ex-cept for a common cold once in a while. I just can't be both-ered. I don't have the time. Being sick is a luxury. I concentrate on being well. Danny didn't do more than let off steam tonight, because I cooled him down. I was concentrating on that.\"I was tempted not to let that remark pass, either. But it was late. I rose to leave. \"Isn't it possible that other people will turn their mental energy on you?\" I asked.\"They try to all the time,\" Williams said with a wry smile. \"I'm told a lot of people pray fervently night after night that I'll invite them to my Christmas parties.\"\"I can understand that,\" I said. \"From what I've heard, it's the best party in Savannah.\"\"I'll invite you to the next one, and you can judge for yourself.\" Williams fixed me with an impenetrable look. \"You know I have two Christmas parties, not just one. Both are black-tie. The first party is the famous one. It's the one that gets written up in the newspapers, the one the high and mighty of Savannah come to. The second party is the next night. It's the one the papers never write about. It's . . . for gentlemen only. Which party would you like to be invited to?\"\"The one,\" I said, \"least likely to involve gunfire.\" Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 16 hrs 29 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 11 hrs 44 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 6 hrs 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "THE LANDMARK NEW YORK TIMES BESTSELLER • An enormously engaging portrait of a most beguiling Southern city: “Elegant and wicked.... [This] might be the first true-crime book that makes the reader want to book a bed and breakfast for an extended weekend at the scene of the crime.\" —The New York Times Book Review • 30th Anniversary Edition with a New Afterword by the Author.Shots rang out in Savannah's grandest mansion in the misty,early morning hours of May 2, 1981. Was it murder or self-defense? For nearly a decade, the shooting and its aftermath reverberated throughout this hauntingly beautiful city of moss-hung oaks and shaded squares. John Berendt's sharply observed, suspenseful, and witty narrative reads like a thoroughly engrossing novel, and yet it is a work of nonfiction. Berendt skillfully interweaves a hugely entertaining first-person account of life in this isolated remnant of the Old South with the unpredictable twists and turns of a landmark murder case.It is a spellbinding story peopled by a gallery of remarkable characters: the well-bred society ladies of the Married Woman's Card Club; the turbulent young redneck gigolo; the hapless recluse who owns a bottle of poison so powerful it could kill every man, woman, and child in Savannah; the aging and profane Southern belle who is the \"soul of pampered self-absorption\"; the uproariously funny black drag queen; the acerbic and arrogant antiques dealer; the sweet-talking, piano-playing con artist; young blacks dancing the minuet at the black debutante ball; and Minerva, the voodoo priestess who works her magic in the graveyard at midnight. These and other Savannahians act as a Greek chorus, with Berendt revealing the alliances, hostilities, and intrigues that thrive in a town where everyone knows everyone else. Midnight in the Garden of Good and Evil is a sublime and seductive reading experience. Brilliantly conceived and masterfully written, this true-crime book has become a modern classic.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9"
            },
            {
                "name": "Americas",
                "link": "https://www.amazon.com/Americas-History-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4808"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Vintage; Reprint edition (June 28, 1999)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0679751521"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0679751526"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.19 x 0.9 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,816 in Books (See Top 100 in Books) #8 in Criminology (Books) #24 in U.S. State & Local History #32 in Murder & Mayhem True Accounts"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 14,048 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Oldtimer37",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4NNV6IRKWZILIHF5XQBRM4FR5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QC83NXOQXVYE?ASIN=0679751521",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Better than the movie",
                "reviewText": "If you have seen the movie, it is close to the book. Without giving away the details, it is well worth the read if you liked the movie.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jane magana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJG2UGCYIBHETFFAGS522TATDMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJWFO1VJM1QVS?ASIN=0679751521",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "4.0 out of 5 stars charming AND boring",
                "reviewText": "This book is like 2wong fu meets to kill a mockingbird.A truly charming little tale of a man charged with murder, and its a true story!It is a little bit laborious and slow but I found it worth it in the end",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lbreader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDDXRNXSDUWYIIQUEUEI5HMCFBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBXWLXGXL9AVA?ASIN=0679751521",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars worth the hype",
                "reviewText": "This was a really good book about a strange and unique city, which in 2024, is still strange and unique. I thoroughly enjoyed this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathy L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHAZAHBQMXYJHGGCWE7YAIMKNCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SNSSEQKCYQ8Z?ASIN=0679751521",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars great history told in a hard to put down story",
                "reviewText": "Having just visited Savannah for the first time I wanted to learn more history and a friend told me this book is a must read. Thoroughly enjoyed the history lesson in a setting I could now relate to. Well done!! I normally read to fall asleep but could not put this one down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alan and EmilyAlan and Emily",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIP3FP7PYDIV2NAQJHUGIQGRZ6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TSAEIOXFN4ZU?ASIN=0679751521",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2023",
                "reviewTitle": "3.0 out of 5 stars A story about Savannah, GA, and its people",
                "reviewText": "3.5 stars out of 5 for Midnight in the Garden of Good and Evil by John Berendt.Midnight in the Garden of Good and Evil by John Berendt has been on best-seller lists and was described as a modern classic, so I perhaps expected too much. I found the beginning of the novel to be kind of hard to get into, and the storyline was all over the place, with many different characters who didn’t seem to be part of the main murder plot. That all made more sense once I remembered that the novel was based on real people and events, but I wish the story was more focused, with dates included at the beginning of the chapters to help readers better follow the timeline.Midnight does have some very interesting characters, though, including drag queen Chablis and voodoo priestess Minerva. The descriptions of Savannah are also memorable, especially since I visited Savannah for the first time when I was about halfway through the book.The ending seemed sad and anti-climatic, but that’s not surprising in a book based on real life with few likable characters. I would describe the overall story as interesting rather than entertaining. I did enjoy the peek into the history of Savannah, but it might improve reader experience if book blurb writers would stop describing the novel as suspenseful and instead emphasize the non-fiction aspect.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81XSZ-hrD7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOCE5IFISJHJXUDHHMZM4X4K6UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B3WSWP9THUQF?ASIN=0679751521",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Read before you visit Savannah, GA",
                "reviewText": "If you read before you visit, you will want to see all the places mentioned in the book. Good story also mostly true!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jmk444",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVU5FAQKFH7RK4J3KPUIJYVZYAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I7SMENTH0PLC?ASIN=0679751521",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 4, 2002",
                "reviewTitle": "4.0 out of 5 stars A riveting read....",
                "reviewText": "I thought John Berendt did a very good job of weaving a rich tapestry of eccentric characters and a fascinating setting, into an original true crime story. The book is based on an actual murder that set the precedent for OJ Simpson's defense, that is challenging the police and Medical Examiner's handling of the crime scene evidence.Berendt spent eight years in Savannah, researching the book that originally started out as an article and it shows! In fact, maybe it shows too much...that is, what I gather, most of his critics have a problem with - INFO DUMP. Berendt does give reams of background material, but I never found it slow going. After reading this book you could picture Savannah and Berendt spun the same kinds of word pictures of each character. You'd swear you knew them all after reading this book.Jim Williams, a wealthy antiques and collectibles dealer, was charged with the murder of his live-in assistant (and part time male prostitute) Danny Hansford and the trial set off a local firestorm.As in the OJ case there were no witnesses - Williams charged self-defense, the prosecutor charged murder and the case went to trial...FOUR TIMES!The original sticking point was the total lack of gun powder residue on Danny Hansford's hands, indicating that he never fired a gun and that Williams may have simply murdered him. Throughout the trials, Williams maintains his innocence as the prosecutor builds more and more circumstantial evidence that shows increasing animosity between Williams and Hansford, Hansford's wild demeanor and bad temper.In one trial, a single juror, a woman who'd had to defend herself against a violent ex-husband, held out for acquittal, resulting in another hung jury. The fourth trial was moved to Augusta, Georgia - \"the heart of the Bible Belt,\" where the homosexual overtones where not expected to play very well. In Berendt's story, Jim Williams begins telling him how Danny grabbed a gun in which the firing pin had been filed down and Williams reached into his desk for his own gun and fired, fearing the younger man's rage. But Williams lawyer comes in with a blockbuster piece of evidence - neither the police at the scene, nor the hospital staff had bagged Danny Hansford's hands at the scene. In fact, they'd been bagged with plastic bags, which would allow any gun powder residue to be washed away by the condensation. Williams was off the hook!The book is a fascinating murder mystery, set in a fascinating town, with an array of exotic characters. There's Minerva, the voodoo princess, who helps Jim Williams commune with Danny dead spirit. Joe Odom is the house squatting, local entrepreneur. Lady Chablis (Frank) is a black transvestite who puts on burlesque shows at some of the local venues. There's even a man who walks the leash of a dog that died years ago, in order to keep receiving the $25/week for walking his late bosses pet.This book is certainly worth reading if only to see the way our legal process actually works. Just as in the OJ case, money appears to triumph over justice in the end. But what else is new? When or where has it been otherwise? After spending nearly two years on the hardcover bestseller list, I guess most folks have read this...if you haven't, by all means check it out. It's a very well crafted read.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Woods",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHH45YOG3ZWWTQW6355M7VEQM6KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q7Q43IPZDOJ5?ASIN=0679751521",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars I savored every character",
                "reviewText": "Having been raised in Georgia, I really loved reading this classic. The author did a wonderful job of portraying the characters and the city. I feel the warmth of the thick air even now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janet in BC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 11, 2023",
                "reviewTitle": "excellent read",
                "reviewText": "very fast delivery, book arrived in perfect condition, excellent read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lichi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 24, 2017",
                "reviewTitle": "EXCELLENT READ!",
                "reviewText": "FUN, WELL DEVELOPED CHARACTERS WHO PRESENTED THE CITY OF Savannah. REALLY ENJOYED IT. VERY REFRESHING. Worth Reading with a glass of wine by yourside.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "eshwari.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 23, 2017",
                "reviewTitle": "very nice experience",
                "reviewText": "it gives experience that story happening in front of you. and you watch all as you are the one neighbour to mencers house. ....",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kay L. Sheridan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 11, 2020",
                "reviewTitle": "The fils and bookgh",
                "reviewText": "I have the DVD of this film which I rewatch many times so thought I would read the book. I love them both and they are a look into another era which is stunning and beautiful and which sinks into degradation on a very sad level. I would give them both 10 stars",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dambar65",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on June 15, 2016",
                "reviewTitle": "Mezzanotte nel giardino del bene e del male",
                "reviewText": "Lo stile del linguaggio è molto curato nella ricerca della semplicità e facilità di lettura, i periodi sono relativamente brevi e scorrevoli, non vengono usati quasi mai termini ricercati e le espressioni idiomatiche usate sono abbastanza intuitive.Risulta quindi un buon libro su cui far pratica per chi sta studiando l’inglese.La copertina è un po troppo leggera sembra di aver tra le mani una rivista più che un libro, al contrario la carta delle pagine è di buona grammatura e piacevole al tatto.La trama è basata per lo più su persone e fatti reali, ed è incentrata sulla descrizione della città di Savannah e dei suoi cittadini da parte di un giovane giornalista che come tutti cede al fascino alla magnificenza e alla singolarità dei luoghi e dei personaggi incontrati.L’impressione che ho avuto ad inizio lettura è stata quella di esser immersi in un mondo elitario o addirittura in un epoca fuori dal tempo stesso in cui è ambientato il romanzo, un’atmosfera tipo anni venti, simile a quella del Grande Gatsby di Francis Scott Fitzgerald tanto per fare un esempio, atmosfera che sembra percepita è desiderata dai personaggi stessi della storia.Il titolo diventa sempre più eloquente avanzando con la lettura che piano piano mette in mostra la duplice faccia delle medaglie, anche di quelle più lucenti.Sperando di esservi stato utile auguro a tutti una piacevole letura",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.44",
                "sellerName": "Page Masters",
                "sellerRating": "4.5"
            }
        ]
    }
}