{
    "remaining_requests": 637,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Secret-Teachings-All-Ages-Encyclopedic/dp/B08SFZL4XM",
    "body": {
        "name": "The Secret Teachings of All Ages: An Encyclopedic Outline of Masonic, Hermetic, Qabbalistic and Rosicrucian Symbolical Philosophy",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Secret-Teachings-All-Ages-Encyclopedic/dp/B08SFZL4XM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/516wyD2DDDL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Manly Hall",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Manly+Hall"
        },
        "brand": "Manly Hall",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3014,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Manly Palmer Hall (1901-1990) was a Canadian-born author, lecturer, astrologer, and mystic. The Secret Teachings of All Ages is a comprehensive compendium of the ancient occult and esoteric traditions of the world. It looks at the schools of philosophy down the ages, in respect of their origins, notable characters, and influences on civilization. The vast scope of this classic work examines the ancient mythology, ritual, symbolism, arcane, and mystical teachings of, among others, the Druids, Mithraism, Christianity, Gnosticism, Platonism, Hermeticism, the Chaldeans, Paracelsus, Rosicrucianism, and other secret societies. The subjects covered include alchemy, cryptology, Kabbalah, and the Tarot. A valuable source for students of history, philosophy, or mythology. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Religion & Spirituality",
                "link": "https://www.amazon.com/Religion-Spirituality-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=22"
            },
            {
                "name": "New Age & Spirituality",
                "link": "https://www.amazon.com/New-Age-Religion-Spirituality-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=12621"
            },
            {
                "name": "Mysticism",
                "link": "https://www.amazon.com/Mysticism-New-Age-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=12673"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "28 hours and 30 minutes"
            },
            {
                "name": "Author",
                "value": "Manly Hall"
            },
            {
                "name": "Narrator",
                "value": "Adriel Brandt"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 08, 2021"
            },
            {
                "name": "Publisher",
                "value": "MuseumAudiobooks.com"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08SFZL4XM"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,228 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in New Age Mysticism (Books) #2 in Mysticism (Books) #4 in Other Religions, Practices & Sacred Texts (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MrsPeaster",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6HTCJJCMHGVKA5BKCNF3A3NH7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UMWZY0JMMZK8?ASIN=B08SFZL4XM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Pretty cool",
                "reviewText": "The media could not be loaded. This book covers alot of differnt things, but it gives you just enough to get you intrigued and makes u want to go search more out about each topic doscussed...it issecret teachings of all ages so it only has a few good pages on each... but it expresses info well and gives you references to where they got the information , like book title author or museum.. this book has given me chill bumps a few times. And reminds me of why I like the occult and that's bc it let's you know there's more to the world than brim stone and fire and there is magic in the world. Alot of the teaching and info in this book came from other books that ate no longer published, and are worth alot of money to aquire so it's all in all a cool book to have...there's so much we don't know🤔",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b8092d66-8fdc-4ecf-ab3a-3fa23c70c49f/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Aaron",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3V347XNPYX2J4SRHEYIWXDHFVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQJGA2P7CIIQA?ASIN=B08SFZL4XM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 3, 2023",
                "reviewTitle": "5.0 out of 5 stars A must read!!!!",
                "reviewText": "\"The Secret Teachings of All Ages\" by Manly P. Hall is a comprehensive and fascinating exploration of the esoteric and occult knowledge found in ancient and modern cultures around the world. First published in 1928, this book has become a classic in its field and remains a valuable resource for anyone interested in spirituality, philosophy, or the history of religion.The book covers a wide range of topics, including symbolism, mythology, astrology, alchemy, Freemasonry, and the mysteries of the ancient world. Hall's writing is clear and concise, and he presents complex ideas in a way that is easy to understand, even for those who are new to the subject matter.One of the most impressive aspects of this book is the depth of research that Hall conducted. He draws from a wide range of sources, including ancient texts, medieval manuscripts, and modern scholarship, to create a comprehensive picture of the esoteric traditions that have shaped human history.Overall, \"The Secret Teachings of All Ages\" is a must-read for anyone interested in esoteric knowledge and the hidden history of the world. Although some of the ideas presented may be controversial or challenging for some readers, Hall's writing is always thought-provoking and insightful, and the book remains an essential resource for anyone seeking a deeper understanding of the mysteries of the universe.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHOF6E3MUXDBIS3DROJWUOZOEVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36TXPJB7KQI2M?ASIN=B08SFZL4XM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Simply beautiful",
                "reviewText": "The hard bound edition of this book is simply a masterpiece. I have a golden addition copy and it is a prize. The illustrations are some of the best I have ever seen the information is esoteric in nature of course but it is very well researched and very well written this book is a one-time event.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dasa Alexyova",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMJSGW6HPRRLRWHC34U67UNYNRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFKTBHCN52DJ3?ASIN=B08SFZL4XM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Not easy, but a MUST for real students of magic !",
                "reviewText": "It's really hard to describe the magic and depth and knowledge available in this book, I don't read it as a novel but bits and pieces here and there as I need it, I let my intuition to guide me, it's gotta be used in the magical way. What you need from this book will find you exactly when you need it. AMAZING !",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff Marzano",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAMZKH53424YKEHYPJ4IG3YEHSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL2UUYL79P9DW?ASIN=B08SFZL4XM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2008",
                "reviewTitle": "4.0 out of 5 stars Comprehensive And Informative",
                "reviewText": "This gigantic book is very informative. It touches on the origins of many philosophical subjects.The word 'secret' in the title is significant. The main theme I think is that going back to the beginning of the human race there have been advanced souls who are initiated into ancient mysteries. After being sworn to secrecy they are sent out with that arcane knowledge to serve and enlighten mankind. Often they are misunderstood and persecuted.For example Pythagorus and later Plato were supposedly initiated into the Egyptian mysteries during rites that were (and perhaps still are) performed in a secret complex underneath the Great Pyramid. The Edgar Cayce material indicates that Christ was also initiated into the Egyptian mysteries and it was Christ who broke the sarcophogus inside the pyramid to symbolize His victory over death.There's a lot of very mysterious and mystical information in this book. It suggests that people like the enigmatic Francis Bacon had strange powers and possibly lived for over 300 years, faking his own funeral in the process.Interesting for me was the idea that it was sorcery and the perversion of the mysteries that led to the destruction of Atlantis and ancient Egypt.I took off one star because I feel it is perhaps too philosophical. Hall saw philosophy and symbolism in everything, suggesting that the stories in the New Testament in the bible are allegories for philosophical ideas. If amazon had a 10 star rating I would have given it 9 stars.Hall believed that philosophy is the only hope for this profane and God forsaken world. The highlight of his short career on Wall Street was witnessing someone take their own life after losing money in the stock market. He had become disillusioned by World War 1 and the materialism that he perceived in the world.This is not a book for skeptics or atheists. Hall believed that the spiritual realm is the true reality.The text size that accompanies the illustrations is smaller than the other text. You have to read those descriptions in good lighting. The illustrations are good though and very informative. Jeff Marzano Fulcanelli: Master Alchemist: Le Mystere des Cathedrales, Esoteric Intrepretation of the Hermetic Symbols of The Great Work (Le Mystere Des Cathedrales ... of the Hermetic Symbols of Great Work) Edgar cayce's story of the origin and destiny of man The Mystery of the Crystal Skulls: Unlocking the Secrets of the Past, Present, and Future Edgar Cayce's Atlantis and Lemuria: The Lost Civilizations in the Light of Modern Discoveries Edgar Cayce's Egypt: Psychic Revelations on the Most Fascinating Civilization Ever Known The Giza Power Plant : Technologies of Ancient Egypt Ufo...Contact from Planet Iarga Initiation in the Great Pyramid (Astara's Library of Mystical Classics) The Giza Death Star Initiation",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Craig",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDB7DW3CFODZU4Y2YPTEK6OQWFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UKNJISOONJX6?ASIN=B08SFZL4XM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Good",
                "reviewText": "Good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Clarence Reddick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6SMUPD4MBYHOYP4HKTWHXMGVNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11BCJ199URLZY?ASIN=B08SFZL4XM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 5, 2016",
                "reviewTitle": "5.0 out of 5 stars THIRD EYE FUELING",
                "reviewText": "I WOULD EXCEED THE LIMITATION OF CHARACTERS PERMITTED IN A TEXT, IF I WERE TO ELABORATE HOW EXCELLENT OF A BOOK THIS IS. I ENCOUNTERED MY FIRST CONTACT IN A WELL KNOWN BOOK SELLER STORE. BEING A SEEKER AND FREE THINKER, I STARTED BROWSING THE MULTITUDE OF BOOKS. THIS BOOK CAPTURED MY ATTENTION. I PICKED IT UP, STARTED READING. AND IN DOING SO, LOST TRACK OF TIME. I HAD DIFFICULTY PUTTING IT BACK ON THE SHELF. THE BOOK WAS COSTLY, SO AFTERWARDS, THE FIRST OPPORTUNITY I GOT, GUESS WHO I CONTACTED? DIDN'T TAKE MUCH TIME FOR YOU TO COME UP WITH THE. ANSWER. YES I CONTACTED AMAZON. CHEAPER PRICE, LIKE NEW, AND I DO MEAN LIKE NEW. I HAVE NO DOG IN THE FIGHT, SO LET ME SUGGEST HIGHLY, PAY YOURSELF THE PRIVILEGE OF PURCHASING THIS BOOK IF YOU DO NOT HAVE IT. AND I HOPE NO ONE RECOGNIZE WHO I AM, AND ASK ME FOR A LOAN OF THE BOOK TO READ. BUT IN THE EVENT THAT THAT HAPPENED, I'M SO SORRY BUT I'M WOULD HAVE TO SAY NO. I WILL DEFINITELY DIRECT THEM TO WHERE THEY CAN ASCERTAIN A PURCHASE OF IT. EXCELLENT BOOK.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tak",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Poland on February 6, 2024",
                "reviewTitle": "Bad packaging",
                "reviewText": "Book is good, but it was slightlydamaged and packing was bad, book was loose and vulnerable for further damage.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Federica",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 18, 2023",
                "reviewTitle": "Terrible quality",
                "reviewText": "The contets are great. Quality of the book is the real problem. Layout confusing and image quality terrible. Probably this publication deserve a higher price.It is true, indeed, that you obtain what you pay for. I will return it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Snake's",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 5, 2023",
                "reviewTitle": "Manly P Halls greatest work IMO",
                "reviewText": "If you are a fan of creating new neural pathways in the brain this book will do it. So much information in one location.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gomen  ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on August 26, 2023",
                "reviewTitle": "Great book",
                "reviewText": "Great book, but too long.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 3, 2021",
                "reviewTitle": "Education",
                "reviewText": "I am so excited, happy, start reading this book right away, o, so well written, so much to explore, learn, absorb and pass it on. Why so many customers complain about this copy, it is a best for it price, go and buy an original, I mean pay the price for what you get for but if you're about to open your mind, educate yourself, you don't need a perfect pictures, all you need is a text, right 🤗",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}