{
    "remaining_requests": 609,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Persepolis-Childhood-Pantheon-Graphic-Library/dp/037571457X",
    "body": {
        "name": "Persepolis: The Story of a Childhood",
        "price": "$9.99$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Persepolis-Childhood-Pantheon-Graphic-Library/dp/037571457X",
        "soldBy": {
            "sellerID": "A1YF2PESGKL3NT",
            "name": "Shakespeare Book House",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1YF2PESGKL3NT&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81iniAfNnxL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Marjane Satrapi",
            "link": "https://www.amazon.com/Marjane-Satrapi/e/B001IGFN9I/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Shakespeare Book House",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 4193,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 14 hrs 20 mins",
            "FREE delivery Monday, February 26 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b?ie=UTF8&node=2"
            },
            {
                "name": "Community & Culture",
                "link": "https://www.amazon.com/Ethnic-National-Biographies-Memoirs-Books/b?ie=UTF8&node=2365"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Pantheon; Reprint edition (June 1, 2004)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 160 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 037571457X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0375714573"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN380L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.91 x 0.51 x 8.86 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,044 in Books (See Top 100 in Books) #1 in Biographies & History Graphic Novels #36 in Women's Biographies #115 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 4,193 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Complete Persepolis Embroideries Persepolis Persepolis 2 Chicken with Plums Here, in one volume: Marjane Satrapi's best-selling, internationally acclaimed graphic memoir of growing up as a girl in revolutionary Iran. From the bestselling author of Persepolis comes this enlightening look into the sex lives of Iranian women, gathering together Marjane’s tough–talking grandmother, stoic mother, glamorous and eccentric aunt and their friends and neighbors. Wise, funny, and heartbreaking, Persepolis is Marjane Satrapi’s acclaimed graphic memoir of growing up in Iran during the Islamic Revolution. “A wholly original achievement.” —The New York Times: \"The 50 Best Memoirs of the Past 50 Years\" The fascinating continuation of the best-selling Persepolis, “one of the freshest and most original memoirs of our day” (Los Angeles Times). Marjane Satrapi dazzles with her graphic memoir about growing up in Iran during the Iranian Revolution. Acclaimed graphic artist Marjane Satrapi brings what has become her signature humor and insight, her keen eye and ear, to the heartrending story of a celebrated Iranian musician who gives up his life for music and love.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/57e32976-9ce6-42ee-ac85-f71d85acb92b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d8864b96-f3f7-44bc-91df-9a521e760ba4.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03535f27-775b-4a09-8e7f-72663ddcb7dc.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/41039ca1-e68f-49ac-9b4d-b18d47f2d2dd.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9d4a3e75-877b-49d5-828b-9cc62c13afca.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFS44S7GHCNG5IO6GGAD2VLOOS3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KDHX2E928Z6O?ASIN=037571457X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars 3d reading? Not quite but…",
                "reviewText": "Students were reading it for an English class. Caught my attention-subject mater is most interesting and this was the first graphic reading I’ve done.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lee Dolin ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY5CTHHTEWBZ6URW5VYTQ3MCSJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NUSFF238JGP5?ASIN=037571457X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent book and informative",
                "reviewText": "I read this for school and bought it for a Persian friend who has never read it. Solid book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole Mohr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7F4M6YIYQBSSNOCXMXSWRQQ7XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IFQRI8LIRMLD?ASIN=037571457X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 19, 2012",
                "reviewTitle": "5.0 out of 5 stars A Necessary Dose of Perspective on the Middle East",
                "reviewText": "I have taught this book to my tenth grade English students for the past five years, and I believe it has helped to send my former students into society as informed adults with enough perspective to see Iranian people as fellow global citizens, not Middle Eastern enemies. Satrapi wrote the book to inform people about the Islamic Revolution and to give readers an insider perspective. I know that the book was originally written in French, and then later translated to English, which are the main languages of the Western world. This points to her intended audience - Westerners. Satrapi was trying to show the Western world what Iranian people are really like -- not extremists, not radical Muslims - but mostly peace-loving, creative, independently thinking people who value their Persian culture and lifestyle and have suffered greatly for remaining in their homeland in spite of the challenges. Throughout the book, she paints herself as religiously moderate and politically involved, even as a child, and not at all negative towards the West. With images of the Iranian hostage crisis in the back of our minds, it is easy for Americans to assume that all Iranians hate Americans, but this is far from true. Satrapi shows her love for Western culture and music and books with Michael Jackson and Kim Wilde and Iron Maiden. She mostly clearly demonstrates the impact of their suffering with how drastically the loss of her Uncle Anoosh impacted her. She also wants people to have the facts about the revolution as well, which we see in the wealth of historical information integrated into her memoir. I personally believe that Satrapi was very effective in helping society see Iranians differently, mostly from my personal experience. Before reading this book six years ago, I assumed that if the theocracy remains in power, that must mean that the majority of people in Iran must be really religious and anti-West, or else why wouldn't they overthrow their government? This book helped me see that they are really suffering under a different kind of tyranny, and also helped me understand why it happened. She shows why they overthrew the Shah - for freedom from an oppressive government, a government in which she knew that the difference between the social classes caused many people pain, but then she also shows throughout the rest of the book how the Iranian people were manipulated into becoming faithful to an Islamic regime. The serious re-structuring of schools caused great suffering and contributed to the difficulty with changing mindsets. If the religious government controls the schools, then the children are inculcated with the religious ideas, much like how Marjane was initially inculcated with the thought that the Shah was chosen by God. In addition, the Islamic regime ultimately secured their power by uniting the Iranian people in war against a foreign enemy and carrying on the war until the society was so completely devastated, they would not have the energy or desire to cause further revolt of any kind. I think this is an important topic for the Western world to see, as Western relations with Iran affect us in many ways. Our government currently has strict economic sanctions on Iran, which causes our gas prices to go up and impacts us where we feel it the most, our wallets; however, most people do not see the reason behind this, and why the world needs to take note of the tyranny in Iran. In addition, many people here in the United States lump together all of the people in the Middle East under the label of \"Arabs\" and then furthermore, see them all as extreme Muslims and terrorists, particularly since 9/11. As a student pointed out in class today, the book was published shortly after 9/11, which is likely not a coincidence. In the days after this event, many Americans viewed any Middle Eastern man with a beard or any Middle Eastern woman with a hijab as a terrorist, a threat; yet Marjane paints us a much needed picture of a world so many Americans do not realize exists - a world in which many free spirited Iranian people endure a forced dress code that represents far more oppression than we here in America could ever imagine.",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hayday",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHW6LPKQNTLBMVFLNZYOVA6XXKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q1YC1USVL418?ASIN=037571457X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved it",
                "reviewText": "Awesome",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charles Rotmil",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCQMQAY5VKGXVLSKBXKE76EB7UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28YBCK9YZZ8Z4?ASIN=037571457X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Authentic",
                "reviewText": "Great illustrationsGet it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheryl M. Mitchell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIHNVGLXIYFHXN6QZKFNDE3Z5YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SNKO5HKJH22U?ASIN=037571457X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars A Book for Times like these.",
                "reviewText": "I was surprised at how much thought and care the author took to explain a young girl's feeling and views. I read it because I wanted to know why it was on the banned books list. It should be available in schools for everyone to read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mommy2boys12",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFJQZCIIFF6UVAF2Y6DHY6EHCEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBU0NGV5Z68U5?ASIN=037571457X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2020",
                "reviewTitle": "5.0 out of 5 stars My Opinion on the book",
                "reviewText": "The Book Persepolis, By Marjie Satrapi, caught my eye right away. Uneducated about the Islamic revolution in 1980, I saw this book and knew I had to read it. Once the book arrived, I was immediately surprised by the book and the fact that it was a graphic novel. However, this really excited me because I had always loved reading graphic novels when I was younger. The book had one of the freshest perspectives on writing that I had read in a while. This has been one of the most interesting Memoirs I have ever read. The Memoir is so powerful because of its ability to telling stories through not just words but also pictures, and how it was able to express certain emotions, in ways ordinary books could not. For example, Satrapi uses the Graphic novel sense of the book to express the emotion that you could not see or empathize with through just reading text. Whether Satrapi decides to express happiness or sadness, Through the novel, she expresses the way she felt personally and also gives you a visual, to help put yourself into her shoes. She also gives the reader new insight into the Islamic Revolution and people who lived in Iran. Many people are quick to judge people, and that comes especially true when talking about people during the Islamic Revolution. She makes the reader understand that the people who had to first-hand witness the Islamic Revolution, are no different than ordinary people, just like the reader and even helps you sympathize with the character. Satrapi does a great job at incorporating western fashion, to help show the reader visually that people from who lived in Iran during the Islamic Revolution are just like any ordinary person. This book blew me away, and I look forward to reading the second part of Satrapi’s Persepolis.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kandy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV6AQDBLSFG3DFKCSG25CW4BYFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HA7XZJ137YT3?ASIN=037571457X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Fun to read and very easy to understand the series of events",
                "reviewText": "My friend chose this for a book club read. I thought, why would I want to read a graphic novel? But to my surprise, it was very good and helpful to understand from an outsiders view the events leading from before the suppression of the people,especially women, to present times. I’m am glad I read it and I can recommend it to anyone.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DGKaye",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 26, 2023",
                "reviewTitle": "An Important Memoir",
                "reviewText": "So many countries have had their share of war – both, internal and external war. Iran has certainly had their share of emporers, kings, and political oppression. In the introduction of this book, Satrapi gives us a brief two-page synopsis of Iran, its beginnings, its wars, and what happened in 1979 when the last Shah of Iran fled the Islamic revolution. And this is where the author begins her story.Satrapi was six when the revolution began. Her coming of age story begins when she was aged ten. She was an intelligent child from an upper-middle class family who wanted to understand why her world as she knew it, was turned upside by revolution. Satrapi shares with us about all the changes that took place in her country during the revolution, and the year it became mandatory to ‘wear the veil’. She hated it. She could no longer go to school with a mix of boys and girls either. Her privileged and modern life as she knew it, was no longer.Marjane was an only child, and a deeply spiritual girl. In her very young life, she thought she wanted to grow up to be a prophet, but as her world was changing, this would no longer be possible. At a very young age, she began reading books on empires and autocratic world leaders. She wanted to understand why the demonstrations in her country were so violent, horrible crimes against humanity. Marjane repeatedly asked her parents if she could join them in the daily protests they attended on the street from morning till night, but they wouldn’t allow her to participate. She was tired of protesting alone in her own backyard. But her father told her they could get shot at a demonstration, and refused to bring her along. But Marjane believed that if a revolution was to succeed, the entire population should support it. The revolution was a fight against social classes.Politics overwhelmed Marja. She was tired of the people in her life ‘disappearing’, and she was tired of same answers from her parents – ‘they went on a trip’. When her Uncle Anoosh reappeared after fleeing political persecution, he told Marja, “In a country where half the population is illiterate, you cannot unite the people around Marx, the only thing that can really unite them is Nationalism or a religious ethic . . . but the religious leaders didn’t know how to govern,” he called it a fake election takeover – many fled Iran while others thought it wouldn’t last. Uncle Anoosh was found and executed. And Marja became angry with God.The bombings began and the fundamentalists took down the U.S. Embassy – no longer viable to get a visa to flee. The universities closed for two years in order to rewrite new religious curriculum. The middle and upper class feared they’d be forced to wear the veil and perhaps ‘no more cars, back to camels’. Marja found her young world crashing as she feared she wouldn’t get to go to university and become a scholar.Marja’s parents protested daily, and her mother was threatened for refusing to wear the veil or acknowledging the new fundamentalist government – she ultimately succumbed. It was declared that ‘to protect women from all potential rapists’, they declared wearing the veil was mandatory. There became two types of women and two types of men – the fundamentalists and the modern man/woman. Apparently, the modern woman no longer had a choice but to wear the veil, but in protest, they allowed some of their hair to stick out. To distinguish the two types of men – fundamentalists didn’t shave and grew long beards, and didn’tuck their shirts in, vs. the clean shaven men (mustaches optional) who tucked in their shirts and wore neck ties – a fashion from ‘the west’, frowned upon. New Islamic religion stated that women’s hair ’emanates rays that excite men’. It sure feels to me that women had to tone down their looks so as not to excite men. So sad. It doesn’t surprise me how many Iranians fled the revolution.Marja tells us that not just the government changed, but many of the people she knew. Marja was told by her parents that if anyone asks, she prays five times a day. Her mother was a staunch fighter for women’s rights.One year after the protests began, Marja’s parents brought her to one, and Marja shares the violence she witnessed that one and only day she went to protest. And when they began beating women with bats because they weren’t wearing the veil, Marja and her parents scurried home.In September 1980, Marja’s parents took her on a three-week vacation to Europe, they came back to another war, with Iraq – that was on top of the already civil war going on in Iran. When the Iraqis began dropping bombs in Tehran, Marja writes, “The Arabs never liked the Persians . . . they attacked us 1400 years ago, they forced their religion on us.” Her father concurred, but added that the real invasion had already come from their own government. Everything was changing daily as war was both internal and external in Iran. Their Iranian National Anthem was replaced by the new government’s hymn. Marja’s father had given up on listening to news in Iran that he knew was lies. He’d tune in nightly to his old radio and listen to the BBC.Once border town oil refineries were bombed, village people fled to the main city of Tehran, food shortages began in supermarkets, and gas was limited.Marja had to get used to new school protocols, like beating her chest to war cries on the loudspeaker, and celebrating Revolution Day. Her parents along with many others rebelled the teachers. There were strict rules about wearing the veil with NO hair showing – to that statement, and some comic relief, Marja’s dad responded to that teacher, “If hair is as stimulating as you say, then you need to shave your mustache.”The young boys were handed out golden keys in school, and told if they went to war and died, the key would get them into heaven and they’d be offered a better life in paradise. As young as fourteen years old, they were lured to war.Soon enough, the family had to keep dark drapes drawn, and had to bomb-proof their house. The enemy was anywhere and everywhere among their own as citizens were swayed to the fundamentalist’s side, devoted to the new regime. There were strict rules: no parties, no card games, no gambling, no alcohol, and of course, the dress code. And one never knew if their neighbor had flipped and become an extremist who would happily rat out anyone disobeying. Marja tells us about one night in particular when her family was out at a newborn baby celebration, with alcohol, and they were stopped on the way home by extremist police spot-check. They smelled the alcohol on her father’s breath and saw he wore a necktie. He was told to get back in the car and they would follow him home to search his house for alcohol, but that one time they were lucky that money still talked and Marja’s dad bought them off. The persecutions got worse in Iran as the wars progressed. Besides wearing the veil in school, no nail polish or jewelry was permitted either. But food was becoming more available from the black markets – if you had the money.Marja shares another scary story with us. She tells about the day she went out wearing her new American Nike shoes and a Michael Jackson badge she wore on her jacket. These were items no longer available in Iran, but her parents had taken a short trip to Turkey and bought some items for her that Iran saw as Western apparel. There was now a new extreme women’s branch called, The Guardians of the Revolution. Marja was stopped on the street by some of those women, they told her ‘decadence is forbidden’. Marja considered that her lucky day when she was let off with a warning instead of being taken to headquarters where ‘people have been known to disappear for days’.At fourteen years old, Marja was wise beyond her years and a self-proclaimed rebel. If she chose to wear jewelry, the teachers would take it off her, never to be returned. And one day, Marja lost her constraint – the day the principal tried to take her bracelet from her, Marja whacked her so hard, she fell. Marja was expelled. Through connections, her parents got her into another school. But that didn’t last long before Marja called out the teacher for her lies. At that point, Marja’s parents arranged to have her sent to school in Austria, where they had relatives. They were petrified that their daughter’s brevity would land her in jail or killed. Her parents told Marja they would follow in a few months. But would they?With breaking hearts, her parents took Marja to the airport so that she could live in freedom and get the education she deserved, and to allow her to be the child she needed to be.I shall look forward to reading the second book, Persepolis 2, where Marjane returns to Iran as a young adult after fleeing the oppression.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nirvana JM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 9, 2023",
                "reviewTitle": "Muy bonito",
                "reviewText": "Lo compré para un regalo, llegó muy rápido. Muy bonito!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlaamello",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 9, 2023",
                "reviewTitle": "Livro caro demais",
                "reviewText": "Achei o livro caro demais para o que eh.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 20, 2020",
                "reviewTitle": "Muy bueno",
                "reviewText": "Perfecto, el libro nuevo, muy bueno.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rami",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 11, 2019",
                "reviewTitle": "Come da inserzione",
                "reviewText": "Come da inserzione",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.99",
                "sellerName": "NourishNook",
                "sellerRating": "4.5"
            }
        ]
    }
}