{
    "remaining_requests": 707,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Last-Castle-American-Royalty-Nations/dp/1476794057",
    "body": {
        "name": "The Last Castle: The Epic Story of Love, Loss, and American Royalty in the Nation's Largest Home",
        "price": "$10.67$10.67",
        "originalPrice": "",
        "rawPrice": 10.67,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Last-Castle-American-Royalty-Nations/dp/1476794057",
        "soldBy": {
            "sellerID": "A1EEG24EPZCNBF",
            "name": "angelscorner",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1EEG24EPZCNBF&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71BMVKNr4yL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Denise Kiernan",
            "link": "https://www.amazon.com/Denise-Kiernan/e/B001ITTRP6/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "angelscorner",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 7165,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 13 hrs 31 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 31 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9"
            },
            {
                "name": "Americas",
                "link": "https://www.amazon.com/Americas-History-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4808"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Atria Books; Reprint edition (May 1, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1476794057"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1476794051"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.02 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 1 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,984 in Books (See Top 100 in Books) #25 in Women in History #66 in U.S. State & Local History #129 in Women's Biographies"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 7,165 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Gigi Jordan Hunter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVDVQUGHSFLECBUZ7G5I4FCQAMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EWL4CEW8T9D3?ASIN=1476794057",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Biltmore and the Vanderbilt Legacy",
                "reviewText": "I have been interested in the Vanderbilt family and others of the Gilded Age. It is difficult to imagine the opulence which now is a part of history. George W. Vanderbilt was an enigma in his generation and society. He built the largest family residence in the United States. Yet he was generous with his money and helped others when needed.I found it interesting that even with all his millions of dollars, George still had money trouble. Financing and maintaining Biltmore House caused George and Edith to sell off part of their properties.This book is well-written and interesting. The author brings a down-to-earth approach to the subjects. She includes people from the area and contemporaries of the Vanderbilts.I have visited Asheville and Biltmore House at different times of the year. It is a beautiful area. Visiting the part of North Carolina is such a treat.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AshevilleChicken",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE562UCXRKH3SNCBB362YI7ERJPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNSR7Q7WUVIII?ASIN=1476794057",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Ashevillian Review",
                "reviewText": "“The Lost Castle,” is generally a sympathetic view of this oligarch. It is my understanding that the actions of Vanderbilt were more predatory then they come across in this book (concerning land acquisition). I pretty quickly started, wondering if George was gay when reading this book. He never really dated. He had lots of intimate, male friends. I googled it and it appears that he probably was gay.And I appreciate that Black people are at least mentioned in this book. Though it gives me the icks when she talks about Edith opening a school for domestic cleaners/maids/servers for the young black population of the Asheville area and nothing is said about the racists views/culture that created it. It doesn’t have to be super heavy. It could be something like, “I’m sure the black population would’ve been interested in going to school for arts and crafts like their white counterparts, but instead they were provided a school for how to clean the rich white people’s homes.” Oh, well, I guess it still sounds pretty bad. Kieran applauds one graduate of the domestic art school by saying she was so good that she got hired at the Biltmore estate. Yuck.But generally speaking, I feel like I learned a lot by reading this book. Kieran gives more Socio-political context of the events of the house. And I feel like I have a better understanding of American history after reading this book. And I certainly learned some things about Asheville’s history.I saw that some people were not that happy with the focus on Edith. And I think that’s one of the nice aspects of the book.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul MartinPaul Martin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLE3Z7ZRHKFMEKGFDBRBWK7B5KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPD1CCLMKJ3JY?ASIN=1476794057",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 3, 2021",
                "reviewTitle": "5.0 out of 5 stars 💕Experience the Biltmore Estates and the lives that preserved this wonderful legacy for you.💕",
                "reviewText": "This is one of the best books I have ever read and is about a favorite place I have visited often; The Biltmore Estates in Asheville North Carolina.I literally could not put this book down! Denise has a wonderful gift as a “wordsmith”.Thank you Denise. ❤️ I am indebted to you for enabling the history of the Biltmore Estates to leap from the pages and completely surround me in a world that I can now vicariously enjoy.Your book is a wonderful extension of that world I have enjoyed ever since I was a young boy, and discovered in a book on the Vanderbilts and the Biltmore Estates. That book was also one of my first purchases for my library which is 1/10 the size of George Vanderbilt’s (in volumes) but proportionately takes up a considerably larger space in my house! 😉I offer my heartfelt personal “Thank You” to all of the Vanderbilts, starting with George and Edith, that left their mark on this world that I live in now, and to the family members that preserved The Biltmore Estates and its legacy!I myself have been working on a book about the Biltmore Estates that is a “factionary” drama that I hope will someday inspire other people, like Denise has done for me with her book. If you have these interests in the Gilded Age and what happened after the Gilded Age, please enjoy this book.Note: I almost never write reviews. I bought the Kindle version of this book, the Audible version, and the paperback version. I use the Kindle version to search for things that I remember in the hardcopy of a book, and also so I can read this book anywhere I go, when my muse inspires me. I additionally purchased the Audible version of it (which is read very well) so I could enjoy having it read to me at night or while traveling.Important Note: When I finished reading the Kindle version, it brought up a screen to get my rating and my review. What I didn’t realize, is that beyond that, in the Kindle version, are wonderful pictures and additional commentary. Don’t miss those! They are the “icing on the cake”!Final thoughts…I remember visiting George Vanderbilt’s library and he had different copies of books in different languages. I wonder, if he had lived today, how George would have leveraged the Internet and expanded his learning? It’s possible, Elon Musk is an example of that spirit of learning and making a difference today that George Vanderbilt exhibited in a previous era.Books should always inspire us … and my hope is that one day, like Denise, my book will inspire readers from a future time. 💕🚀“The Last Castle” by Denise Kieran, and the Vanderbilts, await your vicarious visit.",
                "reviewVotes": "60 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/718t9VUWJyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81SHFqOa3IL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "DC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHMHDU4QXLLFPYUBUJMR22FRFBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UTMX4YQ5Y3BX?ASIN=1476794057",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2023",
                "reviewTitle": "3.0 out of 5 stars A good read—until it’s not.",
                "reviewText": "I enjoyed this book for quite a while, and I would recommend it with one caveat: Once George Vanderbilt dies (Chapter 12) the author seems to either (a) lose interest in her subject or (b) flounder without George around to anchor the story. The text wanders off into all kinds of rabbit holes (mention the Pulitzer Prize? Let’s take a detour to talk about Pulitzer’s life, even though it has no bearing whatsoever on the story. F. Scott Fitzgerald visits Asheville in the mid-1930s? Let’s throw in a few pages about Fitzgerald, even though his visit has—you guessed it—no bearing whatsoever on the story).So if you like stories about “American royalty” you’ll probably enjoy most of this book. At last glance, though, Amazon wanted $49 (!!) for a copy. For that price the reader deserves to love every single page of the book! If you’re a Vanderbilt you might not mind paying that much for a book that flags well before the end. The rest of us might go borrow it from the library. I wish I had!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "inesgaim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 10, 2020",
                "reviewTitle": "Last Castle",
                "reviewText": "Muy interesante excelente lectura durante la pandemia.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ursula Westermann",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 30, 2017",
                "reviewTitle": "beautifully written, reminded me of Downton Abby in its ...",
                "reviewText": "Very well researched, beautifully written, reminded me of Downton Abby in its description of the times, places and People.I highly recommend this Book. I have visited the Biltmore Estate, this Book has inspired me to tour the Estate again.A Book to treasure!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pam B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 1, 2018",
                "reviewTitle": "A really good read",
                "reviewText": "A really good read, well written and only wish I had read this book before visiting Biltmore.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul C. Stocker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 9, 2020",
                "reviewTitle": "mostly a biography of Edith Vanderbilt",
                "reviewText": "Very detailed biography and less of the design and building of Biltmore residence",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.49",
                "sellerName": "musicogswell books & more",
                "sellerRating": "4.5"
            }
        ]
    }
}