{
    "remaining_requests": 432,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Good-Talk-Conversations-Mira-Jacob/dp/0399589066",
    "body": {
        "name": "Good Talk: A Memoir in Conversations",
        "price": "$16.15",
        "originalPrice": "",
        "rawPrice": 16.15,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Good-Talk-Conversations-Mira-Jacob/dp/0399589066",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51XBEKn1eAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61zg-ChYCIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61MqDAGqEjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61exvI1Cm0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61UxW9ag41L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61hUfJ5YCrL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mira Jacob",
            "link": "https://www.amazon.com/Mira-Jacob/e/B00MALAR50/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1092,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “[I] loved it so so much. So poignant, honest, funny, powerful, and timely, and its themes build in a way that by the end is truly artistically transcendent.”—Curtis Sittenfeld, New York Times bestselling author of Prep and Eligible“Among its many virtues, Mira Jacob’s graphic memoir, Good Talk, helps us think through this term [‘person of color’] with grace and disarming wit. The book lives up to its title, and reading these searching, often hilarious tête-à-têtes is as effortless as eavesdropping on a crosstown bus. . . . The medium is part of the magic. . . . The old comic-book alchemy of words and pictures opens up new possibilities of feeling. . . . The people are black and white—except, of course, they’re not.”—Ed Park, The New York Times Book Review“Good Talk addresses head-on the complexities of being fully American while also being fully Jewish, fully Indian, fully mixed, fully whatever in the era of Trump. . . . Good Talk attempts to answer, with humor and heart, some of the most difficult questions of all.”—Bustle“[A] showstopping memoir about race in America . . . by turns funny, philosophical, cautious, and heartbreaking . . . Particularly moving are the chapters in which Jacob explores how even those close to her retain closed-minded and culturally defined prejudices. . . . The memoir works well visually, with striking pen-and-ink drawings . . . collaged onto vibrant found photographs and illustrated backgrounds. . . . Told with immense bravery and candor, this book will make readers hunger for more of Jacob’s wisdom and light.”—Kirkus Reviews (starred review)“Breezy but poignant . . . [Mira Jacob] employs pages of narrative prose sparingly but hauntingly. . . . The ‘talks’ Jacob relates are painful, often hilarious, and sometimes absurd, but her memoir makes a fierce case for continuing to have them.”—Publishers Weekly (starred review)“A beautiful and eye-opening account of what it means to mother a brown boy and what it means to live in this country post–9/11, as a person of color, as a woman, as an artist . . . In Jacob’s brilliant hands, we are gifted with a narrative that is sometimes hysterically funny, always honest, and ultimately healing.”—Jacqueline Woodson, National Book Award–winning author of Another Brooklyn “Good Talk begins with a child’s innocent questions about race and evolves into an honest, direct, and heartbreakingly funny journey. As a brown-skinned woman married to a Jewish man and the mother of a biracial child, I experienced this book on multiple levels: It broke my heart and made me laugh a helluva lot, but, in the end, it also forced me to ponder whether I have successfully provided the answers necessary to arm my own children against racism in America.”—Lynn Nottage, Pulitzer Prize–winning playwright of Sweat About the Author Mira Jacob is the author of the critically acclaimed novel The Sleepwalker’s Guide to Dancing. Her recent work has appeared in The New York Times Book Review, Vogue, Glamour, Tin House, Electric Literature and Literary Hub. She lives in Brooklyn."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 29 - March 5 on orders shipped by Amazon over $35",
            "Or fastest delivery February 28 - March 1"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NATIONAL BESTSELLER • A “beautiful and eye-opening” (Jacqueline Woodson), “hilarious and heart-rending” (Celeste Ng) graphic memoir about American identity, interracial families, and the realities that divide us, from the acclaimed author of The Sleepwalker’s Guide to Dancing.ONE OF THE TEN BEST BOOKS OF THE YEAR: Chicago Tribune, The New York Public Library, Publishers Weekly • ONE OF THE BEST BOOKS OF THE YEAR: The New York Times Book Review, Time, BuzzFeed, Esquire, Literary Journal, Kirkus Reviews“How brown is too brown?”“Can Indians be racist?”“What does real love between really different people look like?”Like many six-year-olds, Mira Jacob’s half-Jewish, half-Indian son, Z, has questions about everything. At first they are innocuous enough, but as tensions from the 2016 election spread from the media into his own family, they become much, much more complicated. Trying to answer him honestly, Mira has to think back to where she’s gotten her own answers: her most formative conversations about race, color, sexuality, and, of course, love. Written with humor and vulnerability, this deeply relatable graphic memoir is a love letter to the art of conversation—and to the hope that hovers in our most difficult questions.LONGLISTED FOR THE PEN/OPEN BOOK AWARD “Jacob’s earnest recollections are often heartbreaking, but also infused with levity and humor. What stands out most is the fierce compassion with which she parses the complexities of family and love.”—Time“Good Talk uses a masterful mix of pictures and words to speak on life’s most uncomfortable conversations.”—io9“Mira Jacob just made me toss everything I thought was possible in a book-as-art-object into the garbage. Her new book changes everything.”—Kiese Laymon, New York Times bestselling author of Heavy Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2"
            },
            {
                "name": "Community & Culture",
                "link": "https://www.amazon.com/Ethnic-National-Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2365"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ One World (March 24, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 368 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0399589066"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0399589065"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.35 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.08 x 0.98 x 7.97 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#40,202 in Books (See Top 100 in Books) #31 in Biographies & History Graphic Novels #165 in Motherhood (Books) #1,451 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,092 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f251b640-9727-4518-9a7a-6c894951a9cb.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2f076f8a-e648-4b75-9a0f-f07eb55da697.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/867e25b3-8f7a-4bec-b331-8cd9339bd46e.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "GentleCoast",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUYNZB6DOF7JRU65MSUBF6XO5PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FENPTB44IYJ9?ASIN=0399589066",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars A superb exploration of race, culture, sexuality, and politics in America",
                "reviewText": "Mira Jacob has created a flat-screen multi-media masterpiece of a memoir, detailing her life via family, upbringing, education, geography, relationships, marriage, child rearing, work life, and career. Her interactions with events like 9/11, Obama’s election, and Trump’s election sizzle through the hearts and minds of her panoply of real-life characters in family and friends.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tammy Moldovan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6W5DEDNVFK6W44I3W763B7PA4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXDQW943ZJU89?ASIN=0399589066",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 26, 2023",
                "reviewTitle": "5.0 out of 5 stars A must read",
                "reviewText": "This graphic novel does a masterful job of being hilarious and heart breaking at the same time. It is a glimpse into the experiences of a woman of color and how those experiences felt in her body and her mind and how they shape how she experiences her life. As a white woman, this book gave me another glimpse into a world that is easy for me to not see, to not understand, to not connect to, and to not change. But in order to let go of all the interlocking systems of oppression that are the backbone of white American culture, we all have to continue to learn, unlearn, and embrace the discomfort. It starts with me and with books like this so that we can become the diverse country we pretend we are.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "elysejody",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2ZJT6CUNHCHQDOC4F575DMG2CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DE4FQU8OMSEY?ASIN=0399589066",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 5, 2019",
                "reviewTitle": "5.0 out of 5 stars Favorite favorite favorite",
                "reviewText": "Audiobook....narrated by Mira Jacob, and a wonderful full castABSOLUTELY FANTASTIC..... A MUST LISTEN TO!!!!!!!ITS HILARIOUS......but... WE FEEL THE PAIN!!!!!!I laughed, I cried, I was in ‘aw’ with Mira’s son, Z. I fell deep in love with Mira - her family - and Mira’s ruthless passion.WE REALLY GET the pain & hurt she has lived with her ENTIRE LIFE... WE GET THE MESSAGE....SOO deeply - I still have tears in my eyes as I type.I was incredibly impressed with the styling- crafting - of BOTH THE BOOK ( written words Mira wrote), and the brilliant creativeness in the audiobook. There were added sounds that were outstanding and powerful. Why has nobody else thought of this yet? Mira may have started a trend in adding more creativity audiobooks.This book is so gut wrenching RAW- and REAL. I listen from start to finish without stopping. It’s only 2 hours long............soooo wonderful -You finish wanting everyone to get their hands on this!!!I read Mira Jacob’s first book, “The Sleepwalker’s Guide To Dancing”, years ago. I later met her at a book festival in Austin. We had a great conversation. I liked Mira’s first book - remember much of it well.....But in this book, she out does herself. REALLY A POWERFUL PUNCH!!!****GOOD TALK****, like the title says! is ****GREAT TALK****!!!!It’s been a long time since I was THIS jazzed about THE AUDIOBOOK ‘itself’.Two other audiobooks gave me the chills - Goosebumps- as in SO FRICKEN FRESH - in delivery and dialogue. “You Don’t Have To Say You Love Me”, by Sherman Alexie moved me BIG TIME.....AND NOW......“GOOD TALK”..... moved me BIG TIME! It will move you!!!!!!HIGHLY RECOMMENDEDelysejody",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Weekend Reader (Lynell)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERVRUGF5W35FZNNBOUKG75WKV3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17FXKITXQOZYX?ASIN=0399589066",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2021",
                "reviewTitle": "4.0 out of 5 stars Difficult Conversations",
                "reviewText": "This book is an interesting in that it is a illustrative graphic novel of bits conversations. I really appreciated the author's attempt to explain racism to her son and how complicated it can be even as an adult to make sense of it. I really appreciated her she confronted being in an interracial relationship with a white man whose parents are Trump supporters. There's definitely a range of rage, sadness, hopelessness, and the cycle begins again. This book is definitely a conversation starter because it covers a range of topics anti-blackness, colorism, racism, sexism, microagressions, white privilege to name a few.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Healthy girl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE625OYTRXM26MUEIJZUMDIB6DOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35YN1HSNNF9Y?ASIN=0399589066",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Book",
                "reviewText": "I really enjoyed this book. Jacob's vulnerability and honesty was really moving and I love that she did it as a graphic novel. I loved this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Camila RussellCamila Russell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7O4IIUXBOQ6L7PSTRMIYDO7BIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RHWYJ5WS5UYA?ASIN=0399589066",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2021",
                "reviewTitle": "5.0 out of 5 stars A 5 star.",
                "reviewText": "Good Talk is a memoir in conversations Mira Jacob has had with different people, such as her parents, her husband, her son, family members, ex-boyfriends, friends and random people she encountered throughout her life, and how those conversations have shaped her and her identity, especially related to race and being an U.S. American.The author is a daughter of Indian parents, as in the country of India, who immigrated to the United States. Born and raised in the U.S. she then married a white Jewish man with whom she had a mix-raced son. The book focuses on the dichotomy of those two cultures and on the election of Donald Trump, in 2016, and how that affected her view, while also focusing on the big questions her son was asking about politics and about being a brown kid in North America.With these conversations she discusses about so many themes with such a subtlety and grace, giving the reader these complex issues to talk about. There is also humour between the serious discussions. The book captures the voices of generations of different people living in these uncertain times. I love this book immensely and will highly recommend it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/A1cWrsLpCcL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5KTNO3XH5QAT3CCK7MXAH5SB3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZGKW4BR0HWL3?ASIN=0399589066",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2021",
                "reviewTitle": "5.0 out of 5 stars Punchy, poignant, powerful",
                "reviewText": "Mira Jacob has done most of the work for you in this book. Her use of the graphic novel format expertly crams massive ideas into vignettes of just a few pages, sometimes even less, without sacrificing their complexity or weight. The framework of family interactions provides a relatable, emotional context for the discussion of racism and colorism in the US, and I was particularly moved by the interactions with her son that form the major outline of the story. His observations and questions provide as much humor as heartbreak, but provoke important discussions we should all be engaged in. Overall a very fun and contemplative read, and her unapologetic bisexual representation was fantastic to see as well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Ball",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED4USOR6RX3UQ7GBOJ2P365IXKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRE0FTTLZGZMU?ASIN=0399589066",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Loved this book - all of it",
                "reviewText": "My first graphic novel (memoir) - loved the medium and the story … the way the medium allowed the story to flow … loved it …",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jane Smith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 1, 2020",
                "reviewTitle": "An important read",
                "reviewText": "As an ally it is important to educate myself on anti-racism and Black Life Matters. This was one of the books I chose to do that. I loved it. It is both heartbreaking and uplifting, and very cleverly done. It certainly made me think about the unfairness people face and made me want to do a better job of making life more equitable for others.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robyn Scharaga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 31, 2021",
                "reviewTitle": "read the whole book in one evening because I couldn't put it down....",
                "reviewText": "Great book, love the idea and esp the artwork (as an old comic nerd). Really thought-provoking and written like talking to a good friend...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 26, 2020",
                "reviewTitle": "One of the best books released this year!",
                "reviewText": "I enjoyed reading this memoir! This was my first time reading a graphic novel, so I was a little apprehensive whether I would enjoy this medium. The author really has done a great job with this memoir! It's a honest and seemingly effortless presentation of life as lived by the author - the joys, the blunders, discomforts, uneasiness and the contradictions that the author has lived through as an American of Indian origin married to a Jew and raising this precious kid!If you are raising or are going to raise inter-racial children, like me, this might be especially interesting to you. Thank you for writing this Mira! I am an Indian married to an American Jew too and I often wonder about raising our kids there. Sometimes it feels daunting to even think about it - I know their lives growing up in the US will be too unfamiliar and hard for me to understand/connect with. I worry that I might not have the answers for them or be able to be the 'parent' or adult because I didn't grow up there and don't have the cultural capital to help them navigate their lives. But I guess parenting is about learning, growing and figuring stuff out with your child, like you have been doing. That there's a lot of it to be done whether or not you grow up in the same country as them. Besides, there's my husband!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SAB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 8, 2020",
                "reviewTitle": "Everyone's Story Needs 2 B Told",
                "reviewText": "This well put and eloquent graphic novel very much functions as a prototype of numerous biographies of Americans who are likely to not be perceived as members of the mainstream culture because based on not meeting the expectation of the rather white majority population, they are overwhelmingly treated as if they do not belong and never will unless they are as white as they are. Thanks for sharing this uniquely created book. I enjoyed reading it so much that I forgot everything around me. I had a great time with it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Betty Jia Yi Xie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 12, 2020",
                "reviewTitle": "An important graphic novel worth savouring",
                "reviewText": "I got this book last fall and couldn’t put it down. It is a book that addresses so many POC and mix raced family’s everyday reality, and in a way that does not sacrifice complexity for over simplicity. I had to put it down midway because I was scared that I would finish the book too fast, and there would not be another book like this on the market for me to love.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}