{
    "remaining_requests": 479,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/A-Gentleman-in-Moscow/dp/0143110438",
    "body": {
        "name": "A Gentleman in Moscow: A Novel",
        "price": "$9.41$9.41",
        "originalPrice": "",
        "rawPrice": 9.41,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/A-Gentleman-in-Moscow/dp/0143110438",
        "soldBy": {
            "sellerID": "A8146B9Q816MQ",
            "name": "Martistore",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A8146B9Q816MQ&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/511eqcO0xHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31J2WdGDNYL.jpg",
            "https://m.media-amazon.com/images/I/51-lGX1g1tL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Amor Towles",
            "link": "https://www.amazon.com/Amor-Towles/e/B004MW8MG6/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Martistore",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 129850,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"The novel buzzes with the energy of numerous adventures, love affairs, [and] twists of fate.\" —The Wall Street Journal\"If you're looking for a summer novel, this is it. Beautifully written, a story of a Russian aristocrat trapped in Moscow during the tumult of the 1930s. It brims with intelligence, erudition, and insight, an old-fashioned novel in the best sense of the term.\" —Fareed Zakaria, \"Global Public Square,\" CNN\"Fun, clever, and surprisingly upbeat . . . A Gentleman in Moscow is an amazing story because it manages to be a little bit of everything. There’s fantastical romance, politics, espionage, parenthood and poetry. The book is technically historical fiction, but you would be just as accurate calling it a thriller or a love story.” —Bill Gates“The book is like a salve. I think the world feels disordered right now. The count’s refinement and genteel nature are exactly what we’re longing for.” —Ann Patchett“How delightful that in an era as crude as ours this finely composed novel stretches out with old-World elegance.” —The Washington Post“[A] wonderful book at any time . . . [I]t brought home to me how people find ways to be happy, make connections, and make a difference to one another’s lives, even in the strangest, saddest and most restrictive circumstances.” —Tana French, author of The Searcher “Marvelous.” —Chicago Tribune “The novel buzzes with the energy of numerous adventures, love affairs, twists of fate and silly antics.” —The Wall Street Journal “A winning, stylish novel.” —NPR.org “Enjoyable, elegant.” —Seattle Times“The perfect book to curl up with while the world goes by outside your window.” —Refinery29“Who will save Rostov from the intrusions of state if not the seamstresses, chefs, bartenders and doormen? In the end, Towles’s greatest narrative effect is not the moments of wonder and synchronicity but the generous transformation of these peripheral workers, over the course of decades, into confidants, equals and, finally, friends. With them around, a life sentence in these gilded halls might make Rostov the luckiest man in Russia.” —The New York Times Book Review“This is an old fashioned sort of romance, filled with delicious detail. Save this precious book for times you really, really want to escape reality.” —Louise Erdrich“Towles gets good mileage from the considerable charm of his protagonist and the peculiar world he inhabits.” —The New Yorker“Irresistible . . . In his second elegant period piece, Towles continues to explore the question of how a person can lead an authentic life in a time when mere survival is a feat in itself . . . Towles’s tale, as lavishly filigreed as a Fabergé egg, gleams with nostalgia for the golden age of Tolstoy and Turgenev.” —O, The Oprah Magazine “‘The Grand Budapest Hotel’ and ‘Eloise’ meets all the Bond villains.”—TheSkimm“And the intrigue! . . . [A Gentleman in Moscow] is laced with sparkling threads (they will tie up) and tokens (they will matter): special keys, secret compartments, gold coins, vials of coveted liquid, old-fashioned pistols, duels and scars, hidden assignations (discreet and smoky), stolen passports, a ruby necklace, mysterious letters on elegant hotel stationery . . . a luscious stage set, backdrop for a downright Casablanca-like drama.”—The San Francisco Chronicle“The same gorgeous, layered richness that marked Towles’ debut, Rules of Civility, shapes [A Gentleman in Moscow].”—Entertainment Weekly Praise for Rules of Civility “An irresistible and astonishingly assured debut.\" —O, the Oprah Magazine “With this snappy period piece, Towles resurrects the cinematic black-and-white Manhattan of the golden age…[his] characters are youthful Americans in tricky times, trying to create authentic lives.” —The New York Times Book Review “Sharp [and] sure-handed.” —Wall Street Journal “Put on some Billie Holiday, pour a dry martini and immerse yourself in the eventful life of Katey Kontent.\" —People “[A] wonderful debut novel.” —The Chicago Tribune “Glittering…filled with snappy dialogue, sharp observations and an array of terrifically drawn characters…Towles writes with grace and verve about the mores and manners of a society on the cusp of radical change.” —NPR.org “A book that enchants on first reading and only improves on the second.” —The Philadelphia Inquirer About the Author Amor Towles is the author of the New York Times bestsellers Rules of Civility, A Gentleman in Moscow, and The Lincoln Highway. The three novels have collectively sold millions of copies and have been translated into more than thirty-five languages. Towles lives in Manhattan with his wife and two children. Excerpt. © Reprinted by permission. All rights reserved. From A Gentleman in Moscow:There were two restaurants in the Hotel Metropol: the Boyarsky, that fabled retreat on the second floor that we have already visited, and the grand dining room off the lobby known officially as the Metropol, but referred to affectionately by the Count as the Piazza.Admittedly, the Piazza could not challenge the elegance of the Boyarsky’s décor, the sophistication of its service, or the subtlety of its cuisine. But the Piazza did not aspire to elegance, service, or subtlety. With eighty tables scattered around a marble fountain and a menu offering everything from cabbage piroghi to cutlets of veal, the Piazza was meant to be an extension of the city—of its gardens, markets, and thorough fares. It was a place where Russians cut from every cloth could come to linger over coffee, happen upon friends, stumble into arguments, or drift into dalliances—and where the lone diner seated under the great glass ceiling could indulge himself in admiration, indignation, suspicion, and laughter without getting up from his chair.And the waiters? Like those of a Parisian café, the Piazza’s waiters could best be complimented as “efficient.” Accustomed to navigating crowds,they could easily seat your party of eight at a table for four. Having noted your preferences over the sound of the orchestra, within minutes they would return with the various drinks balanced on a tray and dispense them round the table in rapid succession without misplacing a glass. If, with your menu in hand, you hesitated for even a second to place your order, they would lean over your shoulder and poke at a specialty of the house. And when the last morsel of dessert had been savored, they would whisk away your plate, present your check, and make your change in under a minute. In other words, the waiters of the Piazza knew their trade to the crumb, the spoon, and the kopek.At least, that was how things were before the war. . . .Today, the dining room was nearly empty and the Count was being served by someone who appeared not only new to the Piazza, but new to the art of waiting. Tall and thin, with a narrow head and superior demeanor, he looked rather like a bishop that had been plucked from a chessboard. When the Count took his seat with a newspaper in hand—the international symbol of dining alone—the chap didn’t bother to clear the second setting; when the Count closed his menu and placed it beside his plate—the international symbol of readiness to order—the chap needed to be beckoned witha wave of the hand; and when the Count ordered the okroshka and filet of sole, the chap asked if he might like a glass of Sauterne. A perfect suggestion, no doubt, if only the Count had ordered foie gras!“Perhaps a bottle of the Châteaude Baudelaire,” the Count corrected politely.“Of course,” the Bishop replied with an ecclesiastical smile.Granted, a bottle of Baudelaire was something of an extravagance for a solitary lunch, but after spending another morning with the indefatigable Michel de Montaigne, the Count felt that his morale could use the boost. For several days, in fact, he had been fending off a state of restlessness. On his regular descent to the lobby, he caught himself counting the steps. As he browsed the headlines in his favorite chair, he found he was lifting his hands to twirl the tips of moustaches that were no longer there. He found he was walking through the door of the Piazza at 12:01 for lunch. And at 1:35, when he climbed the 110 steps to his room, he was already calculating the minutes until he could come back downstairs for a drink. If he continued along this course, it would not take long for the ceiling to edge downward, the walls to edge inward, and the floor to edge upward, until the entire hotel had been collapsed into the size of a biscuit tin.As the Count waited for his wine, he gazed around the restaurant, but his fellow diners offered no relief. Across the way was a table occupied by two stragglers from the diplomatic corps who picked at their food while they awaited an era of diplomacy. Over there in the corner was a spectacled denizen of the second floor with four enormous documents spread across his table, comparing them word for word. No one appeared particularly gay; and no one paid the Count any mind. That is, except for the young girl with the penchant for yellow who appeared to be spying on him from her table behind the fountain. According to Vasily, this nine-year-old with straight blond hair was the daughter of a widowed Ukrainian bureaucrat. As usual, she was sitting with her governess. When she realized the Count was looking her way, she disappeared behind her menu.“Your soup,” said the Bishop.“Ah. Thank you, my good man. It looks delicious. But don’t forget the wine!”“Of course.”Turning his attention to his okroshka, the Count could tell at a glance that it was a commendable execution—a bowl of soup that any Russian inthe room might have been served by his grandmother. Closing his eyes in order to give the first spoonful its due consideration, the Count noted asuitably chilled temperature, a tad too much salt, a tad too little kvass, but a perfect expression of dill—that harbinger of summer which brings to mind the songs of crickets and the setting of one’s soul at ease. But when the Count opened his eyes, he nearly dropped his spoon. For standing at the edge of his table was the young girl with the penchant for yellow—studying him with that unapologetic interest peculiarto children and dogs. Adding to the shock of her sudden appearance was the fact that her dress today was in the shade of a lemon.“Where did they go?” she asked, without a word of introduction.“I beg your pardon. Where did who go?”She tilted her head to take a closer look at his face.“Why, your moustaches.”The Count had not much cause to interact with children, but he had been raised well enough to know that a child should not idly approach a stranger, should not interrupt him in the middle of a meal, and certainly should not ask him questions about his personal appearance. Was the minding of one’s own business no longer a subject taught in schools?“Like swallows,” the Count answered, “they traveled elsewhere for the summer.\"Then he fluttered a hand from the table into the air in order to both mimic the flight of the swallows and suggest how a child might follow suit.She nodded to express her satisfaction with his response.“I too will be traveling elsewhere for part of the summer.”The Count inclined his head to indicate his congratulations.“To the Black Sea,” she added.Then she pulled back the empty chair and sat.“Would you like to join me?” he asked.By way of response, she wiggled back and forth to make herself comfortable then rested her elbows on the table. Around her neck hung a small pendant on a golden chain, some lucky charm or locket. The Count looked toward the young lady’s governess with the hopes of catching her attention, but she had obviously learned from experience to keep her nose in her book.The girl gave another canine tilt to her head.“Is it true that you are a count?”“’Tis true.”Her eyes widened.“Have you ever known a princess?”“I have known many princesses.”Her eyes widened further, then narrowed.“Was it terribly hard to be a princess?”“Terribly.”At that moment, despite the fact that half of the okroshka remained in its bowl, the Bishop appeared with the Count’s filet of sole and swapped one for the other.“Thank you,” said the Count, his spoon still in hand.“Of course.”The Count opened his mouth to inquire as to the whereabouts of the Baudelaire, but the Bishop had already vanished. When the Count turned back to his guest, she was staring at his fish.“What is that?” she wanted to know.“This? It is filet of sole.”“Is it good?”“Didn’t you have a lunch of your own?”“I didn’t like it.”The Count transferred a taste of his fish to a side plate and passed it across the table. “With my compliments.”She forked the whole thing in her mouth.“It’s yummy,” she said, which if not the most elegant expression was at least factually correct. Then she smiled a little sadly and let out a sigh as she directed her bright blue gaze upon the rest of his lunch.“Hmm,” said the Count.Retrieving the side plate, he transferred half his sole along with an equal share of spinach and baby carrots, and returned it. She wiggled back and forth once more, presumably to settle in for the duration. Then, having carefully pushed the vegetables to the edge of the plate, she cut her fish into four equal portions, put the right upper quadrant in her mouth, and resumed her line of inquiry.“How would a princess spend her day?”“Like any young lady,” answered the Count.With a nod of the head, the girl encouraged him to continue.“In the morning, she would have lessons in French, history, music. After her lessons, she might visit with friends or walk in the park. And at lunch she would eat her vegetables.”“My father says that princesses personify the decadence of a vanquished era.”The Count was taken aback.“Perhaps a few,” he conceded. “But not all, I assure you.”She waved her fork.“Don’t worry. Papa is wonderful and he knows everything there is to know about the workings of tractors. But he knows absolutely nothing about the workings of princesses.”The Count offered an expression of relief.“Have you ever been to a ball?” she continued after a moment of thought.“Certainly.”“Did you dance?”“I have been known to scuff the parquet.” The Count said this with the renowned glint in his eye—that little spark that had defused heated conversations and caught the eyes of beauties in every salon in St. Petersburg.“Scuff the parquet?”“Ahem,” said the Count. “Yes, I have danced at balls.”“And have you lived in a castle?”“Castles are not as common in our country as they are in fairy tales,” the Count explained. “But I have dined in a castle. . . .”Accepting this response as sufficient, if not ideal, the girl now furrowed her brow. She put another quadrant of fish in her mouth and chewed thoughtfully. Then she suddenly leaned forward.“Have you ever been in a duel?”“An affaire d’honneur?” The Count hesitated. “I suppose I have been in a duel of sorts. . . .”“With pistols at thirty-two paces?”“In my case, it was more of a duel in the figurative sense.”When the Count’s guest expressed her disappointment at this unfortunate clarification, he found himself offering a consolation:“My godfather was a second on more than one occasion.”“A second?”“When a gentleman has been offended and demands satisfaction on the field of honor, he and his counterpart each appoint seconds—in essence, their lieutenants. It is the seconds who settle upon the rules of engagement.”“What sort of rules of engagement?”“The time and place of the duel. What weapons will be used. If it is to be pistols, then how many paces will be taken and whether there will be more than one exchange of shots.”“Your godfather, you say. Where did he live?”“Here in Moscow.”“Were his duels in Moscow?”“One of them was. In fact, it sprang from a dispute that occurred in this hotel—between an admiral and a prince. They had been at odds for quite some time, I gather, but things came to a head one night when their paths collided in the lobby, and the gauntlet was thrown down on that very spot.”“Which very spot?”“By the concierge’s desk.”“Right where I sit!”“Yes, I suppose so.”“Were they in love with the same woman?”“I don’t think a woman was involved.”The girl looked at the Count with an expression of incredulity.“A woman is always involved,” she said.“Yes. Well. Whatever the cause, an offense was taken followed by a demand for an apology, a refusal to provide one, and a slap of the glove. At the time, the hotel was managed by a German fellow named Keffler, who was reputedly a baron in his own right. And it was generally known that he kept a pair of pistols hidden behind a panel in his office, so that when an incident occurred, seconds could confer in privacy, carriages could be summoned, and the feuding parties could be whisked away with weapons in hand.”“In the hours before dawn . . .”“In the hours before dawn.”“To some remote spot . . .”“To some remote spot.”She leaned forward.“Lensky was killed by Onegin in a duel.”She said this in a hushed voice, as if quoting the events of Pushkin’s poem required discretion.“Yes,” whispered back the Count. “And so was Pushkin.”She nodded in grave agreement.“In St. Petersburg,” she said. “On the banks of the Black Rivulet.”“On the banks of the Black Rivulet.”The young lady’s fish was now gone. Placing her napkin on her plate and nodding her head once to suggest how perfectly acceptable the Count had proven as a luncheon companion, she rose from her chair. But before turning to go, she paused.“I prefer you without your moustaches,” she said. “Their absence improves your . . . countenance.”Then she performed an off-kilter curtsey and disappeared behind the fountain. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 5 mins",
            "FREE delivery Tuesday, February 27 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The mega-bestseller with more than 2 million readers—soon to be a Showtime/Paramount+ series starring Ewan McGregor as Count Alexander RostovFrom the #1 New York Times-bestselling author of The Lincoln Highway and Rules of Civility, a beautifully transporting novel about a man who is ordered to spend the rest of his life inside a luxury hotel In 1922, Count Alexander Rostov is deemed an unrepentant aristocrat by a Bolshevik tribunal, and is sentenced to house arrest in the Metropol, a grand hotel across the street from the Kremlin. Rostov, an indomitable man of erudition and wit, has never worked a day in his life, and must now live in an attic room while some of the most tumultuous decades in Russian history are unfolding outside the hotel’s doors. Unexpectedly, his reduced circumstances provide him entry into a much larger world of emotional discovery. Brimming with humor, a glittering cast of characters, and one beautifully rendered scene after another, this singular novel casts a spell as it relates the count’s endeavor to gain a deeper understanding of what it means to be a man of purpose.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Books (March 26, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 496 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0143110438"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0143110439"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 1.3 x 5.4 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#934 in Books (See Top 100 in Books) #2 in Political Fiction (Books) #13 in Historical Thrillers (Books) #163 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 129,850 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/69c77c17-6cf5-4c23-b499-2b6916bd5617.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/693dd67a-4a2a-4e5b-8eaf-4d6ac1182534.__CR0,0,800,800_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/268a6bc1-dd17-4ba2-aea0-43da7a9a13e1.__CR0,0,800,800_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/53616779-ea57-4c9c-b5fd-7819f3c7f232.__CR0,0,800,800_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a994f043-ed9f-459a-a9c5-b41e310270cc.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ba19777-6498-403a-9b12-39efc4eb0ec3.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Zeester",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2XH2WMVQI3HKQEPPBYOFCKM6UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25M6C75KFGPJW?ASIN=0143110438",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 21, 2018",
                "reviewTitle": "5.0 out of 5 stars perfect antagonist. Stripped wine labels",
                "reviewText": "Summary in at tweet. “Gentleman” is eloquent, witty, thought provoking, poetic, and meaningful. It is a welcome relief from and an antidote to a world drowning in tweets, click journalism, hypocrisy, and selfies. Novelists shouldn’t he held more accountable to historic accuracy than the President. Slithering Bishop, perfect antagonist. Stripped wine labels, a metaphor for the revolution. Count won’t countenance escape to America. Count’s rules of civility internally forged. Tinker Grey’s Rules of Civility externally imposed. Both are on the run.Character development and plot. The plot was as subtle as his word craft. Gentlemanly. All the characters were wonderfully developed, but the one who stands out is the Bishop, the Count’s foil. Since protagonists are measured in contrast to their antagonists, the Bishop serves an essential role. Slithering on the bias rather than moving by rank and file, the Bishop embodies the qualities of the “anti-gentleman”. His decision to reorganize the Metropol’s wine cellar is one of the more memorable scenes in the book. As a tip of the hat to egalitarianism (but more likely in the spirit of retribution), the Bishop orders that all wine labels be removed from the one hundred thousand bottles in the Metropol’s inventory. This is possibly the most symbolic of the Bishop’s acts in that in one afternoon it eradicated the individuality of each bottle, by distilling untold permutations of climate, grape and vintner into but two categories “white” or “red”. If one wanted to toy with symbolism, individuality was sacrificed to provide a simple choice, Royalist (white), versus Bolshevik (red).“Whichever wine was within, it was decidedly not identical to its neighbors. On the contrary, the contents of the bottle in his hand was the product of a history as unique and complex as that of a nation, or a man. In its color, aroma, and taste, it would certainly express the idiosyncratic geology and prevailing climate of its home terrain. But in addition, it would express all the natural phenomena of its vintage. In a sip, it would evoke the timing of that winter's thaw, the extent of that summer's rain, the prevailing winds, and the frequency of clouds. Yes, a bottle of wine was the ultimate distillation of time and place; a poetic expression of individuality itself.”Historical accuracy? Who cares? Douglas Smith’s the Former People (2012) provides an accurate and acclaimed historical account of the nobility’s plight. The Count should have been terrified given that his fate was determined by class. The Red Terror’s form of “justice” was quite simple,”Do not look in the file of incriminating evidence to see whether or not the accused rose up against the Soviets with arms or words. Ask him instead to which class he belongs, what is his background, his education, his profession. These are the the questions that will determine the fate of the accused. “ (Martin Latsis in Douglas Smith, the Forgotten People). So it is odd that the Count escapes with his life while in full view of the Metropol’s patrons, some of whom are party officials. So, how does the Count survive? Towles employs a gimmick, i.e., the emergency committee is moved by a revolutionary poem attributed to the Count. I have read the poem a number of times and fail to see its power, especially when you contrast it with competing revolutionary verses. Had he written the following Song of the Peasant, he might have stood a chance of escaping the gallows.…We’ve suffered insults long enough, and submitted too long to the nobles! … Altogether now let’s plunder …And from the bitter aspens shall we hang every last lackey of the VampireTsar. (1917)Now, that is a rallying cry!Because of this, it was difficult for some readers to suspend belief. In my view (which is also Towles’ view) such insistence on historical accuracy misses the point. Gentleman is not an historical novel. It is a novel loosely set in a period, but its emphasis is firmly set on inner life of the Count and the relationships he fosters over the course of thirty years of internal exile. The criticism that “Gentleman” is somehow flawed because of a few historical short cuts is particularly irritating to Towles. In an interview he quipped, “why should a novelist he held to a higher standard of truth than the President of the United States.” You could take his point one step further and ask why modern literature should be held to a higher standard than Shakespeare’s Henry V in which certain facts (e.g., the King of France was insane) are suppressed and others emphasized. In so doing, Shakespeare crafted the tale he wished, one that is purely English and extolling the virtue of English courage.In Towles case, adding graphic detail about the “Red Terror” would have produced a completely different book. It would have detracted from his intent which was to engage his characters, toy with phraseology, and philosophize about the human condition. Characters are his focus, not external events.Where do these elegant lines come from? Towles revealed in an interview that the phrases and musings materialize on the page as if the characters were authoring them and he is simply a witness to his art. He says as much in voicing the Count’s response to a question posed by emergency committee at the beginning of the book. “Vyshinsky: Why did you write the poem? Rostov: It demanded to be written. I simply happened to be sitting at the particular desk on the particular morning when it chose to make its demands.”Allegory for our time? Towles claims this book is not a parable, but that leaves open the possibility that it might be an allegory. Like the hotel, the book has secret passages, or at least passages that invite interpretation. What strikes me most about Gentleman is how much his writing struck a chord. Most everyone who has read the book is in agreement that his style is mesmerizing. It is lyrical and poetic. But, I have a feeling that people are drawn to the book for deeper reasons, one being that it serves as an antidote to an unending drone of tweets, click journalism, hypocrisy and lies.Towles plays with sentences, even a sentence about sentences. In some cases he plays for the sake of it. For example,“Here, indeed, was a formidable sentence--one that was on intimate terms with a comma, and that held the period in healthy disregard.”He could have written “That was a long sentence.” Glad he didn’t.Another,“But, alas, sleep did not come so easily to our weary friend. Like in a reel in which the dancers form two rows, so that one of their number can come skipping brightly down the aisle, a concern of the Count’s would present itself for his consideration, bow with a flourish, and then take its place at the end of the line so that the next concern could come dancing to the fore.”He could have written, “He fell asleep counting troubles instead of sheep.” Glad he didn’t.Then there are passages that have no straight forward translation, but leave you to ponder, and then ponder some more.\"...a gentleman should turn to a mirror with a sense of distrust. For rather than being tools of self-discovery, mirrors tended to be tools of self-deceit.\"“That sense of loss is exactly what we must anticipate, prepare for, and cherish to the last of our days; for it is only our heartbreak that finally refutes all that is ephemeral in love.”Perhaps Towles most important achievement is reminding us that we are not immune to change, either as individuals or as a nation. In fact, change is a theme that recurs throughout the book. It is either glacial (on the personal level), circular (cannons melted for church bells and bells for cannons), or dramatic (in the case of the revolution). It was the Count’s view that change was both inevitable and disquieting, and for Russia’s nobility terrifying. His deep sense of purpose that took root during his exile in the Metropol was born of humility. Once stripped of his possessions and his link to the past severed, he was forced to confront his fate with a freshness of purpose. That was the preparation he needed in order to invite Sophia into his life and chart a new direction, one propelled by childlike innocence.On a grander scale, one might argue that dramatic change was long overdue in Russia. The feudal system had produced a backward economy populated by the illiterate and poor. “Red Terror” was the result, and its henchman ruthlessly purged institutions that were even tangentially connected to Tsarist Russia. That meant the nobility, works of art, religion, historic buildings, writers, painters, and poets all were destroyed or exiled in the pursuit of a more egalitarian state.I believe that this wanton destruction of institutions in the name of egalitarianism is what has gotten readers attention, and is partly responsible for driving the book’s popularity. For aren’t we seeing something similar today. Scientific institutions, social norms, the legal system, logical discourse, and religious tolerance are under attack. Aren’t we now feeling some remorse for ignoring the plight of the poor in America (as in 1917, the Russian nobility regretted too late the plight of the serfs). Admittedly, the scale of the attack is nowhere near as vicious as the Bolshevik’s leveled against the Russian nobility, but it is similar in form. Perhaps we are witnessing more of an Orange Horror than a Red Terror. Regardless, Towles reminds us that well intended change will be disquieting. If Towles did nothing else, he at least gave us the Count as a guide for how to navigate the uncertainties produced by the onslaught of change!Could the Count countenance an escape to the U.S.? Where did he go? America is portrayed ambiguously in the book. It’s music suggests its free wheeling life affirming nature, but on a dark note, Osip (former colonel and party member, studying English and American culture under the Count’s tutelage) suggests that change is as destructive in America as in the Soviet Union. In short, the dialogue between the Osip and the Count reveals America’s contradictions. In a few short paragraphs Towles lays out the ambiguity of American society, a few of which are borrowed from Tocqueville’s impression of America.The freshness of jazz“And yet, the art form had grown on him. Like the American correspondents, jazz seemed a naturally gregarious force – one that was a little unruly and prone to say the first thing that popped into its head, but generally of good humor and friendly intent. In addition, it seemed decidedly unconcerned with where it had been or where it was going – exhibiting somehow simultaneously the confidence of the master and the inexperience of the apprentice. Was there any wonder that such an art had failed to originate in Europe?”Destruction of the past (creatively in the U.S., administratively in the Soviet Union)\"but do you think the achievements of the Americans-envied the world over-came without a cost? Just ask their African brothers. And do you think the engineers who designed their illustrious skyscrapers or built their highways hesitated for one moment to level to lovely little neighborhoods that stood in their way?...we and the Americans will lead the rest of this century because we are the only nations who have learned to brush the past aside instead of bowing before it. But where they so do in service of their beloved individualism, we are attempting to do so in service of the common good.\"American’s need for comfort“There is not a single country in the civilized world where less attention is paid to philosophy than the United States” And, The minds of Americans, he says, are universally preoccupied with meeting the body’s every need and attending to life’s little comforts.”The darker side of American capitalism“they seemed to depict an America in which corruption and cruelty lounged on the couch; in which justice was a beggar and kindness a fool; in which loyalties were fashioned from paper, and self-interest was fashioned from steel. In other words, they provided an unflinching portrayal of Capitalism as it actually was.”I suspect that the Count would welcome some aspect of American culture and might even be willing to tolerate an American economic dynamism fueled by a cycle of creation and destruction. What he could not countenance is the darker side of American capitalism and its people’s preoccupation with comfort. The Count’s view is just the opposite. He says, “But in the end, it has been the inconveniences that have mattered to me most.” Nor would he feel at home with a people so preoccupied with themselves. He says,”…a gentleman should turn to a mirror with a sense of distrust. For rather than being tools of self-discovery, mirrors tended to be tools of self-deceit.\" I will leave it up to the reader to guess which end of the spectrum the Count occupies and which end tends to be more American. Lastly, I would add that the pace of life in America would not suit the Count well, for time in America is meted in seconds rather than the clang of the twice tolling clock. If for no other reason than that, America would appear to be a poor choice. Instead, I opt for his escape to Paris where he occupies a small back room in Sophia’s flat. I can envision him living his last days simply un-intrusively, sipping fresh coffee at a nearby cafe, conversing with the regulars, … after the twice tolling clock’s first chime.The Gentleman and Rules of Civility. Towle’s Rules of Civility gets its name from a list of rules George Washington developed to guide persons of culture to comport themselves in high society (the American nobility). No doubt, the Count exhibited many of the behaviors the rules were intended to foster. However, the rules were not causative. In the Count’s case he was guided by an internal compass (his own rules) forged over the course of a life. It was the intertwined helix of love and loss that shaped him and gave him direction. By way of contrast, Tinker Grey, a main character in Rules of Civility, makes a conscious effort to shed the “Rules” in his search for ephemeral freedom. The only thing they share in common is, they are both on the run.",
                "reviewVotes": "114 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BooksalottleBooksalottle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXP36GMGTDY3TIPHSGSESLPSAHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27ZMMDEW0N4JE?ASIN=0143110438",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2018",
                "reviewTitle": "5.0 out of 5 stars A Modern Masterpiece! My BEST and FAVORITE Book Read in 2018!",
                "reviewText": "'A Gentleman In Moscow' is by far the BEST book I've read all year. Without question!I read this delightful novel during the hellish, three-digits heatwave in southern California in July of 2018. If you know anything about southern California heat, it is anything but fun or smile-inducing. Yet, despite the Dante's inferno hellscape that I was physically in while reading this delicious literary treat, this extraordinary book had me smiling and magically whisked away to a non-colluding Russia of the 1920s that would enchant even the most crotchety. Batting my eyes, sighing, lightly tapping my chest, and saying the words \"be still my heart\" is the feeling this exceptional piece of literature invokes in me every time I think about it. Long after turning the last page, 'A Gentleman In Moscow' is still with me, beating my heart to a pleasant mush.The novel tells the fantastical tale and chronicles the life of a Russian Count, Alexander Ilyich Rostov, who was once part of the Russian aristocracy with close ties to the Tsar and Tsarina prior to the revolution. Due to his familial and political ties pre-revolution, plus his life of opulence that is now deemed symbolic of the old Russia, he is exiled. The full extent of the Count's punishment however is that he is placed under house arrest in the attic of the world renowned Metropol Hotel in Moscow \"for the rest of his days,\" in lieu of being shot. While at the Metropol, he \"masters his circumstances before his circumstances get the better of him.\" He befriends and interacts with a kaleidoscope of hotel associates and hotel guests, each of who are just as unique, lovable, quirky, funny, eccentric, curious, and extraordinary as the Count himself.As my review's title indicates, 'A Gentleman In Moscow' is the BEST book I've read in 2018 and despite five months remaining in the year, I doubt that any book will topple its distinction in my mind. This is the first book by author Amor Towles that I'm reading and he is now firmly planted as one of my favorite authors. According to his bio, Towles graduated from Yale University and received an MA in English from Stanford University and boy does this academic prowess show in his writing. Towles' choice of story structure, his intelligent diction and syntax, his masterful crafting of the brilliant plot, and the poetic, sometimes dreamlike storytelling is unlike anything else I've read in a long while. All of the characters introduced are broad and serve an intrinsic purpose.The Count, the titular gentleman in Moscow, is an in-depth character study of a man in exile who does not let the fancy hotel prison get the better of his wits as life goes on around him.The entire time while reading, there was hardly a moment that I was not smiling at the words in front of me. Cerebral, charming, delightful, and so wonderfully jovial, with moments of sadness and deep contemplation, 'A Gentleman In Moscow' is in my opinion a literary masterpiece. The first 167 pages have a slightly caliginous, obscure tone. In the vein of magical realism, the reader will be delighted but might find themselves unsure of the state of the main and supporting characters during this section. By this I mean that I on several occasions between pages 1-167, thought the characters were all dead and were simply ghosts revisiting their previous social lives. To be clear, they are not ghosts and are in fact more alive than you and I. Right on page 171, like a blooming flower in Spring, the book opens up with a beautiful and bright flourish that tickles the senses thereafter. As the plot moved along in perfect pitch and pace, my heart would swell and my smile widen ear to ear each time Count Rostov interacted with the characters Sofia, Anna, Nina, and the two additional members of the Triumvirate. Even the Bishop, an irascible and frustrating character provides moments of levity.The setting of the novel is a world famous opulent hotel that sees all manner of events taking place with scrumptious, delicious food being served with all the pomp and circumstance of proper fine dining. In that regard, Towles gave the Count the heart and mind of a seasoned, well traveled bon vivant who knows high-end cuisine with an exceptionally refined taste. I am a classically trained chef and I've worked in many high-end hotels and high-end kitchens and I must say, I was thoroughly impressed with the snappy and clever level to which the author imparted food and wine into the count's tale. From the preparation and serving of authentic dishes, to the wine varietals, to the top-notch appellations and vintages, to the detailed pairings, I was wide-eyed and dazzled because it was all on point. Without pretension, the descriptions were a truthful account of the etiquette of respectable cuisine. Because of my own culinary acumen and epicurean sensibilities, I am always looking for the use of food and wine symbolism in books I read and in movies/TV shows I watch. 'A Gentleman In Moscow' is perhaps one of the best iterations I've encountered in a long time. This book will be pure delight for the lover of fancy food and for the gastronomes and epicures like me who are in the know.Along with the exceptionally intriguing plot, lovable characters, and artful display of food & wine, another masterful and much appreciated talent the author exhibited in the book was his writing of women. Towles treats each of his female characters with care, respect, and reverence. So much so that the precociousness of Nina and Sofia is never tiresome or irksome, but instead, the young ladies are witty, smart, and can hold their own against any adult in the book. Sofia will achingly break your heart with pride and adoration of her, while Nina will have you in stitches due to her droll wit. Equally as commendable is the respect and dignity Towles gives the Anna and Marina characters, without ridicule or making them into caricatures or bores. Anna ages and matures with grace and an air of regality, while still retaining her sexiness and zest for life.At the exception of Shakespeare's 'Romeo & Juliet,' when it comes to critically acclaimed works of literature, I don't usually like love stories that consume a book's entire plot. However, the love affair between Count Rostov and Anna Urbanova was beautifully done. Delicate and sweet without over-saturation and without being all consuming, their love was just the right amount of sentimentalism that was needed for it to be believable to the book's plot. This is important, especially taking into consideration that the Count is in fact in prison. The Count and Anna are two adults who banter and playfully laugh at the others' weaknesses, all while displaying affection and deep admiration for the other. I smile right now just thinking about their coy, yet amazingly sexy rendezvous throughout the book. Trust me, it's good and will make you giggle and smile with bashful contentment. Their lovemaking is tender and packs a smashing punch. Good stuff!In the middle, in between, and around all this magic and wonderment in Moscow, is Count Rostov. A fictional man who my schoolgirl heart thinks is darn near perfect. The Count is intelligent, witty, traveled, assertive, and generous, with a sly but kind sense of humor. He is nostalgic but sensible, without harboring ill will or bitterness around his circumstances. He is also very funny. Above all, the Count is a man who knows and tests his own limits, with his head held up high in honesty and appreciation of those around him. Simply put, Count Alexander Rostov is my kind of guy and my kind of character. He can lyrically make love to a woman in a manner that would make Casanova smile and concurrently make Cupid blush, while two hours later, he can recite the best vintages of Chateau d'Yquem and Chateauneuf-du-Pape. Come now, what's not to love? The Count may not be real, but if he were, best believe I'd be fighting Anna Urbanova for his affections.By now, I'm sure you can deduce that I LOVED this book and everything about it. I adored it cover to cover, page in page out and I had a lovely time reading it. Through brilliant prose that has captured and enchanted my soul, Amor Towles has achieved something special, something masterful. Something extraordinary. From my perspective, writing like Towles' is exceptional and rare. It is intelligent without being pretentious, it is vivid without being suffocatingly overwrought, and it is relatable without being cloyingly sweet or cliched. Everything about 'A Gentleman In Moscow' is what I look for in good reads and this book was a winner in all sense of the word. Mr. Towles in my opinion is a magnificent author and I could not recommend this novel enough as an entry into his talent as a writer and masterful storyteller. I have zero negatives to say about the book and I plan on reading it repeatedly for years to come.For serious readers of literary fiction, readers who have an appreciation for historical fiction, lovers of books that have solid character portrayals, serious readers who love an ensemble mix of characters that are each wonderful in their own way - 'A Gentleman in Moscow' is for each and every one of you. I highly, highly, highly recommend it and would give it 10-Stars if permitted. It thoroughly deserves the full 5-Stars. Get to reading and if you are over 21, sip an aromatic brandy or savor a robust, well rounded glass of French red wine while doing so. Cheers!",
                "reviewVotes": "298 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71K--N4ggTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71sEYRR63jL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathi K.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKUBNQRDIWRGCHDEHZGHOAJEUBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R233F488UPWLCW?ASIN=0143110438",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "4.0 out of 5 stars A general review of Amor Towles writings",
                "reviewText": "Mr. Towles is an artist of the written word. I've never read anyone who can paint such vivid pictures with words and do it so poetically. That said, however, I often find myself lost and confused as I read them, as he goes off on tangents and asides which don't always follow the story...or do they? (Hold that thought, it may show up again a few chapters down the road.) I really like the surprise of finding a character showing up in a different time frame in another book (no spoilers, just be aware as you read). Overall, I can't decide if I like his books or not. I enjoy reading them, but with the mentioned caveats. I must say I find his endings abrupt and unfulfilling, with many unanswered questions.I have read Rules of Civility (looking forward to seeing what became of Eve in the sequel stories), A Gentleman in Moscow, the Lincoln Highway, and the short sci fi story You Have Arrived at Your Destination.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rahel S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 30, 2024",
                "reviewTitle": "Sublime",
                "reviewText": "A bit slow and tedious at the start but then it picks up steam. Worth every minute of reading.Made it to the list of Bill Gates' favorite novels.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jimena",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 18, 2023",
                "reviewTitle": "Atrapador",
                "reviewText": "Una clase de elegancia y modales. Una lección del lenguaje inglés y una novela interesantísima. Léelo con un kindle o un diccionario a la mano para sacarle más jugo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Capt Haddock",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "Great read",
                "reviewText": "A book recommended to me and now I am recommended it to you. A warm blanket, cup of tea and roaring fire type of read. Enjoy it and fall in love with the characters.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elmars",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 12, 2024",
                "reviewTitle": "Nice gift",
                "reviewText": "Excellent book. Nice gift. Good delivery",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CELSO LUIZ NEGRELI",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on April 19, 2021",
                "reviewTitle": "Delicioso...",
                "reviewText": "Uma grande obra, com uma escrita elegante e um refinado e sutil humor. Os personagens são bem construídos, principalmente o Conde Rostov. Quem não gostaria de conhecê-lo e passar uma hora conversando e filosofando, com um drink preparado pelo bartender do Hotel Metropol? A estória acompanha a vida do Conde Rostov, um nobre russo condenado a viver no Hotel Metropol. Um homem culto, sensato e sensível, que em nenhum momento reclama da vida, da perda da fortuna e do confinamento. Vive intensamente cada momento e está sempre disposto a ouvir e ajudar as pessoas que cruzam a sua vida. Ao longo de mais de 30 anos o livro mostra a vida do Conde no hotel, as relações que desenvolve com os funcionários e clientes do hotel. Como pano de fundo o autor mostra também as transformações da Rússia após a revolução bolchevique, sem entrar em discussões ideológicas. Um livro saboroso, para se degustar sem pressa. Vi em algum lugar que o livro vai virar um série para a televisão. Vai fazer sucesso. Mas antes disto, leia o livro.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}