{
    "remaining_requests": 601,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Complete-Persepolis-Marjane-Satrapi/dp/0375714839",
    "body": {
        "name": "The Complete Persepolis: Volumes 1 and 2",
        "price": "$14.99$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Complete-Persepolis-Marjane-Satrapi/dp/0375714839",
        "soldBy": {
            "sellerID": "A1ZWVJTZO5RWFA",
            "name": "ZBK Wholesale",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1ZWVJTZO5RWFA&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81BNp4Y9T0L._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Marjane Satrapi",
            "link": "https://www.amazon.com/Marjane-Satrapi/e/B001IGFN9I/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ZBK Wholesale",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 2771,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 11 hrs 4 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 9 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Politics & Social Sciences",
                "link": "https://www.amazon.com/Politics-Social-Sciences-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3377866011"
            },
            {
                "name": "Politics & Government",
                "link": "https://www.amazon.com/Politics-Government/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5571255011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Pantheon; Media tie-in edition (October 30, 2007)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0375714839"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0375714832"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.41 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.9 x 8.8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,401 in Books (See Top 100 in Books) #6 in Biographies & History Graphic Novels #86 in Women's Biographies #278 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 2,771 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Complete Persepolis Embroideries Persepolis Persepolis 2 Chicken with Plums Here, in one volume: Marjane Satrapi's best-selling, internationally acclaimed graphic memoir of growing up as a girl in revolutionary Iran. From the bestselling author of Persepolis comes this enlightening look into the sex lives of Iranian women, gathering together Marjane’s tough–talking grandmother, stoic mother, glamorous and eccentric aunt and their friends and neighbors. Wise, funny, and heartbreaking, Persepolis is Marjane Satrapi’s acclaimed graphic memoir of growing up in Iran during the Islamic Revolution. “A wholly original achievement.” —The New York Times: \"The 50 Best Memoirs of the Past 50 Years\" The fascinating continuation of the best-selling Persepolis, “one of the freshest and most original memoirs of our day” (Los Angeles Times). Marjane Satrapi dazzles with her graphic memoir about growing up in Iran during the Iranian Revolution. Acclaimed graphic artist Marjane Satrapi brings what has become her signature humor and insight, her keen eye and ear, to the heartrending story of a celebrated Iranian musician who gives up his life for music and love.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/57e32976-9ce6-42ee-ac85-f71d85acb92b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d8864b96-f3f7-44bc-91df-9a521e760ba4.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/03535f27-775b-4a09-8e7f-72663ddcb7dc.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/41039ca1-e68f-49ac-9b4d-b18d47f2d2dd.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9d4a3e75-877b-49d5-828b-9cc62c13afca.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Betsy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE34H46OBZMI2DXTAOLKJLJJ5PDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R74RKG73W4D9?ASIN=0375714839",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars graphic novel",
                "reviewText": "I read comic books when I was a kid, no, loved them. When I find a serious graphic novel for adults, I read it. My book club recommended it, but I had already read it. I, in turn, recommend this book. I had read the previous version, and I missed her grandmother, but this story was just as powerful, maybe moreso. Her relationship with her uncle was heart-rending. The violence was hard to see and read, but I felt that it was necessary. The men in her life add to the arc of the story. This is the story of what is happening to women in Iran. It needs to be told.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meg Loveless",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIS3OEAIEQSMFHDZZBNEEHJR2LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39K0EUUI8QI0O?ASIN=0375714839",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 28, 2016",
                "reviewTitle": "5.0 out of 5 stars Historical Non-Fiction for the Win!",
                "reviewText": "Book ReviewSatrapi, M. (2007) The complete Persepolis. New York, NY: Pantheon Books. After reading Marjane Satrapi’s graphic memoir, Persepolis, I believe it is in the best interests of our students to add the book to our available reading list. Persepolis is Satrapi’s account of growing up during the Iran-Iraq War (1980-88) that almost immediately followed the Iranian Revolution (1979). Satrapi is an Iranian woman who left Iran to attend high school in Vienna, later returned to Iran to marry, and eventually moved to France where she wrote Persepolis. The memoir serves as a bildungsroman for Satrapi, covering her life as she leaves primary school and enters high school; we see Satrapi grappling with the woman she wants to become in light of where she comes from. Persepolis also serves as a piece of literary historical non-fiction because the backdrop of Satrapi’s coming of age is amidst a pivotal point in Iranian (and Iraqi) history, and this history is central to the plot line of Satrapi’s memoir. Persepolis has also won a fair share of awards. It was a New York Times notable book, Times Magazine’s “Best Comix of the Year” (2004), and a best-seller across the country. The book, originally written in French, was adapted into film, and the film version won the Cannes Jury Prize, the César award for best writing, the César award for the best first feature film, and the Sutherland trophy. The film adaptation was also nominated for an Academy Award for best animated feature film. Despite the accolades both the film and graphic memoir received, Persepolis is in the top 10 of the American Library Association’s 2014 “Frequently Challenged Books” list. The ALA informs us that the rationales that have been provided for banning the book include gambling, offensive language, and its political viewpoint. The ALA also says that Persepolis has been called “politically, racially, and socially offensive” and that it has “graphic depictions.” There is truth to these claims. Persepolis takes place as Satrapi grows up amidst the Iran-Iraq war. War, by its very nature, brings about political viewpoints that some students and their parents may disagree with. The book also contains offensive language, and portrays the ramifications of war and includes “graphic depictions” as a result. The National Council of Teachers of English (NCTE) in its guidelines on “The Students’ Right to Read” (2012), argues, “Literature about ethnic or racial minorities remain ‘controversial’ or ‘objectionable’ to many adults…. “Though nominally, the criticisms of racial or ethnic literature have usually been directed at ‘bad language, ‘suggestive situations,’ ‘questionable literary merit,’ or ‘ungrammatical English,’ the underlying motive for some attacks has unquestionably been racial.” Using the coded language the NCTE provides, we can see that the reasons given to the ALA as evidence supporting a book ban and/or challenge appear racial. The complaints do not say, “We should ban this book because it is about an Iranian woman,” but the codes found in words like “offensive” point to a racially-based book ban. This kind of censorship is inappropriate and unfair to our students, who deserve to have historical events contextualized in multiple forms (movies, graphic novels, novels, short stories, documentaries, and art to name a few forms) and to have students from multiple cultures represented in texts. English Language Arts programs is, “…not one instructional resource, but many; not one curriculum objective, but several” (Guidelines for selection of materials in English language arts programs, 2014). The use of Satrapi’s text allows for many objectives to be met simultaneously:1. It is historical non-fiction, which allows it to be taught as an informational text rather than as literature. It is also naturally interdisciplinary, which allows for and encourages complementary teaching across Social Studies and English Language Arts classes.2. It is beautifully written. Even though it is classified as an informational text, many of the literary devices English Language Arts teachers long to discuss can still be discussed.3. As a graphic narrative, it can be taught to students who read at a wide range of Lexile levels. Visual learners will also benefit. Its graphic form also allows it to become a “high-interest” text when it probably wouldn’t be in other circumstances4. As a historical narrative covering the Iran-Iraq War from the perspective of an Iranian woman, it meets the Common Core Standard for “diverse cultures.”5. As a memoir written by a woman, it allows educators to disrupt the male-centered curriculum so often seen in classrooms across the country6. Persepolis can easily be included in a text set with other texts. It can be used in a unit on war, the Iran-Iraq War specifically, women in the Middle East, women’s rights, and fights for freedom.Depending on the instructional context used by the instructor, Persepolis can meet many curriculum needs simultaneously, while widening the worldview of American-centric readers. In schools with high populations of immigrants and refugees, Persepolis helps provide a face that is often much more like theirs in a sea of literature dominated by dead white men. As with any highly-challenged book, it is probably always a good idea to send parents a permission slip in advance that provides them with 1) an opportunity for their student to do an alternate assignment instead 2) a rationale for why you believe the text is worthy of study and 3) reasons why the book is challenged. It’s certainly possible that parents will balk at the idea of their children reading a book that some consider “offensive,” but I have faith that with simple explanations and the ability to change their mind, the vast majority of your students will be able to read texts as important as Persepolis.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "\"Waystation 49\"",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH34SZJV6EZX44CMLJHNVUVCYELA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MUR3SVIF0NER?ASIN=0375714839",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Cartoon strips show snapshots of post Shah Iran",
                "reviewText": "What an interesting way to tell her childhood story!I have often been told to write my story / autobiography.... somehow drawing pictures brings memories, even painful ones, more 3- dimensional. I really felt what I would have felt going through her experiences.I am not Persian / Iranian. At the time the Shah left \"for vacation \", I had a job offer to teach in Tehran. I had been introduced to my serious boyfriend's father and been \"approved.\" I was learning Farsi, loved the language and culture. In 2978-79, Tehran was still considered the \"Paris of the Middle East.\" The culture was very westernized with western world values. The culture crackled with life, night life, fashion, dance and music, arts, and singers like Dariush, and Farhad. Yes, Persians were ( are) religious at that time, but similitude to Americans now, religion was more how you lived your life, it didn't dominate your life by force or cult.Marjane takes me back to that overwhelming and confusing time in my life. Her book for me, picks up just after I ended my marriage plans with my boyfriend and we went our own ways.She is helping me to close an old chapter.Separately, her first psges talk about her feeling a calling to be a Prophet. While I didn't want to be a prophet, I too had a strong spiritual calling from maybe age five (?), and neither of my parents were overly religious. My mom liked to practice her singing, so she went to church. My father cut grass. His \"god\" was the lawnmower.Maybe one day I will interview Marjane. For sure, I would love to meet her and thank her for writing such an important- and culturally healing - book.I am recommending her book to other Persians I know of, some were asylum seekers.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KEN",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF5JUF67YVBIP3ZBJIWHJ42BSRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M3937XLLHK1P?ASIN=0375714839",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars humorous and true",
                "reviewText": "book is highly recommended - plus excellent packaging from the seller - thank you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 13, 2023",
                "reviewTitle": "Excelente narrativa",
                "reviewText": "Excelente historia! La evolución de la protagonista es muy orgánica y la forma en que se cuenta la historia es muy ingeniosa. Aunque el estilo es muy caricaturesco los temas fuertes no carecen de intensidad. Un clásico en proceso.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcos Pereira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 15, 2022",
                "reviewTitle": "Precioso",
                "reviewText": "Além de ser graficamente agradável, traz uma narrativa gostosa, com humor e profundidade! Recomendo muito!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arale",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 26, 2022",
                "reviewTitle": "Looks New!!",
                "reviewText": "Cannot believe that is a used book. No marks, no wear. All corners are perfect. It is an excellent experience!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jaina Shah",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on May 10, 2023",
                "reviewTitle": "Fantastic",
                "reviewText": "I had read this book a long time ago and it is a pleasure to re-read it now. It is still relevant in today's day and age.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lino scardigno",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 25, 2023",
                "reviewTitle": "der klassiker",
                "reviewText": "der klassiker: wurde schon alles zu gesagt....hier diesmal comic ok verpackt und ohne beschädigung angekommen - was bei comics nicht immer der fall ist.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$14.49",
                "sellerName": "Goods2You23",
                "sellerRating": "1"
            },
            {
                "price": "$14.67",
                "sellerName": "Emin Bookstore",
                "sellerRating": "5"
            }
        ]
    }
}