{
    "remaining_requests": 684,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Trinity-Graphic-History-First-Atomic/dp/0809093553",
    "body": {
        "name": "Trinity: A Graphic History of the First Atomic Bomb",
        "price": "$12.18$12.18",
        "originalPrice": "",
        "rawPrice": 12.18,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Trinity-Graphic-History-First-Atomic/dp/0809093553",
        "soldBy": {
            "sellerID": "A1F5ORSGF7UA9M",
            "name": "Dream Books Co.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1F5ORSGF7UA9M"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51kJgYZXODL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51t1ZFnLEpL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jonathan Fetter-Vorm",
            "link": "https://www.amazon.com/Jonathan-Fetter-Vorm/e/B0060EB6TY/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Dream Books Co.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 303,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Trinity illuminates a turning-point in human history, and does so with admirable pace, grace, and skill.” ―Cory Doctorow, Boing Boing“Succeeds as both a graphic primer and a philosophical meditation.” ―Kirkus (starred review)“Fetter-Vorm's work . . . is altogether exemplary. And the writing's as good as the art, making this a strong primer on the A-bomb's development.” ―Booklist“The story behind the weapon that ended World War II and changed the nature of international conflicts forever, Trinity covers both the scientific, technical side of building the bomb and the very human side of realizing what its existence would mean for mankind.” ―Mashable“A succinct, compelling, and dramatically illustrated history of the making of the atomic bomb, Trinity is an excellent primer for students and younger readers.” ―Cynthia C. Kelly, founder and president of the Atomic Heritage Foundation and editor of The Manhattan Project“The story of J. Robert Oppenheimer and the creation of the first atomic bomb lies deep in our collective imagination. Jonathan Fetter-Vorm's graphic novel honors the physics, the politics, and the human drama of this contemporary morality tale in a manner that is as informative as it is entertaining.” ―John Adams, Pulitzer Prize winner and composer of Doctor Atomic“The story of the Manhattan Project has rarely been told with this much clarity and alertness to moral nuance.” ―Joseph Kanon, author of Los Alamos“A hugely important story told with virtuosity and heart, Jonathan Fetter-Vorm's Trinity is a standard-bearer for great comics.” ―Nick Bertozzi, Harvey Award–winning author of The Salon and the Rubber Necker series About the Author Jonathan Fetter-Vorm is a writer and illustrator. He was born and raised in Montana and currently lives in Brooklyn."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 29 mins",
            "FREE delivery February 26 - 29."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Trinity, the debut graphic book by Jonathan Fetter-Vorm, depicts the dramatic history of the race to build and the decision to drop the first atomic bomb in World War Two―with a focus on the brilliant, enigmatic scientist J. Robert Oppenheimer.\"Succeeds as both a graphic primer and a philosophical meditation.\" ―Kirkus Reviews (starred review)This sweeping historical narrative traces the spark of invention from the laboratories of nineteenth-century Europe to the massive industrial and scientific efforts of the Manhattan Project, and even transports the reader into a nuclear reaction―into the splitting atoms themselves.The power of the atom was harnessed in a top-secret government compound in Los Alamos, New Mexico, by a group of brilliant scientists led by the enigmatic wunderkind J. Robert Oppenheimer. Focused from the start on the monumentally difficult task of building an atomic weapon, these men and women soon began to wrestle with the moral implications of actually succeeding. When they detonated the first bomb at a test site code-named Trinity, they recognized that they had irreversibly thrust the world into a new and terrifying age.With powerful renderings of WWII's catastrophic events at Hiroshima and Nagasaki, Fetter-Vorm unflinchingly chronicles the far-reaching political, environmental, and psychological effects of this new invention. Informative and thought-provoking, Trinity is the ideal introduction to one of the most significant events in history. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9"
            },
            {
                "name": "Military",
                "link": "https://www.amazon.com/Military-History-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 0809093553"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Hill and Wang; Illustrated edition (May 28, 2013)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 160 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9780809093557"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0809093557"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN950L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.3 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.4 x 8.95 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#115,847 in Books (See Top 100 in Books) #49 in Educational & Nonfiction Graphic Novels #54 in Nuclear Weapons & Warfare History (Books) #1,041 in World War II History (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 303 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Charles Volchansky",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTIHIPIEQVX6DBVAFP4ZRE754IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO5W2UCS6I8HU?ASIN=0809093553",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Don’t let the graphics fool you",
                "reviewText": "A picture is worth a thousand words. This book provides with enough information textually and graphically to gain a rudimentary understanding of the events leading to the development of the A-bomb.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arely D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5BHFHEXSGQ3XVT76NNAUIAQAJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWUZCHK3ZCYUK?ASIN=0809093553",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2013",
                "reviewTitle": "5.0 out of 5 stars What schools should have kids read in World History.",
                "reviewText": "I remember being in 10th grade World History and learning all about WWII and the atomic bomb. I also remember that my teacher could never really explain how such a devastating weapon functioned. She would simply say, \"An atom splits and it explodes.\" Although I appreciate her attempt, I never understood how a thing as small as an atom could be split, and beyond that, how an atom could cause such a grand explosion. I tried Wikipedia but that just complicated things even more. I never truly understood the atomic bomb until I picked up this graphic novel.The graphic novel does a great job in explaining every single event that lead to the bomb's creation. It does it all chronologically, so page-flipping is not necessary. The book also introduces A LOT of names that you have probably never heard of before, but they are all tied to the events so it isn't pointless information. The book jumps from location to location with ease and it's hard to get lost since the author/artist makes good distinctions when the timeline jumps.Another aspect of this graphic novel that I really, really loved was that the science aspect of it (there's a lot of science in this graphic novel) is explained and depicted. Every step that there is to creating an atomic bomb and its explosion is drawn out. Unless you became a Chemistry Major after high school, then remembering all those concepts is difficult. I actually understood the science concepts because of his drawings.The author also ends the graphic novel with an opinion of his own, which is cool since most of the graphic novel was very fact-oriented.If I were back in high school I would have loved to read this book, not just because it has pictures, but because it is easy to follow, entertaining, and highly informative.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RDD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEKA6WODQNV3G5QBLHTEBDDZNQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UZI8GTOT8WHP?ASIN=0809093553",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 19, 2017",
                "reviewTitle": "5.0 out of 5 stars A Fantastic Graphic Sythesis of the Early Atomic Age!",
                "reviewText": "Jonathan Fetter-Vorm's \"Trinity: A Graphic History of the First Atomic Bomb\" traces the origins of atomic theory, the early work developing a working knowledge of critical mass, the Trinity test, Hiroshima and Nagasaki, and the early Cold War, all while telling the story through the framing device of Robert Oppenheimer preparing the Trinity test for July 16, 1945. Fetter-Vorm's art brilliantly condenses complex concepts, such as atomic theory, in a manner that's both dramatic and easy to understand. He also knows when to let the art speak for itself, such as in his portrayal of the aftermath of Nagasaki. As an historian, Fetter-Vorm echoes the conclusions of John Earl Haynes when he writes, \"Even before this world war had ended, the Cold War had begun\" (pg. 93). As both an introduction to the history of the early atomic age and an insightful volume in its own right, Fetter-Vorm's \"Trinity\" belongs on the reading list of Cold War historians and students alike.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul van Dare",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVWSOAORSVLRIOVC2YJCS43OL3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z2AY90PWBUZZ?ASIN=0809093553",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2013",
                "reviewTitle": "4.0 out of 5 stars The development of tha atom bomb",
                "reviewText": "Although not on par, as information is concerned with a formal history, it gives an overall idea of the people involved in the development of the A bombs used against Japan, the science involved, It shows how people from very different origins and expertise worked together to accomplish a feat that just made the bombs available towards the end of the war. It also glosses over the feelings of some of the scientists when confronted by the implications of their creation. -the graphics are excellent and convey an ambience you could not otherwise relate to if just reading the plain text.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Avid Nonfiction Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3KANGTYCQ6M5YSSQ3FPSQ5WYEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EDPVBKRQM1HA?ASIN=0809093553",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2022",
                "reviewTitle": "5.0 out of 5 stars Everything You Need to Know About the Atomic Bomb, Japan, Russia, and the Ethics of it All",
                "reviewText": "In one concise graphic non-fiction account, everything you need to know, summarized, about the Atomic Bomb & Oppenheimer, Nuclear Testing in the Desert Southwest, Japan, Russia, and the ethics of it all. There is even a portion of the text dedicated to Teller and the Hydrogen Bomb.5 Stars",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William Brennan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTRPGOAUZTRM5RLW65PVAQ3326Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LH5Z9Q8YTX59?ASIN=0809093553",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2014",
                "reviewTitle": "5.0 out of 5 stars Real insights into the Manhattan Project",
                "reviewText": "I've prided myself for being a rather serious reader for more than seventy years. Obviously, such a snob would never peer inside a graphic book. But for reasons not worth mentioning, I purchased Trinity: A Graphic History of the First Atomic Bomb, and I must say it was enlightening, entertaining, instructional and well worth reading or viewing, however one describes how one gets through such a book.For anyone without a scientific or engineering background, Jonathon Fettr-Vorm provides an excellent primer on the background, development and - sadly - use of the first atomic bombs. With the passage of seven decades most of us have forgotten much about the Manhattan project, and this book is a great refresher for those of us up in years or for those born after WWII but old enough to be frightened by the saber rattling of the Cold War.All in all, I recommend this book to all but the most serious and advanced students of nuclear weaponry.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Bissell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMBQWKEMPAQKTQYZZIYA6DCKVTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R313Q308HUPHAB?ASIN=0809093553",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2012",
                "reviewTitle": "5.0 out of 5 stars Piqued my interest in the Manhattan Project",
                "reviewText": "The best histories leave you wanting to know more about their subject, and Jonathan Fetter-Vorm's \"Trinity\" excels in that regard. Given the book's format, I hadn't expected to learn all that much about fission or nuclear science or uranium refining, but Fetter-Vorm does an admirable job of packing in details, and makes full use of the unique potential afforded by graphic books to render complex reactions and physical phenomena into understandable (and excellently done) illustrations.Although the subtitle bills it as a \"history of the first atomic bomb,\" \"Trinity\" focuses most of its attention on the human aspects of its development: the driven and often eccentric personalities who headed the project, the colossal organizational challenges they faced, the impact of the bomb's successful construction on politics and diplomacy, and -- in some of its most stirring passages -- the immediate experience of an atomic explosion, whether viewed from a safe distance or ground zero. The book succeeds in its ambition to peer past the visceral, awesome power of nuclear weapons to the people and the historical forces which brought them into being.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 3, 2021",
                "reviewTitle": "Simple and beautiful",
                "reviewText": "It is a book that mixes a pleasant visual artistic side while not neglecting the historical aspect of the Trinity project. Don't expect a long story filled with every little detail of the project, but let yourself be carried away by a simple and enjoyable book for easy reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos Alvarado Valadez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 8, 2017",
                "reviewTitle": "Resumen de la primer bomba atómica",
                "reviewText": "Gran libro que relata la ceación de la primer bomba atómica, todas sus implicaciones para su realización. Explicado de una manera sencilla y entretenida",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Douglas Teixeira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 28, 2017",
                "reviewTitle": "Interessante visão geral da corrida para a produção da bomba atômica",
                "reviewText": "O livro traz uma história ilustrada da produção das primeiras bombas atômicas nos Estados Unidos durante a Segunda Guerra Mundial. A história é fascinante e rica em tramas e suspense. A única coisa a se ter em mente é que a ciência por trás da história é explicada de forma breve, então é bom já ter alguma noção dos conceitos explicados.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "9447914010301202202112022021030104197449",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on September 3, 2023",
                "reviewTitle": "Astoundingly good",
                "reviewText": "A great account on the development of a fission bomb from a scientific and historical perspective.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fathermaximo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 10, 2017",
                "reviewTitle": "Buen comic",
                "reviewText": "El cómic ofrece una buena historia con buena temática pero para gustos colores. Buena calidad y precio del libro en si.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}