{
    "remaining_requests": 606,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Story-of-Philosophy-audiobook/dp/B0044KQ0C4",
    "body": {
        "name": "The Story of Philosophy: The Lives and Opinions of the Greater Philosophers",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Story-of-Philosophy-audiobook/dp/B0044KQ0C4",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51jyxnh1LmL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Grover Gardner",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Grover+Gardner"
        },
        "brand": "Grover Gardner",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2305,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The product of 11 years of research, The Story of Philosophy is an endlessly inspiring and instructive chronicle of the world’s greatest thinkers, from Socrates to Santayana. Written with exacting and scrupulous scholarship, it was designed both to command the respect of educators and to capture the interest of the layman. Durant lucidly describes the philosophical systems of such world-famous “monarchs of the mind” as Plato, Aristotle, Francis Bacon, Spinoza, Kant, Voltaire, and Nietzsche. Along with their ideas, he offers their flesh-and-blood biographies, placing their thoughts within their own time and place and elucidating their influence on our modern intellectual heritage. This book is packed with wisdom and wit.Will Durant (1885-1981) was awarded the Pulitzer Prize and the Presidential Medal of Freedom. He spent over 50 years writing his critically acclaimed 11-volume series The Story of Civilization. A champion of human-rights issues such as social reform and the brotherhood of man long before they were popular, he continues to educate and entertain readers and listeners worldwide through his writings. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Politics & Social Sciences",
                "link": "https://www.amazon.com/Politics-Social-Sciences-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3377866011"
            },
            {
                "name": "Philosophy",
                "link": "https://www.amazon.com/Philosophy-Nonfiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11019"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "19 hours and 27 minutes"
            },
            {
                "name": "Author",
                "value": "Will Durant"
            },
            {
                "name": "Narrator",
                "value": "Grover Gardner"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 24, 2010"
            },
            {
                "name": "Publisher",
                "value": "Blackstone Audio, Inc."
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0044KQ0C4"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,469 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #246 in Philosophy (Audible Books & Originals) #903 in Philosophy (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Christopher G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRG6LECJIVNNALOAZP7XX3LRCSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHFYXOJLHZRZV?ASIN=B0044KQ0C4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 19, 2002",
                "reviewTitle": "5.0 out of 5 stars The words of the wisest men in history",
                "reviewText": "There is no pre-requisite to the enjoyment of philosophy, and there is no pre-requisite to the Story of Philosophy. Simply bring a mind that is famished for an injection of joy.\"That is very good; but there is an infinitely worthier subject for philosophers than all these trees and stones, and even all those stars; there is the mind of man. What is man, and what can he become?\" (Durant summarizing Socrates)Philosophy is the night that you looked up at those 100 billion stars and 100 billion galaxies and realized that you were beginning to ask the right questions. \"To know what to ask is already to know half.\" (Durant summarizing Aristotle) Philosophy is the one great conversation in your past that echoes in every conversation since. When will that time come again? \"All excellent things are as difficult as they are rare.\" (Durant summarizing Spinoza)That phenomenon of wonder will return when you open the \"Story of Philosophy\". A further taste of Durant's warming liquor:\"Every science begins as philosophy and ends as art; it arises in hypothesis and flows into achievement.\"\"How many a debate would have been deflated into a paragraph if the disputants had dared to define their terms.\"\"Political science does not make men, but must take them as they come from nature.\"\"The chief condition of happiness, barring certain physical prerequisites, is the life of reason--the specific glory and power of man.\"Durant's approach is linear in time, but immense in breadth. Beginning with Socrates, Plato, and Aristotle, we are not only granted access to their treasure chests of wisdom, we are also given insights into the men. Durant introduces the era before he introduces the philosopher, for humanity inspires humanity, and these giants have benefactors of their own. Durant considers history as important an aspect of philosophy as metaphysics, and here he shines with a polished historian's touch (see Will Durant - \"Story of Civilization\").\"Athens became a busy mart and port, the meeting place of many races of men and of diverse cults and customs, whose contact and rivalry begot comparison, analysis, and thought.\"\"Traditions and dogmas rub one another down to a minimum in such centers of varied intercourse; where there are a thousand faiths we are apt to become skeptical of them all.\"Durant runs the gauntlet of great thinkers (Plato, Aristotle, Bacon, Spinoza, Voltaire, Kant, Nietzsche), and introduces you to some odd-looking but strong-eyed and delightful strangers (Schopenhauer, Spencer, Bergson, Croce, Russell, Santayana, James, Dewey).\"How can we explain mind as matter, when we know matter only through mind?\" (summarizing Schopenhauer)\"We often forget that not only is there a soul of goodness in things evil, but generally also a soul of truth in things erroneous.\" (summarizing Spencer)\"In ourselves, memory is the vehicle of duration, the handmaiden of time; and through it so much of our past is actively retained that rich alternatives present themselves for every situation. As life grows richer in its scope, its heritage and its memories, the field of choice widens, and at last the variety of possible responses generates consciousness, which is the rehearsal of response... Free will is a corollary of consciousness; to say that we are free is merely to mean that we know what we are doing.\" (summarizing Bergson)How many of these men have you missed in the crowd of history? And how many days will pass before you make their acquaintance? What will your future be like once you hold their wisdom in your hands? Durant believes it will be a far richer one.The Story of Philosophy actually contains more summary than quote, and we would normally cringe at such an announcement. Only the bravest of souls would wade into the brine of further philosophical precis. But Durant is the encapsulation of the finest teachers you have met in this lifetime, and his abridgements multiply the reader's comprehension while encouraging cross-referencing with the originals, making the entire experience savory and thoroughly digestible. Durant is the rare case of a man who can interpret wisdom and also construct it anew. The result is maybe the highest ratio of wisdom-to-words of any book in the Library of Humanity.Compare his extractions of Kant with an original text of the babbling scholar:\"Sensation is unorganized stimulus, perception is organized sensation, conception is organized perception, science is organized knowledge, wisdom is organized life: each is a greater degree of order, and sequence, and unity.\" (summarizing Kant)\"The real church is a community of people, however scattered and divided, who are united by devotion to the common moral law.\" (summarizing Kant)\"Kant was too anxious to prove the subjectivity of space, as a refuge from materialism; he feared the argument that if space is objective and universal, God must exist in space, and be therefore spatial and material.\"After 50 pages of Durant on Kant, you will be praying for the entire translation. But Durant moved on to other fine thinkers, and, after 500+ pages of wisdom, you will rejoice that the balance of his substantial catalog is over 10,000 pages (Lessons of History, Story of Civilization - 11 vols.).Within one year of the original printing (1926), the work found its way onto the nightstands of the scholarly and the coffee tables of the middle-class. It inspired a flood of \"Story of ...\" books whose words are now lost to the past. It was, and still is, the primary text for many university philosophy curricula. For those who have read it, Story of Philosophy is probably their \"trapped on a desert island with one book\" selection. That the work remains in print and in demand three generations later is a testament to the author and to the subject... both mighty fine creations.",
                "reviewVotes": "202 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steven Daedalus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEI5PP2FUJIYGGGVN4E4YEGHE4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YIIEEZQR2LRX?ASIN=B0044KQ0C4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 26, 2012",
                "reviewTitle": "5.0 out of 5 stars Fair and Balanced!",
                "reviewText": "I guess I won't go through the contents of the book again, easily available in other reviews as well as accessible on the product page. I'll just leave a few impressions that, I have to note, come from a non-philosopher.One is that I had no trouble with the print in my copy. It was all neat and readable.Another is Will Durant doesn't exactly skip the pre-Socratic guys, but only mere mentions of them are tucked away towards the beginning of the chapter on Aristotle.The choices look a little odd sometimes. There are chapters on Voltaire and Herbert Spencer but none on John Stuart Mill. I'm not complaining. It's just that I've always thought of Voltaire as kind of flighty and of Spencer as more of a sociologist than a philosopher.It was published in 1926 so the prose may seem a little stilted to modern readers although never murky.What I like most about Durant's take on these characters? Each chapter ends not with a round of applause for what the guy contributed but ultimately or, well, penultimately with a section labeled \"Criticism.\" They were geniuses but even genius has its limits. We know that Alexander the Great was a pupil of Aristotle and sent him specimens he collected during his Eastern sojourn but what became of all that natural history? Basically nothing. Greek scientists ran into a methodological dead end because they didn't have measurement tools that were sufficiently precise to allow them to do very much -- no precise scales, no thermometers, no lenses, no algebra. They may have thought they were on top of things but the belief was illusory, as it is with us.It also strikes me as dated in that some of the philosophers covered -- major figures all -- might today be replaced by others. John Dewey, presaged I guess by Montaigne, gave us Montessori Schools and all that. He's all around us. But I wonder, if this were being written today, Durant might have found some space for Charles Sanders Peirce, who begat semiotics, an obscure method of analysis that has influenced fields as diverse as literature and behavioral science.Peirce isn't mentioned but a lot of other figures are discussed in the various chapters labeled with someone else's name. You'll find a bit of Hegel and Fichte in the chapter on Schopenhauer, for example. He's done a marvelous job of making the notoriously incomprehensible Immanuel Kant comprehensible. One good definition of \"hell\" would be having to learn enough German to plow through Kant and then pass a killer exam on him. (Freud, by contrast, won a Goethe Prize for his literary style.) One reason Kant is difficult is that he rarely used examples. Since I am a much better writer than Kant ever was, I will now ask a question about Kant, answer it, and give an example of what I mean.Are Kant's observations in any way relevant to some of the problems facing us today? Yes. Here is Durant on Kant's view of religion and reason:\"The nadir of perversion is reached when the church becomes an instrument in the hands of a reactionary government; when the clergy, whose function it is to console and guide a harassed humanity with religious faith and hope and charity, are made the tools of theological obscurantism and political oppression (p. 212).\" Intelligent design, anyone? How about abortion?For all his erudition, Durant is unable to explain one of the greatest mysteries in the history of philoosophy -- whatever happened to Rene Descartes? It is an historical fact that on a Saturday night, Descartes visited a wine shop and asked for a glass of red, which he then took to his accustomed table. Some time later the inn keeper noticed the glass was empty and asked him if he'd like another glass of wine. \"I think not,\" replied Descartes, and vanished on the spot.Most of all, this is a pretty easy book to read. Some of the concepts and conceits may be strange to us but Durant has the happy ability to phrase them in everyday language. I'd recommend this book to a reader with any curiosity about philosophy, without knowing what it is, and who wants to learn about it without feeling, as in a nightmare, that he's wading in slow motion through a swamp of molasses about to be overwhelmed by some ogre that's going to eat his brain.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Djalma M. Argollo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 18, 2023",
                "reviewTitle": "Muito bom",
                "reviewText": "Como aliás tudo o que Will Durant escreveu!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr  Newman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 7, 2023",
                "reviewTitle": "Great author, great book",
                "reviewText": "Written quite a while ago but still well worth reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 4, 2020",
                "reviewTitle": "Excelente y ameno",
                "reviewText": "Es un libro amable sobre la historia de la filosofía para personas comunes",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dipanshu Gupta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 15, 2021",
                "reviewTitle": "Cannot find a better compendium of big thoughts",
                "reviewText": "Reading this book was like taking a tour of human thought. Mr. Durant is remarkably neutral in his analysis and sometimes a touch prone to exaggeration. The best thing about the book is the middle ground between giving too much and too less details. No wonder it is one of the most beloved books of all time.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jake",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 17, 2021",
                "reviewTitle": "The best book on Philosophy",
                "reviewText": "Amazing, I wish I had this book as I was studying in School! It's just wonderful and has made me really enjoy this subject, which for some reason isn't NUMBER ONE in our current Education system.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}