{
    "remaining_requests": 445,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Magic-Mountain/dp/B088FZL1JZ",
    "body": {
        "name": "The Magic Mountain",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Magic-Mountain/dp/B088FZL1JZ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/5158cF8oJgL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Thomas Mann",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Thomas+Mann&search-alias=audible"
        },
        "brand": "Thomas Mann&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 907,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "It was The Magic Mountain (Der Zauberberg) that confirmed Thomas Mann as a Nobel prizewinner for literature and rightly so, for it is undoubtedly one of the great novels of the 20th century. Its unusual story - it opens with a young man visiting a friend in a tuberculosis sanatorium in the Swiss Alps - was originally started by Mann in 1912 but was not completed until 1924. Then, it was instantly recognised as a masterpiece and led to Mann’s Nobel Prize in 1929. Hans Castorp is, on the face of it, an ordinary man in his early 20s, on course to start a career in ship engineering in his home town of Hamburg, when he decides to travel to the Berghof Santatorium in Davos. The year is 1912, and an oblivious world is on the brink of war. Castorp’s friend Joachim Ziemssen is taking the cure, and a three-week visit seems a perfect break before work begins. But when Castorp arrives he is surprised to find an established community of patients, some of whom have been there for years, and little by little, he gets drawn into the closeted life and the individual personalities of the residents. Among them are Hofrat Behrens, the principal doctor, the curiously attractive Clavdia Chauchat and two intellectuals: Ludovico Settembrini and Leo Naphta with their strongly contrasted personalities and differing political, ethical, artistic and spiritual ideals. Hans Castorp’s stay is extended, once, twice and still further, as he appears to develop symptoms which suggest that his health, once so robust, would benefit from the treatments and the mountain air. As time passes, it becomes clear that the young man, with a particular interest in shipbuilding and not much else, finds his outlook and knowledge broadened by his mountain companions, his intellect stretched and his emotional experience deepened and enriched. Hans Castorp is changing, day by day, month by month, year by year, sometimes imperceptibly, sometimes with a sudden advance, as he encounters the varied range of sparkling characters, their comedies and tragedies, their aspirations and their defeats. The Magic Mountain is a classic bildungsroman, an educational journey of growth - a genre that began with an earlier novel in the German tradition: Goethe’s Wilhelm Meister’s Apprenticeship. It is presented here in the acclaimed modern translation by John E. Woods and is told by David Rintoul with his particular understanding for Thomas Mann as displayed in his widely praised Ukemi recording of Buddenbrooks. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Psychological",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18289232011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "37 hours and 27 minutes"
            },
            {
                "name": "Author",
                "value": "Thomas Mann"
            },
            {
                "name": "Narrator",
                "value": "David Rintoul"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 14, 2020"
            },
            {
                "name": "Publisher",
                "value": "Ukemi Audiobooks from W. F. Howes Ltd"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B088FZL1JZ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,097 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #149 in Classic Literature #225 in Psychological Thrillers (Audible Books & Originals) #298 in Literary Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stephen N. Greenleaf",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJ7SIHW7MHF64X5L4LH5LOTGBVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30500QUXARFKU?ASIN=B088FZL1JZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Brief Reflections on a Very Long But Worthwhile Novel",
                "reviewText": "A friend of mine from my undergraduate days describes having read Thomas Mann’s The Magic Mountain out of a desire to see what gives it its prestige as a literary masterpiece of the twentieth century. I have to fess up to the same motivation. I’d read Death in Venice some time ago, probably first after having seen Luchiano Visconti’s gorgeous and compelling (and largely faithful) film adaptation of the work in the 1970s at the Bijou Theatre at the University of Iowa. (Wonderful for its offerings, not its accommodations.) But with a long trip planned through Europe and knowing that audio versions get me going into more imposing works, and in part because we’d be traveling through Switzerland and Germany, I decided to make Mann’s big book my project.Now having completed the work, like my friend, I was both impressed and somewhat puzzled by it. That is, it’s an extremely long book (over 1000 pages & many hours of listening, even at an accelerated play rate!). And while it focuses on the enigmatic young man Hans Catsdorp, it lacks a dramatic arc. But perhaps that’s a part of the artistic plan of the work: Catsdorp, who at first only plans a short visit to his cousin at the sanitorium high in the Swiss Alps, eventually finds himself a patient there in what proves to be a very other-worldly environment. Time as the ordinarily perceived passage of time, as well as a formative concept of daily life, becomes warped up in this not-so-heavenly realm. (Paul Ricoeur, in Volume 2 of his Time and Narrative makes useful and interesting observations about the nature of time revealed and discussed in this book.)However, this is not to say that nothing happens in this book. There are a variety of fascinating characters and very engaging scenes: the downhill ski by Hans in a snowstorm; Castorp’s infatuation with the enigmatic Claudia Chauchet; Han’s medical interests; the arguments (at quite an elevated level) of Settenbrini and Naphta and then their penultimate encounter; and the seance, among others that allow Mann to exhibit his gifts as a writer. Thus, this nether-world realm serves as host to a variety of encounters and insights involving a variety of characters. The lack of an arc doesn’t entail a lack of dramatic scenes. And, the book ends with a couple of shocking events that leave the reader pondering.This is one of those books that demands further reading (again, I agree with my friend on this point). It does prove to be a “magic” mountain, but is the magic for good or evil? Can we thrive in such a realm? Visit, and judge for yourself.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aran Joseph Canes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRQ55P6L2MIDRACBDN2LNGMDKLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVZP3PW79OYDR?ASIN=B088FZL1JZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2021",
                "reviewTitle": "5.0 out of 5 stars A Spiritual Diagnosis of Europe Before the First World War",
                "reviewText": "When Joyce wrote, “History is a nightmare from which I am trying to awake” he could easily have been thinking of The Magic Mountain. Set in an Alpine sanatorium, Thomas Mann’s characters are supposed to symbolize the cultural sickness endemic in Europe before the First World War.One of the first things to notice is that the residents don’t want to be well. They live lives of ease, first-class meals and hypochondriac obsession. After some time at the sanitarium they no longer feel at home in the world of work, marriage and responsibility. The sanatarium’s goal is not so much to make them well as to make their new life as pleasant as possible.The next point is that the sanitarium itself makes people sick. All patients are confined to bed rest for three weeks upon admittance; they quickly lose whatever strength they had before arrival. Then they are subjected to endless x-rays all with the idea of identifying the root cause of their malignancy. For Mann, it is not only the priests who try to convince men of their sickness, as Nietzsche argued, but men of medicine as well.The residents then spend their time endlessly debating the relationship between body and the spirit, democracy and absolutism and religion and atheism; as of course Europe also did at the turn of the twentieth century.The great pride in Western Civilization that resonated so strongly throughout pre-war Europe is here seen as a sickness that infects those who come under its influence. Mann might almost agree with Gandhi that Western Civilization would be a good idea.It’s a compelling account, especially for those versed in late nineteenth century thought. Whether it’s a true account of the causes of the war or a correct diagnosis of cultural illness is of course left to the judgment of each reader. But as a artistic rendering of a 1920s weltanschauung it stands with the other great works of the Lost Generation.Whether read as an allegory, secular prophecy or just high literature, The Magic Mountain is worth reading; particularly by all interested in the history of civilization.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 21, 2023",
                "reviewTitle": "Título muito bom mesmo...",
                "reviewText": "Adorei o texto do Thomas Mann, não à toa é clássico da literatura alemã",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on June 22, 2023",
                "reviewTitle": "Beautiful Edition",
                "reviewText": "Lovely Book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DW",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 19, 2021",
                "reviewTitle": "Actuel Editions is old translation",
                "reviewText": "The attractive new edition from Actuel Editions is indeed the same old, maligned, original Katherine Lowe-Porter translation. That is why they don't specify. It is fancy wrapping paper. Yet, if a cover matters to you as much as it does to me, we will both have to wait until Penguin Randomhouse finally commissions a revamp to their ugly but superior John E Woods translation. Oh well. (Rated 5 stars because Amazon isn't smart enough not to collapse all translations into a single reviewing metric.)",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Larissa Laiwisleat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 3, 2021",
                "reviewTitle": "Très bien?",
                "reviewText": "Acheté pour un cadeau de Noël et le père deom copain était très content ! Le livre même est trop élégant, les pages faites avec du bon papier.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raluca",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 24, 2020",
                "reviewTitle": "Hardcover",
                "reviewText": "Bad layout and overall execrable quality for the paperback volume of The Magic Mountain (from Vintage International). I am still amazed that one puts so much work into a new translation, only to end up in such a hideous form. Returned and ordered the hardcover version.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}