{
    "remaining_requests": 577,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Problems-Philosophy-Bertrand-Russell-ebook/dp/B0BGRVKFRH",
    "body": {
        "name": "The Problems of Philosophy",
        "price": "$0.75",
        "originalPrice": "",
        "rawPrice": 0.75,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Problems-Philosophy-Bertrand-Russell-ebook/dp/B0BGRVKFRH",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61CSz3nF56L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Bertrand Russell",
            "link": "https://www.amazon.com/Bertrand-Russell/e/B000AP6YJG/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1039,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Politics & Social Sciences",
                "link": "https://www.amazon.com/Politics-Government-Philosophy-Kindle-eBooks/b?ie=UTF8&node=305951011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BGRVKFRH"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Grapevine India (September 24, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 24, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 360 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 137 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#154,815 in Kindle Store (See Top 100 in Kindle Store) #8 in Philosophy Reference (Kindle Store) #18 in Good & Evil Philosophy #29 in Philosophy Reference (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,039 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Carol. Noble",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHYEOHDPS6CMA2APWQ5XDX5PJUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SX31U2DL1TIP?ASIN=B0BGRVKFRH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2008",
                "reviewTitle": "5.0 out of 5 stars The hobo philosopher",
                "reviewText": "Bertrand has written on many different subjects and many of his books can often appeal to the general reader. This book is for those interested in philosophy and who enjoy esoteric arguments. It is for the person with an average philosophical interest and not necessarily the Ph.D. candidate.Bertrand tells us that if we wish to become philosophers we must be willing to tackle the absurd. Obviously! A lot of time is spent on Bishop Berleley, Plato and Descartes and idealism - we are all imaging matter; matter is a figment of our imagination; it's all in your head. The author finally assures us that there is something in the universe besides our comprehension of ourselves and our dreams. There does seem to be \"reality\" or matter even if it is perceived differently or inadequately by each of us. Bertrand finally states that Berkeley's notion that the objects apprehended must be mental has no validity whatsoever. One chapter deals with those that think that we can know more than we actually can know and with those who think, on the other hand, that nothing is knowable - Hegel in the first case and Hume in the latter.Finally we come to the nature of philosophy and its value. Philosophy deals in questioning the unknown and once the unknown becomes known it is no longer called philosophy but science. So philosophy has a rather nebulous list of achievements. Bertrand closes this book with this final paragraph: \"Thus to sum up our discussion of the value of philosophy; philosophy is to be studied, not for the sake of any definite answers to its questions, since no definite answers can, as a rule, be known to be true, but rather for the sake of the questions themselves; because these questions enlarge our conception of what is possible, enrich our intellectual imagination and diminish the dogmatic assurance which closes the mind against speculation; but above all because, through the greatness of the universe which philosophy contemplates, the mind is also rendered great, and becomes capable of that union with the universe which constitutes its highest good.\" Well that, of course, states the case better than anything that I could say but for my part I must offer something. I have always been attracted to philosophy because the philosophers were asking the questions that seemed important to me and by reading and studying their answers I always felt that I was learning how to think and reason intelligently and logically. By being able to think intelligently and logically I felt that I was then better equipped to solve the problems of life - my life in particular.Richard Edward Noble - The Hobo Philosopher - Author of:\"Hobo-ing America: A Workingman's Tour of the U.S.A..\"",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zelig",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJ6JAAPT5ALZGFFEPHMPWTFWOIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DJI3XESM5C6I?ASIN=B0BGRVKFRH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2018",
                "reviewTitle": "5.0 out of 5 stars It's one of the most well-known books in philosophy, so...",
                "reviewText": "I enjoyed reading this book. Some sections are very insightful. The whole book is very well written (well, of course it is). Please keep in mind that I'm neither a philosopher nor a philosophy student. Though I really liked this book, and I was reading it very carefully, and at a slow pace, just to be able to digest it well.Just to give you a hint, this book mostly talks about what an object or a thing is, not quite precisely the problems of philosophy (maybe at that time?). As an example, Russell talks about the table in front of him. He interacts with it by sensing it (touching it, knocking on it, looking at it, describing its colors, etc). But can he really \"know\" that the table is \"there\"? Notice the quotes. This leads us to the question: What is knowledge itself? How do we \"know\" and what can we \"know\"? Can we really \"know\" what's \"there\" for certain? And so on. I'm not Bertrand Russell, so if you think this is boring, don't worry. The book is written in a much more interesting style (a meticulous and elegant style IMO). Though I noticed that Russell loves using little phrases in the middle of his thoughts/sentences that specify some meta-details (Example: \"this work by Russell, which I secretly admire, has been, in many numerous occasions, considered to be, not directly so, by many philosophers of the highest caliber, many of which I had not the privilege of meeting, a milestone in metaphysics or whatever lol). It might be difficult to read for some people, but Russell's style is very clear most of the times.If you're genuinely interested in philosophy and want something concrete (to me, at least) and not just a history lesson, then definitely read this book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bravin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIPZA2UEOF5L5NWN7BYCTHGZGUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KGGJP7H1VEXT?ASIN=B0BGRVKFRH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2011",
                "reviewTitle": "4.0 out of 5 stars A Nice, Light Read for an Introductory Text",
                "reviewText": "This short book is a journey through some of philosophy's more famous problems. Naturally a synopsis this short (it is roughly 100 pages) cannot do full justice to much of philosophy, or even to the problems it actually addresses, but it is an entertaining read that nevertheless will find itself illuminating to those unfamiliar with the subject.Uniquely, instead of following the historical chronology of the problems he chooses, Russell travels a path that seems to flow naturally from one subject to the next, as if each problem logically entailed the other. Consequently, Russell jumps decades (and even centuries), forward and backward as his narrative dictates. The experience is like a modern thriller movie whose out-of-sequence path nonetheless has a logic that makes sense. If you aren't already familiar with the subject you might not notice Russell's technique.Russell opens his inquiry by asking what justifies knowledge. Using Descartes' technique of systematic doubt, he explores the problem by examining illusions and fallacious conclusions that can arise when considering knowledge via sensory data to be perfectly reliable. Moving on to the existence of matter, Russell flexes some of his physics muscle with a cursory examination of the current state of thinking (writing as of 1912). The distinction between knowledge by acquaintance and knowledge by description leads to a discussion of induction and the distinction between empirical and a priori knowledge. This leads him to Kant and a long engagement with idealism follows. I won't spoil anymore.Of course Russell is himself a towering figure of 20th century analytic philosophy, and if you allow yourself a little cynicism, by the end it is clear his narrative merely engaged the line of philosophical puzzles that led to his own work. This is not meant as a character slight: this book's lightness bears little resemblance to his serious work and is aimed at a different audience. Rather, it is telling that the narrative he chooses is historically in line with his own work, so his omissions are less surprising when seen in this light. Given that Russell's original work centers on epistemology and logic, it makes sense the book starts at the Enlightenment, concentrating on epistemological questions, and never touches upon anything prior except for his brief foray into the problem of universals. For a book that calls itself the \"The Problems of Philosophy,\" the omissions of major philosophical problems might raise your eyebrows if not for this fact.Russell is not an impartial narrator; he makes his opinions clear on a number of occasions, particularly with issues that have historical significance. I don't consider this a weakness; there is no shortage of general philosophy volumes that treat all ideas in a sympathetic light. It is also salutary to reflect Russell is not a philosophy historian in the normal sense (his huge History notwithstanding); he is an original contributor. Thus I would not expect a thinker of his stature to not proffer his views, as would be expected from any academic professor.My gripe with this book is the tediousness with which Russell begins the discussion. The early pages are somewhat monotonous and not entirely engaging. The rest of the work is quite engaging, so the book as a whole is let down by its beginning. This is unfortunate because many readers might not find themselves committed enough to finish it. Given the target audience (folks who may have no prior exposure to philosophy), missing out on the best parts because of its beginning would be unfortunate.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ELISABETE DA SILVA MOREIRA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 27, 2023",
                "reviewTitle": "Não comprei esse livro???",
                "reviewText": "Tipo houve engano. Não comprei.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abu Haque",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 13, 2022",
                "reviewTitle": "On time",
                "reviewText": "Excellent timing",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S.K.B.Baruah",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 19, 2023",
                "reviewTitle": "Really good and enlightened me a lot",
                "reviewText": "Immensely satisfied",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CWRshaw",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 27, 2019",
                "reviewTitle": "Clear, Succinct and Easy to Read",
                "reviewText": "Great intro to the subject matter. Goes well with his history of Western philosophy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon カスタマー",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on October 8, 2019",
                "reviewTitle": "Delivery on time, perfect state",
                "reviewText": "I like Bertrand Russell and I didn't have this book. Very interesting point of views",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}