{
    "remaining_requests": 539,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Science-Mind-Ernest-Holmes-ebook/dp/B09YRGBYXR",
    "body": {
        "name": "The Science of Mind",
        "price": "$0.39",
        "originalPrice": "",
        "rawPrice": 0.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Science-Mind-Ernest-Holmes-ebook/dp/B09YRGBYXR",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71Ey3HG5eKL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ernest Holmes",
            "link": "https://www.amazon.com/Ernest-Holmes/e/B001H9VXHC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1396,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Religion & Spirituality",
                "link": "https://www.amazon.com/Religion-Spirituality-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158280011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09YRGBYXR"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ SAS Books (April 22, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 22, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1657 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 370 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1520984928"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#92,738 in Kindle Store (See Top 100 in Kindle Store) #69 in New Age New Thought #205 in Medical General Psychology #301 in New Thought"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,396 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZNV6XSPRJPX3G3RYLYHF6V4CKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13OCDIZZSCHPN?ASIN=B09YRGBYXR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2010",
                "reviewTitle": "5.0 out of 5 stars Should be in the home of every serious spiritual seeker!",
                "reviewText": "Ernest Holmes, founder of the Church of Religious Science, wrote this epic book as a \"textbook\" for those interested in a practical approach to metaphysical and New Thought ideals. I was first introduced to many of the concepts back in 1994, when I read \"Creative Visualization\" by Shakti Gawain (another book I highly recommend), when I was going through a particularly dark period of my life, and seeking answers I could not find in traditional orthodox religion. While \"Creative Visualization\" was an adequate introduction, \"The Science of Mind\" really expands upon and explains these concepts more thoroughly. It is intimidating at 600+ pages, but once you get into it, you really don't think about it's length! Since I first acquired this book in 2007, I've read it 3 times straight through, and will read it again, I'm sure. Since I have applied these concepts to my own life, I've noticed definite improvements, and notice more every day! The underlying message that everything is One, and that we are all an integral part of the Divine Creative Principle is both comforting and empowering. \"It is done unto you as you believe\" is a truth for all ages. I really feel that Ernest Holmes was ahead of his time when he wrote this book, and the truths it contain transcend time - in fact, a lot of this is more relevant now than it was when it was originally written. I've long since collected every book by Ernest Holmes I can get my hands on, and I find all of his work very illuminating and spiritually liberating. His books always make me feel good about life, and give me the realization that I do, in fact, have control over my life. If you can get them, I also recommend the \"Change Your Thinking, Change Your Life\" 6 volume home study course in \"The Science of Mind\", which gives an even deeper understanding of the concepts explained in this book.On a sidenote, this is the 1938 revised and expanded volume of \"The Science of Mind\". The original 1926 version was shorter and, in my opinion, not as well organized as far as subject matter. I have tried to read it, but find this 1938 version much easier to navigate. However, the 1926 version does contain an entire section on psychic phenomena, which was intentionally omitted from the 1938 revision, as Ernest Holmes (according to his biography \"That Was Ernest\" by Reginald C. Armor) felt that much of it just couldn't be proven. Still, it is an interesting read for those interested in the field of psychic phenomena. There will shortly be a combined SOM volume available through Tarcher/Penguin which contains both versions, for those interested in reading both!",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Guillermo Romero",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5QK72Q5QM74YOI3TLBKVO7D6NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J4Q5QJNOCIHE?ASIN=B09YRGBYXR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 29, 2016",
                "reviewTitle": "5.0 out of 5 stars Yesterday is gone. Today is the blessing we have and tomorrow is what we make of it by what we think and put into action today..",
                "reviewText": "\"Change your life by changing your mind\"....We have at our disposal all of the goodness, prosperity, love, health, and even wealth that exists in the world and we can access all of that by simply learning how the Universe (God,He, She, It or...) works in all of it's simple magnificence. No churches or middle-people to interpret or judge us and all we need is at our fingertips with this book and the others that Ernest Holmes gifted us with. I would recommend his \"Living the Science of Mind\" as a companion volume because initially the Metaphysics and this material can be pretty daunting at times even though it is written in a very accessible manner. If you don't push it, don't push yourself, or judge or allow yourself to be intimidated by past thoughts and experiences, especially those you may have had through family and/or organized forms of religion then you will sooner than later \"get it\", understand and be able to use the building blocks of the very reality we all live in. How could it not be a little overwhelming at first????? Read a little, let it sink in, give it the time you need and re-read then read some more and each time you will see it all with a little more clarity.Also be prepared to feel a need to doubt and reject it all because it seems just too easy, so whole and wholesome. No worries, put it down and come back when you are ready. This is when the companion volume becomes very helpful. Be ready to take the most exciting and fulfilling adventure of a lifetime and welcome to your life!",
                "reviewVotes": "48 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3QKWNN2SQAASQNTKQF6L76OMTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B2ZZEXAQFUUK?ASIN=B09YRGBYXR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Everybody should read this book!",
                "reviewText": "It was inspiring and made me realize how we really do need to understand the workings of the mind to heal and improve our life! I had read one of his other books which referenced this book but I never paid attention to it, without knowing I got this book and realized I had read this author before. It was destiny for me to read this book. I also got the audible version! I have listened to it at least twice.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H.W.Darlington IIIH.W.Darlington III",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJLHHSUFKB7S4S2Z27BXW2AHFKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B13CUIRMQXJE?ASIN=B09YRGBYXR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2021",
                "reviewTitle": "5.0 out of 5 stars This is one book you can judge by its cover!",
                "reviewText": "I’ve enjoyed this book and found it extraordinarily useful for more than a decade. It’s always had a place on my shelf and this copy has given it new life. This version does contain the updated forward by Jean Houston, Ph.D., and meditations in the back for further study, but for those who are willing to absorb its wisdom without “training wheels”, feel absolutely free to enjoy Ernest Holmes’ wisdom straight from the hose, so to speak, as it contains all the original text. The fact that this book is nobody’s required reading goes a long way toward understanding why so few succeed in their own right. Granted, there are more utilitarian copies of this book, and I recommend buying one so you can really break the binding and read it comfortably, but both as a source of wisdom, and a keepsake, this copy of The Science of Mind is golden — literally and figuratively.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/A1YxduabgYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/A1aJAMPxSAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1BxT2mjIIS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1Owom0wvNS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "MerCSakes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCXR4KEZ6T46UED6FOCPKKO7ABA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROLJRPR3YXP0F?ASIN=B09YRGBYXR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Thought provoking",
                "reviewText": "I ordered a used version and I have to say it looks brand new. Some underlining, but not much. I was really impressed. Note: it was listed as “Very good” condition.As to the actual text, I’ve just started but thus far it’s beautifully written and easy to understand. I’m really pleased.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EQUIBALANCE*🐎",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 22, 2022",
                "reviewTitle": "Concentrarse para entender bien todos los mensajes",
                "reviewText": "Muy interesante pero hay que dedicarle su tiempo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pawan r mishra",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 19, 2023",
                "reviewTitle": "My favourite",
                "reviewText": "Master piece by ernest Holmes",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Iordan NedelcuIordan Nedelcu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on February 20, 2023",
                "reviewTitle": "It is not a science! It is ME, and YOU that he speaks",
                "reviewText": "The media could not be loaded. A wonderful book to understand almost everything in our lives. It is so good reading a special size of writing am so enthused by the book. It is not only inspiring but also inviting to practice with confidence. A must have.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71qZwj5ES4L.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/D1n8lq-zSOL.mp4"
                }
            },
            {
                "reviewerName": "ReganRegan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2020",
                "reviewTitle": "The End of the Road",
                "reviewText": "It is clear that Ernest Holmes was an Enlightened Being of the highest caliber. And I hate using the word 'Enlightened', this is probably the first instance I declare it warranted for no other word would, or could, quite cut it.I have read over 100 books on Spirituality: classic Christian texts, The Tao Te Ching, The Bhagavad Gita, The Dhammapada, The Kybalion and everything in between. Of the 250+ books I have that render my closet obsolete, this is HANDS DOWN the one I would keep if I could only keep one.Anyone who gives this book anything but an outstanding review is simply not ready to receive it, but the wisdom is timeless and profound and will prove itself true the second it is understood and applied.I have had PROFOUND experiences using Mushrooms and LSD with intention in the past. This book only confirms the 'downloads' I received from the universe or God and added more depth, understanding, and practicality to the knowledge. I recently did a 9 day Ayahuasca retreat in Peru and had profound and sacred visions. Once again, this book appears to be steps ahead of me and helped me to interpret and apply with utmost simplicity what I saw in the higher realms of Consciousness and Being.I was hesitant to buy this book due to the price, but my intuition was obsessive and relentless over this. The publisher of this book also had some of my other favorites in leather bound such as The Kybalion, Psycho Cybernetics, and Think and Grow Rich. This was the only leather-bound book I didn't recognize so I knew it had to be good. Eventually I caved and, in hindsight, I don't know how I would live without this. The Spirit definitely guided me to this when I was ready for it.The book itself is absolutely gorgeous with its leather binding and gold finish. This has absolutely become my Bible and I solemnly declare that I will read it until I die, and likely continue learning the truths of this message even after that. I even wrote this entire review and had it deleted when I tried to add pictures, but I feel so strongly that I had to retype it in case it might influence your decision to buy it.Praise God for this mighty work of revelation that has torn the veil that all who seek may find.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ZeNPQ9zWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712W02JO29L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81ww3i2FqlL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. J. G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 25, 2018",
                "reviewTitle": "Life changing",
                "reviewText": "This book is very close to my heart.It shares the beautiful logical truth about humans and their relationship with the universe.No agenda and no BS - just a complete course on how to better yourself, be free from fear, worry and doubt live the life you came here to.Highly recommended.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}