{
    "remaining_requests": 586,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Girl-Leaves-Berkley-True-Crime/dp/0425258823",
    "body": {
        "name": "The Girl in the Leaves (Berkley True Crime)",
        "price": "$9.89$9.89$7.21$7.21$9.89",
        "originalPrice": "$10.99",
        "rawPrice": 9.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Girl-Leaves-Berkley-True-Crime/dp/0425258823",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91sOWEclthL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Robert Scott",
            "link": "https://www.amazon.com/Robert-Scott/e/B00550ADGQ/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by ThriftBooks-Chicago.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 1496,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for Robert Scott“Compelling and shocking…a ground-breaking book.”—Robert K. Tanenbaum “Fascinating and fresh…a fast-paced, informative read.”—Sue Russell “Skillfully written...[Scott] has the ability to tell a true story with compassion and taste while grabbing and keeping the reader's attention.”—ReviewingTheEvidence.com “An excellent true crime writer.”—True Crime Book Reviews About the Author Robert Scott is the author of many true crime books, and has been featured on such television channels as truTV, E!, and Investigation Discovery.Sarah Maynard is the subject of the true crime book The Girl in the Leaves.Larry Maynard is the father of Sarah Maynard, who is the subject of the true crime book The Girl in the Leaves."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 13 hrs 17 mins",
            "FREE delivery February 27 - 29.",
            "Or fastest delivery Thursday, February 22.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Monday, February 19. Order within 13 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The shocking true crime story of one of the most bizarre mass murders ever recorded—and the girl who escaped with her life.In the fall of 2010, in the all-American town of Apple Valley, Ohio, four people disappeared without a trace: Stephanie Sprang; her friend, Tina Maynard; and Tina’s two children, thirteen-year-old Sarah and eleven-year-old Kody. Investigators began scouring the area, yet despite an extensive search, no signs of the missing people were discovered. On the fourth day of the search, evidence trickled in about neighborhood “weirdo” Matthew Hoffman. A police SWAT team raided his home and found an extremely disturbing sight: every square inch of the place was filled with leaves and a terrified Sarah Maynard was bound up in the middle of it like some sort of perverted autumn tableau. But there was no trace of the others. Then came Hoffman’s confession to an unspeakable crime that went beyond murder and defied all reason. His tale of evil would make Sarah’s survival and rescue all the more astonishing—a compelling tribute to a young girl’s resilience and courage and to her fierce determination to reclaim her life in the wake of unimaginable trauma.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2"
            },
            {
                "name": "True Crime",
                "link": "https://www.amazon.com/true-crime-biographies-memoirs-books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11314"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Berkley (December 31, 2012)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0425258823"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0425258828"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 4.19 x 0.77 x 7.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,603 in Books (See Top 100 in Books) #20 in Criminology (Books) #40 in Crime & Criminal Biographies #72 in Murder & Mayhem True Accounts"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 1,496 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jayme Cook",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEF26D7DAYYB3ONJE6MCMGPQEVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E4P8H2QZU0JL?ASIN=0425258823",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Well written.",
                "reviewText": "Robert writes a good story of a horrific ordeal. He writes very concisely and to the point. I especially liked the end of the book when he spells out how the families of the victims were putting their lives back together after the trial and conviction. I will read his other books for sure.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cynthia A. Shelton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUMFUIJ3D5S4MO6T55QW2PTBQCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KXV3YEITC5K4?ASIN=0425258823",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Riveting, but ...",
                "reviewText": "I love true crime books, but I just don't care for Mr. Scott's style of writing. His style is almost \"childlike\" - hard to explain. Bad sentence structure, talking about characters in past tense as if they had died too. I'm kind of a grammar snob, and I found myself too often thinking of a better way he could have written the previous sentence. But that's just me. I live in northeast Ohio and had never heard about this horrific case. What made me extremely sad is that I looked up this family on Google and found that some time in 2013 Larry and his wife were in court for abusing Sarah. I'm glad I had already finished the book because I think that might have ruined the story for me. Hadn't this poor girl been through enough, without her biological father and his wife abusing her? Especially after all his pontificating in the book about how incredibly brave, special, and resilient she is? Outrageous. I am almost moved to write him a letter.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris Edwards",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT3TC75GCB42UZW2VFCUKNS2NYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R280AF4UGR6NZ3?ASIN=0425258823",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Review",
                "reviewText": "It was great my dad loved it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Prime User",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTX4NNGTNKHD5HRXRQVBZOPTMIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W9MZTPFZ1KF?ASIN=0425258823",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2014",
                "reviewTitle": "3.0 out of 5 stars Summed Up the Case...but Not the Story",
                "reviewText": "I grew up in Knox county but moved away about 15 years ago. When this crime occurred I was constantly checking the news for updates, and took a personal interest because several events unfolded within close proximity to my parent's home.I'm not a reader of true-crime books so I have nothing else to compare to, but I think I understand where some of the criticisms come in on this review board. I will say this book gives a good summarization of events, timelines, and quotes as they pertained to each. For me it was much more helpful than trying to piece together news articles and interviews. However, if you're looking for a thrilling story and deep-digging investigative writing, this probably won't appeal to you. It's written in a very chronological sense and doesn't build drama the way a captive narrative should. Again, I'm not faulting it for that, I'm just saying it's a completely different type of book than I think some readers are looking for.That said, I do take issue with several \"facts\" in the book, simply because I am very familiar with the roads, people's names, and other miscellaneous information from the area. Whether they were typos or deliberately changed or just shoddy research, there are several inaccuracies within this book. For example, the author references intersections that don't actually exist, sites someone's name as \"Jan\" when it should be \"Jay\", and mislabels simple landmarks. With such small and maybe insignificant details being messed up throughout the book, it casts some doubt in my mind about the author's effort and attention to details during the actual significant parts of the story.As this appears to be the only book written about these horrific events, I'll have to make do with this author's account and rate it as OK simply because I was compelled to read it in pretty much one sitting. However, if other books are conceived from this crime, I have a feeling the ratings of this book, by comparison, will certainly go down.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katherine Y",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2BP5YW62ZB3VR3NHPHEUNIZ2EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VWHPOS9JYTL0?ASIN=0425258823",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2022",
                "reviewTitle": "5.0 out of 5 stars True crime story about a girl's kidnapping by a demented killer",
                "reviewText": "This is an unusual true crime book. For the reader, the suspense is generated by whether an intended victim will be able to escape, not learning the killer’s identity. The author gives away who the bad guy is on the first page. I was compelled to keep reading to discover a girl’s fate rather than whether the police would catch the killer.Neighbors knew there was something wrong with Matt Hoffman’s behavior. Matt lived with his girlfriend and her young son. He seemed nice at first, but then he changed. Matt’s dogs disappeared. He and his girlfriend had a violent argument, and she moved out. The neighbors didn’t know half of what Matt could do.Miles away, Tina Hermann was busy being the single mom of two kids, Sarah, 13, and Kody, 11. One day as the kids came home from school, they were surprised that their mother didn’t greet them at the door. Then they saw the blood. As they moved further inside, they were rushed by a man. Sarah got away and ran to her bedroom. The man grabbed Kody. Before Sarah could escape, the man was in her room and subdued her with ripped-out electrical cords. Sarah was gagged and bound. She didn't know what had happened to her mother and brother.Tina didn’t show up to work, and her boss notified the police to make a wellness check. When the police entered the empty house, the tell-tale signs of blood everywhere alerted the officers to a terrible scene. They didn’t know that Tina’s best friend, Stephanie Sprang, was also missing. She had stopped by Tina’s house. When her boyfriend reported her as missing also, officers learned that now they had two women and two children who had disappeared.Meanwhile, Sarah had been taken to a house, left bound, and gagged in a dank, lightless basement. When the man came to visit her, she realized that everywhere she looked were leaves, bags, and bags of them. She was lying on a bed of leaves. To her horror, her situation was only going to get much worse.The book documents a gripping, suspenseful case where a young girl’s life was in the balance, and the opportunities for her escape were few. It’s an easy book to read, but the subject is the stuff of nightmares. True crime fans should find the book riveting.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ash W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVCL7ZHPNTR2KVNB55IXUPJDWYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R161YPWJNUOA9X?ASIN=0425258823",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars perfect gift",
                "reviewText": "Bought it for a friend who loved this for Christmas! They wanted a true crime book and this was high on the list.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Gould",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 14, 2023",
                "reviewTitle": "Worth it",
                "reviewText": "Amazing Read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 6, 2016",
                "reviewTitle": "Poorly written",
                "reviewText": "The story itself is interesting, but the way it's written is hard to follow. I actually stopped reading it halfway through because of it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "goatboy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 25, 2013",
                "reviewTitle": "Good Book",
                "reviewText": "I bought this book by mistake clicking on the wrong image, I thought it was a work of fiction thinking I would just give it away as a present. When I received it I realised it was non- fiction and looked like a good read so I decided to keep it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ed",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 16, 2013",
                "reviewTitle": "Please read this book",
                "reviewText": "I bought this book for my wife. She heard about it on the Dr Phil TV show. It is an excellent read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lou",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 31, 2023",
                "reviewTitle": "Interesting read",
                "reviewText": "Great true crime book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}