{
    "remaining_requests": 657,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fun-Home-Tragicomic-Alison-Bechdel/dp/0618871713",
    "body": {
        "name": "Fun Home: A Family Tragicomic",
        "price": "$8.06",
        "originalPrice": "$18.99",
        "rawPrice": 8.06,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fun-Home-Tragicomic-Alison-Bechdel/dp/0618871713",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51NUuPD8T L.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/41cTDzXFjuL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Alison Bechdel",
            "link": "https://www.amazon.com/Alison-Bechdel/e/B000APSPBG/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4258,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2"
            },
            {
                "name": "Community & Culture",
                "link": "https://www.amazon.com/Ethnic-National-Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2365"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Mariner Books Classics; Reprint edition (June 5, 2007)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 232 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0618871713"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0618871711"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 15 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.67 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,781 in Books (See Top 100 in Books) #7 in Biographies & History Graphic Novels #90 in Women's Biographies #288 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 4,258 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Aiken",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZDHNBXWNUCOCTUW4WNA3VYEB7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2F8LAMFH6A7D3?ASIN=0618871713",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2023",
                "reviewTitle": "5.0 out of 5 stars I bought it, even though I've already read it",
                "reviewText": "My life doesn't easily afford going out and browsing books at actual bookstores. I can get get out and about if I'm determined, but I seldom have enough energy to be determined.This means when I want to sample someone's creative work to see if it's something I would actually read or watch all the way through, I have to use ... other means. Let's just pretend I borrowed it from the library.When I sampled this book, it hooked me so well that I couldn't stop at sampling it. I read the whole thing in one sitting, without even thinking to pause to find out where I could pay her properly for a higher-quality copy that I'd probably appreciate more, because that would take me out of the moment and I didn't want that.Having finished it, I've come here and made sure Ms. Bechdel gets her due, because she deserves it.People more eloquent than I have talked about its subject matter and why it's good, but if its description hasn't already turned you off, based on your moral principles, then you're probably compatible with this autobio-graphical-novel and I think you should just pick it up and get started. I'm certain you'll enjoy it too.TL;DR: Great book; buy it.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Wong",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQTWTQLYO6A2HFPYJQZ6H7NHK4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6XD1G2FBBQ3E?ASIN=0618871713",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2022",
                "reviewTitle": "5.0 out of 5 stars Bad Childhood, Great Book!",
                "reviewText": "Love graphics and love memoirs, Alison Bechel had a terrible childhood. Her father was the third generation in the funeral business. It is creepy enough to be around funeral decor and have t0 be very solemn always in public but but little kids having to prep the viewing room with the folding chairs and always be immaculare is a fun part of childhood.I had the experience of working in the upstair apartment of a funeral home temporarily. My first husband's law practice was there. The wallpaper and carpet were funeral home style. The worst part was that I know where the caskets had been.Alison's farher was eccentric and a perfectionist, not one to give warm hugs. He had affairs with the men he hired and I will never forgive for demanding help with the embalming of a client. Not much help but just being there with a naked corpse is not a good experience for any child.This book is one of deeply troubled childhood. The graphics and writing was top notch and now I want to read her book about her mother.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Keith Moser",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTK4BVIN6S5BCZY256WTE3EUFYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LJGWUMKJ4SC8?ASIN=0618871713",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2015",
                "reviewTitle": "4.0 out of 5 stars Decent story with a LOT of literary allusions",
                "reviewText": "[Copied from my Goodreads review]You've probably heard of Alison Bechdel thanks to something used in film criticism called the Bechdel Test. For a film to pass the test it need to feature (1) at least two named female characters who (2) talk to each other about (3) something other than a man. Sadly, a lot of movies don't pass this simple three-question test...I had fun reading Fun home: A Family Tragicomic and checking to see if Bechdel's graphic memoir passed her eponymous test. It took a lot longer than I thought it would, but that's probably just because the test is meant to check films that feature a lot of dialogue and not graphic novels with a lot of narration.Fun Home tells the story of Bechdel's relationship with her father with plenty of literary allusions (Icarus, The Great Gatsby, what seems to be the entire works of James Joyce). There's also a wide overarching theme of sexuality due to both Alison and her father being gay. The novel is by no means chronological, but as the story continues you revisit scenes with new knowledge.Bruce (Alison's father) was a closeted high school English teacher and funeral director (who worked at a FUNeral HOME, get it?) who obsesses over restoring the Bechdel house to its Victorian glory. Helen (Alison's mother) worked on her dissertation whenever she wasn't acting in local theatrical productions (that often lent themselves to having themes pertinent to Alison or her parents' lives).It's in college that Alison realizes she's a lesbian and shortly after coming out to her parents, she finds out that her parents are getting a divorce because of her own father's homosexualtiy. While Alison and her father could have used their shared queerness to grow closer, fate (or her father's decision to kill himself) prevented that from happening. Just weeks after news of the divorce comes out, Bruce is killed by a Sunbeam delivery truck. The official ruling was after crossing the road, something like a snake in the grass caused him to jump backwards into the path of the truck, but Alison thinks he may have backed into the road on purpose. Many parts of the story focus on Alison wondering if her own coming out may have caused her father to commit suicide.The story and artwork were all very nice. The literary allusions were a little overbearing. Most of them went over my head; I feel like there should be a Cliffs Notes companion pamphlet sold with this to explain most of the connections. What I really want to do now is watch the Broadway musical adaptation of this story. Ever since I saw Sydney Lucas destroy at last year's Tony Awards with \"Ring of Keys\" I wanted to see what this musical was about. I'm glad I read the novel first but I can't imagine how different everything would be on stage.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elspeth Read",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 9, 2023",
                "reviewTitle": "ended too fast!",
                "reviewText": "Having been a Bechdel fan for many years, this book was a real treat. Understanding her life growing up as a great deal of depth to all of her other books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on August 9, 2022",
                "reviewTitle": "brutally honest memoir",
                "reviewText": "It’s poetic and brutally honest at the same time. I enjoyed my time with this memoir and feel that I have gotten to know the author better whilst reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "João Junior",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 28, 2020",
                "reviewTitle": "Um trabalho ao mesmo tempo incrivelmente pessoal e perturbadoramente artístico",
                "reviewText": "É impressionante porque é ao mesmo tempo uma narrativa familiar muito íntima mas uma análise em alguns momentos até bem imparcial de uma pessoa tão próxima como o próprio pai. A arte é incrível, a narrativa é brilhante e se você tem problemas com seu pai você provavelmente vai chorar algumas vezes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ola",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Poland on March 21, 2021",
                "reviewTitle": "Dobra robota",
                "reviewText": "Szybka dostawa. Książka przyszła w idealnym stanie. Sposób pakowania (kartonowe pudełko typu tear off) bardzo mi przypadło do gustu.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 25, 2017",
                "reviewTitle": "es muy bueno",
                "reviewText": "No conocía nada de la autora. Vi una reseña en el periódico, lo compré a la aventura y fue un acierto total. Es bastante peculiar y alejado de la experiencia vital de cualquier europeo. Tiene partes muy trágicas, un gran sentido del humor y una fina ironía y gáficamente es muy bueno. Tiene trozos duros de leer y más aún cuando sabes que es básicamente una historia real. Y tiene otros surrealistas en la \"funeral home\" que gestionaba su familia. Si te gusta la novella gráfica tipo Guy Delisle, Marjane Satrapi etc acertarás con este libro. Creo que mejor leerlo en ingles si tu ingles te lo permite. está muy bien escrito.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.05",
                "sellerName": "PRIME-BOOKS",
                "sellerRating": "4.5"
            }
        ]
    }
}