{
    "remaining_requests": 551,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wisdom-Florence-Scovel-Shinn-Complete/dp/0671682288",
    "body": {
        "name": "The Wisdom of Florence Scovel Shinn: 4 Complete Books",
        "price": "$11.79$11.79$7.11$7.11$11.79",
        "originalPrice": "$18.99",
        "rawPrice": 11.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wisdom-Florence-Scovel-Shinn-Complete/dp/0671682288",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71UeDnH9sOL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Florence Scovel Shinn",
            "link": "https://www.amazon.com/Florence-Scovel-Shinn/e/B000APQ9SC/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by -OnTimeBooks- and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 935,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 6 hrs 57 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 12 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 14 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Religion & Spirituality",
                "link": "https://www.amazon.com/Religion-Spirituality-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=22"
            },
            {
                "name": "New Age & Spirituality",
                "link": "https://www.amazon.com/New-Age-Religion-Spirituality-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=12621"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 0671682288"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Fireside; Reprint edition (May 15, 1989)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 355 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9780671682286"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0671682286"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.3 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.44 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#35,679 in Books (See Top 100 in Books) #230 in Mental & Spiritual Healing #441 in Occult & Paranormal #1,252 in Psychology & Counseling"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 935 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Precious Simone Inspires",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSJLMHGUOZEFAFAWDLCK4HUVHFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P7J5UPRIOM3R?ASIN=0671682288",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars A MUST READ!!!!",
                "reviewText": "I absolutely love this book! I came back to this book every single day as I couldn’t put it down! I read it in 4 weeks! It’s so inspiring and I employed a lot of the direction, declarations and affirmations and saw them come to fruition in my life! There is nothing that I didn’t like! I recommend this book to anyone who is looking to take their faith to another level!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jude Carlson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH56S3C55AFQY6Q7ZRCQ2LAZC7LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39FN6SZVWF4NH?ASIN=0671682288",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "5.0 out of 5 stars A World of Wisdom from a Beautiful Light",
                "reviewText": "Love these beautiful writings. Florence was such an amazing light and way ahead of her time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Me",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXWKLLQ7MHWMIRWZBZT674YE7RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RX5L93Z8GPOP?ASIN=0671682288",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 18, 2009",
                "reviewTitle": "5.0 out of 5 stars Changed my life forever / review 2009 updated 2013 & 2016 and 2023",
                "reviewText": "OK, never done this but here goes! When this book was given to me 4 years ago by a woman, I was so depressed I was barely able to get out of bed in the mornings. I was broke, friendless nor could I maintain good friendships, could not find a good job nor hold one down... everything I touched withered. I read the book skeptically, being that, while I believe in god or a higher power, I am not into Jesus (don't want to offend anyone). OK, at first I said an affirmation/prayer in a joking \"yeah right why not\" way but it worked. Tried another and it worked. I realized in surprise something was working so started doing it more. My thinking began to change. Fast forward a few months I got and held a good job with WONDERFUL people. Made friends. In 2 years got promoted and a big raise, in 6 months another promotion and raise. Then I started realizing some lifelong dreams. I had felt helpless but here I suddenly got my drivers license, bought a house, bought a car, all for the first time in my life. I got lots of cool furniture for the house as a gift from a neighbor, people have helped me in SO many ways and I've now given away 4 copies of this book to other people. It works. Period, end of story.HERE IS AN UPDATE IN 2013:I still often refer to this book. It always gets me back on track if I slip. It literally helps you out of any jam in life. Any situation, and any problem. Just pick up the book and read a page. It gives you the right way to think. It is a beautiful book, the only one I always turn to, it's always out on my coffee table, near at hand. And I gave away even more copies over the years. I can truly say that after reading this book, which at first I had no interest in and thought it was BS, I can tell you my life never was the same again and my friends and family know about all the \"magic\" wishes and things that often happen to me. When something goes wrong, I do as Florence would advise, I think of her and say phrases from her book, and all is swiftly made right again! Love it!HERE IS AN UPDATE IN 2016:The magic continues in my life. In 2015 at age 40 I married my wonderful boyfriend of 3 years. We bought a wonderful home at an amazing price from wonderful people. The house was everything we wanted but thought we couldn't afford. We easily conceived, and at age 41 after a happy, healthy pregnancy I gave birth to our sweet baby girl. After a lifetime of sorrow, pain, and failure in love and life, I am happy, healthy and blessed. As Florence says: \"wonders shall follow wonders and miracles shall never cease.\"Buy this book and just try to put in into practice. Just dip your toe into the waters. It may just turn your life around!I'm baaaack! It's 2023 and I STILL flip through my book every morning or whenever I need wisdom or solutions. My marriage is still devoted, mutually supportive, and loving. We had another baby when I was 46 and everything went so well! Our home is in order and we are all in good health. This book continues to help me connect to God on a daily basis. No problem is too big or too small to ask Infinite Intelligence for the divine solution! I find it prevents me from attempting to manipulate situations (thereby making them worse), because we, as humans, may have limited understanding of a situation, we think we know the answer, but God sees all and understands all, and knows the perfect solutions. I can't say enough how beautifully and intricately problems are resolved in elegantly intricate ways I could never have concocted myself. It is a power with such genius, it knows no bounds. I continue to be amazed, inspired, comforted, and recommend it to loved ones. Pro tip: It will get you out of a pickle, FAST! If you find yourself in a jam, in a conundrum, try it. Florence knew how to help people connect to God's infinite wisdom and power.",
                "reviewVotes": "228 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESTWLSOMNSARYUI7FEKC7DW7OSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E95SNKIUAXMK?ASIN=0671682288",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "5.0 out of 5 stars in good shape",
                "reviewText": "books arrived with mo damage",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Malik Blassingame",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJOQ4ZBOCXCYWCRX5YMDVFSKYWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30D0WOL025C9D?ASIN=0671682288",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Gems!",
                "reviewText": "This book is filled with gems that make you look at certain situations through new eyes. You won't regret buying it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MulanMulan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMJLZDG7ALAH7BZ5JZCCZBANXWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YP9WKJFW5MSR?ASIN=0671682288",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2022",
                "reviewTitle": "5.0 out of 5 stars Easy - Feel Good Read",
                "reviewText": "My friend introduced me to Florence Scovel Shinn via YouTube and I like how refreshing it felt so I bought the book. I've read it several times and will likely continue to do so when I need a reminder of the power of words/thoughts. It's starting to sink in! I used to fell like I had bad luck so I would get jealous when others win things but now I just smile & say 'What God has done for others he now does for me and more'. I genuinely feel happy for others. Oh and I'm the lucky one now, constantly putting that out into the universe! Recently I won a $5000 raffle from a local dealership. What God has done for me, he now does for you...and more! Get the book, you won't regret it :)",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ion8wXDJL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shawn Austn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQ56FH2EWQDK52V7C65SNJGNXHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PIR81207UNCD?ASIN=0671682288",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2013",
                "reviewTitle": "4.0 out of 5 stars Invaluable knowledge",
                "reviewText": "A friend recommended this book. This book contains knowledge I wish I knew 10 years ago. It is based on Christianity but you do not have to be a christian to follow the principles outlined in this book. The laws of the universal creator cannot be ignored any longer if we are continue are existence upon this earth!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYCWVJCID6F672F3QD4ZMECGCNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIB61HBTLU5B2?ASIN=0671682288",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2013",
                "reviewTitle": "5.0 out of 5 stars And the master said, do not judge less you be judged.",
                "reviewText": "Mrs, Shinn is excellent in giving new creative positive affirmations. In some few areas of her writings she leads the reader into keeping our negative thoughts at bay. For me this is the greatest thing she does. And how does she do this? She shares her ideas much as Emmet Fox did in his book The Sermon on the Fox or Manley Halls booklet The Sermon On The Mount An Interpretation. And that was to emphasize Jesus teaching do not judge less you be judged. We all would have more inner peace if we took Jesus command. The previous two books especially Manley Halls booklet puts Jesus command as a healthy spiritual directive that we need to us many many times each day.The trick is to see how many times we do judge during the day. Then we can see how many times we need to remind ourselves to not judge. Gandhi said he did not learn true spirituality from Christians. He learned it from Buddahists. When the Chinese Communists came down in 1951 and killed and tortured thousands of Buddhist monks, the Buddhists and the Dela Lama never said anything critical about that. Through this example Gandhi based his non violence treatment of England and won Indias independence.How can we not pay paramount attention to this spiritual directive?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rafaella",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 21, 2022",
                "reviewTitle": "Best book",
                "reviewText": "That’s the best book I’ve ever read. For a non native English you should expect some words you might not be familiar with, because it has some old fashion words. But it did not get me stuck. It’s good to have as it’s the 4 in 1 as in a few of the chapters it mentions about one of the books inside of the other, so you have all on hand and can have easy access to the pages of the other books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mez Tuc ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 1, 2020",
                "reviewTitle": "A blessing!",
                "reviewText": "This book help me change my thinking so I could be at peace with life and myself",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Margaret Irving",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 22, 2013",
                "reviewTitle": "Spiritually Uplifting Practical Life Wisdom",
                "reviewText": "Long before The Secret and 1937's Think and Grow Rich, there was Florence Scovel Shinn using \"the word\" to help people achieve what they wanted in life. The first book in this four book compelation was written in 1928 and is titled The Game of Life. After reading this as a library book I wanted to own a copy so I could continually refer to it's excellent affirmations for redirecting my thoughts away from negativity and towards letting god or the universe bring me all the abundance that is rightfully mine...and yours.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K8 Wolf",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 5, 2013",
                "reviewTitle": "Wonderful new thoughts",
                "reviewText": "This is a very recommendable book!Suitable for anyone who is looking for energy and wants to step outside the box.Offers many affirmations and suitable ones for every day use.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 15, 2019",
                "reviewTitle": "Sensible self help to improve your life!",
                "reviewText": "Written many years ago but much more helpful than some of the more modern self help books that I have read. Yes it refers constantly to God but you can interchange the term God with any deity you are more comfortable with. I would recommend reading this before falling for paying out lots of money to people who guarantee that by paying them they will make you rich, happy etc. The message in these books is you are the one with the power to change the circumstances of your life and gives you ways to do so.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.39",
                "sellerName": "Animal Crackers Originals",
                "sellerRating": "4.5"
            }
        ]
    }
}