{
    "remaining_requests": 426,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hyperbole-Half-Unfortunate-Situations-Mechanisms/dp/1451666179",
    "body": {
        "name": "Hyperbole and a Half: Unfortunate Situations, Flawed Coping Mechanisms, Mayhem, and Other Things That Happened",
        "price": "$12.09$12.09",
        "originalPrice": "",
        "rawPrice": 12.09,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hyperbole-Half-Unfortunate-Situations-Mechanisms/dp/1451666179",
        "soldBy": {
            "sellerID": "A1ZWVJTZO5RWFA",
            "name": "ZBK Wholesale",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1ZWVJTZO5RWFA&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "80",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71DsHN46D6L._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Allie Brosh",
            "link": "https://www.amazon.com/Allie-Brosh/e/B00E98P662/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ZBK Wholesale",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 12980,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 58 mins",
            "FREE delivery February 29 - March 5 on orders shipped by Amazon over $35",
            "Or fastest delivery February 28 - March 1"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Touchstone Books (January 1, 2013)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 369 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1451666179"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1451666175"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 1040L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.52 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.9 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,582 in Books (See Top 100 in Books) #17 in Comic Strips (Books) #141 in Fiction Satire #465 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 12,980 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Modesty Press",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHKOX2HJF4AWAQRPYGFVCDVSXNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SUXW129IL19H?ASIN=1451666179",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2016",
                "reviewTitle": "5.0 out of 5 stars I am not that good a liar",
                "reviewText": "Why are all the reviews so far positive?I am a suspicious, 72-year old, low-empathy, retired, fixed-income sociopath, living in the woods on a large island in Puget Sound, about to go in tomorrow for some tests on my heart. (A couple of months ago, I passed out while driving, completely destroying my Jeep and my life saved only because my air bags deployed and were not faulty air bagsTSo far medical science has been unable to figure out why I passed out. For all I know, this may be the last Amazon review I write. Please read all my other reviews and think kindly of me.I rate this book with five stars, also. My reasons for doing so seem to be different than all the reviews so far. This book has a lot of resemblances to my life. (I am not making this up. I am not that good a liar.)The details are not exactly like my experiences but close enough to resonate.I am male. I grew up in Los Angeles. I was abused by my father. Not as badly as the narrator of the book , but bad enough. When I was four years old I saw my father striking my mother. My maternal aunt (I think, this is conjecture) told my parents that unless they let me go and live with her in Monterrey, she would call the cops. I am talking about 1948, so I don't know if the cops would have done anything, but I guess the threat was enough to get compliance. I remember sleeping in sleeping bags on the beach along the California coast. My aunt saying to me, “Stephen, your father ruined my sister. I am not going to let him do the same to you.”Later, after journeying through six high schools in three states (my father, a very intelligent if very disturbed man) was trying to blow up the world. Not quite the way it may sound. He was working for the real life counterpart to the movie Dr. Strangelove, which I am sure you can buy from Amazon, and programming the computers that would have launched bombers toward Moscow during a very bad part of the(not so) “Cold War.” I then, trying to get away from my family, applied to the University of California at Berkeley and was accepted. I was fairly smart (runs in my family), fairly disturbed (also runs in my family) and very immature. (I am now old and sliding into senility (also runs in my family). This was something around the late 1950s early 1960s. A year or two before the “Free Speech” movement at Berkeley.I promptly flunked out and ended up homeless on the streets of Berkeley, San Francisco, and Oakland. I am lucky to be alive. Oakland, particularly around 1960, had some very nasty patches. I remember sleeping in a laundromat when some gang members came in to get pop from a machine and started talking about beating me up (or worse) for amusement. For no reason I can remember they wandered out to find more profitable amusement, such as robbing somebody with money. (I had none.)Sometimes I went on the Berkeley campus and robbed lunches that students had left in unlocked lockers. I did get picked up by a cop, for stealing some food in a convenience store. He read me the riot act and let me go, so I have no record.Eventually I went home in disgrace. Even more eventually I rebooted at Pierce Junior College in Woodland Hills (San Fernando Valley), got married, helped create a daughter (still married after 50 years and daughter, who fortunately takes more after her mother than her daddy, just turned 50. She is a symbol of changes in modern life. She is married to her girl friend of over 20 years. They have a co-daughter (artificial insemination) who is now 12 and considers it perfectly normal to have two mommies (now gaily married) who live in Seattle and two daddies (sperm donor and partner) who live in Chicago.Eventually, I graduated from San Fernando Valley State (now grade inflated to University of California at Northridge) and ended up with a Masters Degree in Education at the University of Washington in Seattle. This narcissistic narration has something to do with my review (if you are still reading) because I ended up teaching high school at the second most dangerous high school in Seattle (Rainier Beach abut 1970-73, if you are a connoisseur of Seattle ancient history) and then at Tigard, Oregon (not far from Portland, along the Willamette River. Make sure you pronounce it correctly or I will know you are a fraud).I mention this because while teaching at Tigard, one day a young lady in one of my classes (urged on by her very sweet boyfriend) asked to speak to me after class. Reluctantly, she told me that her stepfather was raping her on a regular basis, as he had done to her older sister who ran away from home. “My mother knows what's going on, but she pretends not to,”she told me.I reported the situation to the police as I was legally obliged to do and would have anyway. The local sheriff's office told the young lady to call them the next time he raped her after he had fallen asleep. They waited outside the house in an unmarked car. She climbed out the window and they took her to a hospital to get sperm samples. Unfortunately, when the case was going to trial the girl decided she could not face the ordeal of testifying in court, so she ran away. She called me from a pay phone in Los Angeles and did not leave any way for me to get in touch with her. I hope things turned out OK.As I say. I am a sociopath and a narcissist. This is not my book. When I say it is an excellent book and worth reading, I do so from personal experience with similar situations and experiences.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kari L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJ4BFTSYCRSZPANAJQC65QARLSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9L55QR4RIBSW?ASIN=1451666179",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Entertaining",
                "reviewText": "Was on my nightstand for a while, because it was good for a laugh and there's lot of material in there. The sense of humor was witty and relatable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anomaly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFNWR2QJKADTXGY3BM3B5YBLWSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAG3LL70P1HHV?ASIN=1451666179",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2020",
                "reviewTitle": "4.0 out of 5 stars Somewhat Dated But Still Entertaining & Insightful",
                "reviewText": "I was a huge fan of Hyperbole and A Half, the blog, back when the only internet connection I had was 40kbps dialup (on a good day), coming from a laptop with a duct taped case, flickering screen, two missing keys, and a USB dongle modem to replace the original which got fried by lightning. Back then, I would wait a small eternity for each image to load and lean in, squinting at the dying screen, just to laugh at the entertaining and relatable content. Back then, I couldn't afford the book, and as with most meme-like things it faded to the back of my mind leaving only the \"ALL the things!\" meme in its place.At some point between then and now, my best friend related a story from this very book - one of her favourite books of all time - to me in order to explain that I wasn't alone in how I handled my depression and how frustrating I found others' responses to it. In the story, Allie (the author) explains that the empty lack of joy caused by depression is akin to having a dead fish. Everyone keeps telling her to just try not having dead fish or reassuring her that someday she'll have not-dead fish, completely ignoring that she is upset that her fish are dead and refusing to acknowledge that they cannot just be magically resurrected. All she wants is for someone to just acknowledge that the fish are dead and understand that having dead fish sucks. That story resonated with me, and for roughly a year, I used the metaphor to let my friend know when I was feeling depressed but not looking for magic fixes - just comforting acknowledgment.Eventually, it faded from mind, replaced by more modern references or direct honesty. Then Allie's second book happened recently. I pre-ordered it on that very same best friend's urging and absolutely loved the experience. Allie's art is so charmingly expressive even in its simplicity and she writes about things which make me feel far less alone in how I experience the world.I was excited to have everything I remembered loving about the blog in a modern book. When I related this to my friend, she bought me this book and I was overjoyed to have more of the same - I hadn't even remembered this existed!So, here I am, having just finished reading Hyperbole and A Half, the ebook rather than the blog, on a lovely flagship phone with a beautiful screen... in a format which makes me squint and lean in to read the pictures, on a mediocre wifi connection, through a router which was purchased to replace one that got fried by lightning.Some things never change. Or perhaps, they shift a bit in ways which remain achingly familiar. The relatability of the fish story is one such thing... and the urge to meme \"ALL the things!\" once again is also quite strong.That said, however, I wish I had read the books in order. This one is slightly dated in the language choices and in my opinion Allie has grown significantly as an author in her newer book, Solutions And Other Problems, which made it feel a bit like I was reading a regression in this order. The relatability and entertainment values are still very much there, but some stories drag too long and others are very clearly written from an early-2010s perspective.For example, in a story about discovering that one of her dogs is developmentally challenged, Allie refers to the dog's apparent lack of mental acuity by saying her dog might be r*t**ded [censored for Amazon; written fully in the book]. I couldn't help but cringe at this, even though she was using the term in a literal, pseudo-medical sort of assessment and this was written before we as a society came to the conclusion that the word needs to be avoided for all its harmful associations. It only happens in a single chapter, after which she refers to this dog as \"the simple dog,\" but even that feels a little unpleasant.Everything else, however - even when the stories drag on longer than they should - is great. There are interesting, entertaining, heartbreaking, fascinating, relatable, and hilarious things in relatively proportionate doses. Allie's narrative voice is as conversational and smooth as listening to a good friend talk to you at a social gathering, creating a sense of camaraderie despite the obvious barrier created by being total strangers. Even the stories about \"the simple dog\" and the other dog adopted to be her companion are fun, especially when the dynamic between them is explored.As with the sequel book, I found the mental health issues extremely relatable. Much like Allie describes in this book, I also beat myself up internally every time life with depression makes simple tasks difficult... and then get even more demotivated by the self hatred, creating a perpetual cycle of uselessness. I imagine many people with clinical depression can relate.Additionally, I enjoyed the bits about self image and having intrusive thoughts. Here, Allie explains how she struggles with self-loathing because she wants to do bad things (like kick sand at people or make fun of people) but chooses not to because she wants to be a better person. For her, it's difficult to reconcile the realization that she has the potential to be a bad person with the effort she expends to make sure she's not. It's a refreshingly honest exploration of human nature, self image, and the existential crises caused by the places where those things don't quite properly align. It's also the source of my favourite quote in the book: \"...so, you'd rather know the truth and be mad?\" / \"No. I want the truth to be different.\" That feels oddly timeless and appropriate to many situations, especially this year.Overall, I think this book deserves 4.5 stars, but we're still stuck in a world without half-star ratings on Amazon, so I'm going to round it down to properly indicate that I feel it's not quite as good as the sequel which I gave five stars. I enjoyed it and I'm sad that it's over because I want so much more from this author. The format and voice are so unique, I'm not sure I'll be able to find anything else of the sort - at least not easily.But, hey, at least I feel a little less alone in how I experience the world, now. And I both got some good laughs and a chance to enjoy my best friend's favourite book. I'd say that's very much a win.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonymous",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEGSNIAUT4GSBPDGG4ZSVKWYQZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V1UZSB1114MR?ASIN=1451666179",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "It's a nice thick book, has a ton of her comics. Just got a copy for my friend because i loved it so much. My mom even read it. Top notch. Can't remember if it has the cake one though, that's my favorite",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gail",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ4Y3SIV7VNNU5T6S5E6VW45T6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PERLKTKUD22E?ASIN=1451666179",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Hilarious and now a fave…once I got into it",
                "reviewText": "I’ve owned this book for many years. I picked it up and didn’t like it so put it down many times. Last week I decided to give it one more try before donating it. I LOVED IT!! I was so moved by it, and so entertained, and captivated. I laughed so hard in some points I literally hurt my throat. Both the text and the illustrations are charming and creative. I just bought another one to give as a present.Additionally, I’m reading her second book now, and loving it. I sobbed and sobbed and sobbed over the illustrations of her and her sister growing up together. That’s her second book.Wholeheartedly recommend! I’ll never forget these books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Montol",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 18, 2024",
                "reviewTitle": "Unique style, amazing storyteller",
                "reviewText": "My partner and I still regularly quote Allie's dogs.I made food?? I'm MAGICAL!!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jägerin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 12, 2021",
                "reviewTitle": "Perfect",
                "reviewText": "Ad said it was a second hand book but it looks like new, and price super cheap. I'm delighted.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kent Routen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 4, 2023",
                "reviewTitle": "Calidad precio acorde al producto!",
                "reviewText": "Muy recomendable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gavin Golden",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 21, 2023",
                "reviewTitle": "A brain dump from an interesting brain",
                "reviewText": "There isn't a story here, or a overall message, or even much in the way of a cohesive style. Which is perfectly fine, because that's the brain this came from.The majority of the book is Brosh's description of (what must be) ADHD, anxiety, depression, self-image and... Well, dog stories. I will admit to having internally rolled my eyes every time someone says they \"feel seen\" but I think I get it now. I'm not sure that for everyone else that it means annoying your wife by loudly guffawing in bed at 3am because you won't put down a book that is putting a description of your life and thoughts in better words than you ever could while also being absurd and clever. But it was for me.It's a bit weird to finish a book like this, given that it felt like an instant and immense dive into a kindred brain, as somehow my own brain expected that this was a conversation we could keep going forever, that Allie Brosh could describe my thought processes in a way that sounded suitably insane but also somehow relatable and acceptable to the outside world. Having finished the book in a few brief hours this experience is now something I will have to do without.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vinoth",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 30, 2023",
                "reviewTitle": "Loved it :)",
                "reviewText": "It is a fun read, I can see why it is popular. I can’t wait to read her 2nd book. I find it relatable, hilarious and such a comforting read: I wish it was a longer book! The page quality is top notch and the illustrations are cute!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.39",
                "sellerName": "Revolver Market",
                "sellerRating": "4.5"
            },
            {
                "price": "$7.40",
                "sellerName": "Braker29’s",
                "sellerRating": "5"
            }
        ]
    }
}