{
    "remaining_requests": 446,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Four-Perfect-Pebbles-Story-Holocaust/dp/0062489968",
    "body": {
        "name": "Four Perfect Pebbles: A True Story of the Holocaust",
        "price": "$7.99",
        "originalPrice": "",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Four-Perfect-Pebbles-Story-Holocaust/dp/0062489968",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41QyXuxXiJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41 VG5b7cNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31 S-Q vTrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wEvcgKDyL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lila Perl",
            "link": "https://www.amazon.com/Lila-Perl/e/B001ITYV48/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1329,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Marion Blumenthal Lazan’s unforgettable memoir Four Perfect Pebbles: A Holocaust Story (Greenwillow Books) recalls the devastating years that shaped her childhood.Following Hitler’s rise to power, the Blumenthal family — father, mother, Marion, and her brother, Albert — were trapped in Nazi Germany. They managed eventually to get to Holland, but soon thereafter it was occupied by the Nazis. For the next six and a half years the Blumenthals were forced to live in refugee, transit, and prison camps that included Westerbork in Holland and the notorious Bergen-Belsen in Germany. Though they all survived the camps, Walter Blumenthal, Marion’s father, succumbed to typhus just after liberation.It took three more years of struggle and waiting before Marion, Albert, and their mother at last obtained the necessary papers and boarded ship for the United States. Their story is one of horror and hardship, but it is also a story of courage, hope, and the will to survive.An outstanding speaker, Marion Blumenthal Lazan has shared her moving first-hand account of the Blumenthal family’s life in Germany, from the events preceding Kristallnacht to imprisonment in concentration camps to liberation in April of 1945, with upwards of one million students and adults. Her Holocaust experiences and messages of respect and tolerance go beyond the facts and inspire audiences around the world. The praise she has received from event hosts is remarkable as she evokes life-changing responses time and time again. She has spoken in public, parochial and private schools, colleges and universities, to church and synagogue groups, and to civic organizations across the United States and internationally.Marion Blumenthal Lazan lives in New York with her husband Nathaniel. They have three married children, nine beautiful grandchildren and two incredible great-granddaughters."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 16 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The twentieth-anniversary edition of Marion Blumenthal Lazan’s acclaimed Holocaust memoir features new material by the author, a reading group guide, a map, and additional photographs. “The writing is direct, devastating, with no rhetoric or exploitation. The truth is in what’s said and in what is left out.”—ALA Booklist (starred review) Marion Blumenthal Lazan’s unforgettable and acclaimed memoir recalls the devastating years that shaped her childhood. Following Hitler’s rise to power, the Blumenthal family—father, mother, Marion, and her brother, Albert—were trapped in Nazi Germany. They managed eventually to get to Holland, but soon thereafter it was occupied by the Nazis. For the next six and a half years the Blumenthals were forced to live in refugee, transit, and prison camps, including Westerbork in Holland and Bergen-Belsen in Germany, before finally making it to the United States. Their story is one of horror and hardship, but it is also a story of courage, hope, and the will to survive.Four Perfect Pebbles features forty archival photographs, including several new to this edition, an epilogue, a bibliography, a map, a reading group guide, an index, and a new afterword by the author. First published in 1996, the book was an ALA Notable Book, an ALA Quick Pick for Reluctant Readers, and IRA Young Adults’ Choice, and a Notable Trade Book in the Field of Social Studies, and the recipient of many other honors. “A harrowing and often moving account.”—School Library Journal Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Education & Reference",
                "link": "https://www.amazon.com/Teen-Young-Adult-Education-Reference/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3344092011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Greenwillow Books; Reprint edition (October 18, 2016)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 160 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0062489968"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062489968"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 12 years and up"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 7 - 6"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 4.9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.4 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,062 in Books (See Top 100 in Books) #3 in Teen & Young Adult Holocaust History #5 in Children's Holocaust Books #6 in Teen & Young Adult Historical Biographies"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,329 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "KingeryKingery",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGF4IIA63XLBYCYW7PF4WE5YND3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17335ZJ3YYM2M?ASIN=0062489968",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Joy and hope",
                "reviewText": "When I was 10, we visited Dachau as a family. Ever since then, I've studied the Holocaust. I can't begin to explain all I've learned and continue to learn about all those involved. I'm amazed that after 30 years, I'm still learning. This is the first child-perspective book I've read. How humbling to hear from a little girl who witnessed these horrors!! How incredible to see how she's used these nightmares to grow and live a joyful life!! In a day where bitterness seems to take over so many, it is so refreshing to see that someone who has experienced so much trauma is able to live a life full of joy and hope. May Marion's life be an example to all of us!!! #neverforget",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71BV0ay8rIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany A. Harkleroad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWUWC3QEJ5ZXJ2R6ERWG6OQWQBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWRO10BBGUJPI?ASIN=0062489968",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 19, 2011",
                "reviewTitle": "5.0 out of 5 stars Wonderful story",
                "reviewText": "For many years now, I have had an indescribable draw to the Holocaust, particularly to reading survivors' stories. It will be a reoccurring theme you see in my reviews. I love to read survivor stories in all forms, which is why I am choosing to review a Young Adult book.The story is about the Blumenthal family, and the six and a half years they struggled during the Holocaust, as well as their struggle for a normal post war life. We learn about the early events of the Holocaust, such as Kristallnacht, in a very personal, emotional way, easy for a child to understand, but with enough impact to affect an adult as well. We learn about the family's attempts to flee Germany, and various plans they made, only to be thwarted by the advancement of the German Army's invasions. We learn of the motivation to stay alive while the family was imprisoned in the concentration camps, the promise of liberation, and the disappointments that met after liberation occurred.When dealing with a topic as sensitive in nature as the Holocaust, writing for young adults can be difficult. The author does not want to gloss over the details, or insult the intelligence of the young reader, but also a line must be drawn to make sure the content is not for purely sensational or shock value. I think this book was extremely well written for its intended audience, but also still had impact on me as an adult. I have read many books on Holocaust survivors, but this one definitely stood out to me. I would like to see more books on this topic, written in this manner, for this audience. I know I would have devoured them if they had been available when I was younger.One of the most beautiful things about this book is the metaphor from which the title is derived. While in Bergen-Belsen, Marion convinces herself that if she can find four perfect pebbles, identical in nature, it means that her family will survive their ordeal. This symbol is one of the only things from which she can draw strength, and the impression is indelible.While preparing to write this blog, I discovered that Marion Blumenthal Lazan has a website, focusing on this book. I strongly encourage all readers of this blog, particularly parents and/or educators who are interested in using this book to impart knowledge to their children or students to visit her website, Four Perfect Pebbles. There is a wealth of additional information there, on lessons our children desperately need to learn.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "fishermike77",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFOUOAL2FQPCLRBKUZDKNIBECHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F8EB6C2T0NT1?ASIN=0062489968",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2013",
                "reviewTitle": "5.0 out of 5 stars Riviting Story",
                "reviewText": "Wonderful story, The current generation is fortunate for the opportunity to learn from the horrors of the Holocaust directly from a first-person perspective—learning about it from a person who lived through it. Marion Blumenthal Lazan is one of those people. The story painted a picture similar to “The Diary Of Anne Frank,” showing the true reality of the viciousness Jews endured during the Holocaust. However, Lazan’s underlying message in telling her tale was different.Marion Blumenthal Lazan spoke at my college and inspired me to purchase her book \"Four Perfect Pebbles\".In a few short years, we will not be here any longer to give a first-hand account. The students here this evening at this college; it is their generation that is the last generation that will hear these stories first-hand,” Lazan said. Her speech completely floored me and I was so deeply moved by her.Lazan stressed how important it was to keep the Holocaust alive in our minds and hearts, even after all those who were physically affected by it have passed on. Lazan spoke at my college because she had a favor to ask everyone in the room. “I ask you to please share my story, or any of the Holocaust stories that you read about. Share them with your friends. Share them with your family. You the students here at this college, share them with your children someday. When we aren’t here any longer, it’s you who will have to bear witness,” Lazan saidIf you ever wanted a first hand account, than read this book, every page is gripping and you can't wait to read the next page just to know that she and her family are ok.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine E Smith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 25, 2023",
                "reviewTitle": "People need to know about this.",
                "reviewText": "I bought it for my husband. He thoroughly enjoyed it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana Carretero",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 6, 2018",
                "reviewTitle": "Recommended",
                "reviewText": "Amazing book. It's a theme I like reading about a lot and this real life experience gave me goosebumps. Everybody should read it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Perkins",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 15, 2012",
                "reviewTitle": "Sad reading but filled with hope.",
                "reviewText": "I find reading true stories about WW2 absolutely fascinating, especially about people surviving in the face of dreadful adversity. The strength that some people show against absolute cruelty never fails to fill me with total admiration. This book was about a Jewish family who were imprisoned in 2 Concentration camps and their will to survive.A sad but inspiring read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CanEast",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 14, 2021",
                "reviewTitle": "good young peoples book",
                "reviewText": "good history read without too much gore",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 6, 2019",
                "reviewTitle": "Great story",
                "reviewText": "Great book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}