{
    "remaining_requests": 462,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Save-Cat-Writes-Novel-Writing/dp/0399579745",
    "body": {
        "name": "Save the Cat! Writes a Novel: The Last Book On Novel Writing You'll Ever Need",
        "price": "$13.49$13.49",
        "originalPrice": "$16.99",
        "rawPrice": 13.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Save-Cat-Writes-Novel-Writing/dp/0399579745",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71FYfIkskdL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jessica Brody",
            "link": "https://www.amazon.com/Jessica-Brody/e/B001JSCD48/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 5366,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Every novelist should own a copy of this book. It will change the way you think about stories—and your writing. Jessica Brody takes the mystery and frustration out of plotting a novel. I’ll never write another book without a copy of Save the Cat! Writes a Novel.” --Kami Garcia, #1 New York Times best-selling coauthor of Beautiful Creatures and author of Broken Beautiful Hearts \"Good plotters aren't born. They're formed by studying the twists and turns of others' stories. Save the Cat! Writes a Novel is a perfect plot study tool for all levels of writer. It will help you dissect any plot conundrum, conceive your story's blueprint, and give a beat to every pivot of your hero's journey.\" --Grant Faulkner, executive director of National Novel Writing Month and author of Pep Talks for Writers: 52 Insights and Actions to Boost Your Creative Mojo “Through its insightful use of beat sheets, genres, and trade secrets, this book is an invaluable guide through the daunting task of writing a novel.” --Jessica Khoury, author of The Forbidden Wish and Last of Her Name“This playful, illuminating book is a godsend for anyone seeking to understand story structure for novels.”--Emmy Laybourne, author of the international bestselling Monument 14 trilogy, and the novels Sweet, Berserker and Ransacker About the Author JESSICA BRODY worked for MGM Studios as manager of acquisitions and business development before becoming an internationally best-selling author of more than fifteen novels for teens, tweens, and adults including The Geography of Lost Things, The Chaos of Standing Still, A Week of Mondays, and Better You Than Me. She’s also the author of the Descendants: School of Secrets series, based on the hit Disney Channel original movie, Descendants. Her books have been translated and published in over 23 countries and Unremembered and 52 Reasons to Hate My Father are currently being developed for film through Reliance Entertainment by the producers of Zero Dark Thirty and Slumdog Millionaire. She travels the country teaching Save the Cat! workshops to novelists. Excerpt. © Reprinted by permission. All rights reserved. The Beginning . . . So, let’s get this party started. We’ve got a big journey ahead of us, and I, for one, am antsy to get moving.First things first. What do you need? At the very least, you need an idea for a novel. It doesn’t have to be a huge idea. It can be a seed of an idea, it can be a twinkle of an idea. It can even be a character that interests you, or a collection of inspiring thoughts that you hope to somehow string together. Perhaps you’ve got an idea but you don’t know if it’s worth writing. You don’t know if it “has legs” as they say in the film industry. Can it go the distance? Can it really carry you through three hundred-plus pages of prose?Or you might already have a novel fully or partially written that’s not working, that you know you have to revise. Or maybe you’ve started a book and don’t know where it’s going and now you’re stuck and in need of some inspiration.Regardless of your specific situation, I’m excited to have you along for the journey. Here’s a quick breakdown of what we’ll be covering in the following chapters (the structure of this book on structure, if you will): 1. THE HERO: First, in chapter 1, we’ll talk about the main character or “hero” of your story, who they are, and why they are desperately in need of transformation. 2. THE BEATS: In chapter 2, we’ll explore the fifteen beats of the Save the Cat! Beat Sheet in great detail so you can begin to map out the compelling, transformative journey of your novel. 3. THE GENRES: Then, in chapters 3–13, we’ll identify the genre of your story using the ten Save the Cat! story genres. These are not your mother’s genres (sci-fi, drama, comedy, and so on). Instead, the Save the Cat! story genres are broken down by type of character transformation and/or central theme. This will help you further develop your novel and make sure your story contains the necessary “genre ingredients” to make it successful. Also in these chapters, I’ll give you ten beat sheets for popular blockbuster novels (one for each story genre), so you can see how the fifteen beats apply to some of today’s most successful books. 4. THE PITCH: By chapter 14, you’ll have a pretty good idea of what your novel is about, which will help you distill the story down into a one-page description (the synopsis) and furthermore, into a one-sentence description (the logline) that you can use to pitch agents, editors, publishers, readers, and even movie producers. 5. THE FAQ: Despite the awesomeness and thoroughness of the previous chapters, I guarantee you’ll have problems along the way. Which is why, in chapter 15, I give you practical solutions to the six most common problems novelists face when implementing the Save the Cat! methodology. What About the Cat?But wait! We forgot one important thing. The question that I’m sure has been on your mind from the moment you first heard about this book or picked it up in the bookstore.Why on earth is it called “Save the Cat!”?The answer dates back to the original Save the Cat! book, in which Blake Snyder included several cleverly titled tips on how to avoid common pitfalls of storytelling. “Save the cat!” is one of these tips. If your main character starts off somewhat unlikable, then, in the early pages of your story, they should save a cat (yes, like from a tree or a burning building or a shelter), or do something comparable that immediately makes the reader root for them, regardless of their original likability. We’ll talk more about cats and how to save them in chapter 15, when we break down some of the most common problems writers face when implementing the Save the Cat! methodology. Additionally, throughout this book, I’ve included several new tips and tricks specifically for novelists to help you improve your story. So, let’s get on with it already. Your main character is waiting, and they have a huge problem . . . Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 3 hrs 3 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 14 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The first novel-writing guide from the best-selling Save the Cat! story-structure series, which reveals the 15 essential plot points needed to make any novel a success.Novelist Jessica Brody presents a comprehensive story-structure guide for novelists that applies the famed Save the Cat! screenwriting methodology to the world of novel writing. Revealing the 15 \"beats\" (plot points) that comprise a successful story--from the opening image to the finale--this book lays out the Ten Story Genres (Monster in the House; Whydunit; Dude with a Problem) alongside quirky, original insights (Save the Cat; Shard of Glass) to help novelists craft a plot that will captivate--and a novel that will sell. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Ten Speed Press; First Edition (October 9, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0399579745"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0399579745"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.43 x 0.84 x 8.18 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,320 in Books (See Top 100 in Books) #1 in Study & Teaching Reference (Books) #4 in Book Publishing Reference #6 in Fiction Writing Reference (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 5,366 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joleigh Little",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4AJ4PZZM6PLGDBHWDWZQUZ2GQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXQA75FF77YYA?ASIN=0399579745",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Exactly. What. I. Needed.",
                "reviewText": "This book was the most helpful of all the \"how to plot a novel\" books and articles and series of articles I have read. (And there have been many.) It has just enough information and just the right pieces to get you going or to get you unstuck if you are lost at your midpoint as I am. Either this author read my mind in the future and wrote exactly the book I needed to write my own series, or she is just that darn good. (Since she probably doesn't actually time travel or read minds, we'll go with the latter.) I have literally everything I need at my fingertips now to finish. I sat down and devoured this and took notes in one 24 hour period. Highly recommend, You will not be sorry. (Disclaimer: I'm a plotter, so I can only speak from that perspective. I straight up geeked out over the story board diagram and ordered supplies the minute I saw it.) THANK YOU to the author. Oh my goodness, my head is so full of ideas and directions I won't sleep!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AshleyAshley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHG2UK44WR6G6SIFKARBX7KEKVGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3872C8CD2DVPP?ASIN=0399579745",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Must Have for Writers",
                "reviewText": "To all my writers: I STRONGLY RECOMMEND! If you haven’t read this book yet, do so, no matter what stage of the process you’re in.To all my book nerds: if you know a writer, TELL THEM ABOUT THIS BOOK. They will love you forever for it.An epic and thorough writing guide. I cannot stress how important this book is for writers, whether you just have an idea or a full-fledged manuscript. Everything inside is explained simply and concisely. And if you don’t understand a concept, the author gives you an in-depth example.Seriously. A must-have, must-read kind of book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51mCQPsGPeL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ambi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVGMPZPEB5LKIIBQZL74NPBFRDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T3ENIJIZWCSL?ASIN=0399579745",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars A must have for writers!",
                "reviewText": "This book was so helpful in structuring my novel. I love that it gives a “beat sheet” that can be adjusted for any genre, as well as genre specific examples. The perfect addition for new and experienced writers alike!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Summer RainSummer Rain",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHNWMKOOGONYMLFLHSLIZC4GIEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GI6WVIJTE6SQ?ASIN=0399579745",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2021",
                "reviewTitle": "4.0 out of 5 stars Useful for Reference",
                "reviewText": "Save the Cat Writes a Novel is a delightful must read for any writer. Within these pages, I found so many of the base rules and ideas of forming a story that I have always known to be true. Jessica Brody- and in relation, Blake Snyder, the original author of Save the Cat (for screenwriting)- gives a wonderful account of why people read the books they read. Not in genres of horror, fantasy, or romance, but in genres of a much more important sort: the genre of storytelling. For any writer, or reader, these tropes will be quite familiar- from the down and out underdog to the love that encourages change. The theory that any writing can fit into these beats is not just a theory, but utter truth. Even stories that are not the norm, that defies any trope, can be seen here in small, subtle connections.While I find this novel to be accurate, and quite helpful in making the writer think about their stories, I’ve given it a four out of five stars for my personal reading experience. I judge writing craft books on two things: Useful information, and enjoyment in reading.Useful information, this novel has in abundance. I find that I will likely use it as a reference book- something to flick open when I write a new story, to answer the questions within as I figure out where my story fits, or to reference the beats. The beat sheet within will work wonders for the hearts of plotters, though it is a little more in depth than my personal writing style, and that’s okay. This novel isn’t a die-hard blueprint to follow, but more of a guide.However, when it comes to enjoyment of reading, I found myself struggling a little bit. A good amount of this book plots the beat-by-beat process of other novels, putting them into the Save the Cat theory format and showing why it appears again and again in our favorite novels. This is a brilliant way to show an example of the process, but I don’t think it is enticing enough to read again unless there is a specific reason. Thus, along with my lack of interest in the beat sheet, the next time I write a story, I will be pulling open the book and reading the specific chapter of the story genre I’m working with, but I don’t see myself rereading this entire book for quite some time.Overall, I think this book is a good start for an inexperienced writer, or someone who wants to see into the mind of those who study stories for a living. Or perhaps, just to study someone who is more well read than they are, as this novel does have lists upon lists of books that are must reads. I would recommend Save the Cat Writes a Novel to anyone with a writing craft shelf in their library, a staple of the genre, but I would caution your expectations. This is a good textbook to make notes of, but the take-away of information will vary on the experience of the reader.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81BOoAvFJiL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "poto",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3CPC6UPJLBQ6H43PA2FBB7HZKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GM5JJNLW3Z8I?ASIN=0399579745",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Helpful!",
                "reviewText": "Guides you through your writing journey",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa Twombly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSBV6UFKF3TFDKQPUG25PMYVFLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R123GPTX8M49XP?ASIN=0399579745",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Life saver for NaNoWriMo!",
                "reviewText": "Last year was my first NaNo and I opted to keep it simple by prioritizing finishing the 50k words over taking on a novel. I did finish!This year I wanted to do more. Late October snuck up on me and I hunted around on YouTube and found this gem.I LOVE Save the Cat Writes a Novel! Over halfway through this year’s NaNo and I’m finding the approach direct enough to be used as step-by-step instructions and flexible enough to be treated more loosely and still keep me on track, ie you can be a planner or a pantser or a plantser or sinner and still get great value from this book.HIGHLY RECOMMEND!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carolina ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 15, 2024",
                "reviewTitle": "Tem me ajudado muito.",
                "reviewText": "The media could not be loaded. Ainda não terminei, mas me elucidou vários pontos da minha história.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/E17h-np DKL.mp4"
                }
            },
            {
                "reviewerName": "Ana Cristina de la Hoz Madrid",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 9, 2023",
                "reviewTitle": "El mejor manual que leí sobre como estructurar una novela.",
                "reviewText": "Es una metodología que me resultó clara, con ejemplos variados. Me sirvió de verdad para empezar a entender el proceso de estructura de historias, novelas y cuentos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 9, 2023",
                "reviewTitle": "Great purchase",
                "reviewText": "I am loving this book. I've aspired to write a novel for some time but challenged in terms of how to lay my thoughts out to write. I am still in the process of reading the book first but as I write my brain is already writing the story. I hope I'm right but I am feeling confident that this book will be instrumental in me getting my book off the ground.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 12, 2024",
                "reviewTitle": "THE best book if you want to write a novel (Regardless of what stage you're at!)",
                "reviewText": "Simply the best book on Novel writing I have read. I have read many over the years... and frankly, they are usually filled with fluffy encouragement paragraphs. That's not to say they don't have their place. However, THIS book is unlike all the others. THIS ONE IS GOLD. It presents a simple-to-understand story formula. It effortlessly explains why using such a template is NOT a bad thing... and in fact, will 10x your productivity and success. I will have it by my side at all times when writing my novels. Highly recommended for anyone thinking of writing, in the middle of writing or editing a fiction novel of any genre!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lovely_Lila",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 26, 2023",
                "reviewTitle": "DER Schreibratgeber schlechthin, der euch genau dort abholt, wo ihr steht! ♥",
                "reviewText": "ÜbersichtEinzelband oder Reihe: EinzelbandKapitellänge: mittel bis langMeine Rezension“You ‚need‘ a good story. And I’m going to help you get there.“ Seite 2Jedem erfolgreichen Buch liegt eine 15-Punkt-Struktur, bestehend aus wirksamen Schlüsselszenen, zugrunde – egal ob Romance-Bestseller oder Klassiker. Das behauptet und beweist Jessica Brody an konkreten Beispielen und versorgt uns mit einem „Plot-Rezept“, an dem sich Autor:innen sowohl orientieren können, wenn sie gerade ein neues Buch planen, als auch, wenn sie gerade irgendwo in der Mitte feststecken und feststellen: Irgendwas funktioniert hier nicht! Aber was? Und wie kann ich das Problem beheben?Begonnen habe ich dieses Buch, weil ich seit vielen Jahren ein fast fertiges Romantasy-Projekt in meiner Schublade liegen habe. Abgesehen davon, dass ich dieses Projekt mittlerweile stark überarbeiten müsste, weil ich mich natürlich weiterentwickelt habe (gerade aus feministischer Sicht) und es meinen heutigen Ansprüchen nicht mehr gerecht würde, hatte ich immer schon ein großes Problem damit: Ich konnte es einfach nicht beenden. Deshalb habe ich einfach immer weitergeschrieben und das Ende hinausgezögert, weil ich nicht wusste, wie (und wann) man einen guten Schluss verfasst. Um dieses Plot-Problem besser zu verstehen und eventuell lösen zu können, griff ich zu „Save the Cat! Writes a Novel“.Der Aufbau wirkt durchdacht und hat mir gut gefallen: Zuerst geht die Autorin darauf ein, was eine gute Hauptfigur ausmacht, dann erklärt sie die 15-Schritt-Struktur, die ihrer Meinung nach jeder guten Geschichte zugrunde liegt. Im Anschluss bringt sie uns 10 inhaltliche Genres näher (z. B. „Monster in the house“, statt „Horror“) und informiert uns darüber, aus welchen Elementen diese bestehen sollten (z. B. Monster + Haus + Sünde), um die Leser:innen abzuholen, ihre Erwartungen zu erfüllen und sie gut zu unterhalten. Am Ende analysiert sie mit uns Bestseller und Klassiker und zeigt uns, wie diese Struktur in der Praxis aussehen kann. Als Beispiele wählt sie tatsächlich sehr bekannte und erfolgreiche Bücher aus, was für mich das Ganze noch spannender machte, weil ich viel davon schon gelesen und geliebt hatte (zum Beispiel: „Ein ganzes halbes Jahr“, „Die Tribute von Panem“, „Stolz und Vorurteil“). Nicht nur einmal hatte ich während der Lektüre einen Aha-Moment, manches fiel mir wie Schuppen von den Augen! (Passt hier bitte nur auf, dass ihr nicht versehentlich gespoilert werdet, gerade wenn ihr ein bestimmtes Buch noch lesen wollt!)Der Schreibstil enthält eine Prise Humor, ist einfach gehalten, flüssig und verständlich, sodass es für die meisten von euch kein Problem sein dürfte, das Buch wie ich auf Englisch zu lesen. Meiner Meinung nach hat die Autorin nicht zu viel versprochen: „Save the Cat! Writes a Novel“ kann einem in jeder Situation helfen, weil es einem eine Grundstruktur liefert, an der man sich orientieren kann, und weil es verhindert, dass man sich in seiner Geschichte verliert oder zu keinem Ende kommt (wie ich). Außerdem habe ich das Gefühl, dass ich nun ein besseres Verständnis für (zielgerichtete) Plotstrukturen und Höhepunkte habe – sowohl bei meinen eigenen Texten als auch bei Büchern, die ich lese. Nicht selten passiert es mir jetzt, dass ich die von Jessica Brody erwähnten Elemente zufällig entdeckte. Diese Erkenntnisse nehmen dem Lesen aber trotzdem nicht ihren Zauber und ihre Faszination – im Gegenteil, es ist eher so, dass ich einen gut aufgebauten, wendungsreichen Roman nun noch mehr schätzen kann (wenn ich dann merke, dass die Autor:innen sich hier wirklich Gedanken gemacht haben). Meiner Meinung nach ist der vorliegende Schreibratgeber besonders für Anfänger:innen extrem hilfreich und ich werde in Zukunft auf jeden Fall hauptsächlich mit dieser Methode arbeiten – vielleicht sogar nur mehr mit dieser Methode.Mein FazitEgal ob ihr zuerst plottet oder am liebsten einfach mal wild drauflos schreibt – dieser Schreibratgeber holt euch genau dort ab, wo ihr steht, und wird auch euch ein Grundgerüst zum Festhalten liefern, euch bei Problemen weiterhelfen und eure Geschichten besser machen. Von mir gibt es deshalb eine große Leseempfehlung für alle Autor:innen und die, die es werden wollen!BewertungEinstieg: 4 SterneInhalt: 5 Sterne ♥Verständlichkeit: 5 Sterne ♥Schreibstil: 5 Sterne ♥Insgesamt:☆★☆★☆ SterneDieses Buch bekommt von mir fünf Sterne!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}