{
    "remaining_requests": 440,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Spy-Among-Friends-Philby-Betrayal-ebook/dp/B00I7696IG",
    "body": {
        "name": "A Spy Among Friends: Kim Philby and the Great Betrayal",
        "price": "$12.99",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Spy-Among-Friends-Philby-Betrayal-ebook/dp/B00I7696IG",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91BUXxna9zL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ben Macintyre",
            "link": "https://www.amazon.com/Ben-Macintyre/e/B001H6WAL8/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 11481,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER • The epic true story of Kim Philby, the Cold War’s most infamous spy, from the “master storyteller” (San Francisco Chronicle) and author of Prisoners of the Castle.Now an MGM+ series starring Damian Lewis, Guy Pearce, and Anna Maxwell Martin“[A Spy Among Friends] reads like a story by Graham Greene, Ian Fleming, or John le Carré, leavened with a dollop of P. G. Wodehouse.”—Walter Isaacson, New York Times Book ReviewWho was Kim Philby? Those closest to him—like his fellow MI6 officer and best friend since childhood, Nicholas Elliot, and the CIA’s head of counterintelligence, James Jesus Angleton—knew him as a loyal confidant and an unshakeable patriot. Philby was a brilliant and charming man who rose to head Britain’s counterintelligence against the Soviet Union. Together with Elliott and Angleton he stood on the front lines of the Cold War, holding Communism at bay. But he was secretly betraying them both: He was working for the Russians the entire time. Every word uttered in confidence to Philby made its way to Moscow, sinking almost every important Anglo-American spy operation for twenty years and costing hundreds of lives. So how was this cunning double-agent finally exposed? In A Spy Among Friends, Ben Macintyre expertly weaves the heart-pounding tale of how Philby almost got away with it all—and what happened when he was finally unmasked. Based on personal papers and never-before-seen British intelligence files and told with heart-pounding suspense and keen psychological insight, A Spy Among Friends is a fascinating portrait of a Cold War spy and the countrymen who remained willfully blind to his treachery. ONE OF THE BEST BOOKS OF THE YEAR: The New York Times Book Review, The Washington Post, Entertainment Weekly, Shelf Awareness Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=156576011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00I7696IG"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Crown (July 29, 2014)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 29, 2014"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 13948 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 418 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0804136653"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#50,563 in Kindle Store (See Top 100 in Kindle Store) #8 in Biographies of Espionage #10 in History of Russia eBooks #32 in 20th Century World History"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 11,481 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Agent Sonya Operation Mincemeat Agent Zigzag Rogue Heroes The Spy and the Traitor Double Cross Uncovers the true story behind the Cold War’s most intrepid female spy Chronicles the extraordinary story of what happened after British officials planted a dead body behind enemy lines during WWII Fall into this gripping tale of loyalty, love, and the thin and shifting line between fidelity and betrayal, based on recently declassified World War II files The incredible untold story of World War II’s greatest secret fighting force—Britain’s Special Air Force The thrilling tale of Oleg Gordievsky, a Russian double agent whose secret work helped hasten the end of the Cold War The untold story of one of the greatest deceptions of World War II, and of the extraordinary spies who achieved it",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/756a3a03-23fc-4e6b-9680-c066385e5e50.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4648d515-19c3-4d31-a524-7eea6888d570.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/378d490b-8393-443d-a143-bb417033546f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64e23f57-e2a3-4e97-8598-fadfbac47589.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/63479cb7-23e1-4ebd-b9e9-45081d1f8f91.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/494edc58-1b10-4a68-a266-05e45f10e88e.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f85ee07f-f37c-452d-94ba-b362ba8d40f0.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7ce662d-f50a-4e8d-95fc-bf661b3776a7.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0250cfd-eb6f-4ac9-ba7d-4c4f9ee5dc21.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5aadf01c-d1c5-49aa-ac2f-7e20a391f454.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFR63YEA5WV7PKXDXOQEL3EJHCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UJ4CIO2ELT7P?ASIN=B00I7696IG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Macintyre, a spy novel master",
                "reviewText": "This is the 3rd I read from him, once you grab it you can’t put it down. While you read it you have to put in perspective that (even though novelled) these was all true. Fantastic and entertaining book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ju Yang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHREO5UN6DIIPQHT3L4ZXF446SZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SQCTLC0BEP3Y?ASIN=B00I7696IG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 17, 2015",
                "reviewTitle": "4.0 out of 5 stars a good past-time read for some interesting history",
                "reviewText": "I completed the kindle-version of this book within one week. It is a good past-time read, especially if you are NOT professional for any Secret Service in this world but with some curiosity to one of the biggest intelligence dramas in modern history.The book was organized in chronological order, but not as a biography. It did not go into too much details on dry CV details of Kim Philby and Nicolas Elliot, yet touched on all the important elements of their formative university years, family influence and career milestones within MI6. It gave the whole historical incident a new dimension, i.e., via the lens of traditional class-based English upper-class network, and how it has influenced the British Intelligence Service. Most importantly, how this upper-class tribe culture influenced how Philby affair was dealt with. It is not an investigation book looking into those un-answered mysteries, but more a story-teller on how the events had evolved up until Philby's defection to Soviet Union. It has raised some interesting insight on English Oxbridge species in general, such as \"...had an inborn faith in his ability and right to change and rule the world\", how highly intelligent people could be duped if persuaded to believe what they most wanted to believe. According to the author, Philby's story is that of a man in pursuit of ever more exclusive clubs, the belief that somewhere is an exclusive group holding real power and influence. In the end, the passion for this \"Inner Ring\" is responsible in making a man who is not yet a very bad man do very bad things. In other words, motivated by the belief of self-importance (a heritage of his elite education), and self-sustained his ideological certanties, Philby did a great dis-service to his home country. The damage is from the inner circle of British ruling class, which is probably too bitter a pill to swallow for many of his contemporaries with similar backgrounds. The reality is simply incomprehensible to them. Although with some judgment from English perspective (inevitably per the background of the author), the tone of the book is in general matter-of-fact and analytical. You will not find highly emotional charging remarks, or any sided opinion either for MI5 or for MI6 in terms of their handling of the Philby affair.Overall, a good past-time read for an interesting historical incident.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P. T. Greene",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTDEEMIK3LIL3NU2MM3EFWPUSVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R4XPBDBFTTJ?ASIN=B00I7696IG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Astonishing Depth of firsthand accounts",
                "reviewText": "There is everything to like about this account of Philby era. What amazes me is the insight the author gleans from innumerable firsthand accounts and weaves into a first-rate analysis of whether the professed statements and positions of those involved truly hold up. Tremendous read. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Errol Levine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTDKO46AQNTVIHIBMFR5MJ2EX3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LYXKESC8WIHY?ASIN=B00I7696IG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2014",
                "reviewTitle": "5.0 out of 5 stars Kim Philby and the Old Boys' Club",
                "reviewText": "This excellent book by the London journalist, Ben Macintyre, is suspenseful and indeed reads almost like a novel. One has to keep reminding oneself that Kim Philby’s spying for the Soviet Union resulted in hundreds of deaths. Surprisingly, despite the opening of Soviet–era archives in recent years, the book contains no startling new revelations. It does, however, contain much new interesting information about such incidents as “Operation Valuable” (an attempted infiltration of Communist Albania) and Commander Crabb’s attempt to photograph the underside of a warship that brought Comrades Krushschev and Bulganin on a “goodwill” visit to the United Kingdom. Both projects ended in failure due to Kim Philby‘s passing on of information about them to his Soviet handlers.I don’t think I have ever read such a damning indictment of the English upper class as emerges from this book. Even Gilbert and Sullivan could not have invented more eccentric characters. Their names alone are risible. We have, for example, Hester Harriet Marsden-Smedley, a journalist who first casually suggested to Philby that he might want to become involved with the Secret Services. Then there is Sarah Algeria Marjorie Maxse, a Conservative Party panjandrum and a member of MI6, who recruited Philby on the basis of a report from Valentine Vivian (also known as Vee-Vee), the deputy head of MI6, who knew Philby’s father. Vee-Vee gave the quintessential definition of England’s old boys’ network: “I was asked about him, and said I knew his people.”We also encounter the grossly eccentric Hillary St. John Bridger Philby, Kim Philby’s father, who converted to Islam and became an advisor to King Ibn Saud of Saudi Arabia. One can add Helenus Patrick Joseph Milmo a barrister who interrogated Philby and who looks from his photograph like a character out of Gilbert and Sullivan’s “Trial by Jury.” Then there is Sir Hughe Montgomery Knatchbull-Hugesson, His Majesty’s Ambassador to Ankara, who developed the habit of bringing home official papers to the ambassadorial residence where his valet, an Albanian petty criminal by the name of Bazna, was able to copy the documents and pass them on to the Nazis.This book differs from other books about Philby in that it tells the tale through Philby’s relationship with Nicholas Elliott, a Cambridge-educated British spy, who was Philby’s closest friend and strongest defender even after Philby came under suspicion following the flight to Moscow of Donald Maclean and Guy Burgess after Maclean's exposure as a Soviet agent. Mr. Macintyre tries to make a kind of heroic figure out of Elliott. Elliott became Philby’s friend and began to worship him “with a powerful male adoration that was unrequited, unsexual and unstated.” However, it is clear that Elliott was a total dupe and just another eccentric member of the British old boys’ club who overindulged in alcohol and whose main pleasure was the telling of risqué jokes. I do not share Mr. Macintyre’s admiration of Elliott. He did not hesitate during bibulous lunches to relate confidential information to Philby who promptly passed it on to his Soviet handlers.Mr. Macintyre drops only hints here and there as to why he thinks Philby did what he did. He indicates that Philby was not really an idealist who was committed to the Communist cause. For Philby spying was a kind of game and became in the long run a form of addiction. Mr. Macintyre suggests, correctly I think, that Philby’s famous escape to the Soviet Union from Beirut was no accident. He could easily have been prevented from escaping. However, the old boys were not all that anxious for one of their own to be tried publicly at the Old Bailey where their ineptitude would be displayed before the British public. They preferred the matter to remain concealed by the provisions of the Official Secrets Act. They therefore almost pushed Philby into making his escape.It is somewhat galling that Philby went unpunished for his treachery. However, in some respects, his exile to the Soviet Union may have been the best punishment of all. Here was this bon vivant who loved champagne, haute cuisine and every other kind of luxury forced to live in the dull, gray and cheerless atmosphere of Moscow. Sadly for him, there were no posh watering spots such as he was accustomed to frequenting in London. Additionally, Philby was an unwelcome guest and was assigned a minder who was there nominally to protect him, but whose actual job was to monitor his every movement. Guy Burgess suffered a similar fate as amusingly depicted in the short BBC Television film “An Englishman Abroad” by Allan Bennett and starring Coral Browne and Alan Bates.Ben Macintyre relates a story in which there were no good players. Only J. Edgar Hoover, who has a cameo role in the book, emerges as a person with any common sense and that says it all!",
                "reviewVotes": "123 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "taffknight",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 22, 2023",
                "reviewTitle": "quick delivery",
                "reviewText": "Delivered on time. Exactly what I wanted, Good product and very pleased,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 13, 2023",
                "reviewTitle": "Interesting story",
                "reviewText": "I liked it. It is unputdownable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 6, 2022",
                "reviewTitle": "Aremarkable tour de force",
                "reviewText": "The story is impressively researched in great detail covering the lives of Philby and the Cambridge five from the mid '30's to the mid '70's, a span that included seismic changes for the British security services, and of course the nation as a whole. Given that even the protagonists may not have truly recognized their parts and history is always viewed through the historian's lens this may be as close to the 'truth' as we will ever get. Eloquent and moving I can not recommend Ben Macintyre's book too highly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mateus L. R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 17, 2019",
                "reviewTitle": "Uma das vidas mais... idiossincráticas do século XX",
                "reviewText": "Nascido na Índia quando essa ainda atendia por Índia britânica, Kim Philby foi um espião dos mais altos rankings da inteligência britânica. Não à toa, ele se tornou cavaleiro ao receber um OBE na década de 1940, com apenas 34 anos. Servindo ao MI6 por décadas, Philby chegou perto de se tornar o diretor da instituição. Problemas internos o fizeram se demitir do serviço de informações em 1951, quando este passava por forte investigação por parte de seus colegas. Somente nos anos 1960, foi confirmada a temerosa suspeita de que Philby havia sido, por todo esse tempo, um agente duplo que servia tanto à KGB quanto ao NKVD.Por décadas, ele comprometeu colegas, missões e supostos amigos, tornando-se um dos traidores mais famosos da história. \"Para trair, você primeiro precisa pertencer. Eu nunca pertenci\", afirmou ele próximo de sua morte, em 1988. Sua trajetória inclui tragédias familiares e várias esposas. Sempre fiel à União Soviética, Philby passou seus últimos anos em Moscou, supostamente melancólico e desiludido — e embriagado. Repleto de medalhas (e sem arrependimentos), teve um funeral de herói. Ele fazia parte do círculo hoje conhecido como Cambridge Five, cujos agentes duplos haviam sido recrutados ainda antes da Segunda Guerra Mundial.Para quem se interessa por espionagem, Guerra Fria ou pelos romances de John le Carré (que chegou a conhecer Philby), este livro de Ben Macintyre é riquíssimo. Nele, pode-se verificar a maior contradição da vida de Kim Philby: como um sujeito tão ridiculamente inglês se comprometeu com uma causa e uma cultura conhecidas por ele de maneira idealizada, abstrata. Recomendo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pranav Vijayakumar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 16, 2020",
                "reviewTitle": "One of the best Cold War Era Spy books",
                "reviewText": "An amazing book and the way the stories has been potrayed is beautiful. Each chapter ends in a cliffhanger. A must read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}