{
    "remaining_requests": 562,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Only-When-Step-Inspiring-Appalachian/dp/1737049007",
    "body": {
        "name": "Only When I Step On It: One Man's Inspiring Journey to Hike The Appalachian Trail Alone",
        "price": "$13.35$13.35",
        "originalPrice": "",
        "rawPrice": 13.35,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Only-When-Step-Inspiring-Appalachian/dp/1737049007",
        "soldBy": {
            "sellerID": "A27EK23NIPUXRO",
            "name": "glenthebookseller",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A27EK23NIPUXRO"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41NePXERUWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/518 1IiNzaL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Peter E Conti",
            "link": "https://www.amazon.com/Peter-E-Conti/e/B09K5TXFJV/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "glenthebookseller",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1599,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            ""
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 13 mins",
            "$3.98 delivery Tuesday, March 5."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "What if You Could Experience The Thrill of an Epic Voyage Through Insurmountable Obstacles Without Leaving The Comfort of Your Own Home? It was 23 months after his accident and Peter was still dealing with constant excruciating pain.He'd seen dozens of doctors and tried a myriad of medications, but nothing seemed to work. Faced with the impossible choice of suffering through the rest of his life, he had an unlikely epiphany: \"If I could somehow hike 2,000 miles on the Appalachian Trail, then my leg will have to be better.\"He set a starting date three weeks out, cobbled together a novice's pack, and set off on a journey destined to change his life forever—though not exactly how he had envisioned it.From the bleakest breakdowns to hilarious adventures, Peter's story is equal parts entertaining, enthralling, and enlightening.Join him on the trail, one step in front of the other, as he searches for some way to heal his body and soul while struggling with chronic pain, anxiety and depression.Can Reading This Book Really Change Your Life?Discover how to overcome insurmountable obstacles one step at a time.Experience the joy and freedom of hiking the Appalachian Trail (while wrapped up in a blanket at home).Get a boost for your body and soul as you laugh your way through his hilarious antics and adventures.Enjoy the relief you experience as you walk with the author while escaping from your day to day concerns.If you've enjoyed best selling memoirs & biographies by authors like Cheryl Strayed, Bill Bryson, and Grandma Gatewood, then you'll enjoy this inspiring memoir about hiking the Appalachian Trail. If you're struggling to find hope and healing after trauma, you'll find encouragement to get back up. You might even find the courage to give solo travel a try yourself.Scroll Up to Buy NowFrom the bleakest breakdowns to hilarious adventures, Peter's story is equal parts entertaining, enthralling, and enlightening. Join him on the trail, one step in front of the other, in search of healing body and soul. Everyone endures their own hardships in life, but fewer people have the courage to walk alone into the unknown to change it. Peter's stubbornly hopeful pursuit of a better life left me shaken, inspired, and grateful; a thru-hike is now on my bucket list, but so is taking smaller steps towards my dreams today. There's something about his story that sticks with you and makes you think. If he can do that, I can do anything. - Karina MonessonFrom the forward...As a hiker with my own challenges I fell in love with this book. It captures the insanity that I experienced first hand during my time on the trail with the author. I really enjoyed hiking the Appalachian Trail but when I can’t hike, I enjoy reading hiking books before going to bed. This book has elements of trauma recovery just like Cheryl Strayed’s bestselling book Wild, where she decided to hike the Pacific Crest Trail alone. It was after the author shared his inner struggles with anxiety and panic attacks while interweaving hilarious stories reminiscent of Bill Bryson’s bestseller, A Walk in The Woods, that I realized I can’t put it down. After I finish reading this for the third time (yes, it’s that good!) it’s going on the shelf right between my two other all time favorite page turner novels, John Grisham’s The Judge’s List and The Boys by Ron Howard. Don’t let the title make you think this is a foot injury story - it’s an amazing journey from the depths of the author’s heart and soul. - Gail “Dr Fix-it” Hinshaw - Author of Katahdin or Bust: Increasing Your Odds of Enjoying Hiking or BackpackingScroll Up to Buy Now",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Biographies & Memoirs",
                "link": "https://www.amazon.com/Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2"
            },
            {
                "name": "Professionals & Academics",
                "link": "https://www.amazon.com/Professionals-Academics-Biographies-Memoirs-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2419"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Adversity Press (October 19, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 466 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1737049007"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1737049005"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.3 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1.05 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#48,221 in Books (See Top 100 in Books) #13 in Walking (Books) #36 in Camping (Books) #79 in Hiking & Camping Excursion Guides (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,599 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Get Ready for an Exciting Read That'll Leave You Feeling Inspired ! I'd been injured for two years and had tried everything to stop the chronic pain. Then I thought - \"If I hiked the Appalachian Trail then my leg would HAVE to be better\" This wild and wacky adventure led to healing my body and soul. Read this and get motivated to take on challenges of ANY size!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/8d858c60-eb84-42d7-ab30-b927f865cbd1.__CR0,0,3368,1042_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "“Your Best Life is Waiting For You Right Now, All You Need To Do is Reach Out And Grab It” A Walk in The Woods... My initial plan was to heal my leg by walking from Georgia to Maine. While doing this, the healing power of the wilderness gently caressed my body and soul. Listening to Loons on The Lake... Life on the Appalachian Trail is simple as you carry everything you need on your back. Nights are spent in a tent, shelters along the trail, or at nearby hiker hostels. Each Day a New Challenge... Hiking the Appalachian Trail is like any big challenge you may face. Each day brings new mountains to climb. Focus on your next few steps and you really can make your dreams come true.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/e2e221d2-fedb-4642-ad72-dfe23929bb14.__CR0,0,2448,2448_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/50872adb-bd03-4bec-a956-b2b60a4e8cde.__CR0,0,2448,2448_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/a550d538-27aa-4a19-96f6-907a2c99d3ee.__CR0,0,1600,1600_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/8d858c60-eb84-42d7-ab30-b927f865cbd1.__CR0,0,3368,1042_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/e2e221d2-fedb-4642-ad72-dfe23929bb14.__CR0,0,2448,2448_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/50872adb-bd03-4bec-a956-b2b60a4e8cde.__CR0,0,2448,2448_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/a550d538-27aa-4a19-96f6-907a2c99d3ee.__CR0,0,1600,1600_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Martin K. Chambers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHA5AJTUDLTUMA4BAFK2DG7V4TCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHQTM8ZXU27U?ASIN=1737049007",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Extremely good book. Very entertaining and very inspiring. Well written.",
                "reviewText": "I highly recommend this book. Living near the southern trailhead of the AT I have hiked sections of it my entire life. Its truly amazing to me that John had the willpower and drive to hike through the steepest sections with severe chronic pain. I have a dear friend who through hiked to trail 30 years ago who is about to attempt it again with severe chronic back pain this time around. I am sending him this book before he sets out again in March. Thank you Peter for writing this book. It is truly an inspiration!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josh Mcnally",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQRRE4OG3AP4XBIIAFWX7AUKW7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8SVOD4RT9NIH?ASIN=1737049007",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars This book is amazing",
                "reviewText": "I bought this book for my mom and she loves this book about the Appalachian trail my mom said it is amazing and I believe that everybody who loves to read books would definitely enjoy this especially if you like the Appalachian trail you will definitely enjoy this book it will get you wanting to hike the Appalachian trail even if you can't this book will push you to do it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelly Carlson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEG4W6P3YRAFK45BMLFKOUFFVWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C2UDX8ERYMOG?ASIN=1737049007",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars I was sad for the book to end!",
                "reviewText": "I am fascinated with learning about the Appalachian Trail so I really enjoyed this book. It was a motivating story. He was able to hike the entire trail despite a very serious prior leg injury and chronic pain. He took his time, broke it into manageable days, and made accommodations that worked for his personal situation. I would have loved to have learned even more details about the experience. I have so many more questions about how to accomplish this journey. I feel like I could sit down with him and interview him for days. I will probably continue to read more books about the Appalachian Trail to learn even more. I truly enjoyed going on the journey with him and was sad to finish the book!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L. Callen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKUEYJGDH4YJGA7V3Y4NRD4EVCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31H65L5CR15X3?ASIN=1737049007",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Was Skeptical, but Found it Fun and Engaging",
                "reviewText": "Started the book thinking how easily the narrative could go down a multitude of rabbit holes. I very quickly discovered that the author's hard work and multiple rewrites paid off quite well. The book is a well balanced and artful blend of courage and introspection.The day to day struggles managing a major disability while dealing with the immense difficulty of logistics on a 2200 mile \"walk\" was an amazing feat. I particularly admired his courage to admit to readers of his almost daily doubts on the choice to put himself through all the suffering as an alternate means of Physical Therapy. This book truly deserves a spot in the top Thru Hiker Narratives. Very Inspirational!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Powell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFCHHLBZLOBGI54C2A4CAZLQBQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4T2CF2EYBCWJ?ASIN=1737049007",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars A good read for those interested in the Appalachian trail",
                "reviewText": "A brave and unconventional hike up the Appalachian trail by a person with permanent leg injuries. I liked the story and the author’s unique way of leapfrogging up the trail using his car as a base. A bit of a twist on the more normal thruhiker experience. Also has the benefit of a back story of adversity which the author overcame in clever ways.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Surreal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3G4OWWCCDMF2RREOM3TRUMJYZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CT18EZCU5LMF?ASIN=1737049007",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Insprirational, wry humor, incredible.",
                "reviewText": "This book story was amazing, thoughtful, witty, and so insighful. Anyone facing an major challenge, mentally, physically, emotionaly will benefit from the read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cardiff",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERU7UXJQT7VYJEN7N7NOFQERJJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36E3R82KL8CKI?ASIN=1737049007",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "3.0 out of 5 stars I'd like to give this author 5 stars on his perseverance on finishing the AT with his disability",
                "reviewText": "I'd like to give this author 5 stars on his perseverance on finishing the AT with his disability, but I had a hard time with his writing in general that made it difficult for me to really love the book in a 5 star manner. He mentioned his injury in detail multiple (did I say multiple?) times and why he had to finish this trail as if we never read it before. I also found delivery on humorous events not very funny, so my criteria for a book that I would recommend to others are: It has to be well written. It has to make me laugh out loud and it has to make me cry. That didn’t happen. I wish him the best in his life and continued healing!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gina B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWPH5IY6BTYYTVUWVM6RS6LGLSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LTR84D9KN2DB?ASIN=1737049007",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Inspiring",
                "reviewText": "I've read a lot of books about Appalachian Trail experiences, and I found this one to be one of the most inspiring. It was really a very good story about perseverance and overcoming struggles. I subtracted one star because I think it just needed a little more editing. For example, the name of the shelter near the top of Mount Rogers in Virginia is Thomas ( not Thompson ) Knob. It was a good read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shannon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 5, 2023",
                "reviewTitle": "Great read!",
                "reviewText": "Loved this book, as someone with a disability I can relate with the struggles one goes through. Your grit,determination, and focus is admiring. I hope one day I will complete a thru hike until then I will enjoy reading everyone's journey's.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 14, 2023",
                "reviewTitle": "What an amazing story",
                "reviewText": "Such a life and how inspiring. I am suffering pain but nothing like as persistant or frightful as yours. Hope in adversity with lovely descriptions of nature as well makes it a real page turner. Glad there is hope at the end. Keep on going. Bless you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 23, 2023",
                "reviewTitle": "Great book",
                "reviewText": "Not the first hiking book I've read about the Appalachian Trail, but certainly the first I've read that's been written by someone with a physical ailment. I'm glad the author took so long to write the book because it tied up loose ends. I enjoyed the descriptions of places and people, and found the photos excellent at conveying the moments he was talking about.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gail F.Gail F.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 14, 2022",
                "reviewTitle": "Really Enjoyed This Book",
                "reviewText": "I thought this was a great book for many reasons. I appreciated this fellow's honesty and humor as well as his persistence, resilience, and dogged determination. His story held my interest from the first page to the last page as I hiked the trail with him. The book is a true inspiration for anyone regardless of what problems they are facing. Good stuff:))",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/21a3gzy1FvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. D. O'GARA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 29, 2023",
                "reviewTitle": "Inspiring stuff",
                "reviewText": "Well written story about dealing with pain. Mr Conti engages the reader a draws you into his journey, hiking the Appalachian trail being fully fit is an achievement, doing it with a dodgy leg takes real courage. This is a real life story without any fancy embellishments, with a sprinkling of interesting Trail facts. Throughly enjoyed this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}