{
    "remaining_requests": 701,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/They-Called-Enemy-George-Takei/dp/1603094504",
    "body": {
        "name": "They Called Us Enemy",
        "price": "$13.25$13.25",
        "originalPrice": "",
        "rawPrice": 13.25,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/They-Called-Enemy-George-Takei/dp/1603094504",
        "soldBy": {
            "sellerID": "A28AGZ3CZL8KIM",
            "name": "Corax Books",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A28AGZ3CZL8KIM&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41YV3aM8QlL.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/71FMWx5PVZL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "George Takei",
            "link": "https://www.amazon.com/George-Takei/e/B001KE4BZK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Corax Books",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 5345,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 31 mins",
            "FREE delivery March 2 - 11 on orders shipped by Amazon over $35",
            "Or fastest delivery March 1 - 7"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Top Shelf Productions; First Edition (July 16, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 208 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1603094504"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1603094504"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 9+ years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN680L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 10 - 12"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.5 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.63 x 0.6 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,036 in Books (See Top 100 in Books) #2 in Biographies & History Graphic Novels #3 in Asian & Asian Americans Biographies #169 in Memoirs (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 5,345 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "George Takei is known worldwide for playing Hikaru Sulu on Star Trek: The Original Series. But Takei's story goes where few have gone before. After a childhood spent in Japanese American internment camps during WWII, he has become a leading figure in the fight for social justice and LGBTQ rights. Mashable named him the most influential person on Facebook, with 10.4 million likes and 2.8 million Twitter followers. Justin Eisinger is an award-winning author and editor, with more than fifteen years experience in graphic storytelling. His next nonfiction series, WE BUILT IT!, is coming in 2024 from Chronicle Books. Steven Scott has worked in comics since 2010, and has written for Archie, Arcana Studios, and Heavy Metal, among others. Artist Harmony Becker has created Himawari Share, Love Potion, and Anemone and Catharus. Part of a multicultural family, she has lived in South Korea and Japan.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/249949f3-4100-4acc-8e36-67150780c4b1._CR266,0,1059,1059_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d965167b-b3a5-4c76-a603-d807c6320ba6.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/11d26e3b-26e1-49fa-b8e2-2b6b09462de0.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a000a885-7754-4605-bf96-fb02fa0b60aa.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c6e1a799-ddf5-417a-b5c7-d33cf1d15d09.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/249949f3-4100-4acc-8e36-67150780c4b1._CR266,0,1059,1059_PT0_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TN",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGV5R3DDD2KQSEQQSV6WEBVLO4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YRGJR5730HY2?ASIN=1603094504",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Five Stars Goes to the Book & the Seller!",
                "reviewText": "The book's author is George Takei, who played Mr. Sulu in Star Trek. The story is about the experiences in the Japanese internment camps and the background of its history. My father was PWO in the Soviets during World War II, but he survived. During his life, he seldom talked about his experiences, and I often thought he had alcoholism. I didn't know. Mr. Takei's experience recalled my father's, and I felt incredibly guilty about my lack of understanding of the pain that my father had carried for the rest of his life. You may genuinely try to comprehend how the people in the period might have felt, but acknowledging the background of history is paramount and almost a duty to those who passed away.By the way, the book's condition was as the seller described. I was delighted to find some people who are still honest and trustworthy. There is still hope in America. Thank you very much!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3MMGV4EFJIMFXCJNWS3NUOALWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B355CXQ2ZJTZ?ASIN=1603094504",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Important reading",
                "reviewText": "For adults and the education of our children this is important reading. The comic book format makes it an easy read but adds the visuals for added emotional understanding. My grandchildren will all be exposed to this book. It's a chapter in our history that all should be aware of and protect us from ever repeating.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nabeel Mohammed",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGSFJLRLX72NVIR2OD6GR7O22FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3461G07FOUZMI?ASIN=1603094504",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Heartfelt and affecting",
                "reviewText": "A painful and stark reminder of the worst of humanity and of finding the way forward out of it. A must read in times where understanding is needed and an important memoir that will remain important always.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Garrison Haines-Temons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3UZEMAPM6QKH43B5QX6JXHU6ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8ABVZPPKY9TQ?ASIN=1603094504",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2020",
                "reviewTitle": "5.0 out of 5 stars Open Your Eyes!",
                "reviewText": "In 1942, over 120,000 Japanese-Americans were taken away from their homes and placed into dingy prison camps all over the US. They did nothing wrong, but had none of the legal means to prove it to the racist authorities. They were paying for the sins of their home country after the Pearl Harbor bombing. Classic ignorant thinking at its worst: because a small minority of the group committed the crime, the entire group is guilty. George Takei spent most of his tender childhood living under this kind of oppression as he and his family were among the Japanese-American families locked up in internment camps. Reading about this shameful experience through his eyes makes everything that much more heartbreaking. His young mind couldn’t comprehend the ignorance of those in charge. He tried to make sense of the barbed wire enclosures, deplorable conditions, and abusive army guards. Fast forward into adulthood and George Takei does everything in his power as an equal rights activist and Hollywood actor to make sure this terrifying history doesn’t happen again.This graphic novel is nothing short of a brutally honest look into the politics of fear. Powerful politicians will use their influence and charisma to rile up their supporters into believing that the less fortunate are what’s wrong with this country. We saw it with the Japanese internment in George Takei’s book and we’re seeing it today with the Muslim ban, the family separation policy at the Mexican border, and black people getting harsher treatment from law enforcement than whites. The one thing we learn from history is that we learn nothing from history. But it doesn’t have to be this way. This book has the power to educate its readers. When you familiarize yourself with your fellow world citizens, you’re less likely to judge them. That’s what “They Called Us Enemy” means to me and that’s one of the reasons it’s getting a perfect five out of five stars. The more educated we are, the better off we’ll be. That means leaving behind comfortable bigotry and thinking about what it’s like to be the other guy, which is often a horrifying reality.But of course, there will always be those contrarians out there who say, “It wasn’t all that bad!” These same people say it about black slavery, they call Mexican border detention centers “Summer Camp”, and they’ll no doubt say it about Japanese internment camps. Having guaranteed living conditions doesn’t mean those conditions are necessarily good. Did I mention the barbed wire fencing around the camps? Did I mention the abusive treatment from the soldiers? What about the fact that George Takei’s family had to live in a horse stall that smelled like rancid feces? What about the infighting among Japanese prisoners who joined the military to prove their patriotism and the prisoners who stayed in the camps to protest? Had enough harsh reality? But wait, there’s one more juicy detail: institutionalization. Some prisoners were so familiar with the routine life of the camps that they couldn’t imagine getting back on their feet in a normal society. Now imagine a child as young as George Takei feeling that way upon leaving the camp. You get to see all of this through the author’s eyes whether you want to or not. It won’t be pleasant, but it’ll be a necessary kick in the butt for the apathetic and fearful.Despite the shortness and quick pacing of the book, you will feel as though you’ve taken an entire US history course in one sitting. Let this be a message to you all. Treat your neighbors with kindness and respect. Treat your inferiors with the same level of understanding and love. If you see an injustice happening, don’t stay quiet. Be the activist you were meant to become. Be a passionate enough voice in this battle for equality that those in power will have no choice but to listen. Let your words haunt them like schizophrenic ghosts. Will this change anything? Let me put it this way: we don’t have a choice but to activate our activism. The world can’t survive without making progressive leaps and bounds. That is the nature of time. Any questions?",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "decentandre",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGROSIXYCSBB76VDRAHX2XFMQ6DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R246VU577313WQ?ASIN=1603094504",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Good read",
                "reviewText": "Bought for a high school class, a very good read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shulamit Widawsky",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCVCNOMIWCT6LOD625WVQXTLMAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G92RB691BSHI?ASIN=1603094504",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 18, 2020",
                "reviewTitle": "4.0 out of 5 stars Not just for kids.",
                "reviewText": "The black and white art and the style of the illustrations may initially seem simplistic or even childish, but they actually are reflecting the era (1940's) and an interweaving of Japanese and American illustration style (with some contemporary touches).The fact that there were Japanese internment camps may be something you know, but this book will give you a more emotional view of this embarrassing passage in recent American history.George Takei takes us through his personal experience of the camps, from when he first arrives as a young boy, and then the reader experiences the growing awareness young George experiences, as he matures over time in the camps.As a teen, we watch as he grows angry with his father for not standing up better against the mistreatment, but the book continues and shows us how as a grownup he comes to appreciate better what his father did, with limited options.This is not an autobiography in the regular sense, because even though George Takei is the main character, and it is written from his point of view, the center of the story considers what it means to real people when Democracy gives way to fear, as it did with the American Japanese during WWII.The book does touch on other aspects of the author's life, mentions Star Trek, and a few other things, but these are only included as they reflect ways American culture recovered from that dark period.If you are looking for a fully fleshed out autobiography of George Takei, or if you are looking for a nonfiction book about the Japanese internment in the U.S., you will be disappointed. If you are looking for a good, fast read, centered around a human being you already know something about, as a way to learn about the experiences of the internment, and the emotional situation both from the people in the camps and the emotions leading to what happened to Japanese Americans at that time, this book is for you.4 stars instead of 5 because there were a few passages that were hard to follow. I realize the book was carefully edited to be as succinct and direct as possible, but sometime I would have appreciated a few more frames to clarify the scene.This book is easily read by teens and adults. Probably appropriate for middle school students, though they may need someone to help them understand some of the political background (the book leaves a lot to the reader to know). Younger readers won't struggle with the vocabulary if they are old enough to read chapter books. But they won't understand the events, and they won't understand the importance of how George changes as he ages.Some adults may be inclined to not pay attention to the illustrations. Don't skip them, they're not superfluous. They help with the setting in a way that the sparse text intentionally leaves to the art in both style and content.\"They Called Us Enemy\" is a worthwhile read for the story, the history, and the example of the son coming to terms with his father with love, tenderness, and respect.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Danoff-Burg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEJWRCSE33IA46NL3JHJC22B77A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZS2FNSI5DO0I?ASIN=1603094504",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars A really touching and instructive story",
                "reviewText": "I was surprisingly touched and moves by this amazingly well written and beautifully illustrated story. Thank you Mr. Takei and team for bringing this important chapter of our nation's history to the fore.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan D. Valentine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQIG35FMGWZ2PKJPGF36UOZ5OGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30OL4MY13RGJK?ASIN=1603094504",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Should be required reading",
                "reviewText": "At a time when so much of our ugly history is denied or sugarcoated, this easily digestible graphic novel should be required reading for American students.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donatello",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 21, 2024",
                "reviewTitle": "Evergreen",
                "reviewText": "The story remains evergreen with just a change of characters. It tells a story untold and fits perfectly of what is going on in the world even now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JoyLuck",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 24, 2022",
                "reviewTitle": "Important history to share with young",
                "reviewText": "Important history of racial injustice is important to share to young people and this form of literature makes it accessible and palatable. Based on the actor‘s own personal experience, it is an important eye witness account.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ignacio S. R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 22, 2019",
                "reviewTitle": "Fascinante",
                "reviewText": "Una historia conmovedora que rescata un episodio poco conocido de la historia de Estados Unidos y cómo la memoria de los japo-americanos se concilia con su pasado reciente.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ardeear",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 28, 2020",
                "reviewTitle": "Going Boldly",
                "reviewText": "George Takei is many things: as an actor he is most readily associated with being Mr Sulu on ‘Star Trek’ but his pan-Asian helmsman from the USS Enterprise is only a fraction of the story. A social rights campaigner for much of his adult life, Mr Sulu was an early sign of success for a young Takei, being a positive Asian character on American TV at a time when Japanese-Americans (and, pretty much anyone of non-Caucasian heritage) were not usually treated at all kindly by the ‘white majority’.The role gave Takei recognition and the springboard to further LGBT+ rights as well as the opportunity to address injustices around the internment of Japanese-Americans during WWII.While, as a UK reader of ‘They Called Us Enemy’, certain nuisances of the US constitution left me a little cold, the human story behind the treatment of a whole swathe of people - purely due to their racial heritage - is powerfully told and, as the book itself points out, the resonances in recent American history - given the actions of Trump - remain deeply concerning.Takei’s an inspiring individual who draws greatly on the inspiration of his own parents and, in particular, his father. This book is also an inspiration, illuminating an aspect of American history about which I had little awareness. It is also about more than one moment in history and how one set of people were treated during it, it makes it clear that this one episode is part of a wider continuum about the choices individuals and states make in treating people and their communities with respect and fairness. It also serves as a warning that advances in civil rights are rarely uniform and enduring: they ebb and flow. Gains, once made, cannot be assumed to be forever - far from it - and states can take decades rectifying wrongs. Rights need fighting for day-by-day so that they are maintained, something Takei does not flinch from, whether here or in his daily life and, for that, I commend him, his work and this book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anita DiCastri",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 23, 2019",
                "reviewTitle": "Stunning",
                "reviewText": "I bought this for my 12 year old son, who (like the rest of our family) is interested in the history of The Second World War. He read it in a few days and insisted I put my own book down and read it right after he finished. I found it a surprising mix of feel-good warmth and devastation. George Takei does a wonderful job of portraying how a strong and loving family can find joy in the most trying of circumstances. The descriptions of those trying circumstances brought tears to my eyes more than once. This mix of emotions is heightened by the very talented illustrations of Harmony Becker. Beautifully done, well worth the read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.88",
                "sellerName": "ACORN BOOKS",
                "sellerRating": "5"
            },
            {
                "price": "$11.87",
                "sellerName": "ZBK Books",
                "sellerRating": "4.5"
            }
        ]
    }
}