{
    "remaining_requests": 511,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Outlining-Novel-Workbook-Step-Step/dp/0985780428",
    "body": {
        "name": "Outlining Your Novel Workbook: Step-by-Step Exercises for Planning Your Best Book (Helping Writers Become Authors)",
        "price": "$11.79$11.79$6.54$6.54$11.79",
        "originalPrice": "",
        "rawPrice": 11.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Outlining-Novel-Workbook-Step-Step/dp/0985780428",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61H2+iD2izL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "K.M. Weiland",
            "link": "https://www.amazon.com/K-M-Weiland/e/B002RCXQ00/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by -OnTimeBooks- and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1069,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            ""
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs 8 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 10 hrs 23 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Monday, February 19. Order within 14 hrs 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Learn How to Make Your First Draft Easy!Award-winning author K.M. Weiland’s previous book, the bestselling Outlining Your Novel, showed writers how to embrace outlines in a way that makes the writing process fun, inspiring, and easy.Now it’s time to put those lessons to use! Building upon the principles you’ve already learned, the Outlining Your Novel Workbook presents a guided approach to getting the bones of your story down on paper, identifying plot holes, and brainstorming exciting new possibilities.Containing hundreds of incisive questions and imagination-revving exercises, this valuable resource will show you how to:Create your own personalized outlining processBrainstorm premise and plot ideasDiscover your charactersChoose and create the right settingsOrganize your scenesAnd so much more!This accessible and streamlined workbook will empower you to create a powerful outline—and an outstanding novel.Start writing your best book today!",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ PenForASword; Workbook edition (November 12, 2014)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 142 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0985780428"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0985780425"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 7.5 x 0.32 x 9.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#94,192 in Books (See Top 100 in Books) #128 in Words, Language & Grammar Reference #180 in Writing Skill Reference (Books) #277 in Fiction Writing Reference (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,069 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marcie Seidel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERLGNSL5HZO55NDYXKMKX5LFLEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HNFU5EQHJAYH?ASIN=0985780428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent book outline workbook!",
                "reviewText": "To say this book is useful doesn’t do it enough justice. KM Weiland instruction is very helpful, expert and clear. She does not get lost in academic literary references that often lose sight of first level intent, but keeps the focus on learning, and progressing in the technique and skill of outlining your novel. It is a like attending a writers master course from the comfort of your home. I also adore the fact that Ms Weiland offers a very thorough weekly podcast, newsletter and invites email questions that addresses all issues regarding your writing ✍🏻 kudos KM Weiland!A lifeline in the writers journey.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jayme Pilgram",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4NBVOPVTVUU4L7TH55K2DGYVQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4DV7HP6HBUDA?ASIN=0985780428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars My stuff",
                "reviewText": "I really love it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ARHuelsenbeck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG5ADSURYJDEQDWHIND5NBLWWFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4EG3VOHRJ8H2?ASIN=0985780428",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2016",
                "reviewTitle": "4.0 out of 5 stars She suggests exercises that help you brainstorm in specific ways.",
                "reviewText": "I love K.M. Weiland’s blog, Helping Writers Become Authors, with its helpful articles on the craft of fiction. I also loved her book, Dreamlander. So it’s reasonable that I would buy her Outlining Your Novel Workbook: Step-by-Step Exercises for Planning Your Best Book, the companion to her manual, Outlining Your Novel: Map Your Way to Success.I am a person who gets into trouble when I try to write by the seat of my pants. I really need to plan out my story pretty much from beginning to end—not that I won’t follow any brilliant idea that comes to me spontaneously, but just so that my plot doesn’t die from the dreaded lack of destination. Without an outline, my characters just wander around aimlessly until they hit a dead end.In the past, I’ve used The Writer’s Journey: Mythic Structure for Storytellers and Screenwriters by Christopher Vogler with its archtypes and twelve stages to outline my novels, but it’s only taken me so far.Since NaNoWriMo of November 2014, I’ve been struggling to get my (hopefully) first publishable novel, The Unicornologist, into shape. It was missing something, but I couldn’t figure out what. I decided to take it through the steps in Weiland’s book after the fact to figure out where the holes in the manuscript were. She suggests exercises that help you brainstorm in specific ways. For example:Ask yourself every “what if” question that pops to mind regarding your story. Some of your ideas will be ridiculous; most will probably never make it into your book. But don’t censor yourself. By allowing yourself to write down every idea, no matter how crazy, you may come up with story-transforming gems.Weiland uses illustrations from her own books and others’ to explain what makes plot compelling. She asks questions that make you dig deeper into your characters:Ґ What Lie does your character believe that is keeping him from the Thing He Needs while prompting him to believe he must gain the Thing He Wants?Ґ How can your protagonist demonstrate determination?Ґ How can your protagonist show kindness to others?I have used questionnaires to build dossiers on my characters, but I don’t really like questionnaires, because so many of the questions seem immaterial to my story. (My main character’s favorite color really doesn’t come into play in my mystical fantasy.) Weiland includes “interview” questions, and many of them don’t help me. However, the questions like the ones quoted above make me think about the characters’ personalities and visualize their actions and help me figure out how to portray them.Weiland has authors focus on six important aspects of their novels: premise, scenes, character backstories and interviews, setting (including world building, if necessary), story elements, and structure.Every writer has to find his own approach to outlining (or else do without, as Stephen King and many other successful storytellers have). Rather than reinvent the wheel, as it were, most of us try out multiple approaches and keep the aspects that work for our projects. Reading through Outlining Your Novel Workbook in tandem with revising my work-in-progress did help me find holes in my story, and add detail and emotional impact to my scenes. I will use many parts of it for outlining my future stories, but I will probably skip over the parts that don’t apply to my story or resonate with me.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darlene Vaughn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVZEF7EAXJ3DTS2YTAT4U4GJPKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UUNEZCFRQ640?ASIN=0985780428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Outlining your novel",
                "reviewText": "Book is exactly what I was looking for to help learn on what I need to know.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kat Bar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGWMJ4BYPJVLU23Z6CH3CDL2TBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CPJELIF0UE7T?ASIN=0985780428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy to follow",
                "reviewText": "As a fellow author, I love how easy this book is to follow. I am a details kind of gal, so I love how detailed this is too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jamie Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY6KJMMWDO7WQPJDN24KQAMFWMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE9N3L3EIEGXT?ASIN=0985780428",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 12, 2016",
                "reviewTitle": "5.0 out of 5 stars Fear not, pantsers of the world",
                "reviewText": "I'm a fan of KM's writing advice; she is always very insightful on the art of storytelling. I've always been a hybrid \"pantser\" (I make up the story by the seat of my pants) and planner (I know where the story is going). I usually know points A, M, and Z in a story, and sometimes I know the set pieces that occur at G and T. How do I get to those points? That's where the pantsing comes in.To the pantsers, don't be afraid of this book. She includes details in here about worldbuilding, which is something you do want to plan. It's nice to not have to get out of the zone in order to work out details about your world, like how the magic works or whether or not certain innovations existed in the time period you're writing about. Plus, I find that research adds to the plotting, sending me off in new directions. If you use Scrivener (highly recommended), get over to KM's site and grab her Scrivener template, which includes Patricia Wrede's worldbuilding \"questions to think about.\" She links to Wrede in this book, in case you don't have Scrivener.One more thing to the pantsers -- I often start writing, (Point A to G) then start loosely outlining how I'm getting from G to M. Often this is the part where I work out character motivations and what their arcs will be, now that I've gotten to know them a bit. Weiland addresses the characters in this workbook, too. When I'm finished with the story, I like to use outlining as a way of working out the pacing or figuring out if I've dropped a thread I need to tie off. Don't think of outlining as a straitjacket; this workbook is designed to aid creativity, not suppress it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AW Freeman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3ZBNWAB2CEO7VXESKDDZJQHQUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RND8BTGZHDB8D?ASIN=0985780428",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2023",
                "reviewTitle": "3.0 out of 5 stars It’s fine for what it is but entirely unnecessary for a writer",
                "reviewText": "If you have no idea what to do to write, this is an alright starter workbook, I guess. It’s the kind of thing I could have made entirely on my own though. I’ve encountered nothing in this workbook that makes it essential or even all that helpful in terms of fleshing out my story/novel concepts or plot beats. It just kind of is. I worked through a few early pages with fidelity in hopes that I would find it more helpful than I was guessing it would be when I first received it and actually got to look at it, but it was just basic stuff that I had already long figured out on my writing journey. Conversations with trusted writers and friends have been infinitely more helpful to my process, and they didn’t cost a dime. It’s not a bad workbook per se, but I don’t know how this would be of use to someone who knows anything about writing already going into their process of writing.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marlène Keefe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2024",
                "reviewTitle": "Good practice",
                "reviewText": "Exactly what I expected and hoped for.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Louise",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 7, 2023",
                "reviewTitle": "I recommend these books to anyone writing a novel",
                "reviewText": "All I can say is I wish I had these books a year ago, they've really helped me organise my writing, well written and easy to follow. I can finally see my writing becoming a novel. Thanks K.M Weiland. 😀",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 13, 2018",
                "reviewTitle": "Outlines, indispensable.",
                "reviewText": "Another great contribution to my working day. Thaks Ms. Weiland!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris Radge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 29, 2021",
                "reviewTitle": "An excellent resource",
                "reviewText": "As a group of like minded people, I thought it pertinent to start a brand new style of book club. A 'How to' book club. We have a wide variety of writers and genres at different levels. Each attendee gained many idea's and understanding to take away from this book and the opportunity to use the work book was invaluable. This book also reinforced what we have been teaching for over six years now at the RWR Rainforest Writing Retreat in Australia, and writer now have an excellent resource to revisit if they ever get stuck. I do have to say, I love the 'Ask the Authors' section and checklists at the end of each chapter. I highly recommend this tool for the aspiring writer.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 25, 2015",
                "reviewTitle": "Excelente!",
                "reviewText": "Excelente! Eu estava escrevendo um livro sem qualquer direcionamento e o Outlining simplificou o processo, fazendo escrever um resumo do que acontece em cada capítulo até o fim da estória, o que não me prende ao que escrevi nos resumos, mas me ajudou a mapear todo o caminho a percorrer. Acho que fica mais fácil quando se sabe onde vai. Recomendo a quem gosta de escrever!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$14.99",
                "sellerName": "HBBC STORE",
                "sellerRating": "4.5"
            },
            {
                "price": "$11.00",
                "sellerName": "24 HOURS SHIPPER-BOOK",
                "sellerRating": "5"
            },
            {
                "price": "$12.77",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            }
        ]
    }
}