{
    "remaining_requests": 467,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sapiens-Graphic-History-Pillars-Civilization/dp/0063212234",
    "body": {
        "name": "Sapiens: A Graphic History, Volume 2: The Pillars of Civilization (Sapiens: A Graphic History, 2)",
        "price": "$16.41$16.41",
        "originalPrice": "$27.99",
        "rawPrice": 16.41,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sapiens-Graphic-History-Pillars-Civilization/dp/0063212234",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81wN3RhexHS._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Yuval Noah Harari",
            "link": "https://www.amazon.com/Yuval-Noah-Harari/e/B00J21BCIW/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1342,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"A skillfully entertaining education.....Throughout, the authors seek to present a concise rendering of the full march of humankind and point out elements that are fictionalized, misrepresented, or exaggerated—and show how those elements have shaped human behavior, norms, and mores. \" — Kirkus Reviews (starred review) About the Author Prof. Yuval Noah Harari, bestselling historian and philosopher, is considered one of the world’s most influential intellectuals today. His popular books—including Sapiens: A Brief History of Humankind; Homo Deus: A Brief History of Tomorrow; 21 Lessons for the 21st Century; and the series Sapiens: A Graphic History and Unstoppable Us—have sold more than 45 million copies in 65 languages. Harari co-founded Sapienship, a social impact company with projects in the fields of education and storytelling, whose main goal is to focus the public conversation on the most important global challenges facing the world today. Harari has a PhD in history from the University of Oxford and currently lectures in the department of history at the Hebrew University of Jerusalem."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 4 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 14 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NATIONAL BESTSELLERThis second volume of Sapiens: A Graphic History, the full-color graphic adaptation of Yuval Noah Harari’s #1 New York Times bestseller, focuses on the Agricultural Revolution—when humans fell into a trap we’ve yet to escape: working harder and harder with diminishing returns.What if humanity’s major woes—war, plague, famine and inequality—originated 12,000 years ago, when Homo sapiens converted from nomads to settlers, in pursuit of the fantasy of productivity and efficiency? What if by seeking to control plants and animals, humans ended up being controlled by kings, priests, and Kafkaesque bureaucracy? Volume 2 of Sapiens: A Graphic History–The Pillars of Civilization explores a crucial chapter in human development: the Agricultural Revolution. This is the story of how wheat took over the world; how an unlikely marriage between a god and a bureaucrat created the first empires; and how war, plague, famine, and inequality became an intractable feature of the human condition.But it’s not all doom and gloom with this book’s cast of entertaining characters and colorful humorous scenes. Yuval, Zoe, Prof. Saraswati, Cindy and Bill (now farmers), Detective Lopez, and Dr. Fiction, all introduced in Volume 1, once again travel the length and breadth of human history, this time investigating the impact the Agricultural Revolution has had on our species. The cunning Mephisto shows them how to ensnare humans, King Hammurabi lays down the law, and Confucius explains harmonious society. The origins of modern farming are introduced through Elizabethan tragedy; the changing fortunes of domesticated plants and animals are tracked in the columns of the Daily Business News; the story of urbanization is portrayed as a travel brochure, offering discount journeys to ancient Babylon and China; and the history of inequality unfolds in a superhero detective story; with guest appearances by historical and cultural personalities throughout such as Thomas Jefferson, Scarlett O'Hara, Margaret Thatcher, and John Lennon.Sapiens: A Graphic History, Volume 2 is a radical, witty and colorful retelling of the story of humankind for adults and young adults, and can be read on its own or in sequence with Volume I. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Harper Perennial; First American Edition (October 26, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 256 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0063212234"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0063212237"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.04 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 8.18 x 0.88 x 10.89 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,812 in Books (See Top 100 in Books) #4 in Historical & Biographical Fiction Graphic Novels #9 in Graphic Novel Adaptations #36 in History of Civilization & Culture"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,342 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Sapiens: A Brief History of Humankind Sapiens: A Graphic History, Vol. 1 Sapiens: A Graphic History, Vol. 2 Homo Deus: A Brief History of Tomorrow Sapiens: A Brief History of Humankind explores what it means to be 'human,' and the ways that biology and history have defined us. Featuring 256 pages of full-color illustrations and easy-to-understand text covering the first part of the full-length original edition, Sapiens: A Brief History of Humankind. This second volume of Sapiens: A Graphic History focuses on the Agricultural Revolution—when humans fell into a trap we’ve yet to escape: working harder and harder with diminishing returns. Harari turning his focus toward humanity’s future, and our quest to upgrade humans into gods.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/6ca0a399-0ffb-492d-b1d5-74e325e829a6.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e87c7b85-dd9b-4601-b115-3348035ed3a0.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/059ce0c1-f07c-4ab4-b0da-a425c0ddfb4c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a20ec5b-bdb1-4b39-a0ff-7b4587e85e35.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Raymond Lee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNJLPTVFENEIB5GIVZMO5S6FZ5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYLTLRVYNQACE?ASIN=0063212234",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Wake up call!",
                "reviewText": "Remember that many of our beliefs are fictions and it can be changed, peacefully. A good second part to the already great first part.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DB reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHLIWTBLXHMJGWHZJBOZN6TON2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8784OXFV533O?ASIN=0063212234",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2021",
                "reviewTitle": "5.0 out of 5 stars Myth, Revolution, and Intersubjectivity",
                "reviewText": "Volume 1 of Sapiens’ graphic history was released in the last year, and it was excellent. Vol 2 doesn’t disappoint. It has two main topics: the agrarian revolution and the idea that human-created myths pull society together, sometimes more than we care to admit to. Without myths, though, we have no cohesive society. Intersubjectivity is a critical thought in this volume insofar that humans share mutual trusts, such as money, religion, etc.Myths can be changed to the betterment of society, in general, such as the feminist movement over the last 100 years. No wars were fought, for example, yet a hugely positive change occurred. Harari goes into several other myths, but I’ll let you check out the volume for yourself.The best things about these volumes: the graphic novel format and the larger paper size. It is easy to hold in your hands, and the artwork, while not exceptional, offers a clear picture of what is being discussed, which is all that is necessary.Highly recommended.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ty Brady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF45K6JMFNMDL3D3CWFPAAFTFTVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y7B25ASCM9S6?ASIN=0063212234",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 26, 2022",
                "reviewTitle": "5.0 out of 5 stars Superb!!!",
                "reviewText": "It's kind of a reality changing book. I thoroughly enjoyed it. Just get it already! Be sure to get both volumes.Warning though, do not buy the Kindle version. They scanned two pages at once and the text is just too small to read. There are a couple of times that an illustration in the book takes two pages, I guess that's why they scanned it two pages at a time.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "debra meyers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF4HFAWXJPCPZ5QHNSBPS6YGUPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WFW3AZGSY734?ASIN=0063212234",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 30, 2022",
                "reviewTitle": "5.0 out of 5 stars Bought it for my granddaughter",
                "reviewText": "I bought Sapiens the graphic novel for my 11 year old granddaughter. I read her a few pages each night she’s here and explain all the concepts as we go along. It’s a great introduction to the origins of civilizations, social hierarchies, racism, and other social constructions. Very complex ideas presented in digestible nuggets with pictures that engage an 11 year old.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vinay kumar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIV7OZZN4ZDFZB2KAAP3ZAXMPBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SSE1MHW5GMUV?ASIN=0063212234",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2022",
                "reviewTitle": "4.0 out of 5 stars good one",
                "reviewText": "I thoroughly enjoyed the book, since it made me think about a bunch of things from first principles.I agree with the author on few ideas he discussed.* Any species success criteria should not be based on its population quantity or its multiplying criteria* Luxury trap / Consumerism* Domestication of animals* Discrimination* Imagined orders* Origins of writingI have one point which i disagree on:Hunter gatherer society vs Agricultural revolutionAuthor is a fan of hunter gatherer society and not of agricultural revolution. He is bewildered as to why humans have selected agriculture path over the previous. Well, I almost bought his theory until I started thinking deeply about it.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric W. Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZG2NTORGBTKGQ7NYSDZXMMT2YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS14KCXZHSA75?ASIN=0063212234",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2022",
                "reviewTitle": "5.0 out of 5 stars What cultural beliefs do we have today that have no real basis? Sapiens highlights our misbeliefs!",
                "reviewText": "Sapiens Volume 2 highlights cultural beliefs that we live by and never question. These are the very beliefs that are now in the process of dissolving. These are the beliefs that are causing so much turmoil in today's society because so many of us won't let go of yesterday and accept what our culture now deems to be truth! This is an easy and entertaining read as well as being very thought provoking.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nav J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDXVIOSJZFJQ5KFMFTZXXHAT22Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R262ZZLOUTUTHG?ASIN=0063212234",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 12, 2022",
                "reviewTitle": "5.0 out of 5 stars Bought this for my son, who really loves it.",
                "reviewText": "It's often hard to find books for my son, who is a pre-teen and reads at an advanced level. He loved this book (and its predecessor) and read it cover to cover in a single setting. Can't wait for the next one to come out!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Harriet Anaya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4TKFCEPKUWXKBMQJUWTGAYEQ2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2483Y5PR2CJCU?ASIN=0063212234",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent book.",
                "reviewText": "The book arrived in a timely manner and in perfect condition. I really enjoyed it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 17, 2022",
                "reviewTitle": "AMAZING",
                "reviewText": "Graphic History teaches while gives you power to make a better world ❤️. Congratulations to all the people envolved. Amazing!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David MC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 18, 2022",
                "reviewTitle": "Muy bueno para niños/adolescentes.",
                "reviewText": "Es un muy buen libro que se vuelve muy accesible para niños y adolescentes. Está muy bien hecho y no pierde la calidad del libro original.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonathan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 10, 2021",
                "reviewTitle": "Very cool walk through history",
                "reviewText": "I'm still reading it, and it's a long book/comic, which is a good thing. It's so cool to see how the history of humanity un-raveled. Puts your life in perspective.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shivam Shivam ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 12, 2024",
                "reviewTitle": "Great purchase",
                "reviewText": "The book was in great condition after I opened the package the page quality is also good. I always liked reading comics and manga type book so this book was great for me to understand our history.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/715N3+MLJQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714F0DMFblL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philip",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 5, 2022",
                "reviewTitle": "Colourful second volume",
                "reviewText": "Great follow up to first volume. Makes the complex accessible",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}