{
    "remaining_requests": 669,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hear-What-Eddie-Gein-Done/dp/1949889041",
    "body": {
        "name": "Did You Hear What Eddie Gein Done?",
        "price": "$26.99$26.99$16.34$16.34",
        "originalPrice": "$29.99",
        "rawPrice": 26.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hear-What-Eddie-Gein-Done/dp/1949889041",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41o1rM9AtTL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41nWiGIiBjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31guv-utEsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31TW6NsakkL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Eric Powell",
            "link": "https://www.amazon.com/Eric-Powell/e/B00MN2MR0E/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Power Enterprises KC and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 925,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review BOOKLIST -- True-crime writer Schechter teams up with acclaimed comic-book artist Powell in this thoroughly researched account of Ed Gein, the notorious murderer who inspired the horror icon Norman Bates (and others). Schechter and Powell start there, with a portly Alfred Hitchcock setting the scene. Then, they cover Gein's childhood under the thumb of his puritanical, misogynistic, and violently oppressive mother; the investigation into his crimes; and the trial that led to his lifelong incarceration. Powell's soft, realistic art, in a green-tinged grayscale recalling the aesthetic quality of Hitchcock's black-and-white films, renders faces beautifully, keeping them distinct and recognizable even as they age over the decades-long timeframe of the book, and though there's plenty of gruesomeness, he only toes the line of luridness (an inevitability, for sure, in any book about Gein). While Schechter and Powell necessarily spend plenty of time on Gein, they don't dwell sensationally on the horrors of his crimes but turn their attention to his impact not only on the culture but, importantly, on the lives of his neighbors. A natural choice for true-crime fans. Review “Eric Powell and Harold Schechter team up to tell the true story of Ed Gein in a unique format for true crime. I can't wait!”―John Carpenter (Director of Halloween, The Thing)\"It is fantastic! Not only is Eric Powell's art on point, but Harold Schechter introduces some new ideas about Ed Gein that have never been heard.\" - THE LAST PODCAST ON THE LEFT\"As extensively researched as the Alan Moore/Eddie Campbell Jack the Ripper graphic novel From Hell, \"Did You Hear What Eddie Gein Done?\" is a masterpiece of the form, standing as the best possible dramatization of Ed Gein's tale in any medium.\" -BLOODY DISGUSTING\"This is a new true crime comics essential.\" - SYFY WIRE\"Nightmarish.\"―PUBLISHERS WEEKLY“As extensively researched as the Alan Moore/Eddie Campbell Jack the Ripper graphic novel From Hell, ”Did You Hear What Eddie Gein Done?” is a masterpiece of the form, standing as the best possible dramatization of Ed Gein's tale in any medium.”―BLOODY DISGUSTING About the Author Eric Powell is a writer and artist from Nashville Tennessee who has contributed work for every major publisher in the comics industry. In 1999 Eric launched his critically acclaimed creator owned series THE GOON. In 2002 Eric Launched ALBATROSS EXPLODING FUNNYBOOKS in an effort to keep the Goon alive when no other publisher wanted it because it was too 'different'. But the readers spoke and the Goon quickly became an indy hit and picked up a diehard cult following. The Goon found a home and a wider audience with DARK HORSE COMICS, but Eric continued to publish creator owned comics through Albatross such as his all ages comic CHIMICHANGA and Rebecca Sugar’s PUG DAVIS. Eric has spent his career creating and promoting the validity and importance of creator owned comics through Albatross and other publishers such as Dark Horse and Image Comics.In 2016 Eric rededicated himself in earnest to his publishing company, ALBATROSS FUNNYBOOKS, and launched his new fantasy series HILLBILLY, his kid's horror anthology SPOOK HOUSE, as well as other creator owned titles.Eric has been working in collaboration with acclaimed director David Fincher, Tim Miller, and Blur Studios to bring the Goon to life on the big screen as an animated feature film.Awards:• International Horror Guild: 2004 Best Illustrated Narrative• Will Eisner Comic Industry Award: 2004 Best Single Issue (Goon #1)• Will Eisner Comic Industry Award: 2005 Best Humor Publication• Will Eisner Comic Industry Award: 2005 Best Continuing Series• Will Eisner Comic Industry Award: 2008 Best Writer/Artist-Humor• Will Eisner Comic Industry Award: 2008 Best Painter or Multimedia Artist Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 15 hrs 27 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 15 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“It is fantastic! Not only is Eric Powell's art on point, but Harold Schechter introduces some new ideas about Ed Gein that have never been heard.” - THE LAST PODCAST ON THE LEFT“A natural choice for true-crime fans.”―BOOKLIST“As extensively researched as the Alan Moore/Eddie Campbell Jack the Ripper graphic novel From Hell, ”Did You Hear What Eddie Gein Done?” is a masterpiece of the form, standing as the best possible dramatization of Ed Gein's tale in any medium.”―BLOODY DISGUSTING“This is a new true crime comics essential.”―SYFY WIREOne of the greats in the field of true crime literature, Harold Schechter (Deviant, The Serial Killer Files, Hell's Princess), teams with five-time Eisner Award-winning graphic novelist Eric Powell (The Goon, Big Man Plans, Hillbilly) to bring you the tale of one of the most notoriously deranged serial killers in American history, Ed Gein.Did You Hear What Eddie Gein Done? is an in-depth exploration of the Gein family and what led to the creation of the necrophile who haunted the dreams of 1950s America and inspired such films as Psycho, The Texas Chainsaw Massacre and The Silence of the Lambs.Painstakingly researched and illustrated, Schechter and Powell's true crime graphic novel takes the Gein story out of the realms of exploitation and gives the reader a fact-based dramatization of these tragic, psychotic and heartbreaking events. Because, in this case, the truth needs no embellishment to be horrifying.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9"
            },
            {
                "name": "Americas",
                "link": "https://www.amazon.com/Americas-History-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4808"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Albatross Funnybooks (August 24, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 224 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1949889041"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1949889048"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 16 years and up"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.16 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.3 x 0.76 x 9.3 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#129,163 in Books (See Top 100 in Books) #297 in Mystery Graphic Novels #374 in Serial Killers True Accounts #699 in Horror Manga (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 925 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Robert Canipe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZZB4JZNTVFXANOI7D27DDFPGSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37ZULZLLZCAJ8?ASIN=1949889041",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Marvelous",
                "reviewText": "Great read. Art reminds me of the old Erie comic magazines rather than EC Comics. I recommend it for anyone interested in Gein.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAYC5K4AWWJPON4HYMFL3D5W3NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ILULY6ZN7ZRT?ASIN=1949889041",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2021",
                "reviewTitle": "5.0 out of 5 stars In one word : Brilliant",
                "reviewText": "Don't miss this ! Even if you're not a big \"Gein fan\" , this work is outstanding (both text and art). It should win an Eisner, if there's any justice.I never bought any of Eric Powell's previous works, because the character design of The Goon looked too 'cartoon-ey' for my tastes. His art here is lovely (despite the morbid and gruesome nature of the subject matter) as well as pretty realistic, with exaggerations only as needed to convey emotion. Lovely, moody black and white with 'gray wash' ... Superlative, but I thought pp 96-97, where the sheriff's flashlights can only illuminate small circles of space in the blackness, to be particularly effective, and pp 146-150, wherein Powell tries to take the reader into Gein's mind and his fantasies. The way Gein's pop culture tastes shaped his fantasy world reminded me of Peter Vronsky's comments on how \"men's adventure magazines\" affected him as a child.Harold Schechter's Deviant is a book I've read and reread too many times to count. I was a little concerned that this would be basically just a GN adaptation of a work I already own, but it is far beyond that, and I appreciate the research that went into this, as shown by the appendices. I especially like pp 86-92, which very effectively convey the Eisenhower Era. And the decision to jump from Augusta Gein's death to the murder of Bernice Worden and its aftermath, and then to recount what happened in the year's between as a flashback/retrospective worked quite well.PSA : When I reread Deviant, there are some paragraphs I avoid : Murder, grave robbing, necrophilia-? Eh... Animal abuse/caninocide-? Unbearable. If you're the same way (*and I was dreading that event's recounting*) avoid pp75-76. Otherwise : This is a book not to be missed .",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rosekrystofolski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXN2FBXER2SIL4IDI6PTKZKNRMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BTAWF9KXIHY6?ASIN=1949889041",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Wonderful graphic novel about the Ed Gein Case",
                "reviewText": "Wonderful Graphic Novel about The 1957 Ed Gein murder case in Plainfield, Wisconsin. This is only the second true crime graphic novel that I have read, I really enjoyed it. Apparently it was written by Harold Schechter and drawn by Eric Powell and both of them did a wonderful job on this book. I very highly recommend this for anyone interested in true crime or just in The Gein Case will really enjoy this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Comics Appreciation Project",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH74W5HKKUU4ATDNSACSSQHSE3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M7GPPJCN5R9D?ASIN=1949889041",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2022",
                "reviewTitle": "5.0 out of 5 stars A gripping, intense, guilty pleasure.",
                "reviewText": "I became aware of this spectacular piece of work after Chris Piers with ComicTropes gave it such high praise as the #2 on his top ten list of 2021. The book was also recently nominated for three Ringo Awards for (1) Best Cartoonist - Writer and Artist, (2) Best Original Graphic Novel, and (3) Best Non-fiction Comic Work. I am hardly a fan of the horror genre, but I found this book as a gripping, intense, guilty pleasure. I was in awe of the of raw dark graphic storytelling by Schechter and Powell. Put it on your top shelf (away from children).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John™",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG22EOEWJCGW5WTD5SFSCK7U4LBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13HZ4F75CS7RF?ASIN=1949889041",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 22, 2022",
                "reviewTitle": "5.0 out of 5 stars Detailed without sensationalism.",
                "reviewText": "A detailed account of Ed Gein's childhood and possible mental state from that time until his death, including what may have motivated him to commit the ghoulish acts that have appalled so many (and inspired horror enthusiasts). While much is conjecture, it is based on firsthand accounts and source material where available. The author takes care to propose a feasible psychiatric profile.This is a serious work that avoids cheap scares. Yes, there is horrific imagery, but not to the degree one would expect from such a ghastly tale. Both the author and illustrator are serious and sober in their story telling.It is a quick read, but well worth the price.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXNCDDIENSWZ2XY7MCDWHLAYVGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NL3KC70Z2D7H?ASIN=1949889041",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 15, 2022",
                "reviewTitle": "4.0 out of 5 stars Nice way to display the case of Ed Gein!",
                "reviewText": "I am a super visual person so this graphic was a superb choice for me. I loved how this book cleared up much of the false information out there and clarified what actually happened.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frank 'Bowzer' RizzoFrank 'Bowzer' Rizzo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7PA5KD2ZYGVZADIOJY65DRQFDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUWI1O0YO0O54?ASIN=1949889041",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2021",
                "reviewTitle": "5.0 out of 5 stars Could not put it down!",
                "reviewText": "The media could not be loaded. To be honest I pre ordered as soon as I saw Eric Powell was involved. I knew it would be good, but this was amazing! Well researched, impeccably drawn/painted, and the story was told in a perfect pace! The little hints and homages were great as well. It truly gives a different viewpoint of a serial killer and delves into the PSYCHOLOGY of it all and the nature vs nurture and environmental stresses, the evils of society, the dangers of over zealous religion, alcoholism, and other topics! 5/5 ! I hope the make this 1st in a long series of studies! Informative, but creative and interesting.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1+L-kDL9MS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1xZPa9sLDS.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d502eb19-5c9d-488c-8d5d-4533a00cebd4/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Miss Platinum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF75MODKEM7XA7ILSNWTNZFPLJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FT732M99P59I?ASIN=1949889041",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2021",
                "reviewTitle": "5.0 out of 5 stars Absolutely Fantastic!",
                "reviewText": "I heard about this book during pre-release while listening to the guys on Last Podcast on the Left. Once received, I dove right in. The assessment of facts based on the research paired with the gorgeous art just made this an absolute winner in my book. It took me about an hour to get through the entirety— and it left me completely satisfied but then wanting the next installment to explore another famed killer. I would love to see more graphic novels by these folks outlining the essentials of the notorious characters that make up the fringe of our society. If there is an art to this topic— these guys figured it out. Absolutely A+++.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lore fdz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 31, 2022",
                "reviewTitle": "Excellent",
                "reviewText": "Excellent book. I loved it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John W",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 3, 2022",
                "reviewTitle": "Fantastic",
                "reviewText": "Well, it was a fantastic graphic novel interpretation of the actual story. There is some brevity of actions and events.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephania Fernandes Alvarez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 15, 2021",
                "reviewTitle": "*****",
                "reviewText": "awesome!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miguel Jorge de Campos Cruz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 3, 2022",
                "reviewTitle": "The authors found the right tone.",
                "reviewText": "Very good work. Right tone for an unpleasent theme, Nice artwork, sensible treatment of scenes and perspectives.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NachoB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 21, 2022",
                "reviewTitle": "Interesting story",
                "reviewText": "Good story, good art.If you like psychology crime books, don't hesitate",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$22.23",
                "sellerName": "allnewbooks",
                "sellerRating": "4.5"
            }
        ]
    }
}