{
    "remaining_requests": 526,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Nathan-Hales-Hazardous-Tales-Donner/dp/1419708562",
    "body": {
        "name": "Nathan Hale's Hazardous Tales: Donner Dinner Party",
        "price": "$7.69",
        "originalPrice": "",
        "rawPrice": 7.69,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Nathan-Hales-Hazardous-Tales-Donner/dp/1419708562",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/912s-qyFASL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Nathan Hale",
            "link": "https://www.amazon.com/Nathan-Hale/e/B001IXMWVI/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1145,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews From Booklist Hale, still narrating juicy history tales (after One Dead Spy, 2011) with the help of a British soldier and an effusive, bumbling executioner, tells the harrowing story of the ill-fated Donner party. Beginning with their departure from Springfield, Illinois, in 1846, Hale depicts the party’s progress in small but clear panels and includes lots of factual details, such as a roster of everyone in the party, how they died, and a helpful map showing just how tantalizingly close they came to California before meeting their grisly end. It’s a difficult story, and Hale makes ­allowances for sensitive readers: “Horrible things are going to happen. If you are easily upset, skip ahead.” But despite the gruesome facts, Hale keeps it relatively light and lifts the mood with some much-needed humor, thanks in no small part to the over-the-top executioner—who, for instance, is outrageously sensitive to the death of cute and fuzzy animals but surprisingly nonchalant about cannibalism. This informative graphic novel capitalizes on enticingly gross history to great effect, balancing raw facts with strong storytelling. Grades 3-6. --Sarah Hunter Review \"This informative graphic novel capitalizes on enticingly gross history to great effect, balancing raw facts with strong storytelling.\"―Booklist About the Author Nathan Hale is the #1 New York Times bestselling author and illustrator of the Nathan Hale’s Hazardous Tales series. He also wrote and illustrated the graphic novels One Trick Pony and Apocalypse Taco. Hale lives in Utah, and you can find him online. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 2 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In author-illustrator Nathan Hale’s Donner Dinner Party, discover the shocking and true story of the ill-fated expedition in this Hazardous Tale from the New York Times bestselling graphic novel series. “These books are, quite simply, brilliant. . . . Thrilling, bloody, action-packed stories from American history.” —New York Times In the spring of 1846, a group of families left Illinois and began the long journey toward a new life in California. To save time, they took an ill-advised shortcut—with disastrous consequences. Their story would not take them to California but into history. Bad weather, bad choices, and just plain bad luck forced the pioneers to spend a long, cold winter in the mountains, slowly starving. What they did to stay alive and the lengths that others went to in order to rescue them make this one of the most tragic and infamous stories of the American frontier. Nathan Hale’s Hazardous Tales take young readers into American history with graphic novels that bring the dangerous, bloody, exciting history of America to life. The Revolutionary War and the Civil War, World War I and World War II, the Donner Party, the Marquis de Lafayette, Harriet Tubman, the Alamo, and more all come to life in a way that will excite young readers of history. Nathan Hale’s Hazardous Tales! Read them all—if you dare!One Dead Spy: A Revolutionary War Tale (#1)Big Bad Ironclad!: A Civil War Tale (#2)Donner Dinner Party: A Pioneer Tale (#3)Treaties, Trenches, Mud, and Blood: A World War I Tale (#4)The Underground Abductor: An Abolitionist Tale about Harriet Tubman (#5)Alamo All-Stars: A Texas Tale (#6)Raid of No Return: A World War II Tale of the Doolittle Raid (#7)Lafayette!: A Revolutionary War Tale (#8)Major Impossible: A Grand Canyon Tale (#9)Blades of Freedom: A Tale of Haiti, Napoleon, and the Louisiana Purchase (#10)Cold War Correspondent: A Korean War Tale (#11)Above the Trenches: A WWI Flying Ace Tale (#12)",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Historical-Fiction-Childrens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2917"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Harry N. Abrams; Illustrated edition (August 6, 2013)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 128 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1419708562"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1419708565"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 11 years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN330L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 3 - 7"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.3 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.75 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#19,966 in Books (See Top 100 in Books) #13 in Children's American History of 1800s #15 in Children's History Comics #57 in Children's General Humor Books"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,145 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/315c3828-d01e-42b6-bfc6-f05d1117ef59.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f20dfc4e-2858-404d-b1d8-a9a8ee9f432a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64f17216-d9b9-4ae3-bad9-ca646c0562b7.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/360d1fac-eae6-437e-b1c4-42aaaff259ba.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08813440-0c0d-42a7-be2c-7f7fbae69e3d.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b2d93e79-95b0-4fc8-8674-4d920f4d6601.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Quinn Rollins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYDMHIML5QKBYESLJOVML27CZXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13EMOO7O3K6NI?ASIN=1419708562",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 5, 2015",
                "reviewTitle": "5.0 out of 5 stars Retelling a tragic chapter of American history for kids? Sounds risky. But Hale does it.",
                "reviewText": "2012 saw the debut of a new line of children's history books, told in graphic novel format. The books are written and illustrated by a guy with the historically fortuitous name Nathan Hale. Taking a cue from his own name, Mr. Hale has the books narrated by the historic Nathan Hale, executed by the British for espionage in 1776. Nathan Hale, his own Hangman, and the British Provost form a kind of triad narrator, chiming in with their own opinions and asides as the historic tales unfold. The first two books were One Dead Spy, telling Nathan Hale's own story as part of the American Revolution, and Big Bad Ironclad about the first ironclad ships used in the American Civil War. The third book just came out in 2013, and I've read it a few times, and recommended it to every teacher and parent and history buff I can find. And now you.With a title like \"Donner Dinner Party,\" I'm guessing adults will cringe, and kids will um...eat it up. The book tells the story of the doomed Donner-Reed Party, who was traveling from the midwest to California in 1846. As with the previous two books, \"Donner Dinner Part\"y is about more than just that expedition, but about Westward Expansion on the whole--in brings in information about the Black Hawk War, the Gold Rush, the Oregon Trail and Mormon pioneers, and just how dangerous it was for any group to move west, not just the Donner Party.From the first chapter, Hale establishes that James Reed is something of a buffoon, pretentious and preening, and making foolish choices. He's able to do that in a fairly even-handed way, balancing the foolishness with the sort of \"pioneering spirit\" that we like to think Americans have. Reed, one of the leaders of the Donner-Reed Party, will be a source of comic relief--but also a serious threat--for much of the book. In Chapter 2, Reed leads his group of wagons into a serious blunder: following the Hastings Cutoff. A shortcut promoted by Lansford Hastings, who had never even been on the route he was touting, it's probably what caused the death of so many in the Donner-Reed Party. Instead of following the well-traveled path of the Oregon Trail, it led them through the mountains of Utah and the deserts of the Great Basin (including the Great Salt Lake Desert), some of the least hospitable land in the entire continent.The first dramatic death is Billy the Pony, The Hangman, who loves cute little animals (even though his career is executing men) is sure \"he went and found a nice meadow to live in. Right?\" But Nathan Hale tells him, \"Billy most likely ended up as dinner for someone farther down the wagon train. Fresh meat shouldn't be wasted.\" The Hangman responds with a full page \"NOOOOOOOO!!\", his fingers clenched, his face a rictus of horror. It's a nice way of letting the reader experience the emotion, but also laugh at themselves a little, and eases the tension a little...because things are going to get much worse.There are several places where Nathan Hale (the narrator) warns the reader that this isn't a happy story, and things are going to get worse. He even tells us that we can skip ahead to page 113 if we want to get away from the worst of it. But of course, we don't.When you hear the phrase \"Donner Party,\" besides thinking of cannibalism, you probably think of a small group of people. A two-page spread on pages 42-43 shows us how many people there really were, and how the 81 of them were arranged in groups of ten families, with nineteen wagons, each with four oxen needed to pull it. It's one of the many times in these books where the pictures really help to understand the story, and even though I've read several books about the Donner Party, this one ended up being one of the better ones.Once the group is stranded in the Sierra Nevada mountains, the deaths start coming quickly. Hale (the author/illustrator) uses the classic Grim Reaper imagery to show the taking of lives, and is somehow able to let the reader experience the grief and the solemnity of being forced to cannibalize the flesh of someone who's died without being too horrific about it. It's not graphic, but it's still disturbing. Even then, when it gets to the cannibalism, the Hangman is able to bring a little bit of humor--but also a reality of life in the past--that we often overlook in discussions of The Donner-Reed Party. I won't spoil what it was, but it's on page 104, if you're looking.As a history teacher, one of the things I love about these books is that Hale tells you about the research that he does in order to write the books. He includes tools found in other (non graphic novel) history books, like a good bibliography, biographies of major characters in the book, and questions that might be raised while you're reading the book. In this case, there are also a few one-page mini comics that explain some of those. A case in point: one boy who was a part of the Donner-Reed Party, William Hook, actually died from overeating. Hale explains how that happened. There's also a two-page \"Who Died and Who Survived\" chart that looks almost like a periodic table of everyone in the party, including how they died and whether or not they were eaten after they died. It's a little creepy, a little morbid, but not as disturbing as you'd expect. Another part of the appendix is a one page story \"By the Hangman\" that made me laugh out loud...and does some healing for those who were too saddened or traumatized by the story of the Donner-Reed Party, and needed to cleanse their palate.This book, like the first two in this series, is fantastic. It makes for good reading, it's historically valid, and it's able to tell a very serious story in a way that's informative and entertaining. I was wondering if Hale would be able to tell such a tragic story without making light of the people involved, and he does so admirably. I loved this book. You don't need to read the first two in the series to understand why the historic Nathan Hale and his executioners are narrating a Donner Party story, but the characters do get more interesting over the course of the books. Whether you're a kid or adult, whether you like history, or are morbidly curious about one of the most famous tragedies in the American West, you'll probably enjoy \"Donner Dinner Party.\" Bring the dessert.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGML3NXJKJF4IZWYSYYNOR7YB2IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBPMS645UHJ5A?ASIN=1419708562",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Cool series",
                "reviewText": "This is a cool series of books. My son has been really into these from his school library, but the library doesn't have this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicola Mansfield",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4FTBOOAMNQG7SCHR4ORGAX7BKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA6CXJUKRRQDA?ASIN=1419708562",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 10, 2015",
                "reviewTitle": "5.0 out of 5 stars My Favourite!",
                "reviewText": "I have to say this is my absolute favourite of the NHHT series so far! I have to say I was quite curious how he was going to keep the humour going with such a topic as the Donner Party. But just read the title and you can tell he takes an irreverent stance to keep this book funny, and probably the funniest of the lot. The author does become irreverent but, as a Catholic, I never thought he went over the line. It's a difficult subject to discuss without being judgemental and Hale has managed it. In fact, he's gone the other direction and suggests that cannibalism was/is a normal human response under such dire circumstances. But only one of his main characters feels this way, the other two have the normal human response of disgust. I think he's done the Donner Party justice and treated them respectfully. He doesn't focus on the cannibalism (hardly even using the word) but on the whole journey, the pig-headedness of Reed in using the shortcut and the final survival and rescue. In fact, we come away from the book just realizing how many actually safely made it home and the acts of bravery that some members unthinkingly committed. Of course, the story is full of violence and murder too. Just make sure you know this story well before handing it to a young or sensitive child and while I thoroughly enjoyed the humour I would caution that some may find this topic unsettling or offensive in this comedic setting. I love this series! On to book 4!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. Anderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWFM63ULZZJMDAG46MN6XWHQBEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34FUDSH8PAY67?ASIN=1419708562",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2013",
                "reviewTitle": "5.0 out of 5 stars Another great book in this series!",
                "reviewText": "I picked up One Dead Spy from my local library on a whim after seeing it on a shelf. That night my 9 year old son, who is not a big reader and had shown no particular interest in history, stayed up until 11pm to read the entire book! He refused to go to sleep until he got to the end! For the next several weeks he would talk about Nathan Hale and the American Revolution. He was just as excited and enjoyed the second book One Bad Ironclad. To this day whenever historical figures or events are mentioned on TV he will say that they were in the NHHT books!The Donner Dinner Party is another great book in this series and is fun, engrossing, and educational. I was worried that the story would be too gruesome for kids or it would just be a story focusing on cannibalism. However, there are as many fun moments as there are tragic. The cannibalism is handled tactfully and in the context of the story you understand why they did it!We live in Ohio so I didn't know much about the Donner party except a vague recollection of cannibalism and that there was a movie about it. I learned a lot from this book and both my son and I have a new appreciation for the American pioneers and this part of our history.I can't recommend Donner Dinner Party and the other books in the Hazardous Tales series enough. Nathan Hale is a great storyteller and I really hope there will be more books in this series. I decided to buy this one instead of borrow it from the library to show my support for the series and help it be successful. You should do the same.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Iamh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 14, 2020",
                "reviewTitle": "Sobering ‘Historical Moment’",
                "reviewText": "Sobering in its subject-matter but injected appropriately with Hale’s characteristic humour ... again, this series is an excellent means of educating children and adults alike in some of the ‘Hazardous’ moments in U.S. history ... highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gizmo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 3, 2019",
                "reviewTitle": "Well Told",
                "reviewText": "Has great detail about what happened to the people on this ill fated adventure. Graphic details and good dialogue made this a worthwhile read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$4.95",
                "sellerName": "readhearnow",
                "sellerRating": "4.5"
            },
            {
                "price": "$9.99",
                "sellerName": "Book A Smile :-)",
                "sellerRating": "5"
            }
        ]
    }
}