{
    "remaining_requests": 578,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cotillion-Brigade-Militia-American-History/dp/0996154116",
    "body": {
        "name": "The Cotillion Brigade: A Novel of the Civil War and the Most Famous Female Militia in American History",
        "price": "$18.99$18.99",
        "originalPrice": "",
        "rawPrice": 18.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cotillion-Brigade-Militia-American-History/dp/0996154116",
        "soldBy": {
            "sellerID": "ARYJRLNMPU1N5",
            "name": "Brantley Trading Company",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=ARYJRLNMPU1N5&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51kj37hMcrL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51fr5ct8pEL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Glen Craney",
            "link": "https://www.amazon.com/Glen-Craney/e/B002C1VQZ8/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Enlightning-Store",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1026,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review InD'tale Magazine Crowned Heart for Excellence: \"[A] must read! The story is beautifully told...readers will feel they are in the scenes.... a fantastic journey.\" \"[H]istorical fiction at its best: solid research combined with great storytelling.\" -- Military Writers Society of America\"The story is rich with detail, which will entrance you and, while you are distracted, circle around and cut off your escape, leaving you with no choice but to keep reading until there are no pages left to turn.... It is a book that once read, is impossible to forget. Highly Recommended!\" -- The Coffee Pot Book Club\"[W]onderfully crafted... This telling of one of the lesser known chapters in the war had this reader intrigued from page one.\" -- Hoover Book Reviews\"What a read! I am a descendant of Nancy Hart and ordered the book out of curiosity: I AM SO HAPPY I DID! The book is well researched, the prose leaps off the page; the characters so well-developed. I want to read more by this author!\" -- A.A. Christmas\"The Cotillion Brigade is the most engaging, evocative, immensely readable book I've come across in a long time... The real-life characters, rescued from the black and white history books and given a vital, gripping new life in this truly excellent book.\" -- SpleeshReads Reviews\"[Q]uite an achievement.\" -- Rosie Amber Reviews\"[N]ot just an addition to Glen Craney's collection, but his best work ever.\" -- Mark Mortensen, author of George W. Hamilton, USMC: America's Greatest World War I Hero.\"One of the best historical novels I've read this year--my first by this author. The writing is fabulous. I was hooked from the first page. Highly recommend. \"-- Natalie Solo\"I was fascinated by the descriptions of the army at the time, the decisions made by LaGrange, his capabilities, and attitude. I understand that much of these narratives are fictional, but I found them gripping nonetheless. This is a well written, well researched book about the American Civil War.\" -- ManofLaBook Reviews\"[T]he author made the characters of Nancy and Hugh and other secondary characters real to me.\" -- Robin Loves Reading Blog\"Peppered with the flames of determination, this story has moments of humor, heartbreak and proof that there is an indomitable force within one's very heart to cast off \"what is expected\" and do what one believes is right as Nannie transforms into a leader with strengths beyond the norm... This is how history should be told, in a personal way, not with facts and figures alone, but through the eyes of those who lived and died.\" -- TomeTender Reviews\"Amazing narrative.\" -- V. Williams, Vine Voice"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 13 hrs 16 mins",
            "FREE delivery February 26 - 28 on orders shipped by Amazon over $35",
            "Or fastest delivery February 24 - 26",
            "FREE pickup Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Georgia burns.Sherman’s Yankees are closing in.Will the women of LaGrange run or fight?Based on the true story of the celebrated Nancy Hart Rifles, The Cotillion Brigade is a sweeping epic of the Civil War’s ravages on family and love, the resilient bonds of sisterhood amid devastation, and the miracle of reconciliation between bitter enemies.“Gone With The Wind meets A League Of Their Own.”1856. Sixteen-year-old Nannie Colquitt Hill makes her debut in the antebellum society of the Chattahoochee River plantations. A thousand miles to the north, a Wisconsin farm boy, Hugh LaGrange, joins an Abolitionist crusade to ban slavery in Bleeding Kansas.Five years later, secession and total war against the homefronts of Dixie hurl them toward a confrontation unrivaled in American history.Nannie defies the traditions of Southern gentility by forming a women’s militia and drilling it to prepare for Northern invaders. With their men dead, wounded, or retreating with the Confederate armies, only Captain Nannie and her Fighting Nancies stand between their beloved homes and the Yankee torches.Hardened into a slashing Union cavalry colonel, Hugh duels Rebel generals Joseph Wheeler and Nathan Bedford Forrest across Tennessee and Alabama. As the war churns to a bloody climax, he is ordered to drive a burning stake deep into the heart of the Confederacy.Yet one Georgia town—which by mocking coincidence bears Hugh’s last name—stands defiant in his path.Read the remarkable story of the Southern women who formed America’s most famous female militia and the Union officer whose life they changed forever.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Brigid's Fire Press (March 13, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 399 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0996154116"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0996154116"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.34 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 1 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#23,051 in Books (See Top 100 in Books) #106 in Military Historical Fiction #431 in War Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,026 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John E Bator",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPLEUBTJCNTBY4IRUNPBQ5SUESA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H1L2OKI5A1YU?ASIN=0996154116",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars FANTASTIC READ! CLASSIC CIVIL WAR READ",
                "reviewText": "Fabulous historical drama that reads like GWTW with real characters. Craney takes the time to not only set the ideology of both sides of the Mason-Dixon line, he gets into the protagonists so deeply you feel and think as they do. He then crosses the chasm of disagreement and hatred to remind us all that we are all Americans and what that really means, especially in these adversarial times. His portrayal of the women of the times is stellar and what's long been missing from the journals of the Civil War. A must read in the style and genre of the Shaara's.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dwillis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRIJM6TQEAKFV53P2CVXAV3D3GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15EQT0NXGB4BF?ASIN=0996154116",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 17, 2023",
                "reviewTitle": "4.0 out of 5 stars Civil War Fiction",
                "reviewText": "Based on the true story of the women of LaGrange, Georgia during the Civil War, The Cotillion Brigade , by Glen Grace, unfolds the bravery and sisterhood of women left to defend their town and loved ones in it. Called the \"Nancy Harts Militia\" after a women from the Revolutionary War who defended her home against the British, the forty women, under the leadership of Captain Nancy Colquitt Hill Morgan, learned to shoot, drilled, and then faced a Yankee calvary with grace, dignity, and courage.It is also the story of Colonel Hugh LaGrange who was the Yankee officer to meet the fierceness and graciousness of the Nancy Hart Militia. The author has done his homework. You will follow the wins and losses of both the North and the South. You will share in the joys and heartbreaks of these Southern women. If you love historical fiction, this is a must read.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Classmate'72",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKBLK3ZOSWLHIUFK67UJFTG5KEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFI0NIPLORDTP?ASIN=0996154116",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Captivating Account",
                "reviewText": "The author's narrative makes the reader feel like a first hand witness to the events of this historical and tragic Civil War era time period. A must read for anyone who appreciates a well crafted journey through time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MAC Ramsey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRRH6AAYYOCOOAHP5SXA52HKT6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CBYISQX01MII?ASIN=0996154116",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent Civil War Book",
                "reviewText": "This is a wonderful book based on a female company formed during the Civil War when all the men left to fight the war. Fast moving and quick to read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bcbeads",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOFDZ2SASUPURJHF4NTICTLSBPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRQJQN30ZTSBB?ASIN=0996154116",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2022",
                "reviewTitle": "3.0 out of 5 stars Bubble gun and cotton candy, appropriate for 10-14 year olds. Engrossing but empty.",
                "reviewText": "I am not sure if this book is rates as a \"young adult\" novel, but it should be. The writing is on a level that 10 to 14 year olds would be able to comprehend. For me, it was literary bubble gum and cotton candy, delicious, but basically empty calories. Other reviewers have lauded the author's appropriate historical dialog and details. I was jarred by several anachronisms. Blue Mascara would not have been on anyone eye lashes in Georgia during the civil war, as mascara was only invented in Paris in 1872. And I am pretty sure blue mascara did not exist until the early 1960's; I remember the thrill of discovering it. Reference to someone tearing a page out of a physician's \"prescription pad\" in the 1860s also jolted me.The dialog of the northern recruits was OK, but I wonder if the author ever heard a Black person from the \"South\" speak. The speech of the \"Southern Belles\" is stilted and inane. I learned from this book that the Nancy Hart militias existed. But nothing new about the Civil war besides that. I learned more in an afternoon at Gettysburg walking around and reading the information on the monuments and the Park Service information plaques posted throughout the battlefield. I would recommend this book as \"Civil War Light\" for a middle school/ junior high reader.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4U7SEBKGE7JBNXNAD2WV4GX5GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJWUGHR6124W2?ASIN=0996154116",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2023",
                "reviewTitle": "5.0 out of 5 stars civil war experience.",
                "reviewText": "This was a wonderful book. It flows from southern women to northern brothers.If you like history this will be an interesting read. It gave an on the ground experience for people living through the civil war.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martha L Reinoehl ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMDN63NTHWK3ATCIQ2YSCRZBJCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22YBJZIPLVP8Q?ASIN=0996154116",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Enjoy reading",
                "reviewText": "Printing is too small making it hard to read for very long",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff Rasley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWMQQRM6QO5OJPYM336JCCHXICA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3J2QAKH523WN9?ASIN=0996154116",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 11, 2021",
                "reviewTitle": "5.0 out of 5 stars impeccable history & authentic dialogue",
                "reviewText": "I have been a fan of Craney's historical fiction, since reading his 2015 Fire and the Light. His research is always impeccably accurate, and my historical knowledge has been deepened about the particular period covered in each of his books. For me, the most enjoyable way to learn interesting and quirky historical facts, as well as getting reacquainted with major events and characters, is to read well-written historical fiction. The Cotillion Brigade does not disappoint.The opening dialogue of the Confederate women is so chatty, feminine, and cattily gentile, had I not known otherwise, I would have assumed the author was a woman. Gone With The Wind is a fair comparison for the authenticity of the Southern Belles' conversations. But when the story shifts to Wisconsin, and the second protagonist is a farm boy, his roughness feels just as real.The book's conceit of two heroes, Nancy, a loyal Confederate woman, who organizes the first all-female brigade for the Confederacy, and Hugh, farm-boy turned abolitionist turned aggressive Union officer, is a clever device to humanize both sides in the Civil War. It works well to keep the reader interested in both stories as the narrator shifts from one to the other, chapter by chapter, as the war approaches and then progresses on its bloody way.Some \"progressives\" might question the propriety of featuring a Confederate woman in a book published in 2021. I did. But no matter one's personal politics, we should not forget that actual human beings, who were interesting and decent in other ways, were slaveholders. That sin does not bar revealing their humanity, as long as we don't shirk from also portraying the ugly reality of slavery. Craney does not shirk. And, spoiler alert, the Union wins the war.",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$18.99",
                "sellerName": "Enlightning-Store",
                "sellerRating": "0"
            }
        ]
    }
}