{
    "remaining_requests": 611,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Billion-Dollar-Spy-audiobook/dp/B00XKA61XC",
    "body": {
        "name": "The Billion Dollar Spy: A True Story of Cold War Espionage and Betrayal",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Billion-Dollar-Spy-audiobook/dp/B00XKA61XC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ZC3Hrb7vL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "David E. Hoffman",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=David+E.+Hoffman"
        },
        "brand": "David E. Hoffman",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 6301,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From the Pulitzer Prize-winning author of The Dead Hand comes the riveting story of the CIA's most valuable spy in the Soviet Union and an evocative portrait of the agency's Moscow station, an outpost of daring espionage in the last years of the Cold War. While getting into his car on the evening of February 16, 1978, the chief of the CIA's Moscow station was handed an envelope by an unknown Russian. Its contents stunned the Americans: details of top-secret Soviet research and development in military technology that was totally unknown to the United States. From 1979 to 1985, Adolf Tolkachev, an engineer at a military research center, cracked open the secret Soviet military research establishment, using his access to hand over tens of thousands of pages of material about the latest advances in aviation technology, alerting the Americans to possible developments years in the future. He was one of the most productive and valuable spies ever to work for the United States in the four decades of global confrontation with the Soviet Union. Tolkachev took enormous personal risks, but so did his CIA handlers. Moscow station was a dangerous posting to the KGB's backyard. The CIA had long struggled to recruit and run agents in Moscow, and Tolkachev became a singular breakthrough. With hidden cameras and secret codes, and in face-to-face meetings with CIA case officers in parks and on street corners, Tolkachev and the CIA worked to elude the feared KGB. Drawing on previously secret documents obtained from the CIA, as well as interviews with participants, Hoffman reveals how the depredations of the Soviet state motivated one man to master the craft of spying against his own nation until he was betrayed to the KGB by a disgruntled former CIA trainee. No one has ever told this story before in such detail, and Hoffman's deep knowledge of spycraft, the Cold War, and military technology makes him uniquely qualified to bring listeners this real-life espionage thriller. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Politics & Social Sciences",
                "link": "https://www.amazon.com/Politics-Social-Sciences-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3377866011"
            },
            {
                "name": "Politics & Government",
                "link": "https://www.amazon.com/Politics-Government/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5571255011"
            },
            {
                "name": "International & World Politics",
                "link": "https://www.amazon.com/International-Politics-Nonfiction-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11093"
            },
            {
                "name": "Russia & Soviet Union",
                "link": "https://www.amazon.com/Russian-Former-Soviet-Union-Politics/b/ref=dp_bc_aui_C_5?ie=UTF8&node=5571273011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "11 hours and 54 minutes"
            },
            {
                "name": "Author",
                "value": "David E. Hoffman"
            },
            {
                "name": "Narrator",
                "value": "Dan Woren"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "July 07, 2015"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00XKA61XC"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,128 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #9 in Russia & Soviet Union Politics & Government #11 in Espionage True Crime #33 in Espionage True Accounts"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. D. Clemente",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWRQOWDTYPOQGY56UVYNJ2VAXGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DX2VEVLZDHZW?ASIN=B00XKA61XC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 7, 2016",
                "reviewTitle": "5.0 out of 5 stars CIA Historian Says - \"Nearly Flawless...one of the best intelligence books available. Every intelligence officer should read it\"",
                "reviewText": "This is the review from CIA Studies in Intelligence Volume 60 No.1 Unclassified EditionThe Billion Dollar Spy: A True Story of Cold War Espionage and Betrayal David E. Hoffman. (Doubleday, 2015), 312 pp., index, endnotes.Reviewed by Nicholas Dujmovic (CIA Staff Historian)The title of David Hoffman’s excellent new book, The Billion Dollar Spy, unintentionally (I think) evokes a famous item from Studies in Intelligence many years ago, “The Million Dollar Photograph.”[1] According to the late Dino Brugioni, CIA director Allen Dulles was impressed by the ability of the U-2 spy plane to dispel the Eisenhower administration’s fear that the Soviet bomber force was large enough to pose an existential threat to the United States—the so-called “bomber gap” of the mid-1950s. The key photograph, in Brugioni’s telling, was a U-2 shot of the Saratov-Engels airfield, which showed fewer bombers than had been estimated. The “bomber gap” disappeared. Dulles was said to have asked Frank Wisner, his chief of espionage and covert operations, “How much would you have paid for the information in this photography?” After a moment, Wisner answered, “About a million dollars.”Whether or not the Dulles-Wisner exchange took place,[2] the greater point is valid—that intelligence activities, though difficult and often expensive, can be extremely valuable for the national security and even, in a cost-benefit sense, a profitable economic investment. President Eisenhower in his memoir praised the U-2 program for depriving the Soviets of the capability to use “international blackmail,” and intelligence historian Christopher Andrew has claimed that the U-2 “saved the American taxpayers tens of billions of dollars and spared the world a major escalation in the arms race.”[3]Hoffman’s narrative concerns the Cold War espionage case of Adolf Tolkachev, a Soviet electronics engineer who wanted to inflict the greatest possible harm on the Soviet Union by giving the United States highly classified information on sensitive military projects. Tolkachev worked as a valuable CIA asset for seven years, from 1978 to 1985. Just how valuable was he? The US Air Force estimated that Tolkachev’s intelligence saved roughly $2 billion in research and development (121)—and this was in mid-1980, just two years into Tolkachev’s run of espionage. Moreover, as Hoffman makes clear later in the book, the overall benefit to the United States went far beyond this dollar figure.As is the style of histories published these days, The Billion Dollar Spy opens not at the beginning of the story but with a dramatic event briefly recounted—in this case, a CIA officer’s attempt in December 1982 to recontact Tolkachev, who had not been able to communicate for several months. This anachronistic approach works—the vignette is gripping and very effectively draws the reader into the stressful, high-stakes business of clandestine intelligence operations.There is much to like about this book. Almost every chapter is a gem. Hoffman begins the narrative proper with a superb summary of the Cold War espionage context, including the challenges CIA faced in trying to gather intelligence from the Soviet Union. Some of those challenges came not from the powerful efficiency of Soviet counterintelligence but from the US government itself. Former Director of Central Intelligence (DCI) Richard Helms recalls that the pressure from US policymakers “ranged from repeated instructions to do ‘something’ to exasperated demands to try ‘anything’” (7). Even so, for many years CIA operations against the Soviet Union were hamstrung by excessive caution.That began to change in the late 1960s and early 1970s, when a younger generation of operations officers, chafing under the prevailing institutional caution, developed new operational methods they argued would enable them to operate in the so-called “denied areas.” In chapter two, Hoffman introduces the Tolkachev operation as a turning point for Moscow Station, as one prize case ends (that of TRIGON, Aleksander Ogorodnik, a valuable CIA asset who was caught and committed suicide) and an uncertain one begins, as Tolkachev makes the first of several attempts to contact CIA. Chapter three details Moscow Station’s frustration at having to maintain an operational “stand-down” by a CIA leadership (DCI Stansfield Turner) that discounted the value of human spies and that wanted no “flaps.”Hoffman relates Tolkachev’s persistence in trying to make contact, the unwillingness of Headquarters to pursue a potential KGB set-up that would result in the expulsion of CIA officers, and Moscow Station chief Gus Hathaway’s arguments to Headquarters that the potential intelligence was worth the risk. Tipping the balance in early 1978 was a timely Pentagon request to CIA for any intelligence about Soviet avionics and weapons systems—precisely the information Tolkachev was offering. Contact was approved.In describing Moscow Station’s first approaches to Tolkachev, Hoffman emphasizes the care taken with every espionage case: “Running a spy was undertaken with the concentration and attention to detail of a moon shot”—nothing was left to chance. “Photographs and maps were prepared of each site; surveillance detection runs plotted; scenarios scripted and rehearsed; and the question was asked again and again: What could go wrong?” (69).Hoffman has an insider’s feel for how the spying business is conducted. His description of dialogues between the field and Headquarters (59–63) illustrates the inherent and eternal tension in that relationship. Chapter 11 (“Going Black”) is the best primer on the hows and whys of SDRs—surveillance detection routines or routes—I have seen anywhere, and it is must-reading for any would-be case officer. “On a surveillance detection run, the case officer had to be as agile as a ballet dancer, as confounding as a magician, and as attentive as an air traffic controller” (140). Hoffman covers innovation in operational technology with a passage on the Discus agent communications system—CIA essentially invented text messaging in the late 1970s—and relates the operational pros and cons of using it (111–14).At the same time, Hoffman is very good about the personal side of espionage. Chapters 12 and 13 delve into Tolkachev’s background and motivations for betraying the Soviet system and also highlight the importance for CIA of treating a spy as a human being with personal considerations, not just “a robot with a Pentax [camera].” Likewise, Hoffman’s portrayals of the CIA officers handling Tolkachev are sensitive and personal. When Tolkachev is finally caught—as a result of the treason of former CIA officer Edward Lee Howard (a well-told sub-story)—Hoffman’s straightforward and unsentimental descriptions of Tolkachev’s arrest (235–39) and sentencing, along with that of his last meeting with his son (246–47) are nonetheless almost heartbreaking.Was running such a spy worth the risk? In addition to the $2 billion estimate by the US Air Force in 1982, Hoffman points to the one-sided scorecard of its fighter jets against Iraq’s Soviet MiGs in 1991—39 to zero—and when aerial engagements in the Balkans are counted, the score becomes US Air Force 48, Soviet built fighters zero (254). All this, Hoffman persuasively argues, was the result of many factors, but one of them was the intelligence provided by a brave electronics engineer who wanted to help the West.Others have written about the Tolkachev case in shorter, more focused accounts, including former CIA officers Barry Royden, Bob Wallace, and Milt Bearden.[4] Royden emphasized the operational tradecraft used, while Wallace’s narrative is mostly about the technical means to facilitate Tolkachev’s espionage. Bearden’s treatment is episodic and after-the-fact, focusing on the counterintelligence aspects of this case among many other cases compromised in 1985 during the “Year of the Spy.” All these have value; indeed, Hoffman is aware of these sources and cites them all. Hoffman’s achievement is to integrate these threads into an impressive tapestry that includes much new information from his access to newly declassified CIA documents (remarkably including declassified cables between CIA Headquarters and Moscow Station) as well as from his contacts with Tolkachev family members and from extensive interviews with CIA participants in the operation.[5] It helps that Hoffman previously served (1995–2001) as Moscow bureau chief for the Washington Post; The Billion Dollar Spy benefits both from his knowledge of the city and from his ability to tell a compelling story that brings out the human factor in espionage operations.[6]After 10 years of reading and reviewing intelligence books as a CIA historian, I’ve seen the gamut. A few are poisonous—Legacy of Ashes comes to mind—but most are at least satisfactory, with good points as well as flaws. Very few are nearly flawless, demonstrating the author’s mastery of the subject: factual accuracy; insight into the atmospherics of the business, i.e., what it is like; and a fair assessment of what it all means. I would put Hoffman’s Billion Dollar Spy into this category of the best intelligence books available.[7] Every intelligence officer should read it.Footnotes[1]Dino Brugioni, “The Million Dollar Photograph,” Studies in Intelligence 23, no. 2 (Summer 1979): 32–33.[2]The photograph in the Studies piece was taken by a British U-2 mission in late 1959, more than three years after U-2 imagery had dispelled the “bomber gap” and during the period when CIA was trying to resolve the “missile gap”—alleged Soviet superiority in strategic nuclear-armed missiles.[3]Dwight D. Eisenhower, The White House Years, vol. II, Waging Peace: 1956–1961 (Doubleday, 1965), 547. Christopher Andrew, For the President’s Eyes Only (Harper Collins, 1995), 243.[4]Barry Royden, “Tolkachev: A Worthy Successor to Penkovskiy,” Studies in Intelligence 47 no. 3 (2003): 5–33. Robert Wallace and H. Keith Melton, Spycraft: The Secret History of the CIA’s Spytechs from Communism to Al-Qaeda (Penguin, 2008), 119–37. Milt Bearden and James Risen, The Main Enemy: The Inside Story of the CIA’s Final Showdown with the KGB (Random House, 2003), passim.[5]Hoffman makes a few of the cables available on his website, [...]. All told, CIA declassified 944 pages of mostly operational material. Curiously, none of it is posted on CIA’s public website.[6]A former CIA historian, Ben Fischer, has written a speculative article dismissing Tolkachev as a KGB deception operation; one of Fischer’s few factual statements is that Tolkachev’s workplace was too far from his home to photograph documents during the day as he claimed. Without citing Fischer or his theory, Hoffman nevertheless uses his knowledge of Moscow to demonstrate that Tolkachev could easily go home from work on his lunch break and photograph documents. Benjamin B. Fischer, “The Spy Who Came in for the Gold: A Skeptical View of the GTVANQUISH Case,” The Journal of Intelligence History 18, no. 1 (Summer 2008): 29-54.[7]My only quibble—and it takes nothing away from what Hoffman has achieved with his book—is his recounting of the Soviet gas pipeline sabotage story. CIA allegedly modified pipeline technology bound for the Soviet Union, creating conditions in 1982 that resulted in a spectacular explosion and fire. Though at least one such gas pipeline disaster occurred in 1982, CIA apparently had nothing to do with it. Policy discussions about such covert action went on for years, into 1986, but no decisions were made or findings signed, in large part because of the ethical implications. Yet it remains a persistent myth.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Dude",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL65EMITOW7344FKI73BZUK43EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAVP3CXJNYTP1?ASIN=B00XKA61XC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Worthwhile non fiction spy novel",
                "reviewText": "Some may find the true life account dry and boring but this story of the most effective espionage op a must read. A Russian guard attempted a bribe at check point Bravo shortly before the Fall of the Wall so this book hit a patriotic nerve.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charles Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMSFDF4URKWUW4KYCOGURAQ2VJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U80K323K6LF7?ASIN=B00XKA61XC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2017",
                "reviewTitle": "5.0 out of 5 stars The man definitely knew his squat thrusters, gyro-casters, and gravitrons.",
                "reviewText": "R. Royce lived in Aurora, Colorado as a boy in the summer of 1965. Oftentimes he wandered and meandered aimlessly through the paved side-streets and cobble-stone alley-ways off Colfax Avenue, searching for \"castaways;\" namely, empty glass soda-pop bottles worth 2 cents each for the deposit refund at \"Gorman's Supermarket,\" which was situated on the corner of Fulton. Sometimes he used the money he earned to buy a small waxy-white paper sack of broken cookies from \"Pretzal's Bakery.\" Or maybe an ice cream cone, three scoops for a dime at \"Jimmy's Frozen Deserts.\" Or maybe go to \"Woolworth's\" with April for penny candy. No wonder the Shamrocks' little leaguer called him \"snaggle-tooth,\" forever eating sweet snacks and treats; undoubtedly, the leading cause of tooth-decay. He didn't say it in a derogatory or demeaning manner. \"The tooth was going to fall out anyway,\" Royce rationalized, as he sped away on a sting-ray bicycle with the ape-hanger handlebars and banana seat. To add insult to injury, he wouldn't discover that he was near-sighted and couldn't see very far away, until four years later, when he couldn't read the scoreboard from the bleachers at a baseball game in Oklahoma. It was a wonder how he ever caught Schofield's practice pitches on the front lawn. Once, the Altura trailer-court manager saw him walking down down, crossing his path. Old Man Sealy called out and immediately attracted Royce's attention, saying \"Look what I found!\" as he reached into the cavernous depths of one of his deep, baggy pants pockets and extracted a round, smooth disk-shaped nugget. R. had been impressed by the shining glint in his eye and the gleaming golden metal object he held out. His father and Mr. Sealy sometimes went panning for unusual stones in the mountain streams. Early mornings, Royce and Schofield would catch the uptown bus to Denver to pick up a supply of several half-dozen size packages of freshly-baked glazed donuts from \"Mr. Doughnut,\" then sell them to people they encountered along the return route as they played and walked back home. Typically, they sold-out everyday, and made a tidy profit that summer. Sometimes on Saturday afternoons, they would go to the movies at the Fox Theater with the other kids in the neighborhood. They would all be seated together in the same center row, their wide eyes big and fixed on the enormous silver screen in anticipation of something wonderful or incredible. They saw flashy beach movies and wild western shoot-outs. They became Annette Funicello and Wyatt Earp fans. Surprisingly, Frankie Avalon appeared \"live\" in person on the theater stage during intermission one day. He talked about the best time of his life. At the time, most of the kids did not realize that he was actually the film star they had just seen in the movie they had just watched. \"They were just too young and innocent to make the connection,\" he thought, years later. It was then and there in that mostly empty void of an afternoon matinee movie theater, the sudden realization that \"all is fair in love and politics\" began to dawn on him. Royce's mother would make batches of popping-corn for them, filling up half of the large brown-paper grocery bag for the kids to carry into the show as a healthy snack. Decades later, when Royce visited \"the old neighborhood\" to see if any of the neighbors were still living there, he saw Schofield, all grown-up now, who'd asked if Royce's mom still makes the same tasty bacon-grease flavored popcorn that she did when they were kids. Royce said, \"Probably so.\" Anticipating a cautionary tale, he went on to say that he doesn't go to the theater and pay the price of admission in silver dollars anymore. When I first began reading the Hoffman book, I immediately thought that the story could just as well have been about Edward Snowden, the former NSA federal employee who fled the U.S. not too terribly long ago, wandered around the world, and wound up in Russia. He was the person in the news who had exported a boat-load of top-secret, classified, and otherwise confidential information when he left. It just goes to show you how one disgruntled employee can ruin your whole day. Instead of snapping photographs of official documents with some sort of miniature \"Kodak\" spy camera and passing along rolls of unexposed film to dubious, shadowy characters, he must have quite simply uploaded umpteen tera-bytes of sensitive computer files at a time to the world-wide web, also known as \"the internet,\" in a matter of seconds all in his spare or leisure time, posting them to anonymous \"clouds\" of data, the files fully accessible by anyone, anywhere in the world almost instantaneously by email. Then it dawned on me, \"His book will never be published in Russia.\" The reason is because Russian leaders greatly value their secrets of state, their own privacy and confidentiality much much more highly than the right of the people to know. In fact, sadly enough, I seriously doubt if anyone in the West will hear from him ever again. The Billion Dollar Spy, by author David E. Hoffman, published in 2015 is a well-documented, non-fictional account of CIA and KGB intelligence-gathering activities and collaboration in Moscow and Washington D.C. during the 1980's, which culminated in the U.S. invasion of the Persian Gulf in 1991, all of which has had tremendous repercussions and consequences felt even today--like the aftershocks of a major earthquake. As we all know, when diplomacy fails, military action often takes its place, as the military-industrial complex \"marshals their forces.\" From what the average person may conclude from reading this book, standard U.S. military equipment, such as fighter aircraft has vastly increased its range and capability, since U.S. experts have been looking over the shoulders, as it were, of Soviet engineers, scientists, and technicians to see what they have on their drawing boards and have built into prototypes, newly created designs, mock-ups, and working models. Then, they have reverse-engineered these \"virtual reality\" creations into their own uniquely superior fabrications, overcoming newly-found deficiencies, and exploiting now-known weaknesses and flaws. As proof of this \"American ingenuity,\" the author cites the overwhelming success of the U.S. military when they invaded Kuwait and Iraq in the Persian Gulf war. True, the F-15 fighters might have destroyed Russian-built MIG's dog-fighting in the open skies above Iraq, but the statistics fail to consider a few key facts: First, the Iraqi pilots were undoubtedly inadequately trained and the MIG's they were flying were most likely improperly maintained, under-powered, and without the latest technology available and critical equipment aboard, including missiles, guidance systems, and adequate radar defense mechanisms. You'd think, if they fly military aircraft, they must know their squat thrusters, gryro-casters, and gravitrons! Apparently, what they flew were military aircraft suitable only for air-shows and parades, and then to be flown only with an abundance of caution out of concern for the safety and welfare of pilots and spectators alike. So, if the premise is true, that the U.S. military establishment stole their advanced equipment designs from the Russians, then it obviously follows that the Russian spy who sold the CIA this type of information, must have given it away with the blessing of the KGB, since they would have known well in advance that the F-15's would eventually be opposed by the MIG's of Iraq and a bold, brash, and brazen Saddam Hussain. The Russian intelligence community merely wanted to sit back and watch the ensuing fireworks and observe the most advanced fighter planes the world has ever seen in war-time action against their obsolete MIG's out of pure curiosity. After all, high-stakes poker players don't usually go around showing their hands to everyone they meet.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jerry G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2023",
                "reviewTitle": "AMAZING STORY",
                "reviewText": "The real deal --- true story, reads like fiction, well told. A very good read...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 26, 2023",
                "reviewTitle": "Chilling",
                "reviewText": "Lovely stuff.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mitul Patel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 1, 2023",
                "reviewTitle": "A nonfiction spy thriller that will enthrall intelligence aficionados and casual readers alike",
                "reviewText": "Published in 2015, The Billion Dollar Spy is an immersive nonfiction thriller that tells the incredible true story of the CIA’s most valuable Soviet asset of the Cold War era. Written by Pulitzer Prize-winning journalist David E. Hoffman, this page-turning spy biography brings to light classified details of one of the most important intelligence coups in US history.Hoffman gained unprecedented access to declassified documents and key figures involved to reconstruct the riveting saga of Adolf Tolkachev, a Soviet scientist who spied for the United States from the 1970s until his death in 1986. Tolkachev was an engineer who worked in a top-secret design laboratory. He was an expert in airborne radar and worked very deep inside the Soviet military apparatus. Through meticulous research and vivid storytelling, Hoffman transports readers back in time to experience the high-stakes cat-and-mouse game that Tolkachev played with the KGB as he risked everything to provide top-secret information to the CIA.The book opens by introducing Tolkachev, an electronic engineer working at a top-secret Soviet military installation outside Moscow in the 1970s. Driven by discontent with the oppressive Soviet system and desire to promote world peace, he makes contact with the CIA through anonymous letters. Thus begins a years-long covert relationship that yields a treasure trove of intelligence on Soviet weapons technology, some of which the KGB was unaware had been compromised.Hoffman skillfully captures the nuanced psychology of Tolkachev, portraying him as a complex figure motivated by idealism yet also ambition and desire for prestige in spying. Through documents and firsthand accounts, the reader gains insight into what drove Tolkachev to undertake the immense personal risks of being a mole, even as his actions remained mysterious to his family and coworkers. His motivations feel profoundly human despite the extreme stakes.Meanwhile, the CIA case officers who directed Tolkachev - collectively referred to as \"Ramon\" - receive in-depth examination. Hoffman reconstructs their ingenious spy craft methods for secretly meeting Tolkachev in dead-drops and brush passes, from disguise to handling one-time pads for encrypted messages. The operations were handled meticulously yet often nearly went wrong, keeping readers on the edge of their seats.Tolkachev’s rolls of microfilm provided America with invaluable strategic advantage during the Cold War’s most perilous years, exposing everything from new Soviet bomber designs to weaknesses in their air defense systems. Using formerly classified documents, Hoffman explains the profound impacts on US policy and defense programs. At the same time, the KGB was always hunting for the mole, conducting surveillance on all CIA agents in search of the link.Woven throughout the geopolitical backdrop is the human drama. Tolkachev lived a constant double life, torn between family and fatherland yet unable to share his secret work even with his wife. Meanwhile, the CIA officers struggled with distance and secrecy from their handler roles. In one heart-wrenching scene, a case officer's attempt to visit Tolkachev's family without revealing their connection highlights the personal toll of their dangerous work.Tragically, in 1986 the KGB finally closes in on Tolkachev. In a nail-biting finale, Hoffman chronicles the spy's final risky dead-drops and the KGB's surveillance catch-up before they discover his identity. The epilogue explores the aftermath, from changed US-Russia diplomatic relations to the enduring secrecy surrounding Tolkachev even after the Cold War's end. Throughout, Hoffman handles potentially dry historical and technical subjects with pace and resonance.What makes The Billion Dollar Spy such a tour de force is Hoffman's uncanny ability to imbue true events with all the pulse-pounding suspense of a masterful novel. From first page to last, he commands rapt attention through intimate character portraits, globetrotting locales and propulsive tension that seems to defy the known conclusion. The book has set a new high bar for the nonfiction spy genre.In summary, David E. Hoffman has produced a nonfiction spy thriller that will enthrall intelligence aficionados and casual readers alike with its brilliant reconstruction of an espionage Cold War epic. Bringing to light secrets kept hidden for decades, The Billion Dollar Spy shines a revealing light on sacrifice, loyalty and geopolitical upheaval through the lens of one man's courageous betrayal. With its breakneck pacing, vivid storytelling and profound research, it stands out as a true tour de force of narrative nonfiction. This landmark work has ensured that Adolf Tolkachev's legacy will finally receive the recognition it deserves.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon james.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 2, 2020",
                "reviewTitle": "Brave",
                "reviewText": "Very good reading, just shows how brave some people are and how they feel about their country. Well researched and we'll written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blue Cyprinus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 28, 2020",
                "reviewTitle": "10/10",
                "reviewText": "Outstanding writing. I was pleasantly surprised by the subject matter's authenticity. If a writer hasn't taken the time to really understand this esoteric field, they can easily turn off folks in the industry. Great writing and storytelling and a hell of a true spy tale! Actual case officers like this book and the various legacy Moscow Station Chiefs are today internally regarded as icons. The only book I consider marginally better than BDS is MacIntyre's THE SPY AND THE TRAITOR. And not by much. But BDS is 10/10.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}