{
    "remaining_requests": 663,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Goal-Business-Graphic-Novel/dp/0884272079",
    "body": {
        "name": "The Goal: A Business Graphic Novel",
        "price": "$19.47$19.47",
        "originalPrice": "",
        "rawPrice": 19.47,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Goal-Business-Graphic-Novel/dp/0884272079",
        "soldBy": {
            "sellerID": "A3RHM0KOS8KVQ3",
            "name": "Luxifi",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A3RHM0KOS8KVQ3&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71dr5HnxcZL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Eliyahu M. Goldratt",
            "link": "https://www.amazon.com/Eliyahu-M-Goldratt/e/B000APWH4C/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Luxifi",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 819,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review The Goal is the #1 business book of all time and the graphic adaptation makes this timeless classic and its powerful ideas even more accessible. If you only read one business book, it should be this one. --Verne Harnish, Founder Entrepreneurs' Organization (EO) and author of Scaling Up (Rockefeller Habits 2.0)The Goal changed the lives of generations of professionals--no other book influenced my career more. --Gene Kim, co-author of The Dev Ops Handbook and The Pheonix ProjectA compelling adaptation of Eli's seminal work. This book should be required reading for CIOs, CTOs and technologists the world over. --Kevin Behr, Chief Science Officer at PraxisFlow and co-author of The Phoenix ProjectBrilliant delivery!! True to Eli's vision, this go-to book to help your business stop struggling and start growing. Clear step-by-step techniques show your team how to turn things around so you can achieve prosperity. --Drew Greenblatt, CEO of Marlin Steel About the Author Eliyahu M. Goldratt was an educator, author, physicist, philosopher and business leader. He is best known as the father of the Theory of Constraints (TOC), a process of ongoing improvement that continuously identifies and leverages a system's constraints in order to achieve its goals. As a consultant and advisor to major corporations and government agencies around the world, Dr. Goldratt was heralded as a guru to industry by Fortune magazine and a genius by Business Week. His first business novel, The Goal: A Process of Ongoing Improvement, has been a bestseller since 1984. With more than 7 million copies sold worldwide, it is recognized as one of the bestselling business books of all time. He authored ten other books, including the business novels, It's Not Luck (the sequel to The Goal), Critical Chain, Necessary but Not Sufficient and Isn't It Obvious?. He also developed TOC-derived tools such as Drum-Buffer-Rope, Critical Chain Project Management (CCPM) and the Thinking Processes, and continued to advance the TOC body of knowledge until his death in 2011."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs 26 mins",
            "FREE delivery February 29 - March 4 on orders shipped by Amazon over $35",
            "Or fastest delivery February 26 - 28"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Alex Rogo is a harried plant manager who has been given 90 days to save his failing factory. If he doesn't improve the plant's performance, corporate headquarters will close it down and hundreds of workers will lose their jobs. It takes a chance meeting with Jonah, a former professor, to help him break out of his conventional thinking and figure out what needs to be done. As Alex identifies the plant's problems and works with his team to find solutions, the reader gains an understanding of the fundamental concepts behind the Theory of Constraints. Visual and fun to read, The Goal: A Business Graphic Novel offers an accessible introduction to the Theory of Constraints concepts presented in The Goal, the business novel on which it was based. The Goal is widely considered to be one of the most influential business books of all time. A bestseller since it was first published in 1984, the business novel has sold over 7 million copies, been translated into 32 languages and is taught in colleges, universities, and business schools around the world. Named to Time magazine's list of the 25 Most Influential Business Management Books, it is frequently cited by executives as a favorite or must-read title.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Business & Money",
                "link": "https://www.amazon.com/Business-Money-Investing-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3"
            },
            {
                "name": "Management & Leadership",
                "link": "https://www.amazon.com/Management-Leadership-Business-Investing-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2675"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ North River Press Publishing Corporation (August 8, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 143 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9780884272076"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0884272076"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.9 x 0.7 x 9.9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#38,132 in Books (See Top 100 in Books) #7 in Organizational Change (Books) #24 in Production & Operations #493 in Business Management (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 819 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John W. Pearson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFH7C7W33XGQ5MDEXACS2OPHVCIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3J7QODQTR4XTM?ASIN=0884272079",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2020",
                "reviewTitle": "5.0 out of 5 stars I Finally Read the #1 Business Book!",
                "reviewText": "Yikes. File this under “Really, Pearson? You’ve never read this top business book? And you call yourself a book reviewer?”This past spring here in the bunker, a colleague emailed me and asked if I had ever reviewed “The Goal” by Eli Goldratt. Reviewed it? I’d never even heard about it. (Yikes). He recommended this bestselling business book—and I immediately ordered it. He said it “reads somewhat like a Lencioni novel and is relevant for every organization and leader.”But…full confession. I cheated and ordered the business graphic novel of “The Goal.” Big print and pictures. Just 130 pages. This “Introduction to the Theory of Constraints” will be immediately applicable to anyone with too many moving parts, too many spinning plates, too much or not enough inventory, and keeping the whole team moving in the right direction—at the right pace.How did I miss this important book? Apparently, others have missed it also. Read the front page story in the Aug. 21, 2020, edition of The Wall Street Journal: “Why Are There Still Not Enough Paper Towels?” (The answer: blame lean manufacturing.) Maybe P&G didn’t make “The Goal” required reading. (Jeff Bezos does.)Verne Harnish, author of my 2018 book-of-the year, “Scaling Up: How a Few Companies Make It…and Why the Rest Don’t (Mastering the Rockefeller Habits 2.0),” gushes: “The Goal is the #1 business book of all time and the graphic adaptation makes this timeless classic and its powerful ideas even more accessible. If you only read one business book, it should be this one.”The author, Eliyahu M. Goldratt (1947-2011) is known as the father of the Theory of Constraints (TOC), “a process of ongoing improvement that continuously identifies and leverages a system's constraints in order to achieve its goals.” A bestseller since 1984, the book has sold more than seven million copies worldwide.“The Goal” is one of Time Magazine's “25 Most Influential Business Management Books.” (I’m only half-way through that list. Yikes, again.)The author’s business novel approach is brilliant. The interesting (and often humorous) story makes TOC understandable.Watch for:• 3 measurements• Bottlenecks and non-bottlenecks• Wrong assumptions: “workers must produce 100 percent of the time…”• Maximum stupidity (the difference between utilizing a resource versus activating a resource): “So running a non-bottleneck machine to its maximum is an act of maximum stupidity.”• POOGI (Process of OnGoing Improvement): “There is always room for better results.”• The 5 Focusing Steps of the Theory of ConstraintsTechnical? Yes. You may not manage an industrial plant, but you might lead a Scout or family hike one day with a dozen campers who hike at different speeds. Insightful? Yes—the real life hiking example turns complexity into a manageable process and cleverly explains The Theory of Constraints.Did I mention this? “Jeff Bezos has made “The Goal” required reading for his top executives at Amazon, where it has been called ‘a bible’ for the team behind the company’s fulfillment network.” And “Fortune Magazine” compared “The Goal’s” leading character to “Obi-Wan Kenobi instructing Luke Skywalker on the use of the force.”Hopefully this is enough to inspire you to read the book—or delegate the reading of the book to someone on your team.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "preetam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWBDQQRDRX6FMQTS3G27WEBT4DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CJPL14AZL7ZV?ASIN=0884272079",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Fun to read a comic and the pictures give perspective.",
                "reviewText": "Comical approach kept me engaged. I would have gotten bored otherwise. I am not a fan of long text only books. This was amazing but to be honest, I got an introduction to this in the book \"The Phoenix project\"",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRERGJABVHSALRFIVJ3UST3S3NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S8VXO50PY4FU?ASIN=0884272079",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2019",
                "reviewTitle": "4.0 out of 5 stars A unique and entertaining way to read about business",
                "reviewText": "This book uses a comic book framework to explain the theory of constraints. It’s based on a manufacturing plant but it applies to any business. You have to do the translation yourself though, and that’s my only nitpick. Working in marketing for a software company, we aren’t using machines to produce physical goods. But the core ideas still apply — you have to identifty the goal that represents success, pinpoint bottlenecks, and optimize them above all else. None of the ideas were revolutionary, but it was well worth spending 90 minutes to remind and refocus myself on these foundational ideas.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emmett W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIWQXP3DF7QTE7Z7GKHGLAFV4FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RT1O6TWBI3BK?ASIN=0884272079",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Quick and Interesting Read",
                "reviewText": "This graphic novel is a quick read and easy to understand. I learned some good tips from it. It has some very applicable lessons.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stacie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4HAXNMFP4MFBWLBNZYWX5DYY7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R168DJ152C12QL?ASIN=0884272079",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 16, 2022",
                "reviewTitle": "5.0 out of 5 stars Love this book",
                "reviewText": "It is a great supplement or actual book for you to understand the novel. The novel is a rough, and long read that was really dated in the talk, but this graphic novel helps to clarify and make sense of the actual book. I read the book and then I got this as a supplement and it brought all of it together",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr. Jeff",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJOD6JSMSNYSQCSF5ZH56ON4L7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36G2IR48HEB3H?ASIN=0884272079",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2021",
                "reviewTitle": "5.0 out of 5 stars Quick Read",
                "reviewText": "I really like the original version of The Goal, but this is a much quicker way to present the material. I don't think the pictures add anything to the education but it does keep it interesting and it might otherwise become too dense.There isn't as much repetition as the original, so if you need to have multiple examples before something clicks then you may still want the old version. I have also had people say they can't relate the specific example in this book to their own situation, which is another reason to use the long version. If you just want to get a quick overview for the Theory of Constraints then this will help start the conversation.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jamisco",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE37LKUZ5A4IGUHOG53ZE5WRW5GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFK7Y19Y7SSVA?ASIN=0884272079",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2022",
                "reviewTitle": "3.0 out of 5 stars Very Shallow, seems like a book for children",
                "reviewText": "Although the book does give you some insight into maximizing production. It feels rather shallow, it reads more like fiction book than a book that is meant to teach you something. This is a book I would give to a 6 grader to explain concepts such as bottlenecks and constraints.If your looking for a book that really dives deep into the intricacies if running a plant, this is not it",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Felix Delgado",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI5ALQXBYYS546TBHNVG2R775MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XZLXW1HJEBKB?ASIN=0884272079",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2022",
                "reviewTitle": "5.0 out of 5 stars Great way to remind yourself about the novel",
                "reviewText": "I read \"The Goal\" shortly after it came out. As I read various business books from time-to-time, this book has always held my interest and I have referred to it over the years. The graphic novel is a great way to shorten the time to get refamiliarized with the material. I think that the book has more details, but this is a great way to read this classic book in a short amount of time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Remi Martin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 29, 2021",
                "reviewTitle": "\"La meta\", una lectura obligada para administradores y equipos de trabajo.",
                "reviewText": "\"La meta\" es una historia de administración escrita por Eliyahu M. Goldratt (1947-2011), quien fue un consultor de negocios cuya teoría de las limitaciones (restricciones) ha servido como modelo para la administración de sistemas y negocios.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "raghunandan Jagdish",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 20, 2022",
                "reviewTitle": "good book to review the goal",
                "reviewText": "The book is well paced read in a few hours to recap the story of the goal with Alex rego and Johanna’sThe cost of the book is a bit steep though.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angus Lyon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 30, 2022",
                "reviewTitle": "Fun quick read that made illustrated the solution process well",
                "reviewText": "Not just for manufacturing. Relevant to services as well! As you read it you can swap machines for people / processes / externalities to make it relatable. If not, just follow the story through and all becomes clear by the end",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laurent GERARD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 22, 2021",
                "reviewTitle": "Très interéssant",
                "reviewText": "Excellent : les bases de la TOC rapide à lire. Nickel",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dak",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 17, 2019",
                "reviewTitle": "A great clean pass through the center of the theory of constraints",
                "reviewText": "This slimmed down version of the original business novel is, in some ways, an improvement. The core message is more clearly revealed by stripping away some of the wordiness of the original and focusing on ... the goal.Recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}